{"selfpaced": false, "topic_name": ["Online Education"], "description": "\n\n                    \n                    \n                    El curso de “Aprendizaje en la nube” es un espacio de aprendizaje colaborativo que tiene el propósito de dar a conocer las oportunidades que nos brinda “la nube” para crear experiencias de aprendizaje efectivas e innovadoras, por medio de herramientas web que ofrecen multitud de posibilidades para almacenar datos, compartir información y crear contenidos multimedia.\r\nEl curso de “Aprendizaje en la nube” te dará la oportunidad de integrarte al campo del “Cloud Computing” brindándote conocimientos de aplicación directa para crear experiencias innovadoras en tu ambiente de aprendizaje o formación laboral. Las herramientas que aprenderás en el curso son adaptables, innovadoras y brindan servicios gratuitos. Optimizando costos y tiempo en los procesos de formación. \n\n                                            Syllabus\n                         \r\n\r\nQué es la nube?\r\nCloud Computing\r\nAprendizaje en la nube\r\nBeneficios y aprovechamiento del aprendizaje en la nube\r\nHerramientas de Aprendizaje en la nube\r\nHerramientas de Presentación: Prezi, Cacoo, Glogster\r\nHerramietas de Documentación: Dropbox, Dipity y blogger\r\nHerramientas de Colaboración: Google Drive, Padlet y Wikispaces\r\nHerramientas de Comunicación: Skype, Podomatic y redes sociales\r\nHerramientas Multimedia: GOanimate y Xtranormal\r\nHerramientas Interactivas: Educaplay y Quizrevolution\r\n\r\n \r\n \n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Aprendizaje en la Nube, Herramientas web en el Aula", "price": 0, "instructors": "Miguel Morales and Rocael Hernández", "institution_name": ["Galileo University"], "commitment": "", "subject_name": ["Education & Teaching"], "course_url": "http://telescopio.galileo.edu/curso/aprendizaje-en-la-nube/", "duration": null, "language_name": ["Others"], "provider_name": ["Independent"], "start_date": "2015-09-28T00:00:00Z"}