{"selfpaced": false, "topic_name": ["Online Education"], "description": "\n\n                    \n                    \n                    Effective measures of performance and assessment are a crucial component of any virtual program. Teachers and administrators must understand both the myths and challenges of assessing performance virtually, administering standardized testing with geographical challenges, and complying with state and local requirements to make sure students are meeting requirements. This course will discuss student performance in a virtual classroom, formats of virtual assessments, assessing special populations, including at-risk, gifted, and special needs students, data analysis of virtual course gradebooks, and learning management systems as related to performance and assessment. This course will enable teachers to see the importance of communication and organization in managing virtual caseloads, and monitoring student learning remotely through the effective use of learning management system features.\n\n                                            Syllabus\n                        Week 1: The Importance of Performance and Assessment in the Virtual ClassroomWelcome to the course! Begin by watching the welcome video and familiarizing yourself with the course. This week, we will discuss the importance of performance and assessment in the virtual classroom. We will also review math topics that can be applied to grade book management in your own virtual course.Week 2: Assessing Students Virtually, Academic Integrity, and Administering High Stakes Testing at a DistanceIn week two, we will address the concerns regarding academic integrity as well as the challenges that have arisen due to the nature of the environment and how we can combat some of these challenges. We will also be taking a look at how to virtually assess a student's performance and how to administer high stakes tests in a virtual setting. Week 3: Data Analysis and Grade book Management in the Virtual ClassroomIn week three, we will cover some of the best practices for data analysis and grade book management and the intended and unintended consequences for using these types of practices. Week 4: Performance and Assessment for Special Populations: Gifted, At-Risk, and Special Needs StudentsIn week four, we will be taking a look at the different ways in which we will need to assess students based upon the type of student that they are, as well as how we can accommodate their needs and work together with them. Week 5: Instructional Feedback, Monitoring Performance and Assessment Using TechnologyIn this last week, we will discuss the importance of instructional feedback in this type of online setting, how instructional feedback affects a student's performance, monitoring their performance, and assessing their performance using technology. \n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Performance Assessment in the Virtual Classroom", "price": 0, "instructors": "Racquel Hernandez", "institution_name": ["University of California, Irvine"], "commitment": "2-4 hours", "subject_name": ["Education & Teaching"], "course_url": "https://www.coursera.org/learn/performance-assessment", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}