{
    "selfpaced": true, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    This course is presented in both English and Hindi. Videos will feature Hindi subtitles.\n\nThis course offers an overview of contemporary India and explores its role as one of the dominant economic and military powers of Asia. We begin with a discussion on India as a multilingual society.  The entire course will be available in both English and Hindi.\n\nThe central focus of the course is an examination of contemporary issues in India. This includes perspectives on how Indian culture and language are being affected by the boom in technology; sections on politics and nationalism; economics and the implications of recent moves toward liberalisation of the economy; and security, international relations, and regionalism. In addition, we will examine India’s role in South Asian politics and current issues relating to its regional neighbours in Asia. The aim of the course is to provide students with a comprehensive and wide-ranging overview of India in order that they may better understand its role in the world.\n\nयह पाठ्यक्रम हमें आधुनिक भारत के बारे में एक संक्षिप्त विवरण देता है। और उसके साथ यह भी दर्शाता है कि किस तरह से भारत आज एशिया का एक प्रभावशाली आर्थिक और सैन्य सत्ता बन गया है। इस पाठ्यक्रम की शुरुआत हम भारत के बहुभाषी समाज पर चर्चा से करेंगे।   \nयह पाठ्यक्रम हिन्दी और अंग्रेज़ी दोनों भाषाओं में उपलब्ध होगा।\nइस पाठ्यक्रम का केंद्र बिन्दू भारत के समकालीन मुद्दों का विश्लेषण करना है। इस में भिन्न-भिन्न दृष्टिकोणों से विचार प्रस्तुत किये जायेंगे कि भारतीय संस्कृतियाँ और भाषाएँ किस तरह से टेक्नोलोजी में आई तेज़ी से प्रभावित हुईं हैं। इसके अलावा हम इन विषयों के बारे में बातचीत करेंगे: राजनीति और राष्ट्रवाद, अर्थशास्त्र और अर्थव्यवस्था के उदारीकरण से हुये परिवर्तन का असर, सुरक्षा, भारत की विदेश नीति और क्षेत्रवाद। इन सब के साथ हम यह भी देखेंगे कि दक्षिण एशिया की राजनीति में भारत ने क्या भूमिका निभाई है और उसके पड़ोसी देशों के संबंध में विचार करेंगे। इस पाठ्यक्रम का उद्देश्य है विद्यार्थियों को भारत के बारे में विस्तृत जानकारी देना ताकि वे ज़्यादा अच्छी तरह से भारत और विश्व में भारत की भूमिका को समझ सकें।\n\n                                    ", 
    "end_date": "2015-05-05T00:00:00Z", 
    "title": "ANU-INDIA1x: Engaging India", 
    "price": 0, 
    "instructors": "Peter Friedlander and McComas Taylor", 
    "institution_name": [
        "Australian National University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/engaging-india-anux-anu-india1x-0", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-04-29T00:00:00Z"
}