{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    Are you interested in other countries? Do you want to study and understand other cultures? This free online course will take you on a journey through a number of periods from the medieval to the modern day, from Russia to Europe and all the way to Latin America.\n\nExplore eight countries\n\nTogether we’ll explore eight countries by looking at some of the slogans, books, monuments and images which emerged from them over different historical periods. You will learn about the following topics:\n\n\n  \n    Slogans: Franco Basaglia’s La libertà è terapeutica; Dolores Ibárruri’s ¡No pasarán!; Karl Marx and Friedrich Engels’s Proletarier aller Länder, vereinigt euch!\n  \n  \n    Books: Victor Hugo’s Les Misérables; Dante’s Inferno; Ladislav Fuks’s The Cremator\n  \n  \n    Monuments: The Holocaust Memorial; The Obelisk of Luxor; The Bronze Horseman\n  \n  \n    Images: Bouabdellah’s video artwork ‘Belly Dancing to the Marseillaise: French Identity in Video Art’;  Shepherd’s map of the Habsburg Empire;  The Quauhquechollan’s cloth painting\n  \n\n\nLearn with 12 cultural experts\n\nYou’ll learn with a team of 12 academics from the University of Bristol’s School of Modern Languages. They are experts on different countries and passionate about the study of culture.\n\nThey will offer you an understanding of how language and objects/artefacts can reveal insights into nations. You’ll get the chance to discuss these with other learners online, and enjoy further reading, writing and research opportunities.\n\nThis four-week course will give you a taste of the university’s BA in Modern Languages where cultural studies plays a key role in the degree alongside the study of foreign languages.\n\nThis course is partly funded by Routes into Languages. You can find out more about what to expect in Gloria Visintini’s post for the FutureLearn blog: “What do three slogans tell us about the cultures they come from?”\n\n\n                                    ", 
    "end_date": "2016-03-21T00:00:00Z", 
    "title": "Cultural Studies and Modern Languages: an Introduction", 
    "price": 0, 
    "instructors": "Gloria Visintini", 
    "institution_name": [
        "University of Bristol"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/cultural-studies?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-02-22T00:00:00Z"
}