{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    Ce cours présente les grandes tendances et évolutions de la criminalité, ce qui définit la criminalité dans une société et ce qui influence son évolution. L'État établit de nouvelles interdictions qu'il assortit de sanctions pénales au fur et à mesure de l'évolution de ses propres intérêts, mais surtout pour répondre à de nouvelles formes de criminalités, car le crime est un phénomène aussi évolutif que protéiforme.\r\nIl n'existe donc pas UNE histoire de la criminalité, mais plusieurs, aussi n'est-il pas possible d'être exhaustif. Ce cours parcourt l'histoire en se concentrant sur ce qui peut être mis en évidence par une approche historique sérieuse, au travers de quelques séquences spécifiques : première globalisation du crime dans les années 1880, mafias, Marseille et Chicago, criminalité et terrorisme, guerres criminelles, cybercrime, criminalité financière et finance criminelle ...\r\nL'objectif de ce cours est de fournir un outil susceptible d'éclairer le public sur les grandes évolutions criminelles qui ont, d'une certaine manière, été à l'origine de la construction de notre Etat et ont fait notre histoire ; d'amener à comprendre que la perception de la violence et du crime a évolué au cours du temps.\r\n \n\n                                            Syllabus\n                        Semaine 1 : L'émergence de la criminalité globaleAu commencement était le crimeLe crime fait l'histoireLa globalisation du crime 1880Globalisation du crime : les mafias 1Mafias 2Copies conformes\r\nSemaine 2 : Le crime organisé en FranceMonter au braquoMarseille, ParisLyon, Grenoble et les caids de banlieueLa french connectionPizza, chinese et autres connectionsRèglements de comptes\r\nSemaine 3 : Guerres et crises financières criminelles Le temps des guerres criminellesLes crises financières criminelles 1980/1990Les crises financières criminelles 2007 et suivantes….Finance criminelle : victime ou complice ?\r\nSemaine 4 : Terrorisme(s)Terrorisme ou terrorismes ?Terrorisme et ÉtatTerrorisme et État 2Terrorisme et État 3Terrorisme et État 4RAF, Brigades rouges, AD…\r\nSemaine 5 : Les guérillas Les guérillasGuérillas dégénérées et terrorisme mafieuxL’émergence d’Al QaidaL’après 11 septembreDu terroriste importé au terroriste enracinéDes loups pas si solitairesL'Etat Islamique/Daech\r\nSemaine 6 : Cybercrime, cyberguerre, cyberterrorismeCybercrimeLe cœur caché du réseauSnowden et aprèsDark web\n                                    ", 
    "end_date": "2016-06-06T00:00:00Z", 
    "title": "Dernières nouvelles du crime", 
    "price": 0, 
    "instructors": "Alain Bauer", 
    "institution_name": [
        "CNAM"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.fun-mooc.fr/courses/CNAM/01006S02/session02/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-04-25T00:00:00Z"
}