{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    In ethnic and political conflicts around the world, public spaces are used by diverse groups of people, to express their identity and protest about their beliefs:\n\n\n  in Northern Ireland, contests over flags, parades and memorials have been frequent during the peace process;\n  as South Africa developed a new democracy, the management of demonstrations by the police became a key issue;\n  in the post-soviet era, Eastern European countries have slowly come to terms with the rights of people to express their political opinions in public spaces;\n  and post-9/11, western democracies have struggled to define public spaces for their large Muslim communities.\n\n\nHow is freedom of expression managed in highly divided societies, particularly when they have a history of political violence?\n\nDiscover the role of public space in identity and protest\n\nThis free online course will introduce you to the key issues around the use of public space to express identity.\n\nWe’ll start by looking at the nature of social groups, and the importance of identity and public spaces in politics around the world, including the Arab Spring, the Occupy Movement and the Civil Rights Movements.\n\nWe’ll then examine why understanding public space is important, looking at symbols, parades and memorials. We’ll examine well-documented examples, including the learnings that have arisen from the Northern Ireland peace process.\n\nYou’ll be asked to create your own digital artefact, which illustrates an organised public event that you have experienced or are interested in, and share it with other learners around the world.\n\nFinally, we’ll explore the role of human rights and public policy, concluding by returning to the comparative frame to examine key lessons for understanding conflict transformation in divided societies.\n\n\n                                    ", 
    "end_date": "2015-10-26T00:00:00Z", 
    "title": "Identity, Conflict and Public Space", 
    "price": 0, 
    "instructors": "Dominic Bryan", 
    "institution_name": [
        "Queen's University Belfast"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/identity-conflict-and-public-space?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-09-14T00:00:00Z"
}