{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    Ignorance! provides a comprehensive framework for understanding how people think about unknowns, how they deal with them, and how certain kinds of ignorance are enshrined in cultures and social institutions. Over 5 weeks, we’ll be taking you on a tour through ignorance in all its varieties and guises. Ignorance is everyone’s business. Ignorance is relevant to every discipline and profession, and to everyday life, both at work and at play. No matter what domain you study or work in, this course will have something to offer to you.\n\nWe will explore questions about ignorance such as: Where does ignorance come from? How do we impose ignorance on each other, and even on ourselves? And why? We usually think about ignorance as a bad thing, but can it be preferable not to know something? How do we use ignorance? What roles does ignorance play in social interaction, group relations, institutions, and law? Can ignorance sometimes be a virtue?  When can ignorance be good or bad for us? How can we harness the unknown for learning, discovery, and creativity? \n\nYour understanding of ignorance will be expanded via online games, discussion forums, opportunities to find out what your own “ignorance profile” is, additional readings, and Wiki materials. There also will be discussion threads specifically for those of you who want to apply understandings about ignorance to complex social and environmental problems. Knowing more about ignorance will help you to manage and work with it. It also will help you in dealing with the unexpected, and with complex problems.\n\n                                    ", 
    "end_date": "2015-07-28T00:00:00Z", 
    "title": "Igno101x: Ignorance!", 
    "price": 0, 
    "instructors": "Gabriele Bammer and Michael Smithson", 
    "institution_name": [
        "Australian National University"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/ignorance-anux-igno101x", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-06-23T00:00:00Z"
}