{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    El curso Evaluación de Impacto de Programas Sociales de J-PAL te aportará los conceptos fundamentales para entender cómo la metodología experimental puede ser empleada con el objetivo de evaluar programas sociales.\n \nEste curso de nueve semanas de duración (ocho semanas de contenido, una semana para la prueba final) te permitirá desarrollar una comprensión sólida de la metodología que subyace a las evaluaciones experimentales, y te mostrará paso a paso cómo llevar a cabo tu propia evaluación. El curso se centra en las preguntas de por qué, cuándo y cómo llevar a cabo evaluaciones experimentales. Combinando clases teóricas y casos de estudio basados en evaluaciones reales, el curso presta atención a aspectos como las virtudes de la metodología experimental, los distintos métodos de aleatorización posibles, cómo determinar el tamaño de muestra necesario para poder estimar un impacto o qué situaciones ponen en riesgo la validez interna de un experimento. Asimismo, enfatiza otros temas que son relevantes para cualquier tipo de evaluación de programas, tales como la importancia de hacer un buen diagnóstico de necesidades, definir la teoría de cambio, medir adecuadamente los resultados de interés, asegurar la calidad de los datos y monitorear la implementación.\n \nEl curso de Evaluación de Impacto de Programas Sociales está diseñado para múltiples tipos de audiencias: representantes de fundaciones y ONGs vinculadas al desarrollo internacional, funcionarios de gobierno de países iberoamericanos, así como investigadores, académicos y estudiantes de habla hispana en busca de nuevas herramientas de análisis.\n\n                                    ", 
    "end_date": "2015-07-13T00:00:00Z", 
    "title": "JPAL101SPAx: Evaluación de Impacto de Programas Sociales", 
    "price": 0, 
    "instructors": "Marc Shotland and Francisco Gallego", 
    "institution_name": [
        "Massachusetts Institute of Technology"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/evaluacion-de-impacto-de-programas-mitx-jpal101spax", 
    "duration": "9 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-05-11T00:00:00Z"
}