{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    Language is central to our existence. It is hard to think of ourselves, our societies, and culture without language. Language is a primary means of socialization. It interacts with the social, political and economic power structures. It is the primary medium for the construction and transmission of knowledge and for the articulation of ideas. In short, language constitutes humans and their identities. All people either utilize varieties of a language or use two or more languages to respond to a whole range of affective and interpersonal demands; language by definition must be defined as multilingualism. The primary objective of this course is to examine relationship between language and society with respect to the nature of language\n\n                                            Syllabus\n                        \r\n\r\nWhat is Language and what is scientific about it?\r\nHow language is constitutive of being human? \r\nWhat is the relationship between language and mind? \r\nHow do we learn language? \r\n[Biological foundation and Generative explanation of language learning; Language Acquisition Device and Universal Grammar]\r\nCritical period hypothesis \r\nMother tongue (First and Second Language)\r\nCompetence and performance --- Form and Function\r\nLanguage, dialect and variety (variation) \r\nLanguage Continuum\r\nLinguistic Area\r\nLanguage and Culture\r\nHow is language structured at the levels of sounds, words, and sentences? \r\nWhat is the relationship between language and human cognition?\r\nFluidity which results in multilinguality and human mind/cognition\r\nHow does multilingualism correlate with scholastic achievement, cognitive flexibility and social tolerance?\r\n\r\n\n                                    ", 
    "end_date": "2015-10-26T00:00:00Z", 
    "title": "Language and society", 
    "price": 0, 
    "instructors": "Rajesh Kumar", 
    "institution_name": [
        "IIT ( Indian Institute of Technology Madras)"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://onlinecourses.nptel.ac.in/noc15_hs13/preview", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NPTEL"
    ], 
    "start_date": "2015-09-14T00:00:00Z"
}