{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    L’objectif de ce MOOC est de vous faire découvrir quelques éléments-clés de ce que nous savons aujourd’hui du langage humain - cette formidable faculté de communication et d’élaboration de la pensée dont nous sommes dotés.Le langage est une énigme car il résulte à la fois de notre histoire biologique et de la transmission des traditions et représentations symboliques, lesquelles se rattachent à la culture plus qu’à la biologie. Ainsi, le langage est l’une des facultés qui illustrent particulièrement bien la position singulière dans laquelle nous nous trouvons : celle d’animal culturel.Ce cours a pour ambition de présenter un aperçu des connaissances contemporaines sur le langage humain et, se faisant, montrer comment ces connaissances s’élaborent à partir des regards croisés de plusieurs disciplines.Ce MOOC est organisé en 5 semaines. Chaque semaine correspond à deux heures de travail pour les étudiants. Les séances reposent sur divers médias pédagogiques : séquences de cours filmés, textes, diaporamas commentés, films d’animations, exercices, auto-évaluations.\n\n                                            Syllabus\n                        Semaine 1. IntroductionTour d’horizon des significations du mot langage et du langage en tant qu’objet de sciences.Semaine 2. Apparition du langage humainLa triple libération et l’exaptation : un scénario et un outil pour mieux comprendre l’apparition du langage dans la lignée humaine.Semaine 3. Qu’est-ce que le langage humain ?Ce que la linguistique nous dit des langues, de la faculté de langage, de ses fonctions et de sa créativité.Semaine 4. Quelles frontières entre langage et communications animales ?Ce que l’étude des communications animales nous apprend du langage humain.Semaine 5. ConclusionCréativité du langage et métaphore.\n                                    ", 
    "end_date": "2015-07-13T00:00:00Z", 
    "title": "Le langage entre nature et culture", 
    "price": 0, 
    "instructors": "Marie Montant, Cristel Portes and Baptiste Morizot", 
    "institution_name": [
        "Aix Marseille Université"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/amu/38003/session01/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-06-01T00:00:00Z"
}