{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    Food security is a complex, global issue, in which we all play a part. In this free online course, you’ll join experts from the School of Agriculture, Policy and Development at the University of Reading, to investigate our relationship with agriculture and your own food habits.\n\nMeet food producers around the world\n\nWe’ll take you on a journey around the world from Europe to Africa to Asia. Over six weeks, we’ll find out more about the challenges of growing crops and managing livestock at the regional, national, community and household level.\n\nWe’ll focus on the experience of family farmers (who produce 80% of the world’s food) in rural and urban settings in Uganda and the UK, asking:\n\n\n  What are the key issues facing producers and consumers of food, and how do they compare?\n  What factors influence the way we grow, process, package, transport and consume food?\n  How does agriculture - and its wide-ranging impacts in these different regions - relate to us?\n  And how does the food we grow, buy, eat and throw away relate to global food security issues?\n\n\nConsider your own role in global food security\n\nEach week, we’ll invite you to take part in activities that will help you reflect on your own food habits, including keeping a food waste diary; analysing your weekly shop; and sharing your experiences of food and farming in your community.\n\nDespite the fact that the world is no longer short of food, about 842 million people remain chronically hungry because they cannot afford to eat. In this context, you’ll understand how your preferences - and those of a myriad of other actors in the food system - impact on our global quest for food security.\n\nTo find out more about some of the issues covered in this course, read Andrew Ainslie’s post for the FutureLearn blog: “Why are dairy farmers taking to the streets in protest?”\n\nFurther your studies\n\nOur Hungry Planet  provides a taster of The University of Reading’s MSc in Food Security and Development.\n\n\n\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Our Hungry Planet: Agriculture, People and Food Security", 
    "price": 0, 
    "instructors": "Andrew Ainslie and Sarah Cardey", 
    "institution_name": [
        "University of Reading"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/our-hungry-planet?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-16T00:00:00Z"
}