{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    This course will cover the basic elements of designing and evaluating questionnaires. We will review the process of responding to questions, challenges and options for asking questions about behavioral frequencies, practical techniques for evaluating questions, mode specific questionnaire characteristics, and review methods of standardized and conversational interviewing.\n\n                                            Syllabus\n                        Introduction and Unit 1: Overview of Standardized InterviewingIntroduction; Different types of questions, Measurement error in questions: Bias and variance; Standardized and conversational interviewing; From specifying a concept to asking questionsUnit 2: Response ProcessComprehension; Retrieval; Judgment; ResponseUnit 3: Asking Factual QuestionsFacts and quasi facts; Memory and recall; Asking sensitive questions; Mode, privacy and confidentialityUnit 4: Measuring AttitudesContext effects in attitude questions; Use of different scales; Offering don’t know options; Response order effectsUnit 5: Testing QuestionnairesExpert reviews and focus groups; Cognitive interviews; Behavior coding; Quantitative techniquesUnit 6: Putting It All TogetherThe questionnaire from start to finish; Things to put at the end; Mode Choice: Implementations for layout; Self-administered questionnaires\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Questionnaire Design for Social Surveys", 
    "price": 0, 
    "instructors": "Frederick Conrad and Frauke Kreuter", 
    "institution_name": [
        "University of Michigan"
    ], 
    "commitment": "4-8 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/questionnaire-design", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}