{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    Desde los estudios de género, los estudios queer y\nlos estudios culturales, este curso quiere familiarizar a los estudiantes con\nlas representaciones culturales de las sexualidades no normativas en la cultura\ncontemporánea.Planteamos diversos marcos teóricos y ejemplos prácticos a\npartir de los cuales reflexionar sobre las construcciones corporales e\nidentitarias de las personas lesbianas, gays, transgénero, transexuales, queer,\nheterosexuales, etc. en diversos soportes culturales como el cine, la\nliteratura, internet, la televisión o las artes plásticas.De este modo,\nqueremos contribuir al análisis de los discursos normativos sobre el género y\nla sexualidad que nos construyen como sujetos y nos proporcionan posiciones\njerárquicas dentro del marco social.Entendemos que las representaciones\nculturales son espacios privilegiados para llevar a cabo este análisis, porque\nen ellos se materializan tanto los discursos hegemónicos como sus posibilidades\nde subversión. \n\nEl contenido teórico, siempre explicado a través del\nanálisis de obras artísticas y productos culturales concretos, se estructura\nalrededor de cuatro unidades, repartidas en las cuatro semanas de duración del\ncurso:representaciones, textualidad y corporalidadesgénero/ssexualidad/descultura, identidad y comunidad \n\nEl curso está orientado a cualquier persona\ninteresada en la cultura, el género y la sexualidad, sin necesidad de\nconocimientos previos. Queremos ofrecer contenidos sugestivos para aquellos\nestudiantes ya familiarizados con la temática, sin descuidar las reflexiones y\nexplicaciones necesarias para aquellos que se adentran en ella por primera vez.Colaboradores\n\nMireia CalafellMayte CanteroMichelle GammaFrancisco LazoAnna OrtaIrina Sureda\n\n                                            Syllabus\n                        El curso está pensado para trabajar cada semana los\nsiguientes conceptos, teniendo en cuenta que se irán retomando a medida que se\navance la materia:\n\nSemana 1. Representación. Textualidad. Corporalidad\n\nSemana 2. Sistema sexo/género\n\nSemana 3. Sexualidades\n\nSemana 4. Cultura. Comunidad. Identidad\n\nSe estudiará el desarrollo teórico de cada uno de\nlos conceptos —así como su interrelación— y se verá el modo en que se hallan\nrepresentados en los discursos culturales y en las distintas formas de\nexpresión artística (literatura, fotografía, pintura, internet, vídeo-arte).\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Representaciones Culturales de las Sexualidades ", 
    "price": 0, 
    "instructors": "Meri Torras Francès, Aina Pérez Fontdevila, Noemí Acedo Alonso and Teresa López-Pellisa", 
    "institution_name": [
        "Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/course/representaciones", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-06-30T00:00:00Z"
}