{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    La mayoría de las personas, en algún momento de la vida, hemos experimentado inseguridad para hablar acerca de sexualidad con niñas, niños, estudiantes, pareja o colegas.  Al finalizar este curso serás capaz de hablar de la sexualidad de manera clara, directa, usando información actualizada y sin sentimientos de vergüenza. Además, podrás diferenciar la sexualidad de los conceptos de sexo, género, orientación sexual y genitalidad. También describirás con seguridad los procesos biológicos, psicológicos y socioculturales que intervienen en el desarrollo de la sexualidad a lo largo de la vida.  Asimismo, vas a lograr establecer la relación de la sexualidad con las decisiones que toman las personas en diferentes áreas, al igual que con su bienestar físico, psicológico y social. \n\nEn síntesis, al terminar este curso habrás perfeccionado habilidades para tu trabajo y tu propia vida y podrás explicar por qué la sexualidad es mucho más que sexo. \n\nEste curso está dirigido a personas que trabajan en educación, promoción de la salud y procesos comunitarios. También es muy útil para madres y padres de familia, y para cualquier persona interesada en superar barreras para hablar acerca de la sexualidad. \n\n¡Te esperamos en nuestro curso!\n\n\nRequisitos o preparación previa recomendada\n\nTodas las personas interesadas en la temática son bienvenidas. No se necesita una preparación previa específica. El conocimiento que has adquirido a lo largo de la vida sobre la sexualidad es suficiente para avanzar en el proceso. \n\nFormato del curso\n\nCada lección consistirá en una serie de videos de 3 a 7 minutos de duración cada uno. En cada lección vas a encontrar actividades de evaluación formativas, es decir, actividades que favorecen la autoevaluación, la reflexión personal y el análisis crítico de información.  Al finalizar cada una de las lecciones vas a encontrar una evaluación sumativa que te va a permitir verificar tu comprensión del tema y el cumplimiento de los objetivos que te proponemos.  En algunas lecciones hemos incluido lecturas complementarias para reforzar o ampliar la información que te proporcionamos. \n\nOrganizaciones Aliadas\n\nLa producción de este curso ha contado con el apoyo de las siguientes organizaciones: \n\nFondo de Población de las Naciones Unidas para América Latina y el Caribe UNFPA LACRO\nFondo de Población de las Naciones Unidas - UNFPA  Colombia\nMinisterio de Salud y Protección Social, Colombia\nMinisterio de Educación Nacional, Colombia\nInstituto Colombiano de Bienestar Familiar\n\n                                            Syllabus\n                        Bienvenida¡Hola! Nos da mucho gusto ver que te animaste a tomar este curso. Al finalizar el módulo tú habrás tomado la decisión de desarrollar los otros módulos con el fin de mejorar tu capacidad para hablar sobre  la sexualidad con otras personas. En esta lección establecerás qué tan capaz te percibes para abordar los temas relacionados con la sexualidad e identificarás razones que justifican continuar desarrollando los temas y las actividades que te proponemos. La sexualidad ¿mucho más que sexo?Al finalizar este módulo tú serás capaz de diferenciar los conceptos de sexo, género, orientación sexual, genitalidad y sexualidad. Además serás capaz de describir los procesos biológicos, socioculturales y psicológicos implicados en el desarrollo de la sexualidad.  Para lograr estos objetivos, en la primera lección de este módulo reconocerás las consecuencias que tiene confundir los conceptos sexo, sexualidad y genitalidad. En la segunda lección, definirás el concepto sexo e identificarás los procesos biológicos implicados en el desarrollo de la  sexualidad. En la tercera lección, definirás el concepto género y describirás la relación entre el sexo asignado, el sexo de crianza y los procesos socioculturales que influyen en el desarrollo de la sexualidad.  En la cuarta lección, definirás el concepto orientación sexual y serás capaz de describir los procesos psicológicos que intervienen en el desarrollo de la sexualidad.  En la última lección de este módulo definirás el concepto sexualidad y las dimensiones que lo componen e identificarás argumentos para sustentar que la sexualidad es mucho más que sexo. Yo soy… lo que he vividoAl finalizar las actividades de las tres lecciones de este módulo serás capaz de definir las dimensiones en las que se expresa la diversidad de la sexualidad; describir el desarrollo de la identidad con el sexo, la identidad con el género y la identidad con la orientación sexual; reconocer las características del ambiente físico, familiar, social y normativo que influyen en el desarrollo de esas tres dimensiones que conforman la sexualidad. Mis decisiones hablan de mi sexualidadAl finalizar el módulo serás capaz de describir la relación que hay entre la sexualidad y las decisiones que tomamos las personas en tres dominios de elección: las metas vitales, las relaciones afectivas y las actividades sexuales.  Me atrevo a conversar sobre sexualidad¡Has llegado al último módulo de este curso! Al terminar reconocerás que al propiciar conversaciones acerca de la sexualidad en el medio en el que vives y trabajas contribuyes a crear oportunidades para el bienestar.   Para lograr este objetivo vas a realizar las actividades de tres lecciones. En la primera, identificarás las características del bienestar físico, psicológico y social y reconocerás su relación con la sexualidad. En la segunda lección identificarás situaciones de la vida cotidiana en las que puedes propiciar conversaciones acerca de la sexualidad. En la  conclusión, vas a realizar nuevamente la autoevaluación que hiciste al iniciar el curso y establecerás qué tan capaz te percibes en este momento para propiciar conversaciones acerca de la sexualidad con el fin de contribuir a crear oportunidades para el bienestar en el medio en el que vives y trabajas.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Sexualidad...mucho más que sexo", 
    "price": 0, 
    "instructors": "Ángela María Rojas Martínez, Carlos Hermosa Bosano, Elvia Vargas Trujillo and Marta Carolina Ibarra A", 
    "institution_name": [
        "Universidad de los Andes"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/sexualidad", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}