{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    From the personal to the political, social media conversations are at the heart of cultural and social change. In this course you will be introduced to digital methods to analyse social media data on Twitter. You will learn from leading researchers, engage in hands-on activities and confront issues in social media data.\n\nWeek 1: Understanding and gathering\nWe uncover the anatomy of a tweet and the cultural politics of Twitter. You will decide what you want to analyse: a company hashtag? A campaign hashtag? A cultural reference? You will learn to use TAGS, a free and open framework for accessing the data you need, and discuss the implications of accessing these data. What are the restrictions? What about user privacy and ethics?\n\nWeek 2: Analysing\nYou will encounter Tableau, a desktop software for analysing your data without complex scripts or code. You will learn how to identify trends, patterns and variances in your data. You will also see real examples of how analyses of social media have been used in times of crisis and during political campaigns, and explore the pros and cons of analysing social media data in real time.\n\nWeek 3: Visualising\nYou will use the software Gephi to visualise the networks in your data. We will discuss the benefits of using digital tools to analyse social media data, and also consider how such analyses may be supported by other methods. We will see the results of real social media analyses, and revisit the concept of user privacy.\n\n\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "Social Media Analytics: Using Data to Understand Public Conversations", 
    "price": 0, 
    "instructors": "Tim Highfield, Axel Bruns and Jean Burgess", 
    "institution_name": [
        "Queensland University of Technology"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/social-media-analytics?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-07-18T00:00:00Z"
}