{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    Depuis toujours, l'action violente est apparue comme un acte de résistance, parfois désespéré. Elle est souvent qualifiée de terroriste en fonction des intérêts des parties et des cibles choisies. Malgré de nombreux efforts, aucune définition internationale commune n'a pu être trouvée, et la plupart des organisations ayant pratiqué l'action violente ont été dénoncées comme terroristes à un moment ou à un autre de leur histoire. Le terrorisme a également évolué. Singulier, il est devenu pluriel. Ses cibles se sont diversifiées. Si la notion de terrorisme fait souvent l’objet de controverses et de polémiques c’est qu’elle est empreinte d’une forte subjectivité et qu’elle désigne un phénomène complexe, mouvant et multiforme.Ce cours propose une analyse historique précise et détaillée des mutations du terrorisme, de ses évolutions et ruptures, de son passage d’un outil criminel singulier à une dimension plurielle. Y sont abordées : les définitions, les acteurs, les cibles, les méthodes et les outils de lutte contre le terrorisme.Ce cours a pour objectif de fournir une meilleure connaissance et une plus grande capacité d’analyse de l’information sur les problématiques terroristes.Il est organisé en 6 modules et dure 6 semaines.Chaque module se compose de 5 à 6 séquences vidéo, suivies d'une ou deux questions.Pour chaque séquence des discussions sont ouvertes sur le forum.Les retours hebdomadaires aux principales questions des forums, se font en direct par hangout.\n\n                                    ", 
    "end_date": "2015-12-14T00:00:00Z", 
    "title": "Terrorismes", 
    "price": 0, 
    "instructors": "Alain Bauer", 
    "institution_name": [
        "CNAM"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/CNAM/01019/session01/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-11-02T00:00:00Z"
}