{
    "selfpaced": true, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    Explore complex, multi-actor systems in which one factor influences all other factors. For instance, how innovative energy technologies merge into the existing energy system, or how new transport possibilities impact current processes. Armed with this information, learn to decide whether they should be further developed, consider possible negative results and weigh associated costs.\n\nThere are multiple ways to make decisions, but one way proven to be very useful is the analytical approach - a methodology for making the problem explicit and rationalising the different potential solutions. In short: analysis based support of decision making, design and implementation of solutions.\n\nCreative Problem Solving and Decision Making as a course teaches you this method.\n\nThis course explores and evaluates tools and problem solving methods such as:\n\n\n\tActor analysis\n\tCausal modeling\n\tGoal trees and means-end diagrams\n\tProblem diagrams\n\tUncertainty\n\tDecision support\n\tScore cards\n\n\nThis course introduces each technique and applies each technique to a case. Ultimately, the combination of these techniques provides a coherent analysis of the problem.\n\n\n\n\nLICENSE\nThe course materials of this course are Copyright Delft University of Technology and are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike (CC-BY-NC-SA) 4.0 International License.\n\n                                    ", 
    "end_date": null, 
    "title": "TPM1x: Creative Problem Solving and Decision Making", 
    "price": 0, 
    "instructors": "Alexander de Haan", 
    "institution_name": [
        "Delft University of Technology"
    ], 
    "commitment": "8 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/creative-problem-solving-decision-making-delftx-tpm1x-0", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-06-15T00:00:00Z"
}