{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/russians\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/russians-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    russians-001\n                                                                    russians-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                      The course was created with the support of Sberbank \n\nThe main\nfocus of this course is to look at the interrelations between different types\nof contexts (cultural, institutional, professional, social, interpersonal\nand others) within the intercultural communication process using Russian – Western\ncommunication as an example.\n\nThe purpose of the course is to provide the students\nwith a broad overview of the basic principles governing past, present and\nfuture interactions between Russia and the West focused on the culture and national\npsychology of Russians and Western Europeans.\n\nThis course looks at the cases when Russian basic cultural values show\nup through linguistic choices shaping language production which is consequently\nmisattributed by Western partners.  No\nmatter what the language of intercultural communication is - Russian, or\nEnglish - the meaning of many linguistic expressions may be reconstructed\nwrongly by the representatives of another culture.\n\n \n\nWe will\ntackle some basic questions:\n\n\n What are concepts of culture\n     that have most influence on communication?\n What are Russian basic cultural\n     values and how they shape modern Russian consciousness?\n  What are specific communication patterns\n     of modern Russian, including that of public and electronic discourse? \n What is important to know about\n     communication with Russians in organizational contexts?\n\nThis course is NOT just a list of instructions\nof what to do and not to do while dealing with Russians\n\n                                            Syllabus\n                        Module\n1. Introduction to the course.  \n\nWeek\n1.  Overview of the concepts “culture” and “communication”.\nWhy “Russianness?”  Importance of\nlinguistic approaches. The role of ICC contexts.  Structure of the course.\n\nModule 2.\nCulture in Intercultural Communication.  \n\nWeek 2. Metaphors\nof culture.  Beliefs, values and\nstereotypes. Cultural homogeneity.  How\nmuch culture can be learned?  How\nculturally relative one can be? Basic values of Russian culture placed within the cultural dimensions,\nhistory and geography.  Generalized knowledge\nvs. stereotypes of “enigmatic Russian soul.”\n\n \n\nModule\n3.  Communication as Interaction.\n\nWeek 3. Language as a primary source of\ncommunication and miscommunication in ICC. \nShared knowledge as a prerequisite for communication.  Cooperation and Politeness principles in\nRussian communication\n\nWeek 4. Context and contexts of human\ninteraction.  ”Contextual clues’ in\nRussian communication. Russian cultural models. Interpersonal aspect of ICC\nwith Russians.\n\n \n\nModule\n4. Communication with Russians in various discourse systems\n\nWeek 5.  Communication with Russians in corporate discourse\nsystems.  Introduction of the market\neconomy and post-soviet management. Old fears and new anxieties. Technocrats\nand managers.  Language of management in\nRussia.\n\nWeek 6. \nCommunication with Russians in professional\ncontexts.   Occupational cultures.\nSocial stratification and new elites. \nRussia’s middle-classes, professional associations and civil society.\nCase study of an international educational program.\n\nWeek 7. Communication with Russians in gender and generational discourse systems.   Gender roles in modern Russian society.  Cross-gender communication in social and\nbusiness environments.  Family relations.\n\nWeek 8. Stories of\nRussian culture and everyday communication within an in-group. Types of stories\nthat characterize cultures. Official, stories, cultural stories, conversational\nstories. Humor and jokes, obscene language. \n\n Week 9.\nCourse wrap up.  Reflections on intercultural communication\nwithin the course\n                                    ", 
    "end_date": "2015-12-14T00:00:00Z", 
    "title": "Understanding Russians: Contexts of Intercultural Communication", 
    "price": 0, 
    "instructors": "Mira Bergelson", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/course/russians", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-10-12T00:00:00Z"
}