{
    "selfpaced": false, 
    "topic_name": [
        "Sociology"
    ], 
    "description": "\n\n                    \n                    \n                    التنمية في العالم العربي: يمر العرب الان بأحد المنعطفات في تاريخهم الحديث. فما من ناحية من نواحي حياتهم الا تقف على مفترق طريق. فالاقتصاد العربي إما متهاوٍ أو معتمدٍ يشكلٍ تام على الموارد الطبيعة التي تخلو من ابداع في الانتاج او افاق تقدمٍ مستقبلي. والشباب العربي الذي يشكل اغلبية التكوين الديموغرافي في الدول العربية مسحوق بين تعليم لا يصلح لهذا الزمان وبطالة تقضي على الأحلام. ومن المؤسف أن الدول العربية مازالت تعاني من معدلات فقر لا تتناسب والثروات والامكانيات المتاحة لها. هذا بالاضافة الى انعدام تكافؤ الفرص للخروج من هاجس الفقر الذي يفقد الانسان العربي ابسط حقوق الحرية والمواطنة. ومما يدعو الى القلق ان نسيج المجتمعات العربية والذي يعتمد على الثقة بالغير قد تحلل بشكل جعل العديد من هذه المجتمعات تدخل في دوامة البحث عن الذات بأضيق صوره واللجوء للعنف. وتخلو الدول العربية بشكل عام من المؤسسات التي تشكل الركيزة الاساسية للدول الحديثة. ففي ظل غياب الديمقراطية وتعطيل الحريات اضحى العرب غائبين عن صنع القرار. أما عن حال المرأة العربية فحدث ولا حرج فللنساء مثل حظ الذكرين في الاضطهاد و التهميش.\r\nيبحث هذا المساق في اسس وركائز كل من هذه التحديات لتشكيل صورة واضحة عما يجب اصلاحه وكيفية القيام بذلك. ويخلص الى دراسة اطر ازالة العقبات التي تقف في وجه التنمية ويركز بشكل خاص على احدى اعتى التحديات التي يواجها العرب وهي نضوب اسواق المال والاستثمار. ويحاول هذا المساق تشكيل صورة حقيقية لما يواجهه العرب اليوم من تحديات واشكالات بالاعتماد على الارقام والاحصاءات والتحليل المنهجي بعيداً عن الشعارات الزائفة. يبحث هذا المساق. عن فسحة للأمل عبر تطورات ايجابية قد تشكل سبيلاً لإنارة واقعنا المظلم. فالشباب العربي مثلاً اصبح واعي اً لحقوق المواطنة ومطالباً بحقوقه. وهناك محاولات واعدة في مجال ريادة الأعمال. فما الدروس المستفادة من هذه البقع المضيئة وما السبيل لدعمها وتدعيمها؟\n\n                                    ", 
    "end_date": "2014-08-13T00:00:00Z", 
    "title": "العرب: أين، وإلى أين؟", 
    "price": 0, 
    "instructors": "Faisal Kattan, Starboard Nassar and Mohammed Eses", 
    "institution_name": [], 
    "commitment": "5 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://edraak.org/courses/%D8%A5%D8%AF%D8%B1%D8%A7%D9%83/ECDV100/2014/about", 
    "duration": "9 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Edraak"
    ], 
    "start_date": "2014-06-11T00:00:00Z"
}