{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Embarking on a career in sales is both exciting and daunting. It is a results orientated businesswhere the rewards can be great but the price of failure usually means a short lived career. This presentation is aimed at those who are in their early stages, or thinking, of starting a life selling into industry. There are a multitude and diverse selection of books and courses available to you but this is designed to give you the best possible initial grounding into your chosen profession.  </p>  <p>  \t  I have been selling at various levels for almost 40 years and believe me there is nothing quite like the feeling you getfrom landing a new lucrative account/contract no matter how far up the “greasy pole” you may get. However luck plays little part in that feeling but hard work and good advice is essential.  </p>  <p>  \t  If you are lucky enough to work for a professional and progressive company then you are likely to be sent on detailed and focussed training courses but you will certainly have to prove that you have the basics right before your company will invest good money in getting the best from you.  </p>  <p>  \t  The thrust of this presentation is to either enable you to grasp the fundamentals of selling prior to an interview or if you have landed your first sales role and feel a little guidance would help.  </p>", 
    "end_date": null, 
    "title": "A Concise Guide to a Successful Career in Industrial Sales", 
    "price": "20.00", 
    "instructors": "Daniel Trindade, APT Choices, Derek Elson", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/245556_5c56_4.jpg", 
    "course_url": "https://www.udemy.com/guide-successful-career-industrial-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-18T08:29:29Z"
}