{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tDo you work in a restaurant? Would like to make more money? Great then keep reading. Seriously stop kidding yourself, there's a reason why it's always the same servers and bartenders that make major cash!  </p>  <p>  \tThey know and do stuff that you don't. This class will teach you how you can sell more and make more tips. It's not rocket science, it's about how you make your guest feel and what kind of experience you create for them.  </p>  <p>  \tTake an hour of your time and watch this course. I guarantee you (there's a guarantee on these courses anyways) that even if you take away 10% into your restaurant you will pay up the 39$ it costs within a shift by not being an average server.  </p>  <p>  \tAn hour of your time with 11 videos about how to be the top dog in your restaurant. A couple cheat sheets to follow along (you can even print it and read it in the the staff bathroom during your next shift to make sure you get it!).  </p>  <p>  \tIn this sweet hotel management training course we'll touch on Guests expectations, Total guest satisfaction, Human personalities, Handling complaints, Business Acumen, Tips and tricks, etc. \"It sounds boring\" I hear you cry, well that's the stuff that'll fill your pocket with sweet dollar bills.  </p>  <p>  \tYou'll learn how to provide amazing service, build relationships with everyone you serve  and understand the restaurant biz a little better. It'll make you a better server for your guests and a better employee for your boss (you know better shifts and better sections).  </p>  <p>  \tI'll be here to answer any questions you got. Remember the only people complaining about tips and the restaurant being quiet are the ones not making money. I've always been a top earner and enjoyed the restaurant business. Learn how now, invest 39$ that can make you thousands in return. Be smart :)  </p>", 
    "end_date": null, 
    "title": "Achieve excellence in restaurant service", 
    "price": "20.00", 
    "instructors": "Christopher Wells", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/34177_4ce7_10.jpg", 
    "course_url": "https://www.udemy.com/achieve-excellence-in-restaurant-service/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-02T18:52:09Z"
}