{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   En este práctico pero completo curso, podrás analizar la importancia de utilizar estrategias de gestión administrativa y marketing para posicionar tus servicios de psicología o consultorio psicológico.  </p>  <p>  \t   En este entrenamiento encontrarás 23 clases en formato interactivo (video y audio) explicando todo lo que necesitas saber sobre las principales herramientas para la administración y posicionamiento de una empresa de servicios psicológicos. Por igual, el curso cuenta con documentos en PDF que complementan alguna de las clases, lo cuales podrás imprimir o guarda en tu computador o dispositivo móvil y llevarlo siempre a mano.  </p>  <p>  \t   Dentro del curso nos interesa saber qué tanto vas asimilando los contenidos presentados, es por tanto que cuentas con 3 pruebas de selección múltiple que validarán tus conocimientos adquiridos a lo largo del curso.  </p>  <p>  \t   Esta capacitación tiene una duración de más de 2 horas teóricas, donde se plantean ejercicios puntuales para que los realices en el tiempo que consideres apropiado y puedas así lograr los objetivos propuestos.  </p>  <p>  \t   Contarás con 8 secciones, divididas de la siguiente manera:  </p>  <ol style=\"\">  \t<li>Introducción al curso</li>  \t<li>Empresa de servicios psicológicos</li>  \t<li>Marketing aplicado al posicionamiento del consultorio</li>  \t<li>Web marketing para psicólogos</li>  \t<li>Marketing 2.0 para la promoción del consultorio psicológico</li>  \t<li>Elementos que contribuyen al éxito</li>  \t<li>Fidelización de clientes</li>  \t<li>Resumen y cierre del curso</li>  </ol>  <p>  \t   Al participar en este curso entrenamiento, te sentirás en la capacidad de poder emprender tu propio negocio de servicios psicológicos y tendrás todas las herramientas básicas para hacerlo. Lograrás establecerte en el mercado de psicólogos, terapeutas y profesionales de la salud mental, ofreciendo así tus servicios con calidad, prestigio, sobre un marco legal y moral. Podrás mejorar tus ingresos como profesional, crecerás como psicólogo y lo más importante: podrás ayudar a muchas personas dando a conocer la labor del psicólogo.  </p>  <p>  \t<span>Te damos la mas cordial bienvenida!</span>  </p>  <p>  \t   Robert Sasuke | Instructor  </p>", 
    "end_date": null, 
    "title": "Administración y Posicionamiento del Consultorio Psicológico", 
    "price": "50.00", 
    "instructors": "SINAPSI CDHE, MA Robert Sasuke", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/246060_49d0_2.jpg", 
    "course_url": "https://www.udemy.com/apconsultoriopsic/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-18T20:59:47Z"
}