{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  In guiding a construction project a good working knowledge of the construction contract is essential.  </p>\n\n<p>Please note that this course is priced in US dollars. <br></p>\n\n<p>Duration of Study </p>\n\n<p>The pace at which each student studies is different. The nominal hours for this course are 20 hours, however, this can vary greatly depending on your previous experience and study techniques. Student support is available by asking a question online or visiting our website.</p>\n\n<p>Exner is a Registered Training Organisation </p>\n\n<p>  \t  Exner Education, drawing on their 25 years of experience in the construction industry have tailored this course on administration of construction contracts to suit the needs of site managers, project managers, construction managers and contract managers to ensure that they gain a good understanding of construction contract administration.  </p>\n\n<p>  \t  The course competencies come from an Australian Training Package and the unit of competency -  CPCCBC4016A Administer a Construction Contract has been selected from this package.</p><p>If you are an Australian student and would like to be assessed for this unit, please visit our website for more information. On successful completion you will awarded with a nationally recognised certificate of attainment.</p>", 
    "end_date": null, 
    "title": "Administer a Construction Contract CPCCBC4016A", 
    "price": "20.00", 
    "instructors": "Exner Education", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/224588_c670_4.jpg", 
    "course_url": "https://www.udemy.com/administer-a-construction-contract-cpccbc4016a/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-20T23:50:56Z"
}