{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"></p><p style=\"\"><strong style=\"\">How do I earn money with music?</strong> Every musician asks themselves this question at some point. Few receive an answer in the form of a career in music.</p>  <p style=\"\">  </p><p style=\"\">This course gives you all the answers you need to succeed as a professional musician.&nbsp;</p>  <p style=\"\">  </p><p style=\"\"><strong style=\"\"><em style=\"\">Musician as Entrepreneur: Band as Business</em></strong> features over 5.5 hours of insightful video interviews with 70 of the top music business minds. We won&#039;t bore you with lectures. We offer only practical, specific, real-world advice from the likes of J<strong style=\"\">immy Iovine, Glen Ballard, Irv Gotti, Jerry Moss, Martin Atkins, Ray Parker Jr., Randy Newman, Don Passman, Dave Stewart, Wayne Kramer</strong>&nbsp;and<strong style=\"\"> Lawrence Lessig</strong>, to name just a few.</p>  <p style=\"\">  </p><p style=\"\">Alongside the video, in-depth PDF lesson guides are provided to steer you through the course. Each section covers a critical component of the music career, and you&#039;ll find <strong style=\"\">a book&#039;s worth of material </strong>to pore through. We also list additional online resources from Artists House so you can dive deeply into your area of interest.</p>  <p style=\"\">  </p><p style=\"\">The purpose of this course is to help musicians make money by understanding that the music they write, record and perform creates business and legal rights that will help them create sustainable careers.&nbsp; It’s practical, it’s philosophical, and it’s determined to help you, the musician, and you the music entrepreneur, understand the legal foundations and business opportunities inherent in doing what you love.&nbsp; &nbsp;</p>  <p style=\"\">  </p><p style=\"\"></p><ul style=\"\"><li style=\"\"><span style=\"\"><strong style=\"\">How to think: </strong></span><span style=\"\">Understand musicians, bands, and performing artists as businesses and the best practices available for their sustainability.</span><br style=\"\"></li><li style=\"\"><span style=\"\"><strong style=\"\">How to know:</strong></span><span style=\"\"><strong style=\"\"> </strong>Understand excellence in respect of the production processes and the specific legal and business consequences of a musician’s creative work.</span><br style=\"\"></li><li style=\"\"><span style=\"\"><strong style=\"\">How to share: </strong></span><span style=\"\">Understand the process and consequences of publishing, sharing, giving, licensing, distributing, selling, and marketing opportunities in respect of the creative work of the musician and the performing artist.</span><br style=\"\"></li><li style=\"\"><span style=\"\"><strong style=\"\">The way forward:</strong> </span><span style=\"\">Understand the processes for sustainability and continuity, the availability and role of online resources and outsourcing, and the importance of personal development and business growth.&nbsp;</span><br style=\"\"></li></ul><p style=\"\"></p>  <p style=\"\">  </p>  <p style=\"\">  </p>  <p style=\"\">  </p><p style=\"\"></p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Band as Business, Musician as Entrepreneur", 
    "price": 0, 
    "instructors": "John Snyder", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45993_cac9_3.jpg", 
    "course_url": "https://www.udemy.com/bandasbusiness/", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-15T14:40:06Z"
}