{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Becoming a pharmacy technician is a simpler path than most students think.  While many students are convinced that becoming certified involves months of schooling -currently this is NOT the case.  </p>  <p>  \t<strong style=\"\"> To become a certified pharmacy technician an individual must:</strong>  </p>  <p>  \t<strong style=\"\">1.  </strong>Register with the PTCB or ExCPT to take a certification exam.  Most states require the PTCB, but the ExCPT is accepted in many states.  </p>  <p>  \t<strong style=\"\">2.  </strong>Study the required material to pass the PTCB or ExCPT examination.  (Note: Studying for the exam <em style=\"\">can </em>be a part of a lengthy/costly college course, but is not required - a simple online video course will be sufficient  )  </p>  <p>  \t<strong style=\"\">3.  </strong>Pass your exam!  </p>  <p>  \t<strong style=\"\">4.   </strong>Register with your respective State Board of Pharmacy.  We provide the web URL for all 50 State Boards of Pharmacy to make registering easy!  </p>  <p>  \t            This course is designed to help students learn the concepts needed to become a certified pharmacy technician (C. Ph.T).  Many different topics are covered in the course, including pharmacy law, common abbreviations, commonly used calculations, and many other skills used by pharmacy technicians in their day to day tasks.  Utilizing the advantages of a self-paced course, student will be able to prepare to take the certification exam needed to work as a pharmacy technician.  </p>  <p>  \t            Included in this course are how-to videos, drugs lists, commonly seen abbreviations, pharmaceutical calculations, sample test questions, and other resources useful in a successful pharmacy career.  </p>  <p>  \t            This course will require additional time and repetition to reinforce skills learned within the  included materials.  Students are encouraged to take a slow and steady pace in this course - it is designed as a 6-week course but may be longer or shorter depending on the rate of learning by the student.  </p>", 
    "end_date": null, 
    "title": "Become a Pharmacy Technician", 
    "price": "40.00", 
    "instructors": "Steven Pettit, Pharm.D.", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46257_2aa2_9.jpg", 
    "course_url": "https://www.udemy.com/pharmtech/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-18T05:12:19Z"
}