{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you a college student considering a career in healthcare? Are you a foreign medical graduate who wants to integrate into the healthcare system in America? Do you want a challenging yet exciting career where lives get changed? If you answer yes to any of the above, this course is for you.<br></p><p>This comprehensive course teaches you everything you need to know, and do, in becoming a healthcare administrator in the US Healthcare System. If you want a rewarding career, financially and otherwise the healthcare industry could be just the way forward for you. </p><p>In here, you will learn what it means to be a healthcare administrator. You'll also get a high level description of the prospects in this career, the best ways in, what the job market is like, and an early view on the steps needed to pursue a career in healthcare administration. Whether you’re a college student still trying to figure out what you want to major in, or a professional looking for a career change into the healthcare field, this course is for you!</p><p><em><strong>Content and Overview</strong></em></p><p>We\nstart with looking at the structure of the US Healthcare System, and then we go\ninto the history of the industry looking back 100 years. We progress into what\nthe role of a healthcare administrator is in such a complex yet exciting\nindustry. We discuss the educational requirements to becoming a healthcare\nadministrator, and explore the many paths to achieving an ultimate goal of being a\nHospital CEO or President of a healthcare system. Lastly, I share my personal\nexperience as a healthcare administrator; we review my book titled <em>Freshman\nManager, Sink or Swim</em> (which you’ll be getting a free copy) on my freshman year\nas a healthcare administrator.</p><p><em>Detailed Content</em></p><ul>\n<li>6 video Lectures and over 130 minutes of content</li>\n<li>The e-book version of <em>Freshman Manager, Sink or Swim, </em>a 112 page book<em> </em>written and published by me</li>\n<li>Know the best ways to becoming a healthcare administrator</li>\n<li>Resources on how to start your healthcare administrator career</li>\n<li>Resources on where to go for additional information on the career</li>\n<li>Expedited access to my Leadership &amp; Management mentoring program for Healthcare Leaders of Tomorrow (HLOT)</li></ul><p><em>Modules include:</em><br></p>  <ul><li>Module 1: The healthcare industry and its intricate parts</li><li>Module 2: Functioning as a healthcare administrator</li><li>Module 3: Reality of healthcare administration.</li></ul>", 
    "end_date": null, 
    "title": "Becoming a Healthcare Administrator", 
    "price": "20.00", 
    "instructors": "Lana Bamiro, MPH, MBA, RRT, CHES", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631724_8a81_2.jpg", 
    "course_url": "https://www.udemy.com/hlot-101-becoming-a-healthcare-administrator/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T21:01:39Z"
}