{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Section 1: Care Management Shared Record </strong></p><p style=\"\"><strong style=\"\"></strong>As our technologies advance, delivery of high quality medical care has come to require teams of health care providers in a variety of care settings such as clinician offices, hospitals, emergency departments, urgent care clinics, skilled nursing facilities, inpatient rehabs, home health care and so on. These teams may include primary care clinicians, specialists, behavioral health providers, nurses, medical assistants, dietitians, pharmacists, social workers, and more. In this course we show the importance of care coordination and how a shared record can impact patient health.</p><p style=\"\"><strong style=\"\">Section 2: Telephonic and Electronic Outreach: How to Monitor a Patient </strong></p><p style=\"\">Why is this outreach important? Clinic visits are too brief for the clinician or other staff to arrange all recommended care, and patients often miss or cancel appointments. In “Telephonic and Electronic Outreach: How to Monitor a Patient,” we explain the different types of services that can be performed on the telephone and computer to help with population health management at the practice.</p><p style=\"\"><strong style=\"\">Section 3: Caregiver support</strong></p><p style=\"\">A caregiver is a spouse, partner, family member, friend, volunteer or paid helper.</p><p style=\"\">A caregiver is someone who regularly assists another person with their activities of daily living due to needs related to chronic disease, acute illness, mental illness, aging or disability. In this course we will explore the many duties of the caregiver and why the support of the health care team is vital.</p><p style=\"\"><em style=\"\">Students who will find this course useful will be:</em></p><ul style=\"\"><li style=\"\">Employed in the healthcare industry, or</li></ul><ul style=\"\"><li style=\"\">Caring for family member or friend with a chronic disease </li></ul><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Care Management Tools of the Trade", 
    "price": "20.00", 
    "instructors": "Practice Transformation Institute", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514634_b5dc_2.jpg", 
    "course_url": "https://www.udemy.com/care-management-tools-of-the-trade/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T14:58:16Z"
}