{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In the realm of casting, there are so many processes from casting industrials, television, and film to meeting with actors, reading scripts, and negotiating with producers.&nbsp;This class is for anyone planning to work within the casting profession and also gives tremendous perspective to anyone that wants to enter the entertainment industry.&nbsp;In addition to casting agents, it is recommended for actors, talent agents, managers, producers, and all others that work in conjunction with the casting process.&nbsp;&nbsp;<br></p><p>Industry Expert</p><p><strong>Toni Suttie</strong> <em>Casting Director</em><p>As President of Integrity Casting, Toni Suttie has over 25&nbsp; years experience in Hollywood castings.&nbsp;&nbsp; With over 250 feature film, commercial, television, industrial,&nbsp; live event, and trade show castings, she has&nbsp; become a sought after expert for workshops, lectures, and speaking engagements&nbsp; around the country.&nbsp;&nbsp; Toni is the writer&nbsp; of the book <em>Slate Please: The Ultimate&nbsp; Actors Guide to Audition Preparation</em>.&nbsp;&nbsp; She also has established the exclusive Elite Mentoring Program for&nbsp; actors.<p>Her credits include films such as <em>Love Ranch</em> (Joe Pesci, Helen Mirren), <em>Beverly Hills Cop III</em> (Eddie Murphy), and <em>Made in America</em> (Will Smith, Whoopi Goldberg).&nbsp; Corporate video castings include those for&nbsp; Microsoft, Kaiser Permanente, IBM, and CompUSA and television castings for <em>The Apprentice</em>, <em>Beverly Hills 90210</em>, and <em>Ellen&nbsp; DeGeneres Show</em>.&nbsp; Toni has also&nbsp; produced and/or cast events for celebrity talent such as Carmen Electra, Andy&nbsp; Dick, Mario Van Peebles, and Pamela Anderson.</p>\r\n", 
    "end_date": null, 
    "title": "Casting Director: All about Casting Directors and being Cast", 
    "price": "20.00", 
    "instructors": "Faith in Dreams Edutainment", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/71958_572c_5.jpg", 
    "course_url": "https://www.udemy.com/fidcastingdirector/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-31T04:30:19Z"
}