{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t                   The Effective Expert Witnessing course was developed by Jack V. Matson, Ph.D, P.E. and Matson &amp; Associates  to provide in-depth guidance for successful expert witnessing. The lessons taught are applicable for experts from around the world in a wide range of disciplines, such  as engineering, environmental forensics, mathematics, computer sciences, life  sciences, and physical sciences. The course covers the pre-trial process, preparing for trial, and the  courtroom drama. Throughout the course you will hear from seasoned expert  witnesses, a practicing lawyer, and a social psychologist that  specializes in witness preparation. With their diverse backgrounds and  vast knowledge and experience in expert witnessing, these presenters  offer advice on all aspects of the legal process in the U.S. court system. The course also includes  tips on how to survive motions to exclude and explores the psychology of  the jury with advice on how to be an effective witness at trial. The companion text<em> Effective Expert Witnessing, 5th edition</em> by Dr. Matson can be found online in hard copy and eBook. For more detailed information on the course and presenter bios see www.expertwitnesscourse.com\r\n</p>\r\n<p>\r\n\t        Note: This course qualifies for up to 4 Professional Development Hours (PDH) in most states. For further information on qualifying continuing education credits for professional license holders please contact your state's professional registration board.\r\n</p>", 
    "end_date": null, 
    "title": "Effective Expert Witnessing", 
    "price": "50.00", 
    "instructors": "Dr. Jack V. Matson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94624_5f29_7.jpg", 
    "course_url": "https://www.udemy.com/effective-expert-witnessing/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-19T19:36:21Z"
}