{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course introduces the student to area classification issues and how to specify and recognize an installation that does not meet the NFPA standards.  If you work in an industrial facility and it has flammable gasses or liquids that are being processed or handled, this course is a must for you.  As an electrical engineer we are required to create EAC electrical area classification drawings, and specify electrical equipment for hazardous areas, this course will help the student understand what needs to be done.</p>\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>This course is about:</p>\n\n\n\n\n\n<ol><li>Electrical Equipment in Hazardous Areas</li><li>Hazardous Areas Classification in North America</li><li>Hazardous Areas Classifications and protections</li><li>Hazardous Area Classification for Flammable gasses and vapors</li><li>Hazardous Area Classification Training Guide (Industrial Electrical Training)</li><li>Hazardous Area Classification for electrical systems</li></ol>\n\n\n\n<p><br></p>\n\n\n\n<p>Learn more about:</p>\n\n\n\n<ul><li>explosive gas atmospheres</li><li>hazardous areas</li><li>non-hazardous areas</li><li>grouping and classifications</li><li>source of release</li><li>grades of release</li><li>continuous grade of releases</li><li>primary grade of release</li><li>secondary grade of release:</li><li>ventilation:</li><li> upper explosive limit</li><li>lower explosive limit</li><li>Auto Ignition temperature</li><li>ventilation:</li><li>Relative density of gasses and or vapors</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>Area classification is a tool engineers use to analyze and classify the environment where explosive gas atmospheres may occur so as to facilitate the proper selection and installation of electrical equipment and other apparatus to be used safely in that environment, taking into account gas groups and temperature classes. In most practical situations where flammable materials are used, it is difficult to ensure that an explosive gas atmosphere will never occur.  It may also be difficult to ensure that devices and apparatus will never give rise to a source of ignition.  Therefore, in situations where an explosive gas atmosphere has a high likelihood of occurring, reliance is placed on using apparatus which has a low likelihood of creating a source of ignition. Conversely, where the likelihood of an explosive gas atmosphere occurring is reduced, apparatus constructed to a less rigorous standard may be used.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Electrical Area Classification (Qty. 1 PDH for PE's)", 
    "price": "20.00", 
    "instructors": "Vincent Wedelich", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814032_aebb_3.jpg", 
    "course_url": "https://www.udemy.com/electrical-area-classification-2-phds/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T01:16:40Z"
}