{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t        There is a great need nationally for export consultants to work with small-to-medium sized businesses, and help them to either begin exporting, or expand exporting to additional countries.Recent college graduates and mid-life career changers who are either unemployed or underemployed are ideal candidates for learning and prospering in this prestigious career field.\r\n</p>\r\n<p>\r\n\t  Only 35% of 5.7 million small-to-medium sized companies nationwide are currently exporting. And, of these companies, fully 70% are exporting to only one country! With your skillful guidance, companies that are currently exporting to only one country, could be exporting to many more. And, the majority of these companies that are not exporting, can be trained to successfully enter the global export arena. 95% of the global middle class market is outside the United States; that&#039;s a lot of market share to ignore!\r\n</p>\r\n<p>\r\n\t Exporting is a national strategic issue because it impacts the balance of trade: exporting reduces the U.S. Trade Deficit, creates employment opportunities in the USA, and strengthens communities across the Nation. Exporting helps to fulfill a Patriotic Duty, and as an EIA Independent Consultant, you would be helping to build the fabric of society.\r\n</p>\r\n<p>\r\n\t Business owners state that, &quot;We would begin exporting, but we need someone to come in and show us how  to set up an export program.&quot; With millions of companies across the country that are not exporting and needing export assistance, the government agencies set up to work with these companies are unable to meet the growing demand for export assistance. They do an excellent job with their available resources, have helped countless companies over the years to begin exporting, and are powerful allies for your business. But budget cuts, sequestration, geographic isolation, and staff reductions at these agencies have created a &#039;...Tremendous National Need&#039; for export consultants.\r\n</p>\r\n<p>\r\n\t        EIA will teach you how to navigate through the various export agencies and learn little-known trade practices that can catapult your client&#039;s export business. This of course means that your consulting practice is steadily growing, and your reputation as a source for exporting expertise is reaching a broad audience.\r\n</p>\r\n<p>\r\n\t        We here at EIA know from years of international travel and trade experience; distributor negotiations and Agreements; opening irrevocable, confirmable Letters of Credit in the millions of dollars (drawn on only the top US Banks); working closely with the government agencies; and, building relationships with the Commercial Staff at American Embassies in many countries how to get the job done: and we will teach you how to do it, too--beginning with this lecture series.\r\n</p>\r\n<p>\r\n\t        You can make a six-figure income in this profession by commanding retainer fees of between $3,000 and $5,000 per month, per client company, plus, typically a small percentage of the gross dollar value of the goods shipped. We will teach you how to capitalize on the availability of excellent government resources. And you will be performing a Patriotic Duty by helping companies export and contribute to reducing the National deficit.\r\n</p>\r\n<p>\r\n\t <strong><em>&ldquo;You are essentially who you create yourself to be and all that occurs </em><em>in your life is the result of your own making.&rdquo;</em></strong>\r\n</p>\r\n<p>\r\n\t ― Stephen Richards, <em>Think Your way to Success: Let Your Dreams Run Free</em>\r\n</p>", 
    "end_date": null, 
    "title": "Export Consulting: Filling the Tremendous National Need", 
    "price": "35.00", 
    "instructors": "Richard Yanni", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/57297_c013_7.jpg", 
    "course_url": "https://www.udemy.com/export-consulting/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-30T14:16:44Z"
}