{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Retail buying and merchandising is a very exciting field that looks at how retail enterprises go about planning the buying and selling of the right products, at the right place, right time, in the correct quantities, to the correct customer and at the correct price.</p><p>However, it isn't an easy topic to get your head around and that's largely due to the fact that the subject matter is littered with specialised terminology, concepts, jargon, acronyms, etc. For individuals who are new to the field it can be quite daunting to understand what these concepts mean, let alone getting a full picture of how everything ties in together to realise the complex clockwork of the buying and merchandising cycle.</p><p>This course in retail buying and merchandising is quite special - special in the sense that it isn't your regular textbook or mishmash of explanations and it doesn't make assumptions on prior knowledge. This means that you'll be able to connect with the concepts regardless of your educational or professional background.</p><p>Furthermore, the course decomposes the topic into a number of fundamental but interrelated perspectives that describe the subject matter in a logical way. These perspectives define the course structure and also allow the discussion of useful examples taking into account the real-life industry aspects.</p><p>The course comprises of a range of audio-visual lectures with exercises towards the end of each relevant section to test your understanding of the topic.</p> So, are you ready to go from newcomer to all-rounder in retail buying and merchandising? You've stopped at the right course that's going to fast track your learning in record time!", 
    "end_date": null, 
    "title": "Fast Track Retail Buying and Merchandising", 
    "price": "25.00", 
    "instructors": "Dr. Tish Chungoora", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565318_7e67_4.jpg", 
    "course_url": "https://www.udemy.com/fast-track-retail-buying-and-merchandising/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T17:48:17Z"
}