{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t               Fire resistance of building structure&laquo; means the ability of the structure exposed to fire the appropriate time maintaining its strength. To recognize the precise value of the duration in which the construction retains its capacity, is crucial for fire-resistant design. Fire analysis calculation takes into account the actual technical state of construction material exposed to thermal impact or fire load and provide you with the critical temperature, e.g. the temperature to which the structure maintains its capacity or advice you of the optimal fire protection of the structural elements.  </p>  <p>  \t <strong style=\"\"> Why must we learn Fire Analysis?</strong>  </p>  <p>  \t              Because we do not want that we have fire protection, which is oversized and as well uneconomical. On the other hand we do not want that the construction is in fire risk and does not allow a safe evacuation, as well as fire extinguishing and rescue.  </p>  <p>  \t<strong style=\"\">Course Structure</strong>  </p>  <p>  \t            In this course, I will present a thorough overview of structural fire analysis according to nominal temperature-time curves according to Eurocodes.  </p>  <p>  \t   We will learn the following topics:<br style=\"\">  \t  - What is thermal action?<br style=\"\">  \t  - How to calculate temperature of protected and unprotected steel sections<br style=\"\">  \t  - How to create load combinations for the fire limit states<br style=\"\">  \t  - How to calculate fire resistance of structural members and their critical temperature<br style=\"\">  \t  - Fire protection systems for steel structures  </p>  <p>  \t  All chapters will also provide you with worked examples which will cover theoretical part presented. At the end you will be presented a calculation of critical temperature and required fire protection for typical structural elements of real structure.  </p>  <p>  \t           I will provide you with an easy-to-follow material explanation, each section is clearly demonstrated in the presentation and covered with worked examples.  </p>", 
    "end_date": null, 
    "title": "Fire Analysis of Steel Structures according to Eurocodes", 
    "price": "50.00", 
    "instructors": "Primoz Kvaternik, M.Eng.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/113856_21a9_7.jpg", 
    "course_url": "https://www.udemy.com/fire-analysis-of-steel-structures-according-to-eurocodes/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-01T15:17:24Z"
}