{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This “How to Become a Wedding Planner and Event Planner” course is presented exclusively by Debbie Orwat. Debbie is the Founder &amp; Chief Inspiration Officer at Planner's Lounge where she empowers event planners with the tools and resources they need to succeed.</p>    <p>Have ever considered getting into the wedding and event planning industry? Or have you recently started working in this career but aren't experiencing the success you hoped for? Or maybe you have taken another class or course but still don't know where to get started. If you have experienced any of these situations, this course is for you.</p>    <p>Each lecture covers different elements and strategies about working in the industry. Watch each lecture at your own pace or download individual lectures to view when you don't have internet access. There are also supplemental materials included with two of the lectures.</p>    <p>Students have unlimited access to the course and can ask questions to the instructor. There are no tests with this course.</p>    <p>This “How to Become a Wedding Planner and Event Planner” course comes with a 100% money back guarantee if you aren't completely satisfied in the first 30 days after watching the entire course.</p>    <p>Register now for immediate access and take the next step towards a successful career in wedding and event planning!</p>    <p>Take this course now and learn how to become a wedding planner and event planner!</p>", 
    "end_date": null, 
    "title": "Getting Started as a Wedding and Event Planner", 
    "price": "45.00", 
    "instructors": "Debbie Orwat", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/26482_08a9_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-wedding-planner/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-11T12:50:16Z"
}