{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>What is Advance Care Planning?</strong> </p><p>“It encompasses not only preparation of legal documents but also discussions with family members and physicians about what the future may hold for people with serious illnesses, how patients and families want their beliefs and preferences to guide decisions and what steps could alleviate concerns related to finances, family matters, spiritual questions and other issues.\" – Institute of Medicine </p><p><strong>What is Health Literacy?</strong></p><p>“The degree to which individuals have the capacity to obtain, process, understand and act on basic health information and services needed to make appropriate health decisions. This includes obtaining, interpreting and processing health insurance plans, compliance with prescribed treatment plans, reading labels, and reading directions on prescription bottles.\" –Department Health and Human Services</p><p><strong>What is Cultural Competency?</strong></p><p>“Culture is often described as the combination of a body of knowledge, a body of belief and a body of behavior. It involves a number of elements, including personal identification, language, thoughts, communications, actions, customs, beliefs, values, and institutions that are often specific to ethnic, racial, religious, geographic, or social groups. For the provider of health information or health care, these elements influence beliefs and belief systems surrounding health, healing, wellness, illness, disease, and delivery of health services. The concept of cultural competency has a positive effect on patient care delivery by enabling providers to deliver services that are respectful of and responsive to the health beliefs, practices and cultural and linguistic needs of diverse patients.\" –National Institute of Health </p><p><em>Health Literacy and Cultural Competency in Care Planning </em>will show how Health Literacy and Cultural Competency play a role in Advance Care Planning. Dr. Frances Jackson, PhD, RN discuss personal and professional thought provoking stories that will help students learn this material. The PowerPoint is available for download in the first lecture. We suggest you print it out and take notes to better understand the material. </p>", 
    "end_date": null, 
    "title": "Health Literacy and Cultural Competency in Care Planning", 
    "price": "50.00", 
    "instructors": "Practice Transformation Institute", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525146_1ad0.jpg", 
    "course_url": "https://www.udemy.com/health-literacy-and-cultural-competency-in-care-planning/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T14:01:34Z"
}