{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">About This Course</strong></p><p>Oil &amp; Gas supports the very fabric of our modern, connected, switched-on society and has become central to our way of life. From car fuel, to electricity, to petrochemicals and plastics, Oil &amp; Gas as an energy source plays a vital role in our current energy mix. If you&#039;re new to the industry or ever wondered how it all works, this is the course for you!</p><p>Become familiar with the various phases of the Oil and Gas value chain, upstream, midstream and downstream – recognize key industry players and understand the lifecycle of an oil and gas field from seismic surveys and geology to drilling engineering and production and all the way through to decommissioning. </p><p>Whatever your motivation, this course is designed to add value to your learning by delivering an overall picture of how this remarkable industry works with both technical and commercial know-how. With a modern approach to learning, we can ensure that you&#039;ll get both accurate and up-to-date knowledge of the oil and gas industry, wherever you are in the world.</p><p><strong style=\"\">What&#039;s Included?</strong></p><p>This course consists of 10 modules – audio recordings with accompanying annotated presentation material. Each module is divided into a series of short videos designed to optimise your learning experience. </p><p>You will start by exploring the uses and characteristics of oil &amp; gas as well its history and you will develop a strong understanding of the key players in todays industry. You will move on to look how hydrocarbons are formed below the earth&#039;s surface and how these are oil and gas companies use survey methods and seismic techniques to explore these energy resources. Next, you will gain an insight into drilling operations, the production and platform processing involved and the transport, storage and refining of crude oil and natural gas. In the final part of the course you will gain sound knowledge on the decommissioning process of oil and gas installation and acquire an insight into working offshore.</p><p>10 modules and over 1 hour of content!</p><p><strong style=\"\"></strong>Module 1: Characteristics of Oil &amp; Gas</p><p>Module 2: History and Structure of the Modern Oil &amp; Gas Industry</p><p>Module 3: Formation of Oil and Gas</p><p>Module 4: Exploration – Finding Oil &amp; Gas</p><p>Module 5: Drilling Operations</p><p>Module 6: Production &amp; Platform Processing</p><p>Module 7: Maximizing Recovery</p><p>Module 8: Transport, Storage &amp; Refining</p><p>Module 9: Decommissioning</p><p>Module 10: Working Offshore <strong style=\"\"></strong></p><p><strong style=\"\">How Does it Work?</strong></p><p>The course is broken down into modules, which consists of a detailed presentation accompanied by an audio lecture that takes about 1 hour to complete. Each module is divided into its major topics which are presented with slide annotations. This ensures that the material is easy to digest enhancing your learning experience. </p><p><strong style=\"\">Why Take this Course?</strong></p><p>This course is ideal preparation for newcomers to the industry or anyone who ever wondered how the Oil &amp; Gas sector works. However, anyone working in the oil and gas industry would benefit because the course provides a broader and more-comprehensive overview of the industry than can usually be obtained from on-the-job learning.</p><p>Now, more than ever, is the time to take this course! The industry faces some difficult challenges and those working in the industry and members of the public need to better understand the complexities of this environment.</p>", 
    "end_date": null, 
    "title": "How to be an Expert in the Oil & Gas Industry ", 
    "price": "20.00", 
    "instructors": "Energy Academix", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513930_f961_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-the-oil-gas-industry/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T19:12:32Z"
}