{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Part  Three – Relationship Management, Relationships with Yourself and Others</strong>  </p>  <p style=\"\">  \t   How To Be A High Performance Insurance Broker  was designed for insurance agency principals and brokers to show you the exact steps to creating your practice precisely the way you want it to be.  The course was designed to help you unlock all of the potential that you and your practice possess.  This is the complete guide for insurance agency principals who want to maximize revenue, maximize profit, and enjoy their practice more, while not adding more hours to their work week.  It has come out of the culmination of 11 years of working directly with agency principals on development and peak performance.  </p>  <p style=\"\">  \t  We highly recommend you take all four parts, however, each part is a comprehensive course in and of itself.  </p>  <p style=\"\">  \t <strong style=\"\">Materials Included:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Video Lectures</li>  \t<li style=\"\">Handouts</li>  \t<li style=\"\">Exercises</li>  \t<li style=\"\">Quizzes</li>  </ul>  <p style=\"\">  \t <strong style=\"\">Time Requirements:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Lectures &amp; Handouts 4 hours</li>  \t<li style=\"\">Exercise 10 - 15 minutes per day </li>  </ul>  <p style=\"\">  \t   Summary – In this course, you will examine your relationship with both yourself and others.  You’ll understand why having a good working relationship with yourself is necessary before you can have solid relationships with others.  You will learn how managing the relationships with others can be the best sales skill you ever learn.  You’ll also understand the different styles of communication and the most effective communication style in relationship management.  You’ll learn why relationship management is so important to being a high performance insurance practice.  </p>", 
    "end_date": null, 
    "title": "How to be a High Performance Insurance Broker Part 3", 
    "price": "30.00", 
    "instructors": "Mike & Maria Keiser", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/198756_ba41_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-high-performance-insurance-broker-part-3/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-14T14:33:17Z"
}