{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                             By <strong>Sasha O&#039;Leary</strong> and<strong> Lloyd Ball</strong>  </p>  <p>  \t<strong>Learn How to Plan Events and Attract Corporate Sponsors. </strong>Included: &quot;Done for you&quot; proposals, tools, and scripts so you can start an event planning business from scratch.  </p>  <p>  \t          Do you have a great product, an amazing talent or a business that would totally explode if more people knew about it?  </p>  <p>  \t                       By the end of this course, you&#039;ll be able to host a professional event that will sell out and attract influential people. The cool part is, you&#039;ll learn how to do this without using any of your own money! The byproduct of throwing successful events is your business will become well known and your influence will grow. This course is perfect for startups. That&#039;s the bottom line. <em>Don&#039;t take our word for it, read the reviews from our students.</em>  </p>  <p>  \t                            For now, let&#039;s look at this purely from a financial perspective... You&#039;ll learn:  </p>  <ul>  \t<li>How to host phenomenal events using NONE of your own money.</li>  \t<li>How to get cash sponsors. Worth $20,000.</li>  \t<li>How to get your venue for free. Worth $10,000.</li>  \t<li>How to get free food. Worth $10,000.</li>  \t<li>How to get free alcohol and other beverages. Worth $5,000</li>  \t<li>How to create awesome SWAG bags for all your guests.</li>  </ul>  <p>  \t                              You might be thinking that this course is so cheap that it&#039;s too good to be true... The truth is, average event planning consultants charge $3000 per month, per event, for just a few of these tactics. Our goal is to inspire business people all over the world and we simply can&#039;t do this at a $3,000 price point. We decided to put the mission first and charge a fraction of that price. <em>If you apply just one of our sponsorship tactics, you&#039;ll recoup your investment 50 times over.</em>  </p>  <p>  \t                            Now, lets look at this from a branding perspective. You&#039;ll learn:  </p>  <ul>  \t<li>How to get big brands and your favorite companies to sponsor your events.</li>  \t<li>How to get influential people and local celebrities to show up.</li>  \t<li>How to get the press to write articles about you and your event.</li>  \t<li>How to leverage the celebrity and credibility of established brands to build your brand.</li>  </ul>  <p>  \t                              If you had to pay a PR/Marketing company for these things, the costs would be in the tens of thousands. It would also take you years of hard work. We know first hand. It&#039;s constant a grind.  </p>  <p>  \t<strong>       To make things easy and to give you a big head start, we&#039;ve created these powerful tools for you to use:</strong>  </p>  <ul>  \t<li>4 Versions of our &quot;Ultimate Sponsorship Package&quot;. These are the exact ones we&#039;ve used to get hundreds of thousands of dollars in cash and free stuff. You&#039;ll be surprised at the simplicity.</li>  \t<li>Our budget worksheet to keep you on track with expenses. Along with this comes an actual case study of one of our events. Check out this free video: &quot;How We Hosted a $31,000 Party for $0 and Raised $10,493 for nonprofits&quot;. This will show you exactly what you&#039;ll learn how to do.</li>  \t<li>Our day of event sheet so everyone/everything is organized, prepared and accountable.</li>  \t<li>Our scripts to land sponsors, media and celebrities. You&#039;ll have the exact language we use.</li>  \t<li>The brainstorming sheet we use to come up with a massive list of sponsors.</li>  </ul>  <p>  \t<strong>       This course is NOT for everyone. To qualify, you should:</strong>  </p>  <ul>  \t<li>Have a business, idea or cause. (An Event Business is perfect as well)</li>  \t<li>Have some experience with social media.</li>  \t<li>Have room in your life for more relationships.</li>  \t<li>An open mind toward networking.</li>  \t<li>You could use more excitement in your life.</li>  </ul>  <p>  \t<strong>OUR STORY</strong>  </p>  <p>  \t         4 years ago we took a serious look at our real estate business and knew something had to change. Our products and services were amazing but we needed to get the word out. Our growth was stagnant. The conventional ways of getting business became less effective. We needed to light a fire. We had to do something fast!  </p>  <p>  \t         When we hosted our first big event, we had no idea what was in store. Our goal was really just to market our business and do some networking. We knew if we could get a bunch of people in a room together, good things would happen. What really happened was not what we expected! It completely blew us away…  </p>  <p>  \t         We were not celebrities or rich kids so we didn&#039;t have huge financial backing or anything like that. All the money we made during the real estate boom had been destroyed by the economic bust. We were forced to learn how to create something out of nothing. We sold a story… and as it grew, it became legend.  </p>  <p>  \t         &quot;Who are these kids?&quot; We heard it over and over. It was like God dropped us out of heaven. We appeared on the scene as if we were Seattle&#039;s best kept secret. News articles and press coverage followed. Opportunities and referrals showered upon us. Awards and perks came from every direction. Yes, our business exploded.  </p>  <p>  \t         It can happen to you.  </p>  <p>  \t         What we&#039;ve learned is that most event planners focus on the wrong things. They claim that hosting events is difficult. It&#039;s not. It&#039;s actually pretty easy.  </p>  <p>  \t         The hardest part is getting sponsors and getting great people to show up. That is the exact focus of this course and we make that simple for you.  </p>  <p>  \t                              NEED MORE? CHECK OUT THESE FREE VIDEOS AND DOWNLOADS:  </p>  <p>  \t                              1.) How We Hosted a $31,000 Party for $0 and Raised $10,493 for nonprofits. This includes a downloadable budget worksheet with an actual case study of one of our events.  </p>  <p>  \t                              2.) Red Carpet Tips. In part one, we explore how you can leverage the red carpet to get business prospects as well as attract influential people to your events.  </p>  <p>  \t                              3.) Intro to Sponsors. This video dives into everything you&#039;ll learn in our sponsorship section.  </p>  <p>  \t                              4.) Creating a Content Explosion.  </p>  <p>  \t                              ***NONPROFIT ORGANIZATIONS are eligible for a scholarship.*** We have a heart for community workers and people who are making this world a better place. This is our way of showing our appreciation. Please contact us through Udemy for details!  </p>  <ul>  \t<strong><strong> </strong></strong>  </ul>", 
    "end_date": null, 
    "title": "How to Throw Events and Attract Corporate Sponsors", 
    "price": "50.00", 
    "instructors": "Lloyd Ball", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/93620_4496_7.jpg", 
    "course_url": "https://www.udemy.com/marketmover/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-17T17:16:00Z"
}