{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Drilling for oil and gas is one of the most dynamic and exciting professions in the world. A career in the drilling industry allows world wide travel and can be rewarding professionally, personally and financially! There are tremendous opportunities for individuals that are able to develop an expertise and gain experience in the field. The challenge can be finding and taking advantage of those opportunities!\n\n  </p>\n\n<p><strong>This course will provide students with the knowledge they need to become more competitive while seeking employment or starting their career.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course we will review the entire process of drilling oil and gas wells. The course was designed to progressively build and develop the students’ knowledge.  We start off by focusing on the different types of drilling rigs and which applications they are most suited for. Once a general knowledge of the rigs is acquired we will focus on the rig systems that allow wells to be drilled. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Following the rig systems we begin to focus on petroleum geology. We review the characteristics of petroleum reservoirs and how they are formed. We then review the pressures encountered while drilling and how this affects the drilling operations. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The components of the drill string including bottom hole assembly will be discussed in detail. We will focus on common components of the drill string in strait and direction wells. Bit selection will also be an important topic covered. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>At the end of this course you will be able to talk confidently about the drilling process in an interview, with co-workers or in general conversation with friends.</p>", 
    "end_date": null, 
    "title": "Introduction to Oil and Gas Drilling", 
    "price": "20.00", 
    "instructors": "Dynamic Knowledge", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642714_2c7b_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-oil-and-gas-drilling/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T18:58:30Z"
}