{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t This course is appropriate for medical professionals, or current students of medical professional schools, that requires an understanding of general/primary medicine. Such professionals include and are not limited to: Physician Assistant, Advance Practice Nurse (Nurse Practitioner), Dental students, Medical Students, Podiatry students, and Optometry students.  </p>  <p>  \t If you&#039;re not sure this course would apply to you, feel free to review the topics covered in the curriculum, and if you believe it covers your area of study, and I have yet to mention your field above, please let me know.  </p>  <p>  \t As a practicing PA, I have working knowledge of the content required for the licensing exam. However, the information presented in this course is applicable to any medical professional who requires a strong foundation in primary medicine.  </p>  <p>  \t For each body system we will review:  </p>  <p>  \t &middot;The history and physical exam findings for a specific disease  </p>  <p>  \t &middot;Disease epidemiology and pathogenesis  </p>  <p>  \t &middot;The lab work/imaging that would be ordered and the expected abnormalities  </p>  <p>  \t &middot;The treatment options and preventative measures (when applicable)  </p>  <p>  \t After each organ system has been reviewed, you will be presented with a short quiz to test what you have learned. Reinforcing your knowledge with questions similar to those seen on the PANCE (Physician Assistant National Certifying Exam) and PANRE (Physician Assistant National Recertifying Exam) will not only test your knowledge, but also show the areas you may need to focus on independently.  </p>  <p>  \t A quick review of the basics of the history and physical exam, commonly tested labs, important EKGs, and specific imaging modalities are touched upon as well.  </p>  <p>  \t The final portion of the course will help you create a study plan and motivate you to maintain your study pace, and help you feel confident before taking the exam. After all, your medical license depends on your success.  </p>", 
    "end_date": null, 
    "title": "Jump Start: Primary Medicine for Allied Health Professions", 
    "price": "50.00", 
    "instructors": "Megan Steel, MSPA, PA-C", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/90364_e523_9.jpg", 
    "course_url": "https://www.udemy.com/jump-start-primary-medicine-for-allied-health-professions/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-10T02:52:41Z"
}