{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  The students who take this course will learn to master the reading and interpretation of Industrial Piping and Instrumentation Diagrams. Students will be using actual Industrial Prints as study material. This course should be completed in just one hour using step by step video lessons.  </p>  <p style=\"\">  \t  The understanding of Piping and Instrumentation Diagrams is a &quot;must have&quot; skill for Job seekers in several career choices. These include drafting, power plant operation and maintenance, refinery operation and maintenance and workers involved in the construction of industrial facilities.  </p>  <p style=\"\">  \t  Pipe-fitters, welders, plumbers, instrument and control technicians, plant operators and draftsmen all need this skill to excel in the workplace.  </p>  <p style=\"\">  \t  P&amp;ID&#039;s are used worldwide in construction and operation of large and small industrial projects. The ability to read and understand them will give those who complete this course an edge over their competitors when seeking employment at one of these facilities.  </p>  <p style=\"\">  \t  Many industrial facility Lockout/Tagout systems require knowledge of P&amp;ID interpretation to safely isolate equipment to prevent accident, injury or equipment damage .  </p>  <p style=\"\">  \t  Many employers training budgets are strained and are not equipped to provide adequate training on working with P&amp;ID&#039;s. This is the way to obtain the training here and now, and In just one hour!  </p>  <p style=\"\">  \t  Companies looking for a way to obtain this training will find this course an extremely economical method of providing this these important skills to their employees.  </p>  <p style=\"\">  \t  This course is also a great refresher for anyone who is already working in the industrial field.  </p>  <p style=\"\">  \t  Included in the course are access to several sample diagrams and the P&amp;ID keys to interpret them. Students will be able to practice and become even more proficient with these bonus items. The instructor has included email interaction as an option for students and inquiries will be answered in a timely manner.  </p>  <p style=\"\">  \t  The course starts by initiating the students in to basic blueprint reading. (Which is also used in electrical, hydraulic and mechanical fields of expertise) Then moves on to familiarize the students with simple to complex process flow features, such as instrument loops. Symbols are also discussed thoroughly. These include valves, components, instrumentation, piping, lines and signals. The final lecture discusses flow paths and follows the flow path of an actual extremely complex working industrial drawing.  </p>  <p style=\"\">  \t  This course is taught by an experienced instructor on this subject. He has trained hundreds of plant operators in the power generation field.  </p>", 
    "end_date": null, 
    "title": "Learn to Read Industrial Piping and Instrumentation Diagrams", 
    "price": "20.00", 
    "instructors": "Rowland Blinston", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/202274_82f0_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-read-industrial-piping-and-instrumentation-diagrams/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-20T22:32:55Z"
}