{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you  ever had an idea of a story for children, but you did not know where to start? Or  have you dream of becoming a self-published author but you thought that you could not afford it? Have you heard about the success of Amazon Kindle authors and wondered how they found success?…If the answers to any of these questions is yes then this is the course for you. </p><p>In this course you will learn how to make your ideas and characters come alive. I will show you how:</p><ul><li>to properly research the kindle market place</li><li>to organize your book idea </li><li>to find high quality illustrators inexpensively</li><li>to format you book for Amazon Kindle </li><li>to get a printed version of your book</li></ul><p>Children's books are necessary to the progression and the literacy of children. With the spawn of Kindle more and more parents are buying Kindle tablets for their children. This means that the doors for self-publishing of kindle books are wide opens for aspiring authors like you.</p><p>The course is a video course that is in chronological order which will allow you to follow me from start to finish. You will watch me take my idea to a physical book. The course is </p><ul><li>less than 2 hours </li><li>easy for a beginner to follow</li><li>you will learn the process of becoming a self-published author   </li></ul><p>There is no limit to the amount of books that you can bring to the market place. The choice is up to you the student. There are Kindle book children's authors that are making upwards of $5,000+ per month. That is due to the fact that they remain consistent in the release of their work. I cannot promise or guarantee the same results. However, one thing is for sure,If you follow my lead in this course then you too will be a self- published children's book author without all the expensive overhead of traditional publishing.</p><p>So if you are ready to become a self-published author purchase this course today.</p>", 
    "end_date": null, 
    "title": "Learn How to Publish Your First Children's Book on Amazon ", 
    "price": "20.00", 
    "instructors": "Ashanti Titus", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564458_cb51_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-publish-your-first-childrens-book-on-amazon-kindle/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-25T15:11:36Z"
}