{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>New Updates May 7, 2016.  The Life Coaching Industry is booming, do you want to be a part of that?  If you don't have thousands to spend on a life coach certification course but you still want high quality life coach training, </strong>you are in the right place because this course by Louise Anne Maurice of <strong>Wealth Coach Academy</strong> was created for you.  <strong>   </strong></p>\n\n<p><strong></strong></p>\n\n\n\n<p><strong>Life Coach Training: Life Coach Certification Foundation Course </strong>is for you if: </p>\n\n\n\n<ul><li>You are interested in becoming a paid Life Coach as a business or to use with your current career but you don't want to spend thousands.</li><li>You want done-for-you resources so you don't have to spend time and money creating coaching tools yourself.</li><li>You want to discover if being a life coach is a good career path for you without investing a large amount of money. </li><li>You want to start a business as a Life Coach and are looking for a simple plan.</li></ul>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong>Why take <strong><strong><strong><strong>Life Coach Training: Life Coach Certification Foundation Course</strong></strong></strong></strong>?</strong></p>\n\n\n\n<ol><li>Take the guess-work and expense out. Learn how to become a life coach by next week.</li><li>Today you will feel more confident about your life coaching skills.</li><li>Tomorrow you will get into action because the course gives you an incentive for applying what you learned.</li><li>Next week things start to happen because you have a plan in the right order that guides you step-by-step.</li></ol>\n\n\n\n<p>****************************************************************************************************************</p>\n\n\n\n<p><strong>What is covered in </strong><strong><strong><strong><strong>Life Coach Training: Life Coach Certification Foundation Course</strong>? </strong></strong></strong></p>\n\n\n\n<p> </p>\n\n<li>Determine what it takes to develop yourself into a life coach that is successful financially.</li><li>Increasing your life coach salary begins here! Become skilled in the essential business aspects of running a successful life coaching business</li><li>Discover the Wealth Coach Academy Life Coaching Process for Personal clients</li><li>Discover the Wealth Coach Academy Life Coaching Process for Business clients</li><li>Uncover your unique life coaching skills</li><li>You walk away with a life coaching framework to follow so you feel more confident as a life coach.</li><li>Plus you receive the <strong>bonus e-course called \"How to Become a Life Coach for Free\"</strong> that you can keep and reference whenever you are building your life coaching business. </li><p>****************************************************************************************************************</p>\n\n\n\n<p><strong>How will </strong><strong><strong><strong></strong></strong></strong><strong><strong>Life Coach Training: Life Coach Certification Foundation Course</strong> </strong><strong>Benefit You?</strong></p>\n\n\n\n<ol><li>I know you are busy and I have meticulously created this course with your success in mind. This training is no-fluff essential information you need to succeed easily and quickly.</li><li>Let me show you exactly how to succeed by giving you a life coaching plan like no other.</li><li>You get insights and step-by-step instruction that show you how to succeed and help people move past limitations.</li><li>You get the inside track on what you need to do plus the exact plan to make it happen in the right order.</li><li>If that's something you would like to achieve, you have selected the right course to take. If you complete this entire course and implement everything you learn you will have a good solid foundation to build upon.</li><li>Remember, it doesn't matter what stage you are at, I can show you how to make success happen.</li></ol>\n\n\n\n<p>***************************************************************************************************************</p>\n\n\n\n<p><strong>When Can You Take </strong><strong><strong><strong>Life Coach Training: Life Coach Certification Foundation Course</strong></strong></strong><strong>?</strong><strong></strong></p>\n\n\n\n<p>What are you waiting for? If you’re looking for a course to show you how to become a life coach and build a successful life coaching business, then look no further.</p>\n\n\n\n<p>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</p>\n\n\n\n<p>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; <strong>NO COST TO YOU</strong>.</p>\n\n\n\n<p>Click on the <strong>\"Take This Course\"</strong> button and start learning instantly</p>\n\n\n\n<p>******************************************************************************************************************</p>", 
    "end_date": null, 
    "title": "Life Coach Training: Life Coach Certification Foundation", 
    "price": "25.00", 
    "instructors": "Wealth Coach Academy, Louise Anne Maurice", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692418_80b0_2.jpg", 
    "course_url": "https://www.udemy.com/life-coach-training-how-to-become-a-life-coach-for-free/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T22:13:38Z"
}