{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Overview of Motivating Safety at Work: this course is a helicopter view of a popular process. It's about employee engagement, reducing and eliminating risk, preventing injuries, and inspiring workers to be happy and productive. Those who take this course may be experiencing behavior-focused and psychology-based business training for the first time. Or, they might be those managers, supervisors, and employees who need a refresher or different way to consider behavior-based safety. Hourly workers who are currently involved in a behavior based safety process, serving on a steering team or employee safety committee, will benefit from this course. Students enrolled in college-level applied psychology, environmental health and safety, or business management programs will also benefit from this course. Those who can not participate in one of our scheduled face-to-face courses, will enjoy this introduction and eventually be able to move through the 4-hour in person course with a firm foundation. <strong>Learn the truth about safety programs, engaging employees, and improving safety performance. You, too, can eliminate lost-time accidents and reduce your worksite's recordable injury rate by 50% within 1 year! What You Will Learn: </strong><strong>How to understand and change behavior in safety situations you encounter every day</strong>, <strong>A method of proactive problem-solving that produces WIN/WIN results,</strong> <strong>communication skills for any safety situation you encounter, a</strong><strong> universal theory of motivation that is easy to apply</strong>, The materials included in this course are video modules with synchronized power point presentations and supplemental materials for each module, including links to relevant resources, additional videos, and articles.  Each module will require 5 to 15 minutes to complete, including your review of the supplemental materials.  And, we expect that it will take the typical student less than an hour to complete the entire course including, viewing the approximately 30 minutes of video instruction, reviewing the supplemental material, and taking the post-course learning gain assessment.  These evidence-based strategies offer the most effective, long-term approach for helping leaders do the right things around safety. Leaders who understand and apply these principles are better able to guide their organizations to safety solutions that produce maximum benefits. </p>", 
    "end_date": null, 
    "title": "Motivating Safety at Work", 
    "price": "50.00", 
    "instructors": "Thomas E. (TED) Boyce, Ph.D.", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560000_3946_5.jpg", 
    "course_url": "https://www.udemy.com/motivating-safety-at-work/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T03:59:14Z"
}