{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Student Reviews from Discover How Obamacare Works:</strong></p><p><strong>Obamacare</strong> \n</p><p><em><strong>\"This course is a valuable tool for everybody. It is very complete\nand has many examples. The instructor shows a real interest in\nteaching the subject. I recommend this course\". Milciades Andrion</strong></em></p><p><strong>Untangling the mysteries of the Affordable\nCare Act</strong> \n</p><p><strong><em>\"As a self-employed single mom, I've had a terrible time trying to\nfigure out the Affordable Care Act. (And I work in healthcare.) This\nclass really helped me to figure out ways to save as much money as\npossible (since rates will keep going up for people like me)\".</em> Jennifer Schmid, MSN, RN,\nCNL</strong><strong></strong></p><p><strong>Missed the enrollment period. There's still\nhope!</strong> \n</p><p><strong><em>\"Nice information regarding qualifying for this program even if you\nhave missed the enrollment deadline. Thanks to this course, I now\nrealize that I do qualify for this program through one of the\nqualifying events. Hats off Dr. Taffy Wagner\"! </em>David Young</strong><strong></strong><br></p><p>  \t                                        Join over 1,000 happy students  </p>  <p>  \t<strong>Latest updates: November 2015</strong></p>  <p>  \t                                        Did you know prior to healthcare reform there was 57 million uninsured Americans? </p><p>Do you know today, November 2015 there are still 30 million uninsured Americans?</p><p>Do you know as of May 2015, there are 31 million UNDER-insured Americans?</p><p>Uninsured or under-insured, what does Obamacare mean to you? <br></p>  <p>  \t                                        Health is personal and private especially when it involves money. No need to be frustrated and react to what is happening in the healthcare industry because you don't understand it. Don't delay taking care of your health because you don't have insurance and believe there are no options.  </p>  <p>  \t                                        This course reveals what Obamacare (The Affordable Care Act) is and what it means to you and your family.  </p>  <p>  \t                                        This course will show you up close and personal:  </p>  <ul>  \t<li>Why      healthcare reform was started</li>  \t<li>What      the goals of Obamacare are</li>  \t<li>Learn      the different kinds of health insurance plans</li>  \t<li>The      pros and cons </li>  \t<li>The 10      Essential Health Benefits required for a plan to be insurance</li>  \t<li>How to      apply for coverage</li>  \t<li>How to      use the Marketplace</li>  \t<li>Whether      or not you can keep your current insurance and much, much more.  </li></ul>  <p>  \t                                        As a student of this course, you can send me a message through email regarding your personal situation and Obamacare for recommendations.  </p>  <p>  \t                                        This course will continue to grow as the constant updates and changes are made to health care reform. I spend a lot of time studying Obamacare and will share that information.  </p>  <p>  \t                                        You can get this information and make an educated decision regarding the new health insurance law and how it applies to you.  </p>  <p>  \t                                        Spend the next two hours getting the information that millions haven't heard even though their lives are being affected.  </p>  <p>  \t                                  This course is delivered through videos, audios and downloadable pdfs.  </p>  <p>  \t                                        Click the “take this course\" button, top right now… not having this information can cost you money which leads to stress and frustration.  </p>", 
    "end_date": null, 
    "title": "Obamacare - What Everyone Should Know About Health Insurance", 
    "price": "20.00", 
    "instructors": "Taffy Wagner", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276258_47cd_4.jpg", 
    "course_url": "https://www.udemy.com/how-does-obamacare-the-affordable-care-act-work/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-06T22:25:29Z"
}