{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to <strong>Workplace Safety OSHA's General Industry Training </strong>for Employees and Businesses from LearnSmart.</p><p>In this <strong>OSHA series</strong>, you will be introduced to the general safety requirements that any employee should be aware of and provides a comprehensive overview of general workplace safety that companies seek and can require their employees understand and adhere to. These health and safety programs and procedures in this course are derived from federal <strong>Occupational Safety and Health Administration (OSHA) regulations.</strong></p><p>This course focuses and aligns closely with <strong>OSHAs General Industry Training Requirements, 29 CFR Part 1910</strong></p><p><strong>Course Breakdown:</strong></p><p><strong>Section 1</strong>: In the pre-assessment quiz you'll face questions that test your current workplace knowledge, get to know your strengths and weaknesses.</p><p><strong>Section 2</strong>: Gain background information about OSHA and OSHA standards, inspections, citations, and penalties. At the end of this course, you will be able to distinguish between the role of OSHA and the role of the office of Environmental Health and Safety (EHS).</p><p><strong>Section 3</strong>: By recognizing and applying the basic values of industrial hygiene to the work environment, the workplace will become healthier and safer. Learn how to identify sources of potential problems, about the different types of hazards, and how to control and respond to those hazards in the workplace.</p><p><strong>Section 4</strong>: Whether you are a business owner looking for ways to improve costs and workplace safety, or a worker interested in learning more about how a safety and health program can benefit you.</p><p><strong>Section 5</strong>: OSHA Standards for Personal Protective Equipment takes a deeper look at using PPE controls in the workplace. This section describes the two primary means of protecting employees from workplace hazards before considering PPE; explains what should be included in PPE training; lists PPE that may be used for protection; and identifies hazards that are reduced or eliminated by using the appropriate PPE for eye, face, head, hearing, foot, hand and body protection.</p><p><strong>Section 6</strong>: A respirator is a device that is intended to protect employees from inhaling dangerous substances, such as chemicals and infection particulates. Respirators are among the most important parts of protective equipment for working in hazardous environments. Identify what respirators are, how respirators function, and what is needed for a respirator to provide protection.</p><p><strong>Section 7</strong>: Define terms such as floor opening, standard railing, standard toeboard, floor hole, and wall opening. You will be able to identify safety requirements to help prevent walking and working surface hazards related to general housekeeping floors, walls, open-sided surfaces, stairways, ladders, and scaffolding.</p><p><strong>Section 8</strong>: OSHA's Hazard Communication Standard (HCS) is base on a simple concept - that employees have both a need and a right to know the hazards and identities of the chemicals You are exposed to when working. HCS addresses the issues of evaluating and communicating chemical hazard information to workers. In this section we will be giving the student an in-depth look into hazard communications and how it affects the workplace.</p><p><strong>Section 9: </strong>Hazardous Materials focuses on OSHA's requirements for hazardous materials and hazardous waste operations; the requirements for emergency response at uncontrolled hazardous worksites and treatment, storage and disposal facilities; and the steps an employer must take to protect the health and safety of employees in these environments.</p><p><strong>Section 10:</strong> The need for BBP training is essential for employees who are constantly at risk of exposure to blood, fluids, or other contaminated materials that are known to cause illnesses, or even death. This training identifies the types of BBPs, BBP exposure, and the proper protection from exposure, how to dispose of contaminated or used materials, and what to do in the event of exposure.</p><p><strong>Section 11</strong>: Find and identify the standards that are place in order to prevent these hazards, as well as the primary concerns associated with design and construction, ventilation, ignition sources, and storage. The student will be able to identify boiling points and will be able to explain the degrees in which explosions can occur and how to prevent them.</p><p><strong>Section 12:</strong> Employers must train employees about fire hazards that exist in the workplace, how to prevent fires, and what to do in the event one occurs.</p><p><strong>Section 13</strong>: Articulate the importance of ergonomics in the workplace. You will be able to define ergonomics and identify risk factors for musculoskeletal disorders, as well as explain the benefits of using a proactive approach to ergonomics in the workplace. The student will be able to discuss the elements of an effective ergonomic process.</p><p><strong>Section 14</strong>: Identify the four main types of injuries that may result from electrical contact. The student will be able to describe the three types of electrical hazards that may be encountered, and name warning signs that indicate their existence. You will also be able to identify methods of protection from electrical hazards and safety training requirements for working with electrical equipment.</p><p><strong>Section 15</strong>: Gain a thorough understanding of mechanical hazards and the importance of safeguarding machines. You will have learned about different types of guards and devices that will protect them as you work. Employees will understand OSHA standards in regard to machine guarding.</p><p><strong>Section 16</strong>: Solve general hazards related to slips, trips, and falls. You will also be able to explain the proper usage of ladders, stairs, ramps, and loading docks, as well as the common hazards and risks associated with each of these, and how to remedy those hazards and risks.</p><p><strong>Section 17</strong>: Fall Protection provides you with a look at the work conditions that require the use of fall protection and the available options to protect employees from falls. By taking this section, you will be able to identify fall protection methods available for protecting employees; the basic conditions that trigger the use of fall protection for employees in the general industry; and the importance of good work practices and training.</p><p><strong>Section 18</strong>: Locate the minimum requirements for lockout and tagout of energy isolating devices. You will be able to identify employer requirements and responsibilities, device requirements and procedural requirements. The student will also be able to explain the procedures for lockout and tagout, including preparation, procedures involving more than one person, group lockout and tagout, and periodic inspection.</p><p><strong>Section 19</strong>: Distinguish why having an emergency action plan is important. You will be able to identify potential emergencies and what should be included in the plan. The student will be able to describe how to account for personnel, and discuss what kind of medical assistance, security, and training should be made available</p><p>The content in this course comes from <strong>OSHA General Industry Topics</strong></p><p><strong>Recommendations:</strong></p><p>Learn from others! Here are some reviews from participants (Click on reviews to see full list of reviews)</p><ul><li><em>Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- I.A.</em></li><li><em>This course is of high quality - This course will explain you every concept from scratch. The instructor is highly engaging and highly motivating. Can't be better. Thank you -- S.T.</em></li><li><em>Thanks for LearnSmart LLC. Very clear explanation, easy to understand, delivered in very slow and deliberate manner -- R.B.</em></li><li><em>A Complete Jumpstart - What has impressed me the most is the depth of the content to this coarse. Each HD video is crystal clear in both the visual and audio, even including quality closed captioning (great for reading along with the lectures). I wasn't interested in the flashcards or the crossword puzzles when I started the program, but I've found them to be very useful in staying engaged in the class when away from home. This is everything you need to get started and have a classroom quality experience from home. Dive in and stay focused! -- P.C.</em></li></ul>", 
    "end_date": null, 
    "title": "OSHA Workplace Safety (General Industry 10 Hr Class)", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512304_a470.jpg", 
    "course_url": "https://www.udemy.com/osha-workplace-safety-general-industry/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T23:21:04Z"
}