{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                        You&#039;ve been sitting on your manuscript for a while now, overwhelmed by the research you&#039;ve put into getting it published—and hey, that&#039;s perfectly normal. The Internet is bursting with so-called expert opinions, riddled with industry jargon and outdated promises. Oh, and of course, they all contradict each other. So, where should you start? What lies ahead?<br style=\"\">  \t<br style=\"\">  \t                              Now, imagine <strong style=\"\">you have a friend in the book industry</strong>—an award-winning author, who happens to have a marketing background and owns a graphic design company. Wouldn&#039;t it help to sit down with her and <strong style=\"\">ask anything</strong> you wanted? She would <strong style=\"\">break down the process in plain, conversational language</strong> and do her best to prepare you for a career as an author.  </p>  <p>  \t                            That&#039;s basically how this course is run.  </p>  <p>  \t                            Using my own experiences and those of fellow authors, I&#039;m going to walk you through everything from choosing a publishing path (traditional v. independent) to navigating social minefields (like dealing with reviewers)—which is why <strong style=\"\">experienced authors can benefit from the course, too</strong>.  </p>  <p>  \t            Everyone has a weak spot (or two). I can&#039;t tell you how many questions I&#039;ve fielded from other authors about marketing alone, and you know what? I ask them questions, too! That&#039;s the key to survival in this industry. <strong style=\"\">You can&#039;t stop learning and adapting</strong>. Ever.  </p>  <p>  \t                      So, with that in mind, let&#039;s take a look at our course highlights:  </p>  <ul style=\"\">  \t<li>A <strong style=\"\">mix of formats</strong> keep the material entertaining, i.e. animated video presentations, screencasts, worksheets, etc.</li>  </ul>  <ul style=\"\">  \t<li><strong style=\"\">I don&#039;t hold back</strong>. If I think something will be potentially harmful to your career, I&#039;m going to tell you—even if it&#039;s popular right now.</li>  </ul>  <ul style=\"\">  \t<li>For an overview of the material covered, click below to expand <strong style=\"\">What am I going to get from this course?</strong></li>  </ul>  <p>  \t                    I don&#039;t know about you, but I&#039;m excited. <strong style=\"\">Are you ready to get started?</strong> uDemy has a <strong style=\"\">30-day money back guarantee</strong>, so there&#039;s nothing holding you back from giving it a try. If my course doesn&#039;t mesh with the way you learn, apply for a refund. It&#039;s as simple as that. <strong style=\"\">I want my students to be happy. :)</strong></p><p>Note: I <em style=\"\">will </em>update this course to make sure the information hasn&#039;t gone stale or outdated.<br style=\"\"><strong style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "Publish with Confidence: Develop Your Career as an Author", 
    "price": "20.00", 
    "instructors": "Carrie Butler", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419824_9e66_3.jpg", 
    "course_url": "https://www.udemy.com/publishwithconfidence/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T02:39:01Z"
}