{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h5 style=\"\">  <p style=\"\">The rise of the food truck industry has been responsible for transforming ordinary individuals into new entrepreneurs all across the country!<br style=\"\">  </p>  </h5>    <p style=\"\">Today’s food truck owners come from backgrounds that range from corporate executives to the unemployed. In other words, <strong style=\"\">you don’t necessarily have to be a professional chef to own a gourmet food truck!</strong> You just have to have desire and motivation!<br style=\"\">  </p>    <p style=\"\">Does watching your favorite food truck show on TV get you pumped up to start your own business? Can’t stop thinking about owning your own food truck? Well, here are some words of encouragement! <strong style=\"\">The opportunity to start your own mobile food business… along with your chances of success has never been better!</strong> But the problem is that sometimes it’s hard to know where to begin. After all, starting a successful business isn’t something that you can do overnight!</p>  <h5 style=\"\">  <p style=\"\"><strong style=\"\">An Industry With An Amazing Future</strong><br style=\"\">  </p>  </h5>    <p style=\"\">The most encouraging news is that industry experts have estimated that <strong style=\"\">food truck revenues will reach an enormous $2.7 billion</strong> in the next few years. There is huge room for growth and prosperity in the mobile food industry. You’ve probably noticed there are more and more food trucks popping up on the streets. It’s not just coincidence that you’re seeing more of these mobile businesses around. Numerous food truck success stories are fueling this movement. Profits can be made curbside, but food trucks are also expanding their client base through catering and special events. Make no mistake! <strong style=\"\">There are major opportunities for food truck owners.</strong> The only thing you need&nbsp;to do is take action and build your future career!</p>  <h5 style=\"\">  <p style=\"\"><strong style=\"\">Video and MP3 Versions Included</strong></p>  </h5>    <p style=\"\">In addition to all the video modules offered in this course, <strong style=\"\">an MP3 audio version of the entire course will be made available for all students</strong>. This means you can take the training with you whether you&#039;re exercising, commuting or just on the go! Just load the file onto your favorite MP3 player and you&#039;re set!<br style=\"\">  </p>  <h5 style=\"\">  <p style=\"\"><strong style=\"\">What You&#039;ll Learn</strong><br style=\"\">  </p>  </h5>    <p style=\"\">This course will lead you through the <strong style=\"\">important action steps</strong> you need to get into the mobile food industry! Many questions will be answered including:<br style=\"\">  </p>    <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Where to begin?</strong></li><strong style=\"\"></strong>  \t<li style=\"\"><strong style=\"\">How to plan your menu?</strong></li><strong style=\"\"></strong>  \t<li style=\"\"><strong style=\"\">What to include in a business plan?</strong></li><strong style=\"\"></strong>  \t<li style=\"\"><strong style=\"\">How to get funding?</strong></li><strong style=\"\"></strong>  \t<li style=\"\"><strong style=\"\">Where to get the best ingredients?</strong></li><strong style=\"\"></strong>  \t<li style=\"\"><strong style=\"\">How to market your food truck?</strong></li><strong style=\"\"></strong>  \t<li style=\"\"><strong style=\"\">When and how to hire employees?</strong></li><strong style=\"\"></strong>  \t<li style=\"\"><strong style=\"\">And more!</strong></li>  </ul>  <p style=\"\">If you want to start your own food truck, <strong style=\"\">this is the course you need to enroll in!</strong> Get a head start with Street Food University! The rise of the gourmet food truck industry is the <strong style=\"\">golden opportunity</strong> that has motivated individuals everywhere to finally leave their jobs for a career they can be proud of!</p>  <h5 style=\"\">  <p style=\"\"><strong style=\"\">About The Instructor</strong></p>  </h5>Street Food University was developed by the authors of <strong style=\"\">FoodTruckBusinessPlan.com</strong>, a leading online   resource for the food truck industry. Featuring advice on how to get   started in the mobile food industry, how to use technology to market a   food truck business and industry news and happenings.<br style=\"\"><br style=\"\"><p style=\"\">Our primary goal is to help current and future food truck entrepreneurs through education, promotion and awareness of the mobile food industry.</p><p style=\"\">We explore methods to help food truck entrepreneurs market and grow their businesses and then share our findings with the public. The food truck industry is growing rapidly and we aim to stay on top of all new trends. We&#039;ve developed online resources, videos and publications to deliver industry information efficiently.</p><p style=\"\">We offer additional food truck business resources through our online and social media channels:<br style=\"\">  </p>    <ul style=\"\">  \t<li style=\"\"><a href=\"http://twitter.com/startafoodtruck\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">http://twitter.com/startafoodtruck</a></li>  \t<li style=\"\"><a href=\"http://facebook.com/startafoodtruck\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">http://facebook.com/startafoodtruck</a></li>  \t<li style=\"\"><a href=\"http://foodtruckbusinessplan.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">http://foodtruckbusinessplan.com</a></li>  </ul>  ", 
    "end_date": null, 
    "title": "Start Your Own Food Truck - Leave the Corporate World Behind", 
    "price": "35.00", 
    "instructors": "Walkabout Media", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44635_24f6_6.jpg", 
    "course_url": "https://www.udemy.com/streetfooduniversity/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-04T05:01:33Z"
}