{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          &quot;What tech companies serve the travel market?&quot;  </p>  <p>  \t          &quot;What are the gaps and opportunities?&quot;  </p>  <p>  \t               The airline industry is tied to the technology sector since the first Computerised Reservation System (CRS) in the 1960s, a long time before the Internet.  </p>  <p>  \t      With more and more people owning smartphones, the travel industry is looking for the next big idea which will change the way a billion air travellers shop, book, board and fly every year!  </p>  <p>  \t               The course will go through the Passenger Journey and the different touch points to analyse the interaction and understand the needs.  </p>  <p>  \t      The course presents big players in each step of the journey and reveals major gaps in the offering.  </p>  <p>  \t               The first part of the course looks at the IT Landscape of a typical airline.  </p>  <p>  \t               The second section expands the view to the Passenger Journey and explains why airlines cannot own the relationship.  </p>  <p>  \t               The third part focuses on the airline product and how technology improves it.  </p>  <p>  \t             This is a course for entrepreneurs and anyone interested in both airlines and technology.  </p>  <p>  \t    Join the latest of the Airline Business Courses on Udemy!  </p>", 
    "end_date": null, 
    "title": "Technology for Airlines: a Fresh Look at the Ecosystem", 
    "price": "20.00", 
    "instructors": "Frank All", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358722_ca12_4.jpg", 
    "course_url": "https://www.udemy.com/technology-for-airlines/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-28T23:09:52Z"
}