{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    ======  Special 50% OFF - Just £24 Ending Soon ======  </p>  <p>  \t            As a lead generation specialist it's my responsibility to deliver the enquiries to my clients, but it's their responsibility to close that interest into a sale. Having a 50/50 responsibility to the sale I naturally found clients that did extremely well while others less so.  </p>  <p>  \t            With feedback from my high performing clients I created a short course to educate my lower performing clients, I've seen outstanding results. Clients being taken from 1 in 3 close rate to <strong>2 in 3 close rate</strong> whilst generating themselves more leads in the process, effectively more than <strong>doubling their revenue from the same amount of enquiries.</strong>  </p>  <p>  \t            You won't find rocket science in this course or theory, this course is short but every point made is specific and can easily be used in your business, it's proven practical advice that you can benefit from today.  </p>  <p>  \t                This is the exact advice I offer on my coaching sessions with my clients that helps them to <strong>dramatically increase their lead flow and conversion rate. </strong>  </p>  <p>  \t            The Course is broken down into 2 sections, <strong>quoting at home</strong> and <strong>maximising your leads </strong>- heres some of things you will learn that are immediately implementable in your business.  </p>  <ul>  \t<li>What to avoid while quoting the customer at home</li>  \t<li>Are you pricing to fail</li>  \t<li>Essential prop to take with you to the quoting table</li>  \t<li>Dealing with the discounters</li>  \t<li>Honesty as policy</li>  \t<li>How to use the \"Keeping up with the Jones\" mentally in your business</li>  \t<li>Plus much more...</li>  </ul>  <p>  \t            By the end of the course you will have a lot clarity on what you can be doing in your business to give you the edge against your competition.  </p>", 
    "end_date": null, 
    "title": "The Closing Contractor - Win More Business", 
    "price": "20.00", 
    "instructors": "Paul Cheetham", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317712_b3b3_3.jpg", 
    "course_url": "https://www.udemy.com/the-closing-contractor/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-11T09:48:08Z"
}