{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">I&#039;ve gotten my music on iTunes -- now  what?&nbsp; Or how do I even get my music there?&nbsp; Should I worry about  Facebook?&nbsp; Tumblr?&nbsp; Twitter?&nbsp; How do I have time for this?&nbsp;  How do I make more than 67 cents a download, or less than 1 cent for  streaming?&nbsp; </p>    <p style=\"\">Welcome to “Updating Your Digital Music  Distribution,” where we will work to help you answer these and many other  questions.</p>    <p style=\"\">The digital world for musicians continues to  change dramatically.<span style=\"\">&nbsp; We not only have  the ability to self-market and create communities directly with listeners, but  also can thrive in online communities with influencers and other musicians  around the world.&nbsp; Digital has  transformed not just the way we get the word out, but also how we create and  how we understand the vast data around the consumption of our music.&nbsp; Internet marketing has morphed into internet  community crowdsourcing of opinions and tastes—a very different world for  musicians and musical organizations.&nbsp; </span></p>    <p style=\"\">You will engage in rethinking your own “brand,”  finding your “target audience” online, and engaging directly with core  influencers and Super Fans.</p>    <ul style=\"\"><li style=\"\">Who are       you really trying to reach to thrive as a musician?<span style=\"\">&nbsp; </span></li><li style=\"\">How do       you really plan to earn money in this digitally connected, streaming       music, age?<span style=\"\">&nbsp; How can you make       different money from different relationships with fans?&nbsp; </span></li><li style=\"\">What do       you need to do beyond getting your tracks out on the right digital       distribution services?<span style=\"\">&nbsp; Where IS the       right place or places for your music to be available?&nbsp; </span></li><li style=\"\">What       have other musicians and musical organizations done that you’d like to       learn from in your own marketing and branding?<span style=\"\">&nbsp; How do your fandoms overlap?&nbsp; What can you do with that information?</span></li><li style=\"\">What is       worth your time to engage in and what is a total waste of time?<span style=\"\">&nbsp; </span></li></ul>    <p style=\"\">&nbsp;</p>", 
    "end_date": null, 
    "title": "Updating Your Digital Music Distribution", 
    "price": "20.00", 
    "instructors": "Gigi Johnson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28036_1d39_9.jpg", 
    "course_url": "https://www.udemy.com/updating-digital-music-distribution/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-28T21:57:06Z"
}