{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Why Knowing These About Piping Components Are So Important for Oil and Gas Career?</em></strong><strong class=\"redactor-inline-converted\"> </strong><br></p>\n\n<p>Oil and Gas industry becomes a very competitive in the current time. Getting a right mentor and right exposer within the industry is difficult. With limited training budget spent by the company on employee training, it is difficult to acquire the knowledge to success.</p>\n\n<p>Knowing cross-functional skill give you an edge over others in your career success.</p>\n\n\n\n<p>This course design based on years of field experience to ensure the student will comprehend technical details easily and enjoy the overall journey.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn in detail every aspect of Pipe &amp; Pipe Fittings used in process industry</strong></p>\n\n\n\n<ul><li>Different types of Pipe, Pipe fittings (Elbow, Tee, reducers, Caps etc.), Flanges, Gaskets, Branch Connection, Bolting materials</li><li>Materials (Metal-Carbon Steel, Stainless Steel, Alloy Steel etc. Non-Metal- PVC/VCM, HDPE, GRE-GRP etc.)</li><li>Manufacturing methods</li><li>Heat treatment requirements</li><li>Inspection and Testing requirements (NonDestructive Testing, Mechanical &amp; Chemical testing)</li><li>Dimensions &amp; Markings requirements</li><li>Code &amp; Standard used in piping</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Content and Overview</strong></p>\n\n\n\n<p>With 2 hours of content including 30 lectures &amp; 8 Quizzes, this course cover every aspect of Pipe, Pipe fittings, flanges, gaskets, branch connections and bolting material used in Process Piping.</p>\n\n\n\n<p>This Course is divided into three parts.</p>\n\n\n\n<p>1st part covers fundamental of process industries. In this Part, you will learn about fundamental process piping. You will also learn about Code, Standard &amp; Specification used in process industries.</p>\n\n\n\n<p>2nd part covers various types of material used in process industries. In this part, you will learn about Metallic and Non-Metallic material used to manufacture pipe and other piping components.</p>\n\n\n\n<p>3rd part covers in detail about pipe and piping components used in Process piping. In this part, we will learn about Industry terminology of Piping components, types of the industrial material grade used in manufacturing and entire manufacturing process of these components. You will learn about different manufacturing methods, Heat treatment requirements, Destructive and Non-destructive testing, Visual &amp; Dimensional inspection and Product marking requirements.</p>\n\n\n\n<p>Upon completion, you will be able to use this knowledge direct on your Job and you can easily answer any interview question on pipe &amp; fittings.</p>\n\n\n\n<p>Click the \"take this course\" button, top right, With Udemy 30 Days Money Back guarantee nothing to worry.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Enrolled Now.</strong></p>", 
    "end_date": null, 
    "title": "Working in Oil&Gas? Piping Components Are Must Know for You", 
    "price": "50.00", 
    "instructors": "Varun Patel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485152_9ee4_2.jpg", 
    "course_url": "https://www.udemy.com/process-pipe-fittings-for-oil-gas-career/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T12:35:07Z"
}