{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t                          This course will teach you to create your own <strong style=\"\">professional-quality comics</strong> and <strong style=\"\">make money</strong> selling them.</p><p style=\"\">  \t                          I&#039;ve been writing and selling my own professional-quality comic books for years and I can tell you the best way to do things so you <strong style=\"\">spend as little money as possible</strong> to create exceptional works of sequential storytelling that anyone can buy and enjoy. I will provide you with the <strong style=\"\">valuable resources</strong> you need to help you write entertaining comic book scripts and make them into viable products.  </p>  <p style=\"\">  \t                          This course, comprised of over <strong style=\"\">14 lectures and two quizzes,</strong> will help everyone who ever wanted to make his or her own comics but couldn&#039;t draw well enough to produce professional books that can be sold to anyone who loves great art and stories. All you need is a desire to make comics and a willingness follow my instruction and do the coursework.  </p>  <p style=\"\">  \t        Learn:  </p>  <ul style=\"\">  \t<li style=\"\">Where to find artists, letterers and inkers</li>  \t<li style=\"\">How to put your comic up for sale to <strong style=\"\">millions of readers</strong></li>  \t<li style=\"\">How to <strong style=\"\">write</strong> a great comic book script</li>  \t<li style=\"\">How to <strong style=\"\">promote</strong> your comics</li>  </ul>  <p style=\"\">  \t        Get:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Help promoting</strong> your book</li>  \t<li style=\"\">A <strong style=\"\">special discounted rate</strong> on a talented, dependable letterer</li>  \t<li style=\"\">Advice from pros, including <strong style=\"\">Chuck Dixon, Jimmy Palmiotti, Justin Gray, Stefan Petrucha, John Ostrander, Leah Moore &amp; John Reppion, John Rozum, Dean Motter, John Arcudi, Sean McKeever, Peter Bagge, David Hine, Dan Jolly, JM DeMatteis, Tom Peyer, Dan Jurgens, Stuart Moore </strong>and<strong style=\"\"> Chris Ryall</strong></li>  </ul>  <p style=\"\">  \t                          I&#039;m confident you&#039;ll be happy with this course. <strong style=\"\"></strong>You can get a <strong style=\"\">full refund</strong> if you are unsatisfied with it for <strong style=\"\">any reason</strong>.  </p>  <p style=\"\">  \t                          Join us and start making your own professional quality comic books!  </p>", 
    "end_date": null, 
    "title": "Write and Publish Comic Books for Fun and Profit", 
    "price": "50.00", 
    "instructors": "Scott Amundson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381670_60bf_4.jpg", 
    "course_url": "https://www.udemy.com/learn-to-write-and-sell-comic-books/", 
    "currency": "USD", 
    "subject_name": [
        "Industry"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-31T16:27:23Z"
}