{"selfpaced": true, "topic_name": ["Electrical Engineering"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Engineering\n                                                                                                    &gt; Electrical Engineering\n                                                            \n                            \n                                                \n                    \n                    \n                    *Note - This is an Archived course*\n\nThe course introduces engineering in the context of the lumped circuit abstraction. Topics covered include: resistive elements and networks; independent and dependent sources; switches and MOS transistors; digital abstraction; amplifiers; energy storage elements; dynamics of first- and second-order networks; design in the time and frequency domains; and analog and digital circuits and applications. Design and lab exercises are also significant components of the course.\n\nWeekly coursework includes interactive video sequences, readings from the textbook, homework, online laboratories, and optional tutorials. The course will also have a midterm exam and a ﬁnal exam.\n\nFAQ\n\nWill the text of the lectures be available?\nYes, transcripts of the course will be made available.\n\nDo I need to watch the lectures live?\nNo. You can watch the lectures at your leisure.\n\nWhat are the prerequisites?\nYou should have a mathematical background of working with Differential Equations and a physics background through AP level Electricity and Magnetism.\n\nI don't have the prerequisites, can I still take the course?\nWe do not check students for prerequisites, so you are certainly allowed to try. However, 6.002x does depend on previous experience with electricity and magnetism, and differential equations. If you do not know those subjects before taking the class, you will have to learn them over the semester, which can be an extremely difficult task.\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\n                                    ", "end_date": "2015-05-12T00:00:00Z", "title": "6.002x: Circuits and Electronics", "price": 0, "instructors": "Anant Agarwal, Gerald Sussman, Piotr Mitros, Chris Terman and Khurram Afridi", "institution_name": ["Massachusetts Institute of Technology"], "commitment": "", "subject_name": ["Engineering"], "course_url": "https://www.edx.org/course/circuits-electronics-mitx-6-002x-0", "duration": "16 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-01-20T00:00:00Z"}