{"selfpaced": false, "topic_name": ["Electrical Engineering"], "description": "\n\n                    \n                    \n                    This course covers advanced converter control techniques, including averaged-switch modeling and Spice simulations, modeling and design of peak current mode and average current mode controlled converters, as well as an introduction to control of single-phase ac grid tied rectifiers and inverters. Design and simulation examples include wide bandwidth point-of-load voltage regulators, low-harmonic power-factor-correction rectifiers, and grid-tied inverters for solar photovoltaic power systems. Upon completion of the course, you will be able to model, design control loops, and simulate state-of-the-art pulse-width modulated (PWM) dc-dc converters, dc-ac inverters, ac-dc rectifiers, and other power electronics systems. \n\nThis course assumes prior completion of Introduction to Power Electronics, Converter Circuits, and Converter Control\n\n                                            Syllabus\n                        Averaged Switch Modeling and SimulationIntroduction to Advanced Converter Control Techniques course, and the Week 1 Module on averaged switch modeling and simulationsPeak Current Mode Control - Part 1Introduction to peak current mode control (also known as current-programmed mode (CPM) control)Peak Current Mode Control - Part 2More accurate modeling and design of peak current mode controlled convertersAverage Current Mode ControlAverage current mode control of dc-dc converters, ac-dc rectifiers and dc-ac inverters\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Advanced Converter Control Techniques", "price": 0, "instructors": "Dr. Dragan Maksimovic, Robert Erickson and Dr. Khurram Afridi", "institution_name": ["University of Colorado Boulder"], "commitment": "", "subject_name": ["Engineering"], "course_url": "https://www.coursera.org/learn/current-control", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}