{"selfpaced": false, "topic_name": ["Statistics & Probability"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Mathematics\n                                                                                                    &gt; Statistics &amp; Probability\n                                                            \n                            \n                                                \n                    \n                    \n                    The world is full of uncertainty: accidents, storms, unruly financial markets, noisy communications. The world is also full of data. Probabilistic modeling and the related field of statistical inference are the keys to analyzing data and making scientifically sound predictions.\n\nProbabilistic models use the language of mathematics. But instead of relying on the traditional \"theorem - proof\" format, we develop the material in an intuitive -- but still rigorous and mathematically precise -- manner. Furthermore, while the applications are multiple and evident, we emphasize the basic concepts and methodologies that are universally applicable.\n\nThe course covers all of the basic probability concepts, including:\n\nmultiple discrete or continuous random variables, expectations, and conditional distributions\n\tlaws of large numbers\n\tthe main tools of Bayesian inference methods\n\tan introduction to random processes (Poisson processes and Markov chains)\nThe contents of this course are essentially the same as those of the corresponding MIT class (Probabilistic Systems Analysis and Applied Probability) -- a course that has been offered and continuously refined over more than 50 years. It is a challenging class, but it will enable you to apply the tools of probability theory to real-world applications or your research.\n\nCan I still register after the start date?\nYou can register at any time, but you will not get credit for any assignments that are past due.\n\nHow long does this course last?\nThe course starts on Tuesday, February 3, 2015 and ends on the due date of the final exam, on Thursday, May 26, 2015.\n\nWhat is the format of the class?\nThe course material is organized along units that are aligned with the chapters of the textbook. Each unit contains between one and three lecture sequences. Each lecture sequence consists of short video clips, interleaved with short problems to test your understanding. Each unit also contains a wealth of supplementary material, including videos that go through the solution of various problems.\n\nWhat textbook do I need for the course?\nNone - there is no required textbook. The class follows closely the text Introduction to Probability, 2nd edition, by Bertsekas and Tsitsiklis, Athena Scientific, 2008; see the publisher's website or Amazon.com for more information. However, while this textbook is recommended, the materials provided by this course are self-contained.\n\nDo I need to watch the lectures live?\nVideo lectures as well as worked problems will be available and you can watch these at your own convenience. Homework assignments and exams, however, will have due dates.\n\nWill the text of the video clips be available?\nYes, we will provide transcripts of all clips (lectures, worked problems, etc.) that are synched to the videos.\n\nHow are grades assigned?\nGrades (Pass or Not Pass) are based on a combination of scores on the weekly homework assignments (11 total), two midterm exams, and a final exam.\n\nHow much do I need to work for this class?\nThis is an ambitious class in that it covers a lot of material in substantial depth. Furthermore, the only way of mastering the subject is by actually solving on your own a fair number of problems. MIT students who take the corresponding residential class typically report an average of 11-12 hours spent each week, including lectures, recitations, readings, homework, and exams.\n\n                                    ", "end_date": "2016-05-24T00:00:00Z", "title": "6.041x: Introduction to Probability - The Science of Uncertainty", "price": 0, "instructors": "Patrick Jaillet and John Tsitsiklis", "institution_name": ["Massachusetts Institute of Technology"], "commitment": "", "subject_name": ["Mathematics"], "course_url": "https://www.edx.org/course/introduction-probability-science-mitx-6-041x-1", "duration": "16 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-02-02T00:00:00Z"}