{"selfpaced": false, "topic_name": ["Statistics & Probability"], "description": "\n\n                    \n                    \n                    \r\nThis is an introductory-level course in supervised learning, with a focus on regression and classification methods. The syllabus includes: linear and polynomial regression, logistic regression and linear discriminant analysis; cross-validation and the bootstrap, model selection and regularization methods (ridge and lasso); nonlinear models, splines and generalized additive models; tree-based methods, random forests and boosting; support-vector machines. Some unsupervised learning methods are discussed: principal components and clustering (k-means and hierarchical).\r\nThis is not a math-heavy class, so we try and describe the methods without heavy reliance on formulas and complex mathematics. We focus on what we consider to be the important elements of modern data analysis. Computing is done in R. There are lectures devoted to R, giving tutorials from the ground up, and progressing with more detailed sessions that implement the techniques in each chapter.\r\nThe lectures cover all the material in An Introduction to Statistical Learning, with Applications in R by James, Witten, Hastie and Tibshirani (Springer, 2013). As of January 5, 2014, the pdf for this book will be available for free, with the consent of the publisher, on the book website.\r\n\r\nPREREQUISITES\r\nFirst courses in statistics, linear algebra, and computing.\r\n\n\n                                    ", "end_date": "2016-03-22T00:00:00Z", "title": "StatLearning: Statistical Learning", "price": 0, "instructors": "Rob Tibshirani and Trevor Hastie", "institution_name": ["Stanford University"], "commitment": "", "subject_name": ["Mathematics"], "course_url": "https://lagunita.stanford.edu/courses/HumanitiesSciences/StatLearning/Winter2016/about", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["Stanford OpenEdx"], "start_date": "2016-01-12T00:00:00Z"}