{"selfpaced": false, "topic_name": ["Career Development"], "description": "\n\n                    \n                    \n                    Writing a CV is a very personal thing – it’s a story about your past that employers will use to decide if you have a future with them. This free online course will guide you through the CV writing process, helping you create a CV online that will help you net your dream job.\n\nFind out how to write a CV online\n\nBy the end of this course, you’ll be able to improve your existing CV, not only by making it more digital and putting your CV online, but also through being more aware of what makes a good CV and what makes a bad one.\n\nIn Weeks 1 and 2, we’ll be looking at all of the key skills you’ll need to perfect your CV – the idea is that you’ll build up these key skills so that you’ll be able to see a clear improvement in your CV writing.\nIn Week 2, we’ll consider how much technology you want your as part of your CV to be, so that, by the end of the course, you’ll be in a great position to put your CV online and net that job.\n\nGet CV writing advice from experts and learners around the world\n\nThroughout the course, you’ll get cv writing advice from Willie McGuire, Rille Raaper and Viktoria Nikolova – a team of CV experts from the University of Glasgow.\n\nYou’ll also be able to connect with a huge numbers of other job hunters around the world, who are all bursting with ideas – ideas that you can use in your own CV writing.\n\nYou can follow the team behind this course on Twitter: @FLNetThatJob.\n\n\n                                    ", "end_date": "2017-01-20T00:00:00Z", "title": "Net That Job: How to Write a CV Online", "price": 0, "instructors": "Willie McGuire", "institution_name": ["University of Glasgow"], "commitment": "4 hours", "subject_name": ["Personal Development"], "course_url": "http://www.futurelearn.com/courses/digital-cv?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-12-30T00:00:00Z"}