{"selfpaced": false, "topic_name": ["Career Development"], "description": "\n\n                    \n                    \n                    Choosing the right degree and university may feel daunting enough, without worrying about what you’re going to do after graduation. But with the graduate job market becoming increasingly competitive, it’s vital to start thinking about your long-term career and employability now.\n\nThis free online course will show you how to make the most of the time you’ll spend in higher education, with the ultimate aim of improving your prospects when you graduate.\n\nUse higher education to develop your skills and experience\n\nOver three weeks, you will:\n\n\n  increase your own awareness of your skills, values and interests;\n  understand the importance of employability skills and experience in your graduate job hunt;\n  understand how you can best use higher education to develop these skills and experience;\n  and formulate a skills development action plan.\n\n\nLearn with Goldsmiths Pre-Entry Careers Consultant\n\nYou will learn with Helen Kempster - the Pre-Entry Careers Consultant at Goldsmiths, which is the only University of London college to have a role dedicated to providing careers information, advice and guidance to prospective students.\n\nWhat you learn through the course will ensure that you’re well-prepared both for your transition into university and your future career.\n\n\n                                    ", "end_date": "2016-08-08T00:00:00Z", "title": "Prepare for Career Success at University", "price": 0, "instructors": "Helen Kempster", "institution_name": ["Goldsmiths University of London"], "commitment": "3 hours", "subject_name": ["Personal Development"], "course_url": "http://www.futurelearn.com/courses/career-success?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-07-18T00:00:00Z"}