{"selfpaced": false, "topic_name": ["Public & Global Health"], "description": "\n\n                    \n                    \n                    In this course, we introduce the issue of food security and explore some of the different ways in which it has been described both in research and in practice and consider key concerns for the future.\n\nOur central concern is ‘How we will feed an extra two billion people by the middle of this century?’ Focussing both on UK agriculture and on food supply chains in other parts of the world, we will examine how food has shaped our environmental and social landscapes. We will see that, while everyone would agree that food security is ‘a good thing’, ideas about what it means in practice and how it should be achieved vary tremendously.\n\nProposed developments to address global food insecurity range from technological inventions in the efficacy of large-scale agriculture through social and cultural innovations in local food production and consumption. You’ll be exploring a number of topics that address many issues including:\n\n\nIs food security really just about food? \nShould we have concerns about health, social justice, environmental degradation and cultural diversity? \nWhat is the role of technology and innovation in promoting food security? \n\n\nAnd much more.\n\nIn the final week we explore the big picture by considering food systems and food chains as a whole. Using examples from some of the case studies that we’ve explored, we consider the relationships between production and consumption and question whether particular kinds of agriculture are linked to particular diets and patterns of consumption.\n\nWe will explore the role of the retailer and the consumer in more detail as we ask what it means to enjoy a safe, healthy, sustainable diet. We also consider the issue of food poverty and how this fits within the food security debate.\n\nYou can use the hashtag #FLfoodsecurity to join and contribute to Twitter conversations about this course.\n\nProfessor Bill Davies has written a blog post about the course in which he argues that we need a new “Green Revolution” if we’re going to feed the world’s growing population.\n\n\n                                    ", "end_date": "2016-10-24T00:00:00Z", "title": "Global Food Security: Addressing the Challenge", "price": 0, "instructors": "William Davies", "institution_name": ["Lancaster University"], "commitment": "", "subject_name": ["Health & Medicine"], "course_url": "http://www.futurelearn.com/courses/food-security?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-08-29T00:00:00Z"}