{"selfpaced": false, "topic_name": ["Public & Global Health"], "description": "\n\n                    \n                    \n                    This free online course provides an introduction to occupational health – a part of public health that is neglected in many developing countries, where industrial activity is increasing, but the health and safety of workers is hardly discussed.\n\nThe course will teach you basic knowledge of occupational health and  how to prevent the development of diseases and injuries, which are caused by working conditions in developing countries.\n\nAfter the course, you will understand:\n\n\n  the basic concepts of occupational health;\n  the tasks and structure of occupational health services;\n  the most important risk factors for illness and injuries at workplaces globally;\n  the major occupational diseases;\n  the different steps in risk assessment at the workplace;\n  the association between workplace exposure and health effects;\n  and the main steps in preventing exposure to health hazards in the work environment.\n\n\nUnderstand the role of different actors in occupational health\n\nThrough this course, you will be able to understand the interaction between the actors within occupational health, including employers, employees, health and safety personnel, occupational health services, occupational health clinics and the Labor Inspection.\n\nYou will also reflect on occupational health from a global perspective and know how to work on the issue in a low-income setting.\n\nThe course has been developed in association with:\n\n\n  Simon Mamuya, Gloria Sakwari, Vera Ngowi and Alexander Tungu of Muhimbili University of Health and Allied Sciences, Dar es Salaam, Tanzania\n  Wakgari Deressa of Addis Ababa University, Ethiopia\n  Akwilina Kayumba of the Occupational Safety and Health Authority, Dar es Salaam, Tanzania\n  Norwegian Agency for Development Cooperation (Norad)\n\n\n\n                                    ", "end_date": "2016-04-18T00:00:00Z", "title": "Occupational Health in Developing Countries", "price": 0, "instructors": "Ole Jacob Møllerløkken, Magne Bråtveit, Gro Tjalvin and Bente Elisabeth Moen", "institution_name": ["University of Bergen"], "commitment": "4 hours", "subject_name": ["Health & Medicine"], "course_url": "http://www.futurelearn.com/courses/occupational-health-developing-countries?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-03-07T00:00:00Z"}