{"selfpaced": true, "topic_name": ["Public & Global Health"], "description": "\n\n                    \n                    \n                    Current and future public health is characterized by the increase of chronic and degenerative diseases, corresponding to the worldwide ageing of the population. The increasing prevalence of these conditions together with the long incubation period of the chronic diseases and the restless technological innovations, offer new opportunities to develop strategies for early diagnosis.\nIt is an important task of public health to critically assess the promises and the pitfalls of screening strategies. In this perspective, this MOOC will detail the background concepts of early diagnosis, the methods to assess the effectiveness and the efficiency of screening programs, the tools available of scaling up a local program, etc. In a second part of the course, current and future trends in screening in several conditions will be presented, including cancer, cardiovascular and metabolic disease, prenatal and neonatal conditions (including genetic screening), and communicable disease. \nBy the end of this MOOC, students should be able to develop a public health perspective on screening and to actively participate to the evaluation of screening strategies.\nThis MOOC has been prepared under the auspices of the Ecole romande de santé publique (www.ersp.ch) by Prof. Fred Paccaud, MD, MSc, Head of the Institute of Social and Preventive Medicine in Lausanne (www.iumsp.ch), in collaboration with Professor Antoine Flahaut, MD, PhD, head of the Institute of Global Health, Geneva (www.igh.ch).\n\n                                            Syllabus\n                        IntroductionConcepts and metricsThis first part of the MOOC will provide definitions of screening, i.e., what screening means in terms of tools, programs and policies. Further, the public health perspective will be developed related to effectiveness, impact on health care and on population health.Natural history of diseases and the characteristics of subclinical conditions allowing early diagnosis will be presented, and screening will be compared with other public health strategies. Finally, the metrics of screening will be addressed with concepts related to robustness, validity and impact.This module is given by \tSenior lecturer Idris Guessous, MD, PhD, Unit of population epidemiology, Department of community health, Geneva, and Division of chronic diseases, Institute of social and preventive medicine, Lausanne.A quiz will close this module and will count for 15% of the final grade. To pass, you must achieve at least 60% correct.Policies and evaluationThis part will address practical problems of implementation, monitoring and evaluation of any screening program. Aspects of planning a screening program, or facing controversies surrounding screening will be presented and discussed.The evaluation of screening programs will then be presented in depth, including the needed information system, the design of an evaluation and the systematic errors. Selected aspects of qualitative evaluation and economic assessment will be presented.This module is given by Senior lecturer Jean-Luc Bulliard, PhD, epidemiologist, Division of chronic diseases, Institute for social and preventive medicine, Lausanne. A quiz will close this module and will count for 15% of the final grade. To pass, you must achieve at least 60% correct.Cardometabolic conditionsBecause of its high and increasing absolute prevalence, cardio-metabolic disease is a major area for the development of markers and/or determinants of subclinical diseases. Early detection of hypertension and diabetes is discussed in the two first courses. Within the framework of the life course epidemiology, the implementation of early diagnosis in children for these cardiometabolic conditions is a challenging perspective, which is discussed in the third course.The three courses of the module are given by Senior lecturer Arnaud Chiolero, MD, PhD, Division of chronic diseases, Institute of social and preventive medicine, Lausanne. A quiz will close this module and is equivalent to 10% of the final grade. To pass, you must achieve at least 60% corrCancerCancer is a classical field for screening, because of both the improvement of the prognosis for most cancers and the usually long incubation period. This part of the MOOC will present current data, evidence and policies regarding the most important cancer sites, i.e., colorectum, prostate, lung and cervix.This module is given by:•\tElisabetta Rapiti, MD, Geneva cancer registry, Institute of global health, Geneva•\tProfessor Antoine Flahault, MD, PhD, Head, Institute of global health, Geneva. A quiz will close this module and is equivalent to 10% of the final grade. To pass, you must achieve at least 60% correct.Neuropsychiatric conditionsLike all chronic and degenerative conditions, the prevalence of neuropsychiatric conditions increase with the ageing of the population. The search for an early diagnosis conducing to a better prognosis becomes thus obvious. The area of mental health is however complex and needs a careful approach before considering screening strategies. A discussion is developed around dementia and related disorders.This module is given by Assistant Professor Emiliano Albanese, MD, PhD, University Psychiatric Hospital, Geneva. A quiz will close this module and is equivalent to 10% of the final grade. To pass, you must achieve at least 60% correct.Prenatal, perinatal and genetic conditionsMany screening strategies have been designed to allow early diagnosis of severe diseases affecting the fetus. Three of them are presented in this module.Down syndrome (Trisomy 21) is a well-known disorder corresponding to a massive genetic change. Strategies of early detection of the syndrome during the fetal life have been developed since several decades, from the chorionic villi sampling to the circulating fetal cells in the mother blood. Abortion is currently the only available intervention. The various strategies developed to optimize the predictive power of the tests are presented and analyzed.Congenital deafness is an example of a screening strategy recently developed because of a recent development of technological care, namely the miniaturization of cochlear implant. The screening strategies to detect this frequent condition (1-3 births per 1’000) are presented and discussed.Cystic fibrosis (mucoviscidosis) is an example of an autosomal recessive disease. The condition is frequent with about 4% of the population beeing asymptomatic carriers with a single allele of the mutation. There are various screening strategies. There is no treatment, but an early diagnosis seems to improve the prognosis via an aggressive care.The three courses of the module are given by Professor Murielle Bochud, MD, PhD, head of the Division of chronic diseases, Institute of social and preventive medicine, Lausanne. Two quizzes will close this module and they are equivalent to 10% each of the final grade. To pass, you must achieve at least 60% correct.Screening in low and middle-income countriesThe globalization of non communicable diseases is a major challenge in low and middle income countries. The question is how far screening can be a part of the strategy against these diseases and, if yes, what are the best buys in this area. Screening for cardiovascular diseases and for cancer will be presented and discussed. This module is given by:•\tCatherine Sauvaget, MD, PhD, International Agency for Research on Cancer (IARC), Lyon•\tProfessor Pascal Bovet, MD,MPH, Division of chronic diseases, Institute of social and preventive medicine, Lausanne. Two quizzes will close this module and they are equivalent to 10% each of the final grade. To pass, you must achieve at least 60% correct.ConclusionThe content of this MOOC is summarized and the most important take home messages are given, for both the methodological issues and the case studies.\n\nThis module is given by Professor Fred Paccaud, MD, MSc, Head, Institute of Social and Preventive Medicine, Lausanne\n                                    ", "end_date": "2015-11-28T00:00:00Z", "title": "To Screen or not to Screen? Methods and health policies through case studies ", "price": 0, "instructors": "Antoine Flahault and Fred Paccaud", "institution_name": ["University of Geneva"], "commitment": "", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/learn/screening", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-10-10T00:00:00Z"}