{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t        Arabic of the Quran from Beginner to Advanced is an easy to use, fun and interactive introduction to the language of the Quran. <strong>It's ideal for anyone interested in the Quran, Islam, Arabic, or the Middle East.</strong><strong> All are welcome.</strong>  </p>  <p>  \tThis course focuses on the Arabic language, not theology or doctrine.  </p>  <p>  \t        The first section focuses on the Arabic script, its pronunciation, and its vocabulary. These build the foundation for understanding the language. The course occasionally focuses on rules for correct recitation, but this isn't necessary for completion of the course. You can skip the recitation sections at the end of the first section. <strong>Understanding is key.</strong>  </p><p>The second section dives deep into Classical Arabic vocabulary and grammar.</p>  <p>  \t        It is my sincere hope that <strong>non-Muslims will come away with a better understanding of Islam and that Muslims will develop a deeper relationship with Allah.</strong>  </p>  <p>  \t        The course covers 41 lessons through dynamic video lectures, PDF lessons, vocabulary lists and exercises. <strong>The course follows a structured and easy-to-use pattern developed by Rami Koujah, who studied Islam and Classical Arabic at UCLA and Oxford</strong>.  </p>  <p>  \t        I highly encourage you to repeat words, phrases and sentences after me and the native speakers as you go through the lectures. This will speed up your learning by developing muscle memory and internalizing Arabic vowels and consonants.  </p>  <p>  \t        After completing the Arabic of the Quran for Beginners course <strong>you will be able to read and recite the Quran accurately, and you will have a solid foundation of the most common vocabulary (over 1,000 items!)</strong> found in the Quran and Hadith (the sayings of the prophet Mohammad).  </p>  <p>  \t        You will:  </p>  <ul>  \t<li>Gain a deeper understanding Islam</li>  \t<li>Have profound insight into the 1 billion+ strong Muslim world</li>  \t<li>Deepen your relationship and understanding with your Muslim friends, colleagues, or even lover.</li>  \t<li>Have a solid foundation for further studies in Islam, religion, the Middle East and its history, Modern Standard Arabic and modern Arabic dialects.</li>  </ul>  <p>  \t        Those who sign up for the course will receive a discount on 1-on-1 Arabic lessons. Contact me for details.  </p>", 
    "end_date": null, 
    "title": "Arabic of the Quran from Beginner to Advanced", 
    "price": "40.00", 
    "instructors": "Christopher Breuer, Rami Koujah, Belal Hassan", 
    "commitment": "27.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350896_824a_2.jpg", 
    "course_url": "https://www.udemy.com/arabic-of-the-quran-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Arabic"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T14:27:38Z"
}