{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<em><strong>Welcome to Arabic complete course</strong></em></p>\n\n<p><strong>1000+ minutes of contents to teach you Arabic perfectly !</strong>  </p>\n\n<p>  \t          Today i am proudly announcing this course which is going to give you the ability to learn Arabic language , with a lot of new features that makes learning easier and more efficient .  </p><p>This course includes both <strong>PowerPoint </strong>videos and <strong>Camera </strong>videos, in order to make sure that i can deliver perfect way of teaching to you.</p>\n\n<p>  \t          This course will be focusing on both sides , the <strong>easy </strong>part where its good for beginners and the part where its more advanced Arabic such as <strong>level 2</strong> Grammar and vocabulary, then to <strong>level 3</strong> in everything.</p>\n\n<p>  \t          Its time to learn verbs , and make perfect sentences with no Grammar mistakes, so we would like to start with random words, small conversations, until we make sure that we can move to advanced level and start making dialog.</p>\n\n<p>  \t          English letters will help you more to learn so i've decided to write using both Arabic and English alphabet ( check the free preview for more information )</p>\n\n<p>  \t          <strong>Introducing</strong>:  </p>\n\n<ul>  \t<li>Vocabulary</li>  \t<li>Grammar</li>  \t<li>Conversations</li>  \t<li>Writing skills would be added also as a quiz</li>  \t<li>Quizzes</li>  \t<li>True or false questions and essay questions.</li>  </ul>\n\n<p>  \t        <strong>Cheap </strong>courses for you that provide unlimited teaching.</p><p><strong>Who should take this course?</strong></p>\n\n<ul><li>People who are seeking to learn new language.</li><li>Want to work in UAE or Egypt for example.</li><li>Want to improve their skills</li></ul>  \t          \n\n<p>  \t          Why wasting money on expensive courses and traveling while you can learn online and <strong>save </strong>the videos + materials on your computer.</p>\n\n<p>  \t          I would love also to communicate with all students, who have questions or anything in mind, we can share ideas on forms and we might be able to do Live Sessions , beside that you can reach me always via e-mail or by Udemy messages, so i would respond to any questions directly through my phone.  </p>\n\n<p><strong>  \t          I hope that you will enjoy this course , and i wish you very good luck here !</strong>  </p><p>Enjoy learning ,</p>\n\n<p>  \t          Fadi G. Char  </p>", 
    "end_date": null, 
    "title": "Arabic language - MSA ! Ready to speak - Beginner to Pro !", 
    "price": "20.00", 
    "instructors": "Fadi Gilbert Char", 
    "commitment": "17 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260490_ee05_4.jpg", 
    "course_url": "https://www.udemy.com/arabic-a21/", 
    "currency": "USD", 
    "subject_name": [
        "Arabic"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-13T11:59:59Z"
}