{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Welcome and thanks for visiting the page!<br></p><div style=\"\"><span style=\"\">مرحباً, شكراً لتفقدكم الصفحة ( Fusha )</span></div><div style=\"\"><span style=\"\">مرحباً, شكراً اجيتو عالصفحة ( Syrian )</span></div><p>+ 300 minutes of content to teach you Arabic with Syrian accent perfectly !</p><p>Today i am proudly announcing this course which is going to give you the ability to learn Syrian Arabic language , with a lot of new features that makes learning easier and more efficient .</p><p>This course focus more on how to use the \"street\" unofficial language of Arabic, which means the accent spoken by native Arabs there, and if you are wondering, do you really need to speak this kind of languages? well yes, because the official Arabic called \" Fusha \" we use only in newspapers, news, places such as restaurant ( menu ), airport and so on. </p><p>But if you are willing to start speaking to people around, and get involved in the culture then this is where you start!</p><p>Why did i choose to teach Syrian Arabic? what's the difference between it and other accents?</p><p>1- Syrian Arabic + Lebanese Arabic are the most easiest accents to learn</p><p>2- All Arabs do understand what are you speaking about when you use Syrian/Lebanese accent, by the way Lebanese and Syrian accents are very very similar!</p><p>3- Arabic is used in many countries and each country has its own accent, however, many countries got affected by the culture/countries around, such as Morocco/Tunisia/Algeria and France? so they prefer somehow to speak French rather than Arabic, and their Arabic is mostly not understandable by other Arabic countries, even tho i love Tunisian accent!</p><p>3.1- However, no matter what kind of accents you have learned, at the end we all will understand each other, its just like comparing English of UK to USA and Australia, Spanish of Spain to Columbia and so on.</p><p>English letters will help you more to learn so i've decided to write using both Arabic alphabet and English alphabet ( check the free preview for more information )</p><p>Introducing:</p><ul><li>Vocabulary</li><li>Grammar</li><li>Conversations</li><li>Writing skills would be added also as a quiz</li><li>Quizzes</li></ul><p>People who are seeking to learn new language , or working in UAE or Egypt for example must take at least get to know to Fusha first in order to make sure they do understand what they are reading in Airport, libraries, restaurants and so on.</p><p>Why wasting money on expensive courses and traveling while you can learn online and save the videos and materials for you , regarding prices !</p><p>I would love also to communicate with all students, who have questions or anything in mind, we can share ideas on forms and we might be able to do Live Sessions , beside that you can reach me always via e-mail so i would respond to any questions directly through my phone.</p><p>I hope that you will enjoy this course , i will try to do my best and wish you very good luck here !</p><p>Fadi G. Char</p>", 
    "end_date": null, 
    "title": "Arabic Language course: Syrian dialect + History of Syria", 
    "price": "20.00", 
    "instructors": "Fadi Gilbert Char", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/668442_3683_3.jpg", 
    "course_url": "https://www.udemy.com/syrianarabic/", 
    "currency": "USD", 
    "subject_name": [
        "Arabic"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-13T03:16:27Z"
}