{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Egyptian Arabic is a spoken language that is highly interactive, and the best way to master it is by actually interacting with people. This course aims to give you key expressions and phrases that you can use to immediately begin communicating. You will learn how to engage in simple, friendly conversations that signal respect for the person and the culture, and an eagerness to learn.</p><p><strong style=\"\">Start learning Egyptian Arabic by mastering the interactive, relational building blocks given in this course.</strong></p> <ul style=\"\"> <li style=\"\">Vocabulary that lets you greet people, say goodbye, engage in polite exchanges and ask key questions</li> <li style=\"\">Information about when to use formal or informal variations, depending on who you're talking to</li> <li style=\"\">Useful functional words and expressions that you'll need for your next steps, including numbers, pronouns, questions, and requests</li> </ul> <p><strong style=\"\">Communicate from Day 1 to accelerate your learning of Egyptian Arabic</strong></p><p>This course will focus on giving you initial tools that you can use to interact, right away. These are not randomly chosen vocabulary items. They are foundational words and expressions that will allow you to begin to interact in Egyptian Arabic. You will learn the initial Arabic you need to start connecting relationally with Egyptians. </p><p>The vocabulary that you will use, once you have completed the course, will immediately signal to the people with whom you are speaking that you appreciate and respect them, you enjoy their language and culture, and that you  want to learn more. It will position you to take advantage of the friendliness and outgoingness of most Egyptians, as you interact with them in an open, friendly, interested way.</p>", 
    "end_date": null, 
    "title": "Egyptian Arabic Absolute Beginner's Workshop", 
    "price": "40.00", 
    "instructors": "Andrew Dempsey", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552034_705f_6.jpg", 
    "course_url": "https://www.udemy.com/egyptian-arabic-absolute-beginners-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Arabic"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-11T20:08:24Z"
}