{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p class=\"MsoNormal\" style=\" text-align:left;\">  \t   The Reading and Writing Arabic Course is intended for those who want to learn Arabic script. This Arabic course will teach the student to read and write, to draw the letters and connect them and to acquire an extensive vocabulary (about 700 words!) By the end of the course, the student will be able to read conversations and will have an excellent foundation for future Arabic language study.<strong style=\"\"></strong>  </p>  <p class=\"MsoNormal\" style=\" text-align:left;\">  \t<strong style=\"\">Who is this course designed for?</strong>  </p>  <p style=\"\">  \t     The Reading and Writing Arabic course is a beginner&#039;s online course, intended for those who have no previous knowledge of the reading and writing Arabic language and wish to acquire fluency in reading and writing Arabic. The course begins by introducing the student to the unique Arabic letters, words, sounds and sentence structures while focusing on reading and writing. At the end of this course, the student will be able to read and write freely and certainly get around as a tourist in an Arabic speaking country.  </p>  <p style=\"\">  \t <strong style=\"\">Course description</strong>  </p>  <p style=\"\">  \t     The reading and writing Arabic Course provides 16 pre-recorded lessons, each about 15 minutes long and a corresponding textbook which supplements the lessons with additional clarifying explanations. The study material includes new Arabic language vocabulary and sentences while simultaneously providing an option for transliteration and translation. In addition, you will receive learning exercises, small conversations, and learn more about Arabic written language.<br style=\"\">  \t      At any point, you can pause a lesson and continue at another time from exactly where you stopped. The biggest advantage of using our program is that you can learn reading and writing Arabic online anywhere, anytime from any computer. Sign up now for the reading and writing  </p>  <p style=\"\">  \t <strong style=\"\">Take this course and start mastering the written Arabic language today!<br style=\"\">  \t </strong>  </p>", 
    "end_date": null, 
    "title": "Reading and Writing Arabic - \"The Fosha\"", 
    "price": "50.00", 
    "instructors": "Amos Avidov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/112436_ff0c_5.jpg", 
    "course_url": "https://www.udemy.com/reading-and-writing-in-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "Arabic"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-29T20:22:34Z"
}