{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p class=\"MsoNormal\" style=\" text-align:left;\">  \t   The Advanced Arabic course is intended for those who have background knowledge of Arabic language and are interested in improving and upgrading their proficiency. For example, those who have already taken their first steps in learning Arabic and are looking to deepen their knowledge and widen their basic knowledge. This Advanced Arabic Course will allow the student to learn Arabic online and study more complex grammatical structures, verbal conjugation, and expand his or her vocabulary. While doing so, the student will also build more confidence.  </p>  <p class=\"MsoNormal\" style=\" text-align:left;\">  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t <strong style=\"\">Who is this course designed for?</strong>  </p>  <p class=\"MsoNormal\" style=\" text-align:left;\">  \t     The Advanced Arabic course is an Arabic online course for advanced students. This course is for those who have previous knowledge of the Arabic language and wish to acquire fluency in spoken Arabic. The course begins by introducing the student to the unique Arabic sounds and sentence structures while focusing on dialogue. At the end of this course, the student will be able to speak freely on a variety of topics and certainly get around as a tourist in an Arabic speaking country.  </p>  <p class=\"MsoNormal\" style=\" text-align:left;\">  \t <strong style=\"\">Course description</strong><strong style=\"\"></strong>  </p>  <p class=\"MsoNormal\" style=\" text-align:left;\">  \t     The Advanced Arabic Course provides 54 pre-recorded lessons, each about 15 minutes long and a corresponding textbook which supplements the lessons with additional clarifying explanations. The study material includes new Arabic language vocabulary and sentences while simultaneously providing an option for transliteration and translation. In addition, you will receive learning exercises, conversations, and learn more about Arab culture. At any point, you can pause a lesson and continue at another time from exactly where you stopped. The biggest advantage of using our program is that you can learn Arabic online anywhere, anytime from any computer. Sign up now for the Advanced Arabic Course and start mastering the Arabic language today!  </p>", 
    "end_date": null, 
    "title": "The advanced Arabic Course - Egyptian and \"Shami\" Dialects", 
    "price": "20.00", 
    "instructors": "Amos Avidov", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/120896_11a2_6.jpg", 
    "course_url": "https://www.udemy.com/the-advanced-arabic-course-egyptian-and-shami-dialects/", 
    "currency": "USD", 
    "subject_name": [
        "Arabic"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-16T18:08:04Z"
}