{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    The earth is our home. The development of human civilization as we know it goes hand in hand with how we have used and continue to reshape the planet. This course will introduce the basic knowledge of geology and methods of engineering geology to help people protect and utilize our earth more effectively.\n\nThis geology course consists of two sections: basic geology and engineering geology. The basic geology section includes: formation and evolution of the earth, common rocks and minerals, internal and external dynamic geological process, geological ages, geological structures, geological maps and other basic knowledge of the earth’s geology. The engineering geology section includes engineering geological natures of groundwater, rock and soil, stability analysis of slope, surrounding rock of underground cavern and rock foundation, geological analysis of reservoir project and some field investigation methods and techniques etc.\n\nGeology and Geological Engineering are two of the most important basic subjects that underpin engineering specialties, such as hydraulic engineering, geotechnical engineering and geological engineering. Engineering professionals will find this course particularly interesting and useful, but anyone with an interest in learning how to protect and continue to reshape our planet is welcome to enroll!\n\n                                    ", 
    "end_date": "2016-06-22T00:00:00Z", 
    "title": "40040152X: Geology and Engineering Geology", 
    "price": 0, 
    "instructors": "Wenjie XU", 
    "institution_name": [
        "Tsinghua University"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.edx.org/course/geology-engineering-geology-tsinghuax-40040152x-0", 
    "duration": "17 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-02-24T00:00:00Z"
}