{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\nComposites are used in many industries today to enable high-performance products at economic advantage. These industries range from space to sports and include manufactured products for aircraft, transportation, energy, construction, sports, marine, and medical use. There are many material, economic and aesthetic advantages to using composites, but a solid knowledge of the physical properties, including the mechanics, tooling, design, inspection &amp; repair, and manufacturing options is required for working in this medium as they are intrinsically linked.\n\nThis course provides an introduction to the fundamentals of composite materials for high performance structures from the point of view of Aerospace engineering design, manufacturing, and repair. It is designed to address critical areas of composite technologies that focus on materials, manufacturing, mechanics, design, inspection, and repair.  In this course students will learn how composite materials achieve properties of strength, weight ratios and durability that surpass aluminum in aircraft design.  For these high performance applications engineers typically rely on laminated structures, which are built up from many varying layers of ply-materials. Using this process the mechanical properties of the composite part can be tailored to specific applications resulting in significant weight and cost savings. Tailoring specific properties and designing innovative laminate structures highlights the multidisciplinary nature of this industry and how it touches the expertise of many disciplines including engineers, mechanics, and inspection specialists.\n\nAfter successfully completing this course, students will be able to identify the unique characteristics of composites and understand how advanced composite structures are designed, manufactured and maintained.\n\nWhen you have finished this course, you will be able to:\n\nDemonstrate understanding of fundamentals in materials, manufacturing, mechanics, design, and repair of polymeric matrix composites\n\tIdentify advantages and disadvantages of polymeric matrix composites with respect to metals\n\tApply the knowledge acquired  to the design and manufacturing of high performance composite structures\n\n                                    ", 
    "end_date": "2015-01-27T00:00:00Z", 
    "title": "AA432x: Composite Materials Overview for Engineers", 
    "price": 0, 
    "instructors": "Kuen Y. Lin", 
    "institution_name": [
        "University of Washington"
    ], 
    "commitment": "", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.edx.org/course/composite-materials-overview-engineers-uwashingtonx-aa432x", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-11-18T00:00:00Z"
}