{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Architects, engineers and other professionals must take action in the development of the global emergency response to the natural or man-made disasters that are increasingly occurring in different part of the world. In times of crisis, the whole world should act to help war refugees and environmental migrants with the recovery efforts. Designers have the opportunity to propose solutions that can minimize the suffering and prevent the deaths of thousands of people. Wars have devastating effect on people’s lives. By designing refugee camps, we will provide an alternative for the people who lost their homes and had to escape, leaving everything behind. The design of a refugee camp must minimize the already made psychological damage to the refugees by creating a welcoming environment and a new temporary home. Natural disasters are happening more often due to climate change. We can’t do much to stop them, but as architects and engineers, we can offer a temporary solution by designing transitional shelters for the recovery period. The 2010 earthquake in Haiti, the 2012 hurricane Sandy in the USA, the 2013 typhoon Haiyan in the Philippines, are just some of the examples of the devastation effect of natural disasters. We need to take action.\r\nThe goal of this online course is to generate designs for emergency shelters for the victims of wars and natural disasters. The participants in this course will design affordable and easy to build shelters, which could be implemented by OCHA, UNHCR, WBG, and other international organisations. We will engage with a team of architects, planners, engineers, and social workers from all over the world. After the course, the projects and instructions will be placed on an open source platform, so anyone can download and use them.\r\nLEARNING OUTCOMES\r\nStudents will learn about the design of an emergency shelter and how it can be implemented in an urban setting. They will improve their design and collaboration skills, working with a global community of professionals from all over the world. Students will be learning from each other, as they will present their work publicly each week and receive feedback from the professors and fellow students. They will form teams, which will work together on developing integral projects that include aspects of architectural design, structural engineering, building technology, social space, community development, economic feasibility, sustainability and resilience.\r\nPRIOR KNOWLEDGE \r\nThe course work will be collaboration between people from many different backgrounds: design, engineering, economics, healthcare, social studies. They will join their knowledge, skills and energy to design solutions that are resilient, feasible, sustainable, buildable, etc.\r\nFor designers, previous architectural experience is highly recommended. We suggest the course to professionals, graduate students, and last year architectural students.\r\nFor non-designers, we are looking for social workers, economists, policy makes, developers, business people who can integrate their knowledge and skills with the work of the designers.\r\n \n\n                                            Syllabus\n                        Week 1: Defining The Problem\r\nWeek 2: Refugee Camps Precedents\r\nWeek 3: Shelter Unit Precedents\r\nWeek 4: Shelter Unit Design\r\nWeek 5: Shelters Aggregation Strategies\r\nWeek 6: Refugee Camp Design\r\nWeek7: Project Selection Process And Jury\n                                    ", 
    "end_date": "2014-12-29T00:00:00Z", 
    "title": "Arch401: Designing Emergency Shelters", 
    "price": 0, 
    "instructors": "Ivan Shumkov", 
    "institution_name": [
        "Open Online Academy, New York"
    ], 
    "commitment": "5-20 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.ooed.org/learn/designing-emergency-shelters-summer-2014", 
    "duration": "25 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "EdCast"
    ], 
    "start_date": "2014-07-07T00:00:00Z"
}