{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Les Systèmes de Transports Intelligents sont porteurs de nombreux enjeux économiques et sociaux et concernent les collectivités territoriales et les fournisseurs de services en lien avec la Mobilité des personnes et des marchandises.Le développement des systèmes et services de transport intelligent s’accélère avec l’apparition de la révolution numérique que constitue l’usage de généralisé de l’internet mobile, de l’open data, du big data.Face à cette montée en puissance du numérique, les métiers traditionnels du transport doivent s’adapter aux nouveaux besoins des entreprises (opérateurs de transport public et privé, gérants d’infrastructures routières urbaines, périurbaines, autoroutières, ferroviaires, constructeurs de voitures, trains, tramways), des collectivités territoriales (villes, départements, métropoles) et des autorités organisatrices des transports. De nouveaux métiers sont en train d’apparaître pour accompagner le développement des Transports Intelligents.Cette formation permet de sensibiliser les nombreux acteurs de la mobilité et progressivement les mettre à niveau sur les immenses possibilités de l’économie numérique avec le développement des TIC.\n\n                                    ", 
    "end_date": "2016-02-22T00:00:00Z", 
    "title": "Challenges et enjeux de la mobilité 2.0", 
    "price": 0, 
    "instructors": "Jean Marie Bonnin and Jean-François Janin", 
    "institution_name": [
        "Institut Mines-Télécom"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/MinesTelecom/04015/session01/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-01-11T00:00:00Z"
}