{
    "selfpaced": true, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Aprenderás  las bases y los procedimientos precisos paso a paso para que puedas llevar a cabo la autoconstrucción de una vivienda básica, segura y económica para ti y tu familia; también te será de gran utilidad si estás buscando aprender a reparar,  mejorar la estructura de tu vivienda e incluso si buscas autoemplearte.\n¡Atrévete a mejorar tus habilidades en un tema que es siempre útil y necesario!\n\n                                            Syllabus\n                        Arreglo del TerrenoEn este primer módulo, aprenderás todas las bases para comenzar tu construcción, tales como realizar una adecuada limpieza del terreno,  determinar la ubicación más óptima de la vivienda dentro de su predio, delimitar correctamente las colindancias del terreno, e identificar cómo realizar de forma adecuada el trazado de la cimentación de la vivienda; así como aprender a nivelar la superficie del terreno según la  pendiente y características específicas  del lugar; y por último también conocerás la forma de identificar los materiales óptimos para el relleno y/o nivelación del terreno y a utilizarlos de forma correcta.CimientosEn este módulo podrás aprender procedimientos de gran utilidad, que van desde la identificación del tipo y calidad del suelo sobre el que construirás, así como los tipos de cimientos a utilizar, el cálculo de las dimensiones de las zanjas para la cimentación y el tipo de cimientos; además, conocerás la forma de trazar las líneas del drenaje aplicando las mejores prácticas para instalarlo en tu vivienda, e identificarás los tipos de registros que existen y cómo construirlos. Por último también aprenderás a construir cimientos de piedra, y colocar armados de las cadenas de cimentación, así como anclaje de castillos, cimbrado y colado, y construcción de cimientos de concreto.MurosEn este módulo podrás aprender todo el procedimiento para la impermeabilización en desplante de muros, así como para su construcción, empleando los materiales y las prácticas más óptimas para ello. También aprenderás a colocar los castillos, y a construir y colocar los bloques huecos de concreto, que reforzarán tu vivienda. Además aprenderás a conocer las características y consideraciones de uso para cada uno de los materiales de construcción de muros, tales como tabiques rojos y bloques de cemento y paneles de poliestireno.MezclasEn este módulo podrás conocer cómo se conforma una mezcla de concreto y una de mortero y cemento blanco, así como sus usos y dosificaciones específicas; asimismo podrás identificar para qué sirve un firme o piso de concreto dentro de tu vivienda, y aplicar las mejores prácticas para elaborarlo y colocarlo.\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Cómo autoconstruir tu vivienda", 
    "price": 0, 
    "instructors": "Ernesto René Mendoza Sánchez", 
    "institution_name": [
        "Universidad Nacional Autónoma de México"
    ], 
    "commitment": "", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/como-autoconstruir-tu-vivienda", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}