{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Humanity faces an immense challenge: providing abundant energy to everyone without wrecking the planet. If we want a high-energy future while protecting the natural world for our children, we must consider the environmental consequences of energy production and use. But money matters too: energy solutions that ignore economic costs are not realistic—particularly in a world where billions of people currently can’t afford access to basic energy services. How can we proceed?\n\nEnergy Within Environmental Constraints won’t give you the answer. Instead, we will teach you how to ask the right questions and estimate the consequences of different choices.\n\nThis course is intended for a diverse audience. Whether you are a student, an activist, a policymaker, a business owner, or a concerned citizen, this course will help you start to think carefully about our current energy system and how we can improve its environmental performance.\n\nThis course-\n\nCovers engineering, environmental science, and economics to enable critical, quantitative thinking about our energy system\n\tFocuses on a working understanding of energy technologies, rich in details of real devices and light on theory; you won’t find any electrodynamics here but will find enough about modern commercial solar panels to estimate if they would be profitable to install in a given location\n\tCovers environmental impacts of the energy system, focusing on air pollution, climate change, and land use\n\tEmphasizes costs: the cascade of capital and operating costs from energy extraction all the way through end uses\n\tEmphasizes quantitative comparisons and tradeoffs: how much more expensive is electricity from solar panels than from coal plants, and how much pollution does it prevent?  Is solar power as cost-effective an environmental investment as nuclear power or energy efficiency?  And how do we include considerations other than cost?\nPlease note that this is an abridged course, equivalent to roughly half of a full semester-long undergraduate course.  See the syllabus for topics that we include and a list of some we exclude.\n\n \n\nPhoto credits:\n\nSolar Farm CC-BY Michael Mees on flickr \n\tSmokestack CC-BY Patrick on flickr\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.eduand/or report your experience through the edX contact form.\n\n                                    ", 
    "end_date": "2016-08-03T00:00:00Z", 
    "title": "ENGSCI137x: Energy Within Environmental Constraints", 
    "price": 0, 
    "instructors": "David Keith and Daniel Thorpe", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.edx.org/course/energy-within-environmental-constraints-harvardx-engsci137x", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-06-08T00:00:00Z"
}