{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Understanding a city as a whole, its people, components, functions, scales and dynamics, is crucial for the appropriate design and management of the urban system. While the development of cities in different parts of the world is moving in diverse directions, all estimations show that cities worldwide will change and grow strongly in the coming years. Especially in the tropics over the next 3 decades, it is expected that the number of new urban residents will increase by 3 times the population of Europe today. Yet already now, there is an extreme shortage of designers and urban planners able to understand the functioning of a city as a system, and to plan a sustainable and resilient city. To answer questions like: Which methods can contribute to the sustainable performance of a city, and how can we teach this to the next generations, the ETH Future Cities Laboratory in Singapore has produced over the last 3 years many necessary research results. “Future Cities” aims to bring these latest results to the places where they are needed most.\n\nThe only way to better understand the city is by going beyond the physical appearance and by focusing on different representations, properties and impact factors of the urban system. For that reason, in this course we will explore the city as the most complex human-made “organism” with a metabolism that can be modeled in terms of stocks and flows. We will open a holistic view on existing and new cities, with a focus on Asia. Data-driven approaches for the development of the future city will be studied, based on crowdsourcing and sensing. At first, we will give an overview of the components and dynamics of the future cities, and we will show the importance of information and information architecture for the cities of the future. The course will cover the origins, state-of-the-art and applications of information architecture and simulation. “Future Cities” will provide the basis to understand, shape, plan, design, build, manage and continually adapt a city. You will learn to see the consequences of citizen science and the merging of Architecture and information space. You will be up-to-date on the latest research and development on how to better understand, create and manage the future cities for a more resilient urban world.\n\n                                    ", 
    "end_date": "2017-04-07T00:00:00Z", 
    "title": "FC-01x: Future Cities", 
    "price": 0, 
    "instructors": "Dirk Hebel and Gerhard Schmitt", 
    "institution_name": [
        "ETH Zurich"
    ], 
    "commitment": "", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.edx.org/course/future-cities-ethx-fc-01x-2", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-04-01T00:00:00Z"
}