{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Aujourd’hui la gestion de l’eau se trouve confrontée à de nouveaux défis tels que le changement climatique ou les conséquences des activités anthropiques. Les acteurs publics ou privés dans ce domaine doivent développer de nouvelles compétences pour mieux gérer le cycle de l’eau « dans son ensemble ». \n\nPar conséquent, l’objectif de ce MOOC est de comprendre les problèmes touchant à la gouvernance de la ressource en eau. Ce cours définira tout d’abord ce qu’est une ressource et plus particulièrement l’eau, son usage, les activités qui y sont rattachées ainsi que les conflits éventuels. Le cours portera plus en détail sur la gestion de l’eau en analysant les différents types de droits et devoirs qui entrent en jeu tels que le développement d’une réglementation multi-sectorielle et d’une approche de gestion par bassin versant. \n\nA l’issu de ce cours, notre objectif est de vous permettre \n1) d’identifier les principaux enjeux et stratégies de gestion de la ressource en eau ;\n2) d’acquérir des clés de lecture pour comprendre les variables (environnementales, institutionnelles, et politiques) influençant la ressource et nécessitant des ajustements en terme de gestion.\n\nCe cours a été développé par le Pôle Eau de Genève et soutenu financièrement par la Direction du développement et de la coopération suisse (DDC). A côté des chercheurs de l’Université de Genève issus de différentes facultés, des chercheurs d’autres universités et centres de recherche interviendront dans ce cours ainsi que des praticiens confrontés au quotidien à la dimension politique de la gestion de l’eau. \n\nCe MOOC est destiné à toutes personnes intéressées par le secteur de l’eau. Vous n’avez pas besoin de formation préalable pour suivre notre programme. Les réflexions présentées dans ce cours se veulent transposables à différents contextes et échelles d’analyse.\n\nCe cours sera aussi disponible avec des sous-titres anglais (à la fin 2015) sur: https://www.coursera.org/learn/watermanagement\n\n                                            Syllabus\n                        Module 1: De la définition d'une ressource aux idéaux de la gestion communautaireBienvenu(e)s dans ce MOOC en Gestion et Politique de l’eau ! Nous nous réjouissons de vous accompagner tout au long de ce cours ! Ce premier module définira premièrement la notion de ressource afin de mieux appréhender les usages et les pressions s’exerçant sur la ressource en eau. Puis, nous aborderons la problématique de la gestion des biens communs, tel que l’eau, avec notamment les travaux d’Elinor Ostrom. Pour la régulation de ce type de biens, nous verrons plusieurs modes, tels que la gestion par l’État, par le marché, ou encore par une gestion communautaire avec deux cas d’études de gestion communautaire de l’eau en Amérique Latine. Un quiz clôturera ce module et équivaut à 20% de la note finale. Pour le réussir, vous devez avoir au moins 80% de réponses correctes.Module 2: Les règles de la ressource, leurs usages et leur contournementNos sociétés se sont organisées pour la gestion de l’eau à travers la mise en oeuvre de droits de propriété et de politiques publiques permettant de définir et de coordonner les nombreux droits d'usages sur la ressource. Ce deuxième module vise à mieux comprendre la complexité de ces deux corpus juridiques avec le cadre d’analyse des Régimes Institutionnels des Ressources (RIR). Après la présentation de ce cadre d’analyse, nous l’appliquerons aux cas suisse et européen afin de mieux comprendre les règles régissant la gestion de l’eau dans ces territoires. Enfin, nous dépasserons ce cadre en traitant des questions de mise en oeuvre des règles avec les exemples des stratégies d’activation du droit et des arrangements de régulation localisés. Un quiz clôturera ce module et équivaut à 20% de la note finale. Pour le réussir, vous devez avoir au moins 80% de réponses correctes.Module 3: De la Gestion Intégrée des Ressources en Eau (GIRE) au Nexus Eau-Énergie-Nourriture et ÉcosystèmesAprès avoir abordé les règles régissant la gestion de l’eau ainsi que leur mise en oeuvre, ce troisième module traite des questions d’intersectorialité de la ressource en eau. Il se concentre sur deux concepts avec tout d'abord celui de la Gestion Intégrée des Ressources en Eau (GIRE) visant à développer une gestion coordonner des ressources en eau et de ses ressources associées. Puis, nous aborderons l’approche dite du Nexus Eau-Énergie-Nourriture et Écosystèmes pour une considération des usagers de l'eau mais également de leurs interactions avec d'autres secteurs. Ce module se terminera sur les cas d’étude du Mékong et du fleuve Columbia (USA) afin d’illustrer les difficultés de concilier différents usages d’un fleuve, tels que l’hydroélectricité, la sécurité alimentaire ou encore la protection des écosystèmes. Un quiz clôturera ce module et équivaut à 20% de la note finale. Pour le réussir, vous devez avoir au moins 80% de réponses correctes.Module 4: La gestion intégrée par bassin versantDans ce module nous allons nous intéresser au périmètre de la gestion de l’eau avec le concept de gestion par bassin versant. Nous verrons comment cette notion a été promue comme unité de référence pour la gestion de l’eau par les acteurs aux niveaux local (en Suisse), européen (avec le cas du Rhin), et international. Ces cas nous permettrons de voir les avantages mais également les limites pratiques et institutionnelles que pose la gestion par bassin versant. Un quiz clôturera ce module et équivaut à 20% de la note finale. Pour le réussir, vous devez avoir au moins 80% de réponses correctes.Module 5: L'eau comme facteur de conflit et de coopérationNous voici arrivé(e)s au dernier module de ce cours, module dédié aux conflits et à la coopération autour des ressources en eau. Afin de mieux comprendre les interactions des acteurs autour d’un même bassin versant, nous vous présenterons le cadre théorique de l’hydro-hégémonie. Ce dernier sera illustré grâce au cas du bassin du Nil, où nous analyserons les relations entre l’Égypte, pays le plus en aval, avec les autres États riverains. Ensuite, nous présenterons différents mécanismes institutionnels favorisant la coopération entre États, tels que les organismes de bassin, avec les cas de l’Organisation pour la Mise en Valeur du Fleuve Sénégal et la Commission du Mékong. Ce module se terminera sur le rôle du droit international de l’eau dans la coopération liée à l’eau. Un quiz clôturera ce module et équivaut à 20% de la note finale. Pour le réussir, vous devez avoir au moins 80% de réponses correctes. Nous espérons que ce cours vous a apporté(e)s des perspectives intéressantes et vous a donné envie d’aller plus loin dans le domaine de la gestion de l’eau. Nous vous remercions de votre participation !\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Gestion et Politique de l'eau ", 
    "price": 0, 
    "instructors": "Géraldine Pflieger and Christian Bréthaut", 
    "institution_name": [
        "University of Geneva"
    ], 
    "commitment": "", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/gestion-eau", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}