{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Entre 1950 e 2010, a taxa de urbanização da América Latina passou de 41% a 79%. Caso esta tendência se mantenha, a taxa de urbanização em 2030 será de cerca de 90%, fazendo da região a mais urbanizada do planeta.\n\nEssa tendência consolida a cidade como o centro do desenvolvimento econômico e humano da região. A cidade está criando trabalho, está inovando, está repensando seus sistemas de saúde e educação, transporte, está fazendo frente às mudanças do clima, está abrindo espaços para o debate e a socialização. Para que esse dinamismo possa traduzir-se em um fenômeno exitoso, a cidade deve aprender a planejar seu presente pensando em seu futuro, buscando o equilíbrio entre crescimento econômico, a inclusão social e o respeito ao meio ambiente. É, portanto, responsabilidade das cidades melhorar a qualidade de vida das gerações presentes sem comprometer o bem estar das gerações futuras.\n\nCom o objetivo de responder a este desafio, o BID criou um curso que busca fortalecer os conhecimentos e capacidades dos participantes em gerir o desenvolvimento sustentável de suas cidades. E para isso, o curso parte da premissa que a sustentabilidade das cidades só será alcançada por meio de uma perspectiva integrada e intersetorial; uma perspectiva integral, onde se trabalhe de maneira conjunta os desafios econômicos, fiscais, urbanos, ambientais, institucionais e de governabilidade das cidades junto com uma perspectiva intersetorial, onde as diferentes áreas e níveis de governo se coordenem e que se articulem com o setor privado e com a sociedade civil.\n\nCom o objetivo de entender melhor essa perspectiva, o curso analisa a situação, os desafios setoriais e intersetoriais que as cidades encontram na gestão das principais áreas de sua competência: finanças subnacionais, desenvolvimento produtivo, planejamento urbano, transporte, segurança cidadã, água, ar etc. Desta forma, com o objetivo de abordar o planejamento do desenvolvimento sustentável das cidades médias latino americanas, o curso apresenta a “Iniciativa Cidades Emergentes e Sustentáveis”, uma ferramenta de gestão que permite dar sentido ao trabalho analítico das dimensões/desafios de forma integrada.\n\nAssim como na América Latina e no Caribe, o Brasil possui grandes desafios ambientais, urbanos e fiscais para a sustentabilidade de suas cidades. Dentre eles se destacam os altos índices de violência - 25,8 mortes violentas por 100 mil habitantes segundo o Fórum Brasileiro de Segurança Pública; a desigualdade urbana, uma vez que o país é o 4º mais desigual da América Latina e Caribe; e a vulnerabilidade diante de desastres naturais, onde se calcula, por exemplo, que a reconstrução das cidades cariocas devastadas pelas enchentes e pelos deslizamentos de 2011 custou 1,3% do PIB do estado do Rio de Janeiro; ou ainda, degradação ambiental, com um índice de 63% de esgoto sendo lançado nos corpos hídricos sem nenhum tratamento, segundo o MCidades.\n\nAlém de fornecer conceitos e uma visão abrangente da situação do Brasil em relação à sustentabilidade das cidades, neste curso serão abordados alguns desafios dos municípios, bem como exemplos práticos de como esses problemas estão sendo enfrentados.\n\n                                    ", 
    "end_date": "2016-05-10T00:00:00Z", 
    "title": "IDB4.1x: Liderando o Desenvolvimento Sustentável das Cidades", 
    "price": 0, 
    "instructors": "Jose E. Yitani Ríos, Daniela Carrera, ​Ana María Rodríguez, Ellis Juan, Horacio Terraza, Marcia Casseb, Mara Alvim Motta, Rebecca Sabo, David Maleki, William Lauriano, Marcelo Facchina, Katia Miller, Ricardo De Vecchi, María Isabel Beltrán, Cristina MacDowell, Alejandro de la Reza, Vanderleia Radaelli, Diego Carrión, Javier León, Darío Hidalgo, Heloísa Barbeiro, José Brakarz, Santiago Bonifatti, Clean Air Institute, Gloria Visconti, Arturo Galindo, Maria Eugenia Schmuck, ​Carolina Barco, Patricio Tudela, Nathalie Alvarado and Adenilson Ferreira", 
    "institution_name": [
        "IDB ( Inter-American Development Bank )"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.edx.org/course/liderando-o-desenvolvimento-sustentavel-idbx-idb4-1x-0", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-03-29T00:00:00Z"
}