{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    During the four coming weeks, best experts in bitumen will bring you their knowledge and experience to build a strong understanding of today’s realities and new perspectives on the future of bitumen.\n\nTotal is the European leader on bitumen markets. Innovation has always been the key to sustainability and durability in the products they develop. Their main objective here is to share technical knowledge and experience to insure bitumen are being used in the most effective and efficient ways for their different applications in road works.\n\nEcole des Ponts, France oldest engineering school, remains very much in the present, as it has always been, in training engineers in order to meet the needs of our society and citizens in key areas such as transport housing and urban services, but also in fields like energy, environment, climate sciences, land-use planning and sustainable development.\n\nNineteen world recognized experts on bitumen are contributing to this MOOC.\n\nThe idea is to provide the broadest prism on this topic area with speakers coming from research, industry and end users.\n\n                                            Syllabus\n                        Bitumen market, generalities, the manufacture of bitumen, transport, uses of bitumen, main developments and alternativesOrigins, history, definition, terminology | market per geographical areas, figures of consumption, main producers, capacities of production, ranking, main flows between areas | global development of motorised transport - cars, airplane - was one of the single most development of 20-21st centuries | global development of buidings, roofing and other applications of bitumen | difference between bitumen, cement and tar coal. Advantages and drawback of each | different ways of transport of bitumen and present the supply chain diagram and restrictions. ADR Regulation | sampling, handling and safety principles. Hazard from handling hot bitumen is thermal burns.Constitution, structure and characterization of bitumen - specifications-rheologySchematic constitution and structure of bitumen, relationship between structure and rheology | Performance tests | Bitumen 3 states | Penetration test EN 1426 &amp; Softening Point EN 142 | viscosity measurement EN 12596, EN 12595, Explanation of breaking point Fraass measurement EN 12593 | testing Binder after RTFOT, after RTFOT and PAV | Euopean specifications and process of revision | Viscosity based standards (ASTM D3381 | Deformation and flow. Elasticity, plasticity, visoc-elasticity. Newtonian, Non-Newtonian behaviour. Stress-strain response, shear modulus and phase angle. | Bending Beam Rheometer (BBR) and Dynamic Shear Rheometer (DSR) | Superpave specifications.Modifications of bitumen and applications (roads, roofing,…)Modifications using polymers. Performance of PmB. Elastic recovery test. | of  types of modifications of bitumen: CRMB, warm mix asphalt, temperature reduction | Bitumen emulsions, their components, manufacture, storage, handling, properties, classification, uses | surface treatments | design of pavements and types of aggregates |  fundamental tests, the simulative tests (fatigue test, rutting test, giratory compactor,…) | interest of full scale testing of asphalt mix: example of IFSTTAR carousel | Hot mix plants, transport, laying and compaction of asphalt mix | physical characteristics and industrial applications for sealing.Health, Safety, Environment &amp; Quality concerns regarding bitumen, and examples of research &amp; innovation actionsDangers and risks involved with road-building bitumens | Dangers and risks involved with industrial bitumens. | Innovation in the frame of safety with bitumen | Research and Innovation applied for recycling of asphalt pavement, of the use of waste asphalt pavement containing bitumen and not tar, for manufacturing new product.| Research and Innovation applied for bio bitumen Algoroute program and other origins of bitumen | Research and Innovation applied for environmental issues and life cycle inventory (LCI | Key areas for the  Research and Innovation applied for bitumen new tests methods | Road of the future:: 5th generation road.\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Mastering bitumen for better roads and innovative applications", 
    "price": 0, 
    "instructors": "Sophie LIMBORG, Olivier GAMET, Mike SOUTHERN, Gilles GAUTHIER, Clémence QUEFFELEC, Armel de la BOURDONNAYE and Eric GOSSE", 
    "institution_name": [
        "École des Ponts Paritech"
    ], 
    "commitment": "", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/mastering-bitumen", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}