{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Las estructuras están implicadas en nuestras vidas: las plantas, los animales, casi todo lo que fabrica el ser humano, incluso nuestro propio cuerpo, deben soportar una serie de fuerzas sin romperse, y por lo tanto prácticamente cualquier elemento de nuestro entorno es una estructura de una clase u otra. No cabe duda de que entender cómo se comportan las estructuras es fundamental para entender el mundo que nos rodea, para comprender la naturaleza y para juzgar mejor los progresos que ha hecho la humanidad a lo largo de la historia. Sin embargo, los ingenieros hemos fallado una y otra vez cuando hemos intentado explicar esta materia de forma que los no entendidos puedan entender su importancia.\n\nEste curso pretende saltar esa brecha existente entre los expertos en cálculo de estructuras y los profanos utilizando un lenguaje asequible, empleando ejemplos históricos y proponiendo ensayos sencillos que pueden hacerse en casa. El curso abordará no sólo el problema de por qué los edificios y los puentes se caen sino también otras muchas cuestiones ¿Por qué las ventanas de los aviones son redondas? ¿Por qué los gusanos tienen esa forma? ¿Por qué los murciélagos pueden volar dentro de un rosal sin rasgarse las alas? ¿Cómo funcionan las arterias? ¿Por qué las catedrales góticas pueden ser tan esbeltas? ¿Por qué hay construcciones romanas que siguen en pie 2000 años después? ¿Qué podemos aprender sobre los constructores de las diferentes estructuras que nos han legado nuestros antepasados? Muchos contenidos de este curso pueden ser útiles para médicos, biólogos, artistas, historiadores y arqueólogos.More info\" / \"Más información\n\n                                    ", 
    "end_date": "2015-03-31T00:00:00Z", 
    "title": "MMC.1x: Caer o No caer. El Secreto de las Estructuras.", 
    "price": 0, 
    "instructors": "Carlos Santiuste, José Fernández Sáez, Ramón Zaera, José Luis Pérez Castellanos, David Varas and Jesús Pernas", 
    "institution_name": [
        "Universidad Carlos iii de Madrid"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.edx.org/course/caer-o-no-caer-el-secreto-de-las-uc3mx-mmc-1x", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-02-03T00:00:00Z"
}