{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Le cours présente un tour d’horizon introductif des interactions entre la mobilité et les dynamiques urbaines. Il propose des outils méthodologiques et opérationnels permettant d’appréhender et de réguler la mobilité.   \n\nCes vingt dernières années, la mobilité urbaine a beaucoup changé. Le nombre de déplacements de loisirs a augmenté tandis que la part des déplacements pour motif travail a diminué. Dans le même temps, de nouvelles formes de mobilités se sont développées, comme la multirésidentialité, la pendularité de longue distance, le tourisme urbain et l’excursionnisme. Ces changements ont été concommittants de transformations urbaines comme l’étalement urbain ou la fragmentation.\n\nDans ce contexte, la mobilité est un enjeu pour l’ingénierie des transports urbains et le développement territorial, en particulier urbain: sa régulation nécessite une appréhension nouvelle de la demande de transport.\n\nLe cours montre ainsi aux étudiants les interrelations entre la ville et la mobilité, l’espace urbain et les flux de déplacements, tout en leur offrant une vision renouvelée du transport et de son impact sur le territoire et les modes de vie.\n\n                                            Syllabus\n                        IntroductionLe cours présente un tour d’horizon introductif des interactions entre la mobilité et les dynamiques urbaines. Il propose des outils méthodologiques et opérationnels permettant d’appréhender et de réguler la mobilité.  Ces vingt dernières années, la mobilité urbaine a beaucoup changé. Le nombre de déplacements de loisirs a augmenté tandis que la part des déplacements pour motif travail a diminué. Dans le même temps, de nouvelles formes de mobilités se sont développées, comme la multirésidentialité, la pendularité de longue distance, le tourisme urbain et l’excursionnisme. Ces changements ont été concomittants de transformations urbaines comme l’étalement urbain ou la fragmentation.Dans ce contexte, la mobilité est un enjeu pour l’ingénierie des transports urbains et le développement territorial, en particulier urbain: sa régulation nécessite une appréhension nouvelle de la demande de transport. Le cours montre ainsi aux étudiants les interrelations entre la ville et la mobilité, l’espace urbain et les flux de déplacements, tout en leur offrant une vision renouvelée du transport et de son impact sur le territoire et les modes de vie.La transformation des territoires par la mobilitéL’objectif du premier cours est d’identifier les qualités conceptuelles que doivent avoir les outils de description des flux et des déplacements pour répondre aux enjeux de l’aménagement du territoire et de l’urbanisme contemporain. Il consiste en une série de discussions théoriques autour du concept de mobilité.  La transformation des modes de vie urbainsL’objectif de ce second module est de montrer comment les territoires se sont progressivement transformés en lien avec l’évolution des potentiels de vitesses procurés par les systèmes de transports rapides, puis les technologies de l’information et de la communication. De la nécessité de redéfinir la mobilitéL’objectif de cette troisième semaine de cours est d’identifier les qualités conceptuelles que doivent avoir les outils de description des flux et des déplacements pour répondre aux enjeux de l’aménagement du territoire et de l’urbanisme contemporain. Elle consiste en une série de discussions théoriques autour du concept de mobilité.Le potentiel de mobilité et son appréhensionL’objet de ce quatrième module est de proposer une conception de la mobilité qui réponde aux discussions et critiques formulées lors du cours précédent, puis de mettre en pratique cette approche à travers une série d'exemples.Le choix modal et son appréhensionInfluencer l’utilisation des différents moyens de transport dans la vie quotidienne est un objectif central des politiques de transports urbains en Europe depuis plusieurs décennies. Cette cinquième semaine de cours propose de se saisir de cette question – le choix modal – à partir de la conception de la mobilité proposée au cours 4.Mobilité et urbanismeCe sixième module a pour objet de décrire comment  le processus d’interaction systémique entre les trois catégories d’opérateurs de la mobilité produit matériellement des tissus et des espaces publics urbains. Territoires, réseaux et formes de l'urbanisationDans ce dernier module, la problématique de la fabrication des tissus est transposée à l’échelle des grands territoires. \n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Mobilité et urbanisme", 
    "price": 0, 
    "instructors": "Vincent Kaufmann", 
    "institution_name": [
        "École Polytechnique Fédérale de Lausanne"
    ], 
    "commitment": "", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/mobiurba", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}