{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Whether you are a city-dweller or not, cities are profoundly shaping the lives of nearly everyone and everything on the planet. The way that we manage cities now will also determine the kinds of lives that our children, grandchildren and great grandchildren are able to have.\r\nIn this course, we will be looking at the key city support systems of food, nature, transport, resources and energy. We’ll discuss some of the key challenges faced by all cities around managing these systems so that they meet human needs within the finite resources of our planet. We’ll also be sharing some key lessons and inspiring stories from Bristol, which earned the title of European Green Capital in 2015.\r\nThe aim of this course is to provide learners with the skills and capability to lead environmental change in their own communities. You’ll get a rich mix of theoretical and practical skills and through our community learning approach, have the opportunity to build your own network of likeminded people to work with and develop ideas and approaches with.\r\nAll of our learning materials are contained within our ‘Open Education’ virtual learning environment. Each week follows a specified template so that you become familiar with the tasks that we set for you. You’ll watch video presentations, complete quizzes, use our discussion forums and have a weekly task to undertake.\r\nFor those who wish to develop their understanding of the issues and debates, a suite of additional reading and signposting to other areas will be included.\n\n                                    ", 
    "end_date": "2016-03-21T00:00:00Z", 
    "title": "Our Green City: Global challenges, Bristol solutions", 
    "price": 0, 
    "instructors": "Sarah Hills", 
    "institution_name": [
        "University of the West of England"
    ], 
    "commitment": "1-3 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://openeducation.blackboard.com/mooc-catalog/courseDetails/view?course_id=_752_1", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open Education by Blackboard"
    ], 
    "start_date": "2016-02-01T00:00:00Z"
}