{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Considering the importance of offshore structures, one has to recognize that there are other intrinsic uncertainties such as material properties, analysis methods, design procedures etc, which are addressed rationally. A detailed knowledge of reliability of offshore structures using probabilistic tools becomes need of the hour for both industry and academia. Offshore activities, on one hand, lead to increase in societal wealth, and, on the other hand, make society vulnerable to risks. An offshore engineer is usually accountable for the decisions that he takes. A hallmark of professionalism is to quantify the risks and benefits involved. The present course aims to introduce the basics of the structural reliability analysis procedures. The Registrants would benefit from the course by learning the basics of reliability-based design and principles underlying code calibration, which would provide the groundwork to embark upon research in this field. Key focus will be on safety and reliability issues of offshore facilities during analysis and design, inspection and planning. \n\n                                            Syllabus\n                        Module 1: Concepts of probability Sampling statisticsTypes of uncertaintiesModeling random variables like loads, material properties etcIntroduction to classical reliability theoriesError estimation\r\nModule 2: Levels of reliabilityReliability estimatesFOSM, AFOSM and application problemsCodes of practice of safety checkReliability bounds of structural systemsTreatment of geometric variablesProbabilistic methods of code calibrations\r\nModule 3: Application to offshore structuresStochastic processGaussian processRisk assessmentHazard identificationETA, FTARisk modeling and Risk pictureProbabilistic risk assessment\n                                    ", 
    "end_date": "2016-04-11T00:00:00Z", 
    "title": "Risk and Reliability of offshore structures", 
    "price": 0, 
    "instructors": "Srinivasan Chandarsekaran", 
    "institution_name": [
        "IIT ( Indian Institute of Technology Madras)"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://onlinecourses.nptel.ac.in/noc16_oe01", 
    "duration": "12 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NPTEL"
    ], 
    "start_date": "2016-01-18T00:00:00Z"
}