{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    L’objet de ce cours est l’étude de la restructuration des quartiers précaires des villes africaines. Il s’agit, en partant de la compréhension de leur formation, de leur organisation et de leur fonctionnement, d’examiner les modes d’intervention qui visent leur revalorisation et intégration dans les structures formelles des villes qui les accueillent.\n\nLa croissance rapide des villes s’est accompagnée, sur l’ensemble des continents, de mécanismes parfois déroutants de production urbaine qui ont mis à mal les équilibres territoriaux et sociaux des agglomérations. \n\nA  l’heure actuelle, près d’un milliard de personnes dans le monde, vivent dans des quartiers précaires, en raison des mauvaises conditions d’accueil et de la pénurie de logements. Cela est particulièrement vrai des villes africaines, où la croissance s’opère principalement en périphérie, par la création de quartiers précaires où se concentre la pauvreté urbaine.\n\nL’existence et l’extension de ce type de quartiers interrogent sur la capacité de ces villes à intégrer les populations pauvres, en même temps qu’elles révèlent les limites des politiques urbaines à planifier et réguler le développement des grandes agglomérations. La question est devenue si préoccupante que la question de la restructuration des quartiers précaires dépasse aujourd’hui le cadre strict d’une intervention physique pour se poser comme une question de développement à part entière.\n\nQuelle lecture peut-on faire de l’existence et de la prolifération des quartiers précaires en Afrique? Quelles ont été, jusqu’ici, les approches et réponses apportées par les gouvernants et les bailleurs? Quels modes et quels outils ont été expérimentés pour leur restructuration? Et quelles leçons peut-on tirer de la mise oeuvre des diverses opérations initiées au cours des années passes?\n\n                                            Syllabus\n                        Les quartiers précaires des villes d’Afrique : problématique et genèseCette première semaine de cours est consacrée à l’examen de la genèse ainsi qu’à l’ampleur du phénomène de précarité dans les villes d’Afrique. Bien que le phénomène soit planétaire, il est de plus en plus devenu la caractéristique des pays du Sud et particulièrement ceux d’Afrique. Nous ferons ressortir le poids de cette précarité dans les villes africaines en nous intéressant à la crise urbaine et à ses diverses manifestations, particulièrement celles qui ont affecté les questions liées au foncier et au logement, des vecteurs essentiels pour l’insertion urbaine des populationsEtat des lieux – Situations – DiversitéCette deuxième semaine est consacrée à l’état des lieux et à l’examen de la diversité des quartiers précaires des villes africaines. Bien que présentant souvent les mêmes caractéristiques, les quartiers précaires des villes africaines peuvent se singulariser au regard des formes d’irrégularités. Nous examinerons ainsi les différentes formes d’irrégularité que l’on rencontre et ferons ressortir les caractéristiques qui s’attachent à chaque type de quartiers préalablement établis dans le cadre d’une typologie.Quelles approches et quelles réponses ? La troisième semaine est consacrée aux approches et réponses jusque-là apportées à la problématique de la restructuration des quartiers précaires des villes africaines ; il s’agira d’abord d’examiner l’approche retenue par les pouvoirs publics (souvent intervenue en termes de déguerpissements) puis, les solutions préconisées par les bailleurs de fonds et particulièrement la Banque mondiale ; nous nous intéresserons enfin à des cas précis d’opérations d’amélioration de quartiers précaires dans deux pays : le Maroc et le Sénégal.Méthodologies, modes et outils de restructuration des quartiers précaires Au cours de cette quatrième semaine, nous étudierons les objectifs et les moyens de restructurer les quartiers précaires à travers l’analyse des deux types d’opérations qu’on rencontre à l’heure actuelle : la résorption intégrale et la restructuration in-situ. Nous nous appuierons au cours de cette semaine sur l’exemple de la restructuration du quartier précaire d’Elmina à Nouakchott (conduite entre 2003 et 2008), pour appréhender les différentes étapes et tenterons une synthèse des leçons et des expériences pouvant être tirées des opérations conduites ces dernières années dans différentes villes africaines. \nSemaine 5: FinalisationDurant cette semaine, vous devez évaluer l'exercice d'application de vos camarades et répondre au Quiz final.\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Villes africaines : Restructuration des quartiers précaires", 
    "price": 0, 
    "instructors": "Isagha Diagana and Jérôme Chenal", 
    "institution_name": [
        "École Polytechnique Fédérale de Lausanne"
    ], 
    "commitment": "", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/bidonvilles", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}