{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Les villes africaines, en particulier les grandes agglomérations, sont marquées depuis la 2ème moitié du XXème siècle par une croissance démographique et spatiale sans précédent, ce qui accroit les besoins de mobilité pour relier des lieux de plus en plus éloignés. Il s’agira durant le cours, dans un premier temps, de documenter le contexte de mobilité dans les villes africaines. Celui-ci est marqué depuis les indépendances par des crises climatiques et économiques qui entrainent des mouvements de migration des campagnes vers les villes, l’entrée de l’informel dans l’économie urbaine et une réduction des ressources budgétaires des Etats qui impacte l'investissement dans les services sociaux de base y compris le transport. Dans un second temps, le cours va explorer la théorie de la mobilité comme stratégie d’accès à la ville. Pour ce faire il analysera les stratégies de mobilité dans les villes africaines aussi bien résidentielles que quotidiennes et selon les catégories socioéconomiques. La troisième partie du cours est axée sur les politiques de gestion de la mobilité urbaine. Il s’agira de mettre en rapport les éléments du contexte identifiés avec les stratégies de mobilité analysées pour apprécier l’efficience des politiques de gestion urbaine et ressortir les forces et faiblesses en vue de l’action.\n\n                                            Syllabus\n                        Contexte et rappels conceptuelsCette première partie a un double objet : d’une part, rappeler brièvement quelques concepts de base et, d’autre part, camper le décor à la fois spatial, politique, économique et spatial dans lequel se déroulent les mobilités dans les villes africaines au début du 21ème siècle.Le système de transport urbain : l’offre de services et le jeu des acteursLa deuxième partie porte sur l’évolution de l’offre de service de transport dans les villes africaines passant des mains du public au privé. Elle met l’accent sur les processus et le jeu des acteurs.Pratiques de mobilité urbaineDans cette troisième partie sur les pratiques de mobilités urbaines en Afrique, nous abordons les comportements et stratégies de mobilités. Ils sont étudiés selon les déterminants des ruptures de la vie quotidienne : le sexe, le cycle de vie, le niveau de vie et le lieu de résidence. Politiques de mobilité urbaineCette quatrième partie est consacrée aux stratégies développées par les politiques pour répondre aux besoins de mobilité urbaine. Elle appréhende l’action publique dans ses rapports avec les interventions des partenaires au développement et les acteurs locaux.FinalisationDurant cette semaine, vous devez évaluer l'exercice d'application de vos camarades et répondre au Quiz final.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Villes africaines: Mobilités et transports urbains", 
    "price": 0, 
    "instructors": "Jérôme Chenal and Pape Sakho", 
    "institution_name": [
        "École Polytechnique Fédérale de Lausanne"
    ], 
    "commitment": "", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/mobilite-afrique", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}