{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Les nouvelles technologies de l’information ont facilité l’accès à de nombreuses bases de données offrant au grand public, mais surtout aux professionnels, une multitude de services. Le domaine de l’information géographique a également suivi ce mouvement en modernisant l’ensemble des supports, des plans, des cartes topographiques et de tous les types de données à référence spatiale. Face au déploiement massif des cartes numériques et des nombreux services basés sur la localisation, il s’agit de rester critique et surtout de développer les capacités nécessaires afin de choisir les outils et jeux de géodonnées adaptés aux besoins professionnels. \n\nC’est dans cette optique que ce cours propose de développer les éléments fondamentaux de la géomatique en décrivant les domaines clés que sont: les références géodésiques, les techniques d’acquisition des géodonnées, la topométrie, la localisation par satellites et la modélisation et représentation du terrain.\n\nCet enseignement est proposé aux futurs ingénieurs et architectes qui ont recours aux géodonnées pour la réalisation de projets d’aménagement, de construction, de gestion de l’environnement, de transport et de développement territorial. Dans ces domaines, l’accès aux données à référence spatiale ainsi qu’une connaissance des sources d’information et de leur qualité sont donc primordiales pour la conduite de projets.\n\n                                            Syllabus\n                        Introduction à la géomatique Cette introduction vous permet de faire vos premiers pas dans la géomatique en manipulant quelques concepts simples. Bases de géodésie : introductionLa géodésie consiste à déterminer la forme et les dimensions de la Terre. Bases de géodésie : références et projectionsLes références géodésiques permettent de définir les coordonnées de points à la surface de la Terre.CartographieLa cartographie est la méthode qui permet de représenter fidèlement et de manière synthétique des données d'un pays ou d'un territoire.Nivellement géométriqueLe nivellement est l'opération de base de la topométrie qui permet de déterminer des altitudes en tenant compte de la gravité.Théodolite : orientationLe théodolite est l'instrument emblématique de la topométrie qui permet de mesurer des angles entre des points sur le terrain.Théodolite : lever polaireLe lever polaire est l'opération essentielle de la topométrie qui permet de déterminer les coordonnées de nouveaux points à partir de mesures d'angles et de distances.Mesures et corrections de distances  Les mesures électroniques de distances doivent subirent un certain nombre de corrections pour être compatibles avec un canevas de points en coordonnées nationales.Localisation par satellitesLa localisation par satellites est une branche moderne de la Géomatique qui permet de déterminer une position de l'espace en utilisant des signaux provenant d'une constellation de satellites.Modèles Numériques d'AltitudeL'informatique permet à tout un chacun de créer et manipuler une modélisation du terrain sous forme numérique. Ces modélisations sont utilisés dans des outils de conception et de simulation pour l’ingénierie et l'aménagent.\n                                    ", 
    "end_date": "2016-08-22T00:00:00Z", 
    "title": "Éléments de Géomatique", 
    "price": 0, 
    "instructors": "Pierre-Yves Gilliéron and Bertrand Merminod", 
    "institution_name": [
        "École Polytechnique Fédérale de Lausanne"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/geomatique", 
    "duration": "10 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}