{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Course language is Hebrew! English subtitles are planned but not yet available.\n\nThe Hebrew course description will be followed by an English one.\n\nהשימוש בדלק לסוגיו הוא התשתית שעליה מבוססים החיים המודרניים. כבר יותר ממאה שנה אנו משתמשים בדלקים מאובנים שנאצרו בבטן האדמה – נפט, גז טבעי ופחם – כדי להניע את גלגלי עולמנו: תעשייה מתקדמת, תחבורה מהירה, בתים נוחים ועוד. בקורס זה ננסה לבחון אלטרנטיבות אפשריות לדלקים המאובנים, הגורמים נזק לא מבוטל לסביבתנו ולבריאותנו. נתאר את המחקר המדעי האינטנסיבי המתקיים בתחום, ונציג מגוון טכנולוגיות מתקדמות להפקת אנרגיה נקייה ממקורות טבעיים ומתחדשים – כמו השמש, הרוח והמים – מקורות המצויים בשפע, אינם מזהמים, ואינם מתכלים.\n\nקורס המבוא לאנרגיה מתחדשת ייפתח בשאלות הבסיס של תחום האנרגיה: מהם צורכי האנרגיה של האנושות כיום, ואילו משאבים עומדים לרשותה? אילו תהליכים אנו מכירים  לאיסוף, המרה וניצול של מקורות אנרגיה? מהן הבעיות שנוצרות עקב השימוש הנוכחי במקורות אנרגיה מאובנים? ואיזה שינוי נדרש במדיניות האנרגיה ובמשק האנרגיה של החברה המודרנית?\n\nמכאן נעבור לתיאור הסוגים העיקריים של אנרגיה מתחדשת – מקורות אנרגיה טבעיים, זמינים ובלתי מתכלים, שאינם גורמים נזק סביבתי, ועשויים להחליף את הדלקים המאובנים. נדבר על אנרגיית השמש, אנרגיית הרוח, אנרגיית המים וביו-אנרגיה; ננתח את הטכנולוגיות הקיימות כבר היום לניצול המקורות הללו לצורכי האדם; נציג כלים בסיסיים לחישוב יעילות ההמרה של כל טכנולוגיה, וכמויות האנרגיה שניתן להפיק באמצעותה; ונביא דרכים להערכת הכדאיות הכלכלית של כל אחת מהשיטות.\n\nבמקביל, נדון בקשיים ובאתגרים הממתינים עדיין לפתרון, ונשאל מה יש לעשות כדי שהאנרגיות המתחדשות ייושמו בקנה מידה רחב – בתעשייה, בתחבורה, ובכל תחומי חיינו. נבחן מגוון טכנולוגיות מתקדמות להפקת אנרגיה ממקורות נקיים; נסביר מדוע הן עדיין אינן תופסות את מקומם של הדלקים המאובנים; ונציג כיווני מחקר עכשוויים ופיתוחים חדשניים שמשפרים ומייעלים לא הרף את השיטות הקיימות, במטרה להבטיח לכולנו עתיד בר-קיימא.\n\n \n\nCourse language is Hebrew! English subtitles are planned but not yet available.\n\nFuels are the foundations of modern living. For over a century we have been drawing fossil fuels – oil, coal and natural gas – from the depths of the earth, and using them to power our world: advanced industries, fast transportation, comfortable homes and more. In this course we will examine possible alternatives for these fuels - which have proved quite damaging to both our health and our environment. We will describe the intensive worldwide efforts in this field of research, and present their encouraging outcome: a range of innovative technologies for generating clean energy from natural, non-polluting and renewable sources – such as sunlight, wind and water.\n\nThe course will open with some fundamental questions on energy: What are the energy needs of the global population today, and what will they be tomorrow? What are the resources at our disposal? What are the known processes for harvesting, converting and utilizing resources of energy? What are the problems generated by the use of fossil fuels? In what ways must we change our energy policies and energy economy? And most important of all: What are the alternatives to fossil fuels, and can they supply humanity's extensive and constantly growing energy needs?\n\nSubsequent lessons will introduce the main types of safe, clean, natural and renewable energy sources available to us: solar energy, wind energy, water energy and bioenergy. We will speak of existing technologies that already harness these resources to the needs of humankind, and supply simple tools for computing conversion efficiencies, calculating the amounts of energy produced through the various methods, and assessing their economic feasibility.\n\nIn parallel, we will discuss the remaining problems and challenges, and ask what must be done to enable the large-scale use of renewable energy – in industry, in transportation, and in every other sphere of our lives. We will examine several advanced renewable energy technologies; explain why they have not yet taken the place of fossil fuels; and present cutting-edge innovations and promising research directions – in the ongoing global effort to ensure a sustainable future for us all.\n\n                                            Syllabus\n                        אנרגיה מתחדשת - למה?בשיעור זה נביט בתחום האנרגיה בראייה רחבה. קודם כל נבהיר מדוע בכלל צריך אנרגיה. נסקור מהם משאבי האנרגיה שזמינים לנו, כולל דלקים מאובנים וגם מקורות מתחדשים, ומה מתוכם אנחנו מנצלים כיום. נתאר את ההשלכות של שימוש בדלקים מאובנים לגבי בעיות סביבתיות, בריאותיות וגיאו-פוליטיות, ואיך זה מוביל למסקנה שלא נוכל להמשיך לשרוף דלקים מאובנים לאורך זמן. לסיום, נכיר כלים בסיסיים לניתוח כלכלי של מתקני אנרגיה ולהשוואה בין טכנולוגיות שונות.  מהי אנרגיה?בשיעור זה נלמד את השפה והמושגים הבסיסיים שנדרשים כדי לעסוק באנרגיה. נגדיר מה זו אנרגיה, ונדגים באופן מעשי סוגים שונים של אנרגיה. נראה איך מודדים כמות של אנרגיה, ומה קובע את כמות האנרגיה עבור כל סוג. נבצע תהליכים שבהם אנרגיה עוברת ממקום למקום או עוברת המרה בין סוגי אנרגיה שונים. נגדיר את החוקים הבסיסיים שחייבים להתקיים בתהליכים כאלו, ובעזרתם נוכל להבין את ההתנהגות והביצועים של מערכות אנרגיה. עבור מי שלמד פיזיקה או הנדסה, השיעור הזה הוא תזכורת וריענון. עבור מי שלא למד, חשוב לשים לב ולשלוט במושגים הבסיסיים האלו, כי נשתמש בהם לעיתים קרובות בהמשך הקורס.לנוחיותכם, הכנו קובץ תמצית הגדרות ושיטות חישוב. בקובץ תמצאו במרוכז את ההגדרות והביטויים הכמותיים שמוצגים בשיעור זה, וגם בשיעורים הבאים. שימו לב גם לבוחן הראשון, שניתן לעשות אחרי השיעור. . אנרגיית שמש אבשיעור זה נכיר את אנרגית השמש ונבין את המורכבות שלה מבחינות שונות, כמו הכוונים שמהם מגיעה הקרינה, השינויים בקרינה לאורך זמן ובמקומות שונים, והתכולה של צבעים שונים בקרינת השמש. נראה איך אפשר לאסוף ולרכז את קרינת השמש, ואיך להמיר אותה לאנרגיה חשמלית בעזרת תאים פוטו-ולטאיים. אורח מהתעשייה יספר לנו איך מערכות פוטו-ולטאיות משתלבות בשוק האנרגיה, ומה האתגרים והכוונים לעתיד ביישום תעשייתי של אנרגית שמש. השיעור לא יכלול המרה של אנרגית שמש לאנרגיה תרמית, זה הנושא של השיעור הבא. אנרגית שמש בבשיעור זה נמשיך עם שיטות נוספות לניצול אנרגית שמש. נכיר המרה של קרינת שמש לאנרגיה תרמית בטמפרטורה נמוכה עבור חימום מים לבתי מגורים. נראה קולט שמש לחימום מים ונסביר איך הוא פועל. המרה דומה לאנרגיה תרמית, אבל בתוספת ריכוז הקרינה, נראה בטכנולוגיות של תחנות כוח תרמו-סולריות להפקת חשמל. נציג שיטות לאגירת אנרגיה תרמית, נדון למה זה חשוב עבור מערכות תרמו-סולריות, ואיך עושים זאת. לסיום נדבר עם אורח מהתעשייה ונשמע על יישום הטכנולוגיות של תחנות הכוח תרמו-סולריות בשוק האנרגיה.אנרגית רוחבשיעור זה נלמד על אנרגית רוח, כמה אנרגיה יש ברוח, ואיך היא מתנהגת. נגדיר איך אפשר לאסוף ולהמיר את אנרגית הרוח לאנרגיה חשמלית, מה העקרונות האוירודינמיים שמאפשרים לרוח להניע מכונה שמייצרת חשמל, ומה היעילות התאורטית המקסימלית שניתן להשיג בהמרה הזאת. נכיר טכנולוגיות שונות של טורבינת רוח, ונבקר במעבדה שבה נדגים טורבינת רוח בפעולה. נדבר גם על הצורך במערכות אגירה כדי לפצות על חוסר היציבות של משאב הרוח. לסיום נפגש עם חוקר בתחום אנרגית הרוח ונשמע על פיתוחים חדשים שיכולים לשפר את ביצועי טורבינות הרוח, וגם לתרום בתחומים אחרים של שימוש יעיל באנרגיה. \n\nשימו לב לבוחן השני בקורס, שניתן לעשות בסיום שיעור זה. הבוחן כולל את מה שלמדנו בנושאים של אנרגית שמש ואנרגית רוח. מועד אחרון להגשת הבוחן 20.12.2015.אנרגית מיםבשיעור זה נציג אנרגיה ממקורות שקשורים במים. נציג את המשאבים השונים שכוללים נהרות ואגמים, גלי ים, וגם גיאות ושפל בים. נסביר את העקרונות של תהליכי ההמרה מאנרגית מים, פוטנציאלית וקינטית, לאנרגיה חשמלית. נציג את הטכנולוגיות העיקריות שמאפשרות לבצע המרה כזאת, ונדגים פעולה של אחד מהסוגים הנפוצים של טורבינת מים. נדבר גם על שימוש באנרגית מים בתור מנגנון לאגירת אנרגיה, כדי להעביר אנרגיה מתקופות של עודף ייצור לתקופות של עודף ביקוש. אנרגית ביומסהבשיעור זה נציג אנרגיה ממקורות של ביומסה, כלומר חומר שמקורו בתוצרים של צמחים ובעלי חיים, החל מפסולת עירונית ושאריות של חקלאות, ועד גידולים ספציפיים למטרות הפקת אנרגיה. נאפיין את תכולת האנרגיה של משאב זה בהשוואה לדלקים מאובנים. נדבר על תהליכים שונים לניצול משאבי ביומסה שכוללים שריפה ישירה, המרה כימית, והמרה ביולוגית לייצור דלקים מתחדשים. נארח גם שני חוקרים שיספרו על כוונים חדשים לפיתוח מקורות ותהליכים מתקדמים לניצול אנרגית ביומסה. \n\nאחרי צפייה בשיעור האחרון ניתן לפתור ולהגיש את הבחינה סופית. הבחינה מסכמת את החומר הנלמד לכל אורך הקורס. ראו הנחיות תחת הכותרת ״מטלות״. \n\n                                    ", 
    "end_date": "2016-04-14T00:00:00Z", 
    "title": "מבוא לאנרגיה מתחדשת -  Introduction to Renewable Energy", 
    "price": 0, 
    "instructors": "Avi Kribus and Maya Livshits", 
    "institution_name": [
        "Tel Aviv University"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/renewable-energy", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-02-25T00:00:00Z"
}