{
    "selfpaced": false, 
    "topic_name": [
        "Civil & Environmental Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    這門課是「CAD/BIM技術與應用」專項課程的第六門課，屬於BIM系列課程：「工程資訊管理BIM基礎」、「工程資訊管理BIM塑模」及「工程資訊管理BIM應用」的第二門課。\n\n修習這門課之前，應具備BIM技術的基礎知識，並能操作簡單的BIM模型，如此才能在修習這門課時，充分理解教授的內容與全觀BIM知識間的關聯。「CAD/BIM技術與應用」專項課程的「工程資訊管理BIM基礎」課程，可提供修習這門課前所需具備的相關知識。\n\nBIM模型，是BIM技術應用的基礎。在這門課中，我們以業界廣為應用的建模軟體Autodesk Revit，作為教學工具。學習者將親自建置一棟六層樓住宅的BIM模型，並理解如何將工程施作流程，對應至BIM模型中。唯有依照工程施作流程建置BIM模型，BIM模型才得以實際應用在施工中。完成此課程後，將具備業界所需的BIM塑模能力。\n\n想理解BIM模型是如何製作的嗎？想成為優秀的BIM模型建構師嗎？學習完這門課，你將了解工程實務與建置BIM模型間的對應關聯，並具備BIM塑模的技能。\n\n預估所需學習總時間：45小時。\n\n                                            Syllabus\n                        蓄勢待發歡迎來到「工程資訊管理：BIM塑模」的第一週課程！準備好要學習BIM塑模了嗎？這裡有學習BIM塑模前你所需要的所有資訊，包含了課程的介紹、軟體的安裝教學、作業的評分方式等。請帶著一顆愉快的心，讓我們一起開始學習怎麼建立一個BIM模型吧！工程水平垂直放樣歡迎來到「工程資訊管理：BIM塑模」的第二週課程！經過上一週的準備工作，相信你已經迫不及待想要開始建立BIM模型了吧！在這一週，我們要先從工程的打草稿開始，也就是工程水平與垂直的放樣。你可以閱讀我們精心準備的閱讀資料，複習在康仕仲老師在CAD系列課程中所教授的工程圖識圖原理，並學習到工程中的水平放樣與BIM模型之間的關聯。在實作課程中，我們會教授如何運用BIM塑模工具完成水平、垂直放樣的建置。你準備好了嗎？讓我們一起開始來建立BIM模型吧！B1F 建築模型建置歡迎來到「工程資訊管理：BIM塑模」的第三週課程！經歷上一週的課程後，我們已經了解，工程水平垂直放樣可如何在BIM模型中實現，並學習到放樣的塑模操作。現在我們先來建立地下室的BIM模型元件，從柱、梁、板、牆、門、窗的塑模操作開始學起。然後，你會在這門課中完成地下室的結構體模型，並且也能了解工程實務與塑模操作的和諧搭配。你準備好了嗎？讓我們來建立地下室的BIM模型吧！1F 建築模型建置歡迎來到「工程資訊管理：BIM塑模」的第四週課程！在上一週我們建立了地下室的結構體模型，熟悉如何在Revit塑模軟體中創建柱、梁、板、牆、門、窗元件。接著，我們來學習有關樓梯元件的製作。學習後，你就具備了建立建築物結構體的基本能力了。你將在這週運用學習到的塑模指令，完成地下室與1F的結構體模型。相信經過這些練習，你將會非常熟悉BIM塑模的操作指令。準備好了嗎？讓我們一起來建立1F的BIM模型吧！建築周邊模型建置歡迎來到「工程資訊管理：BIM塑模」的第五週學習！在上一週我們學習到樓梯元件的製作，並完成了1F的結構體模型。相信你應已經很熟悉BIM塑模的操作指令了！我們這週將帶領大家運用我們熟悉的塑模指令，完成工程所需的一些模型細節，例如：排氣墩、屋簷板、車道、排水溝、陰井等。相信經過本週的練習後，你將可進一步體會到BIM模型的應用潛力，並理解一個精準的施工模型的建立，將可大大地幫助工程的順利進行。準備好了嗎？讓我們一起來建立建築周邊的模型吧！下回見這是「工程資訊管理：BIM塑模」的第六週課程，也是最後一週的課程！恭喜你已接近完成這門課的所有學習模組了！本週我們要一起來回顧一下我們如何從一個空白的模型專案檔，建立到現在的BIM模型。相信在塑模的過程中一定充滿許多酸甜苦辣的回憶吧！最後，我們還要一起來看看下一門課程的精彩預告，讓我們充滿信心與期待地向前繼續學習吧！\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "工程資訊管理 BIM 塑模", 
    "price": 0, 
    "instructors": "謝尚賢(Shang-Hsien Patrick Hsieh) ", 
    "institution_name": [
        "National Taiwan University"
    ], 
    "commitment": "6-10 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/bim-sumo", 
    "duration": "6 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}