{"selfpaced": false, "topic_name": ["Finance"], "description": "\n\n                    \n                    \n                    Intermediate Financial and Management Accounting is part two of a programme designed for anyone who is just starting out on their business, finance or accountancy journey and wants to expand their accounting and finance skills. \n\nBuilding on what you learned in Introduction to Financial and Management Accounting, this free online course from the Association of Chartered Certified Accountants will:\n\nEnhance your finance and accountancy skills, exploring how to prepare financial statements and use accounting concepts to aid decision-making.\n\tArm you with the knowledge you need to take your exams in Maintaining Financial Records (FA2) and Managing Costs and Finance (MA2).\n\tPrepare you for a position as an accounting administrator or bookkeeper.\nIf you have some basic knowledge of accountancy, business and finance, then this is the course for you. If you do not, then start with the Introduction course.\n\nThis course does not offer an edX certificate. \n\nFor learners who would like to earn an ACCA certificate for this course, please register with ACCA as a student. Once you pass ACCA’s computer-based exams on demand, you will need to complete an online and interactive module on the \"Foundations in Professionalism.\" Upon completion of this module, you be awarded the Intermediate Certificate in Financial and Management Accounting from ACCA.\n\n                                    ", "end_date": "9999-12-31T23:59:59Z", "title": "FA2-MA2.X: Intermediate Financial and Management Accounting", "price": 0, "instructors": "Valli Rajagopal and Jayne Howson", "institution_name": ["ACCA"], "commitment": "4-5 hours", "subject_name": ["Business & Management"], "course_url": "https://www.edx.org/course/intermediate-financial-management-acca-fa2-ma2-x-3", "duration": null, "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-07-04T00:00:00Z"}