{"selfpaced": true, "topic_name": ["Finance"], "description": "\n\n                    \n                    \n                    Want to learn how to think clearly about important financial decisions and improve your financial literacy? Finance for Everyone will showcase the beauty and power of finance. This introductory finance course will be a gateway into the world of finance and will examine multiple applications to apply to your everyday life. Join us to better understand how to apply frameworks and tools to make smart financial choices.\n\nYou will be able to value the impact of different choices available to you: from renting or buying, evaluating car, home and student loans, or deciding whether to go to college versus pursuing a new idea to simply understanding how the financial world works.\n\nStarting with time value of money, the course will help you develop a full appreciation for the many applications of finance. Using real world examples, the course will enable you to understand and analyze many personal and professional decisions we confront on a daily basis. You will understand stocks and bonds, learn to allocate scarce resources in a value-add way, and adopt smart tools for making every day decisions.\n\nFinance is simultaneously a way of thinking and a set of tools. Finance is everywhere. There are no prerequisites for this course except for a sense of curiosity and a positive attitude. However, a comfort level with algebra and numbers and an understanding of accounting (the language of business) will clearly help. We will, however, try to cover everything starting with fundamentals and highlight when there is a need to do some further work in specific subjects.\n\n                                    ", "end_date": "2017-07-17T00:00:00Z", "title": "FIN101x: Finance for Everyone: Smart Tools for Decision-Making", "price": 0, "instructors": "Gautam Kaul", "institution_name": ["University of Michigan"], "commitment": "5-6 hours", "subject_name": ["Business & Management"], "course_url": "https://www.edx.org/course/finance-everyone-smart-tools-decision-michiganx-fin101x-0", "duration": "53 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-07-11T00:00:00Z"}