{"selfpaced": false, "topic_name": ["Finance"], "description": "\n\n                    \n                    \n                    Research shows that UK households are poor at investment management with a limited understanding of investment choices, risks and returns. The resultant ‘savings gap’ threatens a scenario where many cannot afford to retire. Elsewhere households fail to plan properly to make their investment choices fit with their risk appetites and the time horizons for access to their funds. Finance Fundamentals: Investment Theory and Practice aims to give you the tools to avoid these personal finance nightmares.\n\nYou’ll study the various investment choices and the returns and risks associated with different products. You’ll also study investment strategies and how to ensure your approach to investment is consistent with your risk-return appetite. You’ll also look at how to avoid the individual and group behavioural traits that can impair effective investment decision making.\n\nThroughout the course will provide recent and current case studies on investment issues to demonstrate how the ideas and problems explored in the course are manifested by episodes in the world of personal investments.\n\nThe facilitated 4-week course is right up-to-date and includes coverage of the current reforms to pensions rolled out in 2015 – changes that have radically changed the way many will use their pension savings as they move into retirement.\n\nFinance Fundamentals: Investment Theory and Practice aims to give you the knowledge and confidence to take charge of your investments and your financial future.\n\nDevelop fundamental business and finance skills\n\nThis course has been developed by The Open University Business School – a pioneering institution that is triple accredited by AMBA, EQUIS and AACSB.\n\nIt is one of eight from The Open University, designed to help you gain fundamental business and financial skills, including communication, networking, relationship building, project management, personal financial planning and management, investment and financial services.\n\nYou can complete this course as part of one of these two programs:\n\nFinance Fundamentals: four courses, which will give you valuable skills to manage finances at home and at work, and enable you to earn a FutureLearn Award.\n\nBusiness and Finance Fundamentals: eight courses; holders of FutureLearn Certificates of Achievement for all eight courses can earn 30 UK credits towards The Open University Business School’s BA in Business Management by passing a linked Open University assessment module (requiring separate OU registration and fee).\n\nFor further information about registration, the final assessment course and the BA in Business Management, visit the Open University website.\n\nThe True Potential Centre for the Public Understanding of Finance (True Potential PUFin)\n\nThis course has been adapted from original material created by The Open University’s True Potential Centre for the Public Understanding of Finance, and was made possible thanks to the generous support of True Potential LLP.\n\n\n                                    ", "end_date": "2016-11-21T00:00:00Z", "title": "Finance Fundamentals: Investment Theory and Practice", "price": 0, "instructors": "Martin Upton", "institution_name": ["European Union Committee of the Regions", "The Open University"], "commitment": "3 hours", "subject_name": ["Business & Management"], "course_url": "http://www.futurelearn.com/courses/investment-theory-and-practice?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-10-24T00:00:00Z"}