{"selfpaced": false, "topic_name": ["Finance"], "description": "\n\n                    \n                    \n                    Have you ever watched the evening news and wondered what the anchor meant when she said: “…and the Dow closed 50 points in choppy trading today.”\n \nHave you ever watched Mad Money on CNBC as the host screamed BUY BUY BUY or SELL SELL SELL and clapped your hands with his energy while having no clue what was happening?\n \nHave you watched a movie where successful Wall Street characters dropped cool sounding financial jargon and you smiled and nodded without knowing what they were saying?\n \nHave you ever had someone talk about Roth IRAs and 401Ks, and as you nodded, your heart was racing?\nHave you ever received multiple credit card solicitations in the mail and wondered which ones to sign up for or even if to sign up for any at all?\n\nIf you answered yes to any (and maybe all) of the above then this class is for you.\n\nWant to better understand investments? How credit works? How and why insurance products like life insurance, health insurance, and property insurance might be relevant for you? How to maximize your retirement savings? This course aims to make finding the answers to these questions, and many other similar questions, interesting and fun.\n\nThis personal finance course is divided into four modules: investments, credit, insurance and retirement. Each module is independent and may be studied on its own, although studying them together provides a deeper understanding of the interconnectedness across modules and the various tradeoffs across them.\n\nThroughout the course, we will explore interesting and relevant real world examples so that you can better understand the underlying concepts. We will also relate relevant academic research to the topic on hand and show how the research findings are relevant to your daily financial decisions.\n\nThis course provides practical, ready-to-use solutions to use in your daily life. All solutions may not be equally important for you given your age and priorities, but they will certainly be relevant to you at some point in your life.\n\n                                    ", "end_date": "2016-08-10T00:00:00Z", "title": "FINANCEx: Personal Finance Planning", "price": 0, "instructors": "Sugato Chakravarty", "institution_name": ["Purdue University"], "commitment": "3-4 hours", "subject_name": ["Business & Management"], "course_url": "https://www.edx.org/course/personal-finance-planning-purduex-financex", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-06-15T00:00:00Z"}