{"selfpaced": true, "topic_name": ["Business"], "description": "<p>Almost everyone has to make financial decisions. Even if one is not a business manager or portfolio manager, s/he must make financial decisions appropriately for his/her personal financial well-being, which necessitates a good introduction with the subject matter of finance.  <br></p><p>This is the first course in the series of finance courses to be published at Udemy by the course instructor. Every learner of finance should start their lesson by being introduced with the basic definition of finance, goals of financial management, and the areas of financial decision-making. </p><p>This course consists of several video lectures that will be updated over time and based on students' requests, and additional resources. The lectures contain explanations of necessary concepts along with examples and illustrations. <br></p><p>After completing this course, a learner would be able to define finance, recognize the specific areas of business finance, identify the role, tasks, scope, and challenges of a financial manager, recognize the primary goal of financial decision-making, align the shareholders wealth maximization with other stakeholders interests, compare and choose between profit maximization and share price maximization as the primary goal of financial decision-making, and plan the pathway of learning finance.</p><p>This course is suitable for anyone who wish to achieve financial literacy and/or has the interest about the interesting world of finance. More specifically, entrepreneurs, managers and executives who are going to start learning finance, business students who are going to start learning finance, and anyone who has involvement with financial decision-making would be benefitted from this course. This course is also suitable for absolute beginners who have never attended a finance course before, and may continue learning finance at an advanced level in future.</p><p>The instructor welcomes his students for continuous discussion with him. Any sort of input for improving the course is also appreciated. He also expects your positive and genuine review and rating of the course.<br></p>", "end_date": null, "title": "Introduction to Finance", "price": 0, "instructors": "Md Mohan Uddin", "commitment": "1 hour", "cover_url": "https://udemy-images.udemy.com/course/750x422/591714_7b53_2.jpg", "course_url": "https://www.udemy.com/finance-introduction/", "subject_name": ["Finance"], "duration": null, "language_name": ["English"], "provider_name": ["udemy"], "start_date": "2015-08-24T10:39:33Z"}