{"selfpaced": false, "topic_name": ["Finance"], "description": "\n\n                    \n                    \n                    This course is a theoretically sound and practical exposure to valuation. As the final course of the Specialization, it will be useful to anyone in understanding, conducting or critically evaluating project and company analyses conducted by experts.\n\n                                            Syllabus\n                        Overview of Specialization &amp; CourseThis module contains detailed videos and syllabi of both the Specialization and this course. This specialization has been designed to enable you to learn and apply the powerful tools of modern finance to both personal and professional situations. The courses within progress linearly and build on each other and it is important for you to get an understanding of why this specialization may be relevant to your goals, again both personal and professional. Please review the videos and syllabi as they will give you a sense of the specialization and how this specific course fits within. The teaching style and philosophy of the instructors is also presented to you (hopefully) in sufficient detail. Most importantly, it will give you enough information for you to make a decision about whether you want to take this course, by itself or as part of a specialization.Module 1The first module will focus on the analyses involved in making the most common decision confronted by anyone: a choice between alternative projects. This is a very important part of decision-making within any entity.Module 2The second module of this course will modify the frameworks introduced in the entire specialization to value companies, where a company is essentially a complex collection of “projects.” Module 3Module 3 contains  a mega example of valuation showcasing the application of alternative methods and preparing you for the real world and for the Capstone Course 5 if you are interested in a Specialization Certificate.Module 4This a \"bonus\" module to introduce you some fundamental valuation issues in a global context. All videos contain examples and applications, but there are no assignments and assessments for this module.  Module 5This week will be spent on a short wrap up video of the course and time for assimilation and review by learners to be prepared to take the final exams. In the past, learners have really valued this time and hence it is built into this new structure/platform as well.Module 6This is finals week. Please note there are two finals that cover materials of Modules 1 - 3, and you need to attempt both. \n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Valuing Projects and Companies", "price": 0, "instructors": "Gautam Kaul and Qin Lei", "institution_name": ["University of Michigan"], "commitment": "5-10 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/company-valuation", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}