{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Save Time and Money by Learning This Popular Accounting Program</strong></p><ul style=\"\"><li>Manage the Accounting for Your Own Small Business</li><li>Create Estimates, Statements, and Deposits</li><li>Keep Track of Payments and Bills</li><li>Reconcile Bank Statements</li></ul><p><strong style=\"\">Manage Your Own Accounts With this Popular Program</strong></p><p>QuickBooks is a very popular accounting software package, used in small businesses throughout the world. It was developed and marketed by Intuit, and originally released in 1994. Over the course of its history, many convenient features have been developed, including the addition of QuickBooks Online, a subscription service that can replace the outright purchase of QuickBooks software, and QuickBooks Point of Sale, which is meant to replace a business&#039;s cash register and keeps track of sales receipts.</p><p>If you are a small business owner, or a freelance accountant, you can use QuickBooks to keep track of accounts payable, receivable, to pay bills, to keep track of payments or debts, and to maintain organization in terms of your business or personal finance.</p><p><strong style=\"\">Overview and Contents</strong></p><p>Over the course of 75 video lectures and more than seven hours of content, this QuickBooks Pro 2014 tutorial will teach you all of the necessary fundamentals of this popular and comprehensive accounting software. You will learn how to install and set up the QuickBooks software, beginning with creating a file for your company. With this basic knowledge, you can move forward to developing a chart of accounts, creating estimates and invoices, and organizing a variety of financial statements. By the time you reach the end of the lectures, you will be a skilled QuickBooks Pro 2014 user, able to complete the most necessary accounting tasks all in one organized program.</p><p>This class is perfect for accountants or small business owners who are looking for a comprehensive and organized method for doing their books. At the completion of this course, you will be fully equipped to use QuickBooks Pro 2014 for all of your small business accounting needs.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Learn QuickBooks Pro 2014 the Easy Way", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118284_611d_5.jpg", 
    "course_url": "https://www.udemy.com/learn-quickbooks-pro-2014-training/", 
    "currency": "USD", 
    "subject_name": [
        "Intuit"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-11T17:30:09Z"
}