{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Save Time and Money by Learning This Popular Accounting Program</strong></p><ul><li>Manage the Accounting for Your Own Small Business</li><li>Create Estimates, Statements, and Deposits</li><li>Keep Track of Payments and Bills</li><li>Reconcile Bank Statements</li></ul><p><strong>Manage Your Own Accounts With this Popular Program</strong></p><p>QuickBooks\n is a very popular accounting software package, used in small businesses\n throughout the world. It was developed and marketed by Intuit, and \noriginally released in 1994. Over the course of its history, many \nconvenient features have been developed, including the addition of \nQuickBooks Online, a subscription service that can replace the outright \npurchase of QuickBooks software, and QuickBooks Point of Sale, which is \nmeant to replace a business's cash register and keeps track of sales \nreceipts.</p><p>If you are a small business owner, or a freelance \naccountant, you can use QuickBooks to keep track of accounts payable, \nreceivable, to pay bills, to keep track of payments or debts, and to \nmaintain organization in terms of your business or personal finance.</p><p><strong>Overview and Contents</strong></p><p>Over\n the course of 75 video lectures and more than seven hours of content, \nthis QuickBooks Pro 2015 tutorial will teach you all of the necessary \nfundamentals of this popular and comprehensive accounting software. You \nwill learn how to install and set up the QuickBooks software, beginning \nwith creating a file for your company. With this basic knowledge, you \ncan move forward to developing a chart of accounts, creating estimates \nand invoices, and organizing a variety of financial statements. By the \ntime you reach the end of the lectures, you will be a skilled QuickBooks\n Pro 2015 user, able to complete the most necessary accounting tasks all\n in one organized program.</p>This class is perfect for accountants or small business owners who are looking for a comprehensive andorganized method for doing their books. At the completion of this <p><br></p>\n<p>course, you will be fully equipped to use QuickBooks Pro 2015 for all of your small business accounting needs.</p>", 
    "end_date": null, 
    "title": "Master QuickBooks Pro 2015 the Easy Way", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372188_635a_2.jpg", 
    "course_url": "https://www.udemy.com/master-quickbooks-pro-2015-training/", 
    "currency": "USD", 
    "subject_name": [
        "Intuit"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T08:31:07Z"
}