{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t       My step-by-step lectures are easy to follow and will help you learn QuickBooks and finally understand this mysterious accounting software. QuickBooks offers many functions which may not always apply to your business, which is why I designed the lectures using QuickBooks Pro to only underscore the basic needed functions to do your own bookkeeping, and keep cost down. After teaching QuickBooks too many of my clients on person to person arrangement, I decided to create recorded lectures to reach more of my clients, more efficiently. The client/student will enjoy the benefit of having access to watch these videos over and over, as well as have the ability to ask questions of the instructor.  </p>  <p style=\"\">  \t       My lectures cover setting up new company in QB, demonstrating accounts payable, credit card entries, credit card reconciliation, writing checks, accounts receivable, payroll, payroll tax, financial statements, customizing detail reports, customizing the QuickBooks invoice generated templates, class tracking and customer tracking to determin customer profitability.  </p>  <p style=\"\">  \t       There are a total of 15 lectures, 14 of which are the step-by-step videos demonstrating how to use the various functions within QuickBooks. The key to using QuickBooks is having a good understanding of the order of sequence, and which step needs to be accomplished first to allow you to accomplish the second step. Skipping a step will result in the in the QB function to not work properly. Working with so many entrepreneurs over the years, not understanding the sequence of order has been the reason for not embracing QuickBooks, and abandoning the software.  </p>  <p style=\"\">  \t       Please note that this is not an accounting course, it only introduces the features of QuickBooks and how they are used. The AP, AR &amp; Payroll entries which I have demonstrated in QuickBooks are fictional and may or may not be in accordance with acceptable procedures, laws or regulations. Please consult your accountant with specific requirements in how revenue and expenses should be recorded in QuickBooks.  </p>", 
    "end_date": null, 
    "title": "Mastering QuickbooksPro (Easy step by step tutorial)", 
    "price": "30.00", 
    "instructors": "Cerkez Lena", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/134132_404d_8.jpg", 
    "course_url": "https://www.udemy.com/quickbooks-for-small-businesses/", 
    "currency": "USD", 
    "subject_name": [
        "Intuit"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-16T02:01:11Z"
}