{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn QuickBooks Accounting software with this comprehensive  course from TeachUcomp, Inc. <em>Mastering QuickBooks  Made Easy</em> features 176 video lessons with over 9 hours of introductory  through advanced instruction. Watch, listen and learn as your expert instructor  guides you through each lesson step-by-step. During this media-rich learning  experience, you will see each function performed just as if your instructor  were there with you. Reinforce your learning with the text of our two printable  classroom instruction manuals (Introductory and Advanced), additional images  and practice exercises.&nbsp; You will learn how  to set up a QuickBooks company file, pay employees and vendors, create custom  reports, reconcile your accounts, use estimating, time tracking and much more.</p>  <p>Whether you are completely new to QuickBooks or  upgrading from an older version, this course will empower you with the  knowledge and skills necessary to be a proficient user. We have incorporated  years of classroom training experience and teaching techniques to develop an  easy-to-use course that you can customize to meet your personal learning needs. Simply launch a video lesson or  open one of the manuals and you’re on your way to mastering QuickBooks. This  course also includes training material for versions prior to 2013, making an  upgrade from earlier versions a breeze.</p>  ", 
    "end_date": null, 
    "title": "Mastering QuickBooks 2013 Made Easy Training Tutorial", 
    "price": "45.00", 
    "instructors": "TeachUcomp, Inc.", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32436_b6a4_6.jpg", 
    "course_url": "https://www.udemy.com/mastering-quickbooks-2013-made-easy-training-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Intuit"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-12T17:23:06Z"
}