{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn QuickBooks Online accounting software with this comprehensive course from TeachUcomp, Inc. <em style=\"\">Mastering QuickBooks Online Made Easy</em> features 181 video lessons with over 8 hours of introductory through advanced instruction. Watch, listen and learn as your expert instructor guides you through each lesson step-by-step. During this media-rich learning experience, you will see each function performed just as if your instructor were there with you. Reinforce your learning with the text of our printable classroom instruction manual, additional images and practice exercises. You will learn how to set up a QuickBooks company file, pay employees and vendors, create custom reports, reconcile your accounts, use estimating, time tracking and much more.</p><p>Whether you are completely new to QuickBooks or upgrading from a different version, this course will empower you with the knowledge and skills necessary to be a proficient user. We have incorporated years of classroom training experience and teaching techniques to develop an easy-to-use course that you can customize to meet your personal learning needs. Simply launch the easy-to-use interface, click to start a video lesson or open the manual and you are on your way to mastering QuickBooks Online. </p>", 
    "end_date": null, 
    "title": "QuickBooks Online Plus Made Easy Training Tutorial 2015", 
    "price": "20.00", 
    "instructors": "TeachUcomp, Inc.", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544522_1d9a_6.jpg", 
    "course_url": "https://www.udemy.com/quickbooks-online-plus-made-easy-training-tutorial-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Intuit"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T01:47:02Z"
}