{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t  Quickbooks Online Accounts course is about how to use Quickbooks Online based on the most popular functions which you as a Quickbooks Online operator needs to know how to use, in order to be proficient in using the online software.  </p>  <p>  \t  The learning is structured in a practical way. You are given a practical scenario assignment. There are various tasks to complete. You are given the task to do and have a go at, and then the video answer is available. It is suggested that you:  </p>  <ol style=\"\">  \t<li>Read the task</li>  \t<li>Watch the video</li>  \t<li>Have a go at it yourself on your own system</li>  \t<li>Rewatch the video (if necessary) - to reinforce the learning</li>  </ol>  <p>  \t  You’ll learn how to set up a quickbooks system from scratch, how to enter opening balances, post customer invoices and credit notes, post supplier bills and credit notes, pay suppliers, petty cash, prepare a VAT return, reconcile the bank, post journals, run reports amongst over things.  </p>  <p>  \t  This is a useful course if:  </p>  <ul style=\"\">  \t<li>You are thinking of working with the online software,</li>  \t<li>You are going for jobs which have a requirement for you to be able to use this software</li>  \t<li>You want to put this skill on your CV, or</li>  \t<li>You are a bookkeeper or accountant and will be using this for clients or even</li>  \t<li>You run your own business and want to know how to use Quickbooks for yourself.</li>  </ul>  <p>  \t  You will need to have access to a Quickbooks Online. The instructor is usually online to answer student queries for 2 hours each day.  </p>  <p>  \t  The course materials includes:  </p>  <ol style=\"\">  \t<li><span>the handout of the assignment task</span></li>  </ol>  <ul style=\"\">  \t<li>access to the QuickBooks Online software for FREE for 21 days</li>  \t<li>A 384 page manual on QuickBooks online</li>  </ul>  <p>  \t  Successful completion of the course is the equivalent to being at the level of having a level 2 certificate in computerised accounts. The next step would then be to take our QuickBooks Online Level 3. Note - there is no level 1.  </p>  <p>  \t  The course will take about 3-4 hours to complete.  </p>", 
    "end_date": null, 
    "title": "Quickbooks Online - Level 2 Bookkeeping", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359932_df27.jpg", 
    "course_url": "https://www.udemy.com/quickbooksonline/", 
    "currency": "USD", 
    "subject_name": [
        "Intuit"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T19:36:52Z"
}