{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Discover The Many Benefits of This Popular Accounting Program</strong><br></p><ul><li>Have complete control over the accounting of your business</li><li>Quickly create estimates, statements, and deposits</li><li>Effortlessly keep track of incoming and outgoing payments</li><li>Get all of the tools to become a well-run operation</li><li>Feel confident when reconciling bank statements</li></ul><p><strong>Use This Course to Learn How to Manage Your Accounts Without the Headaches</strong><br><br>No matter what your business does, and regardless of what market it's in, keeping an accurate set of books is essential. You should always want accurate records on hand. Why, you ask? Because inaccurate or disorganized business records can make it very difficult to file your taxes, or worse, get you in trouble with the Internal Revenue Service. Using this easy-to-understand course on QuickBooks, however, will help you avoid any type of common pitfalls or mistakes.<br><br>As you know, QuickBooks is one of the most popular accounting programs available and is used with small businesses pretty much everywhere. You'll essentially be getting a comprehensive crash course on information flow, reporting, systems, accounts, income measurement methods, sales, payroll, banking cycles, and much more. That's why this course was created. To provide in-depth and industry specific information so that you can tailor your accounting system to meet your needs.<br><br>So, if you're a small or medium sized business owner, or even a freelance accountant, you can use QuickBooks Pro 2016 to keep track of everything. From accounts payable, down to your receivables, expenditures, debts, and payments. All of this is packaged to make you feel confident and to help you maintain order as far as your financial situation goes.<br><br><strong>Overview and Contents</strong><br><br>With all of the course's content, this QuickBooks Pro 2016 tutorial will teach you about all of the important requirements and valuable fundamentals behind using this accounting software. <br><br>Once you get set up, you'll quickly find out how you're business is doing. QuickBooks gives you multiple indicators to determine the health of your business and produces reports for you that makes sense of it all. Whether you work as an entrepreneur just trying to finish up some last minute paperwork, or you're a freelance accountant wanting to get more done in less time, QuickBooks handles it all. Its streamlined workflow helps you from beginning to end.<br><br>This course was created for people that see the advantages of QuickBooks and want to learn how to use the latest version. Designed from the ground up for ease of use by both small business owners and professional accountants alike.<br><br>Perfect for those who are looking for a comprehensive and organized method to doing their books. At the completion of this course, you will have advanced knowledge, and skills, and be fully prepared to use QuickBooks Pro 2016 for every single one of your accounting needs.</p>", 
    "end_date": null, 
    "title": "QuickBooks Pro 2016 Training: Manage Small Business Finances", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665698_c1cc.jpg", 
    "course_url": "https://www.udemy.com/quickbooks-pro-2016-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Intuit"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-10T10:11:34Z"
}