{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Give Me 4 Hours and I'll Teach You How to Get Every Receipt, Bill &amp; Invoice in it's Proper Place</strong></p><p>\n\nSo you're a small business owner (or employee) that uses a Mac. </p><p>Perhaps your bookkeeping system consists of a shoebox stuffed full of receipts. Or maybe all your customers' information is lost somewhere between Excel spreadsheets and notebooks. Not to mention your checkbook register serves as your company’s profit and loss statement.</p><p>Does this sound familiar to you? The good news is you’re not alone. Many small business owners never really get their books in order. Then when tax time rolls around their blood pressure launches right off the charts (don't be this guy!!).</p><p>But don't fret.</p><p>Learning how to properly use QuickBooks for Mac (Desktop Version) solves these problems.</p><p>Now lets be honest.</p><p>What most people do when trying to learn QuickBooks is  buy one of those 500+ pages \"QuickBooks for Dummies\" books. And some people go as far as taking a 15 week night class at their local community college.\n</p><p>Unfortunately these methods of learning QuickBooks aren't convenient for most busy entrepreneurs.</p><p>Who has time for that when you’ve got a business to grow?</p><p>I'm sure you could find better use of your time than digesting 500 pages of boring accounting theory.</p><p>Luckily, there is a practical solution:<br></p><p>I created a step by step video training course that will teach you how to use QuickBooks.  And this 4 hour course gets right into the MEAT of what small business owners really need to know.</p><p><strong>Here's what learning QuickBooks did for my own personal company:</strong><br></p><ul><li>I know exactly how much money I make each month (to the penny).</li><li>I know who owes me money and precisely how much they owe me.</li><li>I can push a few buttons and see where I'm making money and where I'm losing money.</li><li>I sleep better at night knowing my books are in order.</li><li>I don't stress out anymore at tax time because I'm totally prepared (well before any deadline).</li></ul><p><strong><br></strong></p><p><strong>Finally, It's Your Turn To Take Control of Your Office</strong></p><p>When you sign up for my QuickBooks for Mac Course you'll have unlimited access to my 8 section course. I start with the very basics of using the software and gradually progress into more advanced features.</p><p>This course is designed for small business owners (or employees), NOT for Accountants. We start from the very beginning as if you're learning it for the first time. I take you by the hand and show you step by step:<br></p><ul><li>How to properly enter all your income &amp; expenses.</li><li>How to identify in 3 seconds who owes you money (and exactly how much).</li><li>How to generate reports that show you how much money you're really making (and where you're making it).</li><li>How to quickly send professional looking invoices to your customers.</li><li>And a heck of a lot more...</li></ul><p><br></p><p>You can try out the course risk free for 30 days to see if it works for you. If for some reason you aren't 100% satisfied, you'll get a prompt and courteous refund.<br></p><p><strong>So It's Time To Make an Important Decision:</strong></p><p>Keep doing what you've been doing over and over again expecting a different result (the definition of INSANITY!!!). Or worse, do nothing at all. </p><p>If you take a new action, you'll get a new result:</p><p><strong>Get control over your financials &amp; sleep easy knowing everything is in its proper place.</strong></p><p>Click the big \"Take This Course\" button at the top of this page and give your business the breakthrough it deserves!</p><p><br></p>", 
    "end_date": null, 
    "title": "QuickBooks for Mac: 4 Hour Non-Accountant Training Course", 
    "price": "50.00", 
    "instructors": "Dylan Spitz", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766024_c804_2.jpg", 
    "course_url": "https://www.udemy.com/quickbooks-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Intuit"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T02:08:30Z"
}