{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Do you need to have a better understanding of your business finances?</strong></p>    <p style=\"\"><strong style=\"\">Do you want to save thousands of dollars in professional fees?</strong></p>    <p style=\"\"><strong style=\"\">Do you want to learn how to analyze reports to plan effective growth?</strong></p>    <p style=\"\">This QuickBooks 2013 Training for Beginners will show you how to unlock the power of Quickbooks 2013 and take direct control of your business finances.</p>    <p style=\"\">Expert author Barbara Harvie teaches you how to setup and manage the accounting for your business using QuickBooks 2013. This video based Quickbooks tutorial removes the barriers to learning by breaking down even the most complex of operations into easy to understand, bite-sized pieces, making it fast and fun for you to learn. This Quickbooks training course is designed for the absolute beginner, and no previous accounting software experience is required.</p>    <p style=\"\">You will start with the basics of using an accounting package - setting up your company file. You will quickly learn how to manage day to day operations by setting up items, services, customers and jobs right in the QuickBooks 2013 interface. You will learn how to create invoices and manage them once the customer has paid. Barbara shows you how to enter and pay bills, track your inventory, and manage all your banking tasks. In this video based tutorial, you will also learn how to create reports, customize reports, and maybe most importantly, how to back up your company file. </p>    <p style=\"\">By the time you have completed the computer based training QuickBooks tutorial course for Beginners course for Intuit QuickBooks 2013, you will have a clear understanding of how to setup and manage your company finances on a day to day basis, as well as access the financial information you need to help you be successful in your endeavour. Working files are included, allowing you to follow along with the author throughout the lessons.</p>    <p style=\"\">Take this ultimate QuickBooks tutorial right now and learn QuickBooks 2013.</p>  ", 
    "end_date": null, 
    "title": "Quickbooks 2013 Training - Bookkeeping Made Easy", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/43884_ba68_8.jpg", 
    "course_url": "https://www.udemy.com/quickbooks-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Intuit"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-27T16:40:00Z"
}