{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"></p><p style=\"\"></p><strong style=\"\"><em style=\"\">Learn how to manage your business&#039;s finances using this popular small business accounting software.</em></strong><br style=\"\"><br style=\"\"><p style=\"\">During this QuickBooks Pro 2012 video training course, learn to use QuickBooks to manage your business&#039;s finances. Your certified QuickBooks Pro Advisor trainer will show how to create accounts to organizing customer, vendor, and item records. Discover how to setup QuickBooks Pro 2012 for the first time, pay employees, create reports, reconcile, work with sales tax, setup inventory, receive payments, and much more.<br style=\"\">  </p>    <p style=\"\">This course is designed to be an introduction to the features offered by QuickBooks Pro 2012. This is not an accounting course. Each business and home financial situation is unique, with different procedures required in response to various rules, laws and policies. Please consult your accountant, employer, QuickBooks ProAdvisor or other appropriate expert with regard to specific requirements or guidelines.</p>    <p style=\"\">All of our videos are high-definition videos, therefore, they are&nbsp;<strong style=\"\">best viewed with the HD setting on</strong>, and the videos enlarged.<br style=\"\">  </p>    body p {  \tfont-size: 24px;  }    ", 
    "end_date": null, 
    "title": "QuickBooks Pro 2012 Training the Easy Way", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23412_2165_3.jpg", 
    "course_url": "https://www.udemy.com/quickbooks-pro-2012-training/", 
    "currency": "USD", 
    "subject_name": [
        "Intuit"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-22T14:27:10Z"
}