{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course, athletes learn how to build a better professional brand on social media. It was created for athletes interested in taking greater control of their own career development. You benefit from learning specific social media strategies to apply at home and on the road. In this course, you will do the following:</p><ul><li>Review current social media policy examples from NFL, NBA, and MLB</li><li>Learn a professional athlete social media checklist to apply to all posts</li><li>Analyze social media posts made by professional athletes</li><li>Build a larger fan base through social media posts</li><li>Apply strategies to ensure professional posts on social media</li></ul><p>Social media is a big part of an athlete's career. However, many athletes are just told by their team, “Be careful what you put out there. We're watching you!\" The problem is that athletes are not told how to post items that are professional in appearance. This course is unique because it specifically teaches athletes how to use social media to professionally brand themselves while promoting their careers. Your team does not promote 100% of the athletes on the roster. So that means you need to promote yourself. <strong>In this course you will learn how to take better control of building and maintaining a professional brand on social media as an athlete. </strong>The course includes narrated presentations, exercises, quizzes, and a certificate of completion to share on your social media sites! This course will take you about 1 hour to complete, and it is structured so you can take it all at the same time, or spread it out.</p>", 
    "end_date": null, 
    "title": "Athlete's Guide to Building a Brand on Social Media 2016", 
    "price": "20.00", 
    "instructors": "ProgressiveProAthlete LLC", 
    "commitment": "26 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508514_ed64_7.jpg", 
    "course_url": "https://www.udemy.com/athletes-guide-to-building-a-brand-on-social-media-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T23:24:14Z"
}