{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you want to create a strong personal brand so that you can get ahead in your business or career? Have you ever wondered why some people in life take off while others are left in the dust? Do you want to catch your audience's attention so that you can achieve the kind of success you want?</p><p><strong>What this course is about:</strong></p><p><em>Personal Brand Building </em>is a course that is aimed at helping you understand the principles of marketing yourself to clients, employers, investors, and other big relationships in your life. These ideas are applied to people all around the world, and every successful person has a strong personal brand.</p><p><strong>What you will learn in this course:</strong></p><p>This course will guide you through both theory and provide actionable steps to start creating your personal brand today. You can expect to gain the attention of thousands of people after you apply the principles used in this course. The lectures include:</p><ul><li>Introduction to Personal Brand Building</li><li>Exactly what Personal Branding is</li><li>Steps to understanding your Personal Brand story</li><li>Steps to understanding your ideal target audience</li><li>Building and Designing your Personal Brand</li><li>Promoting your Personal Brand</li><li>and Live Case Studies of Successful Personal Brands</li><li>Plus free updates and additions to the course in the future!</li></ul><p><strong>What you don't want to do:</strong></p><p>Wait too long to enroll! This course is going to have evergreen updates added in the future, and the price will raise once the course meets certain milestones. The best thing to do is to enroll now so that you can lock in the price and receive all future updates for free. If you are still uncertain, you can always<em> receive a full refund within 30 days of purchase through Udemy</em>!</p><p>Jeremy Deighan</p><p><em>p.s. I am here for my students and I always welcome any feedback, questions, discussions, or reviews on my courses. Please visit my profile to see how you can contact me in the most convenient way for you!</em></p>", 
    "end_date": null, 
    "title": "Branding : Personal Brand Building", 
    "price": "30.00", 
    "instructors": "Jeremy Deighan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/549728_2935.jpg", 
    "course_url": "https://www.udemy.com/personal-brand-building/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-09T04:00:39Z"
}