{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Whether you’re an author, an entrepreneur, a business owner, or a public figure, if you want to connect with a large audience, generate sales, or convert people to your cause, you need both a brand and a platform. Do you know what they are, and how to develop them?</p><p>If you're struggling to be noticed in your field, or having a hard time figuring out how to reach your audience, deliver your sales pitch, and maintain your brand integrity, this course is for you.</p><p><strong>Build a Brand That Resonates with Your Core Values, and a Platform That Reaches Your Ideal Customers</strong></p><ul><li>Learn the difference between branding and platform building, and know why you need both to be seen, heard, and understood.</li><li>Discover the true nature of branding, why no one’s talking about this, and how knowing it will transform your thinking.</li><li>Do the work to uncover your existing brand, from your customer's perspective.</li><li>Create an action plan to evolve your brand.</li><li>Design a strategic platform to connect with your ideal customers</li><li>Recognise which kinds of content to create, and know how to share them for maximum impact.</li><li>Brand your platform with integrity and unleash your awesome new brand.</li></ul><p><strong><br></strong></p><p><strong>Go beyond packaging and image manipulation to master what's at the heart of personal branding and platform building</strong></p><p>When I mention branding, do you think about companies and logos? Maybe websites, slogans, and specific colours? Does personal branding to you mean social media profiles? It's time to think again, because branding is so much more. </p><p>Are you confused by the concept of building a platform? Maybe you think it's just the technical term for connecting all your digital assets. Or a way to measure your reach? </p><p>If you want to get to grips with today's connected world, learn how to present your authentic self, and really connect with your ideal customers, you need to take this course today.</p><p><strong>Why 'It's Not About You.'</strong></p><p>Together, we're going to go on a journey through the maze of personal branding and platform building, to uncover your best strategy for standing out in a crowded space. </p><p>We'll start by considering the concepts of branding and platform building, how they differ, and why you need both. We'll also learn what's at the heart of true branding, and why ignoring this means everything else you do is wasted effort.</p><p>Then we'll dive deeper into branding. You'll discover your existing brand image, from your customer's point of view, and consider how that aligns with your core values, before working on your personal action plan to evolve your brand.</p><p>Once you've defined your brand, you'll look at your platform. You'll identify what's working, and what can be improved. You'll also evaluate the best channels for you to spend time in, and the types of content you should create to connect with your audience. Armed with this knowledge, you'll build a strategic platform, designed to gain maximum reach and impact.</p><p>Finally, you'll learn how to monitor your brand's success, nip developing problems in the bud, and attract your ideal clients to you, rather than you chasing them. Then, you'll be ready to unleash your own personal brand of awesome on the world.</p>", 
    "end_date": null, 
    "title": "Branding and Platform Building: It Is Not about You", 
    "price": "20.00", 
    "instructors": "Gail Seymour", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320832_f8c5_4.jpg", 
    "course_url": "https://www.udemy.com/branding-and-platform-building-its-not-about-you/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-16T11:46:30Z"
}