{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"></p><p style=\"\"></p><p style=\"\">Personal branding is about expressing your authentic self. Building a personal brand  allows you to show the world your best true self. It helps you to align every  aspect of your life with your strengths, characteristics, goals, and values.  Personal branding isn‘t just some self-help mumbo jumbo; it&#039;s a strategic  process that makes you an active partner in creating the direction for your  life. Through personal branding, you find out how to bring more value to your  work and to the target market that you serve. You discover how to identify and  communicate your unique contribution to the world. Your personal brand acts as  a filter that helps you make decisions that are congruent with who you are and  what you stand for. Well then how do you get your personal banding done? lf  you‘re serious about developing your brand, this course provides a clear  roadmap. By following this roadmap, you could create a meaningful, lasting  impression on everyone you meet. That impression can translate into success on  the job, in a new business, and in every aspect of your life.</p><p style=\"\">    </p><p style=\"\">Take this Build  Compelling Personal Brand course now and learn how to leverage your  personal brand by using online  branding technologies.</p><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Build Your Compelling Personal Brand", 
    "price": "50.00", 
    "instructors": "Anand M", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22928_28dc_4.jpg", 
    "course_url": "https://www.udemy.com/build-your-compelling-personal-brand/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-15T09:39:14Z"
}