{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t      Learn the secrets that enable me to get over a thousand visitors everyday to my website.  </p>  <p style=\"\">  \t    And learn how to market your business and website with a <strong style=\"\">blog, onsite optimization, social media and relationships</strong>.  </p>  <p style=\"\">  \t      A website is essential – not only to every business – but to every<em style=\"\">one</em> in today’s economy.  </p>  <p style=\"\">  \t      In order to create a successful web presence it&#039;s becoming increasingly important to &quot;<em style=\"\">be everywhere</em>&quot;. I can explain how to achieve this efficiently and <strong style=\"\">without wasting time</strong>.  </p>  <p style=\"\">  \t      My name&#039;s Rob Cubbon I&#039;ve been running an online business for over 7 years.  </p>  <p style=\"\">  \t      I will explain:  </p>  <ul style=\"\">  \t<li style=\"\">Blogging</li>  \t<li style=\"\">Website optimisation for the search engines</li>  \t<li style=\"\">How to be active on social networks without spending too much time on them</li>  \t<li style=\"\">And, lastly, but by no means least, how to foster meaningful relationships with people in your niche – an often overlooked web marketing essential</li>  </ul>  <p style=\"\">  \t      This course will show you exactly how to do this with <strong style=\"\">easy step-by-step instructions</strong>.  </p>  <p style=\"\">  \t      I&#039;m going to show you how to make the most of your WordPress blog. So there will be practical examples of:  </p>  <ul style=\"\">  \t<li style=\"\">how to set up and use Google Analytics</li>  \t<li style=\"\">how to create an XML Sitemap and register it with Google Webmaster Tools</li>  \t<li style=\"\">how to get on to <strong style=\"\">Google maps</strong></li>  \t<li style=\"\">how to add social media share buttons</li>  \t<li style=\"\">how to make sure your WordPress website works <strong style=\"\">quickly</strong> which is a really important SEO concern</li>  \t<li style=\"\">the theory behind blogging and <strong style=\"\">how to make sure it&#039;s constantly updated with great articles</strong> that are relevant to your niche</li>  \t<li style=\"\">how to <strong style=\"\">optimise</strong> your website for Google and the other search engines</li>  \t<li style=\"\">how to do proper <strong style=\"\">keyword research</strong> for your website so you target search terms that will be easy and profitable to rank for</li>  \t<li style=\"\">how to create individual blog posts that Google and your visitors will like and that ensures the maximum traffic possible.</li>  </ul>  <p style=\"\">  \t      Social media can be a huge drain on your time and resources. I can show you how to set up and use the most important social media outlets effectively and efficiently: I will show you how :  </p>  <ul style=\"\">  \t<li style=\"\">to set up and use <strong style=\"\">Twitter</strong></li>  \t<li style=\"\">all about <strong style=\"\">Facebook</strong> Marketing</li>  \t<li style=\"\">how to use <strong style=\"\">LinkedIn</strong> and <strong style=\"\">YouTube</strong></li>  \t<li style=\"\">and, how to maintain brand consistency and regular posting throughout all these channels with the <strong style=\"\">minimum of effort</strong>.</li>  </ul>  <p style=\"\">  \t      Finally I&#039;ll show you how to set up and maintain professional relationships with thought leaders and others in your niche which will make you <strong style=\"\">an authority</strong> as well as supplying you with much needed links to your site.  </p>  <p style=\"\">  \t      Marketing your business on the web today needn&#039;t be as confusing as it sometimes seems. I can show you how to do it properly and <strong style=\"\">how to enjoy it</strong>.  </p>  <p style=\"\">  \t      Communicating with your audience has never been more fun :)  </p>", 
    "end_date": null, 
    "title": "Build Your Brand: Blogging, SEO, SocialMedia & Relationships", 
    "price": "30.00", 
    "instructors": "Rob Cubbon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48831_3f39_11.jpg", 
    "course_url": "https://www.udemy.com/blogging-seo-social-relationships-total-web-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-07T18:15:34Z"
}