{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul style=\"\"><li style=\"\"><strong style=\"\">This course was updated in April 2015. </strong></li><strong style=\"\"></strong><li style=\"\"><strong style=\"\">Over 19 lectures and 2 hours of content!</strong></li><li style=\"\"><strong style=\"\"><strong style=\"\">Instructor available daily for questions</strong></strong></li></ul><p style=\"\"><strong style=\"\"></strong>--------------------------------------------------------------------------------------------------------------</p><p style=\"\"><strong style=\"\"><em style=\"\">Lots of in-depth coverage </em></strong><em style=\"\"></em></p><p style=\"\"><em style=\"\">Even if you already have online experience there are tidbits and information to be learned. - Patti Arbon</em></p><p style=\"\">---------------------------------------------------------------------------------------------------------------</p><p style=\"\">Promoting your business on the Internet is like driving that car. You don&#039;t need to know all about the engine before you can go anywhere. If that were the case, the auto manufacturers would be bankrupt.  \t  \tFor some reason, most of us are intimidated by Internet tools. We need an expert. And we spend a lot of money on those experts, but do we really need to?  \t  \tHave you hired someone to design your website, but now you can&#039;t make changes without contacting your webmaster for every little change?</p><p style=\"\">Or do you have a blog, but it&#039;s taking up all your time, or no one can find it on the Internet, or if they do, you aren&#039;t sure how to keep in touch with them so they&#039;ll visit again and remember you?  \t  \tYet you know that it can&#039;t possibly be as hard as it seems. You know people just like you who are using the Internet to attract clients and customers, are sharing their expertise and are growing their businesses. And they still have time to live!  \t  \tYou can be one of those successful marketers, using the Internet to reach the people who want and need what you have to offer.</p><p style=\"\"><strong style=\"\">I cover the features and best practices you need to know about building an online presence and leave out the non-essentials. </strong>Then we go on to using email marketing tools like Aweber to build a relationship with your audience!  \t  \tIn these recorded half hour video sessions, we&#039;ll take a look at the foundational pieces and the time-saving tools to build your home on the Internet. </p><p style=\"\">Each session was originally a live webinar and includes questions from other people just like you - busy people who want to use the technology without having to spend hours figuring it all out. Once the webinars ended, they were turned into videos that you can watch and listen to whenever you like.  </p>", 
    "end_date": null, 
    "title": "Build Your Online Presence", 
    "price": "20.00", 
    "instructors": "Carol Bremner", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47738_7abf_3.jpg", 
    "course_url": "https://www.udemy.com/build-your-online-presence/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-28T18:24:07Z"
}