{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t NOTE:  Please only purchase this course if you have completed <a href=\"https://www.udemy.com/personal-leadership-brand-in-10-easy-steps/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Build Your Personal Brand In 8 Easy Steps - Module 1</a> .  This course follows on from <a href=\"https://www.udemy.com/personal-leadership-brand-in-10-easy-steps/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Module 1 </a> and is designed for you if you are in a Leadership role.  </p>  <p style=\"\">  \t In Module 1 you will have learned and experienced:  </p>  <ol style=\"\">  \t<li style=\"\">The foundations to building your Personal Brand</li>  \t<li style=\"\">Understanding the anatomy of your Personal Brand</li>  \t<li style=\"\">What people say about you when you are not there?</li>  \t<li style=\"\">Getting to grips with your Stakeholders and causing the effects you desire</li>  \t<li style=\"\">How to specialise and differentiate yourself</li>  \t<li style=\"\">How you are actually perceived by others</li>  \t<li style=\"\">How to manage change and transformation</li>  \t<li style=\"\">Creating powerful first impressions and managing your touch-points</li>  </ol>  <p style=\"\">  \t Module 2 - Leadership Brand  </p>  <p style=\"\">  \t Here in Module 2 we build on what you have learned and explore developing your Leadership Brand for greater success.  We have also included Module 3 on building Team Brand and Module 4 in building a powerful Corporate Leadership Brand for your organisation.  </p>  <p style=\"\">  \t Are you ready to raise your visibility, to have the impact you need as a leader and to have a powerful presence in business?  If so, it&#039;s time to build your Leadership Brand.  </p>  <p style=\"\">  \t This is for you if you are a leader at any level, are managing a team or if you are an entrepreneur or business owner.  </p>  <p style=\"\">  \t The incredible benefits in building your Leadership Brand are:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"><strong style=\"\">You instantly raise your credibility with all of your stakeholders.   You become conscious of delivering value consistently through your actions  and behaviours.  And this allows others to trust you, what you do and to follow you as a leader.   And trust is so very important. </strong></strong></li>  </ul>  <ul style=\"\">  \t<li style=\"\">You get to understand the nuances of leadership, where you naturally lead from and <em style=\"\">why</em> others follow you.  This is all about self-mastery - knowing yourself better as a leader and making conscious and constructive choices going forward.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">You discover the benefits of Ouside-In vs Inside Out leadership - when you know yourself incredibly well, you can start to focus on delivering value to others in a powerful way, building your reputation and demand.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">You will really get the benefits of keeping curiosity as a powerful context.  This gives you the opportunity to gain perspective from a neutral position in any situation and to make more informed choices.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">You will explore the power of building diverse teams for greater success and how to co-create dynamic team values - the glue that binds teams together and delivers elevated results.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">You will get to explore how your team impacts on all stakeholders; the value in creating a powerful culture and you will discover how your team is perceived or their reputation.  Vital if you are going to make headway as a leader.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">You will gain insight into how happy your team are and the impact this has on productivity, engagement and your bottom line.  </li>  </ul>  <ul style=\"\">  \t<li style=\"\">You will also have the opportunity to explore how all of this fits into the bigger picture of building a Corporate Leadership Brand - the magic trilogy, which brings together your brand promise, your client experience and your people&#039;s actions and behaviours.  Once you get this, you are on your way to building a powerful model for yourself as a leader, your people and your organisation.</li>  </ul>  <p style=\"\">  \t Titled The Wild Card, this course was originally commissioned by Durham Business School in the UK and is delivered by Louise Mowbray, the International Speaker, Coach and Facilitator and Founder of <a href=\"http://www.mowbraybydesign.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Mowbray by Design</a>.  </p>  <p style=\"\">  \t This course delivers 6 lectures of around seven minutes each.  Take this course in your own time and at your own pace - watch a video lecture and then explore the suggested media (TED talks, articles, books) and do the practical exercises to help you to embed what you have learned before you move onto the next.  </p>", 
    "end_date": null, 
    "title": "Build Your Leadership Brand For Success - Module 2", 
    "price": "50.00", 
    "instructors": "Louise Mowbray", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/74474_5807_6.jpg", 
    "course_url": "https://www.udemy.com/leadership-brand-module-2/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-06T12:49:30Z"
}