{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  We all have a personal brand – whether we are managing it or not.  Your personal brand is all about how other people perceive you, which results in your reputation.  And this has a direct and measurable effect on your ability to be successful.  </p>  <p style=\"\">  \t  Are you ready to elevate your presence, make the right impact and to feel in control of where you are going? Building your brand will give you the insight and tools to do just this.  </p>  <p style=\"\">  \t<strong style=\"\">The amazing benefits of building your brand are:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">You get to be authentic – no more pretending to be something you’re not.  It’s all about being the best you can possibly be in any given situation.  You give yourself the permission to be true to yourself.  What a relief!</li>  </ul>  <ul style=\"\">  \t<li style=\"\">You really understand what motivates you, your true purpose and what drives you.  And playing into all of this from a place of passion is a wonderfully energetic place to be.  Building your brand is all about self-awareness and self-mastery.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">You start to play into your strengths and to your own values.  And this makes decisions about your career so much easier.  Once you are fully aware of what suits you, you will make better, smarter choices for yourself. </li>  </ul>  <ul style=\"\">  \t<li style=\"\">Your self-confidence sours.  When you know you have something of real value to deliver and what is really compelling about you, your self-esteem steps up and gets a brilliant, permanent boost.  You also discover what you need to work on so you can take control of the impact you are having.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">You instantly raise your credibility with your target markets, audience and all of your stakeholders.  You become conscious of delivering consistently through your actions and behaviours.  And this allows others to trust you and what you do.  And trust is so very important. </li>  </ul>  <ul style=\"\">  \t<li style=\"\">You learn to showcase your specialisation and to differentiate yourself.  No one trusts a generalist – we can’t be all things to all people!  So you build your career on your unique talents and experiences.  And people start to seek you out for what you do best.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">You begin to naturally identify and focus your energy on those who count today and going forward.  Understanding your stakeholders’ needs puts you in the driving seat and you make smart decisions about what you deliver to whom.  </li>  </ul>  <ul style=\"\">  \t<li style=\"\">You master the art of delivering real value to others across a number of platforms – in person, online and offline.  Personal brand is not just about an online presence; there are many smart ways to appeal to your target markets in an appropriate way. </li>  </ul>  <p style=\"\">  \t  This is for you if you are looking to step up to your next career challenge, are going through career change, are stakeholder facing, in a leadership role, a business owner or entrepreneur or simply want to get (re)connected to your purpose and passion in business.  </p>  <p style=\"\">  \t  Titled The Wild Card, this video based course is designed to walk you through a practical step-by-step process in developing your Personal Brand.  The Wild Card was originally commissioned by Durham Business School in the UK and is delivered by Louise Mowbray, the International Speaker, Coach and Facilitator and Founder of <a href=\"http://www.mowbraybydesign.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Mowbray by Design</a> .  </p>  <p style=\"\">  \t  This course delivers 8 lectures of around ten minutes each.  Take this course in your own time and at your own pace - watch a video lecture and then explore the suggested media (TED talks, articles, books) and do the practical exercises to help you to embed what you have learned before you move onto the next.  </p>  <p style=\"\">  \t  Once you have completed this course, and if you are in a leadership role or managing a team or organisation, move onto the second course in this series – <a href=\"https://www.udemy.com/leadership-brand-module-2/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Build Your Leadership Brand For Success – Module 2</a> where Louise covers Leadership Brand, Team Brand and Corporate Leadership Brand.  </p>", 
    "end_date": null, 
    "title": "Build Your Personal Brand In 8 Easy Steps - Module 1", 
    "price": "50.00", 
    "instructors": "Louise Mowbray", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61253_0a1c_15.jpg", 
    "course_url": "https://www.udemy.com/personal-leadership-brand-in-10-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-21T04:58:20Z"
}