{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Welcome to Discover you build your website , where I’ll take you through the entire process of creating your own website, from scratch.  My name is Daniel Lombard and I’m a business analyst and have worked in software development for the last 10 years.  </p>\n\n<p>I'll help you build your website is an introduction course to create a website or blog with no previous website building experience. I am a person just like you, wanting to learn to build a website for a blog of mine. I have been trolling through hours and hours of youtube videos. I created this course so you don’t need to troll through all those videos and help you overcome the mistakes that I made. </p>\n\n\n\n<p>Because our aim is to get you to build a quality blog with no coding knowledge necessary I will go take you through the different aspects of a website, from choosing a website name, installing your website, understanding how to navigate through the backend of your website all the way to pages and posts. Towards the end of the course, I will also show you how to customize your website so you know how you can make the website individual to you. </p>\n\n\n\n<p>This course is designed for a person with a passion for building their own website, however, have little or no knowledge of building a website. If you are a beginner with lite computer knowledge, computer with the internet then this course is for you. This course is not for you if you have knowledge and experience of building websites. </p>\n\n\n\n<p>Thanks for your interest in I'll help you build your website, I hope you’re as excited as I am!  If you’re ready to learn more and sign up for the course, go ahead and hit that Enroll button, or take a test drive by using the Free Preview feature.  See you in the course.</p>", 
    "end_date": null, 
    "title": "Discover how to build your first website!", 
    "price": 0, 
    "instructors": "Daniel Lombard", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/734084_ee83_3.jpg", 
    "course_url": "https://www.udemy.com/ill-help-you-build-your-first-website/", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T13:20:01Z"
}