{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h4>  <p>  \t <strong>Want hot-prospects BEGGING to work with you instead of having to chase them down?</strong>  </p>  <p>  \t <strong></strong>  </p>  <p>  \t <strong>Ready to STAND OUT as the leading authority and attract limitless biz growth opportunities?</strong>  </p>  <p>  \t <strong></strong>  </p>  <p>  \t <strong>Want to make more MONEY$$ and have more FUN while running your biz and serving your clients?</strong>  </p>  </h4>  <h4><br>    YES? YES? and YES? </h4>  <h4>AWESOME.</h4>  <h4>  <p>  \t <strong>I have some exciting news for you! </strong> <br>  \t<br>  \t  It used to be that just having a fancy logo and a matching website made you an instant leader in your industry.  It didn’t matter if you showed up looking like you had just come from a tractor pull, because you had a logo and a website giving you all the credibility you needed.  <br>  \t<br>  \t  Those wild wild west days are over. <br>  \t<br>  \t  If you are in business for yourself, you probably already know that. <br>  \t<br>  \t  But, what you may not know... if you aren't attracting the clients that your business needs to grow, or getting the visibility that you need, to be seen as <em><u>the</u></em> leader in your industry, THEN my friend, you have two choices...<br>  \t<br>  \t  Your first choice is to pack up your shit and get a job.<br>  \t<br>  \t  Good luck. Good-bye.<br>  \t<br>  \t  Your second choice is to <strong>OWN</strong> your authentic personal brand, so you can attract more clients, stand out in your marketplace, grow your biz, be seen as the expert…(you see where I’m going, right?)  </p>  </h4>  <h4>I’m Here To Help You Do Exactly That!  </h4>  <h4>  <p>  \t <br>  \t  Here’s why building your personal brand is so important today... We are now in the era of <strong>Human Business</strong>.<br>  \t<br>  \t  Being in business <em>now</em> means that your personal brand and business go hand-in-hand. Sort of like two best friends skipping down the street of prosperity. <br>  \t<br>  \t  If you are in business for yourself, you can no longer hide behind a logo and website. It just won’t work anymore... not profitably anyway. <br>  \t<br>  \t<strong><u>You</u></strong> need to be the living, breathing, and walking representation of your brand. <br>  \t<br>  \t  It’s a huge deal and an even bigger responsibility.  </p>  </h4>  <h4>So, What’s Your Game Plan?  </h4>  <h4>  <p>  \t What is it that you are going to do differently that attracts all of the clients and business opportunities that you need to grow your business and blow past your revenue goals?<br>  \t<br>  \t  In the 2012 State of Women-Owned Business Report, conducted by American Express, there are now 8.3 million women-owned businesses just in the United States. And get this, just 1.8% of these businesses generate more than $1 million in annual revenues.<br>  \t<br>  \t  My bet would be that Oprah, Sarah Blakely, and Barbara Corcoran are in that 1.8%.  Here’s the kicker - there’s nothing fabulously special about these ladies and their capabilities in creating 7-figure businesses... (no offense, I love you all!)  </p>  </h4>  <h4>It’s their personal brand that takes them over the edge!</h4>  <h4>  <p>  \t <strong></strong>  </p>  </h4>  <h4></h4>", 
    "end_date": null, 
    "title": "Effective Branding for Beginners: Boost Your Business", 
    "price": "20.00", 
    "instructors": "Nicole K. Lundy", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/135938_7746_9.jpg", 
    "course_url": "https://www.udemy.com/effective-branding-for-beginners-boost-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-20T05:01:32Z"
}