{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><p>If  you’re wondering <strong style=\"\">how to get a job  interview</strong> , here are some facts -every employer checks the online presence  of a candidate before offering a job interview. If you don&#039;t have a strong  online and social media presence, you may be losing interview opportunities to  others. Your social media profiles represent your personal brand- and whether  or not employers will see that brand favorably.</p>  <p>While most job seekers are already on LinkedIn, Facebook, Twitter, and  Google+, very few are utilizing social media properly. In this course, the  experts at SocialMediaSeeds you will teach you <strong style=\"\">how to  get a job interview and</strong>secure the job of your dreams, with less effort and more  fun.</p>  <p>We&#039;ve included:</p>    <p>●&nbsp; 9 Video lectures</p>    <p>●&nbsp; The best practices  and <strong style=\"\">personal branding tips</strong>for optimizing your  social media profiles</p>    <p>●&nbsp; How to do keyword  research to affect your presence in searches</p>    <p>●&nbsp; Strategies for  reaching out to companies</p>    <p>●&nbsp; 5 Bonuses including  interviews with the CEO of a career advisory firm, a consultant, a journalist,  and even Ms. Corporate America</p>&lt;/p&gt;<ul style=\"\">  </ul>  ", 
    "end_date": null, 
    "title": "Get Job Interviews using Social Media (Self-Branding Studio)", 
    "price": "20.00", 
    "instructors": "Ruwan Meepagala, Trenton Miller", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/16921_d5c8_5.jpg", 
    "course_url": "https://www.udemy.com/get-job-interviews-using-social-media/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-04-26T15:32:45Z"
}