{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\" text-align:justify;\" class=\"MsoNormal\">  \t <strong style=\"\">¿Quieres mejorar tu imagen profesional de inmediato y fácil? Pues estás en el lugar correcto, IQGV te ofrece el Programa Online <span style=\" color:rgb(192, 0, 0);\">‘<em style=\"\">Imagen para el éxito</em>: <em style=\"\">guía para el hombre’</em>. Look sin límite y los mejores consejos para el ejecutivo global. </span></strong>  </p>  <p style=\" text-align:justify;\" class=\"MsoNormal\">  \t <strong style=\"\"><span style=\" color:rgb(192, 0, 0);\">¿Qué aprenderás en este programa Online?</span></strong>  </p>  <p style=\" text-align:justify;\" class=\"MsoNormal\">  \t   Conocerás los principios básicos de la imagen y su impacto en los negocios, sabrás por qué la ropa influye en la percepción que las personas se forman de nosotros, y lo más importante, conocerás las reglas para vestir en un mundo global.  </p>  <p style=\" text-align:justify;\" class=\"MsoNormal\">  \t   Aprenderás el significado del color en el vestuario y el mensaje que transmiten los colores en el ámbito profesional, a identificar la calidad de un traje, la tela, las combinaciones, los patrones, los cortes y estilos, la diferencia entre un blazer, un saco casual y el saco del traje y <em style=\"\">tips</em> para causar una buena impresión en la entrevista de trabajo.  </p>  <p style=\" text-align:justify;\" class=\"MsoNormal\">  \t   Haremos una revisión de la camisa desde el ajuste hasta la jerarquía de elegancia según el color y el patrón; la corbata y criterios para la elección del nudo, los accesorios masculinos y los tipos de lentes y cortes de pelo que van mejor con tu forma de cara.  </p>  <p style=\" text-align:justify;\" class=\"MsoNormal\">  \t   Un tema especialmente relevante es que sabrás identificar las diferencias entre un atuendo formal y uno casual, pues existen serias confusiones en razón de que la mayoría de las empresas no cuentan con un código de vestimenta.  </p>  <p style=\" text-align:justify;\" class=\"MsoNormal\">  \t   Dado que un caballero debe conocer las particularidades de un atuendo de etiqueta aprenderás a reconocer los diferentes trajes de etiqueta, en qué ocasiones usarlos y las normas para portarlos, y como toque final te proponemos hacer un <em style=\"\">check list</em> de los pies a la cabeza y, si todo está correcto, entonces estarás listo para salir al escenario <strong style=\"\"><span style=\" color:rgb(192, 0, 0);\">¡el mundo te espera!</span></strong>   \t<!--EndFragment-->  </p>", 
    "end_date": null, 
    "title": "Imagen para el éxito: guía para el hombre", 
    "price": "35.00", 
    "instructors": "Rocío  Campuzano", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/105296_18ac_12.jpg", 
    "course_url": "https://www.udemy.com/imagen-para-el-exito-guia-para-el-hombre/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-13T13:41:47Z"
}