{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong><strong></strong>Dec 28th Update: Almost 1000 students now! Thank you!</strong>  </p>  <p>  \t<strong>Jan 22nd Update: Many people have been asking me for the link to my personal website. I should've included it earlier! Here's the link: sunnytrochaniak[dot]com<br>  \t</strong>  </p>  <p>  \t              Creating your own website is one of the most powerful things you can do for yourself and your personal brand. According to the Huffington Post, over 80% of employers Google search applicants before inviting them to an interview, and almost 50% of them have said they changed their mind based on what they found online. This is only trending upwards; this is just the beginning.  </p>  <p>  \t                                    Most people scramble to simply change their Facebook name and remove their drunken photos, and while and this may be an effective hiding strategy, you need to ask yourself this question: you are competing for a position with tens, hundreds, or even thousands of other people. Do you really want to be hiding? <strong>T</strong><strong>his is your opportunity to stand out from the crowd.</strong>  </p>  <p>  \t                                    When it comes down to it, having a personal website is great at 3 things:  </p>  <ul>  \t<li><strong>Landing your dream job.</strong> When employers Google your name, a stunning personal website can be the icing on the cake. A resume simply demonstrates that you're qualified; a personal brand website tells your story, showcases your personality, and demonstrates why you'd be a great fit at that company.</li>  \t<li><strong>Creating new opportunities.</strong> You never know who might stumble across your site. Having a personal website can open doors you never knew existed. You have no idea the number of times I've been contacted by a complete stranger, because they read about something on my website. You'll be able to start evaluating and actually choosing which career path you want to take.</li>  \t<li><strong>Establishing yourself as an expert in your field.</strong> Sharing your thoughts and experiences gives you an opportunity to showcase your knowledge. By      demonstrating your expertise, you begin to build credibility, not just      through your words but by your actions. Both people and companies will      start coming to you for your expert opinion.</li>  </ul>  <p>  \t                                    The other great thing about having a website is that it's online 24/7. Take a little bit of time to set up your site right now, and you will reap the rewards it provides. <strong>Your website will be at work for you even while you sleep.</strong>  </p>  <p>  \t<em>\"Sunny, this sounds great and all, but I don't think it's going to work for me, I've never created a website before!\"</em>  </p>  <p>  \t                              Perfect, that's exactly the reason I created this course. The lessons are so simple that a baby could understand.  </p>  <p>  \t<strong>Not only that, I'll show you how you can make one in just a couple of sittings.</strong>  </p>  <p>  \t                  What are you waiting for, let's start building your personal brand powerhouse right now! It's time to make a name for yourself.  </p>  <p>  \t            *You have my personal promise that you will get every penny's worth out of this class. If you put in the effort, your career will change for the better. If not, you have 30 days to get a full refund. No questions asked :)  </p>  <p>  \t                        ---  </p>  <p>  \t<strong>Details</strong>  </p>  <ul>  \t<li>We'll be making it on Wordpress (completely free, easy to edit, and has some awesome plugins)</li>  \t<li>In this class, I'll be using a premium Wordpress theme ($55). You can definitely use a free theme, although using a premium theme will put your site on the next level, and is definitely worth it in my opinion. I'll show you some great options of course.</li>  \t<li>You'll also need hosting ($5-10/month). To make it easy for you, I've set one up specifically for students of this course. I'll walk you through setting it up.</li>  \t<li>Your own domain. This is $10/year just about everywhere.</li>  </ul>", 
    "end_date": null, 
    "title": "Learn How to Create the Ultimate Personal Website", 
    "price": "20.00", 
    "instructors": "Sunny Trochaniak", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304974_59dc_3.jpg", 
    "course_url": "https://www.udemy.com/create-personal-brand-website/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-21T20:25:10Z"
}