{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Learning to fly - How to Brand Yourself: Personal Branding Strategy #Confidence</strong>  </p>  <p style=\"\">  \t  Personal branding is the process by which we market  ourselves to others. As a brand, we can leverage the same strategies that make  celebrities or corporate brands appeal to others. We can build brand equity  just like them.  Just like businesses  need to find their niche market so do you.  </p>  <p style=\"\">  \t  This short personal branding  strategy module focuses on one of those steps - creating a  more confident you.  When you have more  confidence, your brand will shine through.  </p>  <p style=\"\">  \t  Understanding your Personal Brand and you will  understand the direction of your business or career and enable you to create a  unique position for you and your business/ career.  It will help you to focus on how to how to brand in your  network.  </p>  <p style=\"\">  \t  Confidence. One word. That’s it. If you can learn to  nurture your inner confidence, you will accomplish far more than any logo,  slogan, website, dress, tie, shoes or car. Being confident about who you are  and what value you bring is a brilliant personal branding strategy.  </p>  <p style=\"\">  \t  It may not be easy to recover from a confidence blow,  but you can do it and if you want your brand to rock, now is the time to put  the past behind you and recreate BRAND YOU.  </p>  <p style=\"\">  \t  Take this short personal branding strategy course now and learn how create a more confident personal brand.  </p>", 
    "end_date": null, 
    "title": "Learning to fly - confident steps to personal branding", 
    "price": "20.00", 
    "instructors": "Jacqui Malpass", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/39181_5b19_9.jpg", 
    "course_url": "https://www.udemy.com/learning-to-fly-confident-steps-to-personal-branding/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-31T08:11:48Z"
}