{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><strong class=\"redactor-inline-converted\">13,000+ Students </strong>have enrolled in my <strong class=\"redactor-inline-converted\">13 Courses!</strong></li><li>The <strong class=\"redactor-inline-converted\">4.75 Rating</strong><strong class=\"redactor-inline-converted\"> from student reviews </strong>shows the value packed in this course!</li><li><strong>Course updated for 2016 with over 2.5 hours of video!</strong></li></ul>\n\n\n\n<p>Have you considered the fact that LinkedIn is <strong class=\"redactor-inline-converted\">more</strong> than just an online Resume?<br></p>\n\n\n\n\n\n\n\n<p>  \t                                      Do you want to pursue the <strong class=\"redactor-inline-converted\">opportunities LinkedIn offers</strong> and <strong class=\"redactor-inline-converted\">get the job you wanted</strong>, obtain a <strong class=\"redactor-inline-converted\">promotion faster</strong> or <strong class=\"redactor-inline-converted\">spread your influence</strong> within your company?  </p>\n\n\n\n\n\n\n\n<p>  \t                                      Or maybe you want to <strong class=\"redactor-inline-converted\">solidify your reputation</strong> as an entrepreneur or professional in the online world…  </p>\n\n\n\n\n\n\n\n<p>Here are a few facts about LinkedIn from my perspective:</p>\n\n\n\n\n\n\n\n<ul><li>LinkedIn has an amazing potential for networking and it's how I made dozens of face-to-face meetings happen, both in a corporate environment and with entrepreneurs</li><li>LinkedIn allowed me to network with 100+ people in 2 months in a major Consulting company</li><li>LinkedIn is a great branding opportunity and it will be the go-to place for your personal online image</li></ul>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Double your Visibility Guarantee</strong></p>\n\n\n\n\n\n\n\n<p>I personally guarantee you will get <strong class=\"redactor-inline-converted\">measurable results </strong>if you implement the concepts I talk about. I'm so confident that I will <strong class=\"redactor-inline-converted\">personally guarantee</strong> you will see a spike in your visibility on LinkedIn after taking this course. That is the basis to <strong class=\"redactor-inline-converted\">increasing your connections</strong>, <strong class=\"redactor-inline-converted\">networking with executives</strong> and <strong class=\"redactor-inline-converted\"> positioning yourself as an influencer</strong>.</p>\n\n\n\n\n\n\n\n<p>If you feel that's not the case, I will PERSONALLY TRAIN YOU via:</p>\n\n\n\n\n\n\n\n<p>- 1 to 1 Skype Calls to suggest changes to your Profile</p>\n\n\n\n\n\n\n\n<p>- Tailored Strategy &amp; Templates to approach Influencers in your Industry</p>\n\n\n\n\n\n\n\n<p>- Advice on Publishing topics for the future</p>\n\n\n\n\n\n\n\n<p>Shortly after launching the course, a student contacted me saying that he got <strong class=\"redactor-inline-converted\">approached by a recruiter </strong>a few days after implementing 10% of the aspects I talk about in this course. Imagine if you did <strong class=\"redactor-inline-converted\">70%</strong> and were dedicated to improving your LinkedIn presence...</p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Here's what some students say about my course:</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                          \"As a fellow Udemy instructor with 5 bestselling courses I know how much commitment it takes to publish a comprehensive Udemy course. This production is certainly one of the best in the Social Media category.  </p>\n\n\n\n\n\n\n\n<p>  \t                          Dragos is my good friend and I could see firsthand how much effort he put into delivering tremendous value to his students. I'm happy to see that all those weeks of hard work paid off and customers are loving the content.  </p>\n\n\n\n\n\n\n\n<p>  \t                          Great job.\" - <strong class=\"redactor-inline-converted\">Jimmy Naraine - Top Udemy Instructor</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                          \"Respect. I have to say you put a good course together. I'm already thinking about implementing some of these tactics and getting material to tell a group social media marketers that I work with.  </p>\n\n\n\n\n\n\n\n<p>  \t                          My all-time favorite is being able to extract emails from LinkedIn. You would never know that otherwise - well put together Dragos. Keep the quality coming.\" - <strong class=\"redactor-inline-converted\">Jim Jones  </strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                                              This <strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">course</strong></strong> will reveal exactly how you can achieve all of these:  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>Get over the 500+ Connection base mark in half the time</li>  \t<li>Increase your Profile views x3 with only a few hours of work</li>  \t<li>Create and nurture your own niche community, skyrocket your profile searchability both in LinkedIn and Google results</li>  \t<li>Publish like Influencers and establish yourself as an expert in your subject matter.</li>  </ul>\n\n\n\n\n\n\n\n<p>  \t                                              This course will teach you how to develop your <strong class=\"redactor-inline-converted\">personal online brand</strong> through a strategic approach that aims to help you achieve the maximum progress in the shortest possible time. Whether it's how to set up your profile or how to network like an Influencer, this course will show you the techniques to achieve success.  </p>\n\n\n\n\n\n\n\n<p>  \t                                              Gain access to <strong class=\"redactor-inline-converted\">3+ hours</strong> of high quality videos which will keep you engaged and hungry to progress. I will update the lectures regularly to be in line with LinkedIn changes and constantly add <strong class=\"redactor-inline-converted\">Bonus</strong> material. What's more, you also get<strong class=\"redactor-inline-converted\"> PDFs</strong> with case studies and <strong class=\"redactor-inline-converted\">real-life examples</strong> of how <strong class=\"redactor-inline-converted\">Influencers</strong> enhance their presence.  </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Take this course Now!</strong></p>\n\n\n\n\n\n\n\n<p>  \t                                              I have experienced the power that LinkedIn can have and I truly believe it can benefit you tremendously. I'm excited to share my knowledge with you and lead you on the path to success!  </p>", 
    "end_date": null, 
    "title": "LinkedIn Blueprint", 
    "price": "40.00", 
    "instructors": "Dragos Stefanescu", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374904_319a_4.jpg", 
    "course_url": "https://www.udemy.com/linkedin-influencer-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-21T08:14:30Z"
}