{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Mastering Men’s Career Style</strong></p>      <p><strong>Is Your Appearance Affecting Your Success?  </strong></p>    <p>I am sure you have heard of first impressions, but did you know that 55% of your first impression is based on your appearance. Yes people do judge you by your appearance and you do the same. What this means is that your appearance could be costing you career opportunities and advancement.  </p>    <p>The good news is you can take control of your image and make sure that your appearance is in line with your career goals. This course is designed to teach you the basic steps of image management. </p>    <p><strong>Do I have to love fashion to take this course?</strong></p><p><strong></strong>No, the course is about your image and how this affects your career, it not about being fashionable it's about being stylish. We will cover the 6 pillars of what makes a success image. These Pillars are Color, Fit, Quality, Appropriateness, Being Current and You. Each of these categories will be explained and you will have action steps to follow in order to make this course more personalized. </p>    <p><strong>How Will I Benefit?</strong></p>    <p>Once you have finished with this course you will have a clear understanding of how your image is affecting your career. You will know how to apply each of the pillars to create an image that communicates your goals. The best part is that you might even get a raise or that new job once you apply these principals. You will definitely look more polished and stylish but you will need to take the action steps instructed. </p>      <p>I look forward to having you as a student and helping you look great and reach your career goals.</p>", 
    "end_date": null, 
    "title": "Mastering Men's Career Style", 
    "price": "20.00", 
    "instructors": "Monica Diaz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618382_1a1a_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-mens-career-style/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T18:43:30Z"
}