{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is the second part of a series of three courses on <strong>Performance Under Pressure</strong> and focuses on <strong>Taking Action</strong>. And, in this course, you are going to learn not only how to take action under pressure, but also how to avoid over-thinking and over-confidence, and understand what exactly the challenge is.</p><p>Acting effectively in high-pressure situations is not easy. Over-confidence can lead to poor judgment, and over-thinking the situation can lead to paralysis. Also, your perception may become clouded by negative thoughts and emotions in times of pressure. But it's exactly at these times that you need to perceive the challenges most clearly so that you can set appropriate goals and take effective action to achieve them. </p><p>This course sets out some <strong>principles</strong> to help you avoid the dangers of overconfidence and overthinking, which can impair your performance when under pressure. It then <strong>teaches a technique</strong> for clarifying your perceptions in such situations and creating an action plan to optimize your performance under pressure. </p><p>Professionals who want to develop their abilities to manage the stress that comes with working under pressure, and those who want to develop or refine their skills for performing under pressure will benefit from this course.</p><p>After completing this course, <strong>you will be able to</strong>:</p><ul><li>avoid over-analysis and over-confidence in high-pressure situations, </li><li>understand the challenge in a high-pressure situation from emotional reactions,</li><li>manage automatic thoughts to optimize perceptions in high-pressure situations,</li><li>use appropriate steps in the process of taking action in a high-pressure situation, and </li><li>take action in pressure situations to match every challenge.</li></ul><p>So, thank you for considering this course. The course includes video lectures, quizzes, examples and exercises and a small optional course project. All should take you not more than 2 hours to finish.</p><p>The course comes with a 30 days, no question asked, guarantee. Now, go ahead and hit that \"Take the course\" button, and see you on the inside!</p>", 
    "end_date": null, 
    "title": "Performance Under Pressure - Taking Action", 
    "price": "20.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657730_aef8_3.jpg", 
    "course_url": "https://www.udemy.com/performance-under-pressure-taking-action/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T13:02:30Z"
}