{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong>\"Thank you so much Russell for this amazing course, it is both deep and meaningful, as well as thought-provoking, engaging, makes so much sense, it really does make me wonder why we don't do this stuff naturally... \"</strong></em><br></p><p>Currently discounted by 50%. You won't find this course in Udemy sales.</p><p><strong>Personal branding is critical to your success</strong> because in today's society we all need to sell ourselves. </p><p>When you leave a room, <strong>what do people say about you?</strong> That's your brand and just like a business you need to create your own authentic and powerful brand that will make people <strong>remember you for the right reasons</strong>.</p><p>Do you want to:</p><ul><li><strong>be better at selling yourself?</strong></li><li><strong>make a stronger impression on people?</strong></li><li><strong>get the job you've always dreamed of?</strong></li><li><strong>take your business to the next level?</strong></li><li><strong>perform in the best possible way?</strong></li><li><strong>make the most of your potential?</strong></li></ul><p>In this course Personal Branding expert Russell Amerasekera will help you build strategies and plans so you can <strong>create your own powerful and effective personal brand</strong>. With <strong>guided practical activities</strong> you will quickly learn:<br></p><ul><li>what a personal brand is</li><li>why it's critical to your success in today's society where we all have to sell ourselves</li><li>how to create your own personal brand story and learn how to play that story out to all the audiences that are important to you</li><li>tips, advice and strategies on how to <strong>maximise your potential</strong> in both your life and your career</li><li>how to <strong>tailor your clothing and image</strong> to match your personal brand and understand how that can make a huge difference to the way people perceive you</li></ul><p>You'll be able to apply what you learn to all areas of life so that you can <strong>achieve more success in life, love or money.</strong></p><p>Electric Academy selected Russell because he has a <strong>proven track record of transforming the lives of incredibly successful people </strong>and we wanted to help him <strong>reach even more people with his unique transformative skills</strong>. Russell's clients include board directors and senior executives from major blue chip companies, entrepreneurs, celebrities and private individuals. He regularly works with international businesses including HSBC Bank, Fremantle Media, TUI, Thomson Reuters, DMGT Media, Mothercare, British Gas, BT, Grant Thornton, Rio Tinto and Ann Summers.</p>", 
    "end_date": null, 
    "title": "Personal branding - Russell Amerasekera unlocks the real you", 
    "price": "20.00", 
    "instructors": "Electric Academy, Russell Amerasekera", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/605240_d46e_2.jpg", 
    "course_url": "https://www.udemy.com/russell-amerasekera-personal-branding/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T21:36:20Z"
}