{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><span style=\"\">Imagine that every time you introduce yourself, you know you are coming across as completely confident, comfortable and memorable. You will never again have to worry about what to say or how you come across.</span></p><p style=\"\">  \t<span style=\"\">How to Introduce Yourself</span>  </p>  <p style=\"\">  \tIn this &quot;How to Introduce Yourself&quot; course you will learn how to avoid the awkwardness and tediousness displayed when many people introduce themselves. You will be taught how to appear to be confident, comfortable and relaxed when standing to introduce yourself, and you will know how to say something interesting and memorable to the other people in the room. Once you learn these skills, you won&#039;t just appear to be confident; you actually will be confident. Your days of being nervous and uncomfortable about the prospect of introducing yourself will soon be over.  </p><p style=\"\">Enroll in this course today.</p><p style=\"\">Course updated on July 30, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p style=\"\">What others say:</p><p style=\"\">“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p style=\"\">“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p style=\"\">(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Personal Communication-Introduce Yourself With Confidence", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351142_c848_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-introduce-yourself/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T18:25:54Z"
}