{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you self-employed or in sales and need new contracts to boost your revenue? </p><p>Let me get right to the point -<b> Personal Branding</b> is the powerhouse behind business success and this course will show you how to grab your current reputation and turn it into a brand that works effectively for you, even when you're not there! </p><p>I came from nowhere, with nothing, so had to learn what worked and what didn't the hard way. I am now recognised in the UK as the <b>leading Networking &amp; Personal Brand expert </b>and I share my knowledge and experience through speaking, coaching and training. For many years I have networked successfully in the FTSE250 market which is very tough to break into let alone survive in! During this <b>personal brand </b>programme I will give you a step by step process which will enable you to break into this or any other market.</p><p>It's my practical approach towards Personal Branding that makes my step by step process work. I've looked at the bigger picture and combined business and marketing objectives with networking and soft skills to create a course which will produce the results you need. </p><p>Long ago I made it my mission to study how networking really works, why some people are successful and others are not, and the one thing I have found that all successful business people have in common is that they have a network of Connectors / Influencers. These are the people who oil the business machine. </p><ul><li><b>If your Connectors / Influencers don't 'get' you, they can't help you!</b></li></ul><p>We are all limited by the amount of time we can be 'out there' so it's crucial to use it wisely. The most effective way to do this is to develop a network of Connectors / Influencers – people who know and hear about opportunities and could put your name forward. These are the people you need to be networking with and who need to understand your <b>personal brand</b>. </p><p>This course will show you exactly what these people need from you in order to help.</p><ul><li>Do you know who your Introducers are?</li> <li>Do you know what motivates them to refer you?</li> <li>Do you know in which situations your name could be mentioned?</li> <li>What do you do to educate and help your Connectors?</li></ul><p><b>If you want networking to generate openings for you, you need a clear, simple brand that enables people to articulate your key message to others. You need a portable personal brand.</b></p><p>This programme distils my expertise into a series of step by step exercises which focus on what is practical and gets results in the real world. I will show you how to develop a personal brand which is authentic and sustainable. I will also show you how to create a straightforward 'go to market' plan which utilises networking as its major marketing tool. Most people who want new contracts do not align their networking with their contacts' buying cycles, this is a huge mistake. On this course I will show you how to do this and much more!</p><p>By the end of this programme you will have a personal brand that is clear and fully tested. You will also know your key words, who to share them with and how to modify them for different contacts and client groups. </p><p><b>A successful personal brand creates a willingness in others to do something for you. This course will show you how to create a very effective personal brand AND how to get it out to your market.</b></p>", 
    "end_date": null, 
    "title": "Practical Personal Brand For Self Employed & Sales People ", 
    "price": "50.00", 
    "instructors": "Heather White", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426298_6df5_5.jpg", 
    "course_url": "https://www.udemy.com/practical-personal-brand-brands-that-create-opportunities/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T21:16:13Z"
}