{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Werden Sie zum LinkedIn Experte und steigern Sie die Profil-Ansichten um mind. 30%. </p><p style=\"\"><strong style=\"\">Schritt für Schritt zu Ihrem professionellen LinkedIn Profil.</strong></p><ul style=\"\"><li>Registrierung</li><li>Profilbild und Hintergrundbild auswählen</li><li>Slogan verfassen</li><li>Zusammenfassung strukturieren</li><li>Berufserfahrung, Ausbildung, Kenntnisse etc. erfassen</li><li>Das eigene Netzwerk vergrössern</li><li>Die Profil-Einstellungen richtig setzen</li></ul><p style=\"\"><strong style=\"\">Ein übersichtlicher Crash-Kurs mit Erfolgsgarantie!</strong></p><p style=\"\"><strong style=\"\"></strong>In diesem Kurs lernen Sie Schritt für Schritt welche Inhalte auf LinkedIn wichtig sind und wie Sie diese strukturieren können. Zudem lernen Sie die wichtigsten Netzwerk-Funktionen kennen. Nach diesem Kurs werden Sie auf LinkedIn gefunden und überzeugen mit einem professionellen Profil. Ein <em style=\"\">must</em> für Berufseinstieg und Karriere.</p><p style=\"\"><strong style=\"\">Übersicht des Kurses</strong></p><p style=\"\">Egal ob Sie bereits ein Profil auf dem grössten Berufsnetzwerk LinkedIn haben oder nicht, in diesem Kurs lernen Sie die wichtigsten Eckpfeiler eines professionellen Profils kennen. Ich zeige Ihnen, wie die Zusammenfassung strukturiert werden kann, warum es sich lohnt Unternehmen und Personen zu folgen, welche Vorteile bestätigte Kenntnisse haben etc.</p><p style=\"\"><strong style=\"\">Ist ihr aktuelles LinkedIn Profil eine Baustelle? Oder nicht mal das?</strong></p><p style=\"\">Nehmen Sie diesen Kurs als Anlass und Leitfaden Ihr LinkedIn Profil auf Vordermann zu bringen - oder ein neues zu erstellen. Der Kurs richtet sich an Anfänger und Personen, die LinkedIn bereits gut kennen aber deren Profil noch leer, langweilig und eine ewige Baustelle ist. <br style=\"\"><em style=\"\">Ein professionelles Profil ist die Basis für sämtliche Aktivitäten auf LinkedIn.</em></p><p style=\"\"><strong style=\"\">Besonders geeignet für Berufseinsteiger. </strong></p><p style=\"\"><strong style=\"\"></strong>Wusste Sie, dass die meisten Unternehmen Sie für die Bewerbung googeln? Lassen Sie sich finden - und präsentieren Sie sich von der besten Seite.</p><p style=\"\">Der Kurs setzt nur minimale Kenntnisse voraus und führt Schritt für Schritt durch die Funktionen. LinkedIn bzw. die Idee von LinkedIn sollte bekannt sein.</p><p style=\"\"><em style=\"\">In diesem Kurs wird nicht auf die inhaltliche Verwendung von LinkedIn eingegangen. Fragen wie &quot;wie schreibe ich eine gutes Update&quot; werden nicht thematisiert. Vielmehr soll ein funktionelles solides Fundament gesetzt werden.</em></p>", 
    "end_date": null, 
    "title": "Schritt für Schritt zu einem professionellen LinkedIn Profil", 
    "price": "20.00", 
    "instructors": "Clemens Bartlome", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441116_418d_3.jpg", 
    "course_url": "https://www.udemy.com/linkedin-experte-werden/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T10:15:54Z"
}