{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    Do you want people to listen and engage with you when you speak?  </p>  <p>  \t    Do you want to be more confident when you have a conversation with others?  </p>  <p>  \t    Are you aware that people don&#039;t always understand you when you speak?  </p>  <p>  \t    Do you need to speak more to other people in your job?  </p>  <p>  \t    This is the course for you!  </p>  <p>  \t        The Speaking to Engage course is perfect for anyone who wishes to improve their speaking skills, whether they are hosting a podcast, run webinars, have media opportunities, public speaking engagements, telephone calls, meetings or even talking to friends. It is an interactive course with a series of short videos and accompanying downloadable worksheets.  </p>  <p>  \t    The first section starts with you and your friends assessing your speaking voice. The second section includes a variety of lectures on different areas to improve your speaking voice including:  </p>  <ul style=\"\">  \t<li>Diction exercises to help you speak more clearly</li>  \t<li>Speaking louder</li>  \t<li>Making your voice interesting</li>  \t<li>Learning to relax before you speak</li>  \t<li>Learning how to speak slower and more clearly</li>  </ul>  <p>  \t     The course concludes with a 7 day challenge for you to try out your new speaking skills.  </p>  <p>  \t        The course includes a downloadable book, which I encourage you to write notes in, and audio lectures.  </p>", 
    "end_date": null, 
    "title": "Speaking to engage your audience", 
    "price": "50.00", 
    "instructors": "Susan Heaton-Wright Heaton-Wright", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/253002_88cb_4.jpg", 
    "course_url": "https://www.udemy.com/speaking-to-engage-your-listeners/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-30T08:07:18Z"
}