{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Don’t turn away just yet!</strong>  </p>  <p>  \t   This is not your ordinary course to share old school networking tools.  </p>  <p>  \t  Networking in the <strong>“Old Economy”</strong> was all about <strong>Me, Myself, and I.</strong>  </p>  <p>  \t  It is high time you leave that method in the past.  </p>  <p>  \t<strong>It’s 2015 and it’s time to Create A Network of Super Friends!</strong>  </p>  <p>  \t<em><strong>In five easy videos Sunny shares with you the power of Super Friends that is all about connecting, giving, influencing, and loving.</strong></em>  </p>  <p>  \t  Even if you hate networking, totally can’t get with Facebook, or don’t like talking much this course will provide you with tips to being you and creating lasting mutually beneficial relationships.  </p>  <p>  \t  The truth is friends can make you or they can break you!  </p>  <p>  \t<strong>Friends are your most powerful personal resource - choose wisely!! </strong>  </p>  <p>  \t<strong>Remember.... a great friend starts with you!</strong>  </p>  <p>  \t<strong>You are a Product of your Friends!  They are your net worth. </strong>  </p>  <p>  \t<strong></strong>We can’t choose our family, but we certainly must choose our friends wisely.  </p>  <p>  \t<strong>The process starts with you; you are the DRIVER of your success</strong>.  </p>  <p>  \t  To be a great friend is to attract great friends.  </p>  <p>  \t<strong>Are you ready to Create a Network of Super Friends?</strong>  </p>  <p>  \t  Friends that will change your life, inspire you, collaborate and share your goals with you.  </p>  <p>  \t<strong>It’s time to develop a fully functioning, successful network.</strong>  </p>    ", 
    "end_date": null, 
    "title": "Super Friend Power", 
    "price": "35.00", 
    "instructors": "Shauntae Jordan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140110_2c03_9.jpg", 
    "course_url": "https://www.udemy.com/super-friend-power/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-31T14:04:54Z"
}