{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>“Learn how to make money by writing – the right way…\"</p><p>If you're looking for a good way to generate some additional income - maybe even enough to eventually quit your day job - a great option is to provide writing services to others. Even if you only consider yourself a half-decent writer, there are probably lots of opportunities out there for you to make some money. You definitely don't have to be Shakespeare to get started!</p><p>We all know that online \"Content Is King\", but not everybody is comfortable or even able to create that content. Or some people simply don't have the time to sit down and generate all the content for their audience. They are always looking for ways to find highquality content for their websites, and one of the best ways to do that is by hiring a writer to create the content for them.</p><p>In this course we're going to look at some of the ways that you can earn money by writing, including some of the most effective places to find buyers for your work.</p><p>Join this course now and learn…</p><ul><li>Why writing is a great way to earn money.</li><li>How to compete with cheap writers, even if you charge a lot more money.</li><li>The “Double Dip\" writing strategy that will let you earn a lot more from your writing.</li><li>Why selling PLR (Private Label Rights) content is such a powerful strategy for writers.</li><li>Where to find enough writing clients to fill your calendar for months.</li></ul>", 
    "end_date": null, 
    "title": "Turn Your Writing Skills Into An Income - Done The Right Way", 
    "price": "40.00", 
    "instructors": "Wilko Van De Kamp", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618568_b9dc_2.jpg", 
    "course_url": "https://www.udemy.com/freelance-writing-for-money/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T22:30:17Z"
}