{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Is this you?</p>  <p>You are a writer or blogger producing content on a daily basis.</p>  <p>Maybe you write Kindle ebooks and put them up for sale.</p>  <p>Despite all the work you do things grow stale. Maybe you are trying to expand your audience and this flattens out. You want to drive sales of books and ebooks up from what they are now. Or maybe you want to get your message out beyond writing and just words.</p>  <p>What you need is to identify your brand as a writer and get the message out. Knowing your brand may be easy. Who you are, your work and values could be seen in your writing and the work that you do. But how do you get that message out to other?</p>  <p>Ever consider the Periscope app?</p>  <p>Periscope is the smartphone app that lets anyone livestream events happening now from their smartphone. It can be used anytime anywhere for letting others know what is going on. It can also be a personal branding machine and this course can show you how.</p>  <p>Section one looks at the concept and importance of the brand.</p>  <p>Section two looks at building and maintaining the brand.</p>  <p>Section three introduces you to Periscope and its uses.</p>  <p>Section four explores some best use practices and how to use periscope for business.</p>  <p>And section five looks at how to use Periscope specifically for writers and authors. </p>  <p>Periscope can add a new dimension for yourself and the work you do. It introduces you the person as well as the writer. This course can show you how to use the Periscope app with success. </p>", 
    "end_date": null, 
    "title": "Use Periscope To Develop Your Brand As A Writer", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/723154_b3f1_2.jpg", 
    "course_url": "https://www.udemy.com/use-periscope-to-develop-your-brand-as-a-writer/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Brand Building"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-10T20:56:54Z"
}