{
    "selfpaced": true, 
    "topic_name": [
        "Business Analytics and Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    Business process models play a central role in describing, analyzing, improving, implementing, and monitoring business processes. They can serve as communication medium for professionals with different background and expertise, ranging from business administration, quality management and organizational development to process improvement, systems architectures and software development. The aim of this course is to provide a common understanding and a common language to improve the communication between these professionals during all phases of business process management projects.\r\nThis course introduces concepts of business process modeling using the Business Process Model and Notation (BPMN) industry standard. Participants will learn the elements of process models and their precise meaning. We cover business processes within organizations and also interacting processes involving several organizations, i.e., we investigate process orchestrations and process choreographies. We will also look at techniques to analyze business processes from a formal perspective.\r\nThe course centers around concepts and language to describe and analyze business processes. It does not cover methods on how to model, improve, monitor or implement business processes. Still, a deep understanding of business process models is a useful basis for these activities.\n\n                                    ", 
    "end_date": null, 
    "title": "Business Process Modeling and Analysis", 
    "price": 0, 
    "instructors": "Mathias Weske", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://open.hpi.de/courses/bpm2013", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "openHPI"
    ], 
    "start_date": "2013-10-27T00:00:00Z"
}