{
    "selfpaced": false, 
    "topic_name": [
        "Business Analytics and Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, you will learn best practices for how to use data analytics to make any company more competitive and more profitable. You will be able to recognize the most critical business metrics and distinguish them from mere data.\n \nYou’ll get a clear picture of the vital but different roles business analysts, business data analysts, and data scientists each play in various types of companies. And you’ll know exactly what skills are required to be hired for, and succeed at, these high-demand jobs.\n \nFinally, you will be able to use a checklist provided in the course to score any company on how effectively it is embracing big data culture. Digital companies like Amazon, Uber and Airbnb are transforming entire industries through their creative use of big data. You’ll understand why these companies are so disruptive and how they use data-analytics techniques to out-compete traditional companies.\n\n                                            Syllabus\n                        About This Specialization and Course The Coursera Specialization: Excel to MySQL: Analytic Techniques for Business, is about how 'Big Data' interacts with business, and how to use data analytics to create value for businesses. This specialization consists of four courses and a final Capstone Project, where you will apply your skills to real-world business process. You will learn to perform sophisticated data-analysis functions using powerful software tools such as Microsoft Excel, Tableau, and MySQL. To learn more, watch the video and review the specialization overview document we provided. \nIn the first course of the specialization: Business Metrics for Data-Driven Companies, you will be able to: learn best practices for using data analytics to make any company more competitive and more profitable; learn to recognize the most critical business metrics and distinguish those from mere data; get a clear picture of the vital but different roles business analysts, business data analysts, and data scientists each play in various types of companies; and know exactly the skills required to be hired for, and succeed at, these high-demand jobs. Finally, using a 20-item checklist for evaluating a business, you'll score any company on how effectively it is embracing big data culture. Digital companies like Amazon, Uber and Airbnb are transforming entire industries through their creative use of big data. You’ll understand why these companies are so disruptive, and how they use data-analytics techniques to out-compete traditional companies.\nTo get started, please begin with the video 'About This Specialization.'\nI hope you enjoy this week's materials!Introducing Business MetricsWelcome! This week we will explore business metrics - the critical numbers that help companies figure out how to survive and thrive. Inside every pile of data is a vital metric trying to get out!\nBy the end of this week, you will be able to:   distinguish business metrics from mere business data; identify critical business metrics such as cash flow, profitability, and online retail marketing metrics;  distinguish revenue, profitability and risk metrics; and distinguish traditional from dynamic metrics.Included in this week’s course materials is a Cash Flow and P&amp;L statement for Egger’s Roast Coffee, as a supplemental document, so be sure to review it carefully and refer to the glossary for key information. You will also complete a graded quiz. As always, if you have any questions, post them to the Discussions.\nTo get started, please begin with the video 'Metrics Help Us Ask the Right Questions.'\nI hope you enjoy this week's materials!Working in the Business Data Analytics MarketplaceWelcome!  This week, we will meet some great people - all former students of mine - now working at super-interesting and exciting jobs as business analysts, business data analysts, or data scientists. We’ll explore what they do, how their role relates to big data, and the skills they needed to get hired! Our hope is this information will give you a better understanding of the type of data-related job you might apply for once you've completed this specialization, and a sense of the type of company you would find most appealing to work for.\nBy the end of this week, you will be able to: differentiate among different job roles within a company that work with data; identify how each role works with data; and  describe the skills required to perform each job role. You will differentiate how different types of companies relate to big data culture, and rank any company according to a 20-item checklist. You will also learn to differentiate how different types of companies relate to big data culture. Included in this week’s materials is a 20-item checklist to rank companies. This week also includes in-video polls so you can see how others are ranking their businesses. Remember to refer back to the glossary as a supplemental document, and to review it carefully. You will also complete a graded quiz. As always, if you have any questions, post them to the Discussions. To get started, please begin with the video Roles and Companies as They Relate to Big Data.Going Deeper into Business Metrics Welcome! This week we’re going to go deeper into the critically-important metrics for web marketing - metrics every type of business needs to understand in order to survive. We’ll dive into the 'vertical' market of financial services - where digital companies are threatening to take away the market from traditional 'brick-and- mortar' companies.\nBy the end of this week, you will be able to:  Identify critical business metrics for all companies engaged in web-based marketing; and  identify critical business metrics for financial services companies. You’ll find additional website links that expand some of the course materials covered in this week’s video lectures. Remember to refer back to the glossary as a supplemental document, and to review it carefully.You will also complete a graded quiz.\nLooking ahead, next week you’ll work on a final course assignment, a peer assessment applying business metrics to a business case study. As always, if you have any questions, post them to the Discussions.\nTo get started, please begin with the video 'Web Marketing: Metrics.'\nI hope you enjoy this week's materials!Applying Business Metrics to a Business Case StudyThis week contains the final course assignment, a peer assessment in which you will identify business metrics of interest in a case example, describe those metrics, and propose a business process change that could be supported by the metric chosen. This final peer review assignment will allow you to review, and to provide feedback to your classmates. Don’t forget to consult the course glossary to help you with the peer assessment. If you have questions on the peer assessment, please post them to the discussions. We anticipate the peer assessment will take you no more than 3-5 hours, including writing your own assignment and reviewing your peers (but not including any review you may need to do as you work on your assignment).\nLooking ahead, once you’ve completed the peer assessment and the course, we hope you’ll join us in the next course offered in the specialization: Mastering Data Analysis in Excel, where you will master the Microsoft Excel techniques successful business analysts and business data analysts rely on every day to extract actionable information from business data. Starting with basic Excel functions (it’s ok if you’ve never used Excel before), you will import and work with real world data sets, display your results in charts and graphs, then solve more advanced problems using Excel’s built-in data functions and the Solver plugin. Along the way, you will learn the essential data modeling and predictive analytics concepts that will give you the power to ask the right questions of data and extract the most useful answers.As always, if you have questions about the peer assessment, please post them in the discussion forum. We look forward to your active engagement in the course community! Once you’ve completed the peer assessment, share your feedback on the course by completing the Feedback Survey.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Business Metrics for Data-Driven Companies", 
    "price": 0, 
    "instructors": "Daniel Egger and Jana Schaich Borg", 
    "institution_name": [
        "Duke University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/analytics-business-metrics", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}