{
    "selfpaced": false, 
    "topic_name": [
        "Business Analytics and Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    Artificial intelligence (AI) may sound like science fiction, but it is real, and becoming increasingly important to companies in every sector. The field of artificial intelligence has produced a wide variety of \"cognitive technologies\" that simulate human reasoning and perceptual skills, giving businesses entirely new capabilities and enabling organizations to break prevailing tradeoffs between speed, cost, and quality.Aimed at a general business audience, this course demystifies artificial intelligence, provides an overview of a wide range of cognitive technologies, and offers a framework to help you understand their business implications. Some experts have called artificial intelligence \"more important than anything since the industrial revolution.\"[i] That makes this course essential for professionals working in business, operations, strategy, IT, and other disciplines. Throughout the course, participants will build a knowledge base on cognitive technologies to equip them to engage in discussions with colleagues, customers, and suppliers and help them shape cognitive technology strategy in their organization.You will explore many topics in this course including:\r\n\r\nWhat is artificial intelligence, and how did the field attain the importance it has today?\r\nWhat are cognitive technologies? Dig below the surface and gain a basic understanding of the technologies that simulate language understanding, seeing, and reasoning.\r\nHow will cognitive technologies impact my business? Explore the types of applications that cognitive technologies may be suited for, and discover a framework that can help you conceptualize whether and where you might deploy them in your organization\r\nWhat is the impact of cognitive technologies on work? Cut through the hype and understand what leaders and workers need to know now to prepare for the changes these technologies will bring to work, workers, and organizations\r\nWhat does the future hold for cognitive technologies? Learn about the technological, legal and ethical factors that may influence the evolution and further adoption of cognitive technologies.\r\n\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Cognitive technologies: The real opportunities for business", 
    "price": 0, 
    "instructors": "David Schatsky", 
    "institution_name": [
        "Deloitte University Press"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/cognitive-technology-2016a", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2016-03-14T00:00:00Z"
}