{
    "selfpaced": true, 
    "topic_name": [
        "Business Analytics and Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    The Creating an Analytical Dataset course provides students with foundational knowledge to input, clean, blend, and format data in preparation for analysis. You will learn:\r\n\r\nThe common sources and types of data\r\nTo identify and correct common issues with data \r\nTo format data in useful ways for analysis\r\nTo blend data from multiple sources together  Throughout this course you’ll also learn the techniques to apply your knowledge in a data analytics program called Alteryx. At the end of the course, you’ll complete a project based on the principles in the course..  This course is part of the Business Analyst Nanodegree.Why Take This Course?Ever heard of the term garbage in, garbage out? This is as true in analytics as it is anywhere else. In this course, you’ll learn how to prepare data to ensure the efficacy of your analysis, a foundational skill for anyone using advanced analytics. You'll learn this through improving your fluency in Alteryx, a data analytics tool that enables you prepare, blend, and analyze data quickly. This course is ideal for anyone who is interested in pursuing a career in business analysis, but lacks programming experience.\r\n\n\n                                            Syllabus\n                        Lesson 1 - Understanding Data In this lesson you’ll learn the differences between structured, unstructured, and semistructured data. You’ll also be introduced to the most common data types: string, number, date/time, boolean, and special characters.   Lesson 2 - Data Issues In this lesson you’ll learn how clean dirty data and prepare it for analysis. You’ll learn how identify and correct for common data issues like missing data, duplicate data, special characters, and outliers.  Lesson 3 - Data Formatting In this lesson you’ll learn the impact of the format of the data can have on your analysis. You’ll learn how to use common formatting techniques such as transposing, aggregation, and cross tabulation.  Lesson 4 - Data Blending In this lesson you’ll learn how to combine data from multiple sources into a single dataset. You’ll learn how to use common blending techniques such as joins, unions, fuzzy matching, and spatial blending.\n                                    ", 
    "end_date": null, 
    "title": "Creating an Analytical Dataset", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [], 
    "commitment": "6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.udacity.com/course/creating-an-analytical-dataset--ud977?utm_medium=referral&utm_campaign=api", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2016-06-07T00:00:00Z"
}