{
    "selfpaced": false, 
    "topic_name": [
        "Business Analytics and Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    This course is designed to show you how use quantitative models to transform data into better business decisions. You’ll learn both how to use models to facilitate decision-making and also how to structure decision-making for optimum results. Two of Wharton’s most acclaimed professors will show you the step-by-step processes of modeling common business and financial scenarios, so you can significantly improve your ability to structure complex problems and derive useful insights about alternatives. Once you’ve created models of existing realities, possible risks, and alternative scenarios, you can determine the best solution for your business or enterprise, using the decision-making tools and techniques you’ve learned in this course.\n\n                                            Syllabus\n                        Evaluation Criteria: Net Present ValueThis module was designed to introduce you to the many potential criteria for selecting investment projects, and to explore the most effective of these criteria: Net Present Value (NPV). Through the use of concrete examples, you'll learn the key components of Net Present Value, including the time value of money and the cost of capital, the main utility of NPV, and why it is ultimately more accurate and useful for evaluating projects than other commonly used criteria. By the end of this module, you'll be able to explain why net present value analysis is the appropriate criteria for choosing whether to accept or reject a project, and why other criteria, such as IRR, payback, ROI, etc. may not lead to decisions which maximize value.Evaluating ProjectsIn this module, you'll learn how to evaluate a project with emphasis on analyzing the incremental after-tax cash flows associated with the project. You'll work through a concrete example using alternative scenarios to test the effectiveness of this method. You'll also learn why only future cash flows are relevant, why to ignore financial costs, include all incidental effects, remember working capital requirements, consider the effect of taxes, forget sunk costs, remember opportunity costs, use expected cash flows, and perform sensitivity analysis.  By the end of this module, you'll be able to evaluate projects more thoroughly and effectively, with emphasis on how to model the change in the company’s after-tax cash flows, so that you can make more profitable decisions.Expressing Business Strategies in Financial TermsThis module was designed to give you the opportunity to learn how business activities, transactions and events are translated into financial statements, including balance sheets, income statements, and cash flow statements. You'll also learn how these three statements are linked to each other, and how balance sheets and income statements can help forecast the future cash flow statements. By the end of this module, you'll be able to explain how accounting systems translate business activities into financial terms, and how to use this to better forecast future cash flows, so that you can express your business strategies in these financial terms, and show \"the bottom line\" for your proposed plan of action.New Product ValueIn this module, you'll apply what you’ve been learning to an analysis of a new product venture. You’ll learn how to map out a plan of the business activities, transactions and events that need to happen to implement the new venture, including their timing. You'll also learn how to set up a spreadsheet to help with forecasts, and to re-calculate things automatically as we re-think our plans. You'll see how to forecast out the implied financial statements, and calculate the Net Present Value (NPV). By the end of this module, you'll be able to use spreadsheets to explore different risks a venture may face, and analyze the implications of these scenarios for NPV, so that you can make the most profitable, data-driven decision possible.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Decision-Making and Scenarios", 
    "price": 0, 
    "instructors": "Richard Lambert and Robert W. Holthausen", 
    "institution_name": [
        "University of Pennsylvania", 
        "Wharton School of the University of Pennsylvania"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/wharton-decision-making-scenarios", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}