{
    "selfpaced": false, 
    "topic_name": [
        "Business Analytics and Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    Gérer une entreprise aujourd’hui n’est pas aussi simple qu’autrefois. Comment mettre en place une gestion efficace de votre entreprise ?Des outils comme un ERP (ou PGI) semblent une solution adaptée pour y répondre, à condition d'être utilisés à bon escient.Quels sont les objectifs du cours ?L’analyse et la modélisation des processus transversaux de l’entreprise, côté théorique, ainsi que la familiarisation à l'utilisation d'un ERP, côté pratique constituent les objectifs de ce cours. Suite à cette formation, vous serez capable de gérer des échanges informatisés de données, d’analyser l’intégration de progiciels. Cela entraîne une réflexion sur la modélisation et la mise en place des processus métiers.Comment cette formation va se dérouler ?Les cours dureront 5 semaines. Les quatres premiers jours sont consacrés à l'initialisation du MOOC. Suivront 5 semaines effectives de cours, découpées en séquences. Une alternance entre théorie et pratique est prévue. Des études de cas seront analysées pour intégrées les connaissances dans un contexte professionnel. Vous aurez l’occasion de mettre en pratique l’utilisation d’un ERP libre: Odoo.\n\n                                    ", 
    "end_date": "2015-12-07T00:00:00Z", 
    "title": "Gérer son entreprise avec un ERP ou un Progiciel de Gestion Intégré", 
    "price": 0, 
    "instructors": "Emmanuel Dubois", 
    "institution_name": [
        "Université Toulouse III - Paul Sabatier"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/UPS/61001/session01/about", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-11-02T00:00:00Z"
}