{
    "selfpaced": true, 
    "topic_name": [
        "Business Analytics and Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    SAP S/4HANA is SAP’s next-generation business suite that enables you to streamline data models, optimize daily business transactions, accelerate strategic decision making, and simplify everything in between – whether you use it in the cloud or on premise.\r\nAs an SAP customer or potential customer, intrigued by SAP S/4HANA’s value to your business, you might ask yourself where to start and how to transition to it. This 4-week SAP S/4HANA implementation course aims to answer your questions, explain the fundamentals of the SAP S/4HANA adoption journey, and showcase three of the most popular scenarios for starting out with SAP S/4HANA.\r\nIn the first week, you will gain insight into the key innovations in SAP S/4HANA and SAP Activate, the unique adoption framework that was introduced with SAP S/4HANA. You will learn how SAP Activate allows you to get up and running quickly and to innovate continuously with SAP S/4HANA. You will understand why SAP Activate is the recommended way to simplify and streamline the adoption of SAP S/4HANA, whether you are involved in the migration to SAP S/4HANA, the configuration, integration, or extension of SAP S/4HANA, and whether you are an IT or business professional. Week one will conclude with customers who are already live on SAP S/4HANA sharing their implementation experiences using SAP Activate with you.\r\nIn the subsequent three weeks, you will be introduced to the most popular adoption scenarios. Each of these weeks will contain a combination of topic introduction and system demonstration that explains key steps in the transition to SAP S/4HANA. In week two we cover System Conversion, showing you how to move a complete SAP ERP application – and the business processes supported by SAP ERP – from SAP Business Suite running on any database to SAP S/4HANA on premise.\r\nIn weeks three and four, we’ll explore two different scenarios for new implementations. You will see a system demo of SAP S/4HANA in the cloud in week 3, and on premise in Week 4, including the migration of relevant legacy data in both cases.\r\nAfter week four, you will be able to take the final exam and earn a record of achievement. Your feedback and ideas are appreciated throughout the course. We therefore also encourage you to participate in the Discussion Forums.\n\n                                            Syllabus\n                        Week 1: SAP S/4HANA – Adoption FundamentalsWeek 2: System Conversion and InnovationWeek 3: New Cloud ImplementationWeek 4: New On-Premise ImplementationWeek 5: Final Exam\n                                    ", 
    "end_date": "2016-04-12T00:00:00Z", 
    "title": "Implementation of SAP S/4HANA", 
    "price": 0, 
    "instructors": "Kim Mathäß, Andreas Muno, Christopher Shinner and Elvira Wallis", 
    "institution_name": [], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://open.sap.com/courses/s4h4", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "openSAP"
    ], 
    "start_date": "2016-03-08T00:00:00Z"
}