{
    "selfpaced": false, 
    "topic_name": [
        "Business Analytics and Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    Le MOOC « Introduction à la cartographie des processus métiers » a pour objectif de vous permettre d’acquérir des compétences, des connaissances et une méthode pour cartographier un processus métier dans une organisation, avec une approche transversale et autonome. Cela implique :De comprendre les enjeux de la cartographie des processus dans les organisations et comment ils s’intègrent dans une stratégie globale,D’appréhender les méthodes et les outils autour de la cartographie pour une gestion de projet efficace,De réaliser des cartographies de processus formalisées notamment à l’aide de la norme BPMN.Dans ce cours, nous souhaitons donc aborder les fondements de la gestion des processus sur des aspects stratégiques et organisationnels mais aussi sur un axe pratique.L’espace du cours ouvrira le 23 février. En attendant, nous sommes présents sur les réseaux sociaux #CARTOMOOC. N’hésitez pas à venir nous rejoindre !\n\n                                            Syllabus\n                        SEANCE 1 Gestion des processus et cartographie : pourquoi ? comment ? BPMN niveau 1SEANCE 2 Organisation, métiers et processus : enjeux et opportunités BPMN niveau 2SEANCE 3 Gestion d'un projet de cartographie : méthode et outils BPMN niveau 3SEANCE 4 Bonnes pratiques des séances de cartographieSEANCE 5 Le troisième temps est dédié à la réalisation d'un projet. Certains pourront faire le choix de s’arrêter en phase 2, d’autres auront l’opportunité d’aller plus loin. L’objectif est de valider les compétences à travers un projet de groupe. Durant deux semaines, vous devrez mettre en pratique vos connaissances acquises pour résoudre un cas concret. Vous pourrez même proposer votre propre situation-problème si elle respecte certains critères.SEANCE 6 La dernière phase est une phase de finalisation.Elle ne contient pas d’activité d’apprentissage. Elle est dédiée à l’évaluation par les pairs des différents projets et à la remise des attestations.\n                                    ", 
    "end_date": "2016-03-09T00:00:00Z", 
    "title": "Introduction à la cartographie des processus métiers", 
    "price": 0, 
    "instructors": "Leslie Huin and Eric Disson", 
    "institution_name": [
        "Université Jean Moulin Lyon 3"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/lyon3/26001S02/session02/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-01-27T00:00:00Z"
}