{
    "selfpaced": false, 
    "topic_name": [
        "Business Analytics and Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    One of the most critical activities for companies is to leverage innovation as fast and easily as possible. With SAP BusinessObjects Cloud and SAP Digital Boardroom, we offer an end-to-end analytics solution in the cloud that enables our customers to use innovation directly.\r\nSAP BusinessObjects Cloud for BI, SAP BusinessObjects Cloud for planning, and SAP BusinessObjects Cloud for predictive analytics are the main solutions in SAP BusinessObjects Cloud. SAP Digital Boardroom itself is an application that sits on top of them.\r\nValue driver trees, planning and predictive scenarios, and visualizations are prepared in SAP BusinessObjects Cloud. Together, you can put them in stories that are the basis for SAP Digital Boardroom.\r\nSAP Digital Boardroom contains 3 screens: The Overview screen, Content screen, and the Context screen. The main aim of SAP Digital Boardroom is to give you a 360° view of your enterprise in real time. High-level as well as detail-level information is available to (executive) management members at all times (24/7). The capabilities of SAP BusinessObjects Cloud and SAP Digital Boardroom allow you to drill down directly into the details, and if something changes at line item level, you can see the impact on the aggregated view in real time. It gives you the chance to align executive decisions on one single source of truth using intuitive visualizations based on business units.In this course, you’ll learn the steps you need to take to prepare a board meeting using SAP Digital Boardroom.\n\n                                            Syllabus\n                        Unit 1: Introduction to SAP Digital BoardroomUnit 2: Enhanced Capabilities of SAP Digital BoardroomUnit 3: Collaboration ScenariosUnit 4: Board Meeting Leveraging SAP Digital Boardroom\n                                    ", 
    "end_date": "2016-09-20T00:00:00Z", 
    "title": "SAP Digital Boardroom in a Nutshell", 
    "price": 0, 
    "instructors": "Markus Schunter", 
    "institution_name": [], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://open.sap.com/courses/db1", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "openSAP"
    ], 
    "start_date": "2016-07-12T00:00:00Z"
}