{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<ul style=\"\">  \t<li style=\"\">Have you used your computer for years but barely know how to use it?</li>  \t<li style=\"\">Do you sit behind co-workers and say &quot;how did they do that?&quot;</li>  \t<li style=\"\">When given a task do you spend your time right arrowing through documents?  </li>  \t<li style=\"\">Have you ever thought about being a pro-level user of the tool you use every day?</li>  </ul>  <p style=\"\">  \t  I hire new people every day.  I want my employees to get the most of their day, and I want to get the most of out my money.  With the skills I show you in this course you will save yourself hours every week, and people will look at you like a Pro level user.  </p>  <p style=\"\">  \t    Every day we spend so much time trying so hard to get a lot done. yet <strong style=\"\">we find at the end of the day we have done nothing</strong>.  I can show you how to<strong style=\"\"> master your computer</strong> and make yourself way more productive.  </p>  <p style=\"\">  \t    We spend hours on the computer but <strong style=\"\">I find that no one ever knows how to use their computer properly.</strong>  It is the tool of your trade isn&#039;t it?  <strong style=\"\">When you sit down at it though you use it almost the same way you used it the first time you sat down at it.</strong>  Every day people do the same thing repeatedly but what if there was an easy way to learn how to do your daily tasks only faster.  What would you do with that time? Take a longer lunch?   Or even maybe you could make more money?  </p>  <p style=\"\">  \t    I&#039;m here to show you<strong style=\"\"> how to become a master of things you do every day</strong>. In this course I will show you how to maneuver your computer faster.  Write emails like a speed daemon. Skate through word and excel like your on a speed train, and even show you how to do massive tasks in seconds.   You don&#039;t have to be a computer hacker to understand what I&#039;m talking about either.  </p>  <p style=\"\">  \t    By the end of my course you will know some of the key secrets to speed through large tasks like a pro. How to use a macro tool that can make minced meat out of any repetitive task.  Text manipulation that will make you the king of your cubicle.  Use Microsoft office short-cuts that will make you skip through Word and Excel projects faster than you could have ever thought.  </p>  <p style=\"\">  \t    If for any reason you don&#039;t like my course I&#039;ll give you a full refund.  </p>", 
    "end_date": null, 
    "title": "10X your productivity: Word, Excel, Windows Master Them", 
    "price": "25.00", 
    "instructors": "Rico Rodriguez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362704_5a6d.jpg", 
    "course_url": "https://www.udemy.com/windows-productivity-hacks-10x-your-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T01:45:16Z"
}