{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<em><strong>COURSE UPDATE 8/25/2015: NOW OVER 590 STUDENTS ENROLLED!</strong></em>  </p>  <p>  \t<strong><em>---------------------------------------------------------------------------</em>---------------</strong>  </p>  <p>  \t<strong>WHAT MAKES OUR EXCEL COURSE UNIQUE?</strong>  </p>  <p>  \t                      #1 - IT WAS CREATED TO MAKE AN IMMEDIATE IMPACT  </p>  <p>  \t          We have centered this course around the 5 Excel skills that we believe will make the biggest impact in the daily work of a basic Excel user.  </p>  <p>  \t                      #2 - IT CENTERS AROUND PRACTICAL EXAMPLES  </p>  <p>  \t          We use some \"real life\" examples that you might receive from your boss, to teach you how to use and apply these 5 powerful Excel skills.  We provide real practice Excel files, so that you can walk alongside the instructor in each lecture!  </p>  <p>  \t          #3 - THE INSTRUCTOR IS AVAILABLE TO SUPPORT YOU  </p>  <p>  \t          The instructor will be monitoring the course discussion forum on a weekly basis.  If you have questions on ANY of the course content, please post them!  </p>  <p>  \t        #4 - WE HAVE MADE 8 VIDEOS AVAILABLE AS \"FREE PREVIEW'S\" BELOW!  </p>  <p>  \t<em>---------------------------------------------------------------------------</em>---------------  </p>  <p>  \t<strong>WHAT SKILLS DOES THIS COURSE FOCUS ON?</strong>  </p>  <p>  \t                      Our course uses <strong>practical examples</strong>, and includes <strong>real practice Excel files</strong> for each course section!  The 5 skills that our course focuses on are as follows:  </p>  <p>  \t                                VLOOKUP - To quickly pull info from one list to another.  </p>  <p>  \t                                PIVOT TABLES - To instantly summarize a set of information.  </p>  <p>  \t                                PIVOT CHARTS - To instantly chart out the summary from a Pivot Table!  </p>  <p>  \t                                MACROS - To automate recurring tasks in Excel.  </p>  <p>  \t                                FILTERS - To navigate and view your information more effectively.  </p>  <p>  \t<em>---------------------------------------------------------------------------</em>---------------  </p>  <p>  \t<strong>HOW MUCH TIME WILL IT TAKE TO COMPLETE THE COURSE?</strong>  </p>  <p>  \t                                This course could be completed in a matter of hours, if you'd like to go through everything in one sitting!  You could also break up the content and take a week or two to complete it.  <strong>Just think </strong>- you could be on your way to cutting down the amount of time you spend in Excel, while capturing the attention of others in the office <strong>by later this week!  </strong>  </p>  <p>  \t<strong><em>Consider for a moment how STANDING OUT could impact your potential for advancement within your organization!</em></strong>  </p>  <p>  \t<em>---------------------------------------------------------------------------</em>---------------  </p>  <p>  \t                                Remember that <strong>SUPPORT IS AVAILABLE</strong> along the way, if you have questions.  </p>  <p>  \t                                Just post your question to the course discussion forum.  Other students can respond, and the course instructor will be checking in each week to answer questions.  </p>  <p>  \t      Every student has 30-days to try this course or <strong>RECEIVE A FULL REFUND</strong> per Udemy's refund policy.  </p>  <p>  \t<strong>PLEASE NOTE: THE COST TO ENROLL IN THIS COURSE WILL SOON BE INCREASING.</strong>  </p>  <p>  \t<em>---------------------------------------------------------------------------</em>---------------  </p>  <p>  \t<em>Additional detail on this course:</em>  </p>  <p>  \t                                This course was designed for average level Microsoft Excel users, that want to take their skills to the next level.  We use a combination of video lectures, slide presentations, as well as actual Excel files that can be used to walk alongside all of the instruction contained in the course!  The instructor of this course will also be available to answer course related questions in the course discussion forum, to ensure you master the skills demonstrated!  </p>  <p>  \t                                             The course centers around a handful of hypothetical requests that one might receive from their boss, and use Excel to fulfill.  We use 5 \"easy-to-learn\" skills (Vlookup, Filters, Pivot Tables, Pivot Charts and Recorded Macros) to learn how to fulfill these requests quickly - and go above and beyond in doing so!  Dedicating just a couple hours to the completion of this course will have a significant impact on the amount of time you take to complete tasks in Excel, while also capturing the attention of those around you!  </p>  <p>  \t                                           Please note that Microsoft Excel 2010 is used in all examples, and the entire course is instructed by a Microsoft Office Specialist Expert in Excel 2010.  </p>", 
    "end_date": null, 
    "title": "5 Powerful Excel Skills - That Will Set You Apart", 
    "price": "20.00", 
    "instructors": "Spreadsheet Clinic", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251284_5e9a_4.jpg", 
    "course_url": "https://www.udemy.com/5-easy-to-learn-career-boosting-excel-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-27T02:53:23Z"
}