{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t   Have you ever felt frustrated using Microsoft Excel to perform mundane and often repetitive tasks? Have you ever felt that there has to be an easier and faster way to perform to do something? Well, using Microsoft Visual Basic for Application (VBA) programming language allows you to automate manual tasks within Excel and allows you to be more effective and efficient with your time. Not only does it provide you access to a rich library of additional tools and capabilities, over and above what a standard user may have access to, it can also be used to integrate with some of the Microsoft other Office applications such as Outlook, Word and MS Access.  </p>  <ul style=\"\">  \t<li style=\"\">So, who should take this course?</li>  \t<li style=\"\">Anyone who wants to learn how to be a proficient VBA programming</li>  </ul>  <p style=\"\">  \t   Anyone who wants to learn how to effectively utilize the tool to solve and automated manual tasks  </p>  <p style=\"\">  \t   In this course you will learn some of the fundamental concepts of the VBA programming language. Not only does this course include a review of the basic concepts and key functionality available within this rich programming language such as the IF, Select Case and Loop Statements, you will also learn how to design and develop your own custom objects using the concepts of object orientated programming through the use of class modules.  </p>  <p style=\"\">  \t   This course starts off with a brief refresher on the basic concepts of the VBA programming language and a review of the VBA Editor, the development environment that we will use during this course.  </p>  <p style=\"\">  \t   This program also includes a number of practical examples, to help demonstrate how to effectively utilize the concepts that you have covered during this course. This course includes the key concepts and practical examples of the following VBA statements and functionality:  </p>  <ol style=\"\">  \t<li style=\"\">IF Statements</li>  \t<li style=\"\">Loop Statements (For Next, Do While, Do Until)</li>  \t<li style=\"\">Exit Statements</li>  \t<li style=\"\">Goto Statements</li>  \t<li style=\"\">Select Case Statements</li>  \t<li style=\"\">Enumeration Data Types</li>  \t<li style=\"\">The DoEvents Statement</li>  \t<li style=\"\">Macros</li>  \t<li style=\"\">Arrays (declaring, re-initializing, auto populating and deleting arrays)</li>  \t<li style=\"\">Error Handling</li>  \t<li style=\"\">Standard Excel Objects</li>  \t<li style=\"\">Functions and Procedures</li>  \t<li style=\"\">Passing Values To Functions By Value</li>  \t<li style=\"\">Passing Variables to Functions By Reference</li>  \t<li style=\"\">Advance String Manipulation using the Trim, LTrim, RTrim, Left, Right, Instr and InstrRev Statements</li>  \t<li style=\"\">User forms</li>  \t<li style=\"\">Classes / Custom Objects</li>  \t<li style=\"\">Variable Declaration And Scope</li>  </ol>  <p style=\"\">  \t   We finish the training course by reviewing additional practical examples of how to apply the key concepts that we have reviewed during this course. In total, this course provides approximately <strong style=\"\">9 hours</strong> of course videos, including practical files and examples to help you become a proficient and effective programming.  </p>", 
    "end_date": null, 
    "title": "A beginner’s and intermediate guide to VBA programming", 
    "price": "20.00", 
    "instructors": "Francois Barnard", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/160402_e123_2.jpg", 
    "course_url": "https://www.udemy.com/a-beginners-and-intermediate-guide-to-vba-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-09T02:39:00Z"
}