{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Əgər təhsil bazarına baxsaq, ACCA kurslarının hansı qiymətə olduğunu aşkar görərik. Buna həm yerli bazardakı kurslar, həm də onlayn xarici kurslar aiddir. Mənim fikrimcə, hamı ACCA F3 kursuna asan keçid əldə etməlidir, çünki bu mühasibin yetişməsində ilk addımdır. Lakin, belə imkan demək olar ki, yoxdur. Bunu nəzərə alaraq, belə qərara gəldim ki, özüm bu kursu yaradım və tələbələrin istifadəsinə verim.<br></p>\n\n<p>ACCA F3 Tam Kursu tələbələrin istəyini nəzərə alaraq Azərbaycan dilində hazırlanıb. ACCA imtahanları İngilis dilində keçirildiyi üçün kurs boyunca terminlərdən hər iki dildə istifadə olunub. Bu tələbələrə həm mövzunu başa düşməyə, həm də imtahana hazırlaşmağa kömək məqsədi güdür. Nəzərinizə onu da çatdırım ki, kurs üçün qeydiyyatdan keçən zaman bu kursa ömürlük üzvlük əldə edirsiniz.</p>\n\n<p>Aydındır ki, ACCA daim inkişaf edir və hər il imtahanın mündəricatında yeniliklər təqdim edir. Bunu nəzərə alıb, mən də vaxtaşırı kursa yeni videolar və materiallar əlavə edəcəm. Belə yenilikər daimi olaraq sizin istifadənizdə olacaq.</p>\n\n<p>Kurs ərzində hansı mövzunu kifayət qədər aydın formada izah etmədiyimi fikirləşsəniz, bunu mənim nəzərimə çatdırmağı sizdən xahiş edirəm. Belə ki, keyfiyyəti daim artırmaqla həm sizə daha yaxşı kurs təqdim etmiş oluram, həm də tələbələrin imtahandan keçid nəticələrini müsbət istiqamətdə inkişaf etdirmiş oluram.</p><p><u>Yeni</u>: Uzun müddət ödənişsiz təklif elədiyim bu kursu indi ödənişli statusa keçirmək qərarına gəldim. Bu addımı, həqiqi ACCA tələbələrini cəlb etmək, kursun keyfiyyətini artırmaq və davamlı olaraq kursu yeniləmək məqsədilə atdım. Qeyd edim ki, müxtəlif sosial şəbəkələrdə endirim linklərini vaxtaşırı bölüşəcəm. Uğurlar!<br></p>", 
    "end_date": null, 
    "title": "ACCA F3 Financial Accounting - Tam Kurs", 
    "price": "45.00", 
    "instructors": "Anar Heydarli, ACCA", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/376546_411e_3.jpg", 
    "course_url": "https://www.udemy.com/suretli-excel-pivot-cedvelleri-ve-qrafikleri/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-23T21:05:31Z"
}