{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Imagine a Monday morning.</strong> You've just gotten in the office, said your \"<em>Hellos</em>\", your \"<em>How </em><em>was your weekends</em>\", and you sit at your desk and start your computer. </p><p>You push your cup of green tea, or coffee to the side.  You start up Access, and you pause.</p><p>You have data to enter, or reports to run and e-mail, or both.</p><p>Maybe you need to write queries.</p><p>If you have ever hesitated because you thought it would take too long, or it was just too cumbersome, you might be surprised on the amount of time that can be saved, the data entry errors that will never happen, with the knowledge of just a few tips and tricks.<br></p><p><strong></strong></p><p><strong><br></strong></p><p><strong> Here's how to get started:</strong></p><p>Do you or your co-workers use Microsoft Excel, but need your data imported into Access?<br>Take a look at Section 2: Tables.</p><p>Are users entering in data that is not appropriate for the fields, or do they need extra help knowing what data to enter?<br></p><p>Do you want to create drop-down boxes that display information based off of data in another drop-down box?<br><br></p><p>This course will show you how.</p><p>Grouping, totaling, and setting page breaks for reports in Access can, at times, be difficult.<br>Watch the lectures in Section 4: Reports to help you.</p><p>From wildcards, to parameter queries, to action queries, go beyond the basics with Section 5: Queries.</p><p>Macros will save you time with Access databases.  Get an introductions to the Macro Builder Window, and learn to create a few macros in Section 7.</p><p>Learn how to help users quickly navigate to the tables, forms, and reports that they need most by completing the lectures in Section 8: Start up &amp; Navigation.</p><p>Maintenance is so important to the life of your database, so take a look at Section 9, for an introduction to the tools that you need to know to keep your database running smoothly.</p><p><br></p><p>This course can be completed in hours, but the information can last a lifetime.</p><p>So if you are beyond the beginner stage in Access, and want a convenient way to learn Access Tips &amp; Tricks, I invite you to enroll.</p><p>This is not an advanced Access course, though advanced users are welcome, and might benefit from lectures within the course.</p><p>Take a look at the course curriculum to help decide if this informative, easy-to-follow course is for you.</p><p>You can only <strong>GAIN MICROSOFT ACCESS DATABASE SKILL</strong><strong>S.</strong><br></p><p>So <strong></strong><strong>Click The Take\nThis Course Button On The Right &amp; I'll See You In Class!</strong><strong></strong></p>", 
    "end_date": null, 
    "title": "Access Tips: Time Saving Access Questions Answered", 
    "price": "20.00", 
    "instructors": "IsáBel Harrison", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554478_6a72_5.jpg", 
    "course_url": "https://www.udemy.com/access-2013-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T15:48:19Z"
}