{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p> You've been shown many VBA techniques in my other courses and even a complete system in the Intermediate course, but this is much more than that!  By adding subforms, this <strong>FULLY FUNCTIONING SYSTEM</strong> is ready to use RIGHT NOW as a demo to solicit business or impress your boss.  The system is much more flexible and could easily be used to quickly create powerful custom systems.</p><p>Believe me, when a business owner or boss takes a look at this demo, they will be more than impressed!  They will be ready to HIRE YOU to do the job!</p><p>So take what you learned in the Intermediate Access VBA Course to a level that is probably far beyond what you thought was possible.  This course takes the Prototype System introduced in the Intermediate VBA course to a much higher level by adding the ability to incorporate <u><strong>unlimited subforms!</strong></u>   </p><p>I spent a <em><u>solid month of programming</u></em> greatly expanding this system while, at the same time, making it simpler to work with!  I'm pretty happy with the way it turned out and I think you will be too!</p><p>Restrictions like having your form have the same name as the recordsource table are GONE, and you can name the List form anything you want.  You can add unlimited subforms to your main form and use any or all of them in search!  Best of all, now you can save your searches! </p><p>To help make saved searches more valuable, two new Date Criterias have been added: MTD and YTD.  Put one of these into your criteria and the search will automatically calculate the date from the beginning of the month or year through today, every time you run the search!  </p><p>Searches can be setup with criteria on just one of your subforms, or all of them or any combination of the main form and subforms.  Save the search with a descriptive name and then retrieve it at any time.  You can also have an unlimited number of main forms and have searches running in ALL of THEM AT THE SAME TIME!  If you close the database without ending the searches, they will all be there when you open the database again!</p><p><span></span>The database you receive as a download with this course is a new and improved version of the \"prototype\" database I have used for years to attract new clients.  I call this system the CLOSER because, after viewing the demo, the only question is \"When can you start?\"</p><p>Follow along as I take you step by step through the inner workings of this radically improved database.  We will cover VBA syntax that is far beyond what you thought possible with subforms.</p><p>This system contains all the code and capabilities from the Intermediate system, but also shows you how to :<br></p><ol><li>Make the menu buttons change color when you move the mouse over them.</li><li>Create \"Quick Search\" pulldowns that integrate with the regular search.</li><li>Use the prototype form to quickly setup an existing form to have all the functionality of the Customer form in the course.</li><li>Easily add unlimited subforms to your main form and have them work in search also.</li><li>Use all the search criteria methods from the Intermediate course within your subforms.</li><li>Save an ulimited number of searches on each of your main forms.</li><li>Remove or modify saved searches easily.</li><li>Use the new MTD and YTD criteria in any main form or subform date field.</li><li>Understand the tables that search automatically creates for you.</li></ol><p>If you take the time to master doing a demo with this database, you will instantly impress potential clients with your capabilities.</p><p>There will be no question of your computer background or certifications - this database provides your credibility. In fact I usually tell prospective clients that I have <strong>ZERO computer education and NO certifications</strong>, THEN I demo this system. <strong>BANG! </strong><u>New Client almost every time!</u></p><p>For a visual walk through of the prototype database, view the previews in the first section.</p><p><strong>From a Student Review -</strong></p><p><em>\"This course is real value for money. I have learned a lot of new skills!\" - Johan Kritzinger</em></p><p>Once you have done that, clicking the <strong><u>Take This Course</u></strong> button is the logical next step in your VBA journey. Exporing this system will <u>expand your abilities</u> with VBA <u>faster than anything else</u> you could possibly do. Think of it! In just HOURS you could be ready to go find your first client!</p><p><strong>Intended Audience:</strong></p><p>This course assumes that you have either gone through my <em>\"Access VBA Intermediate\"</em> course and know the basic way the Prototype system and its menus work.  </p><p><strong>Course Requirements:</strong><br></p><p>You should have Office 2010 or later. The course was created using Office 2010.</p>", 
    "end_date": null, 
    "title": "Access VBA Advanced: Power Search with Subforms", 
    "price": "40.00", 
    "instructors": "Bruce Myron", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711216_d8ae_2.jpg", 
    "course_url": "https://www.udemy.com/access-vba-tutorial-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T21:46:42Z"
}