{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Take your basic knowledge of Access VBA to an <u>entirely new level!</u>  You've built many useful VBA programs in my first Visual Basic course, but this is your opportunity to work with a <strong>FULLY FUNCTIONING SYSTEM </strong>that is <u>ready to install</u> <strong>RIGHT NOW!</strong><strong></strong><br></p><p><strong>From a Student Review -</strong></p><p><em>\"The content is really excellent, and comprehensive. The content has really brought to light many techniques that I am finding extremely useful. I am really looking forward to the advanced course!. Many thanks, Bruce!</em><em>\" - Ray McConaghy</em><br></p><p>Once you have been exposed to Access VBA a logical next question is <em>\"What could I create with VBA?\"</em>.  This course will give you an answer to that question by providing you with a finished system that you can <u>start using right away</u>.  Rather than lead you through building parts of databases, this course examines the workings of this finished database that I have used in my consulting business for years.</p><p>Most of the employees in my client businesses <u>know nothing about Access</u> and the ribbon and navigator are always hidden, yet these people usually get more work done faster than experienced Access users!  For instance, they don't have access to the filter functions on the ribbon, but they can quickly do searches using the \"Power Search\" programs in this database that would be challenging for anyone using the ribbon.<br></p><p><strong>Another Review -</strong></p><p><em>\"If you are like me wanting to get a better understanding of the power of VBA in Access, then this is the course for you! Bruce is a Guru when it comes to VBA in Access. This course provides a fully developed system and then takes it apart to show how it works. I am having a lot of fun in analysing the code behind the various forms so that I can use it it in other programs. Bruce has an engaging style of presenting and he clearly explains the steps involved. Highly recommended!\" - John Ovens</em></p><p>The database you receive as a download with this course is my \"prototype\" database that I built over the years after realizing that, no matter what the client or the job, there were a lot of very similar things that had to be done with the data.  Why not have a database that does these things to start with, instead of building databases from scratch every time?<br></p><p>As I built up the prototype, I realized that it could also be the \"closer\" for new clients!  I could use it to establish my credibility and also explain that I had built up an extensive \"library\" of programs that were contained in this system.  With new clients, I found I could easily charge $500 when starting their first project for their access to this library of programs.</p><p>After more than ten years of billing $50,000 to $60,000 per year to clients who started with this prototype system, I realized that it had helped me create over a <u>half million dollars of consultant income!</u></p><p>In preparation for this course, I have thoroughly reviewed the prototype database and updated it using Access 2013 and the database is usable by Access 2007 or later.</p><p>Inside the course I will show you a different approach to take with menu buttons and how you can setup the \"Power Search\" for any table in just a matter of minutes!  You will also learn how to, with one click, create <u>merge letters in Word</u> with the search results or how to <u>create and title a new Excel sheet</u>.</p><p>Follow along as I take you step by step through the inner workings of this simple to understand, yet very powerful platform that is very understandable to any prospective client, whether they are computer savvy or not.</p><p>This system contains all the code to:</p><ol><li>Provide a simple to understand and use menu system that can be used with the mouse or keyboard.</li><li>Control the proper addition, editing and deletion of records.</li><li>Quickly sort and locate records based on any item of data.</li><li>Instantly create letters and/or envelopes for the displayed record using Microsoft Word with two keystrokes.</li><li>Allow the user to do highly complex searches without knowing anything about Access.</li><li>Instanly Create reports based on those searches with complete descriptions in the title.</li><li>Export search results to a new Excel spreadsheet, then format and title it, with just a two keystrokes.</li><li>Create a merge document in Word with the search results for bulk mailing.</li><li>Allow you to add all these functions to an existing form in less than one minute.</li></ol><p>If you take the time to master doing a demo with this database, you will instantly impress potential clients with your capabilities.</p><p>There will be no question of your computer background or certifications - this database provides your credibility.  In fact I usually tell prospective clients that I have <strong>ZERO computer education and NO certifications</strong>, THEN I demo this system.  <strong>BANG! </strong> <u>New Client almost every time!</u></p><p>For a visual walk through of the prototype database, view the previews in the first section.</p><p><strong>From a Student Review -</strong></p><p><em>\"This course is real value for money. I have learned a lot of new skills!\" - Johan Kritzinger</em></p><p>Once you have done that, clicking the <strong><u>Take This Course</u></strong> button is the logical next step in your VBA journey.  Exporing this system will <u>expand your abilities</u> with VBA <u>faster than anything else</u> you could possibly do.  Think of it!  In just HOURS you could be ready to go find your first client!</p><p><strong>Intended Audience:</strong></p><p>This course assumes that you have either gone through my <em>\"VBA for Non-Programmers\"</em> course or you are already familiar with VBA. BUT, the system <em>could</em> be used (but not modified) by <u>anyone</u> that can follow the video instructions for setting it up.  </p><p><strong>Course Requirements:</strong></p><p>You should have Office 2010 or later. The course was created using Office 2010.</p>", 
    "end_date": null, 
    "title": "Access VBA Intermediate: Power Search & Word or Excel Export", 
    "price": "30.00", 
    "instructors": "Bruce Myron", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607152_4028_2.jpg", 
    "course_url": "https://www.udemy.com/access-vba-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T18:01:38Z"
}