{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">La herramienta más conocida de apoyo a la gerencia de proyectos, Office Project, es también una de las menos aprovechadas y comprendidas.</em>  </p>  <p style=\"\">  \t<em style=\"\">Para muchas personas, Office Project es una herramienta para “pintar” cronogramas y mostrarlos de una manera profesional; es así, como hemos conocido compañías en las que la única licencia está en el departamento comercial, donde hacen los cronogramas para presentar a clientes. Para muchas otras, sólo es una manera de actualizar “las malas noticias” de un proyecto.</em>  </p>  <p style=\"\">  \t<em style=\"\">Office Project es realmente un gran apoyo a la gestión en un proyecto y es por eso que Projectical Ltda. se ha enfocado, desde sus inicios en capacitar a personas y compañías en el mejor uso y aprovechamiento de esta poderosa herramienta. </em>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \tEste curso se centra en la forma más eficaz y eficiente de usar MS Project 2010 para administrar proyectos, alineando el uso de esta poderosa herramienta, con las mejores prácticas de gerencia de proyectos.  </p>  <p style=\"\">  \tSe incluyen más de 6 horas de capacitación en video que te llevarán paso a paso, desde conocer la interfaz de MS Project 2010 hasta controlar un proyecto completo, pasando por la configuración de la herramienta y la planeación del mismo.  </p>  <p style=\"\">  \t<strong style=\"\">Testimonios</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \tExcelente el Curso y en mi caso muy oportuno. Muchas Gracias.  </p>  <p style=\"\">  \tSergio M.  </p>  <p style=\"\">  \tMuy buen cursoMuchas gracias! definitivamente el Ms. Project es una gran herramienta.  </p>  <p style=\"\">  \tAlex M.  </p>  <p style=\"\">  \tMuy recomendable cursoUn curso excelente, me he quedado con ganas de más, sobre todo la implementación en MS Project del Análisis de Valor Ganado. Gracias  </p>  <p style=\"\">  \tM. Socorro G.  </p>  <p style=\"\">  \tMuchas gracias por tan excelente curso, muy claro el contenido.  </p>  <p style=\"\">  \tMarcela C.  </p>  <p style=\"\">  \tExcelente cursoBien orientado  </p>  <p style=\"\">  \tFrank B.  </p>  <p style=\"\">  \tMuy buen cursoMuy interesante y dinámico.  </p>  <p style=\"\">  \tSergio H.  </p>  <p style=\"\">  \tExcelente cursoClaro, concreto, sencillo...muy didáctico.  </p>  <p style=\"\">  \tJorge O.  </p>  <p style=\"\">  \tFelicitaciones un curso ExcelenteUn desarrollo muy claro del contenido. Muy valioso el aporte para mi. Ahora a aplicarlo. Gracias a los creadores de este curso y felicitaciones.  </p>  <p style=\"\">  \tÁngel P.  </p>  <p style=\"\">  \tMuy bueno el curso!Ya tenia experiencia en trabajar con la versión 2007, me gusto este al ver las nuevas herramientas.. y el tema del valor ganado se me complica un poco pero como dijeron los compañeros en el video, se debería tener en cuenta en todo proyecto para que el mismo Project manager lo gestione.. es cuestión de practica! Felicitaciones!  </p>  <p style=\"\">  \tLuz Stella P.  </p>  <p style=\"\">  \tExcelente curso!!!Excelente curso, de verdad muy bueno. 100%% recomendable. Tenia algunas dudas que las solvente con el curso. Y el fin primordial que es administrar con MS Project 2010, es muy bueno. Muchas cosas de la herramienta que desconocía. Saludos.  </p>  <p style=\"\">  \tRodolfo M.  </p>  <p style=\"\">  \tFelicitaciones por el CursoQuiero felicitar a los creadores del curso porque sinceramente fue muy didáctico y completo. La gestión del valor ganado fue muy completa.  </p>  <p style=\"\">  \tGerardo Martín G.  </p>  <p style=\"\">  \tExcelente curso!!!Definitivamente es un excelente curso! muy didáctico y útil, aun siendo a nivel básico el grado de enseñanza es muy alto, aprendí en este curso mas de lo que aprendí en la universidad.  </p>  <p style=\"\">  \tLuís Manuel C.  </p>  <p style=\"\">  \tBuen cursoAcabo de terminar el curso y en términos generales me ha parecido muy bueno. Esta bien estructurado, las explicaciones son claras, la dicción es buena y las diapositivas son didácticas. Excelente curso. Muchas gracias.  </p>  <p style=\"\">  \tJuan Carlos V.  </p>  <p style=\"\">  \tMuy buen cursoYo llevo trabajando con el MS Project desde hace un tiempo y el curso me sirvió para conocer algunos atajos interesantes, pero por sobre todo me resultó de muchísima utilidad toda la parte de Recursos donde no tenía idea de como utilizarla correctamente. Lo de la productividad de los Recursos &quot;Work&quot; fue algo completamente nuevo para mi. Un excelente y muy ameno curso  </p>  <p style=\"\">  \tLeandro S.  </p>  <p style=\"\">  \tMauricio felicitaciones por este material, el curso que brindas es de mucha calidad, presentas los temas con mucha claridad y un manejo total de los contenidos. gracias por este valioso material  </p>  <p style=\"\">  \tNelson B.  </p>  <p style=\"\">  \tExcelente curso, permíteme felicitarte por tu curso &quot; Administre Proyectos con MS Project 2010&quot; realmente ha sido muy bueno, me ha permitido repasar aspectos básicos, ha sido muy didáctico al momento de explicar los detalles, son muy pocos lo que lo vinculan y te enseñan a usar y a entender una curva de Valor Ganado, por lo que ha sido una muy agradable experiencia, un saludo Mauricio y muchas gracias por este gran aporte.  </p>  <p style=\"\">  \tEdson Miguel M.  </p>  <p style=\"\">  \tExcelente CursoEstimado te felicito por tu curso &quot; Administre Proyectos con MS Project 2010&quot; realmente ha sido muy bueno, muchas gracias  </p>  <p style=\"\">  \tAlonso Omar V.  </p>  <p style=\"\">  \tMuy buen cursoSaludos, permíteme felicitarte por tu curso &quot; Administre Proyectos con MS Project 2010&quot; realmente ha sido muy bueno, me ha permitido repasar aspectos básicos, ha sido muy didáctico al momento de explicar los detalles, por lo que ha sido una muy agradable experiencia, un saludo Mauricio y muchas gracias por este gran aporte.  </p>  <p style=\"\">  \tErnesto Z. G.  </p>  <p style=\"\">  \tExcelente CursoEstimado Mauricio M. Lo felicito su curso &quot;Administre Proyectos con MS Project 2010&quot; ha sido muy bueno, he repasado y aprendido mucho, es bastante didáctico explicando todos los detalles, comencé ayer en la noche y lo he terminado hoy en la noche, es una grata experiencia muy recomendable, un saludo desde Perú a usted y muchas gracias.  </p>  <p style=\"\">  \tAlexander Roberto R. F.  </p>  <p style=\"\">  \tMuy bien explicado! y lo más importante: con muchos tips para trabajar en la práctica con este programa! El autor maneja muy bien los conceptos del PMI y los aplica en el manejo de esta herramienta. Lo único que me gustaría es que dejara ejercicios con respuesta para uno comprobar que ha comprendido y que puede aplicar lo visto.  </p>  <p style=\"\">  \tY esperando.. el curso de Project avanzado!  </p>  <p style=\"\">  \tSonia A.  </p>  <p style=\"\">  \tExcelente material, muy buen curso, lo recomiendo 100%  </p>  <p style=\"\">  \tHe leído algunos libros de MS Project y la verdad por tiempo no los he terminado. Este curso me sirvió para ir a lo medular de la aplicación y en un tiempo muy reducido he visto conceptos, en la práctica, que equivalen a todo lo que he leído básicamente. Esta muy bien estructurado, Mauricio realmente es un gurú en el tema, explica muy bien, lo justo y necesario. Ahora estoy esperando el nuevo curso de MS Project avanzado, espero que salga pronto.  </p>  <p style=\"\">  \tRodrigo  </p>  <p style=\"\">  \tExcelente  </p>  <p style=\"\">  \tMuy buen trabajo de selección de ejemplos, material y explicaciones para manejar el Project en la planeación de proyectos  </p>  <p style=\"\">  \tMiguel Ángel C.  </p>  <p style=\"\">  \tGran Curso  </p>  <p style=\"\">  \tBuenas noches, fue una grata experiencia, en mi opinión la mejor parte fue la sección 5 y 6, aunque todo el curso fue muy útil. Lo estaré consultando continuamente.  </p>  <p style=\"\">  \tLuís H.  </p>  <p style=\"\">  \tExcelente curso!  </p>  <p style=\"\">  \tGracias por la información brindada en el curso. Excelente aporte y profundización en los diferentes temas y funcionalidades del Project.  </p>  <p style=\"\">  \tHugo Alberto P.  </p>  <p style=\"\">  \tExcelente el Curso!! Muy buena presentación y contenido!  </p>  <p style=\"\">  \tAntes he realizado un curso de Project Manager con el Método del PMI y luego otro con el PM4R del BID, y ahora con esta herramienta los puedo poner en práctica ágilmente!! Muchas gracias!!  </p>  <p style=\"\">  \tAtilio Z  </p>  <p style=\"\">  \tExcelente... a por mas!  </p>  <p style=\"\">  \tExcelente curso, de verdad muy bueno. 100%% recomendable. Tenia algunas dudas que las solvente con el curso. Y el fin primordial que es administrar con MS Project 2010, es muy bueno. Muchas cosas de la herramienta que desconocía. Saludos.  </p>  <p style=\"\">  \tRodolfo M.  </p>  <p style=\"\">  \tExcelente curso!!!  </p>  <p style=\"\">  \tDefinitivamente es un curso muy didáctico y útil, yo he utilizado hasta ahora el Microsoft Project únicamente a nivel básico, tal como me enseñaron en la universidad, sin embargo este curso a pesar de ser un nivel inicial es muy completo y te detalla todas las características de la versión 2010, la cual se vuelve una herramienta indispensable para aquellas personas que tenemos a cargo la ejecución de un proyecto. Muchas gracias Mauricio por todos los conocimientos impartidos!  </p>  <p style=\"\">  \tLuis Manuel C. F.  </p>  <p style=\"\">  \t<strong style=\"\">Estructura del Curso</strong>  </p>  <p style=\"\">  \tEl curso se estructura de una manera completamente práctica, con los siguientes grupos de temas:  </p>  <ul style=\"\">  \t<li style=\"\">Navegación por Ms Project 2010</li>  \t<li style=\"\">Configuración inicial y empresarial</li>  \t<li style=\"\">Inicio del proyecto</li>  \t<li style=\"\">Planeación del proyecto</li>  \t<li style=\"\">Ejecución y control del proyecto</li>  \t<li style=\"\">Gestión con Valor Ganado en MS Project 2010</li>  </ul>  <p style=\"\">  \tEl curso te otorga 8 PDUs para mantener tu certificación ante el PMI.  </p>  <p style=\"\">  \tObserva los objetivos a continuación para conocer qué aprenderás y qué habilidades desarrollarás con este curso.  </p>", 
    "end_date": null, 
    "title": "Administre Proyectos con MS Project 2010", 
    "price": "20.00", 
    "instructors": "Mauricio Morales", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44636_7951_7.jpg", 
    "course_url": "https://www.udemy.com/project2010basico/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-04T05:02:16Z"
}