{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Updated material to include latest advanced Statistical functions in EXCEL 2013<br></strong>This course has been updated to include the latest advanced statistical functions in EXCEL 2013.  It provides you with a vast array of analytical tools to handle most </p><p>The course is about using the advanced statistical functions in EXCEL for data analysis and analytics projects.<br>You will learn how to effectively use <strong>Advanced  Excel Statistical Functions</strong> about the Normal distribution, Student-t  distribution, chi square distribution, F distribution, Gamma, Log-normal,  Negative Binomial, Exponential, etc.<br>You will learn how to calculate the margin of  errors and use them to  create confidence intervals. In addition, you will learn how to create Standard Normal tables as well as Student t  tables.<br><br>This course is very well illustrated with lots of practical illustrations and quizzes to help you grasp the concepts of each function and understand them in a practical way.  Excel files and screenshots are provided to make the understanding of the lectures very easy.<br>Depending on the prior preparation, this course can be completed in one month or less.  <br><strong>Taking this course</strong> will provide you with a rich array of advanced analytical tools that can be used for educational and professional work.<br></p>", 
    "end_date": null, 
    "title": "Advanced Statistics functions in EXCEL 2010-2013 (Part 2)", 
    "price": "40.00", 
    "instructors": "Luc Zio", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44910_565e_5.jpg", 
    "course_url": "https://www.udemy.com/advanced-statistical-functions-in-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-06T03:15:43Z"
}