{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><em>Do you want to achieve transformational knowledge in Excel? Want to recognize yourself a professional level Excel user? Then you have to solve Excel problems regularly. There is no other way, believe me. This is the course I have designed to solve your day to day problems and others will learn from your problems.</em><br></p>\n\n<p>DO NOT WASTE YOUR TIME and MONEY! Enroll into this most comprehensive Microsoft Excel 2013 training course.</p>\n\n<p>The satisfaction with this course is guaranteed.<br></p>\n\n<ul><li>30 Days FULL REFUND of your money is guaranteed if you are not satisfied with this course. If you really want to be a Pro user of Excel, just take this course. Nothing to lose. If you don't like the course, you will get FULL REFUND.</li><li>You will get LIFETIME ACCESS to this course. So, you will be able to re-take this course for unlimited times.</li></ul>\n\n<p><em>---------------------------------------------------------------------------------------------------</em>-------------------------------------------------<br></p>\n\n<p>In this course, we shall solve problems in almost all the problems except the VBA problems. I am mentioning some of the Excel categories here:</p>\n\n<ul><li>Excel environment.</li><li>Manage Excel workbook and worksheets</li><li>Enter and Edit data in a worksheet.</li><li>Excel cells and ranges.</li><li>Essential workbook and worksheet operations.</li><li>Excel tables and structured references.</li><li>Formatting worksheets.</li><li>Advanced features related to Excel files.</li><li>Excel templates.</li><li>Setup and print Excel worksheets.</li><li>Functions and formulas.</li><li>Mathematical functions.</li><li>Excel charts.</li><li>Conditional formatting.</li><li>Excel security.</li><li>Graphic Objects.</li><li>Data validation techniques in Excel.</li><li>Excel as a database.</li><li>Excel Pivot Tables</li><li>What if analysis</li><li>Goal seek and Excel Solver</li></ul>\n\n<p><em>---------------------------------------------------------------------------------------------------</em>-------------------------------------------------<br></p>\n\n<p>By Enrolling into this course:<br></p>\n\n<ul><li>You will learn Microsoft Excel with practical examples and case studies.</li><li>You will master all the Excel keyboard shortcuts one by one.</li><li>You will master good command over the Excel functions and formulas.</li><li>You will solve Excel problems with great efficiency.</li><li>You will get your Excel problems solved by the instructor.</li><li>You will get support from the instructor within 24 hours!</li><li>You will get 220+ Excel Keyboard Shortcuts PDF, 102 Excel functions cheat sheet.</li></ul>\n\n<p>...want more? JOIN THE COURSE. Your any suggestion will be highly appreciated to make it the best Excel related course.</p>\n\n<p><em><em>---------------------------------------------------------------------------------------------------</em>-------------------------------------------------<br></em></p>\n\n<p>About the instructor of this course:</p>\n\n<p>The instructor of this course has extensive experiences in Excel, Excel VBA and .NET frameworks:</p>\n\n<ul><li>The author of this course has a Computer Science and Engineering degree from the topmost university in his country.</li><li>He is a dedicated full-time Excel, Excel VBA and Business Analytic blogger.</li><li>He has a teaching experience of 18 years.</li><li>He learns new things in Excel, Excel VBA and Business Analytic regularly and shares free tutorial on his blog.</li><li>As a full-time Excel, Excel VBA and Business Analytic blogger, he will be here or on his blog with your every problem.</li><li>As a consultant in many Excel projects, he has vast knowledge on real-life Excel problems.</li></ul>\n\n<p>So, learn Excel from someone who loves Excel and Excel VBA, who lives with Excel and Excel VBA 365 days a year, who learns new things in Excel regularly, who runs a blog on Excel and who loves teaching. You need a full-time instructor, not an instructor who just creates a course and then flies away.</p>", 
    "end_date": null, 
    "title": "Advanced Excel Training Course: Learn Excel with Problems", 
    "price": "20.00", 
    "instructors": "Excel Academy", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364838_21bf_2.jpg", 
    "course_url": "https://www.udemy.com/advanced-ms-excel-training-course-learn-excel-with-problems/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-06T21:15:35Z"
}