{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t    In this software training course from ClayDesk, you will learn <strong style=\"\">advanced skills</strong> in using <strong style=\"\">Microsoft Word 2013</strong>, and be able to demonstrate the use of advanced and specialized features within the application. You should be able to create, manage, and distribute professional documents for a variety of specialized purposes and situations, and be able to customize Word 2013 environment to meet specific needs to enhance productivity.  </p>  <p style=\"\">  \t    After a quick overview of Word 2013, you will start with how to manage and share documents, preparing documents, set tracking options, advanced editing features, protecting and designing advanced documents, applying advanced formatting and styles. Finally, you will learn shortcuts along with several quizzes to fully prepare you from not only the examination point of view, but acquire skills, giving you a competitive edge.  </p>  <p style=\"\">  \t    This comprehensive tutorial covers all aspects and prepares you to take the Microsoft Office Specialist (MOS): <strong style=\"\">Microsoft Office Word 2013 Expert certification exams</strong> 77 – 425 (Part 1) and 77 – 426 (Part 2). In addition, the American Council on Education (ACE) has reviewed and recommended college credit for selected Microsoft certifications. Approved certifications are eligible for one to six semester hours of <strong style=\"\">college credit</strong> in bachelor’s degree or associate degree classes on computer applications, information technology, or computer information systems. The Accreditation Program helps your students achieve employability and academic goals, as well as bridging the gap between workforce training and the classroom.  </p>  <p style=\"\">  \t    By the completion of this training video, you will be comfortable with using advanced features of Word 2013 and <strong style=\"\">feel confident</strong> performing your work in an efficient manner. For those who already have a good grounding in Microsoft Word, this course will provide you with the knowledge and skills to use Word 2013 at an expert level.  </p>", 
    "end_date": null, 
    "title": "Advanced Microsoft Word 2013 Tutorial", 
    "price": "20.00", 
    "instructors": "Syed Raza", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321564_6894_4.jpg", 
    "course_url": "https://www.udemy.com/claydesk-advanced-microsoft-word-2013-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-17T14:37:28Z"
}