{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">NEW Course to Help You </strong><strong class=\"redactor-inline-converted\">Build a strong foundation in Excel &amp; to solve complex problems fast - </strong><strong class=\"redactor-inline-converted\">Let me show you how</strong><strong class=\"redactor-inline-converted\">.</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Use my top 10 tips to save time</li><li>Learn the top 10 formulas for quick and dynamic analysis</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course updated on June 27, 2016 to include detailed downloadable PDF of the top 10 Tips &amp; Formulas - together over 90 pages! Now you can READ, WATCH or do BOTH!</strong><br></p>\n\n\n\n<p>The top 10 will increase your awareness of the most useful Excel features to work faster and smarter. Only when you know the extent and possibilities Excel offers you, only then are you able to handle any type of analysis with the best method.</p><p><strong class=\"redactor-inline-converted\">In Their Own Words:</strong></p><p><em class=\"redactor-inline-converted\">Carlo says: \"Excellent course featuring loads of easily understood content. It helped me become very competent and comfortable with pivot tables along with a host of other functionality. <strong class=\"redactor-inline-converted\">It's easily understood and also easy to follow. Instructor speaks clearly and explains things well, very helpful so the information is easily retained.</strong>\"</em><br></p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Sahar says: \"Very very helpful tips. <strong class=\"redactor-inline-converted\">Anyone who uses Excel should learns these to let them get more benefits of the embedded functionalities.</strong>\"</em></p><p><em>Steven says: \"Well explained, excellent material and topics. <strong>Definitely very helpful for my everyday work.</strong>\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Advanced Excel skills are highly relevant\nin business</strong>. No matter which role you’re currently in or you’re planning to\ntake on. Whether you’ll be in Finance, consulting, IT, in project management,\nyour advanced Excel skills will set you apart from the competition.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What is the difference between an Advanced Excel and Average Excel user?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>An advanced Excel user is aware of the tools and features available and can\napply the right tools for the right task, instead of relying on their go-to\ntools and making them work for every situation.  Advanced Excel users, always find the optimal solution for every task, and they find it fast!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What differentiates this Excel course from the others?</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The reason I created this specific Advanced Excel course, is because there are many advanced Excel users who are unaware key features &amp; formulas in Excel. I understand that when you take an Excel training it can be so broad, and a lot of courses cover too many topics. It’s easy to get lost. You might also not immediately appreciate why some features are useful and how you can practically apply them. We are creatures of habit and it’s difficult to get our head around learning new techniques. As a result you might be missing out on some features that can majorly simplify the way you use Excel.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Differentiation factor #1</strong></em></em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Focus </strong>- The top 10 brings focus to the key Excel features which will provide you with a solid &amp; a strong foundation in Excel.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Differentiation factor #2</strong></em></em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn by doing</strong> - This Advanced Excel course is well structured and organized. You can download my Excel Demo workbook which I use to demonstrate each feature and practice along with me. You can then do an exercise from the Excel Exercise workbook to test your knowledge. Real learning happens when you attempt to solve problems on your own. Answers are provided, but do ask any questions if you get stuck. Your questions will always be answered.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Differentiation factor #3</strong></em></em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Engaging </strong>- I have made every attempt to keep the course interesting and engaging by mixing talking head explanations with screencast demos. Each course is split by topic &amp; feature. This allows you to easily pick what you want to learn now or review later. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Summary</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My main goal in this training is to increase your awareness of the top tools and formulas in Excel to help you solve complex problems. Users are not aware of what they don’t know. Only when you know the extent and possibilities Excel offers you, only then are you able to handle any type of analysis with the best method.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Becoming advanced in Excel takes practice, readiness to learn new methods and willingness to apply these to practical cases. Take this course to get a head start!</strong><br></p>", 
    "end_date": null, 
    "title": "Advanced Excel: Top Excel Tips & Formulas", 
    "price": "25.00", 
    "instructors": "Leila Gharani", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/773214_f3b8_7.jpg", 
    "course_url": "https://www.udemy.com/advanced-excel-tips-formulas/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-24T18:54:23Z"
}