{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>COURSE UPDATE</strong></p><ul><li><strong>Updated May 2015</strong></li><li><strong>Over 250 active students</strong></li><li><strong>Join the 1% of Excel users who know how to use the most powerful features and tools in Microsoft Excel</strong></li></ul><b></b><p><em>Expert Guidance on Creating Amazing Reports and Data Analysis with Excel Pivot Tables - </em><em>This course is great in explaining how to create amazing reports and data analysis with Excel Pivot Tables. The structure of the course has been well planned - each lesson is presented with great clarity in a concise, right to the point manner - <em>Michael Choke</em></em></p><p><strong>Amazing Reports and Data Analysis with Excel Pivot Tables</strong></p>  <p>  \t    Create amazing reports and analyze data in minutes with Excel Pivot Tables. This course focuses on creating and understanding how to use Excel Pivot Tables to quickly analyze and understand your business data. Pivot Tables make it easy to compile management reports and generate new insight and intelligence from your data in minutes.  </p>  <p>  \t    This Excel Business Intelligence training course is for all business users who are required to develop management reports, analyze data or ask ad-hoc questions of their data.  McKinsey Consulting in a recent report entitled 'Big data: The next frontier for innovation, competition, and productivity' emphasizes that data skills will become the basis for competition, innovation, growth and productivity. The report also highlights the need for around 1.5 million managers in United States with data skills.  </p>  <p>  \t    This course has over 25 video lectures that take you step by step through creating management reports and analyzing data with a couple of clicks of the mouse. The course is structured into 9 sections which takes you from creating simple management reports to sophisticated data analysis.  </p>  <p>  \t    Learn techniques to easily aggregate your data, produce reports, understand trends, filter your data, create interactive reports and use sophisticated calculations.  </p>  <p>  \t    So begin your journey today with Excel Business Intelligence.  </p>", 
    "end_date": null, 
    "title": "Amazing Reports and Data Analysis with Excel Pivot Tables", 
    "price": "20.00", 
    "instructors": "Ian Littlejohn", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/255714_5341_9.jpg", 
    "course_url": "https://www.udemy.com/amazing-reports-and-data-analysis-with-excel-pivottables/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-04T17:08:23Z"
}