{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Join the 1% of Excel users who know how to use the most powerful features and tools in Microsoft Excel</strong>  </p>  <p style=\"\">  \t<strong style=\"\">    Excel Power View is a powerful new tool in Excel 2013 which will allow you to explore, visualize and present your data in ways you never knew possible.  </strong>  </p>  <p style=\"\">  \t              Learn to use Power View to create powerful interactive graphical dashboards.  Power View is an interactive data exploration, visualization and presentation experience that improves decision making and gives you strong insight in to your business.  </p>  <p style=\"\">  \t      Amazing Reports and Dashboards with Excel Power View is the second course to be released about Excel Business Intelligence.  The Excel Business Intelligence suite of tools includes PivotTables, PowerPivot, Power View, PowerQuery, PowerMap and PowerBI.  </p>  <p style=\"\">  \t    Excel Business Intelligence skills and capabilities are in high demand as companies are using Excel to analyze their business data to generate new intelligence and insight. McKinsey Consulting recently released a report showing that approximately 1.5 million new management job positions are required in the United States with data analysis skills and capabilities.  </p>  <p style=\"\">  \t            This course introduces you to the Excel Power View interface, teaches you how to create tables and graphs, learn to easily filter data and ask questions of your data, perform powerful data analysis and develop interactive dashboards.  </p>  <p style=\"\">  \t      The course also includes how to create relationships between between two tables of data and how to easily create reports and visualizations from both data sources using simple drag and drop actions.  The course teaches users how to easily create time based scatterplot and bubbleplot advanced visual analysis techniques.  </p>  <p style=\"\">  \t            This course is for any Excel user who develops management reporting or performs data analysis to gain new insight from data.  Excel Power View is only available in specific versions of Excel 2013 so first confirm that you have the correct version of Excel.  </p>  <p style=\"\">  \t            The course includes two downloadable training datafiles and currently has 23 video lectures showing how to use Excel Power View.  </p>", 
    "end_date": null, 
    "title": "Amazing Reports and Dashboards with Excel Power View", 
    "price": "20.00", 
    "instructors": "Ian Littlejohn", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256492_20aa_6.jpg", 
    "course_url": "https://www.udemy.com/amazing-reports-and-dashboards-with-excel-power-view/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-06T13:52:38Z"
}