{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t      Vous êtes frustré de perdre du temps avec Excel, alors que vous pourriez automatiser les tâches répétitives!  </p>  <p>  \t      Vous regrettez de ne pas savoir programmer en VBA, n’est ce pas ?  </p>  <p>  \t      Alors lisez la suite, elle peut vous intéresser !  </p>  <p>  \t      Ce cours est fait pour des non-informaticiens,et c'est une formation complète à l'apprentissage de VBA pour Excel.  </p>  <p>  \t      Vous apprendrez les bases de la programmation en VBA pour, par exemple, automatiser les tâches répétitives, écrire vos propres fonctions personnalisées, développer un formulaire ergonomique, ajouter vos propres boutons de contrôle dans le ruban, piloter Word.  </p>  <p>  \t      Cette formation a 2 objectifs :  </p>  <ol>  \t<li>Vous apprendre le langage VBA</li>  \t<li>Vous apprendre à programmer Excel</li>  </ol>  <p>  \t      Chaque leçon est constituée d’une vidéo d’environ 10mn, qui capture l’écran Excel du formateur, pendant l’exposé.  </p>  <p>  \t      Vous voyez exactement comment le programme est écrit, et vous pouvez ensuite expérimenter par vous-même.  </p>  <p>  \t      Certaines leçons se terminent par un sujet d’exercice, le plus souvent corrigé par le formateur dans la vidéo suivante.  </p>  <p>  \t      Excel2013 a été utilisé pour tourner les vidéos. Mais la totalité du contenu de cette formation est 100% utilisable avec les versions précédentes (2010, 2007, 2003)  </p>  <p>  \t      Pour suivre ce cours avec succès, il est indispensable de programmer par soi-même, de reprendre et expérimenter tous les programmes analysés dans les vidéos et de faire tous les exercices.  </p>", 
    "end_date": null, 
    "title": "Apprenez VBA et programmez Excel, 1er Niveau", 
    "price": "45.00", 
    "instructors": "Philippe Pons", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276754_2f41_5.jpg", 
    "course_url": "https://www.udemy.com/apprenez-vba-et-programmez-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-07T18:39:09Z"
}