{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Curso orientado a ser una formación significativa en MS Excel 2013 por medio de un camino práctico y eficiente para conseguir de forma rápida el aprendizaje esperado.</p><p>no se trata de un grupo de funciones para aprender, es una estructura sólida que paso a paso y sin darte cuenta dominarás esta herramienta en un tiempo récord.</p><p>\"Aprenderás de manera simple las herramientas de Excel que son necesarias para transformarte de principiante a experto de la Hoja de Cálculo, mejorando tus competencias y habilidades laborales\".</p><p>TEMAS</p><p><strong>Unidad I: Introducción</strong></p><p>Clase 1: ¿Qué es y para qué sirve Excel?</p><p>Introducción a la Hoja de Cálculo de Microsoft y sus enormes beneficios.</p><p>Clase 2: Conoce la Interfaz de Excel</p><p>Base fundamental para el correcto desarrollo del aprendizaje del curso.</p><p>Clase 3: Dentro de la Hoja de cálculo</p><p>Tus primeros grandes pasos para el dominio de esta herramienta.</p><p>Clase 4: Fuentes y Alineación                                                       </p><p>Mediante el desarrollo de un ejercicio aprenderás a utilizar comandos</p><p><strong>Unidad II: Gestionando la Hoja de Cálculo</strong></p><p>Clase 5: Personaliza tu Excel</p><p>Aprende a cambiar la configuración de tu Libro para tus propias necesidades, crea distintos libros con configuraciones personalizadas.</p><p>Clase 6: Conectando Libros </p><p>Aprende a vincular libros por medio de la creación de un Flujo de Caja que conectarás a otro para ofrecer solo una parte de la información.</p><p>Clase 7: Comparte y Protege tu Libro</p><p>Trabaja en Equipo con tu archivo en Excel, compártelo para que puedan trabajar más personas y aprende a protegerlo de manera eficaz.</p><p><strong>Unidad III: Trabajando con Eficiencia</strong></p><p>Clase 8: Edita tu Libro de Excel</p><p>Ya estás en condiciones de manejar fácilmente información en tu libro cambiando lo que necesites para realizar tu trabajo.</p><p>Clase 9: Trabajando con las Vistas de Libro. </p><p>Aprende a visualizar tu archivo dependiendo de lo que necesites realizar en un momento determinado.</p><p>Clase 10: ¿Trabajas con Mucha Información?</p><p>No te asustes, Excel está hecho justamente para trabajar con gran cantidad de información, toma al toro por las astas.</p><p>Clase 11: Agrupando Datos</p><p>Aprende a Esquematizar la Información como un experto.</p><p>Clase 12: Referencias</p><p>Conecta y vincula celdas para gestiones más óptimas.</p><p><strong>Unidad IV: Manejando Datos</strong></p><p>Clase 13: Validando Datos</p><p>Aprende a crear Listas Desplegables para mantener intacta la integridad de los Datos.</p><p>Clase 14: Ordenar y Filtrar</p><p>Utiliza herramientas para ordenar automáticamente y visualizar solamente lo que necesites sin la necesidad de ocultar filas ni columnas.</p><p>Clase 15: Fecha y Hora</p><p>Aumenta días y obtén la fecha exacta, calcula años, meses, días y horas de manera entretenida.</p><p>Clase 16: Conoce y Aplica Funciones para Texto.</p><p>Porque no solamente introduces números, maneja estas herramientas que serán de un apoyo increíble.</p><p>Clase 17: Búsqueda y Referencia</p><p>Sorpréndete con Funciones que no imaginabas que existieran.</p><p>Clase 18: Funciones Lógicas y de Información</p><p>Aprende a utilizar Funciones que te harán llegar al segundo nivel.</p><p>Clase 19: Asignando Nombres a Rangos</p><p>Asigna Nombres a un grupo de datos para trabajar con ellos de forma rápida y segura.</p><p>Clase 20: Creando tus Primeras Macros</p><p>Habilita la pestaña Desarrollador y crea tus primeras actividades automáticas.</p><p><strong>Unidad V: Analizando Datos</strong></p><p>Clase 21: Usando Funciones Matemáticas</p><p>¿Alguna vez te costaron las matemáticas? Mira que simple que es con Excel.</p><p>Clase 22: Características de Datos</p><p>Aprende a obtener información rápida de una gran cantidad de Datos.</p><p>Clase 23: Crea Tablas Dinámicas</p><p>¿Necesitas información clara y precisa de forma rápida y profesional? Entonces necesitas utilizar Tablas Dinámicas.</p><p>Clase 24: Auditando las Fórmulas</p><p>Serás capaz de ver de dónde proviene una fórmula, qué celdas están involucradas, verlas en pantalla y corregir las desviaciones si las hubiera.</p><p>Clase 25: Análisis de Hipótesis</p><p>¿Quieres saber distintos resultados solamente cambiando las variables? Esta es la Función que necesitas.</p><p><strong>Unidad VI: Presentación del Libro</strong></p><p>Clase 26: Presentación del Libro I</p><p>Finaliza con un libro 100% Ejecutivo.</p><p>Clase 27: Presentación del Libro II</p><p>Profundiza el trabajo con gráficos en la presentación de tu Libro de Excel.</p>", 
    "end_date": null, 
    "title": "Aprende Excel 2013 a nivel profesional en tiempo récord.", 
    "price": "20.00", 
    "instructors": "Sr. Francisco Cordero", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673994_e139_6.jpg", 
    "course_url": "https://www.udemy.com/aprende-excel-2013-a-nivel-profesional-en-tiempo-record/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T02:27:02Z"
}