{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong style=\"\">Aprende Excel desde cero</strong> a través de nuestro curso en  video. Aprenderás desde escribir y editar celdas, construir fórmulas,  usar funciones y gráficos hasta dominar tablas dinámicas.  </p>  <p>  \t       Microsoft Excel es una de las hojas de cálculo más usadas en el mundo. Es utilizado tanto por individuos particulares así como por cualquier tipo de empresa. Cada vez es menos probable hallar una empresa donde no se haga uso de este poderoso software, por lo cual es importante que como profesional tengas a Excel en tu resumen curricular. Y precisamente para eso es este curso, para ayudarte a que alcances ese objetivo de dominar Excel y hacer que adquieras conocimientos que están por encima de los conocimientos de cualquier usuario promedio que no ha dado ese paso de ingresar a este curso.  </p>  <p>  \t       La mayoría de las personas jamás ha tomado un curso formal de Excel, lo que saben lo han aprendido preguntando a otros o investigando cosas puntuales por su propia cuenta cuando les surge el inconveniente de que no hallan cómo hacer que un determinado problema pueda ser resuelto utilizando herramientas de Excel. Esto los convierte en alguien que ignora en gran parte la potencia de esta hoja de cálculo. Como no tienen idea de la generalidad de las herramientas que ofrece Excel ni de cómo se usan, esto hace que no puedan resolver un determinado problema. Este curso te ayuda a conocer muchas de esas herramientas.  </p>  <p>  \t <br style=\"\">  \t            En cinco módulos que constan de 15 videos con un contenido total de 4 horas de lecciones, aprenderás a:  </p>  <ul style=\"\">  \t<li>       Conocer las estructuras de Excel.</li>  </ul>  <ul style=\"\">  \t<li> Utilizar las fórmulas y funciones de nivel intermedio.</li>  </ul>  <ul style=\"\">  \t<li>       Utilizar rangos, funciones lógicas y gráficos.</li>  </ul>  <ul style=\"\">  \t<li>       Construir listas, gráficos y tablas dinámicas.</li>  </ul>  <ul style=\"\">  \t<li>       Usar el formato condicional y realizar cambios en la estructura de la hoja y el libro.</li>  </ul>  <p>  \t<br style=\"\">  \t            El curso está fundamentado en Excel 2007.  </p>", 
    "end_date": null, 
    "title": "Aprende Excel fácil y rápido", 
    "price": "20.00", 
    "instructors": "Elio Reyes", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/200034_6230_2.jpg", 
    "course_url": "https://www.udemy.com/aprende-excel-facil-y-rapido/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-16T14:12:02Z"
}