{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<span>*********<strong style=\"\"> Updated on June 2015 *********</strong></span>  </p>  <p>  \t<span><strong style=\"\">FEW REVIEWS</strong></span>  </p>  <ul style=\"\">  \t<li>  \t  \t\t<strong style=\"\">Bijle Tarannum</strong>  \t  \t<strong style=\"\">OUTSTANDING TEACHING</strong>  \t  \t\t              GREAT TEACHING. MASTER IN DELIVERING KNOWLEDGE PRACTICALLY . IN TUNE WITH INDUSTRY. THANKS A LOT SIR.  \t  \t</li>  </ul>  <p>  \t<span><strong style=\"\">  \t</strong></span>  </p>  <ul style=\"\">  \t<li>  \t  \t  \t\t<strong style=\"\">Nawaz Ahmed</strong>  \t  \tBest Course for Entity Framework with MVC  \t  \t\t                      Well Organized Contents and Topics, Talks more on Real world Implementation and business scenarios, Clear Voice Collecting all above points make this course a best one to attend Thanks manzoor sir for this video and adding more confident in me..  \t  \t</li>  \t<li>  \t  \t  \t\t<strong style=\"\">Antonio Marques Taltavul</strong>  \t  \tGood and Clear  \t  \t\t                      Thanks for the course, simple and to the point explication at every lesson. Great work!!!!  \t  \t</li>  \t<li>  \t  \t  \t\t<strong style=\"\">Barlet Hamzai</strong>  \t  \tGreat Course  \t  \t\t                      Great course and easy to follow. This course taught me how to use Entity Framework with both WebForms and MVC.  \t  \t</li>  \t<li>  \t  \t  \t\t<strong style=\"\">Saujan</strong>  \t  \tSimple But Effective!  \t  \t\t                      Straight to the point, not like other instructor who spend 15 minutes to explain 4 lines of useless code, outstanding will join his asp .net MVC web.  \t  \t</li>  \t<li>  \t  \t  \t\t<strong style=\"\">Software Developer Zaheer Husain</strong>  \t  \tthis is very helpfull for learning asp .net mvc  \t  \t\t                      this is very helpfull for learning asp .net mvc  \t  \t</li>  </ul>  <p>  \t<strong style=\"\">Entity Framework </strong>is a latest approach for data access and this course contains all the stuff required to start with AdoNet Entity Framework. As there are two ways of working with entity framework i.e., ObjectContext and DbContext. As a start this course contains all the stuff with ObjectContext and it covers all the areas that a normal developer needs to know to work on any project with entity framework as data access layer.  </p>  <p>  \t                           It ranges from basic operations like insert,update,delete and select to advanced operations like transactions and optimization technique (lazy loading, eager loading, etc.,).  </p>  <p>  \t<strong style=\"\"> ASP .NET MVC</strong> is a framework for building scalable, standards-based web applications using well-established design patterns and the power of ASP .NET and the .NET Framework.  </p>  <p>  \t                            In this course I will give an introduction to ASP .NET MVC from a beginner&#039;s perspective. Then starts moving towards the understanding of Get and Post method, Binding A Form To An Action, various methods of Passing Values From View To Action, Introduction To Razor View Engine, ViewData Vs ViewBag and Temp data. Implement partial page updates that help reduce the need to reload entire pages and Finally Implement caching to reduce the loading time of the different elements of a webpage.  </p>  <p>  \t                            We will also learn how to validate forms and implement business rules validations by implementing custom validators. Then we will end our course by securing it with implementation of authentication and authorization.  </p>  <p>  \t<strong style=\"\">And many more lectures to come in future...</strong>  </p>", 
    "end_date": null, 
    "title": "Asp.Net MVC With Entity Framework From Scratch", 
    "price": "50.00", 
    "instructors": "Microsoft Certified Trainer Mohammed Manzoor Ahmed", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/179288_dc19_4.jpg", 
    "course_url": "https://www.udemy.com/aspnet-mvc-with-entity-framework-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-09T08:21:21Z"
}