{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t    Many companies around the globe rely on Spreadsheets to help produce financial information, forecasts, pricing, and costings, and to aid in the decisions made by management. Simply put, spreadsheets are used everywhere. But at what risk to the company or organization?  </p>  <p style=\"\">  \t<strong style=\"\"> LEARN HOW TO MINIMISE SPREADSHEET RISK AND MASTER TECHNIQUES USED TO AUDIT SPREADSHEETS IN THIS COURSE</strong>  </p>  <p style=\"\">  \tAuditing Excel Spreadsheets is not for everyone, but for those with a keen interest in Excel, Fraud, Auditing or Compliance then then course is for you.  </p>  <p style=\"\">  \t<strong style=\"\">CONTENTS AND OVERVIEW</strong>  </p>  <p style=\"\">  \t We will first cover some theory on Spreadsheets Risks and discuss some controls that you can introduce to reduce these risks. Following this will be more theory, this time covering a detailed overview of the types of Spreadsheet Fraud. With the theory finished, we will jump into Excel and look at the following tools and techniques: GOTO Special, Auditing Tools and Excel’s Inquire function. GOTO Special Function has been around for a long time in Excel and quickly allows you select cells in a worksheet based on set criteria. You will have a workbook to download so that you can practice and master this technique yourself. We will also quickly look at the Auditing Tools, which have also been available in Excel for some time. Introduced in MS Excel 2013, Excel Inquire is new. It enables you quickly identify and select areas of risk or interest in a workbook, map workbook relationships and compare two versions of a workbook. Using the workbook provided you can learn to quickly master this tool. Finally, we will have a quick look at Microsoft Discovery and Risk Assessment Server which allows you search for all Excel files on your server, and rank them according to risk. Risk levels are based on Materiality and complexity criteria that you set.  </p>", 
    "end_date": null, 
    "title": "Auditing Excel Spreadsheets", 
    "price": "50.00", 
    "instructors": "Paula Guilfoyle", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369156_accd_4.jpg", 
    "course_url": "https://www.udemy.com/auditing-excel-spreadsheets/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T21:36:44Z"
}