{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Excel Master Course for the Real World</strong></p><p><strong style=\"\">From Beginner to Excel Guru</strong></p><p>This course was designed to take Excel users at any level, whether you are someone who is just starting out with Excel or someone who has used Excel for years but you just know that there is so must more you could be doing with Excel and by the end of the course turn you into an Excel Guru.</p><p>People who take my courses usually end up knowing more about analyzing and managing data in Excel than 90% of people you meet in your working career, and for a large population of my students this percentage would be closer to 95-99%. That is my goal, to give you the skills necessary to become the “Excel Superstar&quot; in your office or at your university.</p><p>You will find this course to be designed a little different than all other courses and that is what makes it so effective.</p><p>What makes this course so effective and so unique?</p><p>You are by newest employee and I&#039;ve created a fictitious boss that gives us real world projects to us to complete.</p><p>Each email project builds upon what you&#039;ve learned in the previous projects.</p><p>So instead of just going through Excel&#039;s interface and learning one thing at a time we learn how to use all of the tools in Excel simultaneously to complete each project.</p><p>The difference?</p><p>You will learn start to think in terms of solving real-world problems where Excel is a just a powerful tool that we use to get to the end result rather than just learning how to do things in Excel.</p><p>At the end of this course, Excel will just become the “go-to&quot; tool in your arsenal used to solve the problem and get the job done.</p><p>It won&#039;t matter if you need to prepare a quick report or a major analysis that you need to send out to a 3rd party or month-end reconciliations and analysis.</p><p>Whether you are preparing a budget for a fortune 500 company or reconciling your checkbook </p><p>at home.</p><p>We&#039;ll naturally learn to use Excel as the powerful tool it was designed to be to solve any problems we encounter.</p><p>This course course is divided into three sections:</p><p>Excel, the Basics and Beyond</p><p>Ultimate Reconciliations and Analysis</p><p>and lastly, Pivot Table Domination.</p><p>In the first section, we take a fresh look at all of the basics in Excel.</p><p>Every thing from:</p> <ul style=\"\"> <li>Formatting, Saving &amp; Filtering Data</li> <li>Using formulas (sums, subtotals &amp; basic arithmetic)</li> <li>Working with multiple types of commenting</li> <li>Correctly working with multiple sheets of data simultaneously</li> <li>Merging data from various locations</li> <li>Produce Amazing looking charts</li> <li>Flow Charts</li> <li>Org Charts</li> <li>Much more…</li> </ul> <p>In the second section, we learn how to analyze and reconcile data in Excel. This is truly the meat and potatoes of Microsoft Excel.</p><p>We&#039;ll cover:</p> <ul style=\"\"> <li>Vlookups</li> <li>Anchoring Data</li> <li>Pivot tables</li> <li>If/Then logic formulas </li> <li>Nesting multiple formulas together to get a desired result</li> <li>Reconciling data in multiple tables from multiple sources</li> <li>How we can completely eliminate errors in our formulas </li> <li>How to customize our workspace in Excel</li> <li>Excel Options</li> <li>Security Settings</li> <li>Named ranges</li> <li>How we bring it all together..</li> <li>and much more…</li> </ul> <p>In the third section we cover everything you ever wanted to know about pivot tables.</p> <ul style=\"\"> <li>First we cover what everyone must know before creating pivot tables.<ul style=\"\"> <li>This is difference between pivots being a absolutely simple to work with and you pulling your hair out because something isn&#039;t working as expected.</li> </ul></li>  <li>Adding new data to an existing pivot table</li> <li>Create trends in the pivot table</li> <li>Rolling 12 month analysis</li> <li>Immediately changing the design and format of your pivot tables</li> <li>How to create formulas in a pivot table</li> <li>Slicers</li> <li>Running totals</li> <li>Weighted averages</li> <li>Pivot charts</li> <li>and a whole lot more…</li> </ul> <p>As you can probably tell I love Excel, I use it for pretty much everything but there is one other thing I&#039;d like to mention.</p><p>Listen, I&#039;m can&#039;t make any guarantees but when the US economy took a turn for the worse back in 2009, I saw a lot of people lose their jobs due to company&#039;s downsizing.</p><p>Simple economics - Sales decreased so the first cut always seems to be cuts to the headcount. It&#039;s the quickest way to cut costs. </p><p>This is a sad but true realty.</p><p>But I truly believe that my ability to manage and analyze data so effectively in Excel helped me remain gainfully employed while other people were “downsized.&quot;</p><p>Most of these people weren&#039;t bad employees but by really understanding how manage data in Excel set some people apart from others.</p><p>And those of us who super-efficiently managed, reconciled and analyzed data (With Microsoft Excel) where typically the one&#039;s who remained.</p><p>An other area where becoming a master of managing data in Excel really helps is on job interviews.</p><p>Most people you work for in business will not know as must as you will about managing, analyzing and reconciling data in Excel. </p><p>So they tend to rely a lot on you to produce reports and analysis that they need.</p><p>So become almost like a “right-hand&quot; man (or woman) to your boss. This not only helps in you job security but also you tend to work on a lot of the items that your boss is working, helping you grow you career as much as help your boss. </p><p>A true Win-Win!</p><p>So let me show you exactly how I manage projects using Microsoft Excel to the most productive (and valuable) employee you can possibly be.</p><p>What are you waiting for?</p><p>Let&#039;s get started Right Now!</p>", 
    "end_date": null, 
    "title": "Become an Excel Guru - Master Training - Get your Dream Job!", 
    "price": "20.00", 
    "instructors": "Scott Falls", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571858_938e_3.jpg", 
    "course_url": "https://www.udemy.com/the-complete-excel-master-course-become-an-excel-guru/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-02T20:56:42Z"
}