{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course intended for Excel users who want to learn the best way to automate their tasks. Other Microsoft Office applications, as well as Excel, come with a powerful scripting language referred to as VBA. With a little bit of programming knowledge, complicated tasks can be completely automated and finished in seconds. This course assumes no programming experience; only a realistic level of familiarity with Excel.</p><p><strong>   </strong></p><p><strong>Prerequisites</strong></p><p><u>Microsoft Excel</u> : This courses uses Excel 2007 for the demonstrations, and comes with .xlsm files for the code examples. These demos and files will not be incompatible with later versions of Excel as well. If you're using Excel 2003, you will not manage to open the .xlsm files, but you'll be able to follow along with the demos.</p><p><strong>Topics Covered</strong></p><p>The course begins with an introduction to macros. You'll find out how to inspect the VBA code that gets created from this process, and how to record a series of activities, the way to run the recorded macro.</p><p>You'll then find out the best way to make use of numbers in VBA. There are different kinds of numbers that are utilized in various scenario, so you will be a given an overview of the differences between them.</p><p>You'll then be presented to strings. Strings are utilized to symbolizes words and characters in programming. For instance, \"hello world\" may be saved in your VBA code as a string. You could then perform various operations on your string, like converting it to upper case, replacing a word, counting the number of characters, and others.</p><p>Then you'll look at booleans, if-statements and loops. These concepts will enable you to create complex behaviours that wouldn't have been possible by simply recording a macro. You'll able to write code that makes conclusions and implements legitimate rules.</p><p>This course is the lite version of \"Become an Excel VBA Expert for Beginners\"</p><p>Hope you join with me.</p>", 
    "end_date": null, 
    "title": "Become an Excel VBA Expert for Beginners - Lite", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/768526_e032_3.jpg", 
    "course_url": "https://www.udemy.com/become-an-excel-vba-expert-for-beginners-lite/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-20T10:13:18Z"
}