{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t      Welcome to Become an Excel Guru, where you are going to learn everything you need to know to become an Excel expert. For the last ten years I&#039;ve been using Excel to build advanced tools and applications in the investment banking and financial services industries.  </p>  <p>  \t      So, you probably already know the basics of Excel and you use it in your job on a daily basis, and you&#039;re looking to learn more about Excel - but how much more?  </p>  <p>  \t      Excel has a huge variety of tools and functionality, from the simple - like sum and average formulas - to more advanced tools like pivot tables and automation. But the scope of stuff to learn if you want to know EVERYTHING is enormous - for example, there are over 400 different functions you can use. Do you want to learn them all? Didn&#039;t think so!  </p>  <p>  \t      You&#039;ve probably been looking at &#039;intermediate&#039; or &#039;advanced&#039; level courses - but who decides what constitutes those skill levels? Is it just a case of knowing what all the buttons do or is there something deeper?  </p>  <p>  \t      From over a decade of using, developing and training Excel I&#039;ve learned that actually, <strong style=\"\">you don&#039;t need to know it all to be an expert.  </strong>  </p>  <p>  \t      There is a collection of different tools that I believe are most important for day to day business use, like functions or charts, and then there are a few more advanced tools which can really set you apart from the rest, like summarising data using pivot tables, and using visual basic, Excel&#039;s automation toolkit.  </p>  <p>  \t      My goal in this course is to teach you Excel to an advanced level but <strong style=\"\">without confusing you and overwhelming you with information</strong>. I&#039;m not just going to teach you what the buttons do - you are going to learn that of course, but more importantly you will learn <strong style=\"\">how to use it correctly</strong>, and I&#039;ll make it easy for you to do it over and over again.  </p>  <p>  \t      I&#039;ve split the course into four key modules, which follow a logical progression from raw data to end results:  </p>  <p>  \t<strong style=\"\">Module 1:</strong> The first module covers working with data in Excel, where you&#039;ll learn all about how to structure your data, clean it and enrich it using formulas and how to use some fundamental Excel tools like adding styles and dropdown options to cells.  </p>  <p>  \t<strong style=\"\">Module 2: </strong>The second module is about analysing your data, and most of this module is a deep dive on pivot tables - Excel&#039;s easy to use drag and drop data summary tool. We&#039;ll cover all kinds of ways to slice and dice your data and really uncover the key trends and insights.  </p>  <p>  \t<strong style=\"\">Module 3: </strong>This module covers presenting your analysis, with the key focus being on learning how to create great looking management reports and dashboards. You don&#039;t have to be a data analyst to reap the benefits of this type of knowledge. Being able to present great analysis in a succinct and informative dashboard is a skill that can really take your career to another level.  </p>  <p>  \t<strong style=\"\">Module 4: </strong>Finally we&#039;ll cover automation in Excel using Microsoft&#039;s coding language, VBA. It’s not as techy as you might think, and it&#039;s one of the easiest coding languages you can possibly learn. This module will set you on the road to being able to automate away repetitive and boring tasks you do in Excel, and can even help you create totally customized buttons and tools in your spreadsheets for your job or your clients.  </p>  <p>  \t      I think you&#039;ll get a huge amount of value from this course and you will come away with a deep understanding of how to use Excel correctly and with ease. No more throwing the mouse across the room or banging your head against the wall - this will take you to the next level.  </p>  <p>  \t<strong style=\"\">                About this course:  </strong>  </p>  <ul style=\"\">  \t<li><em style=\"\">Full, free lifetime access to course materials</em></li>  \t<li><em style=\"\">All future extra lectures and upgrades are always included for free</em></li>  \t<li><em style=\"\">Unconditional Udemy 30 day money-back guarantee</em></li>  \t<li><em style=\"\">Regular free bonuses to improve your skills even more</em></li>  \t<li><em style=\"\">Now includes 2 comprehensive cheat sheets for your desk or drawer covering all Excel keyboard shortcuts and functions</em></li>  </ul>  <h4></h4>", 
    "end_date": null, 
    "title": "Become an Excel Guru", 
    "price": "30.00", 
    "instructors": "Martyn Blythin", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/233256_80c7_5.jpg", 
    "course_url": "https://www.udemy.com/become-an-excel-guru/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-29T20:19:32Z"
}