{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t         The <em>Beginning SharePoint 2013 Development</em> and  <em>SharePoint-videos.com</em> course represents a unique collaboration between  SharePoint content leaders.  </p>  <p>  \t         The course features the best-selling Wrox eBook <em>Beginning SharePoint 2013  Development</em> and several complementary beginning SharePoint Development  videos from the renowned <em>SharePoint-videos.com</em>. All based on SharePoint  2013, the eBook and videos addresses the major path forward for the SharePoint  platform and outline in a practical way how a new SharePoint developer can get  started.  </p>  <p>  \t         Renowned SharePoint spokesman Steve Fox is both the lead author for the book  and the videos.  </p>  <p>  \t <strong>About SharePoint-videos.com</strong>  </p>  <p>  \t         SharePoint-Videos.com (SPVideos) is focused on empowering information workers  in corporate environments with the SharePoint knowledge they need to be  successful. Their goal is ensuring sustainable SharePoint adoption through  education and support. SPVideos provides the following business solutions:  </p>  <p>  \t         Asif Rehmani has been training and consulting on SharePoint technologies  since 2002. He is a SharePoint Server MVP and MCT. He has written SharePoint  curricula, several books for Wrox, and dozens of SharePoint articles. He has  produced hundreds of video tutorials on SharePoint, many available at Microsoft  TechNet, MSDN, Channel 9, Office.com, YouTube and SharePoint-Videos.com. Asif  has presented at conferences globally including Microsoft&#039;s TechEd, SharePoint  Conference, SPTechCon, and SharePoint Connections. His clients include Caltech,  Fidelity.com, Federal Reserve Bank of New York, Lockheed Martin, Symantec,  Autodesk, and Raytheon  </p>  <p>  \t <strong>      Visit the </strong><a href=\"http://www.wrox.com/WileyCDA/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Wrox</a> <strong>and  </strong><a href=\"http://www.dummies.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Wiley </a><strong>web sites</strong>  </p>", 
    "end_date": null, 
    "title": "Beginning SharePoint 2013 Development ", 
    "price": "50.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/200080_7afb_2.jpg", 
    "course_url": "https://www.udemy.com/beginning-sharepoint-2013-development/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-16T15:45:14Z"
}