{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>In this video training course for Microsoft Windows 8, an expert author teaches you how to take advantage of the enhanced and new features that you will find in this latest Windows release. No previous experience is required to get the most out of this tutorial, as this course breaks even complex operations down into easy to understand steps that anyone can absorb quickly and easily.<br style=\"\"><br style=\"\">The course begins with the basics of logging in and then guides you through a tour of the new Windows interface. You will learn how to manage files and folders and how to use Windows 8 Apps. These lessons teach you how to use the music App, as well as work with the Photo and Video Apps. You will master the Windows 8 messaging App, sending and receiving email, and getting organized with the calendar. This computer based training course also covers topics such as using the Internet, sharing your data, keeping your data secure, securing the computer for family-safe use, and finally, properly maintaining your Windows computer to keep it operating at peak efficiency.<br style=\"\"><br style=\"\">Once you have completed this tutorial video you will have learned how to effectively use Windows 8 to make your life easier. Working files are included, allowing you to follow along with the author throughout the lessons.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Beginners Microsoft Windows 8 Tutorial Video", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/35559_895c_10.jpg", 
    "course_url": "https://www.udemy.com/microsoft-windows-8/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-10T12:05:10Z"
}