{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><em>Latest: </em></strong></p>\n\n<p><strong><em>Course fully updated for <strong>June</strong><strong> 2016</strong> </em></strong></p>\n\n\n\n<p><strong><em> <strong><em>Join over 600 successful students are already having fun by playing Excel games!</em></strong> </em></strong></p>\n\n\n\n<p>Start having fun <strong>playing Excel games immediately.</strong> There are <strong>no knowledge</strong> requirements and the <strong>Excel files are downloadable</strong>, meaning <strong>you can play them on your own compute</strong>r! You only need to have Excel 2007 or newer.</p>\n\n\n\n<p><strong>About this course</strong></p>\n\n\n\n<p>Have you ever been bored in the office? If yes, then <strong>this course is perfect for you</strong>, as it <strong>contains many different games</strong> that you can play in Microsoft Excel. They include games such as 2048, Monopoly, finding an exit out of a maze and more. You <strong>do not need any additional software</strong> to play, <strong>only Excel 2007 or newer</strong>. This course explains how each game works, what the objective of is and what the controls are. Most importantly <strong>you can</strong> <strong>download the Excel files</strong>, which you will use to <strong>play the games on your own computer!</strong></p>\n\n\n\n<p>This course is divided into sections for each game. At the beginning of each section <strong>I explain, what the objective is and how to play the game in Excel. </strong>The last lecture in each of the sections <strong>contains links to free downloadable material</strong>, which are the Excel files containing the games. By downloading these Excel files you will be able to play the games on your own computer. </p>\n\n\n\n<p><strong>While playing</strong> some of these games, <strong>you can pretend that you are actually working</strong> in your office. For example there is one <strong>Excel file for the game called “2048\"</strong>, which <strong>looks like a financial statement</strong>. This means that <strong>your boss could be fooled that you are working</strong>, while in <strong>reality you are playing the game. </strong></p>\n\n\n\n<p><strong>Contents and overview</strong></p>\n\n\n\n<ul><li>Learning about the objective of each game</li> <li>Learning the controls of the games in each Excel file</li> <li>Being able to download the Excel files to your own computer</li></ul>\n\n\n\n<p><strong>Additional Benefits: </strong></p>\n\n\n\n<p>In addition to the curriculum and the things you will learn in the course, you will also get the following benefits by taking this course: </p>\n\n\n\n<ul><li>Have fun playing games in Excel</li><li>Full and lifetime access to the course</li><li>All future extra lectures and upgrades are always included for free</li><li>Unconditional Udemy 30 day money back guarantee- that is my personal promise of your success and fun you will have!</li><li>My help is available to you, if you get stuck or have a question</li></ul>\n\n\n\n<ul><li>I will provide you discounted coupon codes for my other Excel courses</li></ul>\n\n\n\n<p><strong><strong>Click the “Take This Course\" button</strong> at the top right, since every day <strong>you do not play the games</strong> covered in this course, <strong>you potentially lose out on some fun!</strong></strong></p>", 
    "end_date": null, 
    "title": "Bored at Work? Have a Blast with Microsoft Excel Games!", 
    "price": "50.00", 
    "instructors": "John Smith", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/459462_6252_6.jpg", 
    "course_url": "https://www.udemy.com/bored-at-work-have-a-blast-with-microsoft-excel-games/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-26T06:22:55Z"
}