{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">A step-by-step video series that will help you get familiar with basics to intermediate concepts of Formula Building. Highly sophisticated Formulas can be built using Excel to get results most users might not even imagine. This course aims at helping students develop that logical thinking that would guide them in the right direction when it comes to Excel Formulas<br style=\"\"></p><p style=\"\">The course starts with clarifying basics along with some Do&#039;s &amp; Dont&#039;s while using Excel. It also spends some quality time to make students understands the power of Excel functions by themselves. It then moves ahead to teach how these functions can be used together to build Powerful Excel Formulas to derive some pretty complicated results. </p><p style=\"\">I also touch base upon Array formulas, which is a pretty advanced concept.</p><p style=\"\"><u style=\"\"><strong style=\"\"><span style=\"\">In this course you will learn</span> -</strong></u></p><p style=\"\">1) Usage of Excel functions</p><p style=\"\">2) Basics of Building Formulas</p><p style=\"\">3) Using functions to build complex Excel formulas</p><p style=\"\">4) Array Formula Basics</p><p style=\"\">5) Some helpful examples for hands on training along with other important Tips &amp; tricks</p><p style=\"\">The course contains easy to understand video lessons &amp; other reading material and should take approximately 2 hours to finish. Easy to follow along with the help of exercise files that are provided with lessons wherever required for practice.</p><p style=\"\">Those who have been using Excel and are looking learn some advanced stuff, this course will provide a good foundation to build upon.</p><strong style=\"\">What are you going to get from this course?</strong><ul style=\"\"><li>Have an understanding of Excel formulas</li><li>Will be able to build some complex formulas by the end of this course</li></ul>", 
    "end_date": null, 
    "title": "Building Excel Formulas From Scratch", 
    "price": "40.00", 
    "instructors": "Deep Dave", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354446_c98c_3.jpg", 
    "course_url": "https://www.udemy.com/building-excel-formulas-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T12:51:50Z"
}