{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">A step-by-step guide to setting up, fixing, and protecting your computer FREE with no cost programs. No need to constantly refer to Microsoft Support. Learn about Anti Malware, Anti Spyware, Microsoft Antivirus, some security essentials, and much more.</p><p style=\"\">✔ Brand New Course</p><p style=\"\">✔ Over 650 Students Enrolled in the First 48 hours!</p><p style=\"\">✔ 30 Day 100% Risk Free Offer!</p><p style=\"\">✔ Optimized for Mobile Viewing</p><p style=\"\">✔ Additional Lectures Coming Soon. </p><p style=\"\">Three Reasons to Take This Course Now!</p><ol style=\"\"><li style=\"\">You get lifetime access to this complete comprehensive success course teaching you all you need to know about your computer to keep it safe. Learn a variety of skills from security, office productivity, emergency functions, hardware vs software, downloading, cloud storage, and much more.</li><li style=\"\">You get to see how I use every single skill taught to you in this course first hand on my own computers. You&#039;ll see how I&#039;ve been able to help hundreds of thousands of people on my Youtube and various channels. You get to see the behind the scenes work that goes into proper maintenance, a variety of computer situations with tons of case studies, and get to see the programs tested on my computer first hand risk free before you ever commit.</li><li style=\"\">You can skip years of painful learning alone that most people have little time nor patience for to weather the storm. Have you ever wanted to stop paying an overpriced computer repairman for a job you can do yourself? Are you tired of your children, family members, or friends seemingly running laps around you using their computer? No more struggling and wasting hundreds or thousands of your hard earned money before you realize you need help in figuring out how to do it right. I created this course because I have more than 15+ years of experience, both self taught and formally educated, and truly believe I can make your experience a fantastically refreshing one!</li></ol><p style=\"\">You can skip the hundreds of hours of painful learning I spent figuring out success the hard way by taking this course now! </p>", 
    "end_date": null, 
    "title": "Computer Basics & Protection with No Cost Tools", 
    "price": "20.00", 
    "instructors": "Na'Shawn Jordan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438248_c1bc_3.jpg", 
    "course_url": "https://www.udemy.com/cbpnocost/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T03:26:22Z"
}