{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Welcome and thanks for your interest in my course!</p><p>Learn and master the art of creating a well-designed graphs in Excel in this wide-ranging course. Forget the same old default Excel graphs that are boring and without personality - you can do better than that! This course will help your to go beyond the basics of graphing and teach you how to design graphs with your intended audience in mind. Not only will you lean how to create great graphs in Excel, you will learn how to organize your data before graphing to make the process easier and more productive. </p><p>A few of the topics we will cover in this course include:</p><ul><li>How to determine if your data is graph-worthy</li><li>How to organize your data prior to graphing</li><li>Using vlookups to enhance your graphs</li><li>Designing your graphs for your audience</li><li>Using your graphs outside of Excel</li><li>and a few other surprises....</li></ul><p>This course is mostly video based, but does include all of the Excel spreadsheets used throughout the course. Use these spreadsheets and documents as a resource after you complete the course. They are yours to keep and use as a reference in the future. </p><p>This course will allow you to use the Excel skills you already have and take them to the next level. This course was designed with you - the student in mind. My goal is for you to be able to implement the skills your learn in this course immediately once you have completed it. </p><p>I hope you enjoy the course and that your use the skills learned to enhance your skillset and wow your boss and coworkers!</p><p>- Sean<br></p>", 
    "end_date": null, 
    "title": "Create great charts and graphs in Excel", 
    "price": "20.00", 
    "instructors": "Sean Thompson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528106_99dd_4.jpg", 
    "course_url": "https://www.udemy.com/create-well-designed-excel-graphs/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-14T19:56:22Z"
}