{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong style=\"\">Summary of the Course</strong>  </p>  <p>  \t  This course is a step by step guide to creating a colorful, easy to use traveling plan in Excel.  </p>  <p>  \t  We have 2 big objectives for this course:  </p>  <p>  \t  1. Learn how to build a traveling plan in Excel  </p>  <p>  \t  2. Learn Excel  </p>  <p>  \t        This will not be your usual Excel course because we will take a different approach in learning to use Excel. We will start drom this challenge: &quot;How do we build a usable and beautiful traveling plan?&quot;. With this goal in mind, we will figure out how to complete the job and inevitably, you will see that you will learn Excel in a fun, new and interesting way.  </p>  <p>  \t<strong style=\"\">Structure of the Course</strong>  </p>  <p>  \t  We will have one video for each part of the traveling plan. Every part will address everything you need to know in order to create the plan and, at the same time, will teach you something new about Excel.  </p>  <p>  \t        Because of this approach, you don&#039;t need to be an expert in Excel. By the end of the course you will have learnt enough to build your own templates!  </p>  <p>  \t        Also, by the end of the course you will have a ready to use traveling plan!  </p>  <p>  \t        But guess what:<strong style=\"\"> 2 surprises</strong> are waiting for you!  </p>  <p>  \t        Enjoy this journey and plan your future ones!  </p>", 
    "end_date": null, 
    "title": "Create a Traveling Plan in Excel", 
    "price": 0, 
    "instructors": "Vlad Mihanta", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404296_49aa_4.jpg", 
    "course_url": "https://www.udemy.com/create-a-traveling-plan-in-excel/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T11:50:37Z"
}