{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Bienvenido al Curso Completo de Excel para principiantes, Ya sea que empieces desde 0 o que te estés actualizando, Estas tomando los pasos correctos para avanzar en tu ámbito laboral y profesional, empezando a construir un mejor mañana.</p><p>En este curso aprenderás a utilizar este poderoso y popular sistema. <span style=\"\">Empezaremos familiarizándonos con el sistema de menus, te explicaremos algunos términos y conceptos que son importantes para la correcta utilización de esta herramienta. Vamos a mirar como insertar datos, crear tablas y utilizar las funciones mas importantes de excel. </span><span style=\"\">Trabajaremos con archivos, gráficos e imágenes. Nos introduciremos en el uso de valiosas funciones como SUMAR SI</span></p><p>El curso esta diseñado para personas que están empezando a conocer esta herramienta. Es importante que sepas que en este curso te vamos a llevar de la mano, enseñándote paso a paso cada una de las características y funcionalidades que conforman Microsoft Excel y usted podrá realmente dominar cada una de ellas.</p><p>Si tu aprendiste Excel hace ya muchos años, este curso es para ti, es importante actualizarse en las nuevas características y funcionalidades de Excel</p><p>Algunos beneficios de este curso son:</p><ul><li>El precio, muy por debajo de un curso presencial</li><li>La comodidad de ver los videos desde tu casa u oficina sin necesidad de desplazarte</li><li>Una comunidad que te ayudara a lo largo del camino</li><li>Puedes contactar a tu instructor en el momento en que surjan las dudas</li><li>En base a tus comentarios y progreso, actualizaremos y agregaremos videos para eliminar cualquier duda.</li></ul><p>Como vez hay mucho que descubrir, Así que, Empecemos!!!</p>", 
    "end_date": null, 
    "title": "Curso Completo de Excel para principiantes", 
    "price": "20.00", 
    "instructors": "Juan Rafael Araya Mesén", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527692_34c8_2.jpg", 
    "course_url": "https://www.udemy.com/curso-completo-de-excel-para-principiantes/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T23:00:18Z"
}