{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>CURSO DE EXCEL BÁSICO - VÍDEO AULA</strong></p>Hoje o Excel é a ferramenta mais solicitada para qualquer cargo dentro de uma empresa, além de ser essencial para cargos analíticos e gerenciais, por ser uma ferramenta dinâmica, analítica e descritiva. O Curso irá ensinar as principais fórmulas do Excel fazendo com que o aluno se aprimore, começando a ser tornar mais analítico. O intuito é deixar mais rápida e práticas as atividades rotineiras do profissional.<p><strong>Objetivo:</strong></p><ul><li>Aprender as principais fórmulas e funções do Excel</li><li>Desenvolver lado analítico do aluno</li><li>Apresentar relatórios e templates mais agráveis e visuais</li><li>Deixar as rotinas mais práticas e rápidas</li><li>Aguçar o aluno a aprender sempre mais sobre a ferramenta</li></ul><ul><strong><br></strong></ul><p><strong>Duração:</strong></p><p>O Curso Online de Excel Básico tem carga horária total de 1 hora e meia.</p><p><strong><br></strong></p><p><strong>Público Alvo:</strong><br></p><p>O curso de Excel Básico destina-se a todo e qualquer profissional que deseje aprender sobre a ferramenta.</p><p><strong><br></strong></p><p><strong>Conteúdo Programático:</strong></p><ul><li>Apresentação e Entendimento do Excel</li><li>Tipos de Dados</li><li>Por Dentro das Fórmulas</li><li>Se</li><li>Soma / Somase</li><li>Procv</li><li>Cont (cont.valores / cont.núm / cont.se)</li><li>Concatenar</li><li>Gráficos básicos: Barras</li><li>Macetes para ajudar no dia a dia</li></ul><ul><p><strong><br></strong></p><p><strong>Por que escolher a ComSchool?</strong></p></ul><li>Única escola no Brasil com cinco livros publicados na área digital</li><li>Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li>Programa inovador, fundamentado no conhecimento prático dos professores</li><li>Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li>Estude com alguns dos nomes mais influentes da Internet brasileira</li><li>A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas</li>", 
    "end_date": null, 
    "title": "Curso de Excel Básico", 
    "price": "20.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750502_2131_2.jpg", 
    "course_url": "https://www.udemy.com/curso-de-excel-basico-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T21:01:45Z"
}