{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\" text-align:right;\">  \t <img src=\"http://koul.co/cursos/camp/img/Header-descripcion-Udemy_01.jpg\" alt=\"Ventajas de saber Excel\" style=\" max-width:100%;\">  </p>  <p style=\" text-align:right;\">  </p>  <h5><strong style=\"\">DESCRIPCIÓN DEL CURSO</strong></h5>  <p>  \t                  En este curso, Koul.co te lleva desde el nivel de dominio de Microsoft Excel™ en que te encuentres (cualquiera que este sea) hasta un <strong style=\"\">nivel avanzado</strong> en 3 horas.  </p>  <p>  \t                  Las lecciones están cuidadosamente diseñadas por un equipo de expertos en sistemas y en aprendizaje, para que aprendas rápidamente a usar desde las funciones básicas hasta los comandos más avanzados.  </p>  <p>  \t                  Aprenderás a personalizar Excel para sacarle más provecho, a manipular datos de distintas formas, a realizar cálculos complejos y a graficarlos; también a consolidar datos, analizar hipótesis, evaluar escenarios, a grabar macros y a mucho más.  </p>  <p>  \t                  Cuentas con decenas de ejemplos y ejercicios descargables. Son 59 archivos disponibles para descarga.  </p>  <h5><strong style=\"\">Público objetivo</strong></h5>  <p>  \t                  Microsoft Excel™ es una herramienta tan versátil que es útil para diversos tipos de personas. Este curso está dirigido a personas que quieren ser más eficientes en sus labores diarias.  </p>  <p>  \t                  Algunos de nuestros alumnos son:  </p>  <p>  \t                  -Una <strong style=\"\">emprendedora</strong> que quiere llevar sus cuentas de manera fiable y organizada a la vez que optimiza sus gastos y sus compras.  </p>  <p>  \t                  -Varios <strong style=\"\">profesores</strong> que quieren analizar la evolución de sus estudiantes.  </p>  <p>  \t                  -Un <strong style=\"\">contador</strong> que maneja Excel a un nivel básico y quiere realizar análisis financieros de varias hojas con mayor destreza y conseguir un mejor empleo.  </p>  <p>  \t                  -Un <strong style=\"\">estudiante</strong> que quiere sobresalir en su clase y tener más tiempo libre los fines de semana.  </p>  <p>  \t                  -<strong style=\"\">¡Tú!</strong> ¿En qué te va a ayudar Excel en tu vida diaria?  </p>  <h5><strong style=\"\">Estructura del curso</strong></h5>  <p>  \t              ‘<em style=\"\">Excel Avanzado en 3 Horas</em>’ está formado por 29 lecciones divididas en cuatro secciones básicas:  </p>  <ol style=\"\">  \t<li><strong style=\"\">Introducción a Excel</strong>: Perfecto para comenzar a usar Excel si estás en un nivel muy básico o no conoces el programa. </li>  \t<li><strong style=\"\">Cálculo, manipulación y análisis de datos</strong>:  La sección más importante del curso. Te enseña desde introducir una  fórmula hasta hacer análisis complejos con esquemas, tablas dinámicas,  consolidación de datos y otras herramientas. </li>  \t<li><strong style=\"\">Presentación de datos e informes</strong>: Donde aprenderás a hacer gráficas sofisticadas y presentar tus datos en informes. </li>  \t<li><strong style=\"\">Introducción a la automatización</strong>: Aprenderás lo básico de automatización de tareas y grabación y uso de macros .</li>  </ol>  <p>  \t              En  cada lección podrás descargar los archivos de ejemplo y  al cierre de los capítulos importantes podrás poner en práctica tus  conocimientos con prácticos ejercicios.  </p>  <h5><strong style=\"\">Requisitos del Curso</strong></h5>  <p>  \t                  Para empezar este curso te recomendamos saber manejar tu sistema operativo a un nivel básico. El curso se enseña en Microsoft Excel™ 2013, pero lo que aprendes aplica en general para cualquier versión del programa.  </p>  <p>  \t                  Deberás tener instalada alguna versión de Microsoft Excel™ en tu computadora, para poder seguir los tutoriales.  </p>  <h5><strong style=\"\">Nivel que debes tener</strong></h5>  <p>  \t                  No te preocupes si nunca has usado el programa. Tenemos unas lecciones introductorias que te darán la confianza necesaria para usar Microsoft Excel™. Sin embargo, si has usado el programa con anterioridad, puedes sacar un mayor provecho y entender más rápido las lecciones.  </p>  <p>  \t                  Al final el curso, deberás haber aprendido a usar herramientas que se consideran avanzadas.  </p>  <h5><strong style=\"\">Beneficios para ti</strong></h5>  <p>  \t                  ¿Qué obtienes cuando te inscribes?  </p>  <h5><strong style=\"\">Aprendes rápidamente</strong></h5>  <p>  \t                  ‘<em style=\"\">Excel Avanzado en 3 Horas</em>’ está diseñado para que llegues a nivel avanzado en tiempo récord, de manera que con unas cuantas horas de aprendizaje seas un empleado más eficiente, una emprendedora con más tiempo para lo importante, o el estudiante que más rápido completa sus informes.  </p>  <h5><strong style=\"\">Donde quieras, cuando quieras</strong></h5>  <p>  \t                  Nuestro curso no requiere que desperdicies tiempo en el tráfico para desplazarte a una escuela de informática, ni tampoco que madrugues o te desveles tomando clases con horarios rígidos.  </p>  <p>  \t                  Tú decides cuándo y dónde tomas una lección y cuántas veces la quieres repetir.  </p>  <h5><strong style=\"\">Aprendes lo que verdaderamente necesitas</strong></h5>  <p>  \t                  ‘<em style=\"\">Excel Avanzado en 3 Horas</em>’ está diseñado de tal manera que obtienes un nivel avanzado de Excel sin tener que aprender todos los detalles de cada menú y función del programa, así que no te vas a distraer con detalles poco importantes que poco le agregan a tu formación.  </p>  <h5><strong style=\"\">Plan de estudios diseñado por expertos</strong></h5>  <p>  \t                  Con este curso aprendes más fácilmente, puesto que no tienes que explorar por ti mismo cuáles temas debes aprender. Tampoco tienes que adivinar qué características serán las más útiles en tu ocupación y cuáles no, pues nuestros experimentados instructores han diseñado un plan de estudios óptimo.  </p>  <h5><strong style=\"\">Aprendes trucos y atajos</strong></h5>  <p>  \t                  ¿Quieres terminar rápido tus reportes? Con los consejos y trucos que aprendes en cada lección, vas a saber usar Excel de la manera más eficiente posible. Esto te va a ahorrar tiempo en el día a día. ¡No más salidas tarde de la oficina! Ahora tu tiempo libre será realmente tuyo.  </p>  <h5><strong style=\"\">Tú decides qué aprendes</strong></h5>  <p>  \t                  Tú tienes el control sobre lo que aprendes y puedes elegir qué lecciones son relevantes para tu formación.  </p>  <h5><strong style=\"\">Videos y materiales con producción profesional</strong></h5>  <p>  \t                  Con los videos profesionales de ‘<em style=\"\">Excel Avanzado en 3 Horas</em>’ no te perderás ningún detalle, pues todo está explicado <strong style=\"\">auditiva y visualmente </strong>de la forma más didáctica y eficiente. No tendrás que pasarte horas en internet buscando lecciones que generalmente tienen video o texto de calidad deficiente.  </p>  <h5><strong style=\"\">23 ejemplos basados en casos reales</strong></h5>  <p>  \t                  Entenderás más fácilmente cómo usar las funcionalidades de Excel con los ejemplos cuidadosamente diseñados con base en casos reales.  </p>  <h5><strong style=\"\">12 prácticos ejercicios para usar en tu vida diaria </strong></h5>  <p>  \t                  Para aplicar lo que aprendas durante el curso, podrás practicar en divertidos ejercicios orientados a la comunidad hispanohablante.  </p>  <p>  \t                  Cuando los termines, tendrás hojas de cálculo <strong style=\"\">listas para usar en tu vida personal </strong>y laboral.  </p>  <h5><strong style=\"\">Una vibrante comunidad de aprendices</strong></h5>  <p>  \t                  También podrás acceder de por vida a una vibrante comunidad de aprendices con los cuales podrás intercambiar dudas, soluciones y experiencias. No importa si la duda te surge ya, mañana o en años.  </p>  <p>  \t<strong style=\"\">Con todos estos beneficios, ¿necesitas algo más para convencerte?</strong> <strong style=\"\">Suscríbete ya.</strong>  </p>  <ul style=\"\">  \t<li><sup style=\"\">1</sup> <a href=\"http://www.skilledup.com/blog/learn-excel-increase-salary/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Learn Excel increases salary</a></li>  \t<li><sup style=\"\">2</sup> <a href=\"http://www.juntadeandalucia.es/averroes/ies_alta_axarquia/orientacion/26%20La%20influencia%20de%20la%20informatica%20y%20los%20idiomas%20en%20la%20empleabilidad%2010-11.pdf\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">La influencia de la informática y los idiomas en la empleabilidad</a></li>  \t<li><sup style=\"\">3</sup> <a href=\"http://blog.infoempleo.com/wp-content/uploads/2012/04/ResumenEjecutivoInformeInfoempleo2011.pdf\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Informe Infoempleo.com 2011</a></li>  </ul>", 
    "end_date": null, 
    "title": "Curso de Excel Avanzado en tres (3) horas", 
    "price": "20.00", 
    "instructors": "Koul Advanced Learning", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/178708_3702_4.jpg", 
    "course_url": "https://www.udemy.com/excel-avanzado-en-tres-3-horas/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-07T19:43:47Z"
}