{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t                            What are the best ways to manipulate data in Excel? How can I change case in Excel? How to use Text-To-Columns? Can I separate data in Excel?  How can I combine data in Excel? What to do when imported dates are not dates? I lost leading zeros in Excel!  Answers to these questions are inside! When you enroll in this course and complete it, you will not only be able to do all that, but also will know how to import data in Excel the right way, how to prepare data for analysis, how to clean data in Excel. You will be proficient with useful Excel functions, for example VLOOKUP, IF, LEFT, RIGHT, MID, DATE.<br style=\"\">  \t<br style=\"\">  \t                            In this Excel course, that provides carefully hand-picked most useful video-training material, you will quickly learn the best practices to work with lists of data in Excel.  We will start by looking at the best practices in importing data and discuss the common mistakes that one can make when doing it.  Next, you will learn to transform data in Excel in a quick, easy, and creative way.  You will benefit by making yourself comfortable using Excel as a data manipulation tool. You will fix data, modify data, upend data, concatenate data and clean it using build-in Excel functionality.  You will learn to use creatively various Excel functions, such as: VLOOKUP, IF, LEFT, RIGHT, MID, DATE and some others.  You will become comfortable “massaging” your data in very useful and beneficial ways.<br style=\"\">  \t<br style=\"\">  \t                            The Excel course is using a problem-solving approach. It is divided into several sections. Each section deals with a specific common problem that people encounter in Excel all the time. First, we define the problem and then work through a proven solution to fix it. When you work through the solutions offered by the course, you will quickly be improving your problem-solving skills and start coming up with solutions of your own. And that is the ideal learning, isn’t it? You just have fun working through common problems, and your expertise just happens on its own.<br style=\"\">  </p>  <p>  \t      This Excel course is one of the Easy Excel With Igor series.  The other  high quality Excel tutorials include:  </p>  <p>  \t  &quot;Microsoft Excel Without Pain&quot; that helps you quickly build your foundation skills in Excel;  </p>  <p>  \t  &quot;Excel Conditional Formatting Master Class&quot; where you  can learn how to improve your spreadsheets using conditional formatting  in Excel;  </p>  <p>  \t  &quot;Excel Pivot Tables Data Analysis Master Class&quot; that takes you  step by step to mastering pivot tables data crunching skills;  </p>  <p>  \t  &quot;Microsoft Excel Charts Master Class&quot; that builds your skills in  creating your skills in Excel charts and graphs.  </p>", 
    "end_date": null, 
    "title": "Data Manipulation in Excel: save up to 90% of Your Time!", 
    "price": "30.00", 
    "instructors": "Igor Ovchinnikov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/139864_b90d_3.jpg", 
    "course_url": "https://www.udemy.com/easy-excel-with-igor-working-with-lists-of-data/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-30T23:05:28Z"
}