{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">COURSE UPDATE</strong></p><ul style=\"\"><li><strong style=\"\">Updated May 2015</strong></li><li><strong style=\"\">Over 100 active students</strong></li><li><strong style=\"\">Join the 1% of Excel users who know how to use the most powerful features and tools in Microsoft Excel</strong></li></ul><p><em style=\"\">I have been in the It industry since 1979, so I am not new to learning new technology along the way to keep up with it all. Ian Littlejohn&#039;s course that I completed is one of the best that have helped impress my colleagues and management at my workplace. Ian&#039;s precise and very engaging way of teaching has made my work effortless and an very effective. I use less time now to go through my weekly and monthly data analysis and presentation a breeze. Thanks again Ian. - Jeganathan Vettyvelu</em></p><p><em style=\"\">_______________________________________________________________________</em></p><p><strong style=\"\">Power Pivot has been described as the most important new feature in Excel in 20 years.</strong>  Power Pivot has been developed by Microsoft to help companies analyze and understand the growing quantities of data that are created on a daily basis.</p><p><strong style=\"\">Power Pivot will improve your time to create reports, develop data analysis and gain insight into your your data by at least 80%.</strong></p><ul style=\"\"><li><strong style=\"\">Create relationships between tables of data without Vlookups</strong></li><li><strong style=\"\">Create powerful Key Metric and Key Performance Indicator calculations</strong></li><li><strong style=\"\">Manage and work with data models of millions of records of data</strong></li><li><strong style=\"\">Create powerful new dashboards and reports</strong></li></ul>Power Pivot is a free Add-in for Excel 2010 and is called the Data Model in Excel 2013 that provides capabilities to handle large quantities of data.  PowerPivot is a columnar database that is capable of storing and manipulating hundreds of millions rows of data.  PowerPivot brings new capabilities to business users to analyse, explore and gain new insight into business and marketing data.  PowerPivot has been referred to as the most important feature for Excel in 20 years.  <p>  \tPower Pivot makes it easy to setup relationships between tables of data in the same way as databases and therefore does not require the use of Excel functions such as Vlookup.  PowerPivot therefore decreases the time substantially to analyse and gain new insight from business and marketing data.  </p>  <p>  \tPower Pivot allows the rapid development of powerful PivotTables and PivotCharts in Excel utilising the latest Slicer technology to easily analyse and view data from multiple different perspectives.  PowerPivot also adds a new Data Analysis Expressions (DAX) formula language that provides new and powerful calculations and insight to the business user.</p>", 
    "end_date": null, 
    "title": "Data Modelling and Analysis with Excel Power Pivot", 
    "price": "40.00", 
    "instructors": "Ian Littlejohn", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256490_2e86_5.jpg", 
    "course_url": "https://www.udemy.com/data-modelling-and-analysis-with-excel-power-pivot/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-06T13:48:45Z"
}