{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>You need to make presentations, but no one ever showed you how to make GREAT presentations, and you know most presentations are deathly dull and boring! You need to get people to pay attention and learn.</p><p><strong>Discover How To Tap Into Simple Neuroscience To Make People Sit Up And Listen During Your Presentation! </strong></p><ul><li>Achieve great presentations through less than an hour of video learning. </li><li>Many examples showing how - and how not - to make your PowerPoint slides look.</li><li><span></span>Microlearning techniques to deliver the essential learning points to you quickly.</li><li>The theory of slide design explained by looking at how how our brains work.</li><li>Drawing on decades of experience across our teaching group.</li></ul><span></span><p>After this course you will cause a stir in your workplace or classroom; people will sit up and notice your presentations, and people will learn what you want them to, while being amazed at your presentation skills.</p><p><br></p><p>Everyone dreads a long PowerPoint presentation; whether you're giving it or having to sit through it, they can be dull, lifeless, and repetitive, so much so that most people now use the phrase 'Death By PowerPoint,' to describe how it feels. But this is because PowerPoint presentations haven't been designed with how people see, pay attention, and learn, in mind. In fact, as you'll see in our course, some of the most common PowerPoint practices actually make it harder for the audience to take information in and keep concentrating.</p><p>In less than an hour we will share all the tips, tricks and techniques you need to stand out from the crowd, to turn Death By PowerPoint into Killer Presentations. It's easy to do once you know how, and we've even broken the lessons down into easy bite-sized chunks, so if you're in a rush you can learn enough in minutes to make a massive difference to your presentation. </p><p>You'll also get a free e-book as part of the course, so you can take the tips and techniques with you wherever you go. </p><p><br></p><p>Take action now and have people sit up and notice what you show them; click on the button to enroll and improve the quality of your delivery starting today. </p>", 
    "end_date": null, 
    "title": "Death By PowerPoint To Killer Presentation Via Brain Science", 
    "price": "35.00", 
    "instructors": "Dr David Murphy", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754982_6099_2.jpg", 
    "course_url": "https://www.udemy.com/death-by-powerpoint-to-killer-presentation/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-07T10:18:09Z"
}