{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course enables you to know more details about the data mining and ETL techniques. Whether you are new to Excel or an advanced user, Grey Campus Power BI course will cover what you need to know to become a Power BI User and how to gather and decode the data from multiple sources using advanced Ms Excel tools. <br></p><p>At the end of the course, participants would learn/use/acquire the following techniques/knowledge:</p><ul><li>Explore and connect to data sources using Power Query</li><li>Using ETL techniques to gather data from multiple sources - Wikipedia, Oracle MySQL DB &amp; others</li><li>Comprehend the Power Pivot user interface</li><li>Extract and transform data using Power Query</li><li>Build a cascading relationship and manage data models</li><li>Build a relationship between tables from different sources</li></ul><p>Each and every topic mentioned above are explained in the Hands-on videos. Exercises and datasets included in this course are useful to practice and implement the concepts learned in this course. For your reference,additional material is also provided.</p><p>This are course components included in the course:</p><ul><li>Hands-on videos.</li><li>Mock Exams</li><li>Datasets</li><li>Additional Material</li><li>Exercises</li></ul><p>This course is is intended for the analysts and business users who are willing to explore the Power BI tools present in Microsoft Excel 2013. This training is best suited for all business professionals: data analysts, developers, IT professionals, project leads, and project managers. This course is best apt to enhance your decoding skills in excel using various tools and techniques.</p>", 
    "end_date": null, 
    "title": "Decoding Data Mining and ETL techniques with MS Excel 2013", 
    "price": "20.00", 
    "instructors": "GreyCampus Inc.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667646_23ae_2.jpg", 
    "course_url": "https://www.udemy.com/decoding-data-mining-and-etl-techniques-with-ms-excel-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T08:44:57Z"
}