{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>¿Deseas aprender Excel a un ritmo <strong style=\"\"><em style=\"\">eficiente y rápido</em></strong>? éste es el curso, te enseñaremos de una manera muy práctica a través de distintos ejercicios los cuales te llevaran a desarrollar las capacidades técnicas y lógicas.</p> <p>El curso cuenta con <strong style=\"\">material extra</strong> descargable de todos los ejercicios.</p><p>En <strong style=\"\"><em style=\"\">menos de 4 horas</em></strong> lograras manejar elementos básicos y esenciales del mismo.</p><p><strong style=\"\"><em style=\"\">El curso te llevara paso a paso</em></strong> a trabajar con operaciones básicas en las hojas de cálculo, manejo de fórmulas y funciones esenciales de toda categoría, gráficos, tablas, operaciones de bases de datos, filtro de datos, formato condicional, trucos esenciales y mucho más.</p><p><strong style=\"\">Si te das cuenta al momento de manejar Excel hay 2 tipos de personas:</strong> Las que lo hacen bien, estos manejan una hoja de cálculo de forma regular <em style=\"\"><strong style=\"\">y las que saben cómo hacerlo mucho mejor</strong></em>, estos ya tienen en su mente como desarrollar las soluciones, simplemente se sientan y en menos tiempo, dan con el resultado de forma profesional.</p><p><strong style=\"\">¡Qué esperas! </strong>Con este curso queremos que te conviertas en la segunda persona, <em style=\"\"><strong style=\"\">la que sabe lo que hace y cómo hacerlo mucho mejor.</strong></em></p>", 
    "end_date": null, 
    "title": "Domina Excel 2013 Básico - Intermedio en menos de 4 horas", 
    "price": 0, 
    "instructors": "Charlie & Andy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515888_6e0c_2.jpg", 
    "course_url": "https://www.udemy.com/domina-excel-2013-basico-intermedio-en-menos-de-4-horas/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-31T06:37:58Z"
}