{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t      El curso pretende hacer de Power point una herramienta 100% multimedia y sencilla de utilizar ya que muchas veces realizamos presentaciones que dejan mucho que desear, que por lo regular es por falta de conocimiento en el manejo del programa.  </p>  <p style=\"\">  \tFunciona con Power point 2007, 2010 y 2013.  </p>  <p style=\"\">  \t      La terminologia es sencilla, tan solo necesita conocer lo basico de computacion y office.  </p>  <p style=\"\">  \t      Los videos para trabajar estan incluidos, el software (programas) necesarios se descargaran de internet.  </p>  <p style=\"\">  \t      Aproximadamente terminaras el curso en 3 o 4 horas (si lo realiza conforme lo va viendo).  </p>  <p style=\"\">  \t    El curso esta estructurado en 7 secciones, iniciando con la descarga del software necesario, pasando a la instalacion y finalmente edicion y vinculacion con power point. Tambien existe una seccion de posibles errores en la cual pueden revisar si existe algun contratiempo en la actividad.  </p>  <p style=\"\">  \t    Realizar este curso te guiara practicamente para realizar una presentacion de calidad profesional, llendo desde lo mas basico hasta lo mas complejo en una curva de complejidad relativamente sencilla. No solo sirve para hacer una presentacion del sistema solar, sino que tambien expandira tu imaginacion hacia otros temas.  </p>", 
    "end_date": null, 
    "title": "Domina Powerpoint y úsalo a todo su potencial.", 
    "price": "20.00", 
    "instructors": "Gustavo Mendoza", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308734_fa47_2.jpg", 
    "course_url": "https://www.udemy.com/power-point-a-todo-su-potencial/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-27T00:15:53Z"
}