{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>El curso que vas a ver a continuación llamado “<strong>Domina Excel en cinco horas</strong>”, tiene como objetivo principal el dotar al alumno que tiene unos conocimientos básicos de Excel, de las herramientas necesarias para que se convierta en un profesional de la hoja de cálculo más utilizada del mercado.</p>\n\n<p>Microsoft Excel es la herramienta por excelencia para <strong>el tratamiento automatizado</strong> de muchos de los datos con los que se trabajan en una empresa. Por eso es muy valorable el disponer en el CV  de conocimientos avanzados de esta hoja de cálculo. </p>\n\n<p>Gracias a la creación de plantillas, se pueden gestionar aspectos contables, financieros e incluso de Recursos Humanos con los conocimientos adecuados y que yo te aseguro que <strong>adquirirás en este curso.</strong></p>\n\n<p>Muchos usuarios creen que saben manejar Microsoft Excel, pero solo se limitan a las operaciones básicas, dejando de lado algunas funcionalidades que las consideran <strong>complejas</strong> o que creen de manera errónea que no solucionan problemas de su trabajo diario.</p>\n\n<p>En este curso aprenderás a manejar funciones complejas, organizar los datos, analizarlos, crear tablas dinámicas, incluso automatizar tareas repetitivas para hacer <strong>el trabajo mucho más fácil y sobre todo productivo. </strong></p>\n\n<p>Uno de los bloques incluidos en el curso es el de <strong>Seguridad</strong>, en el que te voy a presentar como proteger y auditar la hoja de cálculo. Con la protección podrás limitar la modificación de ciertas celdas y con la auditoria podrás realizar una búsqueda rápida de errores, para conocer el origen de dicho error.</p>\n\n<p>Además en el último  bloque del curso se detallan <strong>cinco plantillas</strong> listas para ser utilizadas, entre las que destaco la plantilla para la gestión de facturas e inventario de cualquier empresa de productos.</p>\n\n<p>Aprovecha la oportunidad que te ofrezco para manejar todas aquellas <strong>funcionalidades avanzadas</strong> que existen en Excel y que nunca te atreviste a utilizar por falta de formación. </p>\n\n<p><strong>¡Te espero en el curso!</strong></p>", 
    "end_date": null, 
    "title": "Domina Excel en CINCO HORAS", 
    "price": "20.00", 
    "instructors": "Federico Huércano Ruiz", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/803132_75ce_2.jpg", 
    "course_url": "https://www.udemy.com/domina-excel-en-cinco-horas/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T19:27:31Z"
}