{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><em>Do you wish you knew how to effortlessly navigate a spreadsheet and easily find trends and abnormalities in the data? Do you wish you could create informative reports that really show off your numbers? Do you wish you could save time by knowing how to effectively use Excel to re-arrange and clean up your data? If so, this is the right course for you!</em></p><p>Instead of walking through individual features of Microsoft Excel one by one, this course focuses on the end result and shows you how to accomplish typical business scenarios by effectively using Excel 2013. </p><p>The course is structured into 6 sections with a total of 11 lectures. Each lecture is taught by Productivity Expert and ex-Microsoft employee, Ulrika Hedlund who shares her extensive knowledge of using Microsoft Excel 2013 effectively. Each lecture contains high-quality, High-Definition tutorial videos showing step by step how to accomplish the covered scenario. Sample spreadsheets are provided where necessary to enable students to follow along and perform the steps covered in the lecture. Full transcripts with screenshots (so called \"User Guides\") are available for download so that the steps covered in the lectures can be referenced at any time. To keep you focused and to provide a way for you to test your learning, quizzes are available after lectures and after the course as a whole. </p>", 
    "end_date": null, 
    "title": "Effective use of Excel 2013 in real life", 
    "price": "20.00", 
    "instructors": "Business  Productivity", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508010_442b.jpg", 
    "course_url": "https://www.udemy.com/effectiveexcel2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T11:19:13Z"
}