{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t      Do you wish you could effectively organize your ideas, research and notes in one place? Do you wish you knew how to take really effective meeting minutes? Do you wish you knew how to use OneNote to collaborate on notebooks, easily find information you're looking for and access your notes from anywhere? If so this is the right course for you!  </p>  <p style=\"\">  \t<strong>In this course you will learn how to use OneNote effectively to better organize information related to all aspects of your life. </strong>  </p>  <p style=\"\">  \t  Learn more about:  </p>  <ul>  \t<li>How to take effective notes</li>  \t<li>How to get organized with a digital notebook</li>  \t<li>How to take creative notes from anywhere</li>  \t<li>How to gather and keep track of your research</li>  \t<li>How to share notes with others</li>  \t<li>How to stay up to date with a shared notebook</li>  \t<li>How to take effective meeting minutes </li>  \t<li>How to conduct a professional job interview</li>  </ul>  <p style=\"\">  \t<strong>Course overview</strong><br style=\"\">  \t    The course is  structured into 5 sections with a total of 9 lectures. Each lecture is  taught by Productivity Expert and ex-Microsoft employee, Ulrika Hedlund  who shares her extensive knowledge in how to get the most out of OneNote  2013. Each lecture contains high-quality, High-Definition tutorial  videos showing step by step how to accomplish the covered scenario.  Full transcripts with screenshots (so called \"User Guides\") are available for download so that the steps covered in the lectures can be referenced at any time. To keep you focused and to provide a way for you to test your learning, quizzes are available after lectures and after the course as a whole.  </p>  <p style=\"\">  \t<strong>Course details</strong>  </p>  <p style=\"\">  \t  In the first lecture “Get organized with a digital notebook\" you will learn how to get started using OneNote, how to create notebooks, how to organize notes and how to quickly find what you're looking for.  </p>  <p style=\"\">  \tIn the next lecture “Take creative notes from anywhere\" you will learn how to use the OneNote Windows App with its innovative interface designed for touch, you'll also learn how to use more advanced tools in OneNote 2013 to take your notes to a whole new level.  </p>  <p style=\"\">  \tIn the lecture “Gather and keep track of your research\" you'll learn how to use OneNote to effectively structure your research. You'll learn how to collect information from various places, how to keep track of online sources and how to summarize everything you need to follow up on.  </p>  <p style=\"\">  \t  When sharing notes with others it is important to stay up to date. In the lecture “Stay up to date with a shared notebook\" you'll learn how to share a notebook with others, how to access your notes from anywhere and how to stay up to date on changes others have made in the notebook.  </p>  <p style=\"\">  \t  Taking notes during meetings using OneNote is fast and easy. In lecture 7 and 8 you will learn how to take effective meeting notes and also how to conduct a professional job interview when using OneNote. You will learn how to use tags to keep track of action items, how to convert handwritten notes to text, how to share notes with others and how to protect sensitive information using passwords.  </p>  <p style=\"\">  \t<strong>Do yourself a favor and learn how to effectively use OneNote</strong>  </p>  <p style=\"\">  \t  OneNote can really help you keep track of important information, it can help your team stay up to date and it can make meetings more effective. To conclude, taking smart and effective notes requires some practice and a bit of discipline. Using a digital notebook like OneNote to structure and share your notes is a great way to increase your productivity.  </p>    ", 
    "end_date": null, 
    "title": "Effective use of OneNote 2013 in real life", 
    "price": "20.00", 
    "instructors": "Business  Productivity", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399808_c682_4.jpg", 
    "course_url": "https://www.udemy.com/onenote2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T06:02:55Z"
}