{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Sie möchten Excel an Ihre Bedürfnisse anpassen, Berechnungen automatisieren, eigene Dialogfelder erstellen und noch vieles mehr? Mit diesem Training kommen Sie besonders leicht zum Ziel. Thomas Theis zeigt Ihnen Schritt für Schritt anhand von zahlreichen Praxisbeispielen, wie Sie Makros und VBA-Funktionen für typische Anwendungszwecke erstellen. Die Erläuterungen sind anschaulich und verständlich, sodass sich auch Programmiereinsteiger mühelos zurechtfinden. Das Training bietet Ihnen zudem zahlreiche VBA-Beispiele, die Sie ganz leicht an Ihre Bedürfnisse anpassen können. So lernen Sie besonders schnell und anschaulich, wie Sie den Funktionsumfang von Excel mit Ihren eigenen Makros und VBA-Funktionen erweitern. Für alle Office-Versionen von 2007 bis 2016!</p><ul><li>Eigene Excel-Funktionen mit VBA entwickeln</li><li>Keine Vorkenntnisse erforderlich!</li><li>Für alle Excel-Versionen von MS Office 2007 bis MS Office 2016!</li><li>Mit zahlreichen VBA-Beispielen und Musterlösungen</li></ul><p>Thomas Theis, Ingenieur für technische Informatik, verfügt über langjährige Erfahrung als EDV-Dozent, unter anderem an der Fachhochschule Aachen, und als Ausbilder für Fachinformatiker. Er leitet Schulungen zu VBA, Java, Python, C/C++ und Office-Themen. Als langjähriger Programmiertrainer weiß er um die vielen Stolperfallen, mit denen Einsteiger konfrontiert werden. Seine Spezialität sind daher besonders anschauliche Beispiele aus der Praxis, die zum Nachprogrammieren einladen.<br></p>", 
    "end_date": null, 
    "title": "Einstieg in VBA mit Excel", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659362_358a.jpg", 
    "course_url": "https://www.udemy.com/einstieg-in-vba-mit-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T20:53:14Z"
}