{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t                 As every Engineer needs to do many daily calculations especially using modern standards like EUROCODES, the need to write custom software solutions is more and more real. Especially if standards includes many complex formulas which are hardly calculated using pocket computers as it was 30 years ago. Then it came programmable pocket computers, I clearly remember as I had SHARP programmable computer, where it was possible to write a complex software, but you couldn’t print the results as it is possible now. So today it is possible just by using Microsoft Excel and it’s programming abilities to write real software which can solve all daily engineering calculations with ease.  </p>  <p style=\"\">  \t <strong style=\"\">What does engineer need? </strong>  </p>  <p style=\"\">  \t             So what does engineer need when creating calculations? First there are input parameters, which should be entered on a very simple and a quick way, then a simple sketch as a graphical representation of the basis of calculation with annotations of input parameters. After that engineer needs to define the mathematical procedure which could be very simple, but it should also enable him, to write also more complex formulas or iterations. This is very easy to do with Excel.  </p>  <p style=\"\">  \t<strong style=\"\">Course Structure</strong>  </p>  <p style=\"\">  \t        In this course I will show you that you do not need to be a software developer to create your own customized engineering calculations in a minutes. What is maybe the most important, you can update formulas in your calculation any time you want. This is the solution that every engineer needs, because it offers open-source solution with powerfull programable tools, but on the other side simple enough to be done instantly.  </p>  <p style=\"\">  \t        We will learn the following topics:<br style=\"\">  \t         - How to create cells where input parameters should be entered<br style=\"\">  \t       - How to create a sketch with anotations of input parameters<br style=\"\">  \t       - How to prepare cells where results of calculation will be written<br style=\"\">  \t       - How to create a push button, where you will trigger start of the calculation<br style=\"\">  \t       - How to write code to perform calculation<br style=\"\">  \t       - How to write code to display the results of calculation<br style=\"\">  \t       - How to perform calculation  </p>  <p style=\"\">  \t        This course will also show you how to write the software for practical engineering calculation for structural analysis. I will show you in detail, how to enter data, define formulas and actually perform calculation, including how to display results and format cells for results of calculation.  </p>  <p style=\"\">  \t        I will provide you with an easy-to-follow material explanation, all steps including source code will be explained in detail.  </p>", 
    "end_date": null, 
    "title": "Engineering Calculations using Microsoft Excel", 
    "price": "50.00", 
    "instructors": "Primoz Kvaternik, M.Eng.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/138184_487b_7.jpg", 
    "course_url": "https://www.udemy.com/engineering-calculations-using-microsoft-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-26T17:33:02Z"
}