{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Dieses Training macht Sie fit für den großen Auftritt! Matthias Garten, führender Experte für multimediale Präsentationen, bietet Ihnen weit mehr als die übliche PowerPoint-Schulung. Über den effizienten Einsatz der Software hinaus lernen Sie mit diesem Training gründlich und anschaulich, wie Sie alle Anforderungen einer gelungenen Präsentation meistern. Sie erfahren alles über stimmige Konzeption, überzeugende Texte, wirkungsvolle Visualisierungen und den sicheren Umgang mit Software und Hardware. Inklusive Video-Coachings mit wertvollen Profi-Tipps für den souveränen Auftritt vor Ihrem Publikum.</p>\n\n<ul><li>Profi-Tipps zu Konzeption, Gestaltung, Text und Vortrag\n</li><li>Coaching-Videos für überzeugendes Auftreten\n</li><li>Alle Beispiele als Vorlagen</li></ul>\n\n<p><br>Matthias Garten ist Experte für Präsentationen mit Microsoft PowerPoint. Er leitet Seminare, berät Unternehmen und schult Anwender. Dabei geht es ihm nicht nur um »Showeffekte«, sondern um Tipps und Anleitungen, die sich auch wirklich vor jedem Publikum umsetzen lassen. In seine Bücher und Trainings fließen zwanzig Jahre Schulungen, Vorträge und unzählige Fragen seiner Seminar-Teilnehmer mit ein. Matthias Garten leitet die Agentur smavicon Best Business Presentations und ist Mitglied der German Speaker Association.<br></p>", 
    "end_date": null, 
    "title": "Erfolgreich präsentieren mit PowerPoint 2010", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823164_5e35.jpg", 
    "course_url": "https://www.udemy.com/erfolgreich-praesentieren-mit-powerpoint-2010/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T20:42:38Z"
}