{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Master Automation by Learning the Ins and Outs of Microsoft Visual Basic for Applications (VBA) for Excel</strong></p><p style=\"\">In <em style=\"\"><strong style=\"\"><strong style=\"\"><em style=\"\"></em></strong>Essential VBA Training for Excel</strong></em> - get up to speed on using VBA to help automate time-consuming procedures in Excel.</p><p style=\"\">Great for automating repetitive tasks and operations that you perform frequently, VBA is a powerful tool to increase your productivity. </p><p style=\"\"><strong style=\"\">Contents and Overview</strong></p><p style=\"\">The course is designed for individuals and professionals who are new to VBA and who are seeking practical ways to automate tasks in Microsoft Excel that are performed frequently.</p><p style=\"\">Through 4 hours of video lectures, exercise files, and an optional quiz, you&#039;ll learn the essentials you need to know to create powerful macros using VBA for Excel.</p><p style=\"\">Find out how to use the VBA editor, VBA syntax, keywords, and comments. </p><p style=\"\">Discover how to define and manage variables, set up subroutines, and create functions.</p><p style=\"\">Also, find out how to use input boxes and message boxes to interact with end users.</p><p style=\"\">Learn practical methods for using macro errors to improve your VBA code.</p><p style=\"\">When you complete this course, you&#039;ll be well on your way to using VBA macros in Excel to help you and others automate tasks and operations performed frequently.</p><p style=\"\"><strong style=\"\">This course includes:</strong></p><ul style=\"\"><li style=\"\">Exercise files</li><li style=\"\">An optional quiz to test what you&#039;ve learned</li><li style=\"\">A certificate of completion</li></ul><p style=\"\">All of our videos are high definition; therefore, they are <strong style=\"\">best viewed with the HD setting on</strong> and the videos enlarged.</p>", 
    "end_date": null, 
    "title": "Essential VBA Training for Excel - Automate Repetitive Tasks", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540962_8779.jpg", 
    "course_url": "https://www.udemy.com/essential-vba-training-for-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T07:37:56Z"
}