{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p>What students are saying:</p><p><strong>\"Awesome course, really simple and easy to follow thanks for an amazing course.\"</strong> - Melvar Miranda</p><p><strong>\"These guys definitely know what they are talking about. Very knowledgeable and they offer a lot of helpful lectures that make excel easier and more easier!\" </strong>- Cryed Talle</p><p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p>Update: More than 1000 students enrolled in the first week!</p><p><strong></strong>Study after study concludes that Excel skills are the hot commodity in today's job market. The fact is that you <strong>need </strong>Excel to survive in the workplace. This course will give you the skills that you need to use and discuss Excel confidently with your coworkers and bosses. The best part is that it only takes <strong>1 hour</strong>, and you keep the skills for a lifetime. I have cut out all the fluff so you can quickly learn Excel and move on with your busy life!</p><p>In this course you will learn:</p><ul><li>The Excel interface.</li><li>Quick tricks to improve your Excel productivity <strong>5x</strong> or more.</li><li>To create formulas and use functions</li><li>To make your Excel workbook look professional and presentable.</li><li>Much more -<strong> I will be updating this course regularly for the next year with free content!</strong></li></ul><p>In addition to the video courses and exercise files, you will have access to me! Come visit me during my office hours on Tuesdays &amp; Thursdays from 10am - 12pm EST. This will give you a chance to ask any questions that you may have, or just stop by to say hello! All you have to do is go to the discussion section of the course and post whatever you'd like me to see.</p><strong></strong>", 
    "end_date": null, 
    "title": "Excel for the Absolute Beginner", 
    "price": "20.00", 
    "instructors": "Think Forward Online Training", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515802_526c_3.jpg", 
    "course_url": "https://www.udemy.com/learnexcel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-31T02:51:33Z"
}