{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Great news! I have added a new bonus section to this course<strong> \"Student Questions Answered\"!</strong><br></p>\n\n<p>In this section you will find custom made tutorials to answer <strong>YOUR</strong> specific questions! Just drop a message in the discussion board, and if I can't answer it in a simple message, I'll make a video just for you!</p>\n\n<p><strong>What other students are saying:</strong><br></p>\n\n<ul><li><strong>Amazing Customer Service and Support!</strong> - <em>David Keegan</em></li><li><strong>Great Course</strong> - <em>Terry Wells</em></li><li><strong>Excel Made Easy - Great Class!!!</strong> - <em>George Peters</em></li><li><strong>Extremely helpful course</strong> - <em>Jonathan Balmforth</em></li><li><strong>Fantastic Course</strong> - <em>Lee Johnson</em></li><li><strong>Exactly what I was looking for!</strong> - <em>Nickie</em></li><li><strong>Brilliant Course</strong><em> </em><em>- Samantha Thorne</em></li><li><strong>THE course for beginners</strong> - <em>Beatrice</em></li></ul>\n\n<p><strong><br></strong></p>\n\n<p><strong>Over 2,500 satisfied students enrolled in my courses</strong></p><ul><li><strong>Average review HIGHER than the other Microsoft courses on Udemy!</strong></li><li><strong>Average minutes viewed 27% HIGHER than other Microsoft courses!</strong></li><li><strong>Take a look at the 5 star reviews!</strong></li><li><strong>New students join THIS Excel course every week!</strong></li></ul>\n\n<p><strong>Why wait? Join over TWO THOUSAND students who are becoming Excel masters!</strong><br></p>\n\n<p><strong>!!! UDEMY INSTRUCTOR BADGES EARNED FOR THIS COURSE: !!!<br></strong></p>\n\n<ul><li><strong>Level 1 Responder</strong></li><li><strong>Level 2 Responder</strong></li><li><strong>Level 3 Responder</strong></li><li><strong>Builder Instructor</strong></li><li><strong>Genius Instructor</strong></li><li><strong>Level 2 Riddler</strong></li></ul>\n\n<p><em>Next to soft skills, being able to use Microsoft Excel well is probably one of the most sought after skills employers are looking for in todays competitive market. Make sure you can compete…</em><br></p>\n\n<ul><li>Do you want to master one of the must have skills for any work place?</li><li>Are you willing to invest a little time now for your own future?</li><li>Want to learn some powerful, little known tools that most users don't know about?</li><li>Do you want to get ahead of your competition?</li></ul>\n\n<p>If you are a complete beginner looking to <strong>master Excel</strong>, or you just want to brush up on the basics, you've come to the right place. If you want to <strong>earn more money</strong> by developing a skill set that todays employers demand, <strong>this is the course is for you</strong>!<br></p>\n\n<p>Getting to grips with Excel will give you a distinct advantage in whatever work you currently do, and can open the door to new opportunities. Many of my students have gone on to get better paying jobs, or even start their own businesses, using the very skills you will soon master.</p>\n\n<p><strong><em>I spent over 20 years mastering Excel, so you don't have to!</em></strong></p>\n\n<p>In this course we cover <em>in detail </em>all of the basic functions of Excel, and you will learn not only how to use it, but some powerful tools to allow you <em>understand</em> how it works. There is a difference between repeating something and understanding it.</p>\n\n<p><strong>Who is this course aimed at?</strong></p>\n\n<p>Complete beginners, and those who want to build a solid foundation upon which to build their skills.</p>\n\n<p><strong>How is it structured?</strong></p>\n\n<p>Together we concentrate on building a single complete project from scratch, using all the basic functions and give you a thorough understanding. I know your time is valuable, so most lectures are between 3-5 minutes, allowing you to dip in and out when it's convenient for you. This also maximizes your learning, and makes it easy if you need to go back to refresh your memory...no need to click through a 40 minute lecture to find what you're looking for! There are screencasts, lots of quizzes, a few presentations, pdfs, downloadable files...all designed to optimize your learning.</p>\n\n<p><strong>What do I get with this course?</strong></p>\n\n<ul><li>Lifetime access to over <strong>3.5 hours</strong> of content.</li><li>Almost <strong>50</strong> bite-size lectures, each covering a specific topic <em>in detail</em>. Some of which I have <em>never seen taught before!</em></li><li>Multiple quizzes to ensure you cement your learning!</li><li>Downloadable source file, and pdfs that you can take with you and quickly refer back to if you are away from home.</li><li>Access to the forum, so if you have any questions, you can ask me!</li></ul>\n\n<p><strong>Why take THIS course?</strong></p>\n\n<p>I have been using Excel for over 20 years, but there is a difference between being good at something and being able to teach it. In that time I have taught hundreds of people how to master its power. Because I have taught so many people, I know not to assume you already understand something, and I have probably already heard every question you are likely to have.</p>\n\n<p>This course took over 4 months to produce, and has been tested extensively with scores of people. If something didn't work, or wasn't clear, it was revised until it did. Of course, we never stop learning, and I will continue to develop this course and your skills with your feedback. And remember, if you have a question, post it in the forum and I will answer it for you personally.</p>\n\n<p>Get this course now, and...enjoy!</p>\n\n<p>Alan</p>", 
    "end_date": null, 
    "title": "Excel Essentials: Level 1 Basics - Master Excel Step-By-Step", 
    "price": "20.00", 
    "instructors": "Alan Jarvis", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493436_c390_4.jpg", 
    "course_url": "https://www.udemy.com/excel-from-zero-to-hero-level-1-complete-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-04T17:11:41Z"
}