{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>These days almost any job requires data analysis &amp; presentation of results. While anyone can put a list of values in Excel &amp; sum them up, not everyone can do advanced analysis, create interactive charts, summarize data intelligently using PowerPivot and PowerBI tools, and finally present output in stunning Dashboards.</p><p><strong>Learn PowerPivot and Power Business Intelligence Tools that are rarely found on Excel users and transform to an Excel Star!</strong><br></p><p><strong></strong></p><p><strong>Content and Overview</strong><br><strong></strong><em><strong></strong></em></p><p><strong></strong>This course is a guide with simple step by step instructions to walk you through creating business intelligence reports and dashboards in Excel, quickly and efficiently. <strong></strong>The course has been created with the version of Microsoft Excel 2013</p><p><strong></strong>Excel Dashboards are powerful if you want to present and report data. However building a Dashboard is a complex process. In this course I'll walk you through the <strong>most effective ways and tools to build Excel Dashboards</strong> that will wow management both visually and substantively. We'll use <strong>Microsoft Excel free Power Pivot, Power View tools and DAX Formula Language</strong> to <strong>analyze huge amounts of business data fast and transform data into bottom-line results – no programming required!</strong></p><p><strong></strong><strong>Note:</strong><strong> </strong><em><strong>Power View</strong></em> is a new interactive tool available <em><strong>only in Excel 2013</strong></em> (<em><strong>PowerPivot</strong></em> is available in <em>both versions</em> - Excel 2010 and Excel 2013)<strong></strong></p><p>You'll have<strong> </strong><strong>lifetime access</strong> to watch the videos whenever you like. If you're not 100% satisfied there is a <strong>30 day money back guarantee!</strong></p><p>Plus you will get <strong>fast and responsive support within 24 hours.</strong><strong></strong></p><p>Free downloadable Excel working files are included to allow you to follow along using the same material I use throughout the lectures. You can download all of them.</p><p><strong><em>What are you waiting for? Enroll now and make your Excel Dashboards look amazing!</em></strong></p><p><strong><br></strong><strong><em></em></strong><strong></strong></p><p><strong></strong><strong>What you'll learn:</strong></p><ul><li>Dashboard design principles, tips and tricks</li><li>Understand and install the Excel Power Pivot and Power View add-ins</li><li>Import data from spreadsheets, Access, SQL, text files and other sources</li><li>Add calculated fields and columns with Data Analysis Expressions (DAX) formula language</li><li>Create complex reporting systems</li><li>Design your Excel Dashboard with link buttons</li><li>What are KPI's and add key metrics</li><li>Create mind blowing Excel Pivot Charts from PowerPivot</li><li>Create powerful reports using Slicers and Timeline</li><li>Make an amazing interactive sales map using Excel 2013 Power View powerful add-in</li><li>Summarize data with Matrices, Cards and Tiles </li><li>Perform simple-to-sophisticated calculations like Month to date and Year to date</li><li>Analyze multiple tables together without the need to ever write VLOOKUP formulas again</li></ul><p><strong>Enroll now and master the creation of interactive Excel Dashboards!</strong></p><p>100% risk free – <strong>30 day money back guarantee! - Lifetime access</strong></p><p><strong><br></strong><strong></strong><strong></strong></p><p><strong></strong><strong>Who is this course for?</strong></p><p><strong><em></em></strong><em></em>This course assumes that you have a basic knowledge of Excel 2010 or Excel 2013. You don't need to be a master of Excel. Only basic prior experience in Excel or Spreadsheets is required to get the most out of this Excel course.<em><strong></strong></em></p><p>This course is also ideal for data analysts, MIS professionals, business analysts, managers, dashboard makers, business intelligence professionals and students.</p><p>At the end of this Excel class you will be given a <strong>Certificate of Completion.</strong></p><p><strong><br></strong></p><p><strong>STUDENT REVIEWS:</strong></p><p><strong>\"I highly recommend this course. It was exactly what I needed to jump start my career. I learned far more than I expected. The instructor is excellent !!!!!!!!\"</strong> - Troy Newman</p><p><strong>===================================================================</strong></p><p><strong>\"A thorough tutorial on using charts, pivot tables, etc to create dashboard reporting. Very well presented and explain complex issues in a simple way. It is clear and easy to understand and has helped me develop reporting dashboards. Excellent!\"</strong> - Albert Loomer</p><p><strong>===================================================================</strong></p><p><strong>\"Knowing how to create charts and how to create charts USEFULLY are different skills. Andreas helps the viewer use Excel skills to produce truly useful dashboards. Highly recommend for those looking to learn data presentation.\"</strong> - David Anderson</p><p><strong>===================================================================</strong></p><strong><em><strong><em>Enrol now and enjoy!</em></strong></em></strong>", 
    "end_date": null, 
    "title": "Excel Power Pivot & Excel Power BI Masterclass", 
    "price": "20.00", 
    "instructors": "Andreas Exadaktylos", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419404_543b_3.jpg", 
    "course_url": "https://www.udemy.com/stunning-excel-dashboards-with-powerpivot-and-power-view/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T16:44:10Z"
}