{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">Excel, create by Doing! Are you looking for a useful Excel course where you truly learn something practical and create a valuable tool? This course is for you!</p><p style=\"\">======================================================================</p><p style=\"\"><strong style=\"\">LEARN HOW YOU CAN MAKE AN ADVANCED DASHBOARD</strong></p><p style=\"\">======================================================================<br style=\"\"></p><p style=\"\"><strong style=\"\">Dashboard is the new &quot;hot topic&quot;. </strong></p><p style=\"\">Many people are thinking about dashboards and stop using charts for reports! Excel dashboards are really core essential graphs displaying key information. </p><p style=\"\">A dashboard is nothing more than getting the right data displayed for the right person! What important is for you does not have to be important for me! In this course you learn how you can make an Advanced Dashboard in Excel</p><p style=\"\">======================================================================</p><p style=\"\"><span style=\"\"><strong style=\"\">CREATING A DASHBOARD IS EASY EVERYBODY CAN DO IT!</strong></span></p><p style=\"\">======================================================================</p><p style=\"\">This course is designed to show you how easy it really is. You will notice that the WAY A CHART presents data determines the value of your dashboard. </p><p style=\"\">Understanding the fundamentals is important, but I truly belief you have to take action! This course is based on full action. Once you do that you will notice quickly how easy it is. </p><p style=\"\">You will learn how to make a triple chart dashboard that has buttons that will  </p><p style=\"\">======================================================================</p><p style=\"\"><span style=\"\"><span style=\"\"><strong style=\"\">MY GOAL IS THAT YOU PUT EXCEL TO WORK FOR YOU!</strong></span></span></p><p style=\"\">======================================================================</p><p style=\"\">Excel is powerful but if you do not understand how to use it, your knowledge remains powerless. This course will show you how to use just a few functions and create in the meanwhile a very useful tool. This learning method is named CREATE BY DOING!</p><p style=\"\">You will learn that Excel can save you a ton of time! All you have to do is take the information in this course and practice!</p><p style=\"\">======================================================================</p><p style=\"\"><span style=\"\"><span style=\"\"><span style=\"\"><strong style=\"\">WHY SHOULD I TAKE THIS COURSE? YOU COMPETITORS HAS A BIGGER COURSE!</strong></span></span></span></p><p style=\"\">======================================================================</p><p style=\"\">I understand your point, but do you know the difference between having a toolbox and understanding to use just only 2 tools. I can teach you every tool you want that you can add all the tools in your toolbox. But would you be able to see the practical value out of it? I do not think so.<br style=\"\"></p><p style=\"\">What if I give you just 2 tools, a screwdriver and a saw and teach you how to create a great piece of furniture? That would be 100% more valuable and that is what I do! I teach you to make useful tools that you can use for your personal life. By doing you create your furniture! That has a lifelong value!</p><p style=\"\">There is a real difference between knowledge and power. Knowledge is only potential power, without the practical use of it, it becomes powerless. Power is the knowledge that you apply in your daily life! This course is powerful because you use the tools and put it into great use.</p><p style=\"\"><strong style=\"\">Just check it and test it out for a month!</strong></p><p style=\"\">To make it even better, I offer this course as 30 day money back. This basically means that if this course is not right for you, you can get your money back in a blink of an eye. There is truly no reason not to do it and it has no risk at all.</p><p style=\"\">Start taking actions right now and take this course. In life you have winners and losers. The winners take action at once and the losers keep on looking and waiting for the right time. In life there is never a right time except NOW! I truly belief you are winner because you are looking and reading this course.</p><p style=\"\">Alright winner, it is time to take action! Click on “Take this course&quot; and start making great pieces of Excel Furniture!</p>", 
    "end_date": null, 
    "title": "Excellence in Excel! Create an advanced Excel Dashboard!", 
    "price": "20.00", 
    "instructors": "Nicky Wong", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/474046_ddd7_3.jpg", 
    "course_url": "https://www.udemy.com/excel-dashboard-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-12T09:35:10Z"
}