{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \tIn this Excel Charts - In depth video course, <a href=\"http://nurturetechacademy.in/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">Nurture Tech Academy</a> introduces you to the most simplest way to understand how to create a Chart and other advanced charting techniques.  </p>  <p>  \tIn this online course we will try to find out first that in which circumstances <strong style=\"\">which chart type is most appropriate</strong> to present our Excel data.  </p>  <p>  \tThis program will cover the basics of Excel Charts, <strong style=\"\">types of charts</strong> in Excel (e.g. Column, Bar, Line, Pie, Pie of Pie, Bar of Pie, Area, bubble chart etc.).  </p>  <p>  \tThen will gradually move to the Advanced Charting techniques like, selecting the a chart elements, how to modify the chart area, plot area, working with chart titles, axis titles, data series, <strong style=\"\">handling missing data, modifying 3-D charts, </strong>creating a <strong style=\"\">combination of Charts</strong> in one single chart type, Creating and saving <strong style=\"\">Chart templates</strong> etc.  </p>  <p>  \tThen we will also see some Excel charting tricks like creating a <strong style=\"\">Picture Chart </strong>etc.  </p>  <p>  \tBy the completion of this online training course, you will be fully versed, and capable of using any any types of Charts in Microsoft Excel 2007/2010/2013 in a commercial Environment.  </p>", 
    "end_date": null, 
    "title": "Excel Charts - In depth", 
    "price": "20.00", 
    "instructors": "Nurture Tech Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118762_9469_4.jpg", 
    "course_url": "https://www.udemy.com/ntaexcelcharts/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-12T15:50:52Z"
}