{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\"></strong><strong style=\"\">Excel, discover its real power!</strong></p> <ol style=\"\"><li>Have you ever understood the <strong style=\"\"><em style=\"\">real power and purpose of Excel</em></strong>?</li><li>Do you understand how to create <strong style=\"\"><em style=\"\">real time saving Excel tools</em></strong>?</li><li>Do you truly find it difficult because there is too many formula`s to understand Excel?</li><li>Do you wonder how people can deal with so many boring facts in so less time and you struggle to get ahead in Excel?</li><li>Do you want to make <em style=\"\">real use of Excel</em> and save time and money?</li></ol><p>Excel does not have to be boring! We can create highly creative Speed o Meter dashboard that has a real function!<br style=\"\"></p><p>In this course you will start to understand how you can create useful tools that are all interconnected! Excel is not a spreadsheet. It is a time-saving tool if you really understand how it works.</p><p>In this course you will see what you can do and how you can do it! In this course you will not get the entire tool box. If you do not know how to use the basic tools you do not need to know all the tools. You only need to know the right tools for you!</p><p>In this course you learn, do and create. I truly belief this course is the best course for you because you will learn and practice by creating your tool. You will see instantly how Excel really works.</p><p>Excel is not a Spreadsheet! <strong style=\"\">Excel is an answering machine</strong>. It should give you answers and validate information that you put in! </p><p>======================================================================</p><p><strong style=\"\">This course is an absolute time saver!</strong></p><p>Now you can try this as well! This course is 30 days backed up by Udemy. You can try and discover it yourself and if you discover that this course is not the right course for you! You can get the money back in a blink of an eye!</p><p>=======================================================================</p><p><strong style=\"\">Time is the most valuable thing in life!</strong></p><p>My goal in every Excel course I create is that time is the most valuable thing in life. Every tool will earn you back time. In this course you receive all tricks to win and own your time! So, this is your time to take action. Get your time back and click on the button &quot;<strong style=\"\">Take this course</strong>&quot;!</p><p>Life does not wait for the waiters. Go and take this course now!</p>", 
    "end_date": null, 
    "title": "Excellence in Excel! Create a Meter Dashboard tool in Excel!", 
    "price": "20.00", 
    "instructors": "Nicky Wong", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442942_5d20_2.jpg", 
    "course_url": "https://www.udemy.com/excel-excel-dashboard/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-09T18:17:22Z"
}