{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong></strong></p>\n\n<p><strong></strong></p>\n\n\n\n<ul><li><strong>13,000+ Students </strong>have enrolled in my <strong>13 Courses!</strong></li><li>The <strong>4.8 Rating</strong><strong> from student reviews </strong>shows the value packed in this course!</li><li><strong>Practicality: </strong>This course has <strong>7 Downloadable Spreadsheets </strong> so that you can follow along with every Section!<strong></strong></li></ul><p>\"I wish I was good at Excel, but it's too technical for me\"<br></p>\n\n\n\n<p>\"Excel confuses me with all those formulas\"</p>\n\n\n\n<p>\"I picked up an Excel book to start learning, hopefully I'll get a better grasp of it soon\"</p>\n\n\n\n<p>I hear excuses and bad approaches when it comes to learning Excel all the time. Here's the truth - Excel is extremely complex and is not an easy thing to master. However, I truly believe that you can hack your way through learning it - that is, know exactly what the most important aspects in Excel are and master them one by one. That's why I organised this course into so-called \"Hacks\", so that you can focus on the most important information first and foremost.</p>\n\n\n\n<p><strong>Have you ever been confused by the sheer complexity of Excel? Ever struggled with an annoying problem that you couldn't solve fast enough? Or maybe you're just looking to start learning to use Excel and master it quickly...</strong></p>\n\n\n\n<p>A lot of the Excel Trainings out there throw a bunch of formulas at you and teach you how to use them. However, they neglect to tell you their practical applications and what the most important shortcuts are.</p>\n\n\n\n<p>A few years ago I was an Excel rookie. I thought I knew how to use it (what's so hard right?), but found out about my limitations as soon as I started a job in a Financial Controlling role. Everything that I have learned in Excel came as a result of the challenges that I faced on the job and my relentless drive to discover solutions that were more and more efficient. </p>\n\n\n\n<p>The truth is I didn't have one of the most efficient learning curves because nobody told me what the most efficient path to mastering Excel was. </p>\n\n\n\n<p><strong>What do experts do on a daily basis? What are the key formula combinations for particular situations? What sort of tips &amp; tricks do they use to be faster &amp; more efficient when using Excel?</strong></p>\n\n\n\n<p>Those questions led to this course. I bundled all of my knowledge in a way that prioritises the most important Excel Hacks. This will ensure that you will get to your best Excel level in the fastest possible time. Doesn't that sound better than sitting through boring Excel Training Seminars for 8 hours during a whole day?</p>\n\n\n\n<p> <strong>Here's what this course covers:</strong></p>\n\n\n\n<ol> <li><strong>The Excel Essentials </strong> - discover the quickest ways to navigate and manipulate data in Excel so that you can master the basics straight away</li> <li><strong>20+ Quick &amp; Killer Hacks </strong>- These are individual lectures focused on particular Excel hacks which boost your productivity &amp; use of Excel</li> <li><strong>Bulls-Eye Formula Blueprint</strong> - master Excel Formulas by shifting the focus away from HOW they work to WHAT their usability is in practical scenarios</li> </ol>\n\n\n\n<p>And much, much more. Just have a look at the Learning Outcomes.</p>\n\n\n\n<p><strong>The Excel Mastery Guarantee</strong></p>\n\n\n\n<p>I'm extremely confident that if you take action and follow these steps, you will revolutionise your Excel skills at a very fast pace. However, if for any reason you're not satisfied with this course, then I will personally jump on a 30 Minute Skype Call with you and help you get to the next level.</p>\n\n\n\n<p>Nobody can give you a Magic Pill for learning Excel - it takes time &amp; practice. However, if you're aware of the most important shortcuts from the beginning, that will end up saving you countless hours of your precious time.<strong> Take this course now</strong> and join me in this exciting journey!</p>", 
    "end_date": null, 
    "title": "Excel Hacking", 
    "price": "40.00", 
    "instructors": "Dragos Stefanescu, Richard Korbut", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413572_7d82_5.jpg", 
    "course_url": "https://www.udemy.com/excel-hacking-real-strategies-for-excel-masterytemplates/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T22:04:11Z"
}