{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t                    Over 1000 people have taken this course!  </p>  <p>  \t                    When you see conditional formatting in Excel for the first time, you are amazed, to put it mildly. If Excel formatting makes your spreadsheets visually pleasant, conditional formatting in Excel makes them infinitely more powerful and useful. In this easy-to-follow Excel course, you will not only learn the basics of conditional formatting in Excel, but also become comfortable with more advanced conditional formatting techniques, such as conditional formatting based on text, conditional formatting based on another cell, conditional formatting based on a date, or on a range of dates, as well as conditional formatting with formulas, range-based conditional formatting rules and more. This Excel conditional formatting course will quickly build your Excel skills. It will serve you well as an Excel conditional formatting tutorial that takes your productivity to the next level.  </p>  <p>  \t                    When you take this course, you will benefit from over 3 hours of high-quality video material, so you can quickly improve your Excel skills. After you enroll and complete this course, you will have acquired various carefully selected conditional formatting tips and tricks.  </p>  <p>  \t                    This course is designed with a conditional formatting problem-solving approach in mind. The majority of these high-quality video lessons first introduce and define a specific, real-life problem and then provide an elegant conditional formatting based solution, so you can apply the newly-acquired skills immediately.  </p>  <p>  \t                    After you have taken this course, you will:  </p>  <p>  \t                    1) Become more productive in Excel.  </p>  <p>  \t                    2) Enhance your conditional formatting skills.  </p>  <p>  \t                    3) Save time with conditional formatting at work.  </p>  <p>  \t                    4) Make your spreadsheets more dynamic with conditional formatting.  </p>  <p>  \t                    5) Impress your boss, your colleagues, and your clients.  </p>  <p>  \t                    6) Improve your data analysis capabilities with conditional formatting.  </p>  <p>  \t          7) Become comfortable with conditional formatting formula based rules.  </p>  <p>  \t      This Excel course is one of the Easy Excel With Igor series.  The other  high quality Excel tutorials include:  </p>  <p>  \t  &quot;Microsoft Excel Without Pain&quot; that helps you quickly build your foundation skills in Excel;  </p>  <p>  \t  &quot;Data Manipulation In Excel&quot;  allowing you to save up to 90% of time when using Excel for certain data  management tasks;  </p>  <p>  \t    &quot;Excel Pivot Tables Data Analysis Master Class&quot; that takes you  step by step to mastering pivot tables data crunching skills;  </p>  <p>  \t     &quot;Microsoft Excel Charts Master Class&quot; that builds your skills in  creating your skills in Excel charts and graphs.  </p>", 
    "end_date": null, 
    "title": "Excel Conditional Formatting Master Class", 
    "price": "45.00", 
    "instructors": "Igor Ovchinnikov", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/174062_d789_3.jpg", 
    "course_url": "https://www.udemy.com/easy-excel-conditional-formatting-with-igor/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-27T21:12:34Z"
}