{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Excel is probably the most commonly used software in the world for creating charts. And charts are the main tools to visualize the insights from some numbers. Welcome to this Excel Charts and Graphical Objects learning course.<br></p>  <p>Let’s discuss now what you will learn from this course.<br></p>  <p><strong>Basics of Excel Charts: At first you will learn the basics of Excel charts: how to create them quickly and how to choose the right chart type for your data.</strong> </p>  <p><strong>Advanced Chart Techniques:</strong> Then you will work with the advanced tools within different task panes to work with excel charts.</p>  <p><strong>Build some useful Excel charts:</strong> Then I will show you how to build some useful excel charts like: Combo Chart, Picture Chart, Thermometer Chart, Gauge Chart, Comparative Chart and finally the Gantt chart.</p>  <p><strong>Graphical Objects:</strong> Then we shall work with Graphical objects. Graphical objects have many uses when you will present your data for an audience.</p>  <p>Here is not the end of the course. Time to time, I shall add more lectures to the course that will teach you how to face real life data visualization using Excel Charts and Graphical Objects.</p>  <p>By the completion of this training course, you will be fully versed in creating and using Excel charts. So, if you are interested to learn Charts and Graphical objects in Excel, then this course is for you. Thanks for reading. Enjoy the course!</p>", 
    "end_date": null, 
    "title": "Excel Charts & Graphs and SmartArt Graphics for Beginners", 
    "price": "20.00", 
    "instructors": "Excel Academy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690790_1b36_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-excel-charts-and-work-with-smartart-graphics/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T05:50:23Z"
}