{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Última Actualización: 17-Julio-2015</strong></p><p>Se actualizaron los requisitos para obtener el Certificado de Finalización de Curso.</p><p>El dominio de Microsoft Excel es una de las habilidades más buscadas por los empleadores. De hecho, en un gran porcentaje de anuncios de trabajo, para la mayoría de los cargos, las empresas piden como requisito saber utilizar Excel. Si no cumples con este requisito, estarás fuera de mercado y no podrás optar a mejores y más rentables empleos. ¡Aprende hoy Excel para no quedar fuera!</p><p>En este curso veremos, entre otras cosas:</p><ul><li>Conceptos básicos desde cero: hojas de cálculo, filas, columnas, celdas. La idea es que te familiarices con el entorno de Excel.</li><li>Seleccionar, copiar, pegar, cortar, y algunos trucos que pocas personas conocen. Ya vas a tomar ventaja por sobre muchos.</li><li>Realizar cálculos y operaciones matemáticas básicas en Excel. Con esto podrás ahorrar mucho tiempo en actividades de tu trabajo.</li><li>Crear gráficos de barra y gráficos circulares. Lejos es la sección más entretenida y donde podrás impresionar a tu jefe, colegas y futuro empleador.</li></ul><p></p><p>Este curso está dirigido a personas sin conocimientos previo de esta aplicación y a quienes tengan la necesidad de realizar cálculos simples y quieran para ello utilizar Microsoft Excel. Como requisito es necesario contar, al menos, con conocimientos básicos del manejo del sistema operativo, del mouse, manipulación de archivos y carpetas, y conocimientos matemáticos simples.</p>", 
    "end_date": null, 
    "title": "Excel Básico - Obtén Mejores Ingresos, Ascensos y Empleos", 
    "price": "20.00", 
    "instructors": "Alfonso Rinsche", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/187758_5add_3.jpg", 
    "course_url": "https://www.udemy.com/excelintrobas/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-24T11:47:18Z"
}