{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Excel, create by Doing! </strong></p><ol style=\"\"><li style=\"\">Are you looking for a useful Excel course where you truly learn something practical and create a valuable tool? </li><li style=\"\">Do you want to place more charts in Excel only to notice there is too less space in the tab?</li><li style=\"\">Do you want to make your data more clear and reduce the clutter in your spreadsheet?</li></ol><p>If so, this course is for you!</p><p>This course will teach you how to use Excel functions and create dynamic charts. Many people learn Excel functions and all the possible options that you can do with Excel. The real thing is that you will probably not use 80% of the power of Excel.</p><p>Excel is powerful but if you do not understand how to use it, your knowledge remains powerless. This course will show you how to use just a few functions and create in the meanwhile a very useful tool. This learning method is named <strong style=\"\">CREATE BY DOING</strong>!</p><p>If you feel intimidated by Excel do not worry! The real issue is not Excel or You but by the method of learning it! Yes, the way you learn something can be successful or unsuccessful. This course uses the SPEED LEARNING methods of the learning cone. What is that? This is a method development make sure you truly remember 90% of everything you learn. How? Just by doing and following the exercises.</p><p>This course is active, and you have to do the exercises and follow along.</p><p><strong style=\"\">Why should I take this course? Your competitor has a bigger course!</strong></p><p>I understand you point, but do you know the difference between have a toolbox and understanding to use just only 2 tools. I can teach you every tool you want that you can add all the tools in your toolbox. But would you be able to see the practical value out of it? I do not think so.</p><p>What if I give you just 2 tools, a screwdriver and a saw and teach you how to create a great piece of furniture? That would be 100% more valuable and that is what I do! I teach you to make useful tools that you can use for your personal life. By doing you create your furniture! That has a lifelong value!</p><p>There is a real difference between knowledge and power. Knowledge is only potential power, without the practical use of it, it becomes powerless. Power is the knowledge that you apply in your daily life! This course is powerful because you use the tools and put it into great use.</p><p><strong style=\"\">I never succeeded in Excel, is this course suitable for me?</strong></p><p>Success is a path you walk. Learning Excel is exactly the same. Did you fail before; perhaps you took the wrong path. You learned from a bad teacher or a boring book. If you took the wrong path all you need is readjust your path and start walking again. This course truly is a very easy and slow paced course with much repetitions and exercises. The way to learn is by doing and by great explanations. This course has it both many times over!</p><p><strong style=\"\">No risk to take a peak and try it out!</strong></p><p>To make it even better, I offer this course as no risk. This basically means that if this course is not right for you, you can get your money back in a blink of an eye. There is truly no reason not to do it and it has no risk at all.</p><p>Start taking actions right now and take this course. In life you have winners and losers. The winners take action at once and the losers keep on looking and waiting for the right time. In life there is never a right time except NOW! I truly belief you are winner because you are looking and reading this course.</p><p><strong style=\"\">Press &quot;Take this course&quot; now!</strong></p><p>Alright winner, it is time to take action! Click on “Take this course&quot; and start making great pieces of Excel Furniture!</p>", 
    "end_date": null, 
    "title": "Excellence in Excel! Make any chart dynamic in Excel!", 
    "price": "20.00", 
    "instructors": "Nicky Wong", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452232_8c06_2.jpg", 
    "course_url": "https://www.udemy.com/excel-excel-chart/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T14:34:28Z"
}