{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong>Take Excel to the next level with this guide to advanced dashboards and  reporting</strong>  </p>  <p>  \t      This Video Training Course, bundled with the eBook <em>Excel Dashboards &amp; Reports For Dummies</em> is your ticket to advanced analysis with Excel! Find out how  to use this powerful tool for business intelligence and explore the details of  data trending and relationships, creating data visualizations, and more. Part  tech reference and part analytics guide, this resource will help you create  high-impact reports and dashboards today!  </p>  <ul>  \t<li>Make the move to dashboards — create effective       dashboards, make great  reports, and build super models</li>  \t<li>Build the basics — dive into PivotTables, Excel charts,    conditional  formatting, and dynamic labeling</li>  \t<li>Get advanced — dig into the powerful components of  Excel, including those  that show trending, display  performance, group data, and more</li>  \t<li>Share your work — use external data for dashboards and reports and share  your work with the world</li>  \t<li>Go further — take things up a notch with more extensive chart design  principles and safeguards to follow before distributing dashboards</li>  \t<li>Advanced reporting — make interactive interfaces and use macros to  super-charge your reporting</li>  </ul>  <p>  \t<strong>Visit our websites <a href=\"http://www.dummies.com/\" target=\"_blank\" rel=\"nofollow\" class=\"external-link\">For Dummies</a> and <a href=\"http://www.wiley.com/WileyCDA/\" target=\"_blank\" rel=\"nofollow\" class=\"external-link\">Wiley</a></strong>  </p>", 
    "end_date": null, 
    "title": "Excel Dashboards & Reports For Dummies", 
    "price": "50.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/195882_3a30_2.jpg", 
    "course_url": "https://www.udemy.com/excel-dashboards-reports-for-dummies/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-08T19:13:56Z"
}