{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Welcome to my “Excel 2016 Pivot Table” course where you will learn how to create basic pivot tables.</p>\n\n<p>I am Kawser Ahmed, your instructor with this course. I am a full time Excel, Excel VBA and Data Analytics blogger. And I am a corporate Excel trainer in my own country. Monthly around 15,000 Excel users come to my Excel blog and read my Excel and data analysis related articles and tutorials.\n\n  </p>\n\n\n\n<p>At the end of this course: \n\n  </p>\n\n\n\n<ol><li>You will be able to create and update basic pivot table reports using Excel 2016,</li><li>You will be able to realize, why and when you can best use of Excel Pivot Table tool,</li><li>You will be get used to with the features of an Excel Pivot Table Report</li><li>And you will be able to handle the limitations and compatibility issues related Pivot tables.</li></ol>\n\n\n\n\n\n\n\n\n\n<p>Let me give you an idea what exact topics I am going to teach you in this course. \n\n  </p>\n\n\n\n<ol><li>I will show you the exact cases when you can use the Excel Pivot Table</li><li>Then I will show you the anatomy of a pivot table report with a real life example.</li><li>Then you will see the step by step by process of preparing a data source for Excel Pivot table</li><li>Then you will learn how to create and update a basic pivot table report</li><li>Then you will be introduced with the Slicer tool in Excel</li><li>And at the end of the course, I will show you total three techniques that you can use to will save your time when you’re working with Excel Pivot tables.</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I have designed this course for new comers in Excel pivot table feature. But if you are an intermediate level user and want to be get used to with Excel 2016 Pivot table feature, then this course is also for you. This course will give you a simple but powerful introduction to the most powerful tool in Excel.\n\n  Feel free to take a look at the free previews of this course. I hope this course will change your view about Excel Pivot Table. Enjoy the course and thanks for reading!</p>", 
    "end_date": null, 
    "title": "Excel 2016 Pivot Tables: Create Basic Pivot Tables in Excel", 
    "price": 0, 
    "instructors": "Excel Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/874492_7ad1.jpg", 
    "course_url": "https://www.udemy.com/excel-2016-pivot-tables-for-beginners/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-10T13:49:10Z"
}