{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>If you’ve ever thought to yourself, “There has to be a better way to do this,” while using Excel, then know you're probably right. <em><strong>With over 100 HD Lectures + Excel Templates, I’m going to teach you the best 100 time-saving tips and tricks in Excel to make Excel more efficient than you ever imagined.</strong></em></p><p>I created this course to help Excel users avoid common spreadsheet stumbling blocks and reveal ways to maximize the power of Excel. I started with no knowledge of Excel and when I started to use it on a daily basis, I said to myself, “There has to be a better way to do this.” <em><strong>In this course, I compile all my notes and my knowledge and I want to teach you how to improve your skills in short order.</strong></em><em><strong></strong></em></p><p><em><strong>Are you ready to fire up your skills and become a super-efficient Excel user?</strong></em><strong> </strong></p>  <p>First, you’re going learn my top 10 favorite Excel Hacks that can save you a ton of time. </p>  <p>Then I’ll show you some tips that will help you to customize your Excel Interface.</p>  <p>You’re gonna learn several new tips to organize your data, to work with formulas or Dates, to hack your charts and Pivot tables, to complete lightning your tasks in Workbooks and Worksheets, and a bunch of other cool stuff.</p>  <p>Do you want to enter data to multiple worksheets at a time? No problem. Do you also want to block a user from interacting outside a specific range? Piece of cake. Do you want to get rid of duplicate values in seconds? Easy! These and 97 more tips and hacks can add significant productivity and save money across your organization, too.</p>  <p><strong>The course is entirely project based and requires no Excel experience. It has been recorded with the brand-new Excel 2016 in full HD 1080p.</strong></p>  <p>If you get stuck, don’t worry.<strong> I have fast and full support through the discussion board.</strong></p>  <p>And if you don’t like the course, simply return it! <strong>There is a 30-day money back guarantee.</strong></p><p><strong>But first, you probably want to know who I am. What real world experience do I have?</strong> My name is Andreas and I have been a teacher for <strong>over 16 years</strong>. I have <strong>my own computer learning school</strong> and I have taught Excel to <strong>over 3,000 students</strong>. I use Excel daily and because of that, I had to find hacks and tips to increase my productivity and efficiency. So I made this collection of powerful tips. At the end of this course, you’ll accomplish and master all of your spreadsheet tasks at least half the time that you do now.<br><strong></strong></p>  <p>Thanks for your interest in the course, I’m really excited to share it with you. <strong>Check out the free previews and I’ll see you in class.</strong></p>", 
    "end_date": null, 
    "title": "Excel Hacks - Excel 2016", 
    "price": "20.00", 
    "instructors": "Andreas Exadaktylos", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520524_6228_3.jpg", 
    "course_url": "https://www.udemy.com/excel-hacks-and-tips-with-excel-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T16:48:47Z"
}