{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>「事務仕事にExcelが必要だ」「でも、何から勉強したらいいか分からない…」「本や参考書では難しくて勉強できない…」</p><p>そんな「事務Excel」が苦手なあなたでも、１週間で「Excel事務処理マスター」になることができる講座です。</p><ul><li>美しいExcel文書を作るための書式設定のコツ</li><li>データベースを管理し、分析をする方法</li><li>関数を使いこなしてスマートに事務処理をこなす方法</li><li>４種類のグラフを使い分け、伝わるプレゼン資料を作り出す方法</li></ul><p>など、一日15分～の動画講座をマネしながら課題を取り組んで、1週間でExcel事務処理をやさしくマスターできます。</p><p>業界最高レベルにさわやかな講師「エクセル兄さん」が、やさしくレクチャーします！</p><p>【カリキュラム】</p><p>（１）第１章：美しいExcel文書を作る7つの技術（ビジネス文書は見た目が命）</p><p>Excel文書は「見た目」が大事！<br>文書が綺麗かどうかで、見た相手からの信頼感に影響がでてきます。<br>この章では、見た目に美しいExcel文書を作るための書式設定のコツをお伝えします。</p><p>（２）第２章：データベースを俺のモノにする6技術～データを管理・分析するスキルを手中に収める</p><p>データを取り扱い管理・分析する機能を使いこなし、「絞り込み・集計・ピボット分析」ができるようになります。情報のスクリーニングや、様々な視点から企業の持つデータを分析することができるようになります。</p><p>（３）第３章：数式＆関数 5スキルで快速特急：スマートに正確・高速で事務を終わらせる</p><p>数式や関数を使いこなし、ミスがなく素早い事務処理をこなして仕事を快速で終わらせることができるようになります。VLOOKUP関数を使った垂直検索や、消費税計算、合計計算などを行えるようになります。</p><p>（４）第4章：4種のグラフを臨機応変に使いこなし、説得力ある資料を<span></span></p><p><span>グラフで視覚化することで、データを相手にわかりやすく伝えることができます。プレゼン資料やレポート作成にも重要。３秒でパッと伝わるグラフ作成の方法をお伝えします。<span><br></span></span></p><p>【この講座の特徴】</p><p>1日15分〜短期間で「事務処理マスター」になれる秘密</p><p>本講座は、効率よく事務処理マスターになっていただくための教材です。<br>テキスト学習が苦手で諦めかけているパソコン嫌いのあなたや、忙しくて勉強が捗（はかど）らないあなたでも大丈夫！時間がある時やスキマ時間に少しずつ、Excelの重要ポイントだけをつかんで効率よくスキルアップできるように作成しました。<br>日々リラックスして動画を見ながらパソコンを操作しているうちに、無理なく関数スキルが身につきます。</p><p>動画を見ながら「マネする」だけでExcelスキルアップ！全編わかりやすい動画講座</p><p>エクセル関数のスキルを身につけるに、テキストや教科書を見ながらひたすら地道にすすめる勉強をされていますか？しかし、テキスト学習ではなかなか学習が難しかったり、モチベーションが続かないという問題があります。</p><p>この講座では、動画を見ながら学習をし、動画の動きをそのままマネして操作するだけで、自然とエクセルの操作が身についていく「動画をマネして学習方式」を取り入れています。</p><p>キーボードの入力（タイピング）やマウスの操作など、実際の動きを映像で見ることでイメージしやすくなり学習効率とスピードが飛躍的に高まります。</p><p>スキマ時間でも勉強できる！</p><p>オンライン動画でいつでも学習できます。<br>時間がない時は、通勤・通学中の電車や、休憩中など、<br>スキマ時間を使って講義を見ることができます。</p><p>就職・転職、資格や仕事のスキルアップができる！</p><p>就職・転職や、仕事で役に立つスキルが身につきます。<br>また、MOS試験でも自信を持ってスキルを使えるようになります。</p><p>仕事を効率化して早く終わらせ、時間ができる！</p><p>仕事が速く正確になり、仕事の時間が短縮されます。<br>早く仕事を終えることができれば、余暇を楽しんだり、家族と居る時間を増やすこともできます。</p><p>【よくある質問】</p><p>Ｑ．Excel2013じゃなくても受講できますか？</p><p>Ａ．2013に合わせて講座を制作していますが、Excel2007、2010でも可能です。</p><p>本講座は「Excel2013」に合わせてビデオを制作しています。</p><p>Excel2007、2010でも同じ機能を使うことはできますが、見た目が異なる部分や、ボタンの配置が異なる部分があります。<br>無料講座を見てみて、「それでも大丈夫そうだ」と感じましたらご参加ください。</p>", 
    "end_date": null, 
    "title": "Excel事務処理3時間イッキ読み！エクセル兄さんの事務処理マスター22講座【文書・データ・関数・グラフ】", 
    "price": "30.00", 
    "instructors": "エクセル兄さん IT講師の淳", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647536_a470_4.jpg", 
    "course_url": "https://www.udemy.com/excel-jimu/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T04:10:00Z"
}