{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course takes up where the Optima Train Excel 2013 Pivot Tables and Pivot Charts course leaves off. It has two primary themes, each ultimately related to data analysis with pivot tables. First, it teaches you a number of methods for importing external data (from a database, text files, or other sources) into Excel for analysis. Second, it devotes considerable time to the PowerPivot add-in originally introduced with Excel 2010 and now included (with a new look) in Excel 2013. To learn Excel PowerPivot &amp; Advanced Business Intelligence Tools quickly and effectively, download the companion exercise files so you can follow along with the instructor by performing the same actions he is showing you on the videos.</p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p><strong>***** CLEAR AND CRISP VIDEO RESOLUTION *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong><strong></strong></p><p><em>“When I first looked up this site I was a bit skeptical, but I soon realized how amazing these courses are. They have helped me excel in all my business classes. The PowerPivot course now makes business analytics easy and at my fingertips.\" - Wilson Xu, STUDENT</em></p><p><em><em>“The Optima Train two part series on Pivot Tables is pure gold! The material is so amazingly thorough and clear that anyone watching the videos and doing the exercises provided will without a doubt become a true expert at working with Pivot Tables and likely become a hero at work by applying and sharing this new-found knowledge. There is nothing like it on the market.\" - Phil, FORMER TREASURY OPERATIONS MANAGER - EXXONMOBIL</em></em></p><p>99.9% of Excel users do not use PowerPivot but those that do are in elite company. Power Pivot allows end users with no business intelligence or data analytics training to develop data models and calculations. The tide has shifted where the knowledge worker can perform analysis on millions of records without using specialized IT software or the help of business intelligence consultants. Learning PowerPivot and DAX will take your Excel skills to the very top. People who know Pivot Tables and Pivot Charts should take the next logical step and learn a skill set that is in very high demand and in short supply. Become an indispensable resource at your work place. Simplify your work and personal life by learning this extremely powerful tool.</p><p>This is the most comprehensive Excel PowerPivot and Advanced Business Intelligence course and has <strong>47 short video tutorials</strong>. The Pivot Tables and Pivot Charts course serves as a prequel to this highly valuable course. <strong>There is zero fluff and no time wasted in this course</strong>. The instructor, Dr. Chris, has decades of experience using Excel in real-world settings solving complex business problems. There is no quicker way to learn Excel PowerPivot than to watch these videos and follow along with the free companion <strong>exercise workbooks</strong> <strong>which are downloadable</strong>. <strong>If you want to stand out among your colleagues, earn a promotion, further your professional development</strong>, <strong>save tons of hours every year</strong>, and learn <strong>Excel PowerPivot and Advanced Business Intelligence Tools</strong> in the quickest and simplest manner then <strong>this course is for you!</strong></p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p><p>We are so confident that you will get<strong> tremendous value</strong> from this course. <strong>Take it for the full 30 days and see how your work life changes for the better.</strong> <strong>If you're not 100% satisfied</strong>, we will gladly refund<strong> the full purchase amount!</strong></p><p>Take action now to take yourself to the next level of professional development. Click on the <strong>TAKE THIS COURSE </strong>button, located on the top right corner of the page, NOW…<strong><em>every moment you delay you are delaying that next step up in your career…</em></strong></p>", 
    "end_date": null, 
    "title": "Excel 2013 PowerPivot & Advanced Business Intelligence Tools", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531490_755f_2.jpg", 
    "course_url": "https://www.udemy.com/excel-2013-powerpivot-advanced-business-intelligence-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T18:14:01Z"
}