{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><br></strong></p><p>Would you like to track all action (progress- manpower-resources- … ) in your project in easy and automatic way?</p><p>Would you like to record all changes that you will face in your project?</p><p>Would you like to create a customize reports that show all details in your project?</p><p>Would you like to have full control to all data in your project?</p><p>Would you like to meet your client requirement at any time?</p><p>Would you like to show your reports in very useful and attractive visual charts and curves?</p><p>Would you like to master one of the most important tool in your work in the field of project managements?</p><p><strong><em><u>So you must </u></em></strong></p><p><strong>Join my Series and learn useful techniques, Tips, tricks &amp; Secrets that can help you to double your productivity as engineer or Planner</strong></p><p><strong>One important thing before to start</strong>: this series is not excel tutorial videos, this series is to learn how to use excel in your work as engineer or planner or project control </p><p><strong>You will learn in this level </strong></p><p>How to handle, arrange your data and prepare your sheets so that you can use this sheet through your work</p><p>How to tracking Major actions in your project like “arrived material and progress on site\" </p><p>How to get basic information form the data you have using equations</p><p>How to update your sheet with new revisions </p><p>If you are Engineers, Project control, planning engineers, Cost control, or you are working in the field of projects this series is for you how </p>", 
    "end_date": null, 
    "title": "Excel For Engineers & Planners_Level #1", 
    "price": "20.00", 
    "instructors": "Eng : Mahmoud Talaat", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578274_8c0c_5.jpg", 
    "course_url": "https://www.udemy.com/excel-for-engineers-planner_level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T18:58:12Z"
}