{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Become a proficient Excel Macro Programmer in a very short time.</strong></p>  <p><strong>Excel Macros are powerful.</strong> Everybody wants to learn Excel <strong>Macros and VBA</strong>. They can make Excel work like magic. But most Excel users never use them. Other spending several days on a multi-hour course or working through a 1000-page book, getting overwhelmed with information. So why waste a great deal of time learning things you may never use. </p>  <p><em><strong></strong></em><strong>In this course my goal is to help you learn ways to create Excel Macros that won’t burst your brain. Also to convey the main principles of VBA language and allow beginners, taking their first steps, to learn without requiring individual training.</strong><em><strong></strong></em></p>  <p><strong>Content and overview</strong></p>  <p>A macro is a sequence of instructions that automates some aspect of Excel so that you can work more efficiently and with fewer Errors. Macros are written in VBA, which stands for Visual Basic for Applications, is a programming language developed by Microsoft.</p>  <p>If you think Excel VBA programmers are smarter or more gifted than you, then you’re mistaken. Yes, macros can be intimidating and yes, programming is a huge topic. If you saw a course on Excel programming with hundreds of lectures, would you really watch all of them?</p>  <p>But wait a minute… <em><strong>What about people who may not have programming background, but aspire to reap the utmost from the program? Are there any programming principles and well-guarded secrets that you can learn and use them to create any Macros you want? </strong></em></p>  <p><strong>In this course you will find several short, to the point lectures covering Excel Macros and VBA entertaining and accessible to non-techies. The goal is not to make you a star Excel programmer. If you want to be that, go for it! But I’ll give you some best practices and make this course extremely practical.</strong> After all, you are not a programmer, you just need to write an Excel Macro to help you get your work done.</p>  <p><strong><em>Why is this course different? </em></strong></p>  <ul><li>It's      super practical. Free downloadable Excel working files are included to      allow you to follow along using the same material I use throughout the      lectures. You can download all of them.</li><li>It's      comprehensive and fast. Microsoft Excel Macros and VBA are complex, that's      why the course is broken down into bite-sized pieces</li><li>I update      the Excel class monthly with new lectures!</li><li>It has a      quiz after section so to prove that you have learned the material.</li><li>You will      learn the most current version of Microsoft Excel (2016) but the concepts      are compatible with Excel 2007, Excel 2010 and Excel 2013</li><li>Compatible      with Microsoft Office for Macintosh</li></ul>  <p>Are you looking to learn practical Macro techniques you can put to use instantly? If so, then this is the course for you. It’s entirely project based and it’s full of examples which are fully explained and easy to understand. It has been recorder with the <strong>brand new Excel 2016 in full HD 1080p</strong>. If you get stacked don’t worry. I have fast and fully support through the discussion board. And if you don’t like the course simply return it. <strong>There is a 30-day money back guarantee.</strong> At the end of this Microsoft Excel class you will be given a <strong>Certificate of Completion</strong></p>  <p><em><strong>What are you waiting for? Enroll now! (it is 100% no risk deal)</strong></em></p>", 
    "end_date": null, 
    "title": "Excel Macros Mastery & Excel VBA for Non-Programmers", 
    "price": "20.00", 
    "instructors": "Andreas Exadaktylos", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765106_ee4a_3.jpg", 
    "course_url": "https://www.udemy.com/excel-macros-excel-vba-for-non-programmers/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T04:49:13Z"
}