{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<ul><li><strong>Free Downloadable Workbooks</strong> - makes it easy to follow along &amp; practice after class.</li><li><strong>Test Your Skills</strong> - exercises to get you engaged &amp; reinforce what you have learned.</li><li><strong>Code Snippets</strong> - with common code bites.</li><li><strong>VBA Glossary </strong>- talk the talk</li></ul><p><br></p><p>As you know, Microsoft Excel is a great application that you can use to analyze your data.<br></p><p>Even with all of Excel's great features, and built-in tools, you might find yourself doing repetitive tasks, that take longer than they should.  </p><p>Or the day will come when you say, \"<em>Oh, I wish there were a better way to do this</em>!\"</p><p>The good news is that Excel, and other Microsoft Office applications, comes with Visual Basic for Applications, also known as VBA, a programming language that will extend the functionality of your Office applications.</p><p><br></p><p>Even though Excel is one of the most popular software applications in the world, not everyone knows how to program Excel with VBA.  Those who do can save more time, and make more money.</p><p><br></p><p>This is a VBA beginner's course that will get you on the road to being in that elite group of VBA programmers.</p><p>Learning to program can seem daunting at first, but I'm going to make it as easy as possible.</p><p>With that said, VBA is a huge topic, and yes, there are a lot of lectures in this course.<br></p><p>But don't try to take it in all at once.</p><p>If you feel like you can do 1 section a week, do 1 section a week.</p><p>If you have time, do 1 section a day.</p><p>But don't stress out.</p><p><br></p><p>And because VBA is a huge topic, I don't go through every single thing, every method, every property, every shortcut.<br></p><p>What I do go over will get you from, \"<em>I don't even like looking at VBA</em>\", to, <em>\"I can do this!\"</em></p><p><br></p><p><br></p><p>NOTE: There are multiple ways to get the same result in VBA.</p><p>So the way I write a procedure or two might be slightly different than your co-workers code, or yours, and that's O.K.</p><p><br></p><p>So I invite you to take a look at the circiulum, and the Preview lectures.</p><p>If you feel this is the course for you, great, let's go ahead and get started, and I will help start programming your Excel workbooks with VBA</p>", 
    "end_date": null, 
    "title": "Excel VBA: Beginner's Blueprint to Programming Excel VBA", 
    "price": "35.00", 
    "instructors": "IsáBel Harrison", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690430_d65c_3.jpg", 
    "course_url": "https://www.udemy.com/vba-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T18:11:14Z"
}