{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t                                                                           One of the world’s leading consulting firms, the McKinsey Global Institute, has identified a huge gap between the demand for people with deep analytical skills, and the supply of qualified candidates. They call it a “critical shortage”, totaling more than 150,000 people by 2018. They’re not only talking about careers in computer programming. They’re saying that these skills will be required for almost all middle-class careers, from  HR to sales, accounting to purchasing, and even factory production workers.  </p>  <p style=\"\">  \t                                                                           Where do you start, to improve your analytical skills and increase your opportunities for a good career? Start by learning Excel. Excel is the primary analytical tool used in business today. How do I know? I’m a senior business executive, with over 25 years of experience across several different industries.  </p>  <p style=\"\">  \t<strong style=\"\">Excel is the perfect foundation on which to build your analytical skills.</strong>  </p>  <p style=\"\">  \t                                                                       There are many Excel courses – why take one of mine? Because I’m a business executive, I know how Excel is used in business. I know the analytical skills needed. And don’t just take my word for it.  </p>  <p style=\"\">  \t<strong style=\"\">Here&#039;s more proof</strong>  </p>  <p style=\"\">  \t                                                                       A local university uses my Udemy courses to teach pivot tables.  And my courses are recommended by the Oregon Business Education Association.  </p>  <p style=\"\">  \t                                                                       What do they like about my courses? They like the realistic case studies. One case study is followed throughout the entire course, showing how business uses Excel to solve real-world problems.  </p>  <p style=\"\">  \t<strong style=\"\">Students learn about Excel more deeply, and the knowledge “sticks”, because the course is more than just a list of commands and menu paths. The course is based on a real business problem that you solve during the course.</strong>  </p>  <p style=\"\">  \t                                                                       This course covers these topics in Excel:  </p>  <ul style=\"\">  \t<li style=\"\">Importing Text Files</li>  \t<li style=\"\">Date Functions</li>  \t<li style=\"\">Text Functions</li>  \t<li style=\"\">Logical Functions (IF, OR, AND)</li>  \t<li style=\"\">The VLOOKUP function, to make cross-reference tables</li>  \t<li style=\"\">Table Functions, including pivot tables and pivot charts</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Learn and master more than 47 Excel functions</strong>  </p>  <p style=\"\">  \t                                                                     The course is targeted at people who have some familiarity with Excel. You should know how to edit data, create formulas, and use the copy / paste functions, like Control-C and Control-V.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \t                                                       There are 27 lessons, comprising about 2 hours of video. The course is based on a case study, to evaluate the performance of two service companies. Each company has sent a text file with their repair history, thousands of records each. The data is dirty: there are duplicate records, the dates are encoded in text fields,and the product codes are not harmonized. Just like real life. Students will learn how to use Excel functions to import the data and clean up the files.  </p>  <p style=\"\">  \t                                                    Most lessons have a practice session. I provide two Excel files: the starting point and the finish point. I also provide the written script for each lesson. There&#039;s a quiz at the end, to ensure that you’ve mastered the topics. I make it easy for you to succeed.  </p>  <p style=\"\">  \t<strong style=\"\">Let&#039;s get started!</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Excel: Learn 47 Functions via a Business Services Case Study", 
    "price": "20.00", 
    "instructors": "Jeff Knowlton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327848_bd7b_3.jpg", 
    "course_url": "https://www.udemy.com/excel-learn-47-functions-via-a-business-services-case-study/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T03:39:37Z"
}