{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">The Tool - The Learning Plan</strong><br style=\"\"></p><p>Do you often find yourself in need of more time to finish a particular project or learn for a particular exam?</p><p>Do you also find youself forgetting when are your exams due or when do you have your classes?</p><p>If you feel that these situations are somewhat familiar, then you will find this learning plan quite useful!</p><p>This learning plan is built out to help your personal learning requirements. The learning plan will help you remember when you have your classes and when are your exams due.</p><p><strong style=\"\"></strong><strong style=\"\">Excel</strong></p><p>Have you noticed that most Excel courses have an agenda where the instructor takes you through every function, formula, action and feature that you can find in Excel?... well not quite everything that you can find in Excel. I didn&#039;t find any comprehensive Excel course anywhere yet and even if I were find one, it must be super expensive because you can do thousands of things in Excel.</p><p>What I am proposing to you is a new way of learning Excel. We <strong style=\"\">start with an objective</strong>: in this case, building a learning schedule for our calsses, exams and learning. Then, we think it through and build it step by step. You will see that you will learn a lot of things about Excel just by having this approach. And the best things are that you learn Excel by practice and at the end of the course you will also have a ready to use tool!</p><p>Don&#039;t have time right now to go through the videos and learn Excel? No problem! If you enroll you will also have access to the already made learning plan.</p><p>Be a ready and enthusiastic student!</p><p>Enjoy!</p>", 
    "end_date": null, 
    "title": "Excel Learning Plan", 
    "price": 0, 
    "instructors": "Vlad Mihanta", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436818_4229_2.jpg", 
    "course_url": "https://www.udemy.com/excel-learning-plan/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T19:39:54Z"
}