{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t  Excel 2013: Common Math Functions in 30 mins, is a course designed to take you from basic to advanced understanding of all common mathematical functions in Microsoft Excel 2013, in just under 30 mins.  </p>  <p>  \tLearn how to prepare a basic gradebook using everyday mathematical functions, along with their conditionals. You&#039;ll also learn the logic behind all of these calculations so that you are no longer confused in differentiating between SUMIF or COUNTIF. You&#039;ll learn to calculate the great, yet little known, function of 3D SUM. Plus you&#039;ll go through all of the common functions along with a help file and practice workbooks to act as a reference for use in the future.  </p>  <p>  \tStudents are usually not familiar with many of the built-in functions that Excel offers and end up complicating things for them in calculations. Knowledge about functions they do know, many a times, is insufficient and/or erroneous that messes up their calculations.  </p>  <p>  \tThe concept behind this series is to take a complete noob, and make him/her understand not only the basics of calculations in Excel, but to ensure a thorough understanding of each function&#039;s advanced usage, as well.  </p>  <p>  \t  The course contains 5 x short videos. The course includes practice workbooks used in the training videos so that the viewer can follow along, step-by-step. In many videos, the viewer will find descriptive narration of the theory behind a function, classroom-style.  </p>  <p>  \tThis course is part of a series of short courses that only address specific areas in learning Excel. Normally you have to sign up to lengthy courses that try to cover the entire spectrum of Excel, and have to pay a hefty price for it. But what if you only wish to learn specific areas, covering one base at a time. This way you won&#039;t be charged much, and moreover, after paying up only a meager price, depending on whether you like my style, you can always decide whether to sign up to another one of my courses or not.  </p>", 
    "end_date": null, 
    "title": "Excel 2013: Common Math Functions in 30 mins", 
    "price": "20.00", 
    "instructors": "Adnan Ejaz", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420806_091e_3.jpg", 
    "course_url": "https://www.udemy.com/excel-2013-advanced-edition/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T05:26:47Z"
}