{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>08/08/2015 Update: 463 student from 74 countries enrolled the course during first 24h. Are you ready to be next?</strong></p><p>  \t<strong>Unique and exclusive training!</strong></p>  <p>  \t            Have you ever created big nice Excel workbook based on great numbers of links and formulas? Where you expecting it to work without tuning up values? And once you have almost complete it after several hours of hard word, have you ever faced error message \"<em>Careful, we found one or more circular references in your workbook that might cause your formulas to calculate incorrectly</em>\"? Remember what you was feeling like? Annoyed? Frustrated? Willing to make circular... hole in your screen?  </p>  <p>  \t<strong>I know how to help you!</strong>  </p>  <p>  \t            Circular references are useless and annoying, but that is only at first sight. In fact, if you learn how to use them you will be able to solve exotic and hard tasks very fast. Circular references aren't a bad thing in itself:  you can use them to achieve complex calculations that are otherwise impossible to do.  </p>  <p>  \t            If you are struggling to be real Excel professional, you need to have this tool in your portfolio! Stand out from friends and colleagues! Begin thinking wider in Excel!  </p>  <p>  \t            Course is mainly focused on two key aspects of circular references: how to prevent and fix them if you do not need those and how you can use them for different tasks. Only practical side of the tool in easy to understand form followed with examples.  </p>  <p>  \t        Files with all tasks are available for downloading along the course.  </p>  <p>  \t<strong>That is what you was looking for! </strong><strong></strong><strong>And you will LEARN IT in 45 minutes!</strong>  </p>", 
    "end_date": null, 
    "title": "Excel: circular reference", 
    "price": "20.00", 
    "instructors": "Alexander Kaliberov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430916_665b_2.jpg", 
    "course_url": "https://www.udemy.com/master-excel-circular-reference/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T12:30:09Z"
}