{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn the basic techniques and strategies to make rock solid schedules and budgets in Excel, without burying yourself in the financial and data mining side of the program.</p><p><strong style=\"\">These are the essentials techniques for everyone outside of the accounting dept.</strong></p> <ul style=\"\"> <li>Coordinate schedules between dozens of employees</li> <li>Create budgets as a freelancer</li> <li>Create budgets as an entrepreneur and/or manager</li> <li>Nothing else</li></ul><p><br style=\"\"></p><p><strong style=\"\">Let&#039;s not waste time on features you&#039;ll never use</strong></p><p>Learning to use the features in Excel takes some practice, and the real challenge comes from coming up with strategies to combine the features together in powerful, readable and easily customizable ways. </p><p>How do you create documents that anyone in your organization can pick up and immediately start using? </p><p>How do you split up a budget in an efficient manner? </p><p>What do you do when there are hundreds of simultaneous projects happening, each with half a dozen people involved?</p><p>While Excel can&#039;t solve all of your problems as a freelancer or entrepreneur, using it efficiently goes a long way towards getting you the best possible results in the most productive way possible. </p><p><strong style=\"\">Content and Overview </strong></p><p>Suitable for people relatively new to the program, this course starts with the basics of keyboard shortcuts, formatting, basic formulas, and generally working with cells.</p><p>After that&#039;s covered, it drops right into creating and growing out a schedule that&#039;s easy to adjust as surprises and changes occur. It digs into different tips and techniques to help you get things in the spreadsheet in the most readable adjustable way possible, which is crucial when you start having thousands of moving parts and cells to correspond with it.</p><p>Dealing with budgets can take many forms, from a personal budget through project budgets. Whether you&#039;re asking, how much should a project cost, how should you split up a budget with a specific starting number, or how can you create a template to apply to future budgets, this course digs in and shows you different strategies.</p><p>By the end, you should be in an incredible place to start improving your efficiency and work practices through Excel, and have a foundation to keep exploring the program even further.</p>", 
    "end_date": null, 
    "title": "Excel 2016 Beginner's Crash Course", 
    "price": "20.00", 
    "instructors": "Jeremy Shuback", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462206_49ec_3.jpg", 
    "course_url": "https://www.udemy.com/excel-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-29T17:41:12Z"
}