{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \tMicrosoft Excel is by far the most widely used and useful software there is! It is the most basic tool that is used when dealing with data - data in any format.  </p>  <p style=\"\">  \tThis simple yet sophisticated tool has a use for everyone, from keeping a simple tab your daily expenses, to analyzing and presenting a complex profit and loss statement, from keeping a tab on attendance of students to analyzing and presenting data on world hunger!  </p>  <p style=\"\">  \tExcel when used intelligently makes for one of the most powerful yet simple reporting engine. Such is the power of Excel. But despite this, Microsoft Excel in most cases is not used to its full potential even though it one of the most easiest skill to pick up.  </p>  <p style=\"\">  \tWith this course, aimed at beginners, intermediate and Expert users we begin by introducing the basic functionality of this software and then work upwards, along the way covering very simple tips that will profoundly increase your speed and efficiency while using Excel.  </p>  <p style=\"\">  \tAt a high level the course is structured in the below format.  </p>  <p style=\"\">  \t- Data Cleaning  </p>  <p style=\"\">  \t- Data Processing  </p>  <p style=\"\">  \t- Data Summarizing (As A Template)  </p>  <p style=\"\">  \t- Data Presentation (As A Dashboard)  </p>  <p style=\"\">  \t- Automation of the above process using VBA Macros  </p>  <p style=\"\">  \tThe course comprises of videos, key points /summary of each video is available as downloadable material. We suggest that you give a quick run through the downloadable material before you begin watching any video. This is will allow you to understand what it is that you will be learning in the attached video. The short videos take you through each concept step-by-step and allow you to practice while studying.  </p>  <p style=\"\">  \tThis course as indicated is one for those just beginning with Excel and for those who need to master their Excel skills.  </p>", 
    "end_date": null, 
    "title": "Excel for All: Beginner to Experts", 
    "price": "25.00", 
    "instructors": "ATI - Analytics Training Institute", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/193700_b126_5.jpg", 
    "course_url": "https://www.udemy.com/excel-for-all/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-04T07:34:19Z"
}