{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><em>*******************************************************</em></strong></p>\n\n<p><strong><em>Course updated 4th of June 2016</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>*******************************************************</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p>Learn <strong>Step by Step how to create Professional, Interactive Dashboards &amp; Charts using Excel </strong>including<br></p>\n\n\n\n\n\n\n\n\n\n<p>1- Learning the Important functions that you need to know for building Dashboards such as <strong>VLOOKUP</strong>, <strong>HLOOKUP</strong>, <strong>MATCH</strong>, <strong>INDEX, OFFSET </strong>and others</p>\n\n\n\n\n\n\n\n\n\n<p>2-Learning how to implement <strong>Interactivity tools </strong>such as <strong>Form Controls</strong>, <strong>Slicers</strong>, and others.</p>\n\n\n\n\n\n\n\n\n\n<p>3-Learning Dashboarding techniques.</p>\n\n\n\n\n\n\n\n\n\n<p>4- Building a Complete Excel Dashboard.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>What you need before taking this course</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li><strong></strong>The will to learn !</li><li>You need to be using Excel already, written a few formulas such as SUM and COUNT, know how to build a basic pivot table and insert a chart.</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>A Powerful Skill at Your Fingertips</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>Excel is a great tool for creating Interactive Dashboards. It is relatively cheap with high availability compared to other more expensive tools, so learning how to build dashboards will be a great addition to your skills, and you can showcase these skills almost anywhere because Excel is installed on millions of computers around the globe!</p>\n\n\n\n\n\n\n\n\n\n<p>If you're already an Excel user and want to <strong>learn how to create Interactive dashboards using Excel, impress your employer and potentially earn a rais</strong><strong>e</strong>, then this course is for you!<br></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong>What other students are saying about the course:</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Andrew Adolph:</strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>I feel so lucky to have come across udemy and then a course on excel dashboards. I have always loved car dashboards, just displaying the most important info.</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>Today's dashboard in the business sense is the presentation of key performance indicators (kpi) for decision makers.</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>I am hooked on this course, and practicing making better dashboards. Adbelrahman is there to answer questions. To beautiful dashboards...</em></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Luke Best</strong>:<br></p>\n\n\n\n\n\n\n\n\n\n<p><em>Thanks Abdelrahman for an excellent course!</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>I use Excel most days so thought I had a decent grasp on how it all works. How wrong was I! This course has been a real eye-opener into what is actually possible in Excel and techniques covering how to present data.</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>I found the course material and presentation (videos) very comprehensive with plenty of examples to work through and use as reference for the future when I apply it all to my work.</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>An Excellent course and would highly recommend.</em></p>\n\n\n\n\n\n\n\n\n\n<p><em></em><strong>Michael Diamond:</strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>I was impressed with some of the information presented. I have taken various dashboard courses to find little gold nuggets and i found a bunch in this course. The instructor provided some new twists for creating dynamic ranges, for example. He didn't present the normal formulas that I have seen from different sites but came up with some new approaches which caused my eyes to grow wider. I felt I was gaining a deeper understanding how excel thinks and works. His presentation showed me that he put some thought and effort into the presentation and made an effort to bring me from a Joe to a Pro!</em><br></p>", 
    "end_date": null, 
    "title": "Excel Dashboards : Build a Dashboard from Scratch!", 
    "price": "30.00", 
    "instructors": "Abdelrahman Abdou", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684170_532b_3.jpg", 
    "course_url": "https://www.udemy.com/excel-dashboards-joes-to-pros/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-29T17:10:16Z"
}