{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>The <strong>Excel Apprenticeship Series</strong> is focused on transforming students into <em>Excel Wizards</em> to give them a distinct competitive advantage over their peers. This installment of the series is about <strong>mastering the art and science of problem solving with formulas in Excel.</strong></p>\n\n<p>The course takes a unique approach that is rooted in <strong>solving real world problems</strong>. This gives students an apprenticeship experience as opposed to a traditional lecture approach. By the end of the course, students will have worked nearly 170 examples and will have learned how to leverage Excel to solve just about any problem they might face in practice. Students will cover just under 100 functions in the course and will be proficient in reading and writing even the most complex formulas in Excel.</p>\n\n\n\n\n\n\n\n<p>The course is broken down into two modules. The first module provides an introduction to Excel. This module is intended to get everyone on the same page, <strong>so </strong><strong>even those who have never used Excel can feel comfortable starting with this course</strong>. </p>\n\n\n\n\n\n\n\n<p>The second module teaches students how to become formula masters and expert problem solvers with Excel. This module is broken down into seven sections that are mapped to functional areas, once again putting an emphasis on how Excel is used in the real world.</p>\n\n\n\n\n\n\n\n<p><strong>This course offers students:</strong> </p>\n\n\n\n\n\n\n\n<ul><li>Over 16 hours of valuable video instruction that is uniquely structured to share the lessons learned from over a decade of professional experience</li><li>Over 125 quiz questions strategically placed throughout the course to help test your understanding and reinforce what you’ve learned</li><li>A <em>Practical Application Workbook</em> and solution manual for each section</li><li>An Excel Wizard’s Guide to Critical Skills</li><li>A Comprehensive Data Aggregation Reference Sheet</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>This course is intended for individuals who have a desire to become phenomenal at writing formulas in Excel.  This includes:</strong></p>\n\n\n\n\n\n\n\n<ul><li>Recent or soon to be college graduates</li><li>Individuals who work in analyst, consulting, management, or supervisory roles</li><li>Individuals looking to gain a tangible skill on their resume</li><li>Individuals looking to gain a competitive advantage over their peers</li></ul>\n\n\n\n\n\n\n\n<p><strong><br></strong></p><p><strong>Recent studies show it pays to know Excel. Get started today!</strong><br></p>", 
    "end_date": null, 
    "title": "Excel Apprenticeship Series: From Beginner to Formula Master", 
    "price": "50.00", 
    "instructors": "Jarrod Tanton", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/728868_b46a_3.jpg", 
    "course_url": "https://www.udemy.com/xlessentials-eap-m2/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T07:52:37Z"
}