{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>100% of my course revenue will be donated. Why? Read on...</strong><br></p><p>This course is right for you if:</p><ul><li>You've never used excel before</li><li>You rely on the mouse to get your work done</li><li>You wonder if there are ways to get your work done more quickly</li><li>You don't recognize or use the Paste Special, HLOOKUP, INDEX, VLOOKUP, Conditional, Filter, or Pivot Table features, among other very important features.</li></ul><p>This course is based on the training Wall Street bankers use to become the fastest and most productive excel users in the world.  You will learn to quickly navigate your excel sheets, organize/format data, calculate/solve problems confusing problems, and present your data beautifully..<br></p><p><strong></strong></p><p>The 11 quick exercises are specifically designed to build off of each other so that you get continued practice on the basics as you get more advanced.</p><p>I have been extremely fortunate in my career to graduate from Harvard Business School and work for some of the top companies in the world.  I didn't originally come from an ivy league school; in fact, I was rejected from most universities and jobs I applied to.  I know how hard it can be to propel yourself forward, and many people helped me get where I am today.</p><p>I will give 100% of my tuition to Kiva, an organization that helps educate and secure financing for business owners in impoverished areas.  That way, you can help others while you're learning yourself.</p>", 
    "end_date": null, 
    "title": "Excel Afterburner - beginner to speed demon in hours", 
    "price": "35.00", 
    "instructors": "Ezra Okon", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722136_51fa_3.jpg", 
    "course_url": "https://www.udemy.com/excel-afterburner/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-09T20:06:39Z"
}