{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>*Updated 19th February 2016*</strong></p><p>This <strong>Excel 2016 Essentials </strong>course is designed to help you in your Excel tasks- no matter what they are! </p><p>A lot of people use Excel. While some jobs require heavy use of Excel and its features, some professions just require you to know the 'basics' or 'essentials' as we call it! </p><p>This <strong>Excel 2016 course is suitable for beginners to intermediate users</strong> and teaches the following:</p><ul><li>Excel basic worksheet operations</li><li>How to navigate around an Excel workbook</li><li>How to format cells quickly in an Excel workbook</li><li>How to sort, find and replace Excel data quickly</li><li>How to insert, edit and delete Excel comments and automatically resize them</li><li>How to resize Excel columns automatically and quickly</li><li>How to copy data tables from MS Excel into MS Word</li><li>How to wrap text in MS Excel</li><li>How to print pages properly in MS Excel</li><li>How to quickly make/format a table in MS Excel</li></ul><p><br></p><p>This course is a bite size course -<strong> In 1 hour you can pick up everything taught.</strong> How great is that? The lectures have been kept as simple as possible yet illustrate effectively how to use the taught concept.<br></p><p>As with all courses by Mach 42 Productions, full support is given via the course discussion forums. This course is filmed using the latest copy of Excel 2016 and is in HD quality. The great thing about this course is that you can apply what is taught to ANY of your daily work tasks in Excel regardless of the industry. How cool is that? Simple and short quizzes are also provided to test user knowledge after selected lectures.</p><p>Apart from users wanting to know just the essentials, this course is great for anyone using Excel who just wants a refresher on concepts used in it.</p><p>Remember by picking up<strong> essential Excel skills</strong>, you can <strong>significantly increase your productivity, save time and money</strong> and furthermore be confident that you can use one of the most popular office business tools today. This Excel course aims to help you get there- and quickly too!</p><p><strong>Go on..what are you waiting for?</strong></p>", 
    "end_date": null, 
    "title": "Excel 2016 Course - 11 Ways To Work Better In Excel", 
    "price": 0, 
    "instructors": "Mach 42 Productions", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635882_8032_4.jpg", 
    "course_url": "https://www.udemy.com/excel2016course/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T14:21:14Z"
}