{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Why the Excel Budget\nTemplate?</strong></p><p>Money is a sensitive issue for all of us and we need to take care of our\nmoney and find ways to better manage, spend and save our finances.</p><p>Why? Because money is important. Can you think of any company that\ndoesn't keep a budget? No. So if a company's finances are important, why isn’t\nyour own hard earned money also important?</p><p>This is where this course swoops in. I will present to you a fully custom-made Budget Excel Template that you can use to better manage your\nmoney. Better yet, I will teach you how to spend wiser and, why not, save more\nmoney for those rainy days. </p><p>I invite you to dare to be financially wise and use a budget!</p><p><strong>Use this Excel Budget\nTemplate to learn more of the program.</strong></p><p>This course will also prove itself very useful to you if you’re looking\nto sharpen your Excel skills.</p><p>How, you ask? It’s very simple, actually.</p><p>Have you ever noticed that most Excel courses have an agenda where the\ninstructor takes you through every function, formula, action and feature that\nyou can find in this program? Of course you did! Now, have you ever noticed how\nboring and difficult are those courses? I’m sure you did. </p><p>So why not try a different way? </p><p>Use this course to start with an objective: <strong>building a personal budget for your hard earned money</strong>. From there\nit’s easy, you will just build it step by step, following the instructions. You\nwill learn a lot about Excel’s secrets just by having this approach. </p><p>And you know what the best part is?</p><p>First, you will get to learn Excel by practice, which you already know\nis the best way learn anything. </p><p>Second, at the end of this course you will also have an awesome\nready-to-use tool that will most certainly improve your lifestyle!</p><p><strong>Will it be hard? Not\nat all. Will it be useful? You can bet on it!</strong></p><p>Don't have the time right now to go through the videos and learn Excel?\nNo problem! If you enroll now you will also have access to the already made\npersonal budget. How cool is that? </p><p>What are you waiting for? Take this Excel Budget Template course and\nmake the first step to your financial growth!</p><p>Enjoy!</p>", 
    "end_date": null, 
    "title": "Excel Budget Template: Spend Wise, Save More, Keep Track ", 
    "price": "20.00", 
    "instructors": "Vlad Mihanta", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437254_e901_2.jpg", 
    "course_url": "https://www.udemy.com/excel-budget-that-will-save-you-thousands/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T06:00:53Z"
}