{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Speed Up Productivity and Lower Data Entry Errors!</strong>  </p>  <p style=\"\">  \t          It&#039;s no secret that data entry errors can cause big problems. Fortunately, this course provides you with a complete set of skills to help you create programs in Excel. This course provides over 2 jam-packed hours of tutorials, including:  </p>  <ul style=\"\">  \t<li style=\"\">Data Entry with Barcodes</li>  \t<li style=\"\">Barcode Scan to Look-Up items from your worksheet/databases</li>  \t<li style=\"\">How to Auto-Move screens during or after a scan</li>  \t<li style=\"\">How to process Barcodes with random lengths</li>  \t<li style=\"\">Lots of Tips for creating and getting a good scan, Everytime!</li>  \t<li style=\"\">FREE Companion workbook with real life examples</li>  \t<li style=\"\">FREE Macros and Buttons to Generate Avery 5160, 5162, 5163 and Large label sheets - PLUS Unlimited space for your custom sized projects</li>  </ul>  <p style=\"\">  \t<strong style=\"\">****** See what others are saying ******</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t    &quot;Just finished Dan&#039;s course. He has a wealth of knowledge with Excel VBA and applies simple yet thought provoking ways to apply barcode scanning and tracking methods. This course was designed to benefit Excel beginners to advanced users. Also Dan&#039;s approach to solving problems during his lectures displays his confidence of this subject matter. Take this course if you are interested in extending your knowledge of Excel VBA. ExcelVBA IS Fun!&quot;      - <strong style=\"\">Kevin Nee</strong>  </p>  <p style=\"\">  \t  &quot;Hi Dan, After watching all of the videos I can defiantly see us using this for our company. We currently depend on pencil and paper and the honor system for tracking labor hours for jobs. Each employee is responsible for tracking the hours they spend on a given job. We could print a barcode for each job and apply the label to a board or something like that. Then when an employee starts on that job they would scan that label then select their name. Then the program would stamp the start time, when they are done they scan the bar code again select their name and the program would stamp the stop time. I will defiantly continue studying this course and look into coming up with something of this nature for our company. Thanks for the course.&quot;     -<strong style=\"\">Scott</strong>  </p>  <p style=\"\">  \t  &quot;Really awesom course!! Thank you!!!!&quot;     -<strong style=\"\">Eunicer R.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">You&#039;ll receive all these benefits:</strong>  </p>  <p style=\"\">  \t        Included in the course are 20+ Video Lectures describing the process as well as hands on technical demonstrations for all course materials We provided you with everything you need to get started Today with your Barcode Excel VBA program - Font &amp; How to use them properly, Workbook and how to use it.  </p>  <p style=\"\">  \t        Subscription to this course entitles you to LIFETIME Video and Attachments updates, and we will add more material along the way.  </p>  <p style=\"\">  \t       Check it out!  </p>", 
    "end_date": null, 
    "title": "Excel VBA for Business: Barcodes", 
    "price": "20.00", 
    "instructors": "Daniel Strong", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/245434_f56e_7.jpg", 
    "course_url": "https://www.udemy.com/barcodes-excelvba/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-18T03:53:13Z"
}