{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><strong style=\"\">The Tool - Daily Planner</strong></p><p style=\"\"><strong style=\"\">The Problem</strong></p><p style=\"\">We all have daily tasks to perform and we all experienced days when we cram all our tasks in a few hours and days when it seems there&#039;s nothing to do.</p><p style=\"\">One of the reasons we get unwanted fluctuation in our daily activities is due to the lack of planning - daily planning.</p><p style=\"\"><strong style=\"\">The Solution</strong></p><p style=\"\">Now you may say: &quot;I don&#039;t want to plan every hour of every day&quot;. I remember hearing Brian Tracy that most high level executives plan their time to the minute.</p><p style=\"\">So if you plan to go to &quot;higher grounds&quot;, this daily planner will prove very useful.</p><p style=\"\">But this simple, well designed daily planner is for everyone that wants some level of structure to their daily activities and achieve his/her personal and professional daily tasks.</p><p style=\"\"><strong style=\"\">Excel</strong></p><p style=\"\">Have you noticed that most Excel courses have an agenda where the instructor takes you through every function, formula, action and feature that you can find in Excel?... well not quite everything that you can find in Excel. I didn&#039;t find any comprehensive Excel course anywhere yet and even if I were to find one, it must be super expensive because you can do thousands of things in Excel.</p><p style=\"\">What I am proposing to you is a new way of learning Excel. We <strong style=\"\">start with an objective</strong>: in this case is building a daily planner for our tasks. Then, we think it through and build it step by step. You will see that you will learn a lot of things about Excel just by having this approach. And the best things are that you learn Excel by practice and at the end of the course you will also have a ready to use tool!</p><p style=\"\">This course will deal with the basics and touch 2 or 3 more advanced formulae, but everyone can tackle them and complete the course!</p><p style=\"\">Don&#039;t have time right now to go through the videos and learn Excel? No problem! If you enroll you will also have acces to the already made daily planner.</p><p style=\"\">Enjoy!</p>", 
    "end_date": null, 
    "title": "Excel Daily Planner", 
    "price": 0, 
    "instructors": "Vlad Mihanta", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436690_b600_2.jpg", 
    "course_url": "https://www.udemy.com/excel-daily-planner/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T17:17:29Z"
}