{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<ul><li><span></span><strong>Downloadable Excel Workbooks</strong></li><li><strong>Free eBook</strong></li></ul><p><strong><br></strong></p><p><strong>You use Excel for a reason,</strong> and I'm sure it's not to spend hours analyzing data.<br></p><p>You could sit for hours, pouring over hundreds, or thousands of rows.<br>Filtering, sorting, and calculating like there's no tomorrow.<br>And when you need to alter the data, you can do it all again.</p><p><strong>Or you could take a different approach.</strong><br></p><p>You can spend seconds, and create PivotTables.</p><p>Some people spend so much time creating formulas, copying and pasting numbers and records, when they can use PivotTables.</p><p>Those that do use PivotTables can make better business decisions, analyze faster, and have more control over their data, and confidence in their skills.</p><p><strong>In this course you'll learn:</strong> </p><ul><li>How to create PivotTables</li><li>How to filter, and create custom sorting lists</li><li>How to format values, and create calculated fields</li><li>How to create Slicers and Timelines for ultra fast filtering</li><li>How to change the layout and style</li><li>How to create PivotCharts</li><li>and more</li></ul><p>Learn to create PivotTables in hours, not days.  Then use that knowledge to create user-friendly, interactive reports in minutes, not hours!</p><p>Whether you are a small business owner looking to better understand sales trends, an assistant creating weekly reports, or you're looking for a way to better track household expenses, if you are using Excel, you need PivotTables!</p><p>Most exercises can also be applied to Excel 2007, Excel 2010, and Excel 2016 as well.</p><p><strong>GAIN MICROSOFT EXCEL PIVOTTABLE SKILL</strong><strong>S.</strong><br></p><p><strong></strong></p><p><strong>Click The Take\nThis Course Button On The Right &amp; I'll See You In Class!</strong><strong></strong></p>", 
    "end_date": null, 
    "title": "Excel Pivot Tables: Pivot Tables Made Easy", 
    "price": "20.00", 
    "instructors": "IsáBel Harrison", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436554_4ebb_6.jpg", 
    "course_url": "https://www.udemy.com/pivottables/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T14:25:16Z"
}