{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>If you want to boost your skills in handling customer service and call center information, then '<strong>Excel for Customer Service Professionals</strong>' is for you.</p><p>This course will show you step-by-step how to increase your efficiency and accuracy in collecting and analyzing data, creating forecasts and generating clear, meaningful charts and reports.</p><p>Based on over ten years of practical classroom and on-the-job training sessions, the course segments and examples are especially designed for professionals working in a customer service or call center environment: supervisors, managers, team leaders and resource planners.</p><p>'Excel for Customer Service Professionals' comes with a detailed <strong>215 page eBook</strong> and a complete package of <strong>36 Excel software model</strong><strong>s</strong>.</p><p>With the companion set of Excel models, you will learn best-practice hands-on skills to:</p><ul><li> Collect, analyze and present financial &amp; operational information from customer service and call centers: including call statistics, customer interactions, efficiency and key result data</li><li> Calculate required staffing and resource allocations based on traffic forecasts</li><li> Communicate information succinctly and accurately to colleagues, clients and stakeholders.</li></ul><p>You can use the eBook and Excel model resources immediately for analyzing call patterns, customer interactions, efficiency and key results, calculating required staffing and resource allocations based on traffic forecasts, and communicating information succinctly and accurately to your colleagues, clients and stakeholders.</p>", 
    "end_date": null, 
    "title": "Excel for Customer Service Professionals", 
    "price": "50.00", 
    "instructors": "Harold Graycar", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480806_2fa9_4.jpg", 
    "course_url": "https://www.udemy.com/excel-for-customer-service-professionals/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T04:27:18Z"
}