{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>\n\t    This Excel class is comprehensive guide during which you will learn a whole host of topics. It represents the most common Excel \"stuff\" used in modern business and understanding the content within will arguably catapult you into the upper echelon of Excel users.\n</p><p>\n\t    During the class you will learn by watching the instructor actually demonstrate the topics on screen <em>using annotations</em> to make sure you don't get lost, along with providing full, detailed explanation of the subjects. This class starts at absolute square one, and then gradually walks through the remaining topics explaining the most relevant aspects of Excel in a <em>simple, east, yet light-hearted, fun approach</em>.\n</p><p>\n\t    The \"secret\" to Excel is this-- realize there are <strong>NO </strong>such categories like Basic, Intermediate and Advanced Excel. <em>They simply do not exist. </em>With Excel you learn the basics, from there it's nothing but another layer of fundamentals. Phrased differently, the Excel curriculum is <em>topical, not progressive</em>. Meaning the order in which you learn things <em>does not</em> matter since all the topics are not interrelated. Therefore, knowing this fact, when you look at the class as nothing more than a bunch of individual topics that have been strung together, Excel becomes a breeze!\n</p><p>Last, no matter what version of Excel you are using there has always been some core topics that represent the \"need to know\". Phrased differently, all the material in this class contains the essentials and is transferable to all versions of Excel- 2007, 2010, 2013 and even 2016. Sure there are some differences between the versions, but they are not so drastic as to really mess you up. :)</p><p></p>", 
    "end_date": null, 
    "title": "Excel: Soup to Nuts", 
    "price": "20.00", 
    "instructors": "Dave McCubbin", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164894_ddde_5.jpg", 
    "course_url": "https://www.udemy.com/excel-soup-to-nuts/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-15T21:03:46Z"
}