{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn the basic, intermediate, and advanced knowledge needed to make great spreadsheets in the program Microsoft Excel.</p><p><strong>Build a strong foundation in Excel and amazing spreadsheet programming with this tutorial for intermediate and beginner people. </strong></p> <ul><li>Functions</li><li>Formatting</li><li>Dashboard Design</li></ul> <p><strong>A Powerful Skill at Your Fingertips </strong><br> Learning Excel will make your life much more easier. With Excel, you'll be able to create spreadsheets to make your life earier.</p><p>You can sell your spreadsheets on Ebay or Etsy to make money, as I do right now. Also, Excel knowledge will help you in your life.</p><p><strong>Content and Overview </strong><br> <br> Suitable for mainly intermediate and beginner people, through this course of 34 lectures and 2 hours of content, you'll learn all of the Excel fundamentals and core knowledge, make spreadsheets, and establish a strong understanding of the concept behind making perfect spreadsheets, in only 2 hours of your time!</p><p>Starting with the basics such as saving, formatting, and all that, your knowledge builds as you program different stuff. Each new concept builds on the last one.</p><p>With these basics mastered, this course will take you through complex functions by teaching you how to use the IF, VLOOKUP, INDEX, and MATCH functions to add complexity and functionality to your programs. </p><p>Students completing the course will have the knowledge to create functional and useful Excel spreadsheets. </p><p>You'll be able to work alongside me as you work through each concept, so you won't get confused. </p>", 
    "end_date": null, 
    "title": "Excel 2013: Beginner to Master", 
    "price": "20.00", 
    "instructors": "Koki Gunasinghe", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610770_f65b.jpg", 
    "course_url": "https://www.udemy.com/excel-2013-beginner-to-master-o/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T14:48:02Z"
}