{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>My <strong>3-step plan</strong> is guaranteed to make heavy Excel users like you Faster At Excel.</p>\n\n<p>First, you'll <strong>SURVEY</strong> Excel's 215 best shortcuts, including little-know (but blazing fast) \"hybrid\" shortcuts (33 lectures).</p>\n\n<p>Second, you'll <strong>RANK</strong> the shortcuts using my exclusive Excel-based Shortcut Wizard, and create your own custom list of shortcuts (dedicated lecture).</p>\n\n<p>Third, you'll <strong>MEMORIZE</strong> and start using the shortcuts, in the order in which you ranked them (dedicated lecture).  You get a 3-step process for memorizing shortcuts, plus 8 bonus tricks.</p>\n\n<p>All of this adds up to a <strong>Custom Plan</strong> to make you faster at Excel.</p>\n\n<p>There are 40 lectures, with 4.5 hours of instructional content.</p>\n\n<p>All of the shortcuts in the course are included in the course's Excel resource file. You'll get the exact Excel tabs that you see in the lectures, plus the Shortcut Wizard.</p>\n\n<p>What is the <strong>Shortcut Wizard</strong>? It's a powerful and versatile tool ($50 value) that allows you to score and rank all 215 shortcuts, based on how fast they are and how frequently you’ll use them. It's also a searchable and sortable database. Finally, it also has a quiz function to help you retain the material.</p>\n\n<p>Oh, and if you like your mouse, don't worry. I believe in using it as much as possible.So by design, most of the 215 shortcuts actually allow you to keep your right hand on the mouse.</p>\n\n<p><strong>Shortcuts make you faster</strong>. And the more of them you know, the faster you will be. And the faster you are….the better your chances are for <strong>promotions</strong> and <strong>pay increases</strong>… and for <strong>respect</strong> from your co-workers (including your boss). And if you just want to get home earlier, with <strong>less stress</strong>, shortcuts can help you with <u>that</u> goal as well.</p>\n\n<p><strong>Learning Excel shortcuts will transform your job performance and make you a happier person. </strong></p>", 
    "end_date": null, 
    "title": "Excel Ninja Jetpack: 215 Shortcuts To Work Faster, Be Great", 
    "price": "20.00", 
    "instructors": "Faster At Excel", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/727344_f4da_2.jpg", 
    "course_url": "https://www.udemy.com/215-excel-shortcuts/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-13T22:12:35Z"
}