{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t <strong>Harness the power of Excel to discover what your numbers are hiding</strong>  </p>  <p>  \t <em>Excel Data Analysis For Dummies </em>video training is the ultimate course to help you get the most out of your data. The course, comprised of video training and an eBook, guides you through the basic and not-so-basic features of Excel to help you discover the gems hidden in your rough data. From input, to analysis, to visualization, the course walks you through the steps that lead to superior data analysis.  </p>  <p>  \t   Excel is the number-one spreadsheet application, with ever-expanding capabilities. If you&#039;re only using it to balance the books, you&#039;re missing out on a host of functions that can benefit your business or personal finances by uncovering trends and other important information hidden within the numbers. <em>Excel Data Analysis For Dummies</em> eliminates the need for advanced statistics or analysis courses by allowing you to harness the full power of Excel to do the heavy lifting for you. This video course and eBook are fully updated to include information about Excel&#039;s latest features, making this your go-to Excel course for data analysis. Topics include:  </p>  <ul>  \t<li>Working with external databases</li>  \t<li>PivotTables and PivotCharts</li>  \t<li>Using Excel for statistical and financial functions</li>  \t<li>Solver, Small Business Finance Manager, and more</li>  </ul>  <p>  \t   The eBook also includes a guide to chart types and formatting, and advice on effective visual data presentation. You already have the data, so you might as well get something great out of it. <em>Excel Data Analysis For Dummies</em> is the key to discovering what your numbers are hiding.  </p>  <p>  \t <strong>Visit our websites </strong><a href=\"http://www.dummies.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">For Dummies</a><strong> and </strong><a href=\"http://www.wiley.com/WileyCDA/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Wiley </a>  </p>", 
    "end_date": null, 
    "title": "Excel Data Analysis For Dummies", 
    "price": "50.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/185916_4868_2.jpg", 
    "course_url": "https://www.udemy.com/excel-data-analysis-for-dummies/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-20T15:24:33Z"
}