{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Welcome to my course on Microsoft Excel Power Map, a new mapping extension for Excel 2013 and Office 365, and is a part of the Excel Power BI extensions.</p>\n\n<p>At the end of the course, you will be able to look at information in new ways using Excel’s 3-D data visualization tool, Power Map. A power map lets you discover insights you might not see in traditional 2-D tables and charts.<br></p>\n\n<p>With this Excel Power Map course, you will learn to plot geographic and temporal data on a 3-D globe or custom map, show it over time, and create visual tours that you can share with other people. \n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">What you will learn from this course:</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Mapping data:</strong> You will be able to plot more than a million rows of data visually on Bing maps in 3-D format from an Excel table or Data Model in Excel.\n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">Discovering data insights:</strong> you will gain new understandings by viewing your data in geographic space and seeing time-stamped data change over time.\n\n  </p>\n\n<p><strong>Sharing visual stories:</strong> You will be able to capture screenshots and build cinematic, guided video tours that you can share broadly engaging audiences like never before. Or export tours to video and share them that way as well.\n\n  </p>\n\n<p>This course is designed for professionals who make reports and presentations in regular basis for their companies. Excel Power Map is an extremely powerful reporting tool. Sometimes we need to get sales reports and we want to identify regions and patterns of sales related to the customers. Acquiring working knowledge in Excel Power Map will take your reporting and presentations to a new high. </p><p>\n  Thanks for your interest in my Excel Power Map course!</p>", 
    "end_date": null, 
    "title": "Excel Power Map: A Power BI Tool for Reporting Professionals", 
    "price": "20.00", 
    "instructors": "Excel Academy", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692260_1a62.jpg", 
    "course_url": "https://www.udemy.com/excel-2013-power-map-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T19:53:36Z"
}