{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong></strong>______________________________________________________________________</p><p>Another course from the <strong>Creator of the Best Selling Course on Excel Dashboards</strong> this course will add to your knowledge to learn more than 20 Excel Dashboards. Lets begin...</p><p>______________________________________________________________________</p><p><strong>IMPORTANT: This Course Does not require a pre requisite completion of my old course Excel Dashboard Secrets. The Old course consist of 18 Dash boards and new course consist of 20 dashboards all dashboards are <em>DISTINCT</em> from each other. </strong></p><p>Excel Dashboards are a powerful tool to communicate and summarize complex Excel data. This complex data can be presented by creating Dashboard. Dashboard will help to quickly analyse the data, Find the draw backs, Expect the future outcomes and lots more</p><p>Master the creation of Interactive dashboard and learn to present it in a presentable format. Learn new techniques which will help to create complex Excel Dashboard.</p><p><strong>Learn:</strong></p><ol><li>Advance formulas and Functions</li><li>Learn to analyse the data</li><li>Learn to present the data in effective format</li><li>Learn to do complex excel task in a simpler way</li><li>Learn secrets of Charting</li><li>Learn Interactive Elements (Combo boxes, List boxes , Check boxes …)</li><li>Learn the effective utilization of Excel Features</li><li>Learn the Principles of Dashboarding (Heat Analysis, Blur Test Analysis)</li></ol><p><strong><em>Learn it by Your way!!</em></strong></p><p>Udemy Provides access to the course for <strong>Lifetime</strong>. Hence repeat the course as many times you want and make your concepts clear. Learn anywhere and anytime.</p><p>Get the answers ready from the discussion corner.</p><p><strong>Is this course for me?</strong></p><p>This course is designed for a particular type of people who are aware with the basics and looking forward to master the intermediate techniques. Check out if this course is for you:-</p><ol><li>If you need to analyse the data and find out the conclusion</li><li>Your Job is to analyse the data and present it to clients</li><li>Want to learn more in Excel</li><li>For Managers who have to take quick and quality decisions by analyzing data</li><li>For Managers who are managing the performance of the company</li><li>Students who wants to learn more and advance in Excel</li><li>For IT Professionals who want to develop carrier in Excel</li><li>For anyone who wants to use Excel as a base to create projects and reports</li><li>For Excel lovers who wants to learn more..</li></ol><p>Practically this course is suited for <strong><em>anyone who knows excel</em></strong>. This course is generally carried in fast pace and hence one needs to familiar with the basic and advance concepts in Excel</p><p><strong>Learning Road Map</strong></p><ul><li>Learn Creating a Panel Chart Dashboard</li><li>Creating a Incell Dashboard</li><li>Creating a KPI (Key Performance Indicator) Dashboard</li><li>Lesson- Selecting the right type of chart</li><li>Creating a Funnel Chart Dashboard</li><li>Creating a dynamic dashboard with timmed content</li><li>Create a dynamic text highlight dashboard with conditional formatting</li><li>Create a Histogram , Patero and cumulative chart</li><li>Create a Waterfall Chart</li><li>Create a Interactive Text Dashboard with slicer (Awesome technique, My Favourite)</li><li>Show Average in Chart</li><li>Dashboard Analysis, Heat Places Analysis, Blur Test Analysis</li><li>Trend Analysis Dashboard (My Best ever made dashboard)</li></ul><p><strong><em>Dashboards are ULTIMATE PRODUCTIVITY SUITES</em></strong></p><p><strong>Contents and Overview of Lectures</strong></p><p>There are over<strong> 30 + Lectures</strong> and over <strong>3 Hrs of content</strong> containing video and Downloadable Materials. The downloadable material are crucial part of learning Excel Dashboards. When one wants to revise the technique learned before he can achieve this by using Exercise Files provided in the course materials</p><p>Upon the completion of the course students have a variety of techniques which can be applied to the live data and create the reports. Students will be focused on how to create a dashboard without wasting lot of time.</p><p><strong>Click the \"<em>take this course</em>\" button, top right, now ...every hour you delay is costing you money...</strong></p><p><strong>Introductory Price..... Take Action Now......</strong></p><p>-Amey Dabholkar</p>", 
    "end_date": null, 
    "title": "Excel Dashboard Secrets 2 - Create Stunning Excel Dashboards", 
    "price": "40.00", 
    "instructors": "Amey Dabholkar", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/534932_6cf6_2.jpg", 
    "course_url": "https://www.udemy.com/excel-dashboard-secrets-2/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T08:36:22Z"
}