{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>*** Excel Analytics - Advanced Formulas &amp; Functions </strong><strong>Includes 60+ FREE Downloadable PDF cheat sheets and 9 Excel project files ***</strong></p><p><strong>It's time to show Excel who wears the pants in this relationship.</strong> Whether you're starting from square one or aspiring to become an absolute Excel badass, you've come to the right place.<strong></strong></p><p>This course will give you a deep understanding of the advanced formulas and functions that transform Excel from a basic spreadsheet program into a dynamic and powerful analytics tool. While most Excel courses focus on <strong></strong>simply <em>what</em><strong> </strong>each formula does, I teach through <strong>hands-on, contextual examples</strong> designed to showcase <em>why</em><strong> </strong>these formulas are awesome and <em>how </em>they can be applied in a number of ways. I will not train you to regurgitate functions and formula syntax; I will teach you how to THINK like Excel.</p><p><strong>By the end of the course you'll be writing robust, elegant formulas and functions from scratch, allowing you to:</strong></p><ul><li>Easily build dynamic tools &amp; Excel dashboards to filter, display and analyze your data</li><li>Go rogue and design your own formula-based formatting rules</li><li>Join datasets from multiple sources in seconds with lookup and match functions</li><li>Pull real-time data from APIs directly into Excel (weather, stock quotes, directions, etc.</li><li>Manipulate dates, times, text, and arrays</li><li>Automate tedious and time-consuming analytics tasks using cell formulas and functions in Excel (no VBA required!)</li></ul><p><strong><br></strong></p><p><strong>We'll dive into a broad range of Excel formulas &amp; functions, including:</strong></p><ul><li>Lookup/Reference functions</li><li>Statistical functions</li><li>Formula based formatting</li><li>Date &amp; Time functions</li><li>Logical operators</li><li>Array formulas</li><li>Text functions</li><li>Powerful analytics tools and formulas like INDIRECT, HYPERLINK, WEBSERVICE &amp; FILTERXML</li></ul><p><strong>What gives you the right to teach this class? Can't I just Google this stuff?</strong></p><p>Fantastic question. First and foremost, I have a genuine passion for Excel that most people reserve for things like kittens, ice cream, and/or significant others. The only thing I love more than learning Excel is <em>teaching </em>it, and as the founder of Excel Maven I've been lucky enough to teach <strong>thousands </strong>of people just like you over the past 7+ years. My teaching style is conversational, authentic and to the point, and I will <strong>always</strong> communicate complex concepts in a framework that is clear and easy to comprehend.</p><p>As a full-time analytics consultant and Excel instructor, I cut my teeth using Excel to solve <strong>real-world business problems</strong> and develop award-winning <strong>analytics &amp; data visualization tools</strong> for Fortune 500 companies. If you care about creds, I'm a card-carrying MOS Certified Excel Expert and my work has been featured by Microsoft and the New York Times. Ok so I don't actually <em>carry </em>the card, but you get the idea.</p><p>If you're looking for the ONE course with all of the advanced formulas and functions that you need to know to become an absolute Excel ninja, you've come to the right place.</p>", 
    "end_date": null, 
    "title": "Excel Analytics - Advanced Excel Formulas & Functions", 
    "price": "40.00", 
    "instructors": "Chris Dutton", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516446_4935_3.jpg", 
    "course_url": "https://www.udemy.com/excel-for-analysts/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-31T23:33:41Z"
}