{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><p style=\"\">By taking this Excel For Beginners course, you will learn excel basics and other important  details on your way to becoming an <strong style=\"\">Expert</strong>  in using Excel.&nbsp; <strong style=\"\">Joel Levy</strong> of <strong style=\"\">PC Applications</strong>  with <strong style=\"\">20 years of Instructor Led Computer  Training Experience</strong> will take you step by step through the entire process  of creating a Worksheet with Net Income and Commission Calculations, Basic  Function Calculations (including Average), and a Sales Chart as an example of  how to create, save and print an Excel Workbook.&nbsp; Many important underlying concepts about  working with Excel are explained in detail using plain simple terms.&nbsp; Course files are provide so you can work  right along with each lesson for the &quot;hands on experience&quot;.</p>  <p style=\"\">Along the way, you will learn about what Excel can  be used for, the Excel Window and Using Tabs and Ribbons, Opening, Creating and  Saving Workbooks, Excel File Types, Entering Data and Data Types, Creating  Formulas and Functions, Cell Addresses and Cell Address Types, Moving and  Copying Data and Formulas, Editing Data and Worksheets, Formatting Data and  Worksheets, Creating Basic Charts, Proofing and Printing Including Headers and  Footers in this excel  for beginners. Many shortcuts are covered.&nbsp;  This excel  basics course contains 17 Lessons with almost 4 Hours of video  content.</p>  <p style=\"\">Although this excel for beginners course assumes you &quot;know nothing&quot;, it  could be very worthwhile even if you have already &quot;fumbled around&quot;  with Excel as important &quot;fundamental&quot; details are covered.&nbsp; The course starts at the beginning and gets  you well down the road in being functional in applying Excel to get the work  done, FAST!&nbsp; This course covers the same  information that I cover in my full day, 7 hour instructor led class that I  teach in my business.&nbsp; I also have Level  2 and Level 3 courses.</p>  <p style=\"\">See why many people have told me &quot;Best computer  training I&#039;ve ever had!&quot;</p>  <p style=\"\">I guarantee you will find this course well worth  your while.</p>    <p style=\"\">Take this Excel  Basics course right now and learn excel for beginners -Novice.</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Excel 2010 - Level 1: From Zero to Hero; Beginner-Novice ", 
    "price": "40.00", 
    "instructors": "Instructor, Trainer, Consultant Joel Levy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36560_681a_8.jpg", 
    "course_url": "https://www.udemy.com/joel-levy-excel-2010-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-17T13:27:30Z"
}