{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Note: THIS COURSE WILL BE FREE FOR JANUARY 2016</strong></p><p><strong>Course Description</strong><br></p><p>If you work with Excel in your day job, I will show you how you can have an unfair advantage over other professionals. By helping you to understand the <strong>correct</strong> Excel skills to focus on and more importantly showing you how to take advantage of those skills by selling yourself effectively you will increase your salary. I will teach you exactly what I did in my Excel career to go from a £27K salary to £100K in 3 years. Then I will show you how I eventually got to a £200K salary</p><p>YOU WON'T LEARN EXCEL SKILLS ON THIS COURSE, BUT YOU WILL LEARN HOW TO TURN SKILLS INTO BETTER CAREER PROGRESSION AND GREATER SALARY</p><p><strong>Double your salary from the insights I gained in my decade+ career working with Excel</strong></p><ul><li>I break down how I increased my salary by 700% in the last 7 years with Excel</li><li>Know at which point more Excel skills are no longer needed</li><li>Understand how Excel allowed me to break into Investment Banking</li><li>Learn the #1 reason we need better Excel skills (it's not as obvious as you might think)</li><li>How sometimes your Excel abilities can hold you back and what to do about it</li><li>See a real life before &amp; after of a Resume transformed to sell your Excel skills</li><li>An interview tactic for Excel users that is so powerful it will almost guarantee you secure the role</li><li>The main reason to learn VBA/Macros (very few professionals take advantage of this)</li><li>How I got over my fears from applying for 'better' jobs and how you can too</li><li>Why I never worry about economic recessions</li></ul><p><strong>This is a NEVER DONE before course on Excel because most people are not qualified to teach it</strong></p><p>By the end of this course you will have a very clear understanding of what you need to do to be earning a six figure salary. This is course about so much more than Excel skills.</p><p>Most professionals simply do not understand how to convert Excel skills into a higher salary. I have seen people with beginner level Excel skills earn more than those with advanced Excel skills. It comes down to </p><ol><li>How you sell your skills</li><li>How you manage your overall career (which is different from your day job)</li></ol><p>In this course, I cover both of those factors and effectively give you a roadmap to increasing your salary with your Excel skills.  </p><p>The biggest benefit of this course is that you are getting mentored by me, Sohail Anwar. I am a professional who has consistently earned over 6 figures (British Pounds) for many years by breaking in to the biggest companies and has guided many other professionals to break the six figure salary mark. </p><p><strong>Contents and Overview</strong></p><p><strong> </strong>This course is aimed at any professional who uses Excel in their day job. Regardless of whether you are a beginner or fairly advanced Excel user, this course will guide you on how to make the most of Excel to progress your career.</p><p>I have discovered in my decade+ career that having Excel skills offer some very unique opportunities to progress in your career and salary that other skills simply do not and I will teach you those things in this course.</p><p>You are getting my decade+ of experience, I made the mistakes, learned from them, acquired amazing mentors who guided me and now am sharing the most important of those insights with you so you can replicate my success far more quickly.</p><ul><li><span></span></li></ul>", 
    "end_date": null, 
    "title": "Excel: Powerful Insights that will Double your Salary", 
    "price": 0, 
    "instructors": "Sohail Anwar", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708072_4485.jpg", 
    "course_url": "https://www.udemy.com/excel-powerful-insights-that-will-double-your-salary/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T00:24:46Z"
}