{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">Another Excel Course?!? How is this one different? This course is not just a list of Excel functions. Yes, it does teach the critical Excel functions like IF, VLOOKUP, and pivot tables and charts, but it does so through an extended case study example of sales reporting and analysis. So you&#039;ll learn <strong style=\"\">WHY</strong> these functions are important, and how to use them to answer real business questions. You&#039;ll learn them by seeing them used in action to answer questions, like &quot;Who is the top customer?&quot; and &quot;What are the top-selling products?&quot; How do I know? I&#039;m a senior executive, and a hiring manager, at a high-tech manufacturing company.</p>  <p style=\"\">In this course, you are a business analyst, given the task of analyzing the sales results for a small company, to answer questions about sales and profitability. The lessons show the Excel functions in detail, highlighting each step. I provide the scripts for each lesson, along with the Excel file used, both the starting point and finishing point. I provide everything I can to make this course a success for you!  </p>  <p style=\"\">  \t                          The course starts with a basic set of raw data. First I show you how to format the raw data, adding product lines, customer regions, and product cost, using IF and VLOOKUP. Then I show you how to summarize the data with advanced pivot table functions, filters, and slicers, to calculate sales and margin by product line by region. Next, I show you how to visually display the results with several different types of charts, and to make a color-coded customer scorecard. Finally, I show you how to write the up the results in a business report.  </p>  <p style=\"\">  \t                          There is no more practical course on Excel and Business Analytics: this is exactly what business analysts do every day. I learned these Excel techniques over a period of years: you can learn them in a few days. Let&#039;s get started!  </p>", 
    "end_date": null, 
    "title": "Excel Case Studies: Sales Reporting with Pivot Tables/Charts", 
    "price": "20.00", 
    "instructors": "Jeff Knowlton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/300332_2fb2_6.jpg", 
    "course_url": "https://www.udemy.com/excel-and-business-analytics-part-2/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-15T03:13:30Z"
}