{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>New Section 18! Add Tab Controls to Forms! </strong></p><p><strong>Learn more</strong> than the<strong> basic structures in Access</strong>. Learn the <em><u>concepts underneath</u></em> and how they relate to and work wth <strong>Excel.</strong>  Learn Access from an instructor with years of experience teaching Access and creating custom databases for businesses.</p><p><strong>From a recent Student Review:</strong><em></em></p><p><strong><em>5 Stars - I finally have a grasp of Access and relational databases!</em></strong></p><p><em>Thanks to Bruce's course, I can confidently say I have a good grasp of what Microsoft Access is, how to use it effectively and how it differs from Microsoft Excel.</em></p><p><em>Bruce is clear and concise in his lectures. I enjoyed the hands-on/real world example style of teaching with downloadable Access &amp; Excel files. - Joey Sullivan</em></p><p>You will build a strong foundation in Access by<strong> understanding the logic</strong> behind its structure:</p><ul><li>Create tables and learn how to properly structure them.</li><li>Extensive Training on ALL types of queries.</li><li>Create reports from scratch instead of relying on wizards.</li><li>Learn how to create advanced reports based on queries.</li><li>Learn everything you need to know to build powerful and attractive forms.</li><li>Build subforms and learn how to move in and out of them.</li><li>Learn about simple macros.</li><li>Make basic command buttons in forms.</li><li>Learn a simple way to make multi value lookups on forms.</li></ul><p><strong>Another Student Review:</strong></p><p><em><strong>5 Stars - Fantastic Course!</strong><br></em></p><p><em>I have been trying to come to grips with Access for some time now, but each time I became frustrated and eventually gave up. This course is structured in a way that gripped my interest and motivated me to complete it. Bruce has extensive knowledge and the way that he presents the material, makes it easy to follow and understand and it is a very valuable resource. - John Ovens</em></p><p><strong>These Powerful Skills Will Skyrocket Your Value in the Marketplace!</strong></p><p>By learning how to use Access WITH Excel, you will rise to a level of skill that few others have.  Learning Access gives you incredible power over your data, no matter how large your data files are.  Nightmare editing tasks will no longer bother you as you use your knowledge of queries to update thousands of records in minutes!  Employers are waking up to the power of Access and those who have this knowledge will be in high demand with your current employer or other businesses. The practical skills taught in this class will give you the capability to double or triple your productivity!</p><p>There is a <u><strong>HUGE </strong>need in the marketplace</u> for people with these skills! This is your opportunity to <em>break away from the pack</em> of people who try and do everything with Excel, instead of learning that for many tasks, Access is the proper tool. This could be your shortest path to increasing your income!</p><p><strong>From a Student Review:</strong></p><p><em>\"This is an amazing class/series. Bruce does a fantastic job explaining each concept and does so with such concern for the student. Just in presentation one can identify that this is a passion for Bruce and not just read from a script. I cannot wait to put this education to use within my career!! Thank you for creating this material!\" - Rick WIlliams</em><em></em><br></p><p><strong>Content and Overview</strong><br></p><p>All you need to do the course is basic experience with Windows programs.  If you have or are using Excel, that is even better.  Much of the course is presented as a comparison to Excel and explains what tasks each program is best suited for.</p><p>Even though there are many lectures and several hours of content, each section focuses on <em>one set of concepts</em> so it is easy to do one section at a time, when your schedule allows. You will find that each chapter builds on the previous one as you build your understanding of Access, one step at a time.</p><p>By the time you have finished the course you will have done so much with Access and it will be so familiar that you will be ready to tackle your own data tasks <em>immediately</em>, putting your new learned skills into practical use and impressing your boss and coworkers.</p><p>The course is complete with working files and finished samples for everything that is covered. You will be able to work alongside the author as you work through each lecture and will receive a verifiable certificate of completion upon finishing the course.</p><p><strong><u>Click the Take This Course button</u></strong> to take your first step towards quickly increasing your income!  Also, remember that if you don't think the course is worth what you spent, you have a full 30 days to get a no questions asked refund!</p><p><strong>From Another Student Review:</strong></p><p><em><strong>5 Stars - Absolutely the Best Course I Have Taken</strong><br></em></p><p><em>I am not one to write many reviews, but when a course has reached beyond my expectations, I had no choice but to give compliments to the author Mr. Bruce Myron.</em></p><p><em>The content of the course was extremely comprehensive and informative in which every student will walk away having the best foundation of MS Access one can get. The clarity and tone of each video had me eager to learn more and has already assisted me with applications I had at work. With the knowledge I have gained, not only will it help separate myself from my co-workers, but allow me to increase my income over time.</em></p><p><em>The greatest treat one will get in this course is the interaction from Mr. Myron. He is absolutely the difference maker from any other course I had taken and made me feel that I was not alone while taking this course. I cannot wait to begin the other courses to get to the next level of my career.</em></p><p><em>Trust me, when it comes to learning MS Access from the ground up through Mr. Myron's courses, starting with Excel To Access: Intro to Access for Excel Users, one will be ecstatic with the results. - David Richardson</em></p><p><strong>Another Student Review:</strong></p><p><em><strong>5 Stars - Brilliant piece of work!</strong><br></em></p><p><em>Thanks Bruce for making these lectures. They are very well done, relevant and clear. I have literally copied line for line of many of these lectures into a project i am working on. Highly recommended also are the other videos which also contain golden nuggets: Access to Excel to Outlook, Access to Excel-Instant Reports and pivot tables, Microsoft Access vba for non programmers. And as a bonus, Bruce has been very helpful in answering, guiding and explaining content from his lecture when i asked for clarification.</em></p><p><em>Brilliant Bruce, thanks again - Steven Kawuma</em></p><p><strong>Required Software</strong></p><p>You should have Office 2010 or later.   The course was created using Office 2013.</p>", 
    "end_date": null, 
    "title": "Excel to Access: Intro to Access for Excel Users", 
    "price": "30.00", 
    "instructors": "Bruce Myron", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506788_75b6.jpg", 
    "course_url": "https://www.udemy.com/import-excel-into-access/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T03:27:57Z"
}