{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>In this course, you'll learn how to master all the most useful <strong>Excel keyboard shortcuts.</strong><br></p><p>I used long hours and most weekends in trying to meet deadlines at work. But, since I learnt these wonderful Excel shortcuts, I managed to <strong>halve </strong>the time I used to take to complete tasks. Now, I don't have to work long hours and weekends anymore. I get to spend more time with my family &amp; friends and dance some of the nights away!</p><p>This course is targeted to all the Excel users who want to speed up the completion of their tasks by using the Excel shortcuts. Fly through your work by using shortcuts such as Ctrl + B for making text bold, Alt + = for summing up numbers and Ctrl + G for jumping to a particular cell. All using just a keyboard and not using the mouse.</p><p>By learning Excel shortcuts, you get to complete tasks in a <strong>much shorter time than before.</strong> This <strong><em>increases your productivity</em></strong> and will impress your employer and yourself. By leaving your fingers on the keyboard for as long as possible, you <strong>halve the time </strong>that it would have taken if you were using your mouse for completing all your tasks.</p><p>Topics in this course include:</p><ul><li><strong>Ten must know shortcuts</strong></li><li><strong>Formatting shortcuts</strong></li><li><strong>Workbook and worksheet shortcuts</strong></li><li><strong>Selection shortcuts</strong></li><li><strong>Data Entry shortcuts</strong></li></ul><p><strong>Training files</strong> are included which you should use to follow along.<br></p><span></span><strong>Benefits:</strong><ul><li>Take this course in order to <strong>increase your chances of getting a promotion. </strong></li><li>By using the Excel shortcuts, you can <strong>save up to 50% of time</strong> you spend when doing your work. </li><li>You will impress your boss when you <strong>submit your work much earlier than before!</strong></li><li>The more you wait, the more you still have to spend extra hours at work, including leaving late at work, as well as working weekends, in order to <strong>meet the deadlines</strong>.</li><li>Excel gurus hardly use the mouse; they <strong>focus on the keyboard</strong> since they know that's the best way to beat deadlines. You can do that too!</li></ul><p><strong>Take this course now!</strong></p>", 
    "end_date": null, 
    "title": "Excel Shortcuts: How to work faster and easier than before!", 
    "price": "30.00", 
    "instructors": "Hunting Training", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646192_47aa_2.jpg", 
    "course_url": "https://www.udemy.com/excel-2007-great-shortcuts/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T20:57:27Z"
}