{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t                   The course helps to get overall idea about the basics and main features of Excel. It allows getting through the long list of functions and formulas starting with the essentials and advancing step by step.  As a result the user reaches the level of an intermediate user.  </p>  <p style=\"\">  \t                   The first few lessons help the beginners to learn the essentials of Excel, whereas for the more advanced users it allows recalling the initial basis for moving to the further material, which deals with practically most of the commonly used features.  </p>  <p style=\"\">  \t                   No data entries are required throughout the course, so the user will be able to pick the starting step, which will be more relevant to their initial Excel skill level.  </p>  <p style=\"\">  \t                   Formatting, functions, formulas and advanced tasks with the worksheets are delivered in various sections for detailed description and peculiarities of their usage.  </p>  <p style=\"\">  \t                   The course includes 76 classes included in corresponding 15 sections. Each section deals with specific sets of functions and formulas relevant for a specific action. The information is offered in the form of short, but detailed videos. The user can cover the specific section in less than half an hour, which is practical in terms of time-management.  </p>  <p style=\"\">  \t                   In the further steps of the course the users get introduced with Excel as a database, learn the best practices of data handling and charts. The use of graphical objects and its complex forms are also included in the course.  </p>  <p style=\"\">  \t                   By the end of the course the user will turn into an Intermediate Excel user, capable of using the software in everyday tasks.  </p>  <p style=\"\">  \t                   The course comes in money-back guarantee, if the user is not satisfied with the course. The course includes a life-time access to the course so that the user will choose the best timing for the educational process. The course gets finalized with the standard Udemy certificate, which verifies the successful participation and completion of the course.  </p>", 
    "end_date": null, 
    "title": "Excel 2013: Excel 2013 Beginner - Intermediate ", 
    "price": "20.00", 
    "instructors": "Optimum  Education Center, Edwin Mirzayans", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/253762_6fe8_6.jpg", 
    "course_url": "https://www.udemy.com/excel-2013-online-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-01T13:31:22Z"
}