{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Course updated November 2015</strong></p><p>Why not learn a new skill for 2016 and get ahead of those New Year's resolutions! </p><p><strong>\"You don't know what's going to happen when you try, but if you don't try <u>nothing</u> will happen!\"</strong></p><p>Master Microsoft Excel easily even as a total beginner with our comprehensive course:</p><p><strong><em>Excel for Beginners: Learn Excel, Create a Budget, Have Fun!</em></strong></p><p>We take the boring out of numbers, in a fun, engaging and interactive course, that takes you step-by-step to becoming a Microsoft Excel pro. </p><p><strong><em>No Previous Knowledge Needed</em></strong></p><p>Complete beginners are welcome, there’s no need to have experience using Excel previously and certainly no requirement of any technical qualification. All you need is Microsoft Excel 2007 and we can get started. </p><p><strong><em>Who Likes Numbers Anyway?</em></strong></p><p>Most of us aren’t good with numbers and that’s exactly why Excel was created. This powerful software will work the figures and charts for you. What we do at Not Your Average Courses is make it as easy as A, B, C to navigate Excel to create financial budgets, overviews, spreadsheets, lists and so much more, in no time.</p><p>We’ll be revealing secrets that make it so easy you’ll be shocked you never learnt to use Excel sooner. </p><p><strong><em>What Make This Course Different?</em></strong></p><p><strong>We make learning fun</strong>, unlike most online Excel courses that are complicated, time-consuming, confusing and just plain boring. We like to make our Excel for Beginners Course fun, simply because it’s the best way to learn. </p><p><strong>We believe in keeping it simple.</strong> Over complicated and exhaustive explanations that bury the student in technicalities just cause confusion, distress and the desire to retreat. With our Excel for Beginners Course we break the details down to bite sized piece and keep the information to exactly what you need to know to get the job done.</p><p><strong>We encourage and motivate our students.</strong> Our students are encouraged to ask as many questions that they like, which can be general or related to specific projects. We’re happy to help you work through practical examples and will ensure you’re motivated and encouraged from start to finish.</p><p><strong>Lively and interactive learning is key.</strong> This Excel for Beginners Course doesn’t use conventional textbook methods for learning but instead real live examples by assisting you prepare your own financial budget in Excel. This relevant reference point will improve your memory of the formulas and commands used in Microsoft Excel. </p><p><strong><em>What You’ll Learn on this Excel for Beginners Course</em></strong></p><ul>  <li>How      the main components of Microsoft Excel work</li>  <li>Entering,      editing, and copying data in Excel</li>  <li>Sorting,      filtering, and organizing data</li>  <li>Writing      formulas and creating calculations</li>  <li>Shortcuts      to make your project easier</li>  <li>Using      graphs to represent data in Excel</li>  <li>How to      build your own personal budget</li> </ul><p><strong><em>What you will get from this course?</em></strong></p><p>With this Excel for Beginners Course You’ll</p><ul><li>Learn to create powerful projects</li><li>Take control of your finances by creating and editing your personal budget spreadsheet </li><li>Enhance your skills for jobs that require a working knowledge of Microsoft Excel</li></ul><p>Ideal for complete beginners or those who want to brush up on their skills, our Excel for Beginners Course is an excellent way to master a new skill and your finances all at once. </p>", 
    "end_date": null, 
    "title": "Excel for Beginners: Learn Excel, Create a Budget, Have Fun!", 
    "price": "20.00", 
    "instructors": "Damion Valencia", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636108_6b18_2.jpg", 
    "course_url": "https://www.udemy.com/not-your-average-excel-for-beginners-learn-excel-have-fun/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T19:05:25Z"
}