{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">***** THE MOST TUTORIALS IN ANY OF THE UDEMY EXCEL COURSES *****</strong><br></p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">       ***** OVER 10,000 SATISFIED STUDENTS JOINED IN LESS THAN 12 MONTHS *****</strong></p>\n\n<p><strong>***** THE NO.1 RANKED EXCEL COURSE ON UDEMY </strong><strong class=\"redactor-inline-converted\"> *****</strong>  </p>\n\n<p>  \t<em>\"This course is tremendously comprehensive. The best part is that the  course is served in small bite-sized pieces that are easily digested.  A teaching course that  doubles as a reference guide. Definitely worth your time and money\"</em> - <strong class=\"redactor-inline-converted\">James, Udemy Student</strong>  </p>\n\n<p> This is the Ultimate Excel Pivot Table course which has <strong class=\"redactor-inline-converted\">217 short and precise tutorials</strong>. It also expands in to Charts, Conditional Formatting, Macros and Excel Shortcut Tips!<br></p><p>  \t  \t                                                      No matter if you are a <strong class=\"redactor-inline-converted\">Beginner or an Advanced user of Excel</strong>, you are sure to benefit from this course which goes through every single tool that is available in an Excel Pivot Table.  The course is designed for Excel 2007, 2010 or 2013.  \t  \t                                                   There are <strong class=\"redactor-inline-converted\">14 different chapters</strong> so you can work on your weaknesses and enhance your strengths. Each chapter was designed to improve your Excel skills with extra time saving Tips and real life business Case Studies.  </p>\n\n<p>  \t                                             In no time you will be able to <strong class=\"redactor-inline-converted\">analyze lots  of data</strong> and tell a story in a quick and interactive way, learn how to <strong class=\"redactor-inline-converted\"> build stunning Dashboards</strong> and <strong class=\"redactor-inline-converted\">get noticed </strong>by top management &amp;  prospective employers.  The course is just over <strong class=\"redactor-inline-converted\">9 hours</strong> long so you can become an<strong class=\"redactor-inline-converted\"> awesome analyst and advanced Excel user within 1 week! </strong>  </p>\n\n<p>  \t  In this course there are <strong class=\"redactor-inline-converted\">free downloadable Excel workbooks </strong>for each tutorial, a <strong class=\"redactor-inline-converted\">BONUS </strong><em>Pivot Table Cheat Sheet</em>, an <em>Excel Tutorial Tracker</em> and my <em>Top 20 Excel Shortcuts </em>in an animated gif format.  </p>\n\n<p>  \t    I have been helping thousands of people further their careers by teaching them Excel the <strong class=\"redactor-inline-converted\">easiest and most comfortable way</strong>.  These tutorials will give you career-building skills that you can use to become better and <strong class=\"redactor-inline-converted\">more efficient at your job</strong>.  </p>\n\n<p>  \t                    If you  really want to <strong class=\"redactor-inline-converted\">stand out from your colleagues</strong> and <strong class=\"redactor-inline-converted\">improve your  professional development</strong> to achieve greater opportunities like  promotions, a higher salary, knowledge that you can take to another job,  etc.....<strong class=\"redactor-inline-converted\">then this is the course for YOU</strong>!  </p>\n\n<p>  \t                                           You'll have<strong class=\"redactor-inline-converted\"> lifetime online access</strong> to watch the videos whenever  you like, and there's a Q&amp;A forum right here on Udemy where  you can post questions - and <strong class=\"redactor-inline-converted\">I'll answer them personally within the day!  </strong>  </p>\n\n<p>  \t            I am so confident that you will get<strong class=\"redactor-inline-converted\"> lots of value</strong> from this course that you can take it for the full 30 days, study it and apply it to your work to see the results.  <strong class=\"redactor-inline-converted\">If you're not 100% satisfied</strong>, I am more than happy to <strong class=\"redactor-inline-converted\">refund the full purchase amount!</strong>  </p>\n\n<p>  \t  \t  </p>\n\n<p>  \t                                                 So go ahead and learn from the following in depth Pivot table subjects and click the <strong class=\"redactor-inline-converted\">TAKE THIS COURSE</strong> button, top right, NOW... <strong class=\"redactor-inline-converted\"><em>every hour you delay is delaying your professional progress </em>...  </strong>  </p>\n\n<p> 1 CUSTOMISE YOUR PIVOT TABLE 2 VALUE FIELD SETTINGS &gt; SUMMARIZE VALUES BY 3 VALUE FIELD SETTINGS &gt; SHOW VALUES AS 4 GROUPING 5 SORT 6 FILTER 7 SLICERS (NEW IN EXCEL 2010) 8 CALCULATED FIELDS &amp; ITEMS 9 PIVOT CHARTS 10 CONDITIONAL FORMATTING PIVOT TABLES 11 GETPIVOTDATA formula 12 MACROS 13 DATA MANAGEMENT 14 BONUS VIDEOS</p>", 
    "end_date": null, 
    "title": "Excel with Microsoft Excel Pivot Tables!", 
    "price": "50.00", 
    "instructors": "John Michaloudis", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/257992_a559_8.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-pivot-tables-for-2007-2010-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-08T21:51:51Z"
}