{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn Excel for data analysis from basic to expert level and be able to apply this practical skill in any field. It explores spreadsheet software’s most relevant features which will help you become an expert as beginner, achieve proficiency as basic user or polish skills and finish learning curve as an intermediate one. All of this while using real-world data together with practical exercises done step-by-step.</p>    <p><strong>Become an Expert in Excel for data analysis by learning its most relevant features.</strong></p>    <ul><li>Use main file types and their options.</li><li>Store data in worksheets within workbooks.</li><li>Navigate worksheets’ cells quickly by using keyboard short-cuts.</li><li>Perform data operations with formulas and built-in functions.</li><li>Visualize data through conditional formatting and charts.</li><li>Organize data interactively with tables and pivot tables.</li><li>Implement scenarios with what-if analysis.</li><li>Analyze data with statistical and probabilistic add-in tools.</li><li>Optimize formula results with solver add-in.</li></ul>                    <p><strong>Achieve Excel for data analysis proficiency and be able to apply it in any field.</strong></p>  <p><strong></strong></p>  <p>Learning Excel is essential for any professional or academic career based on data analysis. It is the most commonly used data analysis software both professionally and academically and it’s a solid foundation before learning any other.</p>    <p>But as learning process can become difficult as complexity grows, this course helps by leading you through step-by-step real-world practical exercises for greater effectiveness.</p>    <p><strong>Content and Overview</strong></p>  <p><strong></strong></p>  <p>This course contains over 35 lectures and more than 6 hours of content. It’s designed for all Excel knowledge levels and no previous familiarity is required.</p>    <p>At first, you’ll learn how to use main file types depending on data format and how to protect it when sharing. Then you’ll study how to store data in workbooks containing one or more worksheets and their navigation by identifying cells as intersection points of columns and rows. This can be done quicker when using keyboard short-cuts.</p>    <p>After that, you’ll perform data calculations with formulas and built-in functions, correct any errors in them, and perform input validation when interacting with users. Next, you’ll visualize data with conditional formatting and charts. You’ll organize it interactively with tables and pivot tables which can be sorted and filtered.</p>    <p>Later, you’ll implement scenarios with what-if analysis. You’ll also do data analysis through statistical and probabilistic add-in tools such as identifying trends, deliver descriptive statistics and frequency histograms, evaluate correlation and causation between explained and explanatory variables, and simulate random numbers with pre-defined or user-defined probability distribution functions. Finally, you’ll optimize a formula’s result using solver add-in by defining changing variables and their constraints.</p>", 
    "end_date": null, 
    "title": "Excel for Data Analysis: Basic to Expert Level", 
    "price": "20.00", 
    "instructors": "Diego Fernandez", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631492_5ebe_3.jpg", 
    "course_url": "https://www.udemy.com/excel-for-data-analysis-basic-to-expert-level/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T16:51:24Z"
}