{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong>  </p>  <p>  \t<strong>Over 300+ Happy Students having great Content Engagement</strong>  </p>  <p>  \t    LATEST: Course updated on 8th of September 2014  </p>  <p>  \t  What&#039;s New: <strong>Cheat Sheet </strong>which helps you to revise the content later  </p>  <p>  \t<strong>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>EXCEL EXPLORE&#039;S WHAT IF ANALYSIS <em>- THE MOST PRODUCTIVE TOOL</em></strong>  </p>  <p>  \t<strong><em>Benefits to Everyone</em></strong>  </p>  <p>  \t<strong>Accountant </strong>&quot;I Can now Easily save the scenarios of multiples Tax rates and create provision for changes in Tax rates&quot;  </p>  <p>  \t<strong>Broker</strong> &quot;It helps me to calculate brokerage in an easy organised way. I don’t need help of any professional to do so. I saved a lot of $$$&quot;  </p>  <p>  \t<strong>Investor</strong> &quot;By Learning what if Analysis I became a smart investor rather than a bulk investor&quot;  </p>  <p>  \t<strong>Analyst </strong>&quot; It made me think out of the box and would easily use excel to analyse most of the data. I can now efficiently use solver to find out optimum solution to a problem&quot;  </p>  <p>  \t<strong>Students </strong>&quot;This Clarifies how to analyse the data using data Analysis. We learned how to use financial functions and solve some of the complicated budget problem using goal seek  </p>  <p>  \t<strong>YOU CAN ALSO USE THIS SKILLS TO GET MORE PRODUCTIVE IN FUTURE.</strong>  </p>  <p>  \t<strong>EXCEL WHAT IF ANALYSIS</strong> video training is the ultimate course which will help you to get most out of your data with no special skills required. We believe in <strong>structured learning</strong> which comprises of :-  </p>  <ul>  \t<li>Explaining the concept, </li>  \t<li>Examples </li>  \t<li>Test</li>  </ul>  <p>  \t      This Excel course comprises of video training which you can watch at your own pace where ever you want.  </p>  <p>  \t          Excel is one of the most used spreadsheet applications with ever expanding capabilities. You can get the most out of Excel by learning Excel&#039;s what if Analysis tool. e.g If you need a particular amount at an end of the period at a given a rate of interest then how much should you invest? and vice versa. This problem is normally solved by trial and Error method, permutation combination etc. which is time consuming and may not give accurate results but <strong>GOAL SEEK</strong> will help you to solve this problem within seconds.  </p>  <p>  \t           What if you want to project future outcome i.e expected change in Tax rates. <strong>SCENARIO MANAGER</strong> handles multiple scenarios in a fraction of seconds and helps you to take an appropriate decision.  </p>  <p>  \t          Creation of<strong> DATA TABLE</strong> helps to create a table of analysis of one or two variables without using a single formula.  </p>  <p>  \t           What if you want to find an optimum solution to a problem having multiple conditions to solve. Utilty tool in Excel viz <strong>SOLVER</strong> is the best approach you solve that problem in seconds?.  </p>  <p>  \t           This course becomes more interesting when it comes 3 bonus sections to practice.  </p>  <ul>  \t<li><strong>PMT FUNCTION</strong></li>  \t<li><strong> CASH FLOW</strong></li>  \t<li><strong>FORM CONTROLS,</strong> and lots more.</li>  </ul>  <p>  \t<strong>Includes:</strong>  </p>  <ol>  \t<li>High Quality videos (Recorded at 720P HD Mode)</li>  \t<li>Exercise Files/ Handouts to download</li>  \t<li>Lifetime Access to the videos / Updates (if Any)</li>  </ol>  <p>  \t<strong>    Note:  </strong>  </p>  <p>  \t          This course which focuses on the specific target of understanding WHAT IF ANALYSIS is recorded using Excel 2013 and can be used by Excel 2007 + Versions. This course is also suitable for Excel for Mac.  </p>  <p>  \t    Click the &quot;take this course&quot; button, top right, now ... <em>every hour you delay is costing you money </em>..  </p>", 
    "end_date": null, 
    "title": "Excel Secrets: High Productivity learning what-if-analysis", 
    "price": "40.00", 
    "instructors": "Amey Dabholkar", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/247694_67c7_6.jpg", 
    "course_url": "https://www.udemy.com/excel-what-if-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-21T15:55:24Z"
}