{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><em><strong>*UPDATED: 4/072016*</strong></em></p>\n\n<p><strong>Do you use Microsoft Excel? </strong></p>\n\n<p><strong><em>-Learn Excel Shortcuts, Tips and Tricks that will make you money (money moves)!</em></strong></p>\n\n<p><strong><em>-What would it be like to create a chart by pressing one button?</em></strong></p>\n\n<p><strong><em>-What would it be like to easily create a slicer controlled pivot table with a chart in just minutes?</em></strong></p>\n\n<p><strong><em>ALERT! - </em>This course is not meant to be completed! I am continuously adding lectures that quickly resolve issues professionals in my live seminars across the USA are having while using Excel in their daily work.</strong></p>\n\n<p>To ensure that you have all of the ingredients in place when using Excel it takes years of using the program before you learn all of these “Secrets of Excel.\"</p>\n\n<p>You have taught me a few things that irritate you about Excel, (VLOOKUP, PivotTable, Conditional Formatting, Charts, Formulas), and I have developed this course full of Excel Shortcuts Tips and Tricks that will take years off your learning curve. You will be using Excel like a professional within seconds of viewing this course.</p>\n\n<p>There's only 86,400 seconds in a day, and you can't make time, or save time – you can only spend it and invest it.</p>\n\n<p><strong><em>=================================================</em></strong></p>\n\n<p><strong><em>Super easy to follow!</em></strong></p>\n\n<p><strong><em>\"If you have trouble with Excel, then this course makes it much easier to understand. The instructor is very knowledgeable and he makes it fun to learn.\"</em></strong></p>\n\n<p><strong><em>==================================================</em></strong></p>\n\n<p><strong><em>Billy Wigley Is #1 Excel Trainer</em></strong></p>\n\n<p><strong><em>\"Billy's Course is great for newcomers to excel and excel veterans alike that want to increase their knowledge, proficiency, and Skills!!! Billy is by far the most entertaining and knowledgeable Excel mentors I've had the privilege of learning from. I recommend his online course as a must for the aspiring excel guru, and I HIGHLY RECOMMEND trying to find one of his live lectures.\"</em></strong></p>\n\n<p><strong><em></em></strong><em>==================================================</em></p>\n\n<p>You are an ACHIEVER. You KNOW what to do – Take This Course – and let's get started.</p>\n\n<p><em><strong>*UPDATED: 4/07/2016*</strong></em></p>", 
    "end_date": null, 
    "title": "Excel Shortcuts, Excel Tips, Excel Tricks - Excel Skills!", 
    "price": "20.00", 
    "instructors": "Billy Wigley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386004_e0da_8.jpg", 
    "course_url": "https://www.udemy.com/dontgetmadgetskills-excel-shortcuts/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T20:46:59Z"
}