{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "Cette formation s’adresse à des personnes ayant déjà une certaine expérience de la programmation d’Excel en VBA, et qui souhaitent augmenter leurs compétences, et découvrir de nouvelles façons de programmer.\n\n<p>Je vous propose d’aborder :</p>\n\n<ul><li>La programmation du filtre avancé (très utile !)</li><li>La programmation des modules de classes, avec une introduction à la programmation orientée objet(<strong>POO</strong>)</li><li>La programmation des <strong>Tableaux Croisés Dynamiques</strong></li><li>La programmation des <strong>graphiques</strong></li><li>La programmation de l’accès à une base de données, soit avec la bibliothèque <strong>DAO</strong>, soit en utilisant l’objet <strong>QueryTables</strong>.</li><li>L'accès à un classeur, sans ouvrir ce classeur, en utilisant la bibliothèque ADODB</li><li>La programmation du ruban en <strong>XML </strong>(la seule qui permette d’avoir un ruban complètement personnalisé !)</li></ul>\n\n<p>Cet apprentissage se fera en développant un ou plusieurs mini projets, souvent inspirés de mes propres projets professionnels.</p>\n\n<p>De manière générale, nous chercherons à <strong>optimiser les performances</strong> de nos programmes.</p>\n\n<p>L’objectif de cette formation est aussi de vous apprendre à développer une application à partir d’un cahier des charges, pour acquérir les <strong>bonnes pratiques de conception</strong>.</p>\n\n<p>Je vous donnerais des conseils et un guide de conception. Et je vous proposerais ensuite de développer vous-même le mini projet.</p>\n\n<p>En effet, c’est en résolvant vous-même tous les problèmes qui surgissent pendant l’écriture du programme, que vous allez progresser.</p>\n\n<p>Bien sur, je détaille ensuite tous les aspects de ma propre solution.</p>", 
    "end_date": null, 
    "title": "Excel VBA: devenez expert!", 
    "price": "50.00", 
    "instructors": "Philippe Pons", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759772_1c50.jpg", 
    "course_url": "https://www.udemy.com/excel-vba-devenez-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T16:27:55Z"
}