{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>Learn key concepts and skills that you will need to build proficiency in Microsoft Excel so you will be prepared to get a job, secure a promotion or just be a better entrepreneur.</p><p><strong>Build a strong foundation in Excel (which is proven to be an important job and business skill) with this tutorial specifically designed for beginners. Learn about:</strong></p> <ul><li>Entering and Editing Data Fast;</li><li>Selecting Ranges Wisely;</li><li>Using Key Formatting Tools Efficiently;</li><li>Inserting Charts and Sparklines Quickly;</li><li>Solving A Common Business Assignment Effectively; </li><li>And Much More</li></ul> <p><strong>A Powerful Skill at Your Fingertips </strong> Learning the fundamentals of Excel puts a powerful and very useful job securing tool at your fingertips. Excel is easy to learn and is essential to many jobs in this knowledge-based economy.</p><p>Knowing how to use Excel can be a key factor in determining whether you get a job or secure a promotion. You can learn Excel and I make it easy for your by giving you job relevant skills and using real world scenarios to keep it interesting for you.</p><p><strong>Content and Overview </strong>  Designed specifically for beginners who want a to get right to the important material. Through this course you'll learn some of the fundamentals and establish a strong understanding of the how to work smart in Microsoft Excel. </p><p>Starting with identifying the elements on a worksheet, this course will take you through some basic Excel Skills like inserting columns and entering data quickly to completing a real world business assignment using Excel. By working with these lessons, you'll a establish a strong understanding of the basics of Excel. </p><p>Students completing the course will have the knowledge to create and manipulate a basic Excel spreadsheet quickly and with ease. </p><p>It is important that you work alongside the author as you work through each concept as this will give you the confidence and knowledge to move on to the next level.</p><p><strong>What am I going to get from this course?</strong></p> <ul><li>Learn some of the fundamentals of Microsoft Excel 2016.</li><li>Short videos that each deal with only a few concepts to make it easy to digest.</li><li>Suitable for beginners in Excel and ideal for users who learn faster when shown.</li><li>Visual training method, offering users increased retention and accelerated learning.</li><li>Real World assignment to increase retention in adult students.</li></ul>", 
    "end_date": null, 
    "title": "Excel 2016 - Top Beginners Guide - Start Now", 
    "price": "20.00", 
    "instructors": "Reginald Reglus", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/522072_a797_2.jpg", 
    "course_url": "https://www.udemy.com/beginning-excel-2016-made-simple-improve-your-income-now/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-06T17:06:38Z"
}