{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \tIn this course, I will show you some keyboard and mouse shortcuts for MS Excel that have helped me a lot in my 7+ years long data analyst career.  </p>  <p>  \tThis short, 30 minutes, course is designed for everyday users of Excel who still consider themselves beginners in this software package. This seemingly contradictory statement becomes logical if you consider that most people perform their everyday tasks on one and the same way, rarely exploring new opportunities that would facilitate their work. This applies to all aspects of life, and Excel, with its many mouse and keyboard shortcuts, is a good example. With this tool, you can perform any action in a number of ways but the question is whether these ways are equally effective. When I talk about efficiency, I do not think that in the cold, heartless, &#039;corporate&#039; sense. I mean the efficacy which is concerned with you, personally, in your workplace. When you gain the ability to perform some actions fast, your self-confidence will rise up, the level of stress gets reduced and and you get a relieve a bit of time. In this course I&#039;ll show you some shortcuts for working in Excel that you may save up to half an hour per day. Those shortcuts are nothing epic or concealed but are relatively seldom used because people tend to take the path of least resistance. You can do better than that.  </p>", 
    "end_date": null, 
    "title": "Excel Shortcuts That Will Save Your Job", 
    "price": "20.00", 
    "instructors": "Vladeta Marinkovic", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301600_33ca.jpg", 
    "course_url": "https://www.udemy.com/excel-shortcuts-that-will-save-your-job/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-16T21:44:56Z"
}