{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">&quot;Es una herramienta muy importante sobre todo para las empresas,  ya que en este programa pueden realizar su contabilidad, sus facturas,  análisis de datos, agendas de clientes/proveedores, todo tipo de base de  datos, etc.&quot;</em>  </p>  <p style=\"\">  \t        Uccvirtual.  </p>  <p style=\"\">  \t <em style=\"\">  &quot;Excel ha creado una increíble eficacia en las finanzas e  industrias de contabilidad. Excel es ampliamente utilizado por muchas  empresas para gestionar, controlar y analizar los datos de la empresa.&quot;</em>  </p>  <p style=\"\">  \t        Investopedia  </p>  <p style=\"\">  \t   Excel 2010 ¡Súper Fácil! - Nivel intermedio es un curso pensado para las   personas que desean aprender Excel y que ya tienen conocimientos básicos, aunque este curso podría considerarse la continuación del curso de <strong style=\"\">Excel 2010 ¡Súper Fácil! Nivel básico</strong><a href=\"https://www.udemy.com/excel-2010-super-facil-nivel-basico/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\"></a> esto no debería representar ningún problema para las personas que desean tomar este curso sin haber tomado el nivel básico, ya que   este es un curso completo porque se hace un recorrido de Excel desde algunas de las herramientas básicas hasta las herramientas avanzadas   como lo son la creación de fórmulas, utilización de funciones y gráficos.  </p>  <p style=\"\">  \t  Sin embargo, si consideras que necesitas reforzar tus conocimientos básicos de Excel 2010 te invitamos a tomar el curso de <strong style=\"\">Excel 2010 ¡Súper Fácil! Nivel básico.</strong><a href=\"https://www.udemy.com/excel-2010-super-facil-nivel-basico/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\"></a>  </p>  <p style=\"\">  \t   Excel 2010 es uno de los programas más populares que existen.  Actualmente hay en el mercado otras versiones como Excel 2013 y Excel  365, sin embargo quien sabe manejar Excel 2010 sabrá manejar cualquiera  de las versiones que hoy tenemos disponibles.  </p>  <p style=\"\">  \t               Este curso de Excel 2010 está pensado para enseñarte de una  forma fácil y práctica las herramientas que hoy son usadas en la  universidad, empresas, contabilidad, estadística, matemática, finanzas,  etc.  </p>  <p style=\"\">  \t   En este curso aprenderás:  </p>  <ul style=\"\">  \t<li style=\"\">Herramientas de formato para trabajar con distintos tipos de datos.</li>  \t<li style=\"\">A crear fórmulas para resolver situaciones para las que no existe funciones.</li>  \t<li style=\"\">Las funciones más utilizadas en Excel para convertirte en una persona más efectiva.</li>  \t<li style=\"\">A insertar gráficos y mini gráficos de diferentes tipos.</li>  </ul>  <p style=\"\">  \t   Podrías completar este curso en un solo día o tomar algunas lecciones  diariamente, solo haz lo que te haga sentir mejor. De cualquier forma si  tomas este curso tendrás acceso de por vida y podrás consultarlo cada  vez que desees recordar algo.  </p>  <p style=\"\">  \t   Hoy en día Excel 2010 es el programa que todos necesitan saber.  </p>  <p style=\"\">  \t    ¡Este curso te encantará, bienvenido(a)!  </p>", 
    "end_date": null, 
    "title": "Excel 2010 Súper Fácil - Nivel Intermedio", 
    "price": "20.00", 
    "instructors": "Profesor [24]7", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/250214_022f_4.jpg", 
    "course_url": "https://www.udemy.com/excel-2010-super-facil-nivel-intermedio/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-25T16:47:28Z"
}