{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t                In my course you will see how I use basic and advanced Excel functionality while working on spreadsheets, so you will learn and apply the same techniques in your work and finish projects much faster and easier - like I do. It is essential to work quickly in a fast pace business environment.  </p>  <p>  \t<strong style=\"\">If You Use Excel At Work And Find Yourself Struggling And Hating It, This Course Is For You.</strong>  </p>  <ul style=\"\">  \t<li>Learn my best tips</li>  \t<li>Apply to your Excel projects</li>  \t<li>End your struggle with Excel</li>  </ul>  <p>  \t<strong style=\"\">Each video will address 2-3 Excel options I use every day to finish projects fast.</strong>  </p>  <p>  \t      Ever wonder how other people always meet their Excel projects deadlines?  </p>  <p>  \t      For $49 I will teach how to you work lightning fast in Excel in 60 minutes.  </p>  <ul style=\"\">  \t<li><strong style=\"\">Here&#039;s what you need to do: find the blue button &#039;Take This Course&#039; at the top on the right, click it and enroll in my course now.</strong></li>  </ul>  <p>  \tThere are 11 videos in this course. Each of them is a screen cast video. You will watch me perform tasks on my screen as if looking over my shoulder.  </p>  <p>  \tMy videos are short, direct, with clear explanation of techniques. I will not explain what Excel is, or what rows, columns and cells are. You will learn the most efficient ways of doing your every day boring tasks and will become an Excel rock star.  </p>", 
    "end_date": null, 
    "title": "Excel Productivity Hacks: How I Finish Projects In Minutes", 
    "price": "20.00", 
    "instructors": "Larissa Fontenot", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/131126_95ed_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-excel-do-your-work-for-you/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-09T01:57:38Z"
}