{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Excel 2013 es la<strong> nueva versión de Microsoft</strong> para su aplicación de hojas de cálculo. </p><p>Entre los objetivos que vamos a ver en este curso online de Excel, encontraremos la creación y modificación de tablas dinámicas, la creación de gráficos dinámicos asociados a los datos resumidos. Por otro lado vamos a aprender a <strong>filtrar,\n ordenar, clasificar, dar formato a los datos </strong>de manera que  se pueda \nhacer un mejor análisis de la información extraida o  simplemente para \nuna mejor visualización.</p><p>En este curso \nonline vamos a analizar grandes volúmenes de información para crear \ninformes que ayuden <strong>al área estratégica, directiva o gerencial de la \nempresa</strong>, y analizar información de difrerentes áreas de la empresa para su seguimiento y evaluación periódica.</p><p>Aprenderemos a crear <strong>cuadros de mandos </strong>que englobe los datos económicos de la empresa.</p><p>En\n este curso online de Excel, también vamos a aprender a utilizar un \ninforme de tabla dinámica para hacer más comprensibles y  fáciles de \ninterpretar de un solo vistazo <strong>conjuntos complejos de datos</strong>. Incrementar la rapidez en la creación de informes personalizados y a analizar y organizar datos empresariales con las tablas dinámicas. Aprenderemos cómo obtener indicadores tipos del análisis empresarial:</p><ul><li>Indicadores sobre<strong> las ventas de los comerciales.</strong></li><li>Indicadores sobre el comportamiento en<strong> las ventas de los productos.</strong></li><li>Indicadores sobre <strong>los pedidos tramitados.</strong></li><li>Indicadores sobre <strong>la actividad con clientes.</strong></li></ul>", 
    "end_date": null, 
    "title": "Excel 2013 para profesionales y directivos", 
    "price": "20.00", 
    "instructors": "Federico Huércano Ruiz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636020_8492_2.jpg", 
    "course_url": "https://www.udemy.com/excel-2013-para-profesionales-y-directivos/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T17:15:13Z"
}