{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t  Excel 2013 Dashboard Design will show you how to turn your  organization’s data into a powerful and interactive dashboard. By  learning these easy-to-implement, advanced techniques, you can impress  and empower the decision-makers in your organization, making you an  irreplaceable asset.  </p>  <p>  \t  Excel 2013 Dashboard Design begins by creating a vision for the  dashboard with the help of stakeholders, and then moves on to gathering  the data and building each element of the dashboard. The course ends  with comparing distribution strategies appropriate for every size and  type of organization.  </p>  <p>  \t  The first section, Outputs and Inputs, covers the strategic aspects  of planning your finished product and bringing in all of the necessary  data from your database or Excel workbook. We then explore PowerPivot, a  powerful bridge between your raw data and Excel. PivotTables will help  us slice our data in a flexible manner, and Charts give us at-a-glance  comprehension of important metrics and trends. Stylizing and  Interactivity enhance the user experience and present the information in  a manageable format. Publication can be problematic without proper  planning, but we’ll cover the most effective ways to distribute your  dashboard to any type or size of audience.  </p>  <p>  \t  Excel 2013 Dashboard Design will guide you through your entire  project, start to finish, covering every part of the process in depth.  Since you’ll not only learn how to do each task, but also why it would  be beneficial for you, you’ll be able to easily translate your learning  into your own dashboard design project.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<strong style=\"\">Tony Kau</strong> is a Tableau Desktop 8 Qualified Associate, and he is putting  its power to use in his role as a reporting analyst for a Fortune 500  company. His analytical background spans a decade, during which he has  used a variety of business intelligence software, though none were  better than Tableau. His passion is efficiently leveraging data to  inform strategic business decisions.<br style=\"\">  \t<br style=\"\">  \t  He holds a degree in  Business Administration from the University of Oregon, and his  background includes web design, programming, and financial analysis.  </p>", 
    "end_date": null, 
    "title": "Excel 2013 Dashboard Design", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326200_d92a_2.jpg", 
    "course_url": "https://www.udemy.com/excel-2013-dashboard-design/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-24T06:07:11Z"
}