{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Excel Formulas can seem daunting and even scary at first when beginning. On this course Excel formulas are made easy as you learn all the essential skills to writing formulas.</p><p><strong style=\"\">Master Excel Formulas Easily with this Comprehensive Course</strong></p><ul style=\"\"><li>Understand Excel formulas inside out.</li><li>Learn over 55 different Excel functions.</li><li>Write complex formulas with ease.</li><li>Recognise formula errors and fix common problems.</li></ul><p><strong style=\"\">Learn Everything You Need to Write Formulas with Ease</strong>.</p><p>Formulas are what drive Excel. They are the muscles allowing users to manipulate, lookup, aggregate and test data with ease.</p><p>Learning how to write formulas is an important skill for any Excel user looking to develop their talents.</p><p><strong style=\"\">Content and Overview</strong></p><p>This course was designed for anybody who needs to be able to confidently work with formulas in Excel. It is suitable both for complete beginners who want to start from the basics, and for those that have some experience but want to take things further.</p><p>The course is broken into different sections. It starts with building an understanding of the different elements of a formula, what the various symbols mean, some basic functions and different techniques for referencing cells.</p><p>Each section then focuses on a specific function category such as date or lookup functions. It starts to take things further by tackling mini projects and looking at more advanced formulas.</p><p>In over 75 lectures this course will teach you all the necessary skills to write advanced formulas with ease, and make those formula demons a thing of the past.</p><p>Working files are provided so that you can follow along and practice. You can also get assistance from myself with any queries you may have.</p>", 
    "end_date": null, 
    "title": "Excel Formulas Made Easy - Learn more than 100 Formulas", 
    "price": "20.00", 
    "instructors": "Alan Murray", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418098_0334_4.jpg", 
    "course_url": "https://www.udemy.com/excel-formulas-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T08:54:08Z"
}