{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn the basic concepts of spreadsheet design, formulas and functions that will enable you to build fully working models using the world’s most popular spreadsheet software.</p>\n\n\n\n<p><strong>Build a strong foundation in spreadsheet software with this Excel beginner’s course taught by a Microsoft Certified Trainer</strong>\n\n  </p>\n\n\n\n<ul><li>·         Workbooks and Worksheets</li><li>·         Formulas and Functions</li><li>·         Sorting, Filtering and Tables</li><li>·         Charts and Graphs</li><li>·         Page Layout, Formatting and Printing</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>A Powerful Skill Employers Want</strong>\n\n  </p>\n\n\n\n<p>Learning to use Excel puts you in a very strong position in the workplace. Employers in many different fields need people who are skilled at using the immense power of Excel to manipulate data. \n\n  </p>\n\n\n\n<p>When you understand the basics you can move on to more advanced topics like data analysis, using Excel for forecasting, building financial models and summarizing business activity via a dashboard.\n\n  </p>\n\n\n\n<p><strong>Content and Overview</strong>\n\n  </p>\n\n\n\n<p>I designed this Excel course to be easily understood by absolute beginners. Even if you are self-taught, in this comprehensive course we will cover together the right ways to use a spreadsheet efficiently and quickly.\n\n  </p>\n\n\n\n<p>We start with the basics of the Excel workbook and learn how to become confident in moving around quickly. We continue with Inserting, Hiding and Deleting and then look at the right method of performing Calculations.\n\n  </p>\n\n\n\n<p>Ever wonder why your formulas are not consistent? We’ll learn how to make them reliable and work every time – you’ll be amazed at just how easy it is. You will be able to choose how much you see by using Filters, and impress your peers by adding a Chart in a couple of clicks.\n\n  </p>\n\n<p>We finish up with a clear method of ensuring you only print what you want. By the end of the course you will be confident in using any version of Excel and capable of harnessing the power of this amazing software. You will be able to make Excel do what YOU want, not be a slave to what IT wants!\n\n  </p>\n\n\n\n<p>Complete with the actual working files I use, you'll be able to work alongside me and will receive a verifiable certificate of completion upon finishing the course.</p>", 
    "end_date": null, 
    "title": "Excel Basics– the Ultimate Beginner’s Course", 
    "price": "30.00", 
    "instructors": "David Millard", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/789554_c059_3.jpg", 
    "course_url": "https://www.udemy.com/excel-basics-the-ultimate-beginners-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T11:58:08Z"
}