{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t In this Excel A 2 Z - An In-depth video course, <a href=\"http://nurturetechacademy.in/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Nurture Tech Academy</a> introduces you to the most simplest and logical way to understand Excel environment in detail.  </p>  <p>  \t In this Excel training course, you will learn by watching the author actually perform the operation he is instructing on, as he explains step by step how to perform these functions. The training starts with Excel Introduction and its interface, how to write a Formula in Excel and starts with basic formulas like Sum and Count then gradually move to the complex one like IF, IF with And, IF with OR, Nested IF. Then it will cover the whole Lookup Functionality. Financial Functions will be covered there after with Date &amp; Time Functions.  </p>  <p>  \t It will also covers the basics of Excel Charts, <strong style=\"\">types of charts</strong> in Excel (e.g. Column, Bar, Line, Pie, Pie of Pie, Bar of Pie, Area, bubble chart etc.)  </p>  <p>  \t Data Validation, What-if Analysis, Solver Add-in covers afterwards.  </p>  <p>  \t Then we will see step by step how to record a Macro. Then it will show you how to use show developer tab, ways to record a Macro, record a Macro, use Relative Reference, Create a Monthly Report Macro, assign a Macro to a shape, how to edit or delete a Macro and finally what are the security settings of a Macro.  </p>  <p>  \t By the completion of this online training course, you will be fully versed, and capable of using most of the Formulas &amp; Functions in Microsoft Excel 2007/2010/2013 in a commercial Environment.  </p>", 
    "end_date": null, 
    "title": "Excel A 2 Z - An In depth Tutorial with Simplest logics", 
    "price": "20.00", 
    "instructors": "Nurture Tech Academy", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118860_f9ad_6.jpg", 
    "course_url": "https://www.udemy.com/excela2z/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-12T19:17:40Z"
}