{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Unleash the Full Power of Microsoft Excel</strong></p>\n\n<p><strong>Wow! How did you do that?</strong> This is something you're going to hear over and over again from your boss and co-workers as you apply the features you'll master as you participate in this course.</p>\n\n\n\n\n\n\n\n<p>Microsoft Excel users use only a small percentage of what the application is really capable of. But, hidden within Excel are loads of lesser known Excel Productivity Hacks that will make your Excel experience more efficient and fun. I've been teaching Microsoft Excel since the '97 version of the Microsoft Office Suite. Join me in this course and I will share with you some of the tips and tricks that I have picked up along the way as I have helped others become Excel Guru's.</p>\n\n\n\n\n\n\n\n<p><strong>I have kept each video lecture short and to the point, about 2-3 minutes each</strong>. At the time of creating this course, there will be 10 top Excel Productivity Hacks included. But, keep an eye on this course as I will be adding a couple new Excel Hacks each month. The course is recorded using Excel 2016, but Excel 2007, 2010,  2013 or 2016 will work in order to follow along.</p>\n\n\n\n\n\n\n\n<p>Towards the beginning of the video lectures is an <strong>exercise file that you can download and use to practice the concepts taught during each video lecture</strong>. Also, jump into the course discussion board and participate by asking questions or commenting on how awesome this course is. I will also be participating in the discussion board offering more Excel resources and answering any questions you may have.</p>\n\n\n\n\n\n\n\n<p><strong>Enroll now</strong> and start learning the secrets of Microsoft Excel and begin to WOW your boss and co-workers today.</p>", 
    "end_date": null, 
    "title": "Excel with Top Microsoft Excel Hacks", 
    "price": 0, 
    "instructors": "Kyle Pew", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801294_2a63.jpg", 
    "course_url": "https://www.udemy.com/excel-with-top-microsoft-excel-hacks/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T21:03:06Z"
}