{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">Aprenda Excel em vídeo aulas passo a passo!</p><p style=\"\">Nesse curso vamos abordar a parte básica do Excel, desde o entendimento das ferramentas à disposição até o uso de formatação condicional e fórmulas condicionais. Vamos montar nossa própria planilha do zero e você será capaz de aplicar seus conhecimentos em Excel em qualquer projeto que queira.</p><p style=\"\">Na primeira seção vamos tratar do basicão do Excel, vamos entender o workspace, formatar células, trabalhar com as abas e aprender as primeiras fórmulas.</p><p style=\"\">Em seguida vamos aprender os fundamentos do Excel, essa parte, apesar de básica ainda, é muito importante, porque é a base para o uso de grande parte do potencial do Excel. Nela a gente vai aprender a trabalhar no Excel de forma inteligente, usando preenchimento automático, transposição de fórmula, referência relativa, colar especial e as importantes fórmulas lógicas.</p><p style=\"\">Na terceira seção vamos avançar nos nosso conhecimentos em Excel. Essa é a hora que você aprende famosas ferramentas de uso constante em quase todos os projetos no Excel. Vamos trabalhar com funções de contagem, formatação condicional, a importantíssima fórmula SE e aprender a trabalhar com fórmulas de data.</p><p>E para finalizar, um vídeo simples explicando nossos próximos passos no desenvolvimento do curso.</p><p style=\"\">Sem mais enrolação, vamos lá!</p>", 
    "end_date": null, 
    "title": "Excel para Universitários - Básico", 
    "price": 0, 
    "instructors": "João Paulo de Lira", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362260_0c72_3.jpg", 
    "course_url": "https://www.udemy.com/excel-para-universitarios-basico/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T13:19:38Z"
}