{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>------------ The course has been fully updated for November 2015 ------------</strong><br></p><p>Have you wasted your time searching countless hours for YouTube videos, trying to find useful content about Excel Charts? What if you could learn how to make designer-quality <em><strong>Excel Charts and Graphs in 2 hours?</strong></em></p><p>Think about what your Excel charts look like if you could follow a concise and practical go-to guide course for creating Advanced Graphs in Excel </p><p>While Excel offers dozens of chart types and hundreds of formatting options, making the right Chart is tough. The adage \"A picture is worth a thousand words\" is also related to Excel Charts. A good Chart can clearly tell the story in your data.</p><p><strong>What this course is about:</strong></p><p><em><strong>In this course my goal is to give my students the practical knowledge, with real-world examples and step by step instructions, to create designer-quality Charts in Excel.</strong></em></p><p><strong>As a bonus</strong> I've included all the <em><strong>Excel Templates plus Sample Files plus Cheat Sheets</strong></em> for every section.</p><p>You'll have lifetime access to watch the videos whenever you like. If you're not 100% satisfied there is a <strong>30 day money back guarantee!</strong></p><p>Plus you will get <em>fast and responsive support within 24 hours.</em></p><p><strong>Here is what you'll get:</strong></p> <ul><li>How to select the correct Excel chart type for your data.</li><li>The most important elements of a Microsoft Excel chart, like chart and plot area, Design and Format tab, data labels, gridlines, legends, titles, axes, layouts and much more</li><li>Modifying an Excel Graph visually: styles and colors, create a pictograph, shapes, effects, text etc.</li><li><strong>Basic Excel Charts like Column charts, Bar charts, Pie charts, Line charts.</strong></li><li><strong>Advanced Excel Charts like Speedometer, Pareto, Gantt, Thermometer and Bullet Chart</strong></li><li>Updating and printing charts</li><li>Bonus material: Excel templates + Sample files + cheat sheets</li><li>Bonus Lecture : Excel most useful shortcuts etc</li></ul> <p>Only basic prior experience in Microsoft Excel or Spreadsheets is required to get the most out of this Excel course. </p><p>At the end of this Microsoft Excel class you will be given a <em><strong>Certificate of Completion.</strong></em></p><p><em><strong>So what are you waiting for? Begin creating the kind of charts you want and enroll now!</strong></em></p><p><em><strong>Thank you and I'll see you inside the course.</strong></em></p>", 
    "end_date": null, 
    "title": "Excel Advanced Charts", 
    "price": "20.00", 
    "instructors": "Andreas Exadaktylos", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/575434_0e4a_4.jpg", 
    "course_url": "https://www.udemy.com/create-excel-charts-and-graphs-in-2-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-06T07:42:20Z"
}