{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Created: 06/07/2016</strong></p>\n\n<p><strong>Last updated: 06/07/2016</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Why Excel? </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Excel, along with Word, is the most used software in the office workspace. Therefore, it is required for nearly every job nowadays. I’ve personally used it in every single one of my jobs, either as an engineer, as a consultant or even in my personal projects when I work at home.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><strong>Why this course?</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>This course starts from the very basic and teaches you everything you need to know for most office jobs, going directly to the point. There is no time wasted in unnecessary chatter to make the course longer than it actually needs to be. So if you want to learn Excel properly and you want to learn it fast, you came to the right place. </p>\n\n\n\n\n\n<p>This program is very powerful and lets the user access to thousands of commands, but I will go through the most important ones. I barely ever needed to use any commands other than the ones taught here.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><strong>Special features of this course</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<ol><li>You will learn how to use Excel in the fastest, easiest to follow and most practical way you’ve seen.</li><li>Excel workbook included with the tables I will use for you to follow my steps in each lesson.</li><li>Each section has a quiz to help you settle the knowledge and help you find your weak points.</li><li>Proposed exercises included at the end of some of the lessons, so you can practice the newly acquired knowledge.</li><li>Final quiz with questions about all the contents of the course.</li><li>Certificate of completion.</li><li>Teacher with over 15 years Excel experience across different sectors.</li><li>Lifetime access to the course with frequent updates and added bonus.</li><li>30 day money back guaranteed. If you aren’t completely satisfied with the course, your money will be reimbursed. Totally done through Udemy, no weird processes involved.</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Excel Made Easy for Absolute Beginners", 
    "price": "20.00", 
    "instructors": "Next Level Learn", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848938_2985_4.jpg", 
    "course_url": "https://www.udemy.com/excel-made-easy-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T11:50:01Z"
}