{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Data is everywhere, from databases to excel spreadsheets. Data is the future. Data is the new oil. Data is here and here to stay. We need to start making more sense out of our... <strong>Data</strong>.</p><p>Most of us in the field, where data is used to help the decision making process, have sometimes wondered if things could be more effective and efficient. This course will be your guide to fulfill that need. Be more productive, be more insightful and above all be on top of the \"data game\" you need to play these days.</p><p>Using state of the art technology and methods, you will be able, when you finish this course, to become the trusted advisor for your senior management or even better your CEO or CFO. Advance your career by gaining knowledge in the area of data handling, visualization and analysis.</p><p>You could be the one bringing innovative solutions to your companies' data environment and practice. Showing your company what they didn't know just yet, is your strategy to provide them with real and relevant value added data solutions.</p><p>-----------------------------------------------------------------------------------------------------------------------------------------------------------</p><p><strong>Note</strong>: The promo video shows you how an actual solution is built in under 3 minutes. You could do this yourself of course! Have fun!</p>", 
    "end_date": null, 
    "title": "Excel: Transform your data into powerful data-driven apps", 
    "price": "30.00", 
    "instructors": "Patrick Tehubijuluw", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541404_4543_3.jpg", 
    "course_url": "https://www.udemy.com/transform-your-excel-lists-into-powerful-data-driven-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T16:35:19Z"
}