{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t    Developed specifically for accountants, this course discusses the Excel features, functions, and techniques that are practical, relevant, and sure to save you time.  </p>  <p>  \t  After this course, you&#039;ll feel comfortable building PivotTable reports to replace existing formula-based reports. Plus, you&#039;ll learn how efficiently Excel can retrieve data from other data sources, including the world wide web. The session concludes with several features than enable you to communicate data graphically.  </p>  <p>  \t<strong>Background</strong>  </p>  <p>  \t    My Excel University series of books are available online in paperback and digital Kindle versions. My online Excel University courses teach the content of the books in video format. Now, for Udemy, I&#039;ve combined the book text and the lecture videos of Excel University Volume 3 and made them both available in this Excel for Accountants Volume 3 course.  </p>  <p>  \t<strong>Course Format</strong>  </p>  <p>  \t    Each course section will begin with the lecture video. You can work through the sample Excel file to practice. Each section also provides the text of the book which reinforces and enhances the content presented in the lecture video. I then provide additional resources and related Excel University blog posts and articles. These elements provide an effective training experience.  </p>  <p>  \t<strong>Instructor</strong>  </p>  <p>  \t    Author and award-winning instructor, Jeff Lenning, is a certified public account and Microsoft certified trainer, and has helped thousands of accountants use Excel more efficiently.  </p>", 
    "end_date": null, 
    "title": "Excel for Accountants: Volume 3", 
    "price": "50.00", 
    "instructors": "Jeff Lenning", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/219060_bb8b_7.jpg", 
    "course_url": "https://www.udemy.com/excel-for-accountants-volume-3/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-15T04:31:42Z"
}