{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Sie wollen oder müssen sich in Exchange Server 2013 einarbeiten - wissen aber noch nicht so genau, wie Sie das anstellen sollen? Vielleicht möchte ein Kunde Exchange einführen oder Ihr Projektthema dreht sich um eine Exchange-Organisation? Ein neuer Mitarbeiter soll schnell \"up to date\" gebracht werden?</p><p>Dann sind Sie hier genau richtig. In diesem Kurs zeige ich ihnen den Aufbau einer Exchange Infrastruktur - von Anfang an. Einfach, nachvollziehbar erklärt und permanent aus Sicht des Benutzers überprüft. Live. Echt. Und in Farbe.</p><p><strong>Was Sie erwartet</strong><br></p><p>Zunächst erlernen Sie, welche Software Sie für eine erfolgreiche <strong>Exchange Installation</strong> benötigen. Exchange Server ist kein \"Klick-Klick-Weiter\" Produkt. Wir laden die benötigte Software herunter und begeben uns dann in die Vorbereitung der Domäne. Hier erweitern wir das Schema und bereiten die Windows mit den entsprechenden Features für die Installation vor. Nach der erfolgreichen Installation gebe ich Ihnen einige Tipps zur Überpfüfung des Setups. Wir wollen ja schließlich nicht jetzt schon Fehler übersehen, die uns später stolpern lassen.</p><p>Jetzt ist es Zeit für die <strong>Grundeinrichtung</strong>. Hier machen wir den Exchange Server fit für die Kommunikation. Sie lernen, wie man Sende- und Empfangskonnektoren erstellt, Adressrichtlinien implementiert, die virtuellen Verzeichnisse korrekt einrichtet - und viele weitere Dinge. Einstellungen, die den Exchange unserem ersten Ziel näher bringen: Dem Mailversand zwischen LAN und WAN. Nach Abschluss der Konfiguration muss vieles zusammenarbeiten: Zertifikate, DNS, Konnektoren, die Firewall... aber das kennen Sie dann ja bereits alles. Abschließend führen wir einige Tests durch um uns auch den \"offiziellen Okay-Stempel\" für unsere Organisation zu holen.</p><p>Endlich kommen wir zum Punkt: Die <strong>tägliche Exchange Administration</strong>. Hier bekommen Sie das Rüstzeug um die täglichen Aufgaben in Ihrer Mail-Organisation zu bewältigen. Wir legen Postfächer an, ich zeige ihnen die verschiedenen Postfachtypen und die Verteilergruppen - aber auch OWA und öffentliche Ordner sind mit von der Partie. Zusätzlich lernen Sie die Einbindung von mobilen Geräten anhand eines Smartphones kennen. Von der Einbindung bis zum Rauswurf - wir testen es aus.</p><p>Abschließend gehen wir noch an die \"Exchange Innereien\". Hier demonstriere ich Ihnen einige <strong>Tasks</strong>, die Sie hoffentlich entweder nie benötigen oder die zumindest <strong>nicht alltäglich</strong> sind. Wir legen los mit dem Löschen, Deaktivieren und Wiederherstellen von Postfächern. Außerdem lernen Sie die Datenbank-Eigenschaften kennen. Wir besprechen die Wartungsfunktionen, das Offline Adressbuch (OAB) und Sie lernen die rollenbasierte Verwaltung (RBAC) so kennen, wie sie einst geplant war: Als superflexibles Modell zu Vergabe von Berechtigungen. Auch das Exchange Backup und die Wiederherstellung zeige ich Ihnen in diesem Abschnitt.</p><p>Ups, wir sind doch noch nicht am Ende. Backups sind gut und wichtig, aber: Eine zusätzliche <strong>Verfügbarkeit </strong>ist sehr beruhigend. Sie lernen im Kurs, welche Vorbereitungen Sie für eine Datenbankverfügbarkeitsgruppe (Database Availability Group DAG) treffen müssen, damit die Installation korrekt durchläuft. Im Anschluss konfigurieren wir die DAG fertig. Jetzt bleibt noch eins: Der Test. In einem Failover drücken wir den Kippschalter, wie in der Realität: Strom weg - Server aus. Jetzt beobachten wir den Failover auf dem Client und es stellt sich heraus, ob wir gut gearbeitet haben.</p><p><strong>Bonuskapitel</strong></p><p>Man <em>kann </em>Exchange Exchange Server ohne Kenntnisse der PowerShell betreiben - aber nur sehr eingeschränkt. Viele Funktionen sind <em>nur </em>mit der Shell durchzuführen - von der Automatisierung ganz abgesehen. Da ich immer wieder eine gewisse Hemmschwelle bezüglich der Kommandozeile in meinen Kursen erlebe, habe ich mich entschlossen, ein Bonuskapitel \"<strong>Schnellbesohlung: PowerShell / Exchange Management Shell</strong>\" zu erstellen. In diesem Abschnitt zeige ich Ihnen, was Sie wissen müssen um mit der PowerShell im Allgemeinen sowie der Exchange Verwaltungsshell im Speziellen voranzukommen. In diesem Abschnitt werden wir keine horrenden Automatisierungsszenarien entwerfen und auch keine seitenlangen Skripte schreiben sondern ich führe Sie Schritt für Schritt an die Shell heran, damit Sie den Rest des Kurses auch wirklich genießen können.</p><p>Ich freue mich auf Sie.<br></p>", 
    "end_date": null, 
    "title": "Exchange 2013 - Von der Installation bis in den Live-Betrieb", 
    "price": "50.00", 
    "instructors": "Michael Fritz", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617288_bdef_2.jpg", 
    "course_url": "https://www.udemy.com/exchange-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T15:29:07Z"
}