{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t This course covers the basic functions and features of Microsoft Office 365. Students will have a in-depth overview, learn how to setup and use email, contacts and calendars, and learn how to use the various apps included with Office 365 such as Outlook, Lync, Excel, Word, PowerPoint, OneNote and SkyDrive. This course is intended for an Office 365 End User.  </p>  <p>  \t <strong style=\"\">Total Video Time: 3h 19m</strong>  </p>  <p>  \t <strong style=\"\">Review Quizzes included for each Section, test your knowledge!</strong>  </p>  <p>  \t <strong style=\"\">Workbooks included for each Section, print out the course slides and take notes as you go!</strong>  </p>  <p>  \t <strong style=\"\">Course is broken up into 3 easy to understand Sections:</strong>  </p>  <p>  \t Office 365 Overview  </p>  <p>  \t Email, Contacts &amp; Calendar  </p>  <p>  \t Using the Office 365 Office Apps  </p>  <p>  \t <strong style=\"\">Your Trainer: Sandra Batakis</strong>  </p>  <p>  \t Sandra is a Senior Microsoft Certified Instructor with over 15 years in the IT certification training and courseware development field. She has offered a wide variety of IT training and high level consulting projects for Fortune 500 companies. She possesses extensive hands-on IT experience including working with building computer networking infrastructure, configuring LAN, WAN and Internet security gateways, Implementing and migrating to Microsoft Exchange 5, 2000, 2003, 2007 and the new Exchange 2010. She has delivered numerous Microsoft, CompTIA and Adobe classroom-based training as well as online Boot Camps and Seminars across the United States.  </p>", 
    "end_date": null, 
    "title": "Exploring Office 365", 
    "price": "25.00", 
    "instructors": "Career Academy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/106860_b725_5.jpg", 
    "course_url": "https://www.udemy.com/exploring-office-365/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-16T21:02:42Z"
}