{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t  Powerpoint is the gold standard for presenting and communicating in business today. For the most part these presentations are a pain to put together, never look as beautiful as you&#039;d like, and take up way more time than you&#039;d like to spend.  </p>  <ul style=\"\">  \t<li style=\"\">If you&#039;re a manager, it&#039;s stressful to train your team to produce presentations up to your standards and you probably don&#039;t have time to coach them all the way through. </li>  \t<li style=\"\">For presentation makers, it&#039;s a pain in the ass to keep iterating on the same deck over and over reacting to the whims of your superiors. It can feel like you&#039;re just spinning your wheels, spending tons of time making stupid adjustments to your deck. </li>  \t<li style=\"\">Or maybe you&#039;re a storyteller, an entrepreneur or someone who just wants more tools to communicate better visually.</li>  </ul>  <p style=\"\">  \t  Whoever you are, these are the five essential tips that I&#039;ve picked up in my career preparing and presenting power points to my teams, my bosses, executive clients, etc. And tips I&#039;ve passed on to my teams and colleagues who&#039;ve wanted to step up their presentation skills. No better way to learn than to do, so we&#039;re going to learn all five skills by making two killer pages:  </p>  <ol style=\"\">  \t<li style=\"\">A beautiful table of contents page</li>  \t<li style=\"\">A stunning quotes page</li>  </ol>  <p style=\"\">  \t  By making these pages, we&#039;ll learn the following skills:  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">Alignment and Distribution</strong>. How do we use powerpoint to quickly organize all our objects so they&#039;re all lined up and perfectly pleasing to the eye.</li>  \t<li style=\"\"><strong style=\"\">Using Shapes with Text</strong>. How can we easily add color and structure to our text and pictures by placing shapes behind it.</li>  \t<li style=\"\"><strong style=\"\">Managing your Colors</strong>. What&#039;s our strategy to get all of our perfectly aligned objects looking their best.</li>  \t<li style=\"\">Working With Pictures. Learning the many ways to get pictures into your presentations and how we can manipulate them once they&#039;re in there.</li>  \t<li style=\"\"><strong style=\"\">Using Text with Images. </strong>How can use text over and around images to bring them to life.</li>  \t<li style=\"\"><strong style=\"\">Bonus! </strong>A very very cool trick I&#039;ve learned just recently to make quotes come to life and look super well designed. You&#039;ll have to take the course to see the result.</li>  </ol>  <p style=\"\">  \t  I guarantee you&#039;ll learn something or your money back. I mean, you have that lifetime money back guarantee anyways so what are you waiting for?  </p>  <p style=\"\">  \t  The course should take you about an hour and is chock full of goodness.  </p>  <p style=\"\">  \t PS: this course is not meant to be comprehensive. The five skills are the first of many that I teach my students. For instance, making tables and charts are often &quot;essential&quot; for business, as well, but those topics are too large to cover in this snackable course. But if there&#039;s enough demand, we may cover it in its own course.  </p>", 
    "end_date": null, 
    "title": "Five Essential PowerPoint Skills For Business | PPT Hackers", 
    "price": "40.00", 
    "instructors": "Tony Sheng", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/95206_d227_5.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-21T05:33:18Z"
}