{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong>At any given time, there 60,000 Jobs in america alone asking for MICROSOFT ACCESS as an additional skill in your resume (Jobs only above $5000 Per Month). </strong>  </p>  <p>  \t<strong><em>All you need to do is spend 5+ hours of our course and you gain that knowledge which makes you eligible for those jobs. So Choice is Yours!!! </em></strong>  </p>  <p>  \t<strong><em><br>  \t</em></strong>  </p>  <p>  \t<strong>So what we want for you??</strong>  </p>  <p>  \t<em>      Our Main Objective is for you to become awesome in Microsoft Access 2013.  </em>  </p>  <p>  \t      Beginning with the fundamentals, our instructor will start with basic fundamentals of database and its functionality.  </p>  <p>  \tThen he will move towards basics explaining what is Microsoft Access and why do we need it?  </p>  <p>  \t      Then he will move on basics of Microsoft Access database, and how to use Microsoft Access with its various functionality.  </p>  <p>  \t      Then we will move towards basics and advanced version of tables. Post which there will major focus on practical commands which are required for you to become successful in Microsoft Access 2013.  </p>  <p>  \t      You will learn in form to How-to tutorials:  </p>  <ol>  \t<li>Straight to point topics - 5+ hours of Lectures</li>  \t<li>94 individual video lectures</li>  \t<li>Certificate of completion</li>  </ol>  <p>  \t<strong>Instructor would be available in discussion forum to answer your queries on the course material. So Enjoy!!!</strong>  </p>", 
    "end_date": null, 
    "title": "Get Ahead in Your Career-Learn Microsoft Access 2013", 
    "price": "20.00", 
    "instructors": "Gaurav Chauhan", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/243090_7779_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-access-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-14T06:36:38Z"
}