{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t     Welcome to Getting Started with Excel 2013 - a free series of Excel video tutorials for beginners. If you&#039;re new to Excel, I recommend watching watching this course. If you have already used Excel but want a comprehensive knowledge of the basics, then you&#039;re in the right place.  </p>  <p style=\"\">  \t     This is based on the original getting started with Excel course that I have been teaching in person in the UK banking industry since 2007. Now fully updated for Excel 2013, this course has been used by students all around the globe. But the best part is that all the accompanying workbooks are free!  </p>  <p style=\"\">  \t     So if you&#039;re looking how to get started with Excel quickly and easily, you&#039;re in the right place. Just because it&#039;s free doesn&#039;t mean that you get a cut-down down version of another course. Yes, we do have an advanced Excel course, but this Getting Started course teaches you all the essential Excel functionality so you can get your first spreadsheet built in record time.  </p>  <p style=\"\">  \t     Learning Excel is a bit like building a brick wall. Many beginners have a basic foundation - they understand the essentials of spreadsheets. Then they start piling on a few bricks here and there. But as their wall of knowledge is constructed, it&#039;s full of holes. Eventually they hit a point where their wall can&#039;t sustain any more weight and it collapses. What a waste of time!  </p>  <p style=\"\">  \t     This course takes a step-by-step approach to working with Excel. Each lesson builds upon the previous one, so your wall is solid. So whether you&#039;re looking to do your job better, or if you&#039;re looking to improve your resume, you are in the right place.  </p>  <p style=\"\">  \t     A comprehensive workbook with examples is included to save you time. You can also ask me any questions via the course discussion board.  </p>", 
    "end_date": null, 
    "title": "Getting Started with Excel 2013", 
    "price": 0, 
    "instructors": "Martyn Blythin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/270852_d980_3.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-excel-20132/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-29T09:17:15Z"
}