{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<em>\"Pivot Tables and Pivot Charts have helped me save loads of time when dealing with data in Excel and from other sources\" - a recent feedback from a student.</em></p>  <p>  \t  I believe that most part of what I learned came from real life experiences. Working in a professional services firm required an extensive use of MS Excel - lots of formulae, tons of tables, thousands of charts and the list goes on. On the bright side, all this load makes you figure your way out of lengthy and enormous tasks.  </p>  <p>  \t                This is where <strong>PIVOT TABLE &amp; PIVOT CHART</strong> came for help.  </p>  <p>  \t                Pivot tools in MS Excel assist us on handling big data, discovering hidden trends, and delivering amazingly professional presentations.  </p>  <p>  \t                I did my best to build this course following my own learning format. No Books, No formulas, No lengthy talks - <strong>JUST THE DOING!</strong>  </p>  <p>  \t                This course is designed to promote the strength of PIVOT tools in Excel and assist every student to quickly get into the DOING!  </p>  <p>  \t<strong><em>            No need to worry</em></strong> about the new tools, there are dozens of examples, a number of solutions to problems I faced myself - <strong>all of which are ATTACHED TO THE CURRICULUM in order to make the course as smooth as possible</strong>.  </p>  <p>  \t                Good luck!  </p>", 
    "end_date": null, 
    "title": "How to use EXCEL to your BENEFIT - PIVOT TABLES & CHARTS", 
    "price": "45.00", 
    "instructors": "Anar Heydarli, ACCA", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314124_9398_6.jpg", 
    "course_url": "https://www.udemy.com/save-your-time-with-pivot-tables-and-charts-in-ms-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-06T06:09:35Z"
}