{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t   Imagine that instead of learning about too many features of the software product you can learn it solving a specific business problem by doing a real world hands on solution. Like creating a project plan? That you can learn key features of Excel by watching how professionals use it.  </p>  <p>  \t   That is why we have created this course for you.  </p>  <p>  \t   I am excited to share with you not just the features and capabilities of the product but show what you can do with them. This way you can immediately apply what you learned and improve you career, life and anything where you can use Microsoft Excel and do planning.  </p>  <p>  \t   How is it useful? Imagine what  if you have a great idea for the new product and would like to secure the funding. Or you have a great marketing idea. Or you want to open up the business? Or plan family gathering? And you want to learn Microsoft Excel at the same time? What is the common between all these things? That is right - project plan.  With this course you can learn how to do it all. You can see how professionals do it and you can apply this knowledge to become a better person. You can plan the tasks, estimate the costs and do it all in Microsoft Excel. And when you done you can  take it to your boss or display it to your team or share with other decision makers to get them excited about your idea? And guess what – by doing it all you will learn Excel at the same time.  </p>  <p>  \t   And on top of that we teach you how project plan could be used in real life to help you in your day to day activities and interactions. I have two examples from the real life business project I was working on and I share with you key tasks and how to build them as part of this course.  </p>  <p>  \t   In this course we take you step by step on how to build a project Plan in Microsoft Excel. At the end of the class you would be able to build it from scratch or reuse and enhance the files we give you as part of the course, based on your business needs.  </p>  <p>  \t   Thanks for your trust in us. And if you like this course make sure to check us out at www.howtoanalyzedata.net.  </p>  <p>  \t<strong style=\"\">Topics Covered:</strong>  </p>  <ul style=\"\">  \t<li>What is the project plan</li>  \t<li>Why is it helpful to create project plan? Why would you do it in Microsoft Excel.</li>  \t<li>How can you benefit from the course</li>  \t<li>Create Project plans for below scenarios  \t<ul style=\"\">  \t\t<li><em style=\"\">1.0 Select new storage for the small business.</em>  \t\t<ul style=\"\">  \t\t\t<li>What is involved? How to estimate the costs? How to select the timeline and engage right resources to implement it?</li>  \t\t</ul>  \t\t</li>  \t\t<li><em style=\"\">2.0 Upgrade business computers to the newer models.</em><br style=\"\">  \t\t<ul style=\"\">  \t\t\t<li>What is involved? How to estimate the costs? How to select the timeline and engage right resources to implement it?</li>  \t\t</ul>  \t\t</li>  \t</ul>  \t</li>  \t<li>How to build a Project Plan using Microsoft Excel<br style=\"\">  \t<ul style=\"\">  \t\t<li>Step by step instructions</li>  \t\t<li>How to use created document</li>  \t</ul>  \t</li>  \t<li>Where to find additional examples</li>  </ul>  <p>  \t <strong style=\"\">Our Teaching Philosophy</strong>  </p>  <p>  \t <em style=\"\">Here’s a refreshing concept in computer online training : We actually care about your goals and focus on helping you reach them.</em>  </p>  <p>  \t    We create high quality IT training videos focusing on solving specific business challenges.  </p>  <p>  \t     Imagine the satisfaction of learning on how to solve specific business problem with factual information. Instead of focusing on features of the product we focus on what you can actually accomplish with the tool to solve your challenge. Our main goal is to  “Solve any business challenge with data and answer any business question with facts.” With our videos, you’re on the fast track to get your challenges solved and skill mastery on the topics where you need help.  </p>  <ul style=\"\">  \t<li>We know you’re looking to solve specific business problem. How about learning the tool not just by learning the features, but by building a real world document. Or creating a real world project plan.  That’s why our project-based video tutorials give you relevant skills to apply to real life case studies, projecting the experience of our experience educators. Each course is segmented into different chapters so you can learn sequentially or jump to topics of specific interest.</li>  \t<li>Our video experts are coaches Our experts show you HOW the software works using real-world project examples. In many cases, practical working files are included so you can work alongside the tutor. And we always give you free samples of created files, which you can customize to for your own needs</li>  \t<li>And we give you homework. You are expected to do specific assignments in the class to reinforce your learning. Because without it you lose most of the information you have reviewed. With our courses expect to master the skills you need to succeed Customers tell us they’re using their new skills immediately to confidently complete projects and delight colleagues and clients</li>  \t<li>For those of you who need immediate help we offer consulting services. Please contact us for details, if you have a problem to solve.</li>  </ul>  <p>  \t     We’re passionate about delivering the best, most affordable project-based computer software training videos, perfect for business professionals, consultants, knowledge workers, entrepreneurs, business owners, and others.  </p>  <p>  \t     Learn from broadcast-quality production methods and leading accredited authors, Our courses are really do rival classroom-based training courses, but at a fraction of the cost and on your own schedule.  </p>", 
    "end_date": null, 
    "title": "How to create a Project Plan using Microsoft Excel", 
    "price": "20.00", 
    "instructors": "Vadim  Mikhailenko", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/203358_b32e_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-project-plan-using-microsoft-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-22T18:15:28Z"
}