{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">From The Instructor,</strong><strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">This Excel course is strongly focused on Creating Excel Macro&#039;s and Button&#039;s, and some Excel Visual Basic so you can have more control over large amounts of data files. We go Step-by-Step, Line-by-Line so anyone with an interest in this is Guaranteed to learn how. This is NOT a surface level teaching of general Excel topics.</strong>  </p>  <p style=\"\">  \t          Have more control over large Excel data files with lots of Column&#039;s and Row&#039;s to get faster results with Sorting your data in several ways with less repetitious work.  </p>  <p style=\"\">  \t          If you have large Excel data files with lots of columns and rows to sort through, this will save you hours of back and forth searching. We go beyond basic Button and Macro creation, I show you how to customize them to your needs. Reusable for other data files, just cut-and-paste to replace, or add more data to existing files that automatically sorts itself, no more inserting copied rows.  </p>  <p style=\"\">  \t        You&#039;ll discover:  </p>  <ul style=\"\">  \t<li style=\"\">How to get a tab or comma delimited file into Excel</li>  \t<li style=\"\">How to adjust the size, location, and appearance of all your buttons <strong style=\"\">at one time.</strong></li>  \t<li style=\"\">How to use <strong style=\"\">Visual Basic</strong> to create professional looking reports.</li>  \t<li style=\"\">How to Record Macro&#039;s and associate the code to buttons.</li>  \t<li style=\"\">How to control <strong style=\"\">several levels</strong> of data within the Custom Sort box to get exactly the reports you&#039;re wanting.</li>  \t<li style=\"\">How to make the Buttons <strong style=\"\">multitask</strong> and save you time and effort.</li>  \t<li style=\"\">How to make Toggle Buttons to sort <strong style=\"\">A-Z</strong> and <strong style=\"\">Z-A</strong>.</li>  \t<li style=\"\">How to use a counter to track your data as it grows.</li>  \t<li style=\"\">How to add more data <strong style=\"\">without</strong> &#039;Inserting&#039; and let the Buttons <strong style=\"\">automatically</strong> sort the data for you.</li>  \t<li style=\"\">Make one file sort multiple ways so you&#039;ll have several files and reports in one.</li>  \t<li style=\"\">Learn a skill that can be carried over to other file needs.</li>  </ul>  <p style=\"\">  \t      Since the buttons are doing the work for you, error&#039;s become very rare, and your reports are regarded as more trusted.  </p>  <p style=\"\">  \t      Included in this course are Bonus Tips that grow the longer you stay with the course.  </p>", 
    "end_date": null, 
    "title": "How To Sort In Excel Large Data Files With Custom Buttons.", 
    "price": "35.00", 
    "instructors": "David Reynolds", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/353564_5edb_15.jpg", 
    "course_url": "https://www.udemy.com/sorting-large-data-files-with-excel-buttons-macros/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-22T05:06:12Z"
}