{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Excel is a key skill for virtually every office employee today, but because the software provides what seems like an infinite number of functions, it can become confusing.</p>    <p>If you struggle with Excel, know that you're not alone. Even though Excel is designed to make your life easier, 82% of users report that Excel causes them stress.</p>    <p>This course is for you if you:</p>    <ul><li>Struggle to find online tutorials that make using Excel formulas easy</li><li>Make mistakes in Excel and feel disappointed with the results</li><li>Become angry and frustrated because Excel actually reduces your productivity</li></ul><p><br><strong>Take The Best Seats In The House &amp; Discover How To Succeed At The Modern Workplace With Excel:</strong></p>    <ul><li>Work in Excel in a simple yet professional way</li><li>Create Excel spreadsheets that are clear and uncluttered</li><li>Make elaborate charts that even average workers will understand</li></ul><p><br><strong>Content &amp; Overview</strong></p>    <p>First, we’ll cover the foundations of Excel formatting and charting. You’ll discover the basics of cells, data and charting, which includes a comprehensive tutorial on how to build charts. </p>    <p>Next comes how to format cells and data the McKinsey way. I’ll explain 8 Excel cell formats with practical examples and how to effectively navigate large data sheets. Plus, you’ll learn how to never lose overview by using five uncommon shortcut functions. </p>    <p>Moreover, I’ll show you step-by-step how to build a chart the McKinsey way and combine stacked column charts with normal column charts to enable advanced data labeling techniques. </p>    <p>Last but not least, I included three bonus tutorials covering freeze panes vs. split windows, techniques to show key data only and drop down menus.<br> <br> By the time you complete this class, you’ll learn the renowned McKinsey way of formatting charts and tables, from basic to advanced.</p>    This training is 100%<strong> </strong>job-focused and contains only practical knowledge<strong> </strong>of Excel to format data and charts. In contrast to books and 36-hour Excel courses, you won't waste your time with 500 irrelevant Excel features that you'll never use. Instead, you can put these new skills to use right away!", 
    "end_date": null, 
    "title": "How To Dominate Excel Formatting & Charting", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Matthias Bellmann", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700978_ea74_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-dominate-excel-formatting-charting/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-18T19:23:30Z"
}