{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \tHave you ever sat through a presentation that seemed to slog on and on?  </p>  <p>  \tPresenters that are disorganized, dwell on trivial information and give long winded explanations that lead nowhere?  </p>  <p>  \tDon’t you wish that you could change channels or leave the room?  </p>  <p>  \tDon’t be one of those presenters  </p>  <p>  \tIf you’re reading this you probably wish that you could learn how to build killer PowerPoint and keynote decks that get people to buy your product – take action on a project – or persuade the audience to your viewpoint.  </p>  <p>  \tIf that’s why you’re watching then this is the course for you.  </p>  <p>  \tI’ve spent the last 15 years developing presentations that have received standing ovations and tens of thousands of views on Slideshare the next day.  </p>  <p>  \tI am going to teach you my tricks and I’ve asked 20 of the leading experts in the field to weigh in as well.  </p>  <p>  \tFor those of you in a rush and want to learn how to create a killer presentation in an hour – just skip to that course and watch me first hand create a powerful, presentation in one hour.  </p>  <p>  \tIt may not become a viral video on Slideshare, but it will give you a winning presentation when you don’t have 30-40 hours to spare.  </p>  <p>  \tBottom line – by taking this course you’ll create powerful presentations that will further every aspect of your career that involves persuading people to act offline and online.  </p>  <p>  \tBTW: As a bonus for participating, I am going to give you a presentation template that went viral on Slideshare and around the web. It’s an Angry Birds template that you can use royalty free. The value alone on this is $10,000 as I spent over 200 hours creating it.  </p>  <p>  \tSo are you ready? Let’s get started.  </p>", 
    "end_date": null, 
    "title": "How to Create World Class Powerpoint Presentations ", 
    "price": "50.00", 
    "instructors": "Mark Fidelman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/131192_e733_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-viral-powerpoint-presentations/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-09T05:57:24Z"
}