{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">Part of giving an effective presentation is using your presentation software properly. </p><p style=\"\"><em style=\"\">Visualize yourself using PowerPoint 2013 to give a GREAT presentation.</em></p><p style=\"\">When you have completed this course, you will be able to do just that! You will know how to properly use PowerPoint to enhance your presentation. You will recognize how to WOW your audience and not overwhelm them.</p><p style=\"\"><strong style=\"\">Why This Course Will Help You</strong></p><p style=\"\">This course is not only designed to teach you the basics of PowerPoint 2013; you will also discover tips and tricks to make your slides more audience-friendly. In less than an hour, you will learn to create a professional, effective, high-impact presentation.</p><p style=\"\">This course is broken down into <em style=\"\">short lessons </em>so that you are learning only <em style=\"\">one concept </em>at a time.</p><p style=\"\"><strong style=\"\">Learn to Create WOW-Worthy Slides</strong></p><p style=\"\">We will start right from the beginning. You will learn:</p> <ul style=\"\"><li style=\"\">How to create a PowerPoint from scratch</li><li style=\"\">How to add pictures and other effects to emphasize your main points</li><li style=\"\">Tips and tricks to make your presentation memorable</li></ul><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Contents and Overview</strong></p><p style=\"\">You will start off by learning how to create a slideshow and how to work with slides and content. You will learn how to add pictures and apply effects to make them stand out.</p><p style=\"\">You will learn how to add motion to your slides without going overboard.</p><p style=\"\">And you will know how to present your slideshow in a professional manner.</p><p style=\"\">Also included are tips and tricks to create a slideshow that your audience will remember.</p><p style=\"\"><strong style=\"\">Take Action Now!</strong></p><p style=\"\">Give us an hour ~ we will give you the skills!</p><p style=\"\">Enroll now by clicking on the <strong style=\"\">“Take This Course&quot;</strong> button above!</p>", 
    "end_date": null, 
    "title": "How to Create an Awesome PowerPoint Presentation", 
    "price": "20.00", 
    "instructors": "Michaele Downey", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493272_2e1c_2.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-2013-the-right-way-beginner/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-04T13:45:48Z"
}