{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>COURSE UPDATE</strong></p><ul><li><strong>Updated May 2015</strong></li><li><strong>Over 200 active students</strong></li><li><strong>Join the 1% of Excel users who know how to use the most powerful features and tools in Microsoft Excel</strong></li></ul><p><em>Great explanation ... Check!.  Course has a great flow to it ... Check!.  Lessons are presented clearly ... Check!.  Each lesson has just the right amount of information ... Check! - <em>Michael Choke</em></em></p><p><em><em>______________________________________________________________________</em></em></p>  <p><strong>About the course:</strong></p><p>This course is for all Excel users who wish to learn how to create <strong>powerful interactive dashboards using Pivot Charts and Pivot Tables</strong>.  This course will teach you to turn your Excel data into powerful tables, graphs and dashboards.</p><p> <strong>In this course you will learn to create three different dashboards.</strong></p>  <p>  \t            The first dashboard will focus on Sales information creating key metrics, trends, top 10 analysis and a percentage contribution.  </p>  <p>  \t      The second dashboard will focus on Human Resource data and display key metrics, number of employees by age, number of employees by years of service and gender profile.  </p>  <p>  \t      The third dashboard focuses on financial information and allows the user to understand the variance of the Profit from previous months and how much it has changed from month to month.  In addition techniques and tools such as sparklines, data bars, trendlines and slicers are also included.  </p>  <p>  \t            This course is very important for all Excel users who are required to develop management reporting or to perform data analysis and wish to gain insight and intelligence from their data.  </p>  <p>  \t            The course is designed to take you through step by step to create the interactive dashboards using simple drag and drop techniques.  This course does not include any custom programming or macros.  All the dashboards and techniques can be followed by any Excel user who understands the basic principles of Excel.  </p>  <p>  \t          An introductory knowledge of Pivot Tables and Pivot Charts will assist you in the course.  However you can follow the step by step instructions if you do not have an in-depth knowledge of Pivot Tables and Pivot Charts.  Please note that you will require Excel 2010 or 2013 for this course.  The course is presented using Excel 2013.  </p>", 
    "end_date": null, 
    "title": "Interactive Dashboards with Excel Pivot Tables & PivotCharts", 
    "price": "20.00", 
    "instructors": "Ian Littlejohn", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256488_fab2_5.jpg", 
    "course_url": "https://www.udemy.com/interactive-dashboards-with-excel-pivottables-pivotcharts/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-06T13:46:30Z"
}