{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Excel offers a valuable set of features that can be utilized to meet a wide range of data analysis and visualization needs, and we created an interactive and compelling course to help you rapidly develop these skills. </p><p><strong>By the \nend of this course, you will be able to make beautiful reports \nand interactive dashboards that best convey your data! </strong><br></p><p><em><strong>**We also have two MAJOR BONUSES for students who complete this course!**</strong></em></p><p>1. <strong>BONUS CONTENT</strong>: Students who complete this course will be automatically enrolled in our COMPLETE Excel for Data Visualization course on the TechChange platform, at no extra cost. You'll get an extra hour of course material and learn the following:</p><ul><li>Learn data visualization principles that are critical to making charts with a clear purpose and clean data.</li><li>Apply these principles to three example graphs with detailed step-by-step explanations. </li><li>Explore real-world case studies from the global health and political sectors that employ these techniques. </li><li>Put your Excel skills to the test with scenario exercises</li></ul><p>2. <strong>A FULL REFUND:</strong> Students who complete the course <em>and leave a course evaluation</em> on Udemy will receive a full refund from TechChange. This offer is only for a limited time, so sign-up today before it's gone! </p>", 
    "end_date": null, 
    "title": "Introduction to Excel for Data Visualization", 
    "price": "20.00", 
    "instructors": "TechChange The Institute for Technology and Social Change", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672864_ca06.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-excel-for-data-visualization/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T02:44:14Z"
}