{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t   Microsoft Office 2010 and SQL Server 2008 R2 bring the power of Microsoft&#039;s enterprise Business Intelligence (BI) tools to the vast Microsoft Office market.  If you are just starting to get a handle on Microsoft BI tools, this course provides you with the just the right amount of information to perform basic business analysis and reporting. You&#039;ll explore the components and related tools that comprise the Microsoft BI toolset as well as the new BI features of Office 2010. After a basic primer on BI and data modeling, the expert team of authors provides you with step-by-step lessons in the videos and ebook on how to use SQL Server Integration Services, SQL Server Analysis Services, SQL Server Reporting Services, Excel BI (including PowerPivot), and SharePoint. When you’re done, you’ll be able to create dashboards, visualizations, and reports to enhance your business’s understanding of your data. With more than 8 hours of video training arranged into more than 35 bite-sized lessons, this is the perfect way to get up to speed on Microsoft’s complete suite of BI tools.  </p>  <p>  \t   As a bonus, we’re including the complete ebook for a second ebook <em>Professional Microsoft SQL Server 2012 Integration Services</em>. With this crucial resource, you will explore how this newest release serves as a powerful tool for performing extraction, transformation, and load operations (ETL). A team of SQL Server experts deciphers this complex topic and provides detailed coverage of the new features of the 2012 product release. The authors present you with a new set of SISS best practices, based on years of real-world experience and it includes case studies and tutorial examples to illustrate advanced concepts and techniques. You’ll also want to have the free AdventureWorks and AdventureWorksDW databases installed. You can find the versions of these databases we used for <em>Professional Microsoft SQL Server 2012 Integration Service </em>on the Wrox website at http://www.wrox.com/go/SQLServer2012DataSets. Please note that we have removed the version number from the database names. If you already have a versioned database like the AdventureWorks2008R2 database though, this will work for the purposes of the demo.  </p>  <p>  \t Visit www.wrox.com and www.wiley.com  </p>", 
    "end_date": null, 
    "title": "Knight's Microsoft Business Intelligence 24-Hour Trainer   ", 
    "price": "50.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "39.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/70144_8dcb_10.jpg", 
    "course_url": "https://www.udemy.com/knights-microsoft-business-intelligence-24-hour-trainer/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-26T15:38:21Z"
}