{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><em>Do you want save up to 1 hour a day and <u>still</u> get the stuff done you are supposed to do so you can go home on time?</em></strong></p><p><strong><em>Are you constantly worried that you forgot to do something or even drop tasks?</em></strong></p><p><strong><em>Do you feel stressed by e-mails and that your mailbox have taken control of your life?</em></strong></p><p>A modern Time Management system should fit to you, the owner of the system, and your preferences!</p><p>A modern Time Management system should be able to accommodate different needs and taste!</p><p><span></span>A modern Time Management system should be possible to change to adapt to different job-types, job-changes, work needs, and demands!</p><p><span></span>A modern Time Management system should be a Work Management System!</p><p><span></span>A modern Time Management system should allow you to use it as a Decision Support System - making good decisions easier and faster!</p><p><strong><em>This course teaches you a methodology that delivers on <u>all</u> of the above requirements of a modern Time Management System - this course is professional Time Management made easy!</em></strong></p><p><strong>I reveal <em><u>never seen before</u> </em>ideas of how to use, customize, and automate Outlook in ways no one else have thought about!</strong></p><p>It is intended for <strong>Knowledge Workers</strong> and <strong>Managers</strong> in a company or a corporate setting, it is <u>not</u> for handling the family e-mail account! </p><p><strong>This course cuts to the bone by only focusing on the vital concepts, which have the most impact on your productivity. Only the techniques you need!</strong><br></p><p>First, you will learn the 6 Basic Principles that are critical for making you <u><strong>effective</strong></u>. Second,  you will learn about the 7 Decisions needed to customize your system to make it <u><strong>natural </strong><strong>and easy to us</strong><strong>e</strong></u>. Finally, you will learn about the 10 places for Automation as these will make you much more <u><strong>efficient</strong></u>.</p><p><strong><em>Take action NOW, preview 7 of the lectures (almost 40 minutes of content) for free! </em></strong></p><p><strong><em>If you like what you see, then enroll in this course <u>now</u> and become more productive at work tomorrow! This course could be the best investment you ever made in yourself!</em></strong></p>", 
    "end_date": null, 
    "title": "KnowledgeWorker Productivity Using Outlook 2010, 2013 & 2016", 
    "price": "30.00", 
    "instructors": "Lars Axelsen", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/138656_eb6e_10.jpg", 
    "course_url": "https://www.udemy.com/knowledgeworker-productivity-using-outlook-2010-or-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-27T20:14:12Z"
}