{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t <strong><em>“Upgrading your Microsoft Word skills is a smart move for </em></strong><strong><em>any New Hire or Office Veteran.”</em></strong>  </p>  <p>  \t With Microsoft’s powerful word processing software, Word 2013, you can do more than ever when it comes to creating high-end, professional quality documents. In this <em>Learn Word 2013</em> video training course, our expert instructor will walk you through the exciting new features of Word 2013. Throughout this 9-hour class, you’ll learn the most effective ways to create sophisticated documents along with valuable time saving tips.  </p>  <p>  \t Starting with the basics, you’ll discover the many new templates Word 2013 has to offer as well as new ways to work with media. You’ll learn to add pictures directly from the internet (without saving them on your computer!) in addition to inserting online videos and watching them inside Word. Next, you’ll see how easy it is to open and edit PDFs, and to align your graphics perfectly. Your instructor will also introduce you to the program’s features that make viewing documents more convenient such as read mode, resume reading, object zoom, and collapsible headings. Finally, you’ll learn how set-up your documents for collaboration using SkyDrive, Simple Markup, and the comments feature.  </p>  <p>  \t Whether you need to create compelling reports, persuasive sales letters, or polished proposals, our in-depth Word 2013 tutorials will give you the skills you need to make a good impression on any audience.  </p>  <p>  \t Plus, when you sign up for our class, you’ll also get these <strong>6 BONUSES</strong> <em>for a limited time </em>in addition to the 50+ online course videos:  </p>  <ol>  \t<li><strong>Downloadable &amp; printable keyboard shortcuts</strong> - to help you save time and get your work done faster.</li>  \t<li><strong>An online quiz (40 questions)</strong> - to test what you've learned.</li>  \t<li><strong>18 exercise files</strong> – to help you become proficient with the material.</li>  \t<li><strong>Downloadable &amp; printable transcripts (over 200 searchable pages)</strong> – to give you another learning option, if you prefer reading but don’t have time to take notes.</li>  \t<li><strong>9 hours of downloadable MP3s to play on your favorite audio device</strong> - to help you learn in the car, while you walk, or in the gym.</li>  \t<li>A certificate of completion to tell everyone you've aced the course.</li>  </ol>  <p>  \t Where else can you find so many extra tools to help you master Word 2013?  </p>  <p>  \t So start learning today. Because being a technology dinosaur isn’t going to get you a promotion or raise!</p><p>  \t All of our videos are high-definition videos, therefore, they are <strong>best viewed with the HD setting on</strong>, and the videos enlarged.  </p>", 
    "end_date": null, 
    "title": "Learn Microsoft Word 2013 the Easy Way - 9 Hours", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36431_726f_5.jpg", 
    "course_url": "https://www.udemy.com/microsoft-word-2013-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-16T16:14:24Z"
}