{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>**Special launch price for a limited time!**</p><p>The only course on Udemy to teach you chart animation in Excel with motion graphics. A picture is worth a thousand numbers. So a beautiful animated chart is worth a countless numbers in Excel!  If you ever wanted to animate charts in Excel, well your search ends here with this course. And this is a good time to take on this creative skill. This course covers all kinds of charts with awesome animations that will greatly enhance the user experience and make you a data visualization expert. With this skill, you know every employer would want you, as animation is THE thing that will make your dashboards, reports  a professional tool like feel. You would just be on top of visualizing data with functional, and meaningful animations.  It doesn't matter whether you are a complete novice or an Excel expert, this course is designed with step by step instructions and caters to all levels. You'll learn the following chart animations with the launch of this course.</p><p>1. Column/ Bar chart animation with motion graphics</p><p>2. Line chart animation with motion graphics</p><p>3. Pie chart animation with motion graphics</p><p>4. Dougnut chart animation with motion graphics</p><p>5. Histogram chart animation</p><p>6. Pareto chart animation</p><p>7. Speedometer animation</p><p>8. Thermometer animation</p><p>9. Easiest and many ways to make your chart interactive</p><p>10. Create beautiful custom charts with pattern fill and pictures</p><p>11. Learn the VBA basics to write animation codes from the scratch. No prior experience is required</p><p>But this is not all. This course will be continuously, frequently updated with a lot of new chart animations that are professional and interesting. Your investment with this course will be continuously benefiting with new videos. My main goal with this course is to make you an awesome creative data visualization expert. The tricks that you'll learn in the course will enable you to create your own professional animated charts. This course also comes with 30 days risk free money back guarantee frm Udemy, so you have all the reason to enroll in this course and upgrade your skill for a winning career.<br></p><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Learn Excel chart animation for effective data visualization", 
    "price": "20.00", 
    "instructors": "Kishon Deori", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587500_675d_2.jpg", 
    "course_url": "https://www.udemy.com/learn-excel-chart-animation-for-effective-data-visualization/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T15:57:52Z"
}