{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>If you walk through the finance or accounting department at any major corporate office, you will see computer screens filled with Excel spreadsheets financial results , graphs, budgets,forecast, and plans used to make big business decisions.</p>\n\n<p>Most users know that Excel can add, subtract, multiply, and divide, but it can do much more with advanced IF functions when coupled with VLOOKUP, INDEX-MATCH-MATCH, and pivot tables. <br></p>\n\n\n\n\n\n<p>So this course is exactly covering all the business needs which is helpful to find a good career as Excel Expert.</p>\n\n\n\n\n\n<p>In this course students will learn from scratch the work layout of the excel then gradually move forward to Advance Excel functions which are used to manipulate any kinds of numerical and other data. An accounting application will be created from scratch i.e chart of accounts to financial statements. All the report like trial balance , income statement and balance sheet will be created dynamical from general journal entries. Real business transactions will be also tested to guaranteed our application. This course will also cover payroll and payslips which is the need of any scale of business. </p>\n\n\n\n<p>A working knowledge of Excel is vital for most office based professionals today, and stronger Excel skills can open the door to promotion and leadership opportunities. Excel is a powerful tool. It takes a savvy computer user to take advantage of everything Excel has to offer to provide the best results for their company.</p>\n\n\n\n\n\n<p>In short if the students do the work side by side after completing this course they can called as Excel expert , Accountant and Excel base applications developer and seller. </p>\n\n\n\n\n\n<p>All the working files and complete application is also attached with this course in working files section.</p>\n\n\n\n\n\n<p>GOOD LUCK</p>", 
    "end_date": null, 
    "title": "Learn Advanced Excel & Responsive Accounting Application", 
    "price": "20.00", 
    "instructors": "Sajid Amin Mughal", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/824922_ce9a_3.jpg", 
    "course_url": "https://www.udemy.com/responsive-accounting-application-using-advance-ms-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-18T10:54:33Z"
}