{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Master Excel&#039;s Powerful Data Functions in this Information-Packed 9-hour Video Training.</strong></p><ul style=\"\"><li>Personal and Professional Financial Functions</li><li>Statistical Functions for Description, Prediction and Interference</li><li>Connecting to External Data</li><li>Tables, Charts and Pivots</li><li>Data Analysis</li></ul><p><strong style=\"\">The Versatility of Excel</strong></p><p>If you have already been using Microsoft Excel then you know that the calculation, graphing and tables available help you track, manipulate and report important data. There is more to excel than a few SUMs, though, and this is the training course to get you into the advanced uses of Excel so you can really use the data and numbers you are tracking to your advantage. </p><p>This course is designed for students that are already familiar with Excel, but wish to improve their skills and open the possibilities with this versatile spreadsheet program. Bring your basic knowledge of Excel 2013 or previous software versions to this class and learn how to reach the next level of database tracking and reporting.</p><p><strong style=\"\">Contents and Overview</strong></p><p>Through 52 lectures and over 12.5 hours of content, this course will take you through learning how to use functions in everyday work environments. Personal and professional financial functions are covered including payments, future value and depreciations. Students will learn statistical functions like averages, percentiles, and regression.</p><p>In order to improve efficiency, students will also cover concepts for connecting to external data like other workbooks or web data; tables including style, selection and sizing. Pivot tables and data analysis will be key concepts helpful to the work environment.</p><p>For help with reporting, students will learn surface charts, stock charts, radar charts and bubble charts and graphs. Lastly, students will cover important web applications.</p><p>Upon completion of this course, students will be able to create colorful charts and databases that communicate data and financial records efficiently and effectively. Students will be able to apply data to various reporting forms like tables, graphs and pivot tables in order to show important analysis like depreciation, percentiles and regression for use with strategizing and planning. Students who finish this course will have an advanced knowledge of the versatility of Excel that is immediately applicable to their work with the database. </p>", 
    "end_date": null, 
    "title": "Learn Microsoft Excel 2013 - Advanced", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/56660_5635_3.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-excel-2013-advanced-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-27T15:11:47Z"
}