{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>&gt;&gt; Special Price ONLY - Increasing To $97 Soon\n&lt;&lt;</strong></p>\n\n<p><strong>&gt;&gt; Updated for June 2016 &lt;&lt;</strong><br></p>\n\n\n\n\n\n\n\n<p><strong>How great would it be if you could learn Microsoft Excel in just 1 hour? Well that is now possible. You will be transformed from a beginner to an expert in Excel in just 1 hour, following 4 easy and simple steps.</strong></p>\n\n\n\n\n\n\n\n<p><strong>Why should you take this course?</strong></p>\n\n\n\n\n\n\n\n<blockquote><em>\"The course was delivered superbly and met my expectations. I wasn't too sure at first if this course was worth taking, but boy I'm very happy I made the decision to go with it. Fantastic course.\"</em> <strong>- Callum Davids (student)</strong></blockquote>\n\n\n\n\n\n\n\n<p>We Have trained <strong>1000s of beginners</strong> Excel, where they have immediately been able to apply what they have learnt within this course.</p>\n\n\n\n\n\n\n\n<p>Here we welcome you to the <strong>Learn Microsoft Excel 2016 in 1 hour </strong>course, where you will learn how to use Excel in real life scenarios based on a variety of case studies.</p>\n\n\n\n\n\n\n\n<blockquote><em>\"I wanted a course that gets straight to point and I got it. The instructor's delivery is very good and provides good explanations on how different parts of excel work. Didn't think I could get through so much in just 1 hour. Nice and concise course.\"</em><strong> - Emma Morgan (student)</strong></blockquote>\n\n\n\n\n\n\n\n<p><strong>Guarantee: By the end of this course you will be able to use Excel in real life scenarios within just 1 hour.</strong></p>\n\n\n\n\n\n\n\n<p>Excel can be used for…  </p>\n\n\n\n\n\n\n\n<ul> <li>Scheduling</li> <li>Pay roll systems</li> <li>Weekly planners</li> <li>Invoices</li> <li>Bookkeeping</li> <li>Budget keeping</li> <li>Sorting and listing data</li> <li>Employee and customer data</li> <li>Almost anything that uses and requires data</li> </ul>\n\n\n\n\n\n\n\n<p>And the best part is you can even use it at…</p>\n\n\n\n\n\n\n\n<ul> <li>Work</li> <li>Home</li> <li>An educational establishment</li> <li>Or just for fun - the possibilities are unlimited!</li></ul>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>In our <strong>Learn Microsoft Excel 2016 in 1 Hour</strong> course we will give you the<strong> blueprint</strong> for getting the most out of Excel. Even if you are completely new to Excel the <strong>simple</strong> <strong>step by step </strong>video tutorials, instructions and material will give you thorough guidance - everything you need in just <strong>4 easy steps.</strong></p>\n\n\n\n\n\n\n\n<p>No more feeling stressed and overwhelmed, as our fully accredited Microsoft certified instructors will provide all the answers to how Excel operates; we will focus on…</p>\n\n\n\n\n\n\n\n<ul> <li>Creating spreadsheets which will turn you into an <strong>Excel expert in less than 1 hour</strong></li> <li>Applying Excel to <strong>real life</strong> situations to enhance your results in your working environment</li> <li>Implementing the <strong>correct</strong> <strong>tools that will skyrocket your productivity by at least 33%</strong></li></ul>\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n<p><strong>Plus you will receive 1 additional Bonus for enrolling…</strong></p>\n\n\n\n\n\n\n\n<p><strong>Bonus: The 4 Step Excel 2016 Functions Guide - </strong>makes using functions and formulas easy and simple.</p>\n\n\n\n\n\n\n\n<p><strong>The 30 Day Money Back Guarantee</strong></p>\n\n\n\n\n\n\n\n<p>As always, we offer our 30 day money back guarantee. Providing value is of the utmost importance to us and if you are not receiving the results you desire then we will ensure to refund you for the course. </p>\n\n\n\n\n\n\n\n<p><strong>Special Introductory Price - Rising Soon</strong></p>\n\n\n\n\n\n\n\n<p>Normally we usually charge $397, $697 and $997 for our Excel courses, but we will keep this special introductory price before increasing it, just for the Udemy community.</p>\n\n\n\n\n\n\n\n<p><strong>Enroll and Take Action</strong></p>\n\n\n\n\n\n\n\n<p>Join now and make the commitment of going through our course. It is sure to enhance your skills and level of knowledge with Excel.</p>\n\n\n\n\n\n\n\n<p>We look forward to seeing you in the course and remember to check out our previews.</p>\n\n\n\n\n\n\n\n<p>See you then</p>\n\n\n\n\n\n\n\n<p>How To Technology</p>", 
    "end_date": null, 
    "title": "Learn Microsoft Excel 2016 in 1 Hour", 
    "price": "40.00", 
    "instructors": "How To Technology", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546958_2d9c.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-excel-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T17:33:15Z"
}