{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p> Microsoft PowerPoint 2010. Basically this course create for those people who don't know anything about PowerPoint. It is for beginners. In this course you will learn every basic things that you need. I will teach you everything step by step with easy methods. You can do more than ever when it comes to creating expertly designed slideshows. In this PowerPoint Training: How to Use PowerPoint 2010. You’ll learn the most effective ways to create polished presentations along with valuable shortcuts and tips for saving time.<br>Starting with the basics, you’ll discover how to work with the colorful new PowerPoint 2010 templates and to design your own backgrounds from scratch. Then you’ll learn to add images, Animations ,Transitions ,formatting , opening and closing the program , font size , redo and undo and many more things . As you then learn to merge shapes, maximize and minimize the program , zoom in and zoom out . Finally, you’ll see how to take your presentations.<br>Don’t let technical difficulties get in your way. Prepare for every meeting by learning to size presentations in standard and wide screen layouts.<br>From 10 minute slideshows to lengthy presentations, this PowerPoint 2010 training course will give you the tools you need to share your story effectively.<br>Even if you’ve been making presentations for years, Your presentations will look better than ever!</p>", 
    "end_date": null, 
    "title": "Learn Microsoft PowerPoint 2010 Beginning to Advance (Urdu)", 
    "price": 0, 
    "instructors": "Alia Mubashir", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833332_389f_3.jpg", 
    "course_url": "https://www.udemy.com/learn-free-microsoft-powerpoint/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T10:36:09Z"
}