{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">This class will change the way you are working with Excel and makes you an expert in solving various problems in just a few minutes.</strong>  </p>  <p style=\"\">  \t  This course provides the information, tips and tricks that will help you save precious time working with all kind of database. Are you tired of copy from side to side? Use formulas and your data will be updated instantly. All you have to do is to write the formula, in only 1 minute. You will stop waste time with the calculation of dates, sums, bonuses, poundage and other.  </p>  <p style=\"\">  \t  Do you have Excel database with unformatted data, atypical writing format, commas, too many spaces or other symbols?  </p>  <p style=\"\">  \t  Do you have a lot of information that needs synthesizing but first your data has to be in the same format or you need to import an Excel database into a program and these require a specific format?  </p>  <p style=\"\">  \t  By learning the lessons from this course you will use formulas, the tips and tricks for an easy to manage database and finish your project in a few minutes. If you have periodical reports with the same format, from now on all you have to do is to copy the new base over a head table and you will have the information updated. You will learn tricks for copying information, mechanisms to have the same formulas in different sheets and will have the knowledge that helps you clean the database.  </p>  <p style=\"\">  \t  You have a lot of working files to practice all that you learn.  </p>", 
    "end_date": null, 
    "title": "Learn Excel for reporting in 2 hours", 
    "price": "30.00", 
    "instructors": "Andries Crina", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368370_739a_4.jpg", 
    "course_url": "https://www.udemy.com/excel-formulas-tips-and-tricks-to-solve-projects-in-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T21:15:26Z"
}