{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Learn all you need to to create your own eBooks that you can sell on for close to 100% profit - and all you need for this is Microsoft Word</strong><strong>. </strong>Any version will work for this as the overall principals are the same.</p><p>Once you know how to create your own digital eBooks, the possibilities become endless. You can then create your own products that no one else can replicate.</p><p><strong>Over 800 students have already jumped on this course and are already making good use of the knowledge!</strong></p><p>eBooks and selling digital information in general is hot right now. people love buying digital products and enjoy the instant gratification that the ability to download their ebook gives them.</p>  <p>  \t    You could publish your own profit pulling eBook to the popular Amazon Kindle marketplace, write a successful eBook for the Click Bank or JV Zoo digital info selling platforms - or even create a eBook that you can give away for free on your website in order to capture peoples email addresses.  </p>  <p>  \t    This course will take you through how to write your own eBook in Microsoft Word and then successfully convert your word document into an industry recognised Adobe PDF format.  </p>  <p>  \t    It is much easier than you think, and is the kind of knowledge that you can always make use of.  </p>  <p>  \tWhat you will learn on this course:  </p>  <ul>  \t<li>How to create a professional cover page for your eBook in MS Word</li>  \t<li>Inserting an automatically updating table of contents</li>  \t<li>Adding content and formatting correctly</li>  \t<li>Converting from a word document into an Adobe PDF</li>  </ul>  <p>  \tThe course is direct and too the point as we don't believe in adding fluff content just to artificially increase the length!  </p>  <p>  \tIt's going to be fun. See you on the inside!  </p>", 
    "end_date": null, 
    "title": "Learn to Create your own Adobe PDF eBook in Microsoft Word", 
    "price": "20.00", 
    "instructors": "LearnCadia - Learning Unlimited!", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418468_7bd5_2.jpg", 
    "course_url": "https://www.udemy.com/create-your-own-pdf-ebook-with-microsoft-word/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T17:27:20Z"
}