{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t  Impress your colleagues and wow your boss by developing your spreadsheet skills with our Microsoft Excel 2010 Beginners course. Microsoft Excel 2010 is still one of the most popular and widespread editions of Microsoft&rsquo;s famous spreadsheet program, but it can seem very overwhelming to the novice getting to grips with the software.  </p>  <p style=\"\">  \t  In this 7 hour Microsoft Excel 2010 Beginners course, you&rsquo;ll go from shunning sums to cheerily calculating, and by the end of the course you&rsquo;ll be comfortable with every aspect of the layout and basic functionality of Microsoft Excel 2010.  </p>  <p style=\"\">  \t  Our professional instructor will talk you through Excel 2010&rsquo;s features, starting with the basics, from creating files to editing existing documents.  You&rsquo;ll start with creating a new workbook and entering text and numbers, moving onto saving and printing your documents, and working with larger and more complex workbooks. Next you&rsquo;ll move onto moving and managing data across rows and columns, as well as different sheets, in addition to introducing your first formulas. Formatting workbooks comes next, in addition to adding attractive charts and graphs to display your work. You&rsquo;ll then move onto sorting and filtering data, linking multiple files, and, finally, working with some more advanced formulas.  </p>  <p style=\"\">  \t  With this informative course, you&rsquo;ll learn the skills you need to make an impact with attractive, functional spreadsheets that help you do your job better.  </p>  <p style=\"\">  \t  Plus, when you sign up for our class, you&rsquo;ll also get these <strong style=\"\">3 BONUSES:</strong>  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">Downloadable &amp; printable keyboard shortcuts</strong> - to help you save time and get your work done faster.</li>  \t<li style=\"\"><strong style=\"\">An online quiz (40 questions)</strong> - to test what you&#039;ve learned.</li>  \t<li style=\"\"><strong style=\"\">A certificate of completion</strong> - to tell everyone you&#039;ve aced the course.</li>  </ol>  <p style=\"\">  \t  What people are saying:<strong style=\"\"><br style=\"\">  \t <br style=\"\">  \t   &quot;<em style=\"\">Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.</em>&quot;<br style=\"\">  \t   - TopTenReviews.com</strong>  </p>  <p style=\"\">  \t  Note: All videos are high-definition and are therefore <strong style=\"\">best viewed enlarged and with the HD setting on</strong>.  </p>", 
    "end_date": null, 
    "title": "Learn Microsoft Excel 2010 the Easy Way", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101082_56f2_5.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2010-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-03T17:05:28Z"
}