{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">Want to create  print-ready documents that look like they were done by a graphic designer?</p><p style=\"\">You can! </p><p style=\"\">Event invitations,  holiday cards, brochures, and flyers are all a snap when you discover the  tricks of high-end desktop publishing in our <em style=\"\">Learn Microsoft Publisher 2013</em> course. In this 6.25-hour video  training course, you’ll get the tools you need to add your unique touch of  creativity to any kind of document.</p><p style=\"\">To kick things off,  your expert instructor will help you explore the Publisher interface and get  comfortable with navigating your way around it. Next, you’ll discover how to delete  and add pages, and how to move pages around when you want to change your  document’s order. Videos on paragraph formatting, working with columns, and  using fonts will then teach you to make an impact with your text. You’ll learn  to do this with images, too, as you learn techniques for adding cool effects—textures,  gradients, shadows, and more—to your visuals.</p><p style=\"\">        </p><p style=\"\">By the time the class  is done, you’ll have mastered the process of preparing your Publisher project  for professional printing or for publication on the internet.</p><p style=\"\"><strong style=\"\"><strong style=\"\">What people are saying:<br style=\"\"><br style=\"\">&quot;<em style=\"\">Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.</em>&quot;<br style=\"\">- TopTenReviews.com</strong></strong></p>  ", 
    "end_date": null, 
    "title": "Learn Microsoft Publisher 2013 Training", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63511_f79a_3.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-publisher-2013-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-02T22:20:36Z"
}