{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \tWith the newest version of Microsoft’s presentation software, PowerPoint 2013, you can do more than ever when it comes to creating expertly designed slideshows. In this PowerPoint Training: How to Use PowerPoint 2013 course, our professional instructor will walk you through the exciting new features of PowerPoint 2013. Throughout this 9-hour class, you’ll learn the most effective ways to create polished presentations along with valuable shortcuts and tips for saving time.  </p>\n\n<p>  \tStarting with the basics, you’ll discover how to work with the colorful new PowerPoint 2013 templates and to design your own backgrounds from scratch. Then, you’ll learn to add images, hyperlinks, audio, and video for engaging slides and attention-grabbing animations. As you then learn to merge shapes, maximize smart guides, and use motion paths, you’ll master custom icon creation and accurately aligned graphics. Finally, you’ll see how to take your presentations to the cloud as you learn to save your work online and to publish to the SkyDrive.  </p>\n\n\n\n\n\n\n\n<p>  \tDon’t let technical difficulties get in your way. Prepare for every meeting by learning to size presentations in standard and wide screen layouts, and to run them on the web or via smartphones.  </p>\n\n\n\n\n\n\n\n<p>  \tFrom 10 minute slideshows to lengthy presentations, this PowerPoint 2013 training course will give you the tools you need to share your story effectively.  </p>\n\n\n\n\n\n\n\n<p>  \tEven if you’ve been making presentations for years, our tutorials will give you the inside scoop on new PowerPoint 2013 features that will take your work up another notch. Your presentations will look better than ever!  </p>\n\n\n\n\n\n\n\n<p>  \tPlus, when you sign up for our class, you’ll also get these <strong class=\"redactor-inline-converted\">6</strong><strong class=\"redactor-inline-converted\"> BONUSES</strong> in addition to the 40+ online course videos:  </p>\n\n\n\n\n\n\n\n<ol>  \t<li><strong class=\"redactor-inline-converted\">Downloadable &amp; printable keyboard shortcuts</strong> - to help you save time and get your work done faster.</li>  \t<li><strong class=\"redactor-inline-converted\">An online quiz (40 questions)</strong> - to test what you've learned.</li>  \t<li><strong class=\"redactor-inline-converted\">Exercise files</strong> – to help you become proficient with the material.</li>  \t<li><strong class=\"redactor-inline-converted\">Downloadable &amp; printable transcripts </strong>– to give you another learning option, if you prefer reading but don’t have time to take notes.</li>  \t<li><strong class=\"redactor-inline-converted\">Downloadable MP3s to play on your favorite audio device</strong> - to help you learn in the car, while you walk, or in the gym.</li>  \t<li>A certificate of completion to tell everyone you've aced the course.</li>  </ol>\n\n\n\n\n\n\n\n\n\n<p>  \tTake this ultimate PowerPoint Training course right now and learn how to use PowerPoint 2013.  </p>", 
    "end_date": null, 
    "title": "Learn Microsoft PowerPoint 2013 the Easy Way - 9 Hours", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/39952_a8f5_3.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-powerpoint-2013-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-04T16:19:59Z"
}