{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>\r\n\t<strong>EXCEL vállalati környezetben!</strong>\r\n</p>\r\n<p>\r\n\t  Ez más valamiben? Én már évek óta használom az Excelt, szerintem jól megy! Van ECDL vizsgám, az nem elég?\r\n</p>\r\n<p>\r\n\t  Miben más az Excel program használata vállalati környezetben, miért nem készít fel egy általános tanfolyam erre?\r\n</p>\r\n<p>\r\n\t<strong>„A háborút fegyverekkel vívják, de emberek nyerik meg.&quot; /Patton tábornok/</strong>\r\n</p>\r\n<p>\r\n\tA vállalati eszközök „fegyvertárát&quot; a világ legdinamikusabban növekvő vállalatai készítik: Microsoft, Adobe, Oracle, SAP, Google, stb. Azonban a legjobb eszköz sem lesz önmagában hatékony, csak ha képzett „harcosok&quot; forgatják.\r\n</p>\r\n<p>\r\n\tA vállalatirányítási rendszereknél egyértelmű, hogy van egy bevezetési szakasz, ahol mind a folyamatokat, mind a munkatársak tudását igyekeznek a rendszer követelményeihez igazítani.\r\n</p>\r\n<p>\r\n\tUgyanezt nem teszik meg az Office programokkal (Word, Excel, Outlook, PowerPoint), pedig az irodai dolgozók sokszor a munkaidejüknek akár 50%-át ezeknek a programoknak a használata teszik ki\r\n</p>\r\n<p>\r\n\t<strong>Az informatika oktatás nem a SZOFTVERRŐL szól, hanem az IDŐRŐL, amelyet a tudatos használattal megtakaríthatunk!</strong>\r\n</p>\r\n<p>\r\n\t   A kurzus végére a hallgatók átlátják az Excel programot és a megfelelő eszközt tudják társítani a munkájukhoz. A tanfolyam segítségével az adott feladatra fordított idő akár 30-50%-al lerövidül!\r\n</p>\r\n<p>\r\n\tJó tanulást és sok fejlődést!\r\n</p>\r\n<p>\r\n\tEducateYourPartners csapata\r\n</p>", 
    "end_date": null, 
    "title": "Learn Excel in Hungarian", 
    "price": "20.00", 
    "instructors": "Educate Your Partners, Péterfi Pál Balázs", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119728_b92a_5.jpg", 
    "course_url": "https://www.udemy.com/learn-excel-in-hungarian/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-14T10:13:15Z"
}