{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "Become proficient in Microsoft PowerPoint 2010 as the  experts at ClipTraining take you through a comprehensive video journey.&nbsp; Starting with the Home Ribbon, Tables,  Graphics and SmartArt; then moving onto Audio, Video and Screenshots. Your  excursion doesn’t end there, continue&nbsp;  learning with a vast numbers of videos on the Design Ribbon, Slide Show  Ribbon, Transitions and Animation Ribbon; and Review and View Ribbon.<br style=\"\"><br style=\"\">     <p>With more than <strong style=\"\">75  video clips</strong> and <strong style=\"\">over 2 hours</strong> of  focused video training. Our methodology is concentrated content without all the  added fluff you see in other training courses. Meaning, we teach you what you  need to know in the minimal time it takes to learn it. We understand that you  don’t have time to waste on unneeded content. This is why ClipTraining is  relied upon by the Fortune 100 and K-12 schools everywhere. </p>    <p>Whether you’re planning a presentation for personal use, a  school project or for professional business; ClipTraining has the content you  need presented in a step-by-step easy to understand tutorial from a Microsoft  PowerPoint Expert.&nbsp; </p>    <p>Along with the task-based, to-the-point videos, you’ll  receive an excellent downloadable ‘ClipStart’ PDF with helpful tips to get you  started. </p>    <p>Don’t wait any longer; take this course to learn all about  making PowerPoint slideshow presentations. Before you know it you’ll be on your  way becoming a Microsoft Office pro. </p>    ", 
    "end_date": null, 
    "title": "Learn Microsoft PowerPoint 2010", 
    "price": "20.00", 
    "instructors": "ClipTraining LLC", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46305_b135_6.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-powerpoint-2010/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-18T14:57:27Z"
}