{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \tBeing a data rock star is more important than ever. That’s because to stand out in the workplace, you’ve got to be able to find information fast and to identify game-changing insights.  </p>  <p style=\"\">  \tDuring our <em style=\"\">Learn Microsoft Access 2013</em> course, you’ll explore how to do this and more. In this 10-hour class, you’ll become a data management guru as you learn to capture and synthesize information with custom web apps and desktop databases. Whether you’ve been using Access your entire career or database technology is new to you, this Microsoft Access 2013 Tutorial will give you an advanced understanding of the many Access 2013 features that will enable you to gather and interpret data faster than everyone else.  </p>  <p style=\"\">  \tStarting with the basics, our certified instructor will teach you to add and delete records to your database. Then, learn to create desktop databases and apps for multiple users before diving into importing data from other sources. Build forms to capture information online. Implement pre-designed templates that track project, employee, issue, or task details. Protect databases with permissions. Run reports that provide valuable business intelligence. And walk away with a solid grasp of how tie it all together with this Microsoft Access Training.  </p>  <p style=\"\">  \tPlus, when you sign up for our class, you’ll also get these <strong style=\"\">4</strong><strong style=\"\"> BONUSES </strong>in addition to the 40+ online course videos:  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">An online quiz (40 questions)</strong> - to test what you&#039;ve learned.</li>  \t<li style=\"\"><strong style=\"\">Exercise files</strong> – to help you become proficient with the material.</li>  \t<li style=\"\"><strong style=\"\">Downloadable &amp; printable keyboard shortcuts</strong> - to help you save time and get your work done faster.</li>  \t<li style=\"\">A certificate of completion to tell everyone you&#039;ve aced the course.</li>  </ol>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\">What people are saying:<strong style=\"\"><br style=\"\">  \t<br style=\"\">  \t&quot;<em style=\"\">Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.</em>&quot;<br style=\"\">  \t- TopTenReviews.com</strong></strong></strong>  </p>", 
    "end_date": null, 
    "title": "Learn Microsoft Access 2013 the Easy Way - 10 Hours", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/43677_2db0_5.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-access-2013-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-26T14:29:16Z"
}