{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \tIdeal for those seeking to enhance their Excel 2010 knowledge, the <strong style=\"\"><em style=\"\">Learn Excel 2010 – Advanced </em></strong>by Simon Sez IT is a 7-hour training course covering advanced level Excel topics.  </p>  <p style=\"\">  \tMicrosoft has added very powerful tools to Excel over previous versions.  Understanding these tools will save you time and energy combing through information.  Learn how to create eye-catching charts and graphs (formatting axes and gridlines, showing basic trends, complex trends, even trends over time).  Learn the differences between the various types of charts, relationships in data, and ways to show differences.  </p>  <p style=\"\">  \tDiscover methods to make your exceptions stand out so you can attack the anomalies and use the data to make your operations better.  Excel’s tools are covered in depth which includes discussions on and are setting up live charts, Sparklines, color scales, and icon sets.  Your data will become alive as you identify key action items and understand the meaning behind the numbers.  Learn how to use Pivot Tables combined with Pivot Charts in powerful ways.  You can move columns and rows to understand how the numbers relate more easily than ever before.  </p>  <p style=\"\">  \tFinally, once you have analyzed the data you will need to share it; ascertain the method for exporting charts and graphs for the best presentation.  </p>  <p style=\"\">  \tPlus, when you sign up for our class, you’ll also get these <strong style=\"\">5 BONUSES</strong> in addition to the 30 online course videos:  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">Downloadable &amp; printable keyboard shortcuts</strong> - to help you save time and get your work done faster.</li>  \t<li style=\"\"><strong style=\"\">An online quiz (35 questions)</strong> - to test what you&#039;ve learned.</li>  \t<li style=\"\"><strong style=\"\">Downloadable &amp; printable transcripts (over 120 searchable pages)</strong> – to give you another learning option, if you prefer reading but don’t have time to take notes.</li>  \t<li style=\"\"><strong style=\"\">7 hours of downloadable MP3s to play on your favorite audio device</strong> - to help you learn in the car, while you walk, or in the gym.</li>  \t<li style=\"\">A certificate of completion to tell everyone you&#039;ve aced the course.</li>  </ol>  <p style=\"\">  \tWhere else can you find so many extra tools to help you master Excel 2010?!?!  </p>  <p style=\"\">  \tSo start learning today. Because being a technology dinosaur isn’t going to get you a promotion or raise!  </p>  <p style=\"\">  \tAll of our videos are high-definition videos, therefore, they are <strong style=\"\">best viewed with the HD setting on</strong>, and the videos enlarged.  </p>", 
    "end_date": null, 
    "title": "Learn Microsoft Excel 2010 Advanced Course", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29647_8b7e_3.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-excel-2010-advanced-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-14T18:45:34Z"
}