{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t     The contents of this course were gleaned from top professionals that construct and teach PowerPoint for a living, as do I.  Their vast knowledge of what KEEPS THE VIEWER ENGAGED and their tips and tricks are shared here.  Though content will always be King, the visuals that go with that content should strive to not be boring and attempt to show the viewer something they may not have seen before.  Though PowerPoint has nearly 2000 features, most professionals swear by the axiom to KEEP IT SIMPLE and use only about 20 or so.  </p>  <p style=\"\">  \t     By utilizing screen-shots and click-able templates, in less than an hour and fifty minutes, the student should have many more tools to use daily with PowerPoint.  </p>  <p style=\"\">  \t     The course starts with subtle techniques towards the art of an effective presentation.  It then moves to sound effects and narration necessary for a great video and ends to more elaborate animations and then resources.  </p>  <p style=\"\">  \t     The student should take his or her PowerPoint skills to the next level and to not be condemned to being the presenter that everyone wishes they were somewhere else.  </p>  <p style=\"\">  \t     The audiences of the students that take this course should leave their presentations thinking, &quot;That was great!&quot;  They don&#039;t need to know why....just that it was great!  </p>", 
    "end_date": null, 
    "title": "Learn the Tips & Tricks of the Pros for PowerPoint (10/13)", 
    "price": "35.00", 
    "instructors": "AFG Academy, MICHAEL HICKEY", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/221436_8067_6.jpg", 
    "course_url": "https://www.udemy.com/learn-the-tips-tricks-of-the-pros-for-powerpoint-1013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-17T16:49:12Z"
}