{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><p>Stop with the  disorganized e-mails when trying to work on a team project and learn how to use SharePoint  2010 to  collaborate with teammates. Let the experts at ClipTraining take you through a  collaborative SharePoint online training course, first stop “Getting Started with  SharePoint”, Then learn how to work your way through all the available features  such as: Libraries, Communication and Collaboration, Working with Search and  the Calendar, and much more.</p>    <p>This 50 part SharePoint online  training  video series offers over 2 hours of training material, with step-by-step visual  instruction helping viewers retain what they have learned. ClipTraining’s  methodology is concentrated content where you learn exactly what you need to  know in the minimal time it takes to learn it. This way you don’t have to sort  through extensive video time trying to find the desired information. </p>    <p>This SharePoint online  training course  is ideal for beginners who want to learn about SharePoint and how it helps  organize projects. As well as, the advanced users who need to refresh their  knowledge. Your team will be amazed at how easy it is to communicate, track  task and issues, post documents and images, and basically manage a project all  in one place.</p>    <p>Don’t waste any more  time sending emails back and forth trying to get a project organized. Take this  course and  learn how to use SharePoint 2010.</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Learn Microsoft SharePoint 2010", 
    "price": "20.00", 
    "instructors": "ClipTraining LLC", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46352_f44a_7.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-sharepoint-2010/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-18T19:41:41Z"
}