{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>** <strong class=\"redactor-inline-converted\">Easily apply professional animations to dashboards, splash screen, charts, reports, pivot tables and anywhere, any Excel project. Now take your Excel work to a whole new level\"**</strong></p>\n\n<p>The only Excel animation course on Udemy and is developed for anyone wanting to create animation without the stress of remembering too many VBA codes. Super easy concepts and professional tricks for creating beautiful and meaningful animations in Excel.<strong></strong></p>\n\n\n\n<p>Do you want to get super creative at work and make every Excel project impressive? Do you want to wow your users: your clients, customers, your boss and anyone? Get started learning Excel animation and become highly wanted ! There's no limit with Excel animation, create what you can think! Get things to action in no time! Create professional animation such as splash screen animations for all Excel projects and have your users jaws dropped as soon as they click open a workbook. Never before animation in Excel was so easy and awesome as this course requires no prior knowledge of coding and all you need to know is just the bare basics of Excel and you are ready to become an excellent animator. Everything is covered step by step from beginner's to mastery level. Animation in Excel is achieved through VBA (programming language of Excel), but all the contents/projects in this course are assisted with the concept of recording macros. Which means Excel will generate the codes that you want and then I'll guide you how to modify the codes a very little and get that desired animation effects. So absolutely no stress on the brain learning too many codes. Nevertheless you'll end up becoming a developer and a creative professional. If you are a complete beginner, you gonna love it. It's super easy to get started with animation in Excel. And if you are already an advanced Excel user or a seasoned VBA programmer, you would be so glad to come across this course, as you will learn tons of tricks to create awesome animations in Excel.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>How many people do you know who knows animation in Excel? Chances are not many or maybe none! So be the first to upgrade your skill in Excel! With the Exercise files/ working files included, everything in this course is step by step learning. From writing your first macro/program to writing beautiful animation codes which are not only very easy but very fun to learn. And the best part is you don't have to remember any codes, as Excel will generate those codes when you record a macro. I will take you through all the projects by recording macros and then just make little tweaking to the codes generated by Excel. And also I'll show you how to get the codes from the internet that you are looking and create animations with that. So like I said, no stress on the brain learning codes and it's just fun animating. So some of the things you'll learn are:<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>move around shapes in Excel with codes,</li><li>rotate shapes,</li><li>understand 3D rotations in X, Y, Z axis</li><li>Morphing of shapes</li><li>create amazing animated splash screens to create first impression when a user clicks open your Excel workbook. Its a winning trick you'd always use once you learn</li><li>create loading screens like seen on web pages /  mobile apps in your Excel workbooks</li><li>create animated password access splash screen system to your Excel workbooks. </li><li>learn different styles of animated menus like slide out menus, slide down menus, scaling menus, toggle button animated menus</li><li>loop animations</li><li>chart animation / graph animation in Excel</li><li>Learn text animation, that you'll always use in all simple to big Excel projects. Because it's insanely easy and useful!</li><li>learn to apply various animations in all kinds of dashboards/reports/simple information workbook</li><li>learn awesome button animations for that great user experience every time someone interacts with your dashboards/reports/projects</li><li>creative mouse hover animation for all projects</li><li>various transitions and effect animations</li><li>learn all properties of shapes such as transparency, blur, Scale height/width, glow, color to achieve amazing animation effects that can be applied to any project.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Fun is guaranteed throughout this course as you would be amazed to see yourself animating your imagination right within Excel. By the end of the course, you'll be armed with tons of tricks to create any kind of professional animation for any projects. And if you get stuck somewhere or trying out new animation ideas just post your questions on Udemy forum and I'm always around for quick support.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is frequently updated with new animation tricks so that you continue to gain from this course. And this course also comes with 30 days of risk free money back guarantee from Udemy. So, for any reason if you are not satisfied, you get full refund, no questions asked. So, go ahead and <strong class=\"redactor-inline-converted\">enroll in this course today</strong> and become a creative tech professional.<br></p>", 
    "end_date": null, 
    "title": "Learn Excel VBA animation for dashboard, reports, charts etc", 
    "price": "20.00", 
    "instructors": "Kishon Deori", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587634_64ae_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-animation-for-great-user-experience/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T18:37:23Z"
}