{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><br style=\"\"></p><p>  \t<strong style=\"\">Over 250+ students learning</strong>  </p>  <p>  \t<strong style=\"\">Frequent updates to requested material </strong>  </p>  <p>  \tMicrosoft PowerPoint is one of the most popular methods to deliver presentations. Do you want to learn how to use PowerPoint and also create fantastic presentations? This course is for you!  </p>  <p>  \t    Used for various purposes as a significant tool to deliver information to an audience which includes formal business presentations, educational presentations, family and hobby use and much more it is essential to not only learn PowerPoint but to become comfortable and efficient. Taking this course will significantly assist you with your presentation endeavors. This course will cover a broad range of operations within Microsoft PowerPoint. It includes video, audio and text lessons. Not only will it introduce and cover how to perform specific steps  such as inserting text, data, graphs, notes etc but this course will highlight features that can be overlooked by even the most proficient PowerPoint users. Overall the course is structured in a way where it will take you step by step through the functions of Microsoft PowerPoint.  </p>  <p>  \t    Follow along with step by step instructions which are simple to understand and comprehend. Learn Microsoft PowerPoint: Create A Fantastic Presentation is an excellent course for users of all levels. Start today and you will be on your way to creating fantastic presentations!  </p>", 
    "end_date": null, 
    "title": "Learn Microsoft PowerPoint : Create A Fantastic Presentation", 
    "price": "20.00", 
    "instructors": "Global  Pioneers", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385738_6fc5_6.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-powerpoint-create-a-fantastic-presentation/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T15:16:50Z"
}