{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t    Imagine that you can learn how to build project management, software testing and quality assurance real world ready documents using Microsoft Excel. This way you are not just learning Excel, but also building ready to use documents, which could be used in your day to day work. And you also learning the skill on how to create working products in Excel. We have the course for you. Designed by <a href=\"http://www.howtoanalyzedata.net/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">HowToAnalyzeData.net</a>, a global training partner, this course covers all of the best activities to get you started.  </p>  <p>  \t    In this training class, students will to gain the necessary skills to create on how to use excel to create, edit, format, and manage project management plan, timelines, quality assurance process and will understand how to build all required documetns used in the process from scratch.  </p>  <p>  \t<span style=\" color:inherit;\">Class Goals:</span>  </p>  <p>  \t<strong style=\"\">How to Build Project Plan documents using Microsoft Excel</strong><br style=\"\">  \t<span style=\" color:inherit;\"></span>  </p>  <ul style=\"\">  \t<li>What is the project plan</li>  \t<li>Why is it helpful to create project plan? Why would you do it in Microsoft Excel.</li>  \t<li>How can you benefit from the course</li>  \t<li>Create Project plans for below scenarios  \t<ul style=\"\">  \t\t<li><em style=\"\">1.0 Select new storage for the small business.</em>  \t\t<ul style=\"\">  \t\t\t<li>What is involved? How to estimate the costs? How to select the timeline and engage right resources to implement it?</li>  \t\t</ul>  \t\t</li>  \t\t<li><em style=\"\">2.0 Upgrade business computers to the newer models.</em>  \t\t<ul style=\"\">  \t\t\t<li>What is involved? How to estimate the costs? How to select the timeline and engage right resources to implement it?</li>  \t\t</ul>  \t\t</li>  \t</ul>  \t</li>  \t<li>How to build a Project Plan using Microsoft Excel  \t<ul style=\"\">  \t\t<li>Step by step instructions</li>  \t\t<li>How to use created document</li>  \t</ul>  \t</li>  \t<li>Where to find additional examples</li>  </ul>  <p>  \t<strong style=\"\">How to Build Testing and Quality Assurance Documents using Microsoft Excel</strong><br style=\"\">  \t<span style=\" color:inherit;\"></span>  </p>  <ul style=\"\">  \t<li><em style=\"\">How to define test phases for software quality assurance project</em></li>  \t<li><em style=\"\">How to create a test script in preparation for testing</em></li>  \t<li><em style=\"\">What is the test coverage and how to make sure you cover all required scenarios using Microsoft Excel.</em></li>  \t<li><em style=\"\">How you can report results of quality assurance to the management and team members.</em></li>  \t<li><em style=\"\">Review out of the box Microsoft Access database, which comes with the product, for defects and issue management</em></li>  </ul>  <p>  \t<strong style=\"\">Our Teaching Philosophy</strong>  </p>  <p>  \t<em style=\"\">Here’s a refreshing concept in computer online training : We actually care about your goals and focus on helping you reach them.</em>  </p>  <p>  \t     We create high quality IT training videos focusing on solving specific business challenges.  </p>  <p>  \t      Imagine the satisfaction of learning on how to solve specific  business problem with factual information. Instead of focusing on  features of the product we focus on what you can actually accomplish  with the tool to solve your challenge. Our main goal is to  “Solve any  business challenge with data and answer any business question with  facts.” With our videos, you’re on the fast track to get your challenges  solved and skill mastery on the topics where you need help.  </p>  <ul style=\"\">  \t<li>We know you’re looking to solve specific business problem. How about  learning the tool not just by learning the features, but by building a  real world document. Or creating a real world project plan.  That’s why  our project-based video tutorials give you relevant skills to apply to  real life case studies, projecting the experience of our experience  educators. Each course is segmented into different chapters so you can  learn sequentially or jump to topics of specific interest.</li>  \t<li>Our video experts are coaches Our experts show you HOW the software  works using real-world project examples. In many cases, practical  working files are included so you can work alongside the tutor. And we  always give you free samples of created files, which you can customize  to for your own needs</li>  \t<li>And we give you homework. You are expected to do specific  assignments in the class to reinforce your learning. Because without it  you lose most of the information you have reviewed. With our courses  expect to master the skills you need to succeed Customers tell us  they’re using their new skills immediately to confidently complete  projects and delight colleagues and clients</li>  \t<li>For those of you who need immediate help we offer consulting  services. Please contact us for details, if you have a problem to solve.</li>  </ul>  <p>  \t      We’re passionate about delivering the best, most affordable  project-based computer software training videos, perfect for business  professionals, consultants, knowledge workers, entrepreneurs, business  owners, and others.  </p>  <p>  \t      Learn from broadcast-quality production methods and leading  accredited authors, Our courses are really do rival classroom-based  training courses, but at a fraction of the cost and on your own  schedule.  </p>", 
    "end_date": null, 
    "title": "Learn Microsoft Excel by building real world ready documents", 
    "price": "20.00", 
    "instructors": "Vadim  Mikhailenko", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/213422_6a00_3.jpg", 
    "course_url": "https://www.udemy.com/manage-testing-and-quality-assurance-using-microsoft-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-08T20:58:45Z"
}