{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>There is simply no more valuable combination of data analysis tools than SQL &amp; Excel.</p><p>Many business users can be intimidated by a database.  This course will help you understand that in many ways, <strong>a database is like a supersized version of Excel</strong>.  This means that you can bring invaluable insight to your team by delivering metrics that others can't, and that in turn leads to new job opportunities and increased job security.<strong></strong></p><p>My Story:</p><p>I graduated from university with a degree in Finance.  I got a job at a software company that made software to model oil and gas financial analysis.  With no prior SQL background, I immediately discovered the value that a database could offer to business professionals.  I instantly recognized that SQL &amp; Excel made absolutely perfect sense together, and I also realized that I could deliver immediate, attention getting results.</p><p>I had the opportunity to work for a client managing $150 billion worth of oil &amp; gas assets, and they were having trouble modelling the financials in just the way we wanted.  We gathered a team, went around the accounting application, and crafted a new reporting solution in SQL &amp; Excel.  Because of the time and resource constraints, <strong>our acceptable margin of error on this project was $500 million dollars</strong>.  Using a custom made SQL &amp; Excel reporting solution, we delivered exact results accurate to the penny, not off by $500 million!  I knew then that this combination of tools would be able to garner more attention than anything else I would ever work with.</p><p>Since then, I've gone on to become a professional software developer working exclusively with SQL databases.  <strong>I built QuerySmith, the world's most popular SQL add-in for Excel</strong>.  It's graphical, it's easy to use, it's the software used in the course and <strong>it's completely free.</strong></p><p>I've delivered solutions to clients again and again that bridge the gap between the technical world of SQL and the business world of Excel.  It's much easier than you think, and you can do it too.</p>", 
    "end_date": null, 
    "title": "Learn SQL & Excel", 
    "price": "30.00", 
    "instructors": "Brian Haas", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/638586_1125_9.jpg", 
    "course_url": "https://www.udemy.com/learn-sql-and-excel-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-12T20:59:21Z"
}