{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t            Are you struggling hard to learn the Vlookup function?  </p>  <p style=\"\">  \t            Have you wasted a lot of money in buying Vlookup Ebooks &amp; Video Tutorials which are difficult to understand?  </p>  <p style=\"\">  \t            Do you feel that “Vlookup” is not your cup of tea?  </p>  <p style=\"\">  \t            You have an excel exam tomorrow and Vlookup is a sure shot question.  </p>  <p style=\"\">  \t            Looking for a Very Simple Vlookup Tutorial then “Yes”…You have come to the right place.  </p>  <p style=\"\">  \t            You will learn and master the Vlookup function in less than one hour. And…that’s my promise to you!  </p>  <p style=\"\">  \t<strong style=\"\">Prerequisites for learning this Course</strong>  </p>  <ul style=\"\">  \t<li>Basic Understanding of Microsoft Excel</li>  \t<li>Working Knowledge of Basic Excel Formulas</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p style=\"\">  \t            Vlookup is one of the easiest database functions in Microsoft Excel however the least understood.  </p>  <p style=\"\">  \t            In over 45 mins of content including 15 lectures, we will cover the Introduction of Vlookup, Definition of Vlookup, Syntax of Vlookup, Basics of Cell References, Types of Cell References i.e. Relative and Absolute Cell References, Vlookup with False &quot;range_lookup&quot; &amp; Vlookup with True &quot;range_lookup&quot; with practical examples and the Types of Errors that you might get while using the Vlookup function via practical examples.  </p>  <p style=\"\">  \t            You will be able to check your understanding by attempting the quizzes and by downloading and referring to Supplementary materials.  </p>  <p style=\"\">  \t            This course is perfect for anyone who is facing difficulties in understanding the Vlookup Function, Students Learning Excel at School or College, Excel Enthusiasts, Aspiring MIS Specialists, HR Professionals, Payroll Specialists, Business Analysts etc.  </p>  <p style=\"\">  \t<strong style=\"\">  Upon Completion of this course you will:</strong>  </p>  <ul style=\"\">  \t<li>Become a master of Vlookup,</li>  \t<li>Have a solid understanding of the Meaning &amp; Types of Cell References.</li>  \t<li>Be able to distinguish between Vlookup - False &quot;range_lookup&quot; argument &amp;  Vlookup -True &quot;range_lookup&quot; argument and scenarios where they are used</li>  \t<li>Have a practical understanding of  Vlookup Errors.</li>  \t<li>Knowledge of Excel tips &amp; tricks which will make your Job easier.</li>  </ul>  <p style=\"\">  \t            Wait…..That’s not all!!!  </p>  <p style=\"\">  \t            You will get a lifetime access to these Videos, Quizzes, Supplementary materials and Discussion section.  </p>  <p style=\"\">  \t            So what are you waiting for?  </p>  <p style=\"\">  \t            Get yourself enrolled in this course right away and Show the World that Vlookup is no more a challenge for you.  </p>  <p style=\"\">  \t          Enrol Now!!!  </p>", 
    "end_date": null, 
    "title": "Learn Vlookup in Less Than One Hour", 
    "price": "20.00", 
    "instructors": "Kamall Arya", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378648_d692_2.jpg", 
    "course_url": "https://www.udemy.com/learnvlookup/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T17:39:52Z"
}