{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Ne serait-ce pas génial de pouvoir <strong class=\"redactor-inline-converted\">marquer vos auditeurs</strong> lors de votre présentation ?</p>\n\n<p>Et si vos auditeurs se <strong class=\"redactor-inline-converted\">souvenaient de votre présentation</strong> même quelques jours après ?</p>\n\n<p>Que vous soyez <strong class=\"redactor-inline-converted\">entrepreneur, professeur, étudiant ou professionnel,</strong> vous êtes souvent amené à effectuer des présentations powerpoint. Au lieu d'utiliser les modèles tout faits, voire pire, le modèle tout blanc, venez apprendre à créer <strong class=\"redactor-inline-converted\">des slides mémorables avec Keynote</strong>.</p>\n\n<p><br></p>\n\n<p>L'idée de ce cours est de <strong class=\"redactor-inline-converted\">vous apprendre en une petite heure</strong> à créer de superbes présentations powerpoint, marquantes, impressionnantes, mais aussi (et surtout) professionnelles.</p>\n\n<p><br></p>\n\n<p>Ce <strong class=\"redactor-inline-converted\">cours totalement gratuit</strong> va donc vous apprendre comment créer un <strong class=\"redactor-inline-converted\">excellent support de communication</strong> avec le logiciel Keynote sur Mac. <strong><em>Mais tous les conseils sont aussi applicables sur Microsoft Powerpoint</em></strong>, sur les logiciels de la suite Libre Office ou Open Office et tous les logiciels vous permettant de faire des slides.</p>\n\n<p><br></p>\n\n<p>En prenant ce cours, vous aurez vraiment accès à une petite boite à outils qui vous permettra de faire ce que vous souhaitez avec vos Powerpoints. Vous aurez aussi accès à un ebook gratuit reprennent par écrit tout le cours. </p>", 
    "end_date": null, 
    "title": "Maitrisez Keynote et l'Art de la présentation PowerPoint", 
    "price": 0, 
    "instructors": "Etienne de Saint Victor", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806162_c95e_2.jpg", 
    "course_url": "https://www.udemy.com/maitriser-keynote-et-l-art-de-la-presentation-powerpoint/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T14:29:03Z"
}