{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t <strong style=\"\">The World Is Filled With Two Kinds Of People: A Handful Of People Who Are Masters Of Excel, And The Millions Of Others Who Wish They Were</strong>  </p>  <p>  \t If you’ve mastered Microsoft Excel 2010 then you have one of the most practical and valuable skill sets in all of modern business. A spreadsheet guru can work wonders – from organizing lists, to creating multi-layered, interactive reports, to revealing answers to business critical questions like ROI, budget allocations, tracking expenditures, and more. This course is your path to first learning, then even mastering Excel.  </p>  <p>  \t <strong style=\"\">This is our most requested training course! </strong> If you learn to use Excel 2010, you will start to see how useful it is in your life – from formatting your grocery list to calculating complex ROI values. Of course, you may have a rudimentary knowledge of how Excel works, but if you want to learn to get the most of it, then take this course. Let our Microsoft Certified Trainers Barbara Evers and Christina Tankersley walk you through everything you’ve ever wanted to know about Microsoft Excel 2010, including:  </p>  <ul style=\"\">  \t<p>  \t\t ·How to customize Microsoft Excel 2010 to work better for you  \t</p>  \t<p>  \t\t ·Easily creating &amp; modifying PivotTables  \t</p>  \t<p>  \t\t ·The best way to create easy-to-view Charts &amp; Graphs  \t</p>  \t<p>  \t\t ·Using Conditional Formatting and Sparklines to Highlight Data Trends  \t</p>  \t<p>  \t\t ·Tips &amp; Tweaks for over 120 Excel 2010 functions and features!  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Mastering Excel 2010", 
    "price": "20.00", 
    "instructors": "Chip Reaves", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/211136_bb4c_3.jpg", 
    "course_url": "https://www.udemy.com/mastering-excel-2010/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-05T20:28:41Z"
}