{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Course Material Works in Microsoft Excel 2007, 2010, 2013 and 2016 </strong></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Join me in this course and take control of Microsoft Excel and master the process of automating routine tasks through the use of Excel Macros and Excel VBA.</strong></p>\n\n\n\n\n\n\n\n<p>During this course you will build a foundation of working with Excel Macros and VBA. This foundation will be built as you engage and participate in project based Excel Macro/VBA exercises, detailed throughout the lectures within this course. Each of the projects will build upon one another, introducing a new concept each time, starting with the basic building blocks of automating any task within Excel and ending with a fully customized Excel VBA project that will automate a series of Excel tasks.</p>\n\n\n\n\n\n\n\n<p>As you engage and participate in this course, you will be introduced to the wonders of creating simple Macros through the Macro Recorder and then quickly take <strong class=\"redactor-inline-converted\">you into the world of Excel VBA where you will experience building a more dynamic, robust experience for yourself and your peers. </strong></p>\n\n\n\n\n\n\n\n<p>Each project contains exercise files that you can download and use to complete the assigned Excel Macro/VBA projects. The course also contains detailed instructions through the video lectures as well as a series of PDF documents that you can reference as you complete the projects.</p>\n\n\n\n\n\n\n\n<p>Below are a few samples of the projects you will complete by enrolling and participating in this course.</p>\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Automate placing and formatting</strong> a title on a worksheet</li><li>Interact with the users of your Macros through <strong class=\"redactor-inline-converted\">Input and Message boxes </strong>in order to receive input on how a Macros should work</li><li><strong class=\"redactor-inline-converted\">Cleaning up multiple</strong> Excel Worksheets and prepare the data to be reported on</li><li>Create a report based on multiple sets of data found <strong class=\"redactor-inline-converted\">within multiple Excel Worksheets, copying data from one Worksheet into the Master Report Worksheet</strong></li><li><strong class=\"redactor-inline-converted\">Automate the creation of Excel Formulas</strong> to SUM data up in your Report</li><li>Working with <strong class=\"redactor-inline-converted\">Excel VBA User Forms</strong></li><li><strong>Importing Data</strong> from External Text Files</li></ul>\n\n\n\n\n\n\n\n<p>Each of these projects will direct you through key Excel VBA programming concepts and direct you to identify and use best practices in creating Excel Macros.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So, don’t lose another moment performing Excel tasks manually. Enroll now and learn how you can get Microsoft Excel to your work for you.</strong></p>", 
    "end_date": null, 
    "title": "Master Microsoft Excel Macros and Excel VBA", 
    "price": "20.00", 
    "instructors": "Kyle Pew", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690066_6b76_3.jpg", 
    "course_url": "https://www.udemy.com/master-microsoft-excel-macros-and-vba-with-5-simple-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T03:17:56Z"
}