{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Quickly Learn How to Master Microsoft Excel 2013 and 2016 – Beginner</strong></p>    <p><u>Become Proficient with Excel and it's Powerful Data Functions Using These Training Classes</u></p>    <ul><li>Great for personal and professional finances</li><li>Use conditional formatting to see what numbers matter most  </li><li>Bring information from various files and documents together</li><li>Unlock the potential of your data with tables, charts, and pivots  </li><li>Master statistical functions and data analysis to identify trends</li></ul>    <p><u>Effortlessly Bring Important Data Together</u></p>    <p>If you're new to Excel, then you should take this class, and master all of its frequently used features. From showing you how to do a calculation, to creating useful graphs and tables, all of that is available so that you can understand your data better. There's a lot more to it than that though. This is a tool you just can't be without. In fact, when it comes to making the most of resources, and maximizing return on investment, this is the best thing out there.</p>    <p>Our course was designed for beginners that are familiar with Excel, but would like to improve their skills and see what else they can do with this unique and handy program. One benefit to taking this comprehensive course and using Excel is that it will be a huge time saver.</p>    <p>How, you ask? Excel saves you time by offering an intuitive graphical user interface. When you think of what Excel is good at, you probably first think of data manipulation: filtering, sorting, tabulating and calculating all kinds of information and data. You can use these easy-to-understand classes to reach the next level of database tracking and reporting.</p>    <p><u>Contents and Overview</u></p>    <p>Through hours of content, this beginners course will take you through learning how to use functions for all your work-related issues. Many functions are covered including payments, future value, and depreciation. Learn statistical functions like averages, percentiles, and regression too. Excel's extensive data tools are very impressive as they can also provide the benefit of a shortened workload. In other words, this course shows you how to master this special and versatile spreadsheet program so that you can import and export common and not-so-common data formats, which reduces your need for specialized software.</p>    <p>This new course will easily help improve your efficiency as we cover many of Excel's core concepts. Understanding pivot tables and data analysis, for example, will be important for you moving forward. For help with reporting, you will learn stock charts, surface charts, radar charts, and bubble charts - just to list a few. A very easy to use and well structured course.</p>    <p>Upon completion of this course, you'll be able to effectively create charts and graphs for personal or company records. You'll also be able to access the ribbon (and other tools), allocate valuable resources, meet tight deadlines, manage extra tasks, manage data, and much more. The material found inside is easily laid out and quite relevant.</p>    <p>So, take this course to possess all the skills necessary to organize and deliver your projects in the most efficient and effective way possible!</p>", 
    "end_date": null, 
    "title": "Master Microsoft Excel 2013 & 2016 for Beginners", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "20 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/739942_2248_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2013-and-2016-training-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-24T14:54:11Z"
}