{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><u><strong class=\"redactor-inline-converted\">Discover the Powerful Features of This Popular Program</strong></u>\n\n  </p>\n\n\n\n<ul><li>Have complete control over your presentation's      information\n\n</li><li>Now      have professional presentations for job or project\n\n</li><li>Quickly create top-notch visuals for your      audiences\n\n</li><li>Feel confident and show off your new powerful      slides\n\n</li><li>Get all of the new tools to master presentation      management\n\n</li><li>Effortlessly add text, graphics, audio, video,      charts, tables and SmartArt to your slides\n\n</li><li>6      hours of professional video with over 70 individual lessons that make      everything clearer and easy to remember\n\n</li><li>Practice what you learned with included exercise      files\n\n</li></ul>\n\n\n\n\n\n<p><u><strong>Use This New Course to Easily Create Beautiful Presentations</strong></u>\n\n  </p>\n\n\n\n\n\n<p>PowerPoint 2016 is by far the most popular presentation program in the world as it allows users to create, edit, and show illustrative presentations with the help of attention-grabbing slides. This crash course explains how you can combine the text, 3-D graphics, and multi-media to support your presentation-making needs. Using PowerPoint as a presentation tool is the way to go.\n\n  </p>\n\n\n\n\n\n<p>Do you need some visual impact? Well, look no further. Because this course can show you how to take this program and make it do just that. In fact, making your presentation more interesting through the use of multi-media can only help improve your audience's focus. PowerPoint 2016 allows you to use your choice of images, audio clips, and videos to help you get your points across. These important sound effects and visual cues can also help a presenter like yourself, be more improvisational, and interactive, all of which is a very beneficial thing. This course essentially shows you why PowerPoint 2016 is the best and most complete presentation package available. It gives you 80 individual video tutorials that are quite in-depth. It also has exercise files so that you can practice the lessons you've learned.\n\n  </p>\n\n\n\n\n\n<p>Everything you need is here so that you can learn how to produce a nice and professional-looking presentation. Once everything is finished, you can begin to prepare your talk. In fact, even if it went well but someone missed your presentation, you could still have them view it online at a time that's convenient for them. Simply upload your presentation to YouTube with everything featured in your work, including all of the slides, commentary, and transitions.\n\n  </p>\n\n\n\n\n\n<p>So, whether you need processing, outlining, drawing, graphing, or more elaborate presentation management tools - it's all covered in this easy-to-understand course. You can not only create and modify your own presentations, but gain mastery on it eventually, too. All that is needed on your part is a little practice.\n\n  </p>\n\n\n\n\n\n<p><u><strong class=\"redactor-inline-converted\">Overview and Contents</strong></u>\n\n  </p>\n\n\n\n\n\n<p>PowerPoint 2016 can be used in a number of different yet effective ways to communicate with your audience. Slides are completely customizable. Depending on your approach, you may want to have a presentation that's text-heavy, image-heavy, or some combination of both. Combining the two tends to give your listeners the benefit of both visual aids and notes all at the same time.\n\n  </p>\n\n\n\n\n\n<p>PowerPoint 2016 also comes with many new features such as the brand-new transition type, Morph, that can help users make animations, transitions, and object movements across your slides. Pretty neat, right? This course covers that and so much more. It also shows you how to make presentations with alternative forms, styles, and custom layouts which are used by working professionals, teachers, students, medical practitioners, politicians, and countless others. They see the value in this unique course on PowerPoint 2016 as they want to know how to use it to quickly showcase their information and data.\n\n  </p>\n\n\n\n\n\n<p>Perfect for those who are looking for a comprehensive and organized method to presentations. Great for those that want to add value to lectures, make more compelling speeches, or enhance studies and reports. So, what are you waiting for now? If you want to learn how to use the latest version of PowerPoint, then this is for you. At the completion of this course, you will have more knowledge, better skills, and be fully prepared to use PowerPoint 2016 for every single one of your complex presentation needs.\n\n  </p>\n\n\n\n\n\n<p><strong>* Includes exercise files to practice what you’ve learned.</strong></p>", 
    "end_date": null, 
    "title": "Master Microsoft PowerPoint 2016 the Easy Way", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/799638_b349_2.jpg", 
    "course_url": "https://www.udemy.com/master-microsoft-powerpoint-2016-the-easy-way/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T12:01:47Z"
}