{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<div style=\"\"><p style=\"\">Watch the video above. If you want to make videos like  these...then this course is for you. </p>    <p style=\"\">This course will guide you to create top quality  presentations using the tools and techniques available in PowerPoint 2013. </p>    <p style=\"\">This course is designed for beginners. We will teach you the  fundamentals and then take you step by step to creating engaging and effective  presentations, video tutorials and marketing videos. </p>    <p style=\"\">By the time you complete this course, you will be armed with  a bagful of tricks and techniques to create awesome presentations and web  videos.</p>    <p style=\"\">This is perhaps the most complete and comprehensive  PowerPoint to Video course available on the web today...and will help you to  master PowerPoint 2013.</p>    <p style=\"\">In a few weeks you will learn everything you need to produce  an awesome presentation or a web video.</p>    <p style=\"\"><span>All lectures are in video format. The course covers fundamentals as well as advanced topics.</span><br style=\"\"></p></div>It will take you approximately 05 hours to complete the course.<br style=\"\"><br style=\"\"><p style=\"\">You should take this course because it covers all details about the software in simple and lucid manner and has been created by an expert in this field. <br style=\"\"></p><p style=\"\">Let’s get going!<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Master PowerPoint 2013:A to Z of creating Marketing Videos", 
    "price": "25.00", 
    "instructors": "Prashant Gupta", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58973_18ba_5.jpg", 
    "course_url": "https://www.udemy.com/master-powerpoint-2013a-to-z-of-creating-marketing-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-08T14:53:12Z"
}