{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Do you want to help your company or organization make better decisions? Do you want to advance your career because you bring real value to the organization? Do you want to save hundreds of hours a year in creating reports and charts? Are you ready to make an impact because you understand the patterns and trends in your company’s data? Do you want to master Excel Pivot Tables? This course is for you!</p>\n\n<p><strong><br></strong></p><p><strong>Master Excel Pivot Tables in this Comprehensive Course</strong>\n\n  </p>\n\n\n\n<p>This comprehensive course contains concise illustrations yet detailed topic coverage that will benefit both<strong> Beginners and Advanced Users</strong> of Excel. In just an hour and a half, you will learn to effectively use Excel Pivot Tables including how to:\n\n  </p>\n\n\n\n<p><strong></strong></p>\n\n<ul><li>Create and Format Pivot Tables</li><li>Select, Move, and Clear Pivot Tables</li><li>Design Pivot Tables</li><li>Value Field Settings – Summarize Values By</li><li>Value Field Settings – Show Values As</li><li>Filter Data</li><li>Manually and Automatically Group Data</li><li>Create Calculated Fields and Items</li><li>Explore Other Useful Pivot Table Concepts</li></ul>\n\n<p><br></p>\n\n<p><strong>Learn Pivot Tables by Doing</strong><br></p>\n\n\n\n<p>Learn one of the most powerful features of Excel that will allow you to <strong>dig deep into your company’s data</strong> and <strong>answer complex questions</strong> with only a few mouse clicks. Learn to analyze vast amounts of data, create useful reports, and impress top management or prospective employers.\n\n  </p>\n\n\n\n<p>Most that say they know Excel Pivot Tables really only have a grasp on the basics. Within the first 10 minutes of this course, you will likely surpass their knowledge and by the end of the course you will master even some of the most complex aspects of Pivot Tables.\n\n  </p>\n\n\n\n<p>Throughout the course, you can <strong>follow along with the numerous concise examples</strong> that illustrate the power and features of Pivot Tables using the included worksheets. Further, <strong>“homework” examples are provided to allow you to apply these same concepts to another data set</strong> so that you can know that you have mastered the concepts.\n\n  </p>\n\n\n\n<ul><li>Create pivot tables from data in an existing worksheet and answer basic questions from the data.</li><li>Summarize pivot table values by sum, count, average, max, min, and other types of calculations.</li><li>Select different parts of the pivot table, move it within and between worksheets, and clear or reset the contents of the pivot table.</li><li>Adjust the design aspects of the pivot table including totals, layout, and visual aspects of the pivot table.</li><li>Adjust pivot table calculations to show the results as a percentage of a total, difference from another field, or other value calculation.</li><li>Filter data out of the pivot table using various techniques including field filters, table filters, slicers, and timelines.</li><li>Automatically and manually group results within your pivot table using a variety of approaches.</li><li>Create and utilize new pivot table fields that are calculated using existing data in the pivot table and new items that consist of formulas that refer to other rows.</li><li>Appropriately reference pivot table data.</li><li>Create pivot charts and understand the relationship between pivot charts and pivot tables.</li><li>And More.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>We are <strong>professional instructors</strong> who have <strong>helped thousands of students Master Excel Pivot Tables</strong> and become even more effective at work. We invite you to join us on a <strong>short journey to advance your career</strong>.\n\n  </p>", 
    "end_date": null, 
    "title": "Master Excel Pivot Tables - Excel 2016 - Excel with Excel", 
    "price": "20.00", 
    "instructors": "Tom Meservy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/835820_aeff_9.jpg", 
    "course_url": "https://www.udemy.com/master-excel-pivot-tables/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-30T04:34:14Z"
}