{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><em></em><em></em><span></span><em></em></p><p><strong>Your ideas deserve respect!</strong> Imagine if the visual of what you speak and present to the audience is actually “presentable”, it raises your point and plays a vital role in convincing your listeners. <em>The converse is also true</em> and believe me that way it is destructive for the point you are making and of course is destructive for you!</p><p><span></span><strong>Are you are new to presentation making and are looking for learning making presentations from scratch?</strong></p>  <p><strong>Or you looking to boost your skills as presentation maker, which will make your life easier and gain you respect of your colleagues?</strong> <em>Well you are on the right spot!</em><br> <br> You can be anyone, a student, teacher or an office employee and of any age, this course is designed to give you THE BEST possible couching on THE BEST and THE MOST popular software - Microsoft PowerPoint 2016 – the latest version of the software.<br> <br> PowerPoint 2016 is packed with features which make it a full and final choice for presentations. It is much beyond simply adding slides, picking up usual “built-in” themes and then adding texts. </p><p>Well my friends, that is not all!<br></p>    <p>In this course:</p><p>We will go through the interface of PowerPoint and learn what is where and does what. This walk through the interface will be easy to understand but in a professional manner. We’ll go through each peculiarity and make it easy for us like A, B, C.</p><p><span></span>Then we will practice what we learn in Section 1, and practice that, one tab at a time. It will make things even more easier, as concepts are now explored through hands. This will surely enhance the understanding.</p><p><span></span>In the next section we take our skills to higher level and make HIGHLY PROFESSIONAL presentations. There will be two projects in this section.</p>  <p>Each project contains highly professional 5 slides. </p>  <p>Each slide </p>  <ul><li>contains a different layout</li><li>is about different perspective</li><li>explores different tricks</li><li>enables to play deeply with features of PowerPoint like text-boxes, figures, graphs, fonts, and</li><li>most importantly explores how we can include scalable figures in PowerPoint by just using a font! These figures can be scaled to any size without distorting. <strong>This will indeed be a solution to our problem of getting free figures to use in PowerPoint.</strong></li></ul>  <p><strong> <br> </strong>Apart from that we’ll see how we can obtain the ready-made extremely beautiful vector graphics from huge resources for free and we’ll see how we can include those in PowerPoint, this will enhance ways of beautifying our slides. <br> <br> Furthermore, in the Course Files folder which contains huge reserve of scalable shapes, which can be included in PowerPoint and manipulated as freely as you want.<strong> These are 900+ in number! These include Social Icons, Icons of daily usage objects and many more. You’ll like these, I am sure.<br> <br> </strong>Then in the next section we’ll take our skills to even higher level and learn how we can draw 3-D objects, like a metallic sphere, a wooden plank or a cupboard, an object of fiber, a metallic key! PowerPoint is really a great tool, it equips you fully to fulfill your need of graphics and your need of beautifying your slides in just a few steps, now remember! This does not involve an inch of Adobe Illustrator or any other graphic software! <br><br></p><p>We’ll learn all this in a refined manner and at a pace that you will understand and absorb! You’ll enjoy the learning and just in few hours you will be a master in PowerPoint, you will have skills using which, you will be able to turn a blank slide into a piece of gold!</p>  Don’t believe me? I offer a full money back guarantee, so long as you request it within 30 days of your purchase of the course. <br> <br> I will always be there for you and will be offering the best help possible. With me as your companion who has more than 5 years of experience and knows PowerPoint deeply, it will not be a difficult journey!<br> <br> With a hope, consistency and a very little hard work, we’ll be able to achieve what you are thinking while signing up for this course in just 4 hours! <br> <br> Let’s get started! I hope to see you in course! <p><br></p><p>Regards,<br></p><p>Ali Akram.<br></p>", 
    "end_date": null, 
    "title": "Master PowerPoint 2016 : Scratch to Advance the Easy way", 
    "price": "20.00", 
    "instructors": "Ali Akram, Muhammad Arslan", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/730968_2760_2.jpg", 
    "course_url": "https://www.udemy.com/master-powerpoint-2016-scratch-to-advance-in-just-4-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-17T10:17:36Z"
}