{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<ul><strong>Master Automation by Learning the Ins and Outs of Microsoft Visual Basic for Applications (VBA) for Excel</strong><br><br><li>How to automate tasks and operations that you perform frequently</li><li>Learn how to use the VBA editor</li><li>Discover the use input boxes and message boxes to interact users</li><li>Learn how to use error messages</li><li>Exercise files to practice what you learn</li><li>Learn advanced methods for automating tedious Excel jobs</li><li>Advanced VBA Language Details in easy-to-learn form  </li><li>Learn vital Event Patterns</li><li>Extensive discussion of Custom Object possibilities  </li><li>Successfully interfacing with Excel</li><li>Working with References and Libraries    </li><li>Discover how to customize the right click menu</li><li>How to modify the Excel user interface</li></ul><p>Great\n for automating repetitive tasks and operations that you perform \nfrequently, VBA is a powerful tool to increase your productivity.<br></p><p><em><strong><strong></strong></strong></em><strong>Essential VBA Training for Excel</strong><em><strong></strong></em></p><p><strong>Contents and Overview</strong></p><p>The\n course is designed for individuals and professionals who are new to VBA\n and who are seeking practical ways to automate tasks in Microsoft Excel\n that are performed frequently.</p><p>Through 4 hours of video \nlectures and exercise files, you'll learn the \nessentials you need to know to create powerful macros using VBA for \nExcel.</p><p>Find out how to use the VBA editor, VBA syntax, keywords, and comments. </p><p>Discover how to define and manage variables, set up subroutines, and create functions.</p><p>Also, find out how to use input boxes and message boxes to interact with end users.</p><p>Learn practical methods for using macro errors to improve your VBA code.</p><p>When\n you complete this course, you'll be well on your way to using VBA \nmacros in Excel to help you and others automate tasks and operations \nperformed frequently.</p><p><strong>Intermediate VBA for Excel<br></strong></p>    <p>You've\n completed the beginner course in VBA - or you've used VBA in your \npersonal life or at work. You know your way around this incredibly \nhelpful Visual Basics for Applications that is always associated with \npower driving MS Excel. You understand how VBA can automate BIG Excel \ntasks so they can be done quickly, making you look like the office \ngenius. Hey, nothing wrong with that!</p>    <p>Now challenge yourself \nwith the next logical step. Intermediate VBA is the learner friendly \ncourse that steps you through powerful, more advanced features and \npossibilities of making VBA do what you need it to.</p>      <p><strong>Contents and Overview</strong></p>    <p>This\n professionally produced video course shows anyone with some VBA \nexperience how to super charge Excel. You will learn more advanced \nprocedures for automating tough and time consuming Excel jobs with \nadvanced micros. This course gives you a lot more power to fully \ncustomize VBA to do some pretty miraculous things.</p>    <p>The course \nstarts with a very helpful and detailed discussion of more advanced VBA \nlanguage. Don't let \"more advanced\" scare you away. The course always \nassumes you've got a life and need these things explained in ways that \nare quick and easy to fully grasp.</p>    <p>Next is a solid discussion \nof Event Patterns. This gives you advanced tools for doing just about \nanything you need with VBA. That is followed by a major section on \nCustom Objects.</p>    <p>Of course, there is plenty of information on \nmaking VBA work smoothly with Excel. Then the course wraps up with a \ngreat tutorial on how to use References and Libraries. Just what you \nneed to continue in your study of VBA for as long as you like.</p>    <p>To\n help you retain the information the instructor has included exercise \nfiles to practice what you learned. Then there is an optional quiz to \ntest your knowledge.</p>    <p>This is the Intermediate training you \nneed for advanced abilities with VBA. Make yourself more valuable at \nwork. Or use these concepts for your own business or personal needs.</p><p><strong>This course includes:</strong></p><ul><li>Exercise files to practice what you've learned</li><li>Beginner and intermediate courses</li><li>A certificate of completion</li></ul><p>All of our videos are high definition; therefore, they are <strong>best viewed with the HD setting on</strong> and the videos enlarged.</p>", 
    "end_date": null, 
    "title": "Master VBA for Excel: Discover How to Put Excel on Autopilot", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656972_d95a_2.jpg", 
    "course_url": "https://www.udemy.com/master-excel-for-vba-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-01T13:34:53Z"
}