{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<span>This course is intended for complete beginners who want to learn excel but don&#039;t have enough time while doing it. The information is explained in the most practical way and most of the videos are really short (less than 3 minutes) so you can take a look at them every time you get a change, so you can learn at your own pace. We will start from scractch You will learn evreything from getting to know the elements of the workbook apply basic formatting,freeze panes, creating custom views, working with formulas, inserting hyperlinks, page breaks, sorting, filtering, wrapping compare sheets etc.</span>  </p>  <p>  \t                You will be provided with material  to work ( the same workbooks used on the videos)so you can practice while you watch the lessons.  </p>  <p>  \t                We all know that Excel has become a necessity in our working lives so whether you are a student or you are already working, knowing Excel will boost your curriculum and your probablities of finding and keeping a job will definitely improve  </p>  <p>  \t                There is no pre-requisite for this course. A complete new beginner can start this course.  </p>  <p>  \t                I will be answering your doubts and questions so you can feel free to ask anything related to the course.  </p>", 
    "end_date": null, 
    "title": "Master Excel 2013: Beginners", 
    "price": "20.00", 
    "instructors": "Gilberto Berlanga", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/285310_51c5_6.jpg", 
    "course_url": "https://www.udemy.com/master-excel-2013-a-complete-beginners-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-21T17:27:03Z"
}