{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn Microsoft Office 2010 and Windows 8 with this  comprehensive course from TeachUcomp, Inc. <em>Mastering  Microsoft Office Made Easy</em> features 688 video lessons with over 60 hours of  introductory through advanced instruction. You get our EIGHT complete courses  in Access, Excel, OneNote, Outlook, PowerPoint, Publisher, Windows and Word. Watch,  listen and learn as your expert instructors guide you through each lesson  step-by-step. During this media-rich learning experience, you will see each  function performed just as if your instructor were there with you. Reinforce  your learning with the text of our 16 printable classroom instruction manuals  (Introductory, Intermediate and Advanced), additional images and practice  exercises.&nbsp; This complete Microsoft  Office course covers the same curriculum as our classroom trainings and was  designed to provide a solid foundation in Office. </p>  <p>Whether you are completely new to Microsoft Office or  upgrading from an older version, this course will empower you with the  knowledge and skills necessary to be a proficient user. We have incorporated  years of classroom training experience and teaching techniques to develop an  easy-to-use course that you can customize to meet your personal learning needs.  Simply launch a video lesson or open one  of the manuals and you’re on your way to mastering Office. Each individual application course is listed alphabetically.<br></p>  <ul><li>The ACCESS curriculum begins at Section 1 </li><li>The EXCEL curriculum begins at Section 22</li><li>The ONENOTE curriculum begins at Section 53</li><li>The OUTLOOK curriculum begins at Section 70</li><li>The POWERPOINT curriculum begins at Section 87</li><li>The PUBLISHER curriculum begins at Section 107</li><li>The WINDOWS curriculum begins at Section 121</li><li>The WORD curriculum begins at Section 133</li></ul>  <p>Each curriculum includes 1, 2 <strong><em>or</em></strong> 3 classroom  instruction manuals in PDF (Introductory, Intermediate, Advanced). You will  find the manuals at the END of each application curriculum.</p>  ", 
    "end_date": null, 
    "title": "Mastering Microsoft Office 2010 Training Tutorial", 
    "price": "30.00", 
    "instructors": "TeachUcomp, Inc.", 
    "commitment": "60 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37715_71e6_7.jpg", 
    "course_url": "https://www.udemy.com/mastering-microsoft-office-2010-made-easy-training-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-23T14:48:50Z"
}