{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t <strong style=\"\">This Is Your Authoritative Course For All Things On Microsoft Word 2010 -- Delivered In Easily Searchable, Highly Informative Content Modules</strong>  </p>  <p>  \t    Microsoft Word:Hands-down the most powerful document creation tool on the planet.Used by millions of people each day, very few know how to use it properly.In this comprehensive course produced by Microsoft Certified Trainer Christina Tankersley we’ll show you everything you need to know to harness the power of Microsoft Word.  </p>  <p>  \t<strong style=\"\">Whether You Want To Gain A Specific Skill Or You Want To Achieve Complete Mastery – This Course Offers It All</strong>  </p>  <p>  \t   Microsoft Word is more than a Word Processor. If you know the skills taught in this course you will be more productive, in less time, and be able to maximize the potential functionality of what is probably the world’s most common program.  </p>  <ul style=\"\">  \t<li>Hidden time-savers in the Word 2010 interface</li>  \t<li>How to get the most from Styles, Style Sets, and Themes</li>  \t<li>How to troubleshoot file types &amp; printing issues</li>  \t<li>Tips &amp; Tweaks for over 150 Word 2010 features and functions</li>  </ul>  <p>  \t Quickly Search For And Find The Skills You Want To Master From Our Comprehensive List Of 82 Modules – Then Just Point, Click, And Learn  </p>  <p>  \t Over 14 hours of high quality HD content in the engaging Bigger Brains Teacher/Learner style!  </p>  <p class=\"MsoListParagraphCxSpFirst\">  \t<!--[if !supportLists]-->  </p>", 
    "end_date": null, 
    "title": "Mastering Word 2010", 
    "price": "20.00", 
    "instructors": "Chip Reaves", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/205080_6453_3.jpg", 
    "course_url": "https://www.udemy.com/mastering-word-2010/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-25T14:19:05Z"
}