{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">JOIN MY COMMUNITY OF OVER 11,000 STUDENTS AND LEARN AMAZING TECHNIQUES, TIPS, TRICKS AND SECRETS THAT I'VE ACCUMULATED OVER 15 YEARS OF ACADEMIC AND PROFESSIONAL TRAINING!</strong>  </p>  <p style=\"\">  \t          +++++++++++++++++++++++++++  </p>  <p style=\"\">  \t<strong style=\"\">Created: </strong>13 January 2015  </p>  <p style=\"\">  \t<strong style=\"\">Last Updated: </strong>17 April 2015  </p>  <p style=\"\">  \t                                 +++++++++++++++++++++++++++  </p>  <p style=\"\">  \t<strong style=\"\">Course Achievements</strong>  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">500 Students</strong> in the first few hours of release!</li>  \t<li style=\"\"><strong style=\"\">5 Reviews</strong> on the first day of release</li>  \t<li style=\"\">Over <strong style=\"\">1,000 minutes consumed</strong> on first day</li>  </ol>  <p style=\"\">  \t                                                             ++++++++++++++++++++++++++  </p>  <p style=\"\">  \t<strong style=\"\">Course Description</strong>  </p>  <p style=\"\">  \t                      Learn the productivity secrets that will help you manage your information quickly and efficiently.  </p>  <p style=\"\">  \t                      I'll be teaching you guys the power of using Freeze Panes which allows greater maneuverability for large scale data. We'll then be introducing the Quick Access Toolbar and show how it can streamline your processes as well as create a customize collection of functions to meet your daily Excel needs. We'll then finish the course off with some Keyboard Shortcuts.  </p>  <p style=\"\">  \t                                                             ++++++++++++++++++++++++++  </p>  <p><strong style=\"\">Instructor Achievements</strong></p><ol style=\"\"><li style=\"\">Member of the Udemy Council</li><li style=\"\">+19,000 students (totalling ~40,000 enrolments)</li><li style=\"\">Average of 300-500 enrolments per day (Highest enrolment rate in one day was 1400 students)</li><li style=\"\">+500 Positive Reviews (5 Star Average Rating across all courses)</li><li style=\"\">+18 Live courses (+20 courses in production)</li><li style=\"\">Incorporated my Udemy courses into RMIT University Laboratory Tutorials for Undergraduate Aerospace Engineers</li></ol><p>++++++++++++++++++++++++++</p>  <p style=\"\">  \t<strong style=\"\">Course Details</strong>  </p>  <ol style=\"\">  \t<li style=\"\">This course has the <strong style=\"\">shortest and simplest </strong>tutorial video's you will ever see! Clear, concise and to the point!</li>  \t<li style=\"\">It is designed for the <strong style=\"\">beginner/intermediate</strong> but if you're looking to freshen up on your skills, come on in!</li>  \t<li style=\"\">I've intentionally made the video's around <strong style=\"\">2 minutes or less </strong>so that you get your information instantly. <strong style=\"\">NO MORE USELESS CHATTER</strong>!!</li>  \t<li style=\"\"><strong style=\"\">FULL AND FREE LIFETIME ACCESS</strong></li>  \t<li style=\"\">All future lectures, videos, documents and upgrades included <strong style=\"\">FREE</strong></li>  </ol>  <p style=\"\">  \t                                                             +++++++++++++++++++++++++++  </p>  <p style=\"\">  \t<strong style=\"\">What Udemy has said about me and my courses</strong>  </p>  <p style=\"\">  \t<em style=\"\">      'We looked at some data + feedback from your courses and found you <strong style=\"\">ranked in the top group of instructors on Udemy!</strong> Students love taking courses from instructors they trust!'  </em>  </p>  <p style=\"\">  \t                                                     +++++++++++++++++++++++++++  </p>  <p style=\"\">  \t<strong style=\"\">What students have already said about this course</strong>  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">Katie Miller </strong>Clear and Succinct. The pace of this course was comfortable. The instructor didn't overwhelm with too much information in each lecture. I appreciate how the instructor encouraged time-management by staying focused and offering time-saving tips in Excel. I'm glad I choose this as my first course to take on Udemy.</li>  \t<li style=\"\"><strong style=\"\">Robin Hoyohoy</strong>Awesome! Each course is straight to the point and the demos are awesome and easy to follow along. Love the 1-3 minute videos, it helps a lot. Awesome teacher! </li>  \t<li style=\"\"><strong style=\"\">Jimmy Ching</strong>Very clear and easy to learn tips! Learned few things and appreciate that. Well done. </li>  \t<li style=\"\"><strong style=\"\">Cristian Mateiciuc</strong>Quick and effective. To the point, well presented and quite interesting course. It's almost fun to quickly learn tips on Excel. </li>  \t<li style=\"\"><strong style=\"\">Joanne Hanson</strong>Quick and Easy. I like how quick each lecture is and how easy they are to understand and put into practice. </li>  </ol>  <p style=\"\">  \t                                                     +++++++++++++++++++++++++++  </p>  <p style=\"\">  \t<strong style=\"\">Enrol Now and Experience the Benefits</strong>  </p>  <ol style=\"\">  \t<li style=\"\">I'll show you <strong style=\"\">step-by-step</strong>, I'll explain and highlight every single button I press, I'll draw around important area's and icons with on-screen drawing tools, I'll zoom into small and hard to see area's so you don't miss a single thing!</li>  \t<li style=\"\">With over <strong style=\"\">15 years of experience </strong>using Microsoft Excel, I'll let you look over my shoulder as I teach you the fundamentals.</li>  \t<li style=\"\">I'll show you exactly how to master this technique in a <strong style=\"\">fraction of the time </strong>it takes the average person to learn on their own from books, YouTube videos, blogs and forums!</li>  \t<li style=\"\">By mastering this technique you'll become the <strong style=\"\">most productive and most efficient person at your job and at home!</strong></li>  \t<li style=\"\"><strong style=\"\">New doors and opportunities </strong>will begin opening up for you personally and professional with each new technique you acquire!</li>  </ol>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Click the “TAKE THIS COURSE\" button, top right, NOW!!...every hour you delay you're missing out on huge opportunities!!</strong></em>  </p>", 
    "end_date": null, 
    "title": "Maximize Your Excel Productivity To Save Time", 
    "price": 0, 
    "instructors": "Jed Guinto", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387430_2ac0_2.jpg", 
    "course_url": "https://www.udemy.com/30-minute-excel-productivity-secrets/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T06:13:21Z"
}