{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Attraverso questi video sull’utilizzo di Microsoft Excel 2010, ci si propone di guidare gli utenti in un percorso di apprendimento dell’utilizzo di una delle ultime versione del foglio di calcolo di Excel.</strong>  </p>  <p style=\"\">  \t  In questo corso, infatti, avrai la possibilità di apprendere le differenti funzionalità dello strumento, osservando i video in cui vengono eseguite e spiegate le differenti funzioni di Excel, passo per passo.  </p>  <p style=\"\">  \t<strong style=\"\">Il corso ti condurrà, passo dopo passo, nel processo di apprendimento di Microsoft Excel 2010: la presentazione del programma inizia con l’indicazione delle attività di base dove ti verrà indicato come procedere per creare il tuo primo foglio di lavoro . </strong>  </p>  <p style=\"\">  \t  L’apprendimento sarà di tipo graduale e verranno presentate step by step le potenzialità del software .  </p>  <p style=\"\">  \t<strong style=\"\">Imparerete non solo le funzioni base, ma anche quelle più avanzate, vedrete come usare Excel sia per l’attuazione di computazioni, che per la realizzazione di grafici e la gestione dei database.</strong>  </p>  <p style=\"\">  \t  A seguire la struttura, nel dettaglio, del corso  che andrete a seguire. Inizierete da una prima visione delle lezioni e poi vi eserciterete ripetendole. Ogni lezione ha un titolo specifico (relativo al contenuto della stessa). Per iniziare basta fare clic sulla lezione e seguire il corso. Puoi seguire i vostri progressi anche qui .  </p>  <p style=\"\">  \t  Sono lieto di avere l&#039;opportunità di aiutarvi a raggiungere i vostri obiettivi. <strong style=\"\">Se avete domande o dubbi non esitare a mandarmi un messaggio .</strong>  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2010 (Italiano - per principianti/avanzati) ", 
    "price": "30.00", 
    "instructors": "Christian Tiessen", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/165664_c631_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2010-formazione-per-principiantiavanzati/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-17T12:19:51Z"
}