{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><em>Do you want to learn how to work with Excel 2016?</em></strong></p>\n\n<p><strong><em>Even if you don’t have any prior experience?</em></strong></p>\n\n<p><strong><em>Would you like to take your skills to the next level and become an advanced user?</em></strong></p>\n\n<p><strong><em>If so, then this is the right course for you!</em></strong><strong><em></em></strong></p>\n\n<p><em>+++ A Personal Certificate of Completion is presented to all students who complete this Excel 2016 training course+++</em></p>\n\n<p>Microsoft Excel 2016 is here, and it promises to be one of the greatest versions that we’ve seen so far. It includes a number of great new features, while all of the old ones are still in place and much improved.</p>\n\n<p>However, it’s essential that you learn how to work with it effectively.</p>\n\n<p>If you want to become any of the following…</p>\n\n<ul><li>Executive Assistant</li><li>Office Clerk</li><li>Auditor</li><li>Accountant</li><li>Business Analyst</li><li>Financial Analyst</li><li>Credit Counselor</li><li>Sales Representative</li><li>Sales Manager</li><li>Financial Manager</li><li>Investment Banker</li><li>Real Estate Agent</li><li>Market Research Analyst</li><li>Financial Advisor</li><li>Business Operations Manager </li><li>Entrepreneur  </li><li>Someone who is involved with a business and would like to be successful</li></ul>\n\n<p>Then you simply have to learn Microsoft Excel 2016. There is no way around it.</p>\n\n<p>But how can you do that if you have very limited time and no prior training? And how can you be certain that you are not missing an important piece of the puzzle?</p>\n\n<p><strong>Microsoft Excel 2016 Beginners &amp; Intermediate Excel Training </strong>is here for you<strong>. </strong>One of the best Excel courses available on Udemy, it includes everything you’ll need. We will start from the very basics and then gradually build a solid foundation that will serve you well throughout your career.</p>\n\n<p>What makes this course different from the rest of the Excel courses out there?</p>\n\n<ul><li>High quality of production – HD video and animated slides (this isn’t a collection of boring lectures!)</li><li>Knowledgeable instructor (experience in Big 4 Accounting + Commercial Finance)</li><li>Downloadable materials: The course comes with a complete set of downloadable materials (handouts, Excel files, etc.)</li><li>Extensive Case Studies that will help you reinforce everything that you’ve learned</li><li>Excellent support: If you don’t understand a concept or you simply want to drop us a line, you’ll receive an answer within 24 hours</li><li>Dynamic: We don’t want to waste your time! The instructor maintains a very good pace throughout the whole course</li><li>Bonus prizes: Upon completion of 50% and 100% of the course you will receive two bonus gifts   </li></ul>\n\n<p>How come Microsoft Excel is so important?</p>\n\n<p>Every large company uses it, right? So if you want to learn a new skill that is highly valued by all employers, you should start here.</p>\n\n<p>Here are 5 more reasons why you should take this course and learn Excel:</p>\n\n<ul><li>Jobs. A solid understanding of Excel opens the door for a number of career paths</li><li>Promotions. Top Excel users are promoted very easily inside large corporations</li><li>Bill Gates knows how to work with Excel</li><li>Secure Future. Excel skills remain with you and provide extra security. You won’t ever have to fear unemployment</li><li>Girls dig guys who are proficient in Excel! Guys who can use VLOOKUP are proven to be the most popular with women J</li></ul>\n\n<p>This course is suitable for people without any previous experience in Excel. We will start from the very basics and will gradually move on to some of the more advanced features, such as lookup functions, functions with conditions, goal seek, pivot tables, custom formatting, Excel 2016 charts, and other tools that are often used for the purposes of Financial Modeling.</p>\n\n<p>Additionally, the course includes practical case studies that will reinforce everything that you learn. One of the exercises that we will see in the course consists of building a complete Profit &amp; Loss statement from scratch. </p>\n\n<p>This course is perfect for University students, Entry-level Finance, Business and Marketing professionals who would like to grow faster than their peers.</p>\n\n<p>++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>Students of this course who complete 50% of the lessons get full, lifetime access to our five-star rated course “Beginner to Pro in PowerPoint: Complete PowerPoint Training”. It has a full price of $20.</p>\n\n<p>++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>Students of this course who complete 100% of the lessons get full, lifetime access to our five-star rated course “Finance 101: Financial Skills for the Real World”. It has a full price of $20.</p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>Please don’t forget that the course comes with Udemy’s 30-day unconditional money-back-in-full guarantee. And why not give such a guarantee, when we are convinced that it will provide a ton of value for you?</p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2016 Beginners & Intermediate Excel Training", 
    "price": "20.00", 
    "instructors": "365 Careers", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659464_92c2_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2016-beginners-intermediate-excel-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T22:55:07Z"
}