{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<h5>A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p>In this hands-on Microsoft Word 2011 for Mac course from InfiniteSkills, you&#039;ll get a fast and effective guide to the world&#039;s most widely used word processing tool. Whether you&#039;re writing a business letter, a term paper or doing a complete documentation project with a table of contents and footnotes, you&#039;ll find a host of practical tips and walkthroughs to get you started. These Apple-friendly tutorial videos show you how to turn your computer into the ultimate productivity machine, working with MS Word on its own and in conjunction with other Office tools as needed. The Word tutorials start simple. Beginning with a basic letter, you learn about setting up your document based on the project&#039;s needs. You will learn about inserting date and time, spell checking, and saving your document safely every time. You will then move on to creating a mail merges and a full email campaign, creating a manual, and even building your own templates. Throughout this impressive course, you will learn about formatting your document, inserting Table of Contents, adding images, styling text, and much, much more.</p>  <p><br style=\"\" /> <strong style=\"\">What You Will Learn</strong><br style=\"\" /> <br style=\"\" /> - How to create professional quality letters, manuals and presentation-ready documents with one of the world&#039;s leading office productivity tools.<br style=\"\" /> - How to manipulate and implement text and data within complex projects and workflows, including marketing and email campaigns.<br style=\"\" /> - How to create fully compatible documents and projects that can be accessed by users working with Office for Mac products as well as Windows counterparts.</p>  <p><br style=\"\" /> <strong style=\"\">Who Should Take This Course</strong></p>  <p>- Anyone who has used Microsoft Word in the past but wanted a better understanding of its full range of features.<br style=\"\" /> - Anyone who needs an understanding of Microsoft Office software as it applies to a professional work or academic environment.<br style=\"\" /> - Anyone Mac user new to MS Word wanting a user-friendly guide that introduces the program from the ground up.</p>  <p><br style=\"\" /> <strong style=\"\">What People Are Saying</strong></p>  <p>&quot;Everyone knows Word? Think again. This video series, however, helped me get the rest of my Mac-centric office up to speed. Solid training at a more than fair price.&quot;<br style=\"\" /> - MK Winterson<br style=\"\" /> <br style=\"\" /> &quot;Very very easy to follow videos. My document skills are so much better I can&#039;t wait for the rest of the office tutorials.&quot;<br style=\"\" /> - Fernando Diaz</p>", 
    "end_date": null, 
    "title": "Microsoft Word 2011 for Mac Tutorial", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17244_2783_9.jpg", 
    "course_url": "https://www.udemy.com/learning-microsoft-word-2011-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-04T16:42:40Z"
}