{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>In this Microsoft Office essential skills course I share with you the real-life skills people need to get the best from the software in the workplace, gathered over many years as a Microsoft Certified Trainer. By taking this course you will be able to:</p> <ul style=\"\"><li>Confidently use the core Microsoft Office programs in the workplace</li> <li>Learn the skills employers expect you to have in Word, Outlook, Excel and PowerPoint</li> <li>Apply best practices to your work</li> <li>Achieve confidence and job satisfaction through practice</li></ul> <p><strong style=\"\">Who should take this course? </strong></p> <ul style=\"\"><li>You should take this course if you use Microsoft Office at work but have never been trained</li> <li>Anyone who wants to become more confident, achieve progression at work or find a new job</li> <li>Anyone who wants to update their skills if returning to work after a career break</li></ul><strong style=\"\">Who should not?</strong><strong style=\"\"></strong><ul style=\"\"> <li>This course is not intended as a comprehensive guide to Microsoft Office, it is intended to teach the essential skills employers look for</li> <li>It does not cover advanced topics but does cover all you need to get started plus lots of cool shortcuts to make your day fly by</li></ul> <p><strong style=\"\">What will students need to know or do before starting this course?</strong></p> <ul style=\"\"><li>This course requires no previous knowledge, but assumes that students will have access to a PC and a copy of Office 2010 or later. </li> <li>Most of the principles can also be applied to Office 2007 and to Office 2013, but as the 2010 version is the most commonly used, this is the version I have chosen for the tutorials.</li> <li>When appropriate, the <strong style=\"\">actual files used in the tutorial </strong>are provided for practice and I encourage students to download them and follow along. </li><li>You will learn faster and be more confident when you try it yourself!</li></ul>", 
    "end_date": null, 
    "title": "Microsoft Office Essential Skills", 
    "price": "20.00", 
    "instructors": "David Millard", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446522_71e7_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-office-essential-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T13:36:43Z"
}