{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Want to Take Your Presentation Slides to a Whole New Level?</strong></p><p>You may think you know <em style=\"\">Microsoft PowerPoint 2013</em>, but you don&#039;t know jack if you don&#039;t how to use advanced animation to bring your boring static slides to life.</p><p>Your <em style=\"\">PowerPoint </em>slides may be information packed but may also lack visual impact if you&#039;re not familiar with the use of shapes, word art and smart art.</p><p>You&#039;re presentations are going to collect dust on your computer  if you don&#039;t learn how to produce them and share them on the Internet.</p><p><strong style=\"\">Hi, My Name is Brian, and I&#039;d Like to Teach you Microsoft PowerPoint 2013</strong></p><p>We&#039;ll begin by reviewing a set of orientation lectures that will familiarize you with the <em style=\"\">Microsoft PowerPoint 2013</em> window and screen layout.</p><p>Next we&#039;ll cover the basics of PowerPoint in which you&#039;ll learn to create simple, bulletted item based presentations.</p><p>Then we&#039;ll learn to insert visual elements into your presentations to add impact and help convey your message.</p><p>Finally, we&#039;ll look into advanced animation techniques and how you can record and share your finished presentations on the Internet.</p><p><strong style=\"\">If You&#039;re Finally Ready to Learn Microsoft PowerPoint 2013, I&#039;m Prepared to Teach You</strong></p><p>In this course you&#039;ll learn everything you need to know to use Microsoft PowerPoint 2013 like a professional. I&#039;ll teach you the basics from the ground up, spice things up with some intermediate additions, and finish things off with advanced automation and presentation production techniques. This course provides complete <em style=\"\">Microsoft PowerPoint 2013</em> from beginner through advanced training.</p><p>You&#039;ll learn the basics:</p><ul style=\"\"><li style=\"\">PowerPoint Window and Screen Layout</li><li style=\"\">Creating and Saving Presentations</li><li style=\"\">Inserting, Deleting and Moving Slides</li><li style=\"\">Editing Slide Contents</li><li style=\"\">Configuring Slide Transitions</li><li style=\"\">Adding Simple Automation</li></ul><p>Then we&#039;ll add some intermediate flourishes:</p><ul style=\"\"><li style=\"\">Insert pictures, text boxes, shapes, smart art, tables, charts and graphs</li></ul><p>Finally, we&#039;ll finish the course off with some advanced topics</p><ul style=\"\"><li style=\"\">Advanced Automation</li><li style=\"\">Advanced Presentation Production</li></ul><p><strong style=\"\">Why Not Check Out the Course and See What You&#039;ve Been Missing?</strong></p><p><em style=\"\">PowerPoint </em>mastery is just a click away.  Why not give yourself the gift of knowledge and come learn with me today?</p><p>Don&#039;t forget Udemy&#039;s 30 day no questions asked money back guarantee.</p><p>P.S. The course includes four downloadable sample <em style=\"\">Microsoft PowerPoint 2013</em> presentations including the slides for the course&#039;s overview and promotional video.</p><p>So, what are you waiting for?  Let&#039;s get started today.</p>", 
    "end_date": null, 
    "title": "Microsoft PowerPoint 2013 Beginner Through Advanced Training", 
    "price": "20.00", 
    "instructors": "Author/Publisher Brian Jackson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/454144_dcaf_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-powerpoint-2013-beginner-through-advanced-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-22T21:11:01Z"
}