{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t        Sign up for this Excel course and learn Excel Charts in an easy and comfortable way!  </p>  <p style=\"\">  \t        A picture is worth a thousand words! In Excel, such picture is a chart. An Excel chart is what makes the data in your spreadsheet useful and powerful. It provides actionable information and communicates what is important. Try to explain something verbally, and then try to present it with an Excel chart. Feel the difference? An Excel chart presents data in such a way that clarifies everything and drives the point home. When you are comfortable with Excel charts, you are comfortable with Excel data. Excel charts allow you to create eureka moments based on dry numbers that you have in your spreadsheet.  </p>  <p style=\"\">  \t        This Excel course is your Excel charts tutorial. When you take it, you will quickly learn how to create Excel charts and graphs. You will create every single Excel chart type. After you enroll and complete this course, you will be proficient in all kinds of charts in Excel: Bar Charts, Column Charts, Line Charts, Pie Charts, Area Charts, X Y Scatter Charts, Bubble Charts, as well as the somewhat esoteric Surface Charts, Radar Charts, Stock Charts, You will be able not only to create these charts in Excel, but also to format them quickly and easily. You will become comfortable working with complex Excel chart data ranges and learn how to work with and fully control the Excel chart data series. You will be proficient with every single Excel chart element, such as Excel chart title, Excel chart axis label, chart data table, data labels and all the others. You will be able to create combination charts, and charts with two Y-axes. You will understand why and where one needs a secondary axis in Excel charts. In other words, you will significantly improve your skills in Excel charts by taking this easy-to-follow course.  </p>  <p style=\"\">  \t        During the course you will watch high-quality video lectures on various Excel charts topics and follow the instructor, working on the same files that are used in demonstrations. Gradually, but very quickly you will begin to realize that you are getting more and more comfortable with charts and get to understand them better and better.  </p>  <p style=\"\">  \t        This course is designed not only to inform, show, and tell but also to help you quickly develop powerful skills in Excel charts.  </p>  <p style=\"\">  \t        During lectures in this Excel charts course, we will be using Microsoft Excel 2013.  </p>  <p style=\"\">  \t        This Excel course is one of the Easy Excel With Igor series.  The other  high quality Excel tutorials include:  </p>  <p style=\"\">  \t    &quot;Microsoft Excel Without Pain&quot; that helps you quickly build your foundation skills in Excel;  </p>  <p style=\"\">  \t    &quot;Data Manipulation In Excel&quot;  allowing you to save up to 90% of time when using Excel for certain data  management tasks;  </p>  <p style=\"\">  \t      &quot;Excel Conditional Formatting Master Class&quot; where you  can  learn how to improve your spreadsheets using conditional formatting  in  Excel;  </p>  <p style=\"\">  \t  &quot;Excel Pivot Tables Data Analysis Master Class&quot; that takes you  step by step to mastering pivot tables data crunching skills.  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel Charts Master Class", 
    "price": "45.00", 
    "instructors": "Igor Ovchinnikov", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208340_b667_3.jpg", 
    "course_url": "https://www.udemy.com/easy-excel-charts-with-igor/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-30T21:28:07Z"
}