{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t     Word processing skills are an essential tool for any job.  This course is for the person who ‘knows nothing’ about word processing, but would like to enter the job market as well as the Administrative Assistant currently on the job.  The only prerequisites required are that you need prior knowledge of the conventions of Microsoft Windows. The video modules are interactive, you can work right along with the video.  You cannot learn a hands-on product, unless you ‘use’ that product.  I encourage you to work interactively with the videos for optimum learning.  The course is broken down into nineteen sections, with sixty-two lectures.  Supplemental materials are also available to further enhance your understanding.  Skill building exercises are used to evaluate your knowledge.  I am a hands-on professor who is willing to work with you and answer all of your questions.  I feel student-to-instructor interaction is essential to learning. We will cover character, paragraph and document formatting.  Also included will be tabs and tables, and much more.  Upon completing this course, you will be proficient in Microsoft Word 2013.  Other videos claim to make you ‘experts’.  The level to which you learn is up to you.  You will have all of the tools that will either improve your current position or it will get you that job. Other features covered are embedding and linking objects and even merging a Word document from an Access document. (that one is really fun!)  Every section begins with an introduction as to what is covered in the section.  Then each lecture is individualized to one specific task.  And finally, there is a review of what we covered.  The total class time for the entire course is six hours and 14 minutes.  The course is asynchronous, you work at your own pace, on your own time.  </p>", 
    "end_date": null, 
    "title": "Microsoft Word 2013 for Administrative Assistants", 
    "price": "20.00", 
    "instructors": "Therese D. O'Neil, M.Ed.", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238086_cd99_9.jpg", 
    "course_url": "https://www.udemy.com/microsoft-word-2013-for-administrative-assistants/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-05T23:49:45Z"
}