{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Learn to Build a Detailed Project Plan that is Fully Linked, Fully Resourced and Fully Costed in MICROSOFT PROJECT so you can build Robust Project Programs that Lead your Projects to Success.</strong></p><p style=\"\">You will receive a Step by Step “Practical Workout&quot; in building a project program from <strong style=\"\">ground up </strong>so you can apply your skills immediately and Understand how a project schedule should look and operate. </p><ul style=\"\"><li style=\"\">Get Clear Concise Steps - Straight to the Point - without the waffle.</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\">I&#039;ll show you a systematic process of building a project plan that maximizes the potential of Microsoft Project and helps you streamline the day to day running of the project. </p><p style=\"\">This training is suitable for Beginners through to Experienced users of Microsoft Project who want to gain more out of the software. I&#039;ll illustrate my <strong style=\"\">approach</strong> of building a detailed project plan that leads to maximum functionality of Microsoft Project. This approach works for any project of any size in any industry.<br style=\"\"></p><p style=\"\"><strong style=\"\">The Practical Workout</strong></p><p style=\"\">We start from a blank project and work through a step-by-step approach to building a Gantt Chart (a visual timeline that is logically linked). I&#039;ll point out ways to utilize the features in Microsoft Project to increase your fluency with the software. </p><p style=\"\">By the end of the course, you will have a functional project plan with skills that can be applied immediately. You will have the knowledge to :-</p><ol style=\"\"><li style=\"\">Build a detailed project plan<ul style=\"\"><li style=\"\">Fully Linked</li><li style=\"\">Fully Resourced</li><li style=\"\">Fully Costed<span></span></li></ul></li><li style=\"\"><span></span>Extract the information you need from your plan to help you manage your project. Including:-</li></ol><ul style=\"\"><ul style=\"\"><li style=\"\">How Long the project takes </li><li style=\"\">How Much the project costs</li><li style=\"\">Know when your team are required and what they are doing</li><li style=\"\">Extract their work packages</li><li style=\"\">Use the tool to Communicate your plan clearly to team members</li><li style=\"\">Align the Client and the team with project expectations</li><li style=\"\">Look Ahead at Upcoming Work</li></ul></ul><p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p style=\"\"><strong style=\"\">Stand out from the crowd</strong> and you start using Microsoft Project like a professional!</p>", 
    "end_date": null, 
    "title": "Microsoft Project : How to Build a Detailed Project Plan", 
    "price": "20.00", 
    "instructors": "Brett Anderson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609160_4416.jpg", 
    "course_url": "https://www.udemy.com/microsoft-project-how-to-build-a-detailed-project-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T14:55:11Z"
}