{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Welcome To Microsoft Access 2016 Master Class: Beginner To Advanced</strong></p>\n\n<p><strong></strong><strong>⇉ Watch the promo video </strong>to see How You Can Begin Mastering Microsoft Access 2016!</p>\n\n\n\n\n\n<p><strong>⇉ This Course is MASSIVE! </strong>You receive over<strong> 7+ hours of video</strong> content &amp; <strong>80</strong><strong>+ lectures!</strong></p>\n\n\n\n\n\n\n\n<p><strong>⇉ Join Over 100,000+</strong> <strong>Students</strong> Who Have Enrolled In My Udemy Courses This Year!</p>\n\n\n\n\n\n\n\n<p><strong>⇉ 3000+ Five Star Reviews Shows</strong> Students Who Enrolling Are Getting Real Results!</p>\n\n\n\n\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n\n\n<p>Every one of us, whether we know it or not, are surrounded by data.  Some of it we keep track of on paper or in spreadsheets.  Some of it is really important, like tasks that are part of our daily work.  BUT, unfortunately, very few of us use the one tool that was built to handle all of our data needs - the Microsoft Access database.<br></p>\n\n\n\n\n\n\n\n<p>Should you take the time to learn Microsoft Access?  <br></p>\n\n\n\n\n\n\n\n\n\n<p>Many people do not use the Microsoft Access database program for 2 reasons:<br>   1. They think it is too complex<br>   2. They do not realize how incredibly powerful it is.<br><br>This course is dedicated to resolving the complexity question by demonstrating the basics of HOW Access is constructed and why the structure makes sense.  Most courses just bury students in details, never starting with an overview and never showing students how the different parts can be used to increase productivity.  By the time you have finished the first sections of the course, you will understand WHY Access is built the way it is and feel comfortable moving around in the program.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Once you understand the basic structure, the course will show you many practical demonstrations of what Access can be used for.  By the end of the course you will have a very good idea EXACTLY how you could use Access to increase your productivity.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You will see demonstrations of many tasks that are easy to do with Access, but difficult or impossible to do with Excel.\nThis is not to say that Excel is not an excellent program.  It is\na wonderful program and we use it every day, but it is not a database. The best of both worlds is to use both programs together!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>So, while this course will provide you with a lot of information on the parts of Access and how they work, the overall objective is to provide you with enough information to decide if Access is right for you and how you might use it.  At that point, the more detailed courses that are available will make much more sense and you will be able to go through them with a specific sense of purpose.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Learn about <strong class=\"redactor-inline-converted\">Access Objects </strong>and how they work together.  Learn how the screen is organized and become very comfortable with moving around inside the various parts of the program.  Understand how Access makes dealing with many settings and choices as easy as possible.   More than XX Lectures and XX Hours of content that will make you comfortable with Access!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Build a Strong Foundation in Microsoft Access!</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Understand the structure of the database file and its advantages.</li><li>Become comfortable with how the menus and ribbons work.</li><li>Learn how you can save all your data in one place.</li><li>Learn how to extract only the information you want.</li><li>See how to relate tables together and resolve the \"1 to Many\" problem.</li><li>Discover how having separate report formats reduces report prep time.</li><li>Learn how to easily create subtotals and do calculations.</li><li>See how you can link data back to Excel sheets for distribution.</li><li>View demonstrations of how Macros can be used to automate tasks.</li><li>See examples of how the VBA Programming Language can be used.</li><li>Learn how Access can work with Other Microsoft Office programs.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Powerful Skills That Increase Your Value in the Marketplace</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will move Microsoft Access into your \"comfort zone\" so you can plan what parts of the program you want to learn in detail and what you want to achieve.  This method makes much more sense than just starting a comprehensive course on Access without any clear idea of how the program works or what it could possible do for you.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You will find that people who know how to use the <strong>incredible power</strong> of Access are in <strong class=\"redactor-inline-converted\">high demand</strong> in the marketplace. The familiarity with Access that you gain in this course will give you a solid foundation in creating databases that will make your life easier and be in demand by others!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>There is a <strong class=\"redactor-inline-converted\">HUGE need in the marketplace</strong> for people who know how to use Access. This is your opportunity to <em>break away from the pack</em> of people who struggle to get their work done using only Excel.  Stop being a slave to your spreadsheets and start learning how to create effective Access databases and easily automate tasks! This could be your shortest path to <strong class=\"redactor-inline-converted\">increasing your income!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Content and Overview</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>To take this course, you do not need any background with Access and this course does <strong class=\"redactor-inline-converted\">not</strong> require any programming experience or knowledge of macros.  Even if you do not currently use Excel, you should have no problem being successful with the course.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Even though there are 67<strong class=\"redactor-inline-converted\"> lectures</strong> and <strong class=\"redactor-inline-converted\">over SEVEN HOURS of content</strong>, each section focuses on <em>one set of concepts</em> so it is easy to do one section at a time, when your schedule allows.  You will find that each chapter builds on what you learned in the previous ones and your knowledge will grow, step by step, throughout the course.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>By the time you have finished the course you will have moved around within Access so much and manipulated the objects in Access so many times, that the program will be very familiar to you and you will be ready to build a database for your tasks <em>immediately</em>, This will put your new learned skills into practical use and <strong class=\"redactor-inline-converted\">impress your boss and coworkers</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course is <strong class=\"redactor-inline-converted\">complete with working files that contain all the demonstrations and sample objects</strong> for everything that is covered. You will be able to work alongside the author as you work through each lecture and will receive a verifiable certificate of completion upon finishing the course.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Clicking the <strong class=\"redactor-inline-converted\">Take This Course</strong> button could be the best step you could take towards quickly increasing your income! Also, remember that if you don't think the course is worth what you spent, you have a full 30 days to get a no questions asked refund!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Required Software</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You should have Office 2010 or later. The course was created using Office 2016.</p>\n\n\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards mastering Microsoft Access 2016 <br></p>\n\n\n\n\n\n\n\n<p><strong>When we learn something new,</strong> I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n\n\n\n\n<p>In addition to the <strong>Udemy</strong> <strong>30-day money back guarantee</strong>, you have my personal guarantee that you will love what you learn in this course. If you ever have any questions please feel free to message us directly and we will do our best to get back to you as soon as possible!</p>\n\n\n\n\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em></p>\n\n\n\n\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n\n\n\n\n<p>This course will not remain this price forever! It's time to take action!</p>\n\n\n\n\n\n\n\n<p><strong>Click the \"take this course\" button at the top right now!</strong></p>\n\n\n\n\n\n\n\n<p>...<em>every hour you delay is costing you money</em>...</p>\n\n\n\n\n\n\n\n<p>See you in the course!</p>\n\n\n\n\n\n\n\n<p><strong>Sincerely,</strong></p>\n\n\n\n\n\n\n\n<p><strong>Bruce Myron &amp; Joe Parys </strong></p>", 
    "end_date": null, 
    "title": "Microsoft Access 2016 Master Class: Beginner to Advanced", 
    "price": "50.00", 
    "instructors": "Joe Parys, Bruce Myron", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/845284_cfd2_2.jpg", 
    "course_url": "https://www.udemy.com/microsoftaccess/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-10T19:14:33Z"
}