{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">To know how to work with Outlook is both necessary and important in everyday life.</strong> </p><p>Microsoft Office Outlook 2013 is an email client and personal information manager to coordinate meetings, calendars, shared mailboxes, and folders. SONIC&#039;s training videos teach you how to create an email account, add a contact, produce tasks, schedule an appointment, how to insert a written signature into an email, and much more.</p><p>In this course you will learn how to successfully use Outlook to manage the numerous aspects of communicating electronically, including:</p><ul style=\"\"><li>Managing email communications. </li><li>Managing calendar events. </li><li>Managing your contacts.</li><li>Using notes to keep yourself informed.</li><li>Sending and receiving Invites.</li><li>Performing advanced message, calendar, and contacts management tasks. </li><li>Working with the Tasks and Journal workspaces.</li><li>Sharing your workspaces with others using Outlook data files to save and back up your Outlook items.</li></ul><p>Our instructor will explain all of the features and functionalities the application offers in an easy to understand, step-by-step method. The videos have been designed for both first-time users with fundamental Outlook 2013 problems and advanced users with specific Outlook 2013 problems. </p><p>At the end of each lesson, check what you&#039;ve learned with our quizzes. </p>", 
    "end_date": null, 
    "title": "Microsoft Outlook 2013: Beginner to Advanced", 
    "price": "30.00", 
    "instructors": "SONIC - High Quality Training for Over 20 Years", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/459600_eadf.jpg", 
    "course_url": "https://www.udemy.com/microsoft-outlook-2013-beginner-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-26T11:30:53Z"
}