{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>現場ではまだまだ現役のOffice 2010。ビジネスパーソンに必須のWord,Excel,PowerPointの基本的にして標準的な使い方を習得できるお得なパックです。<br></p><p><br></p><p>●Microsoft Word 2010<br>--------------------------------<br>Microsoft Word 2010の基本的な使い方がわかります。文字や文章の入力、表や図形を使った文書作成の方法が分かるようになります。</p>\n\n<ul><li>前半セクションでは、文字や文章の入力を中心に、Microsoft Word 2010の基本機能がわかります。Wordの起動方法と、画面構成にはじまり、Office2010の特長であるBackstageビューの役割がわかります。日本語の入力機能の基本操作と、入力した文字に対する、基本的な編集機能がわかります。また、段落に対して設定する編集機能を使い、文書を作成する方法もわかります。</li><li>後半セクションでは、表や図形を使った文書作成の方法がわかります。文書に表を挿入して、その表に罫線を設定したり、カラフルなデザインを設定したりする方法がわかります。また、作成した表とその中に入力されたデータを元にグラフを作成したり、図形や写真などの挿入方法がわかります。そして、効率的に組織図や見栄えの良い図表を作成できるスマートアートの使い方や、用意された様々なテンプレートの利用方法についてもわかります。</li></ul>\n\n\n\n<p>--------------------------------</p>\n\n\n\n<p>●Microsoft Excel 2010<br>--------------------------------<br>初めてExcel 2010を利用される方を対象に、Excelの基本操作から、表やグラフの作成、印刷などの方法を、基本からわかりやすく解説しています。後半は、Excelで最も重要な表計算機能を中心に解説しています。</p>\n\n\n\n<ul><li>前半セクションでは、Excelの起動方法や、終了方法などの基本操作、画面を構成する要素の名称や働きがわかります。文字や数値の入力方法や、編集方法、そして作成したデータの保存方法など、ブックを作成する上での基本操作がわかります。また、シート名の設定や、シートのコピーといったワークシートの基本操作もわかります。そしてセルの書式設定がわかります。フォントや表示形式など、様々な設定がわかります。</li><li>後半セクションでは、Excelで最も重要な表計算機能がわかります。セルへの数式の入力方法にはじまり、関数を使って、効率的に計算を実行する方法がわかります。最大値や最小値、順位や桁の表示を制御するものなど、様々な関数がわかります。また、実務上大変良く利用されるIF関数の使い方が、関数を入れ子で利用する方法とともにわかります。そして、大量のデータを効率的に入力できるVLOOKUP関数もわかります。</li></ul>\n\n\n\n<p>--------------------------------</p>\n\n\n\n<p>●Microsoft PowerPoint 2010<br>--------------------------------<br>初めてPowerPoint 2010を利用される方でも、画面構成や基本機能と操作がわかります。スライドへのアニメーションの設定や、切り替え効果の設定など、よりプレゼンテーションの表現力を高める方法についてもわかります。</p>\n\n\n\n<ul><li>前半セクションでは、初めてPowerPoint 2010を利用される方でも、画面構成や基本機能と操作がわかります。具体的には、PowerPointの起動や終了などの基本操作や、画面の構成にはじまり、新しいプレゼンテーションを「テンプレート」や「テーマ」を使って効率的に作成する方法がわかります。様々なオブジェクト（オートシェイプやクリップアート）をスライドに挿入したり、手際良く分かりやすい図表の作り方がわかります。また、スライド一覧表示モードなどを使って、作成したプレゼンテーションの編集、修正をする方法がわかります。スライドに棒グラフや円グラフを追加する方法もわかります。さらに、スライドショーの操作と、スライドショー形式での保存方法、スライドショーのビデオ書き出しについてもわかります。</li><li>後半セクションでは、スライドへのアニメーションの設定や、切り替え効果の設定など、よりプレゼンテーションの表現力を高める方法についてわかります。具体的には、スライドにアニメーションを適用し、基本的な設定をして、図表やグラフにアニメーションを設定することができるようになります。また、スライドを切り替える際に、様々な画面切り替えの効果についてわかります。スライドをグループ化して効率的に管理する方法もわかります。プレゼンテーション全体のデザインを変更する方法がわかります。さらに、スライドショーの記録や配布資料の作成などプレゼンテーションの準備の仕方や、スライドショー実行中に投影スライドに文字や矢印などを書きこんだりできるようになります。スライドショーをブロードキャストして、参加者がWebブラウザーでリアルタイムに見られるようにする方法もわかります。</li></ul>\n\n\n\n<p>--------------------------------</p>\n\n\n\n<p>映像内と同じ演習ファイルがダウンロードできます。映像を見ながら、あるいは視聴後に、実際のアプリケーションでの実習に使用します。</p>\n\n\n\n<p>ナレーション音声をそのまま文字に起こし、映像の要所のスクリーンショットが貼ってある副読本もダウンロードできます。是非復習に活用してください。</p>", 
    "end_date": null, 
    "title": "Microsoft Office 2010（Word、Excel、PowerPoint）習得パック", 
    "price": "40.00", 
    "instructors": "アテイン 株式会社", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801566_b20b.jpg", 
    "course_url": "https://www.udemy.com/microsoft-office-2010-word-excel-ppt/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T03:24:40Z"
}