{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t   This course is taught by a professional corporate trainer in a friendly, step by step method so that you can follow along and do the steps with the instructor.  If you prefer to watch and listen, that works great too!  </p>  <p style=\"\">  \t   This course is designed to give you complete confidence in your knowledge of Excel.  You will learn core features that you will use and build on throughout the course as we increase our knowledge of key features.  </p>  <p style=\"\">  \t   We start with a blank workbook and will build out multiple sheets from entering values to calculations and functions, all the way to building charts and updating data series.  </p>  <p style=\"\">  \t   This course is titled Beginning Excel but actually covers intermediate topics, too!  </p>  <p style=\"\">  \t<strong style=\"\"> Can you answer these questions?</strong>  </p>  <p style=\"\">  \t   1.  What is the difference between workbooks, spreadsheets, templates, sheets, file?  </p>  <p style=\"\">  \t   2.  What is the difference between labels and values and why is that important?  </p>  <p style=\"\">  \t 3.  Can you confidently use and modify calculations and average, sum, min and max formulas?  </p>  <p style=\"\">  \t   5.  When should you convert your data to a table range and what are the pro&#039;s and con&#039;s?  </p>  <p style=\"\">  \t   6.  How do I sort and filter my data by multiple criteria?  </p>  <p style=\"\">  \t   7.  How do I add a series to a data range and have a chart automatically update?  </p>  <p style=\"\">  \t   If you answered &quot;no&quot; to any of these questions, then this course is for you!  </p>  <p style=\"\">  \t   We will answer all of these questions and much more!  </p>  <p style=\"\">  \t   Come on in and join us!  We look forward to having you!  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel for Mac 2011 - Beginning", 
    "price": "25.00", 
    "instructors": "Francie Black", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/182248_2be8_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-for-mac-2011-beginning/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-14T03:10:49Z"
}