{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<h5>About the class:</h5>  <p>  \t This is a combined certificate training of Microsoft Excel and Microsoft Powerpoint. This training encompasses all the training from \"Microsoft Excel Training With Certificate\" and \"Microsoft Powerpoint Training with Certificate\". This is an online video training class. The best way to benefit from this class is to view all the lectures in full screen and sit through all the lectures at least once. All lectures are video lectures.  </p>  <h5>What is Microsoft Powerpoint?</h5>  <p>  \t Microsoft Powerpoint is a software that is used for making presentations. This class teaches how to make a Microsoft Powerpoint Presentation. Microsoft Powerpoint is the most commonly used software for the creation of presentations. Knowing how to make a presentation is very valuable in the communication of ideas. Corporations around the World rely on Microsoft Powerpoint for communicating their ideas and messages to mass audiences. At the core of every international meeting lies a Powerpoint Presentation. This class teaches you how to think in Powerpoint. The ability to communicate your ideas to the World is your greatest asset. We are here to show the tools you have access to for achieving this goal.  </p>  <h5>Why learn Microsoft Powerpoint?</h5>  <p>  \t There will be many circumstances throughout your career and personal life when you will have to educate an audience or communicate a message in a formalized manner. Powerpoint is the tool that will allow you to achieve this goal. Powerpoint can be used for communicating ideas of all levels of complexity. It is very commonly utilized by University Professors, Executives and heads of states to make presentations. Whatever your goal may be, knowing Powerpoint will help you achieve your goal.  </p>  <h5>Who is this class for?</h5>  <p>  \t This is a beginner and intermediate level class.  </p>  <h5>Topics covered in class?</h5>  <p>  \t Interface components of Powerpoint are covered. Sample presentations are made to show the functionality of Powerpoint. The features of Powerpoint are implemented on these sample presentations. Most commonly used features of Power Point are highlighted and visited several times throughout the class.  </p>  <h5>~~~~~~~~~~</h5>  <h5>What is Microsoft Excel?</h5>  <p>  \t Microsoft excel is a software that allows its users the ability to find a simple solution to daily data related problems. Excel can be utilized to access most problems in a mathematical spreadsheet format. For example: Let's say you want to manage your finances. Excel offers a solution by which a user can make a list of expenses and maintain an ongoing log of incurred expenses.  </p>  <p>  \t Excel offers a drawing board for daily challenges in a spreadsheet format. Excel allows its users the ability to enter data in a table format. After arranging the data in an excel sheet users are then able to perform calculations on this data for the purpose of data analysis. The type of calculations that needed to be made over hundreds of pages of paper can now be made in a single spreadsheet through Microsoft Excel.  </p>  <h5>Why learn Microsoft Excel?</h5>  <p>  \t There is a very valid and compelling business reason for learning Excel. However more compelling than the business reason is the value excel brings into our personal lives. Excel can serve as a decision making tool as well as a personal life management tool. Management of personal finances becomes significantly easier with the help of Microsoft Excel. Other very common uses of Excel in person life include job application management, weight management, vacation budget management, market analysis and decision analysis. On the business end, excel is essential for all business success. Microsoft Excel lies at the core of all business decision making. The charting feature of excel allows for the representation of data in a colorful format that plays an integral role in business communication. Microsoft Excel is driving Global business decisions in all types of business ranging from large corporations to small privately owned companies. Most all professionals come across Microsoft Excel at some point in their careers.  </p>  <h5>Who is this class for?</h5>  <p>  \t This is a beginner and intermediate level class.  </p>  <h5>Topics covered in class?</h5>  <p>  \t The class covers the layout of the Excel interface. During this process many of the interface features are shown in action. After the interface components are covered, the next part of the class focuses on a few of the key formulas used by Excel and the final part of the class is an example of the utilization of Excel.  </p>  <p>  \t Most of the components are covered during the layout overview. The overview shows how each one of these components works independently. The charting feature of excel is studied in detail with 2 chapters dedicated to this feature. The formulas portion of the class covers some of the most widely used Excel formulas.  </p>  <h5>Best way to learn from this class?</h5>  <p>  \t The best way to learn from this class is by revisiting the lectures and watching the lectures in full screen.  </p>  <h5>Certificate?</h5>  <p>  \t A certificate for this class can be earned through the completion of all the modules of the class. Certificate is delivered through email.  </p>  <h5>Time Commitment?</h5>  <p>  \t Students do not need to watch the complete class in a single sitting. Students have the ability to return to lectures and re-visit lectures.  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel and PowerPoint Training With Certificate", 
    "price": "20.00", 
    "instructors": "Startup Saturdays", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/218684_fbcc_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-and-powerpoint-training-with-certificate/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-14T18:21:01Z"
}