{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Microsoft Word is an essential program that is used in a myriad of industries throughout the world. This series of courses will help increase your existing knowledge and proficiency. Improving your Microsoft Word 2013 skills, will allow you to be more productive in the workplace.</strong> </p><p>Our instructor will explain all of the features and functionalities the application offers in an easy to understand, step-by-step method. The videos have been designed for both first-time users with fundamental Word 2013 problems and advanced users with specific Word 2013 challenges.</p><p>Here are some of the things you will learn in this course:</p><ul><li>How to create, edit, and enhance simple Word 2013 documents. </li></ul><ul><li>How to create new documents and edit them.</li><li>How to use Word Help.</li><li>How to use formatting and layout methods for text, paragraphs, and pages.</li><li>How to use proofing tools, document recovery features, andcustomization options</li><li>How to use page layouts, columns, WordArt, SmartArt graphics, and text wrapping.</li><li>How to efficiently create, manage, revise, and distribute long documents and forms.</li></ul><ul><li>How to use Quick Parts, templates, macros and more!</li></ul>Quizzes are available at the end of each lesson to validate your knowledge. ", 
    "end_date": null, 
    "title": "Microsoft Word 2013: Beginner to Advanced", 
    "price": "35.00", 
    "instructors": "SONIC - High Quality Training for Over 20 Years", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455674_ccdb.jpg", 
    "course_url": "https://www.udemy.com/microsoft-word-2013-beginner-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T12:16:52Z"
}