{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">Microsoft&#039;s Surface Pro 3 does it all: world-class productivity, connectivity, entertainment, everything! Now, you can master your new Surface Pro 3 in just one hour of easy, expert video. With Sean Ong&#039;s friendly, expert guidance, you&#039;ll get started fast, and discover hidden tips and tricks that&#039;ll make you an instant power user. It&#039;s all here: navigating the improved Surface Pro interface… using the powerful new pen… doing serious work with Office and OneNote… watching movies, playing games, listening to music, taking great pictures… making free Skype calls, downloading great new apps, safely storing your files, even squeezing out more battery life! Surface Pro 3 is the most powerful, personal Windows device ever created. Take total control of this amazing system in one hour—with <em style=\"\">Surface Pro 3 Complete Video Guide</em>!</p><p style=\"\">About the instructor:</p><p style=\"\"><strong style=\"\">Sean Ong</strong> is a technology enthusiast and clean energy engineer who specializes in advanced energy efficiency and renewable energy projects. As a member of the EMI Consulting Technical Analysis and Energy Management team, he is a thought leader who has published on topics ranging from large-scale renewable systems to the economics of heat-pump water heaters. In his spare time, he specializes in working and tinkering with advanced technologies ranging from Microsoft Surface to 3D printing, computer vision, and robotics. He holds a bachelor&#039;s degree in physics from Seattle Pacific University, and a masters degree in Engineering (systems specialty) from the Colorado School of Mines.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Microsoft Surface Pro 3 Essentials", 
    "price": "20.00", 
    "instructors": "QUE Videos", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469046_277a_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-surface-pro-3-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T15:41:05Z"
}