{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Microsoft Project can look very intimidating for the new user - because of the number of buttons and controls and array of features. </p><p>BUT DO NOT FEAR - because this course is built SPECIALLY for you. The short and specific lessons in this course are targeted to get you up and running over a very short period of time. I have selected the MOST USED features which get used more than 80% of the time. </p><p> However, this course will not focus on Project Management as a discipline. I have another separate course for the new project manager. </p><p><strong style=\"\">NOTE: </strong></p><ol style=\"\"><li style=\"\"><strong style=\"\">All lessons are 100% example based and HANDS-ON. </strong></li><li style=\"\"><strong style=\"\">ALL LESSONS are SUB-TITLED (CLOSE CAPTIONED).</strong></li><li style=\"\"><strong style=\"\">Exercise Files provided for all lessons.</strong></li></ol><p>Microsoft Project 2013 - is a powerful Project Management tool. It automates the process of organizing, scheduling, recording, calculating, tracking, reporting, and analyzing schedule data for any project. The tool will help you achieve your project goals on time and within budget.</p><p><br style=\"\">In short, when used properly, Microsoft Project 2013 will make you a ROCKSTAR. Some outcomes will be: getting on fast-track for promotions, earning the respect of your peers, seniors and juniors alike.</p><p>So, HIT the ENROLL button and let us meet in the course!</p>", 
    "end_date": null, 
    "title": "Microsoft Project FAST TRACK", 
    "price": "20.00", 
    "instructors": "Srikanth Shirodkar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483578_ccf7_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-project-tutorial-complete/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T19:02:53Z"
}