{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Master Excel 2016 For Complete Beginners In This Helpful, Info-Packed Video Course</strong></p>    <ul><li>Easily learn Excel 2016 for complete beginners</li><li>How to get Excel and installation requirements</li><li>Helpful discussion of new features in 2016</li><li>Getting started with a Workbook</li><li>Entering and editing data</li><li>Creating charts and graphs</li><li>How to create functions</li><li>Protecting and securing your data</li><li>All lessons in easy step-by-step format</li><li>Practice with included exercise files</li></ul>    <p><strong>Excel 2016 From The Beginning</strong></p>    <p>This course assumes you've never worked with Microsoft Excel in your life, or you are upgrading from a previous version. Your professional trainer will start you from the very beginning from installing the program to creating your first Workbook and entering data. Before you know it, you're using Excel 2016 like a pro with advanced functions. You will have the expertise you need to impress the boss at work. You can also use this essential application to accomplish all kinds of tasks for your personal life or business.</p>    <p>If most Excel courses seem to be designed for people who already have experience with the program, this course will be a breath of fresh air. The videos keep things simple and carefully step you through each process.</p>    <p><strong>Contents and Overview</strong></p>    <p>This course starts with where to find Microsoft Excel and installing the program. Then you learn step-by-step, simple 1-2-3 methods for getting up and running with Excel 2016. Watch just the first few videos to have a basic knowledge of Excel. Then continue through the detailed 32 chapters of video lessons and 9 exercise files to gradually become a proficient user. </p>    <p>It's important to note that we don't assume you know anything about Excel 2016. We start from the basics. After installation we discuss what is new with 2016, using Touchscreen, opening a Workbook, and how to use Help to get additional answers when you need them.</p>    <p>Then we show you how to personalize Excel for your own use with exciting Excel Options. We discuss all the Ribbons and Toolbars, entering and editing data, backup and recovery, fill and series, and printing your projects. We also work with formulas, functions, sorting and filtering data, creating charts and graphs, and much more.</p>    <p>Upon completion of this course you will know the essentials of Microsoft Excel 2016.</p><p><strong>*** Updated February 2016. Course transcripts now available.</strong><br></p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2016 for Beginners: Master the Essentials", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660922_d744_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2016-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T09:27:37Z"
}