{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Quickly Get Up To Speed On Excel Basics</strong></p><p><strong>**************** Course Material Works in Excel 2010, 2013 and 2016 *******************</strong></p><p>During this <strong>Microsoft Excel 101 course</strong> you will gain a solid foundation on which you will build the rest of your Excel experience on. Enroll now and I'll guide you step-by-step, exercise files included, through the basics of working with the most powerful spreadsheet tool on the market. In very little time you will master the basics of Excel that'll provide a foundation for more advanced Excel techniques (Course: 102, 103 (Coming Soon)).</p><p><strong>Each section in this course will introduce you to a key foundational Excel concept that you will quickly master.</strong></p><ul><li>Understanding the Excel Interface and Document Structure</li><li>Entering and Working with Data in an Excel Worksheet</li><li>Working with Formulas and the most common Excel Functions</li><li>Formatting Your Excel Data to make it more Presentable</li><li>Creating and Working with Excel Charts to Visually Present Data</li><li>Preparing Your Excel Documents to be Printed</li><li>Creating an Excel Template for Easy Reuse</li></ul><p><br></p><p>At completion of this Excel 101 course you will have mastered the above Excel concepts and able to complete the fundamental day to day tasks of an Excel worker.</p><p>Each section also includes a quiz to test the knowledge you will gain and exercise files for you to download and practice with. These are the same files that are used in the video lectures.</p><p><strong>So, what are you waiting for, enroll now and build a solid foundation within Microsoft Excel.</strong></p>", 
    "end_date": null, 
    "title": "Microsoft Excel 101 Course - Introduction Excel", 
    "price": "20.00", 
    "instructors": "Kyle Pew", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715924_d49a_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-101-course-introduction-to-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T18:45:19Z"
}