{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn Microsoft Outlook 2013 &amp; 2010 with this  comprehensive course from TeachUcomp, Inc. <em>Mastering  Outlook Made Easy</em> features 91 video lessons with over 4 hours of  introductory through advanced instruction. Watch, listen and learn as your  expert instructor guides you through each lesson step-by-step. During this  media-rich learning experience, you will see each function performed just as if  your instructor were there with you. Reinforce your learning with the text of  our two printable classroom instruction manuals (Introductory and Advanced),  additional images and practice exercises.&nbsp;  You will learn all about email, tasks, effective use of the journal and  calendar, advanced mailbox options and much more.</p>  <p>Whether you are completely new to Outlook or upgrading  from an older version, this course will empower you with the knowledge and  skills necessary to be a proficient user. We have incorporated years of classroom  training experience and teaching techniques to develop an easy-to-use course  that you can customize to meet your personal learning needs. Simply launch a video lesson or open one  of the manuals and you’re on your way to mastering Outlook. This course also  includes bonus lessons for versions prior to 2010, making an upgrade from  earlier versions a breeze.</p>    ", 
    "end_date": null, 
    "title": "Microsoft Outlook 2013 Training Tutorial", 
    "price": "25.00", 
    "instructors": "TeachUcomp, Inc.", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48970_6e64_4.jpg", 
    "course_url": "https://www.udemy.com/microsoft-outlook-2013-training-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-08T16:55:50Z"
}