{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This is an introductory course on how to program Excel using VBA macros. You will learn to automate and extend the Excel environment to supercharge your Excel models, automate routine tasks, customize your user interface, and manage large quantities of data.<br>In this Visual Basic for Excel training course, you will learn how to apply the VBA programming language to make your Excel spreadsheets much more powerful. This course starts you out with the basics of VB programming, and teaches you to use it to its fullest potential within Excel.</p><p>Have you ever felt frustrated using Microsoft Excel to perform mundane and often repetitive tasks? Have you ever felt that there has to be an easier and faster way to perform to do something? Well, using Microsoft Visual Basic for Application (VBA) programming language allows you to automate manual tasks within Excel and allows you to be more effective and efficient with your time. </p><p>The tutorial extends your knowledge past editing odd Macro, directly into creating custom scripts using the VBA Programming Language. </p><p>A Verifiable Certificate of Completion from Udemy is presented to all students who undertake this course.</p><p>Like any software, the best way to learn it is to use it and this course is to be treated as a living and growing one, where new material and corrections would be added regularly (all future upgrades are free for existing subscribers).<br></p>", 
    "end_date": null, 
    "title": "Microsoft Excel VBA Programming for Beginners", 
    "price": "20.00", 
    "instructors": "Prateek Singh", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410808_2410_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-vba-programming-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T11:29:55Z"
}