{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>This MICROSOFT PROJECT</strong> <strong>2013</strong> <strong>COURSE IS APPROVED BY PMI® for 5 PDU POINTS IN CATEGORY 'B'.</strong> This course <em><strong>\"Microsoft Project 2013 MASTERCLASS</strong></em>\" is intended for project managers who are just starting out, as well as experienced project managers who are new to Microsoft Project 2013.</p><p>In short, when used properly, Microsoft Project 2013 will make you a ROCKSTAR. Some outcomes will be: getting on fast-track for promotions, earning the respect of your peers, seniors and juniors alike. </p><p><strong>Course Update 21st Mar, 2016: </strong></p><ol><li><strong>Approved for 5 PDU POINTS IN CATEGORY 'B'</strong> <strong>BY PMI®</strong><strong></strong></li><strong></strong><li><strong> 1719 students, 100+ countries </strong>start learning in just 7 months;<strong></strong> <strong><em></em></strong></li><li><strong>100% ALL</strong> lessons are captioned (subtitles present)<strong><em></em></strong></li><strong></strong><li><strong>BONUS</strong>: <em>The Secret Sauce to Creating Schedule - student requested lesson added</em></li><strong></strong><li><em><strong>BONUS</strong>: Downloadable Cheat Sheet - How to become a Great Schedule Reviewer</em></li><li><strong><em>Four Quiz added</em></strong><em>, <strong>WBS Excel import template resources added.</strong></em></li><li><strong><em>15 additional exercise files added. Total 20+. </em></strong></li></ol><p>Microsoft Project 2013 - is a powerful Project Management tool. It automates the process of organizing, scheduling, recording, calculating, tracking, reporting, and analyzing schedule data for any project. The tool will help you achieve your project goals on time and within budget. <strong>You will learn all this and MORE in this course.</strong></p><p><strong>For the new PM:</strong> Project 2013 can appear very intimidating to a new user. For a new Project Manager who is learning the art of project management - having to learn the software tool can be very taxing without someone to hold your hand and walk you from start to finish. </p><p><strong>For the experienced PM: </strong>This course will make your skills really shine. You know that there are so many aspects to a project - the schedule, resourcing, quality, costs, reporting. And everything must be reported from a microscopic to a 20,000 ft level at the drop of a hat. This course will allow you to do just that. </p><p><strong>What you will get from this course:</strong></p><ol><li>60 short and sweet, topic specific lectures. No rambling lessons ever. </li><li>50+ exercise files - almost every lesson has a file which you can download and use.</li><li>Every lesson is hands-on and you learn by doing. </li><li>Certificate of completion</li><li>A course designed to walk you quickly from baby steps to Sprints to Marathons.</li></ol><p><em><strong>GREAT EMAIL FEEDBACK AND REVIEWS:</strong></em></p><p><strong><em>\"</em></strong><em>Life Long Learner(LLL) - A part of me !! First and foremost thanks for a course which worth more then just certain $. I have been on MSP 2010 for a long now, so I thought of upgrading to whats new in 2013. I have been through your course and indeed a complete package that an professional would expect. I have been doing project coordination for a company , and now completed with my PMP in June. Project management is something I love doing, by completing the course it good to be upgraded on application side also. Also i am collecting PDU's for PMI's CCR. So this course offered me to learn a new MSP 2013 along with PDU's.</em><strong><em>\"</em></strong></p><p><em><strong>\"I really think you've done a really great job. And you are a pure Ms Project expert. I will go back to the course for sure, when I will have a specific Ms Project cases\"</strong></em></p><p>and</p><p><em><strong>\"I reported your course completion to gain the PDU for PMP in category B (I reported 5 PDU) and it was very quickly approved.\"</strong></em></p>", 
    "end_date": null, 
    "title": "Microsoft Project 2013: Get Promotions, Respect and Mastery!", 
    "price": "25.00", 
    "instructors": "Srikanth Shirodkar", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424942_9fac_2.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-project-2013-training-promotions-respect-and-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T14:02:52Z"
}