{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>La certification MOS « Microsoft Office Specialist » Excel 2013 (77-420) est un examen du premier niveau qui vous permet d'obtenir une certification valorisante et reconnue par Microsoft sur Microsoft Excel 2013. Cette certification garantit votre niveau de compétence et favorisera l'évolution de votre carrière professionnelle car elle prouve que vous savez manipuler et exploiter l'ensemble des fonctionnalités de Microsoft Excel 2013 et offrir ainsi un niveau de productivité élevé à votre employeur. Cette formation vous prépare à passer le niveau \"Spécialiste\" de la certification Excel 2013 MOS, elle couvre l'ensemble des objectifs de l'examen officiel.Un certain nombre de travaux pratiques sont à réaliser à la fin de chaque chapitre pour évaluer et valider les connaissances et compétences acquises tout au long de celui-ci. Pour plus enrichissement en Excel 2013, vous pouvez suivre la formation Excel 2013, Les tableaux croisés dynamiques afin d'apprendre des bonnes pratiques pour synthétiser des données provenant des tableaux et des listes. Après avoir terminé cette formation MOS Excel 2013 (77-420), vous pouvez aller découvrir les nouveautés de Microsoft Office Excel 2016 avec notre série de 3 formations: formation EXCEL 2016 Initiation et découverte de l’environnement, la formation EXCEL 2016 Initiation, Organisation et saisie des données, et la formation EXCEL 2016 Initiation et Présentation des données.</p>", 
    "end_date": null, 
    "title": "Microsoft Office Specialist Excel 2013 (77-420)", 
    "price": "25.00", 
    "instructors": "Alphorm Démocratise le savoir IT", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/828580_b7cc_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-office-specialist-excel-2013-77-420/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-21T21:20:37Z"
}