{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>A <span style=\"color: #0000ff;\">verifiable Certificate</span> of Completion is presented to all students who take this Excel 2013 Training course. Probably the best investment for your career and can result in a promotion and better pay.</strong></p><p><strong>COURSE <span style=\"color: #0000ff;\">UPDATED November 2015</span></strong><br></p><p><strong></strong></p><p>Understanding spreadsheet software is a very important requirement in nearly 80 percent of all middle-skill job openings, according to a report published by the <strong>Wall Street Journal </strong>and can mean up to $2.52 more in median pay per hour.<br></p><p>Obviously taking this course will not make you an Excel expert but in most cases that is not needed. Very often the only thing that you need for a job is some basic understanding of Excel. Once you really need it you can dig deeper into it but if you can say on your resume that you know what Excel 2013 is and are able to use it you are already way ahead of your competitors.<br></p><p><strong>After taking this course you are ready to take an intermediate course and become an expert for real - if you want to.</strong></p><p>You are taken from opening Excel for the first time through how to use it to creating a simple table and printing stuff.<br></p><p>The course has <strong>no prerequisites</strong> and is <strong>targeted at the absolute beginner</strong>.</p><p><strong>If you need Excel 2103 for your job or you have to prove that you know what Excel is in order to get that job: this is the course for you.</strong></p><p><strong>This course is also recommended if you want to become an expert. </strong>As surveys show many so called experts never mastered the basics. <strong>So do yourself a favor and get this course and study it. In less than an hour you can be done.</strong></p><p>This course is short. All the unnecessary stuff is left out so that you can easily go through the course and after completing the course you can confidently say: </p><p>\"I know what Excel 2013 is and I can use it\".</p><p>It is highly recommended that you get your own copy of Microsoft Excel 2013 so that you can follow along.</p><p>After finishing the course you are going to get nice certificate that you can give to your boss to prove that you successfully took this course.</p><p>The<strong><em> Wall Street Journal</em></strong> writes:</p><p><strong><span style=\"color: #0000ff;\">\"The Key to a Good-Paying Job Is... Microsoft Excel\"</span></strong><br></p><p>via blogs. wsj. com/atwork/2015/03/05/microsoft-excel-skills-the-key-to-middle-class-earnings/<br></p><p>A recent <em><strong>Huffington Post</strong></em> article describes that knowing Excel can mean a lot more money in your pocket:</p><p><strong><span style=\"color: #0000ff;\">\"Knowing Excel --Yes, Microsoft Excel -- Is Crucial To Making More Money\"</span></strong></p><p>\"Proficiency with productivity software like Excel and Word even boosts your pay in a job that heavily emphasizes people skills -- like in retail.</p><p>Middle-skill jobs that just require Word and Excel skills and no other digital skill pay a median of $22.66 an hour compared to $20.14 for middle-skill jobs that don't require digital know-how, according to the report.\"</p><p>Full article: huffingtonpost dot com/2015/03/06/you-cant-escape-the-hegemony-of-the-spreadsheet_n_6816570 dot html<br></p><p>$2.52 more per hour is a lot and it adds up to <strong><em>over $4,800 more per year</em></strong>.</p><p>So, go ahead and enroll in this <strong>Excel 2013 Course for Absolute Beginners</strong> now!</p><p><br></p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2013 Beginners - Essential Excel Training", 
    "price": "25.00", 
    "instructors": "Dipl.-Ing. Hans Peter Jeschke", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432278_77ca_10.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2013-an-easy-course-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T19:07:28Z"
}