{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong><em>\"Expert Led Excel 2013 Training Course Covers the Skills You Need to Spot Complex Trends and Graph them Effectively.”</em></strong>  </p><p>  \tImpress the people you work with by cultivating advanced spreadsheet skills. During this 10-hour <em></em>training course, you’ll learn to create Excel spreadsheets with ease. Our expert instructor will show you Excel 2013 features to navigate you through the program. Starting with the basics, you’ll discover how to enter and format data in the quickest manner possible.<br></p><p>Next you’ll be introduced to the power of Excel’s functions and formulas to help you calculate data and derive useful information. To help you present it all in a visually appealing format, your instructor will then walk you through how to create sophisticated charts and graphs, and publish them online. Finally, you’ll learn to analyze and review worksheets for data discrepancies so you can prevent problems before they arise.</p><p>  \tTurn your long lists of numbers into slick, engaging visuals that bring data to life. Whether you need to create budgets, financial projections, invoices, calendars, schedules, or lists, our elaborate Excel 2013 training course will give you the skills you need to stand out at work.  </p>  <p>  \tPlus, when you sign up for our online Excel 2013 Training, you’ll also get these <strong>6 BONUSES</strong> in addition to the 50+ online course videos:  </p>  <ol>  \t<li><strong>Downloadable      &amp; printable keyboard shortcuts</strong> - to      help you save time and get your work done faster.</li>  \t<li><strong>An      online quiz (40 questions)</strong> - to test what you've learned.</li>  \t<li><strong>18      exercise files</strong> – to help you become      proficient with the material.</li>  \t<li><strong>Downloadable &amp;      printable transcripts (over 200 searchable pages)</strong>      – to give you another learning option, if you prefer reading but don’t      have time to take notes.</li>  \t<li><strong>10      hours of downloadable MP3s to play on your favorite audio device</strong>      - to help you learn in the car, while you walk, or in the gym.</li>  \t<li>A <strong>certificate of completion </strong>to tell everyone you've aced the course.</li>  </ol>  <p>  \tWhere else can you find so many extra tools to help you master Excel 2013?!?!  </p>  <p>  \tSo start learning today. Because being a technology dinosaur isn’t going to get you a promotion or raise!  </p>    <p>  \tAll of our Excel 2013 training videos are high-definition videos, therefore, they are <strong>best viewed with the HD setting on</strong>, and the videos enlarged.  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2013 Beginners/Intermediate Training", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32917_bbc1_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2013-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-17T19:06:45Z"
}