{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t <strong style=\"\">* Um certificado de conclusão digital válido é oferecido para os estudantes que completarem o curso. O seu certificado tem um código de verificação para autenticidade.</strong>  </p>  <p>  \t <strong style=\"\">Você realmente sabe trabalhar com o Excel?</strong>  </p>  <p>  \t <strong style=\"\">Você sabe de verdade explorar todos os recursos desse poderoso software e economizar seu tempo, energia e dinheiro?</strong>  </p>  <p>  \t   A maior parte das pessoas que já tenha feito um curso de Excel não se sentem totalmente confiantes e seguras ao utilizar esse aplicativo. A grande maioria delas após um tempo sem utilizar o programa acabam retornando a execução de forma repetitiva e manual as tarefas dentro da planilha e perdem muito tempo procurando descobrir a solução para determinado problema.  </p>  <p>  \t <strong style=\"\">FATO</strong>: A maior parte das pessoas utiliza menos de 30% dos recursos disponíveis no Excel.  </p>  <p>  \t <strong style=\"\">FATO</strong>: O bom uso dessa ferramenta pode te ajudar a extrair informações de qualidade em seu negócio ou trabalho e te ajudar a tomar decisões eficazes  </p>  <p>  \t <strong style=\"\">FATO</strong>: Por não gostarem de matemática as pessoas desenham o Excel como algo complicado e díficil.  </p>  <p>  \t <strong style=\"\">Primeiramente parabéns </strong>por procurar se especializar nessa ferramenta fantástica que é a planilha eltrônica Excel. <strong style=\"\">Você irá aprender nesse curso desde o início</strong> de uso dessa ferramenta com as primeiras e básicas instruções e depois iremos aprofundar o aprendizado utilizando fórmulas mais complexas e recursos essenciais para o uso do Excel no dia a dia.  </p>  <p>  \t   Através desse curso você será capaz, dentre outras coisas, de:  </p>  <ul style=\"\">  \t<li>Criar planilhas básicas e aplicas fórmulas para resolver problemas</li>  \t<li>Utilizar gráficos para apresentar as informações de forma VISUAL e impressionar</li>  \t<li>Entender os conceitos de referência do Excel e as fórmulas 3D</li>  \t<li>Aprender a imprimir de forma eficiente fazendo uso correto do espaço disponível no Excel</li>  \t<li>Conhecerá recursos incríveis que não são ensinados nas escolas tradicionais de informática</li>  </ul>  <p>  \t   As aulas presentes nesse inovador treinamento foram desenvolvidas por um instrutor experiente que já ministra aulas, cursos e treinamentos a quase 20 anos. <strong style=\"\">Linguagem fácil, didática e foco no APRENDIZADO do aluno. </strong>A abordagem utilizada no treinamento é a EXPERIMENTAÇÃO onde o aluno precisa efetivamente FAZER para conhecer. Ao USAR todos os comandos e recursos apresentados o aluno se torna parte ativa do processo de ensino/aprendizado e conseguirá aproveitar e reter muito mais do curso.  </p>  <p>  \t <strong style=\"\">AS 4 RAZÕES PELAS QUAIS AS PESSOAS AMAM O EXCEL</strong>  </p>  <p>  \t <strong style=\"\">1) Excel denota CONTROLE</strong>  </p>  <p>  \t   As linhas e colunas da planilha recheadas de informação vital podem ser manipuladas da forma que o usuário bem entender. Além da simples aplicação de formato, cores e fontes bem como (e mais importante) o uso dessas informações e a fusão delas.  </p>  <p>  \t <strong style=\"\">2) Propriedade. A informação é sua!</strong>  </p>  <p>  \t   As informações são suas e você é responsável em trabalhá-las e manipulá-las. A partir disso você poderá extrair tudo que precisar  </p>  <p>  \t <strong style=\"\">3) Experiência e reconhecimento</strong>  </p>  <p>  \t   Olhe na sua empresa. Olhe para seus colegas de sala. Quantos deles são realmente capazes de trabalhar com Excel além da função SOMA?  </p>  <p>  \t <strong style=\"\">4) Canivete suiço</strong>  </p>  <p>  \t   O motivo de ter me apaixonado pelo uso de planilhas eletrônicas e principalmente o Excel é que essa ferramenta em suas mãos é um verdadeiro canivete suiço podendo ser usado para uma infinidade de funções além do uso tradicional de planilha. Nós iremos discutir alguns desses usos no curso.  </p>  <p>  \t   Quando você estiver pensando em escolher um curso ou treinamento para você e para sua equipe você deve sempre visualizar o CONTEÚDO. Não basta por exemplo contar a quantidade de aulas ou os tópicos mas sim o conteúdo e a forma como esse conteúdo é trabalhado. Ora, simplesmente explicar tópicos soltos e aleatórios é uma coisa. <strong style=\"\">Mas a partir de um PROBLEMA trabalhar-se na solução é muito mais envolvente para o professor e para o aluno</strong>.  </p>  <p>  \t   Durante o curso nós iremos primeiramente trabalhar em uma sequencia lógica de aprendizado:  </p>  <p>  \t   1) Alguns conceitos iniciais (SIM O CURSO É VOLTADO PARA O MAIS COMPLETO LEIGO!) de planilha, funções básicas e uso rotineiro do Excel.  </p>  <p>  \t   2) Depois iremos aprofundar mais o assunto e usar recursos mais avançados  </p>  <p>  \t   3) Iremos explorar uma sequencia de exercícios desafiadores onde te auxiliarei passo a passo na resolução. Veja bem, nesse ponto aqui quero que você convide seu amigo &quot;especialista&quot; em Excel e mostre pra ele o que você está aprendendo.  </p>  <p>  \t   4) <strong style=\"\">PROJETO FINAL</strong>. Aqui você construirá uma planilha completa de controle gerencial que você poderá usar até mesmo em sua empresa ou trabalho. Não, eu nÃO estou falando de uma planilha simples que contem uma coluna de débito, outra de crédito e outra de saldo! Estou falando de uma planilha capaz de SUMARIZAR resultados por códigos! Esse projeto inclusive foi um dos primeiros softwares que desenvolvi e trabalhei a mais de 10 anos atrás.  </p>  <p>  \t   Ah, em um momento do curso ensinarei para você os <strong style=\"\">10 recursos fantásticos do Excel que seu colega de trabalho NÃO sabe!</strong>  </p>  <p>  \t   Além de todos os benefícios que comentei, você contará ainda nesse treinamento:  </p>  <ul style=\"\">  \t<li>Material completo utilizado no curso (Planilhas, exercícios, etc)</li>  \t<li>Aulas intuitivas e desafiadoras (você tem acesso completo e vitalício a todas as aulas e material)</li>  \t<li>Meu apoio durante seu treinamento</li>  </ul>  <p>  \t <strong style=\"\">Em quanto tempo você consegue concluir esse treinamento?</strong>  </p>  <p>  \t   Se você quiser seguir todas as aulas de uma única vez você pode sem dúvida, mas o ideal é que você quebre em alguns dias para poder fazer todos os exercícios com calma e atenção.  </p>  <p>  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p>  \t <strong style=\"\">Mas quais os benefícios que você como aluno irá obter a partir desse curso?</strong>  </p>  <ul style=\"\">  \t<li>Você aprenderá conceitos básicos de uso do Excel</li>  \t<li>Aprenderá a construir planilhas poderosas usando funções e recursos para contabilização e extração de dados</li>  \t<li>Entenderá como criar gráficos</li>  \t<li>Descobrirá como o Excel é um banco de dados</li>  \t<li>Conhecerá muitas funções (E o caminho das pedras para dominar todas as demais)</li>  \t<li>Vai ainda descobrir como o Excel pode ser seu amigo e salvar seu emprego!</li>  </ul>  <p>  \t   O escopo do treinamento é o Excel, guiando o aluno do básico ao nível intermediário. Não usamos o termo avançado pois entendemos que Excel avançado se trata de PROGRAMAÇÃO VBA. O resto é intermediário e você precisa saber em um curso. Iremos cobrir praticamente tudo que você precisa saber do Excel.  </p>  <p>  \t <strong style=\"\">O objetivo é que você ao terminar esse treinamento se sinta confortável em utilizar o Excel para resolver problemas e se torne um profissional com um diferencial.</strong>  A abordagem pedagógica desse curso, como de costume em nossos treinamentos, é de experimentação onde você deverá buscar/procurar/testar/fuçar/descobrir a utilização dos recursos. <strong style=\"\">Não fazemos mágica aqui. Você precisa fazer sua parte! </strong>  </p>  <p>  \t   O instrutor desse treinamento possui vasta experiência no assunto tendo trabalhado diretamente com essa tecnologia e hoje é professor do curso de sistemas de informação ensinando há vários anos analistas, programadores e estudantes a trabalharem mais de perto com o sistema operacional. Já foi professor do curso de Administração e fez uso contínuo e diário do Excel ao longo dos anos que trabalhou com projetos de TI.  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2013 Completo - Mão na Massa!", 
    "price": "20.00", 
    "instructors": "Tiago Baciotti Moreira", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/219776_ac2e_3.jpg", 
    "course_url": "https://www.udemy.com/excel-2013-completo/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-15T16:50:19Z"
}