{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>STUDENT REVIEWS:</p><p><strong>\"After going through this course, I have picked up the skills to do more advanced features of Word like the text styles, tables and even the thesaurus. I enjoyed Lecture 5 on creating tables as this is the part that always confused me. The course is organised in a logical manner and the instructor is clear in the lectures. Highly recommended.\" </strong>-- Tam W.</p><p><strong>\"The Microsoft Word Crash Course ROCKS!!\"</strong> -- Logan Southee</p><p><strong><span></span>\"Absolutely worth the money. It explains everything you need to know about this fundamental writing software. I love the instructor's explaining method; it is clear and precise.\" </strong>-- Mike</p><p>=====================================================================================</p><p>In this brand new MS Word course for 2015, you will receive a comprehensive introduction to Word, AND I will walk you step by step (as if you're looking over my shoulder) through several demonstrations of the latest features in Word 2013.</p><p>This two tiered focus makes <em>The Crash Course</em> perfect for novices <em>AND</em> intermediate users. If you've already mastered all the advanced features and time-saving hacks, then you may want to look for another course. But if you're a total beginner, you'll get a guided tour showing exactly how to use Word's basic features. If you're a long-time user of past versions of Word, you'll discover over a dozen shortcuts and awesome hacks you probably never knew existed.  Regardless, you will master the most powerful features and start making gorgeous documents within two hours.</p><p>=====================================================================================</p><p>Your purchase of this course is fully backed up by a 100% money back guarantee, so there's absolutely no risk on your part!  Click the \"Take This Course\" button on the top right of the screen and start learning now.  You are free to test drive the course for up to 30 days with no strings attached.  If you decide it's just not working out?   No problem.  Simply contact Udemy support and you'll get 100% of your money back.</p><p>=====================================================================================</p>", 
    "end_date": null, 
    "title": "Microsoft Word 2013 Fast Start: Be A 2015 Office Superhero!", 
    "price": "20.00", 
    "instructors": "Syed Raza, Michael Battle", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461576_69a1_6.jpg", 
    "course_url": "https://www.udemy.com/microsoft-word-2013-ms-word-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-28T19:10:23Z"
}