{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Looking to create a <strong>world-class</strong> Professional Quality Diagrams and Drawings? Want to learn a powerful diagramming solution software used by 12 million users worldwide? Want a powerful skill on your resume? </p><p>Whatever your motivation to learn Visio, you've come to the right place. </p><p><em><strong>This course is the first, most comprehensive, cost effective Visio 2016 course on the entire web - or your money back.</strong></em>  </p><p>Microsoft Visio 2016 is trusted by organizations and instituitions large and small worldwide - making it the the one-stop diagramming solution to simplify and communicate complex information.<span></span> </p><p>Visio's worldwide numbers of \nmore than 12 million users across both Enterprise level usage  and academic makes it the <em>world's most widely used diagramming solution.</em><br></p><p><strong>Master the World's Most Popular Diagramming Solution - VISIO in this Comprehensive Course.  </strong></p><ul><li>Learn the LATEST version - VISIO 2016 - and stay miles AHEAD of the curve</li><li>Start from the very basics - this course makes no assumptions</li><li>Earn promotions with your new skills - Become indispensable in your institution </li><li>BONUS\n - learn what the LATEST and greatest version Visio 2016 brings to the table</li><li>Create, Simplify and Communicate complex information with data-linked diagrams that you can create in just a few clicks.</li><li>Get started with Visio easily with a select set of pre-crafted starter diagrams and contextual tips and tricks</li><li>Take advantage of <strong>refreshed templates and thousands of shapes</strong> that meet \nindustry standards including Unified Modeling Language (<strong>UML</strong>) 2.4, \nBusiness Process Model and Notation (<strong>BPMN</strong>) 2.0 and Institute of \nElectrical and Electronics Engineers (<strong>IEEE</strong>) compliance</li></ul><p><strong>Learn Visio 2016 to create Powerful, Professional Diagrams<br></strong></p><ul><em></em><li><em>Bring diagrams to life with data linking</em><em></em> - Visio shapes can be linked to multiple data sources including Microsoft \nExcel, Microsoft Excel Services, Active Directory, Microsoft SQL Server,\n Microsoft SQL Azure, and Microsoft SharePoint Lists and Business \nConnectivity Services</li><li>Communicate One Version of the Truth - As your underlying data refreshes, your diagrams is refreshed in the browser.</li><li> Secure diagrams with Information Rights Management (IRM), Visio Professional 2016 now offers IRM features.<span></span></li></ul><p><strong>What am I going to get from this course?</strong></p><ol><li>A step-by-step video tutorial starting from the absolute basics - all the way to advanced topics. </li><li>170 minutes of video lecture - over 30 separate lessons</li><li>Countess hours saved with Visio 2016's diagramming and automation tools (like the Starter Diagrams)</li><li>Respect of your Boss, peers, juniors, seniors - and your Domain Industry</li><li>A powerful and absolutely essential diagramming tool that is indispensable in today's professional life</li><li>A lifetime access to this course - and all future updates, enhancements</li><li>BONUS: Tips, \ntricks, pitfalls and other points distilled from a lot of experience - \nthese are distributed through out the course lessons</li></ol>", 
    "end_date": null, 
    "title": "Microsoft Visio 2016 Tutorial: The Masterclass", 
    "price": "20.00", 
    "instructors": "Srikanth Shirodkar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634854_96ad_6.jpg", 
    "course_url": "https://www.udemy.com/visio-tutorial-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T14:28:32Z"
}