{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong></strong></p><p>We've all wished for more time to accomplish more during our busy days. <strong>What we really need is to learn how to cutback on the time we spend doing routine tasks. </strong>For example, the average office worker spends <strong>25% of their work week </strong>managing their Outlook inbox. </p><p><strong>Use the Microsoft Office Applications to their full potential</strong></p><ul><li>Microsoft Word Styles to create consistent formatting and automate a Table of Contents</li><li>Create Excel Macros to automate your work</li><li>Use PowerPoint Master Slides to create eye catching presentations</li><li>Organize your Outlook inbox with Categories</li></ul><p><strong>Spend less time doing routine tasks</strong></p><p>If you've ever thought there must be an easier more efficient way of doing something in Microsoft Office, then this course is for you.</p><p>During this course I will introduce you to some of the time-saving techniques and tools that each of the Office applications provide. By implementing the tools that I'll walk you through, you will cutback on the time it takes to complete a task, getting back that 25%, and create more dynamic and efficient documents.</p><p><strong>Lecture Topics</strong></p><p>You will gain an understanding of how to work with and become more efficient with large sets of data in Excel <strong>(Excel Lists/Tables)</strong>.</p><ul><li> Create dynamic reports with <strong>Excel PivotTables</strong></li><li> Get Excel to work for you by automating tasks with <strong>Macros</strong></li><li>Take a quiz at the end of the section to test what you've learned</li></ul><p>You will learn to streamline your efforts in creating and maintaining Microsoft Word documents.</p><ul><li> Use <strong>Word styles </strong>to create consistency throughout the formatting of your documents</li><li> Take advantage of Microsoft Words built in <strong>Tables of Contents tool</strong></li><li>Take a quiz at the end of the section to test what you've learned</li></ul><p>You will be immersed into the time-saving techniques of creating efficient PowerPoint presentations.</p><ul><li> Use <strong>Master Slides</strong> to eliminate slide by slide formatting</li><li> Use <strong>Custom Shows</strong> within the same presentation file</li><li>Take a quiz at the end of the section to test what you've learned</li></ul><p>You will break the shackles that tie you to Microsoft Outlook, ultimately getting that time back to be more productive with your day.</p><ul><li> Use <strong>Outlook categories</strong>, making searching an organizing a breeze</li><li> Automate routine Outlook tasks by using <strong>\"Quick Steps\"</strong></li><li>Take a quiz at the end of the section to test what you've learned</li></ul><p>Each section has a quiz where you can test your knowledge on the topics discussed throughout the videos.</p><p>At completion of this course you will be amazed at all the extra time you have during your workday.</p><p><br></p>", 
    "end_date": null, 
    "title": "Microsoft Office Time-Saving Techniques", 
    "price": "20.00", 
    "instructors": "Kyle Pew", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/638922_02ab_4.jpg", 
    "course_url": "https://www.udemy.com/microsoft-office-2013-time-saving-tools-for-the-office-newb/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T05:22:58Z"
}