{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><u>A Brief Introduction to the Course</u></strong></p>  <p>Come. Watch. Learn. Conquer. Excel. One Simple Lesson at a Time.<br></p><p><strong>Hi and welcome!</strong><br></p><p><strong></strong></p>  <p>Hi and welcome! My name is Tolan, and I am the co-founder of ProductivityMe.<br></p>  <p>I’d like to welcome you to Excel Keyboard Shortcuts, where through a series of awesome tips, tricks, and keyboard shortcuts you’ll learn to Master Microsoft Excel, one simple lesson at a time.</p>  <p>Through a comprehensive set of unique, fun, easy-to-follow video tutorials, you can learn to become a Microsoft Excel Power User in less than a week!</p>  <p><u><strong>What is Included in This Course?</strong></u><br></p><ul><li>250+ individual lessons</li><li>Regular course updates</li><li>A dynamic, response Excel file listing all 233 keyboard shortcuts used in the course</li><li>A colored PDF reference guide of those 233 keyboard shortcuts</li><li>Instant access to course instructor </li></ul><p><u><br></u></p><p><strong><u>What is the Purpose of This Course?</u></strong></p>  <p>Excel has become the industry standard for organizing, analyzing, manipulating, a storing both data and information in tabular form.</p>  <p>Thus, this course is designed to get you up and running as a highly-proficient Excel user by being able to use hundreds Excel's most common actions and functions in seconds.</p>  <p>By the end of this course, you’ll be able to use and deploy more than 230 keyboard shortcuts that will make you AWESOME at Microsoft Excel. </p><p><strong>For example, y</strong><strong>ou’ll learn shortcuts like:</strong></p>  <ul><li>Shift + F11 Inserting a New Worksheet (Lesson 04.01)</li><li>Ctrl + Shift + \"=\" Inserting Rows or Columns (Lesson 05.02 or Lesson 05.03)</li><li>Shift + Spacebar Selecting an Entire Row (Lesson 07.01)</li><li>Ctrl + Spacebar Selecting an Entire Column (Lesson 07.02)</li><li>Ctrl + Enter Entering the Same Data in Multiple Cells (Lesson 11.06)</li><li>Ctrl + Alt + V Displaying the Paste Special Dialog Box (Lesson 14.10)</li><li>Ctrl + Shift + ~ Applying General Format (Lesson 17.01)</li><li>Alt + = Autosumming Selected Cells (Lesson 18.04)</li><li>Ctrl + ` Toggling Formulas On and Off (Lesson 18.05)</li><li>F11 Creating a Chart in New Worksheet (Lesson 19.10)</li><li>Alt + F8 Opening the Macro Dialog Box (Lesson 20.06)</li></ul><p><strong><br></strong></p><p><strong>More generally, you'll be able to apply keyboard shortcuts for actions such as:</strong></p><ul><li>Autosumming cell values &amp; instantly changing their formatting</li><li>Adding, formatting, and removing cell borders in a flash</li><li>Hiding, grouping, adding, deleting columns and rows</li><li>Moving to the next cell, worksheet, or workbook</li><li>Copying, moving, or deleting a cell, a selection, or a worksheet in Excel</li><li>Expanding or reducing your active selection by one or more cells, columns, or rows</li><li>Instantly creating new tables, filters, charts, and PivotTables</li><li>Launching macros &amp; the VBA Editor with two simple clicks</li><li>And much, much more</li></ul>                  <p>In every lesson, we to follow the same logical structure.<br></p><p><u><strong>Consistent Lesson Structure:</strong></u><strong></strong><br></p>  <ol><li>First, we'll provide an introduction to what we’ll cover in the lesson</li><li>Then we'll show you the keyboard shortcut</li><li>Next we'll show you how to achieve the same result without using the specific shortcut</li><li>Then. we'll review what we covered in the lesson</li><li>And lastly, we'll discuss what is coming up in the next lesson</li></ol>          <p><strong><u>Final Thoughts:</u></strong><br></p>  <p>ALRIGHT! The quality of our content speaks for itself. Come and check it out today!</p><p>See you in a few.<br></p>  <p>Cheers,</p>  <p><strong>Tolan &amp; Ryan</strong><br>Course Instructors &amp; ProductivityMe Co-Founders</p><p><br></p>", 
    "end_date": null, 
    "title": "Microsoft Excel Keyboard Shortcuts: A Comprehensive Guide", 
    "price": "20.00", 
    "instructors": "The ProductivityMe Company", 
    "commitment": "17 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566902_8b35_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-shortcuts-for-2007-2010-2013-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-28T05:07:52Z"
}