{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Microsoft Excel is the industry standard for spreadsheets and is a part of the ubiquitous Microsoft Office. Amongst its many features, it prominently supports calculation, graphing tools and pivot tables. Just like any other spreadsheet, Microsoft Excel has a grid of cells structured in numbered rows and letter-named columns to organize and manipulate data. This organization of Excel into cells makes it an indispensable tool for budgeting, financial forecasting and data entry amongst other functions.</p><p>This course is designed for absolute Excel beginners and intends to guide you through your first step in the vast world of Microsoft Excel. Although you will be learning Excel 2013 in particular, what you master in this Excel tutorial will be relevant to other versions like Microsoft Excel 2007 as well. </p><p>By taking this online Excel tutorial, you will be able to bring data together, use conditional formatting, manipulate data and perform various calculations among many other benefits. Learning MS Exce lis a must especially for business analysts, entrepreneurs and accountants. Therefore, it is not a surprise that Excel courses feature in most B-School syllabi. There is a lot to learn and master in the world of Microsoft Excel and this course will provide a start in the right direction.</p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2013 - Smart Lessons for Absolute Beginners", 
    "price": "20.00", 
    "instructors": "FACE Prep", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/755682_c5e9_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-basics-course-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T06:00:34Z"
}