{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><u>Course Description</u></strong></p>  <p>80% of PowerPoint presentations are poorly designed, messaged incorrectly, and provide no worth to their intended audience.  The worst thing we can do is waste peoples times with boring presentations that provide no value.   This course will prevent you from doing so.  </p>  <p>Simply put, the best way to sell a product, impress a client, or advance in your career is to communicate your ideas in a more coherent manner that your competitors.  And despite our advances in technology, the basic Powerpoint presentation will be the best way to accomplish this. </p>  <p><strong><u>Learn to Master The Art of the PowerPoint Slide</u></strong></p>  <p>This course will cover the psychology of the powerpoint design---the tricks of the trade that will make your slides much more memorable.  In the course, we discuss the following in detail</p>  <ul><li>Design</li><li>Font</li><li>Contrast</li><li>Color</li><li>Key takeaways</li><li>Use of pictures</li><li>Simplicity</li><li>Elegance</li></ul>                <p><strong>Make sure that your slides are clean, presentable, and memorable</strong></p>  <p>This class will teach you how to create slides that will be remembered by your audience.  It will apply psychology to slide design, making sure what you present will not bore your audience.  </p>  <p>As opposed to other courses, this program will not just point out what is wrong with slides.  It will show you how to fix them and make sure they are right.  </p>  <p>Course will start out with overall observations, explaining what issues industry leaders face with presentations. </p>  <p>I will then go into detail on “what right looks like”, explaining the characteristic of a well designed slide.  The lecture will show what 80% of people do wrong, and how your slides can be in the 20% that do right. </p>  <p>The bulk of this presentation will be on the “Seven Sins” of PowerPoint Slides, showing what the vast majority of people are doing wrong, and how YOU can fix it in your own presentations. </p>  <p><strong>What are the requirements</strong></p>  <ul><li>Understanding of Powerpoint (this is <strong><u>not</u></strong> an introduction to PowerPoint)</li><li>Basic briefing or presentations skills (this is <strong><u>not</u></strong> an introductory presentations skills course)</li></ul>    <p><strong>Who is the Target Audience</strong></p>  <p><strong> </strong></p>  <ul><li>Business Executives</li><li>Teachers/College Professors</li><li>Venture Capitalists</li><li>Anyone who habitually briefs a mass audience</li></ul>", 
    "end_date": null, 
    "title": "Microsoft PowerPoint Slides: Beyond The Bullet Points", 
    "price": "20.00", 
    "instructors": "Rohin Sharma", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/603746_0ad7.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-the-powerpoint-slide/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-06T04:06:06Z"
}