{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>&gt;&gt; Special Price ONLY - Increasing To $97 Soon\n&lt;&lt;</strong></p>\n\n<p><strong>&gt;&gt; Updated for June 2016 &lt;&lt;</strong><br></p>\n\n\n\n\n\n<p><strong>Wouldn't it be great if you could learn Microsoft Excel in just 1 hour? Imagine going from</strong> <strong>beginner to expert</strong> <strong>in just</strong> <strong>1 hour.</strong></p>\n\n\n\n\n\n<p>All this is possible in just 4 easy and simple steps.</p>\n\n\n\n\n\n<p><strong>Why should you take this course?</strong></p>\n\n\n\n\n\n<blockquote><em>\"<em>Took this course and was impressed at how well it flows. nice and easy to follow and instructor gives a good overview of the course. Good clarity of voice as well. I have been on courses in the past where i have struggled with understanding what they are saying. Here I could understand what was being said.</em>\"</em> <strong>- Francesca Gomez (student)</strong></blockquote>\n\n\n\n\n\n<p>Having taught <strong>1000s of beginners</strong> Excel, they were instantly able to apply what they had learnt within this course.</p>\n\n\n\n\n\n<p>Here we welcome you to the <strong>Learn Microsoft Excel 2013 in 1 hour </strong>course, where you'll learn how to use Excel in real life scenarios based on a variety of case studies.</p>\n\n\n\n\n\n<blockquote><em>\"<em><em>Found instructor knowledgeable and course was easy to understand.</em></em>\"</em> - Stephanie Cooper (student)</blockquote>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>Guarantee: By the end of this course you will be able to use Excel in real life scenarios within just 1 hour.</strong></p>\n\n\n\n\n\n<p>Excel can be used for…</p>\n\n\n\n\n\n<ul> <li>Weekly planners</li> <li>Invoices</li> <li>Payroll systems</li> <li>Budget keeping</li> <li>Listing and sorting data</li> <li>Bookkeeping</li> <li>Customer and employee data</li> <li>Scheduling</li> <li>Almost anything that requires and uses data</li> </ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>And the best part is you can even use it at…</p>\n\n\n\n\n\n<ul> <li>Home</li> <li>Work</li> <li>An educational establishment</li> <li>Or just for fun - the possibilities are unlimited!</li> </ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>In our <strong>Learn Microsoft Excel 2013 in 1 Hour</strong> course we'll give you the<strong> recipe</strong> for making the most out of Excel. Even if you are completely new to Excel the <strong>simple</strong> <strong>step by step </strong>video tutorials, material and instructions will give you thorough guidance - everything you need in just <strong>4 easy steps.</strong></p>\n\n\n\n\n\n<p>No longer be in the dark as our fully accredited Microsoft certified instructors will shed light on how Excel operates; we will focus on…</p>\n\n\n\n\n\n<ul> <li>Creating worksheets which will turn you into an <strong>Excel Expert in less than 1 hour</strong></li> <li>Applying Excel to <strong>real life</strong> situations to enhance your results in your working environment</li> <li>Using the <strong>right</strong> <strong>tools that will boost your productivity by at least 33%</strong></li> </ul>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>Plus you'll receive 3 Bonuses for enrolling which are…</strong><br></p>\n\n\n\n\n\n<p><strong>Bonus #1: The Excel 2013 Elite Formula Cheat Sheet - </strong>formulas available on demand</p>\n\n\n\n\n\n<p><strong>Bonus #2: The 4 Step Excel 2013 Functions Guide - </strong>makes using functions and formulas simple and easy</p>\n\n\n\n\n\n<p><strong>Bonus #3: Special Udemy Reward - </strong>For those who are eager to learn, if you complete at least 50% of this course within the first 7 days of purchase and leave a review about your experience, we will reward you with a free course of your choice.</p>\n\n\n\n\n\n<p>*If this hasn't been taken down this Special Udemy Bonus is still available<br></p>\n\n\n\n\n\n<p><strong>The 30 Day Money Back Guarantee</strong></p>\n\n\n\n\n\n<p>As always, we offer our 30 day money back guarantee. Providing value is of the utmost importance to us and if you are not receiving the results you desire then we will ensure to refund you for the course.</p>\n\n\n\n\n\n<p><strong>Special Introductory Price - Rising Soon</strong></p>\n\n\n\n\n\n<p>Normally we usually charge $397, $697 and $997 for our Excel courses, but we will keep this special introductory price before increasing it, just for the Udemy community.</p>\n\n\n\n\n\n<p><strong>Enroll and Take Action</strong></p>\n\n\n\n\n\n<p>Join now and make the commitment of going through our course. It is sure to enhance your skills and level of knowledge with Excel.</p>\n\n\n\n\n\n<p>We look forward to seeing you in the course and remember to check out our previews.</p>\n\n\n\n\n\n<p>See you then</p>\n\n\n\n\n\n<p>How To Technology</p>", 
    "end_date": null, 
    "title": "Microsoft Excel - From Beginner to Expert in 1 Hour", 
    "price": "20.00", 
    "instructors": "How To Technology", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455006_8dc5_6.jpg", 
    "course_url": "https://www.udemy.com/learn-excel-2013-in-4-hours-from-beginner-to-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-23T18:35:32Z"
}