{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t     Need a place to backup your files or photos for free?  Want to use Microsoft Office tools for free?  </p>  <p style=\"\">  \t   OneDrive (formerly SkyDrive) is a free service from Microsoft that allows you store and share files from any device (PC, Mac, Windows Phone, Android Phone, iPhone, Windows Tablet, iPad, Android Tablet, etc).  With OneDrive you can easily share your photos, collaborate on documents, use the free Office Online tools to create Excel, Word, PowerPoint, and OneNote documents, and even create surveys.  </p>  <p style=\"\">  \t     Today, everyone is connected and everyone has lots of files and photos.  Unfortunately, not everyone is taking proper advantage of the cloud services like OneDrive to make sure those documents and photos are properly protected.  With OneDrive, every picture you take from your phone is immediately backed up.  With OneDrive, you can share files with your co-workers and friends.  With OneDrive, you can tag your photos, share slideshows, and so much more.  </p>  <p style=\"\">  \t  In this course, you will learn:  </p>  <ul style=\"\">  \t<li style=\"\">More about OneDrive and what it can do for you.</li>  \t<li style=\"\">How to get you OneDrive account.</li>  \t<li style=\"\">How to manage your documents and photos.</li>  \t<li style=\"\">How to use OneDrive on your PC or Mac.</li>  \t<li style=\"\">How to use OneDrive on your Smartphone.</li>  \t<li style=\"\">How to share documents and photos with others.</li>  \t<li style=\"\">How to work with others on a document at the same time.</li>  \t<li style=\"\">How to use OneDrive Partner Apps.</li>  \t<li style=\"\">And much more...</li>  </ul>  <p style=\"\">  \t  My name is Chris, I&#039;m the instructor for this course.  I have extensive knowledge of OneDrive and Office Online and I use these tools everyday from my PC, Windows Phone (my personal phone) and my iPhone (work phone) as well as from my tablet.  </p>  <p style=\"\">  \t  Thank you for reading this summary and considering this course. If you have any questions or suggestions please feel free to contact me on Udemy, on Twitter @cphelpsone, or via email at cphelpsone@hotmail.com.  </p><p style=\"\"><strong style=\"\">This course includes a full 30 day - no questions asked - Money Back Guarantee!</strong></p>", 
    "end_date": null, 
    "title": "Microsoft OneDrive - NEVER Lose Another File or Photo Again!", 
    "price": "20.00", 
    "instructors": "Chris Phelps", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/198444_99cd_19.jpg", 
    "course_url": "https://www.udemy.com/onedrive/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-13T20:24:13Z"
}