{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course is a Beginner to Advanced course on Word 2013. It is intended for people who want to<strong> master Word working and documents </strong>at work and want to learn how to create stunning, professional looking documents in Word.</p><p>I focused to include in this course the<strong> essentials of working with Word </strong>dashboard, formatting documents, adding lists, creating tables, creating professional documents and charts, being able to manage Word editing in minutes and create reports and documents in minutes.</p><p>By taking it, you will be able to understand in the step by step demonstrations and master by yourself everything you need to confidently create your own Microsoft Word documents and present the Word documents at work in a profesional way.</p><p>My name is Florin Rosoga, I started working with Microsoft Word with the '95 version, almost 20 years ago.</p><p>In all the companies I was later involved, managing data and creating Word Documents was essential. I learned how to manage, edit and present it in a way<strong> easy to understand </strong>that synthesize the essential of it and make it easy to understand in seconds.</p><p>In this course you will get <strong>step by step video explanations</strong> to help you understand in a <strong>comfortable </strong>way all about Word 2013 in minutes.</p><p>The entire ourse can be downloaded as a video training to watch or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next...<strong> click the Take this Course button top right</strong> and you'll be taken to our secure payment page.</p><p>Just <em><u>Enter Your Regular Details</u></em> and complete your investment to have immediate access.<br></p><p>Stop struggling with your Word documents and start mastering Word's most advanced features today!</p><p><strong>Thank you for reading this and learning about my course </strong>... I hope what I will teach you when you will start the course will help you make a huge performance leap!<strong> Click now on TAKE THIS COURSE</strong> to get started!<br></p>", 
    "end_date": null, 
    "title": "Microsoft Word Essentials: Create Amazing Word Documents", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631108_d416_5.jpg", 
    "course_url": "https://www.udemy.com/microsoft-word-masterclass-beginner-to-advanced-in-microsoft-word/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T09:11:32Z"
}