{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">This Microsoft Project 2010 Tutorial Video will teach you the intricacies of using this software. A Master instructor walks you through using MS Project 2010 starting with the basics. You watch the video capture of his actual desktop as he verbally explains exactly, step by step, what he is doing, learning even the most complex areas of Project is reduced to a series of easy to follow instructions.&nbsp;<br style=\"\"><br style=\"\">Beginning with a tour of the brand new interface to Microsoft Project 2010, this course shows you to to create a new project, add tasks, add resources, and deal with any problems that may crop up along the way. You will learn to read Gantt charts, and control how they look and behave specific to your own personal needs. You will learn how to use Master Projects, the new Timeline, even creating and saving Macro&#039;s within MS Project to make repetitive tasks easy to manage! This tutorial video comes complete with working files to allow you to work alongside the author as you progress through your training.&nbsp;<br style=\"\"><br style=\"\">By the completion of this video based training title, you will be fully capable of creating and managing your own project, no matter what the size or complexity, in Microsoft Project 2010.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Microsoft Project 2010 Tutorial Video - Beginners - Advanced", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/26591_8953_7.jpg", 
    "course_url": "https://www.udemy.com/learning-microsoft-project-2010-beginners-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-12T17:26:40Z"
}