{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course follows on from my earlier course 'Learn Microsoft Power BI'.  The skills you learn on this course will give you the tools to manipulate data at different levels in order to create the insight you want.   You'll be able to create insight with calculations and develop highly formatted dashboards suitable for publication.</p><p><strong>Acquire the Skills to be a Data Ninja </strong><br></p><p>Learn how to:</p><ul><li>Write SQL to query databases</li><li>Clean dirty data to get it ready for modelling</li><li>Create data models that unlock insights from multiple data tables</li><li>Enrich the model with DAX calculations</li></ul><p>Communicate insights by</p><ul><li>Creating executive level dashboards </li></ul><p><strong></strong><strong>Power BI is a new tool that empowers you to be a master of data rather than a servant of it.</strong></p><p>Previously these skills were limited to experts but with the modern software the technical barrier has been lowered to such an extent that most people are capable of producing and sharing dashboards.<br></p><p>The prerequisites  I have are</p><ul><li>Students must be data literate. </li><li>Excel users will have no problem learning Power BI. </li><li>I'm assuming you've completed my earlier course 'Learn Microsoft Power BI'.</li></ul><p>SQL or BI developers probably won't get a lot from this course apart from DAX Calculations and Dashboard skills.   </p><p>The type of terminology used on this course includes, Tables, Rows, Fields, Joins,  Relationships, Models, Calculations, Filtering, Visualizations.</p><p>The course is taught using screencasts, slides.</p><p>The files I use on the course are available for you to download.  As long as you install SQL server with the sample databases you'll be able to follow along.</p><p>It can take between 2.5 and 3 hours to take this course.</p><p>There are over 2.5 hours of screencasts.</p><p>The course is structured using key learning points, allowing you to build upon skills as you progress through the course.  At the end of the course you'll have the skills to manipulate data to suit the requirements for complex dashboards.</p><p>The skills you'll gain on this course will help boost your career as you'll be seen as a powerful steward of data.<br></p><p>Power BI is becoming increasingly in demand in organisations of all sorts of sizes. Take advantage of this opportunity today and hit that enroll button.</p>", 
    "end_date": null, 
    "title": "Microsoft Power BI Intermediate", 
    "price": "20.00", 
    "instructors": "Lee Hawthorn", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792546_5061_2.jpg", 
    "course_url": "https://www.udemy.com/power-bi-intermediate/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T16:26:42Z"
}