{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><strong>&gt;&gt; Special Price ONLY - Increasing To $97 Soon\n&lt;&lt;</strong><br></strong></p>\n\n<p><strong>&gt;&gt; Updated for June 2016 &lt;&lt;</strong><br></p>\n\n\n\n\n\n<p><strong>How great would it be if you could learn Microsoft PowerPoint in just 2 hours? Imagine going from beginner to expert in just 2 hours. This is all possible in just 4 simple and easy steps.</strong></p>\n\n\n\n\n\n<p><strong>Why You Should Take This Course?</strong></p>\n\n\n\n\n\n<blockquote><em>\"<em></em><em>I found lots of great information on this course about PowerPoint. Recomended.</em>\"</em> - Alaa Essam Abdalla Hassan Ali (student)</blockquote>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>Having trained 1000s of beginners PowerPoint, they have instantly been able to apply what they have learnt from this course.</p>\n\n\n\n\n\n<p>Here we welcome you to the <strong>Learn PowerPoint 2013 in 2 hours </strong>course, where you will master everything you need to know about PowerPoint and deliver supreme presentations for your target audience.</p>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<blockquote><em>\"<em></em><em>The instructor explains lectures well and gives good examples. Normally i strugglw with courses but he made the learning process easy. Find out helpful things I didn't know PowerPoint could do.</em>\"</em> - Amit Deepak (student)</blockquote>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>Guarantee: By the end of this course you will be able to create and deliver supreme PowerPoint presentations within just 2 hours.</strong></p>\n\n\n\n\n\n<p><strong>In this course you will learn:</strong></p>\n\n\n\n\n\n<p>-The Many Benefits of SmartArt, Tables &amp; Charts</p>\n\n\n\n\n\n<p>-How to Fully Engage Your Audience With Animations &amp; Transitions</p>\n\n\n\n\n\n<p>-The Unstoppable Secrets To Working With Objects &amp; Images</p>\n\n\n\n\n\n<p>-How to Ace Your New Super Charged PowerPoint Presentations</p>\n\n\n\n\n\n<p>-The Hidden Power of Views and how to properly use them</p>\n\n\n\n\n\n<p>In our<strong> Learn PowerPoint in 2 Hours </strong>course we will provide you with the ultimate guide to becoming an expert in PowerPoint. Even if you have no experience and you're completely new to PowerPoint the material, video tutorials and instructions will guide you in the right direction. All of this in just <strong>4 simple steps.</strong></p>\n\n\n\n\n\n<p>No longer feel overwhelmed or nervous when creating and pitching presentations, as our fully accredited Microsoft certified instructors will give you all the solutions and answers you need for getting the most out of PowerPoint.</p>\n\n\n\n\n\n<p><strong>In addition, you shall receive these 2 bonuses:</strong></p>\n\n\n\n\n\n<p>-<strong>The VIP Advanced Tactics PowerPoint 2013 Handbook</strong> - No longer feel the burden of being overwhelmed or nervous when presenting to your audience</p>\n\n\n\n\n\n<p>-<strong>The Ultimate PowerPoint Shortcut Guide</strong> - Save time and gain even more results with these essential shortcuts</p>\n\n\n\n\n\n<p><strong>The 30 Day Money Back Guarantee</strong></p>\n\n\n\n\n\n<p>As always, we offer our 30 day money back guarantee. Providing value is of the utmost importance to us and if you are not receiving the results you desire then we will ensure to refund you for the course. In addition we are also including a <strong>special offer</strong>…</p>\n\n\n\n\n\n<p><strong>***Special Udemy Bonus - 15 Minute Strategy and Solutions Call (limited to first 50 individuals)***</strong></p>\n\n\n\n\n\n<p>As we fully believe in your success, we want to make sure that for the first 50 individuals who fully complete the course, they will receive a 15 minute Strategy and Solutions call.</p>\n\n\n\n\n\n<p>If this hasn't been taken down this Special Udemy Bonus is still available.</p>\n\n\n\n\n\n<p><strong>Special Introductory Price - Rising Soon</strong></p>\n\n\n\n\n\n<p>Normally we usually charge $397, $697 and $997 for our Elite PowerPoint courses, but we will keep this special introductory price before increasing it, just for the Udemy community.</p>\n\n\n\n\n\n<p><strong>Enroll and Take Action</strong></p>\n\n\n\n\n\n<p>Join now and make the commitment of going through our course. It is sure to enhance your level of knowledge and skills with PowerPoint.</p>\n\n\n\n\n\n<p>We look forward to seeing you in the course and remember to check out our previews.</p>\n\n\n\n\n\n<p>See you then</p>\n\n\n\n\n\n<p>How To Technology</p>", 
    "end_date": null, 
    "title": "Microsoft PowerPoint - From Beginner to Expert in 2 Hours", 
    "price": "20.00", 
    "instructors": "How To Technology", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/478144_0634_4.jpg", 
    "course_url": "https://www.udemy.com/learn-powerpoint-2013-in-2-hours-from-beginner-to-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T15:45:19Z"
}