{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Create Successful Projects Like a Pro with Microsoft Project 2013</strong></p><ul style=\"\"><li>Master the Fundamentals of Microsoft Project</li><li>Export Data to Other Programs</li><li>Create Visually Pleasing Presentations</li><li>Manage and Complete Tasks Efficiently</li></ul><p><strong style=\"\">A Comprehensive Project-Creation Tool from Microsoft</strong></p><p>Microsoft Project is one of the only Microsoft programs not offered in the popular Microsoft Office suite, which includes Excel, PowerPoint, and Word. Project is available in a standard as well as a professional version. The professional version includes extra features, such as tools for team collaboration and access to Microsoft&#039;s Project Server. Both versions allow users to keep track of every aspect of a variety of project types, including the ability to share and communicate between programs, trace task paths, and create graphical reports.</p><p><strong style=\"\">Overview and Contents</strong></p><p>This course is designed for those who are new to Microsoft Project 2013, as well as those who are upgrading to 2013 from previous versions of the software. Knowledge of Microsoft Project is a great tool for anyone whose job involves managing many people and resources. The only requirement is access to the Microsoft Project 2013 program.</p><p>Over the course of sixty-three lectures, downloadable transcripts and MP3s, and more than thirteen hours of content, this Simon Sez IT tutorial will guide you through the fundamentals of Microsoft Project, beginning with the basics, and marking your progress with an online quiz. Content will cover: designing custom projects, using templates, learning to trace task paths, exporting your work to other Microsoft programs, uploading to the cloud, accessing the ribbon and other toolbars, managing tasks, allocating resources, defining deadlines, managing calendars, and much more.</p><p>Upon completion of this course, you will possess all the tools you need to use Microsoft Project 2013 to organize, access, and deliver your projects on time.</p>", 
    "end_date": null, 
    "title": "Microsoft Project 2013 Beginners/Intermediate Training", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50411_9078_5.jpg", 
    "course_url": "https://www.udemy.com/microsoft-project-2013-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-18T18:59:22Z"
}