{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>LEARN POWERPOINT 2013 \"FROM ZERO TO HERO\" WITH THIS CRASH COURSE. GET FROM TOTAL NEWBIE TO A SOPHISTICATED POWERPOINT USER.</strong><br></p><ul><li>Do you struggle to get started in any presentation software?</li><li>Are you searching for a shortcut to master PowerPoint 2013?</li><li>Do you want to work efficiently, create outstanding designs and get to know the most important functions of the program in one sweep?</li></ul><p>This course cooks your brain in that regard and creates a knowledge influx which you will eat like a cake with pleasure. I am an experience PowerPoint teacher and made this <strong>course approachable for everyone! No matter of Your prior PowerPoint knowledge!</strong></p><p>------------------------------------------------------------------------------------------------------------------- </p><p><strong>The course is divided in 3 comprehensive chapters to make it easy to follow:</strong></p><ol><li>Beginner - Workflow &amp; Tips - where I share the most important things you will need to know before moving forward</li><li>Intermediate - Workflow &amp; Tips - Interesting PowerPoint essentials which are enhacing your workflow and making you more familiar with the program</li><li>Advanced - Workflow &amp; Tips - Very usefull knowledge which will distinguis you from the common powerpoint user who only knows how to add slides, populate them with text and present boring presentations like that. Upgrade your skillset with those lectures</li></ol>All that is rounded up by an introduction and conclusion to make you firstly aware of the most important features and navigation through the program and later on to conclude the informations shared. I've made sure to make this course consistent and on-point to not waste your time on things that are obvious.<p>------------------------------------------------------------------------------------------------------------------- </p><p><strong>With help of this course you will:</strong></p><ul><li>Increase Your PowerPoint skillset and move from total beginner to advanced</li><li>Improve Your workflow in less than 2 hours</li><li>You will be able to work quickly and efficient in PowerPoint because I will share my most used techniques</li><li>Be able to complete a well designed slide, record online videos and youtube videos with PowerPoint and much more above that</li></ul><p>------------------------------------------------------------------------------------------------------------------- </p><ol></ol><p>If you do not know where to start and would like to quickly get a grasp about the sofware, it's usage, it's most essential tools and what is more important a real-world example worflow <strong>take this PowerPoint Crash Course to solve all these struggles....enroll now!</strong></p>", 
    "end_date": null, 
    "title": "Microsoft Powerpoint 2013 Crash Course: Master Powerpoint", 
    "price": "20.00", 
    "instructors": "Andrzej Pach", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572168_b277_3.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-2013-crash-course-beginner-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T07:13:31Z"
}