{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>If you are concerned that network users can, intentionally or by accident, alter or modify settings or code in your networked database, you have come to the right place!  Every single step is covered for maximizing the security of the front end/back end databases from the Network 1 course!   Having installed Access on dozens of networks, I have had to develop methods to prevent users from being anywhere in the system that I don't want them to be.  So why suffer through another phone call for errors that could be completely avoided? I will show you how to eliminate the possibility of them ever happening!</p>\n\n<p>This course shows you how to many techniques for using VBA to control how users log in to and use the database. If you have no familiarity with VBA, you may get frustrated, but every step is illustrated and you are provided with beginning and ending versions of the databases.  For some this could be a quick intro into the incredible power of VBA that will convince them that they really should take the Intro to VBA course.  For others who have already done all or part of that course, 90% these techniques are totally new and will extend the students knowledge of VBA quite a bit.</p>\n\n\n\n<p>Most of the employees in my client businesses have small networks staffed with people who <u>know nothing about Access</u> and they don't want to have to figure out how the ribbon and navigator work, that is why they are always hidden.  The systems I build using these techniques let people with zero knowledge of Access get productive on the network quickly.  Believe me, there is a <em><u>huge and growing need</u></em> for people who can setup easy to use shared database networks like these and there just aren't enough people who know how to do it right! <br></p>\n\n\n\n\n\n<p>None of this is theory and you won't find these techniques in any book. The content of this course is a breakdown of the methods I successfully use to administer dozens of networks for my client businesses. I learned a long time ago that you have to automate every routine job that you can, but also you must eliminate downtime for your client and yourself by making silly mistakes. These methods of keeping the network users from even seeing anything they do not need to know about just increase productivity and reduce downtime.  </p>\n\n\n\n<p>Just take a look at the demo video and see what logging into the finished database looks like.  It doesn't look much like Access!  Many of the employees in my client businesses do not even know they are using Access (and they really don't care).  All they know is it is way easier to get their job done than it used to be! </p>\n\n\n\n\n\n<p>Follow along as I take you step by step through the modification of the front and back end databases from the Networking Made Simple course and show you tools that you will be using for years to come! This course will show you :<br></p>\n\n\n\n\n\n<ol><li>How to \"Encrypt\" an Access database.</li><li>How to link to encrypted backend databases from the frontend.</li><li>The basics of creating a User Login table.</li><li>How to create a simple, yet powerful login form.</li><li>How to validate passwords and determine the employee security level.</li><li>How to develop a secure database without locking yourself out.</li><li>How to create a \"dialog\" login form that cannot be bypassed.</li><li>How to hide or unhide the menus and Navigation Pane.</li><li>How to set database security properties.</li><li>How to create a custom BLANK ribbon!</li><li>How to build in a backdoor for Administrators.</li><li>How to Password Protect all your VBA Code.</li><li>How to Deploy the Updated Database</li></ol>\n\n\n\n\n\n<p>If you take the time to learn these techniques you will save <strong>MANY HOURS</strong> of time and avoid wasting time on problems caused by users being where they should not be in the database!</p>\n\n\n\n\n\n<p>If you want to become the <strong><u>Network Database Guru</u></strong>, click the <strong><u>Take This Course</u></strong> button to get started on this journey to increased productivity and higher value for you in the marketplace. Think of it! In just a few HOURS you know more about securing databases and controlling users on an Access network than almost everyone else!<br></p>", 
    "end_date": null, 
    "title": "Microsoft Access Networking 2: Maximum Security", 
    "price": "20.00", 
    "instructors": "Bruce Myron", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822468_9435.jpg", 
    "course_url": "https://www.udemy.com/access-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T04:06:05Z"
}