{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>ÚLTIMA ACTUALIZACIÓN: 09-11-2015</strong></p><p><strong>Nueva clase y desafío: Conector Y en Access y desafío #2...consultas un poco más complicadas.</strong></p><p>¡WOW, mas de 25 alumnso en un sólo día!</p><p>El dominio de Microsoft Access es una de las habilidades más buscadas por los empleadores. Además, el que sabe utilizar esta herramienta tiene una ventaja por sobre los demás a la hora de postular a un trabajo. De hecho, en un gran porcentaje de anuncios de trabajo y para varios tipos de cargos, las empresas piden como requisito tener conocimientos de Base de Datos. Si no cumples con este requisito, estarás fuera de mercado y no podrás optar a mejores y más rentables empleos. ¡Aprende hoy Access para no quedar fuera!</p><p>En este curso veremos, entre otras cosas:</p><ul><li>Conceptos básicos desde cero: Como iniciar Access, cómo anclar access al escritorio, la pantalla de Access, , campos y registros.</li><li>Aprenderemos a crear y relacionar tablas.</li><li>Quedarás experto en crear consultas básicas e intermedias.</li><li>Te familiarizarás con los formularios de Access.</li></ul>Al final de este curso ya NO te serán extrañas las bases de datos y podrás utilizar esta nueva habilidad para aportar valor en tu trabajo e impresionar a tu jefe y compañeros.<p>Este curso está dirigido a personas sin conocimientos previo de esta aplicación y a quienes tengan la necesidad de aprender sobre Bases de Datos y específicamente aprender a utilizar Microsoft Access. Como requisito es necesario contar, al menos, con conocimientos básicos del manejo del sistema operativo, del mouse, manipulación de archivos y carpetas, y conocimientos matemáticos simples.</p>", 
    "end_date": null, 
    "title": "Microsoft Access Básico - Obtén mejores ingresos y empleos.", 
    "price": "20.00", 
    "instructors": "Alfonso Rinsche", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550142_b47d_3.jpg", 
    "course_url": "https://www.udemy.com/accessbasico/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-09T14:55:20Z"
}