{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<h5>A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p>This Microsoft Outlook 2010 training course from InfiniteSkills provides a complete guide to streamlining email, calendars and organization within this massively popular Office program. This multi-part course shows not only how to set up the application to fit your professional needs but also how to save time by becoming more organized and accomplishing basic tasks more efficiently. The training starts with the basics of what Outlook 2010 is, as Guy leads viewers through the configuration of email accounts, email organization options, and using the program&#039;s contacts, calendar, tasks, and notes features. The course even covers connecting to a Microsoft Exchange Server, which users working within a bigger business environment will especially find useful. By focusing on professional, real world challenges and tasks, the Outlook course helps you understand its role as a critical business tool.</p>  <p><br style=\"\" /> <strong style=\"\">What You Will Learn<br style=\"\" /> </strong></p>  <p>- How to create professional quality emails, professional notes and boardroom-ready events and invitations with one of the world&#039;s leading office communications tools.<br style=\"\" /> - How to manipulate and implement contact and organizational data data across a wide range of projects and accounts.<br style=\"\" /> - How to create fully compatible meetings, contact cards and messages that can be accessed by users working with Office products and common industry standards.</p>  <p><br style=\"\" /> <strong style=\"\">Who Should Take This Course</strong></p>  <p>- Anyone who has used Microsoft Outlook in the past but wanted a better understanding of its full range of features.<br style=\"\" /> - Anyone who has high demands for email organization, task management and communications requirements.<br style=\"\" /> - Anyone who needs an understanding of Microsoft Office software as it applies to a professional work or academic environment.<br style=\"\" /> - Any user new to MS Outlook wanting a user-friendly guide that introduces the program from the ground up.</p>  <p><br style=\"\" /> <strong style=\"\">What People Are Saying</strong></p>  <p>&quot;I feel far more organized and far more efficient from the minute I log onto my machine at work. Can&#039;t think of a better way to learn. Thank you.&quot;<br style=\"\" /> - J Waterford<br style=\"\" /> &quot;Guy gives the insiders&#039; guide...he goes through just about all the tools, and he&#039;s really good at showing which ones work the best.&quot;<br style=\"\" /> - Mark Escovedo</p>", 
    "end_date": null, 
    "title": "Microsoft Outlook 2010 Tutorial - Learning Made Easy", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17262_4cb4_9.jpg", 
    "course_url": "https://www.udemy.com/learning-microsoft-outlook-2010/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-05T00:14:57Z"
}