{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p></p><p><strong>What is the “Microsoft Excel Training: Learn Excel 2010” course\r\nabout?</strong></p>\r\n\r\n<p>In this Excel training course, you will\r\nlearn efficient and effective ways to work in Excel environment from Dr. Chris\r\nAlbright from Indiana University (you should Google him!). This comprehensive\r\nMicrosoft Excel training course covers all the topics from beginners to\r\nadvanced level. Instead\r\nof focusing on the length of the course, we focus on how effective the course\r\ncan be; we value your time. We will teach you everything you need to know, all\r\nthe way up to passing the Microsoft Excel exam, in little more than 8 hours\r\nvideos.&nbsp; These videos are broken down\r\ninto 125 topics. All of these topics also come with Read and Practice workbook\r\nwhere you will be able to apply what you learned. </p>\r\n\r\n<p>When we\r\ncreated this course, we had five things in mind. </p>\r\n\r\n\r\n\r\n<p></p><ol><li><span>This Excel training course needs to be fun!</span><br></li><li><span>It has to\r\nshow the power of Excel.</span><br></li><li><span>It has to\r\nshow the real world applications of Excel.</span><br></li><li><span>It has to\r\nraise your curiosity as you go from beginners to advanced topics.</span><br></li><li><span>It has to\r\nremind you about what you have already learned.</span><br></li></ol><p></p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>Since you\r\nwill spend most of the time in this course within Excel, you will love your new\r\nExcel tab, “Excel Now!”. You will be able to read, practice and watch videos,\r\nall inside your own MS Excel under this tab. As you learn new topics, you will\r\nfind yourself looking forward to seeing how the future topics work. And as you\r\ngo forward, we will also remind you about what you have already learned. You\r\nwill get plenty of opportunity to apply your new Excel skills and see the power\r\nof Excel along the way. Trust me, it will be fun!</p>\r\n\r\n<p><strong>What kind of materials are included?</strong></p>\r\n\r\n<p>Reading\r\nWorkbooks, Practice workbooks, Videos, Tip Files and an add-in that will allow\r\nyou to access any part of this course from within your Excel Application. </p>\r\n\r\n<p><strong>How long will the “Microsoft Excel Training: Learn Excel 2010”course\r\ntake to complete?</strong></p>\r\n\r\n<p>The course\r\nis only 8 hours long, but give yourself about 15 hours to master Excel. </p>\r\n\r\n<p><strong>How is the course structured?</strong></p>\r\n<p>For windows\r\nwith Excel 2007 or 2010, you will get a tab in Excel called Excel Now!. This\r\ntab will have 125 topics with reading, practice and videos material built in.\r\nSee the screenshots.&nbsp; </p>\r\n\r\n<p>For Mac\r\nusers, you will find all of the material here on Udemy page. </p>\r\n<p><strong>Why take this Microsoft Excel training\r\ncourse?</strong></p>\r\n<p>This course\r\nis created by experts with you in mind.</p>\r\n<p>Many\r\nuniversities require our course for their students. </p>\r\n<p>Our Excel training course will make you\r\nefficient and effective in Excel in less than 15 hours.</p>\r\n\r\n<p>You will be\r\na rock star of Excel at School and Work. </p>\r\n\r\n<p>And above\r\nall, you want to!</p>\r\n\r\n<p>Sign up for this Microsoft Excel Training\r\ncourse now and learn Excel 2010 from expert.</p><p></p>\r\n", 
    "end_date": null, 
    "title": "Microsoft Excel 2010 Training Course - Online/Offline Access", 
    "price": "20.00", 
    "instructors": "Chris Albright", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/26016_0cde_6.jpg", 
    "course_url": "https://www.udemy.com/excelnow/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-04T21:41:00Z"
}