{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p> Master Microsoft Access 2013 quickly with this practical hands-on 10 hour course - A comprehensive resource for users of all levels  </p><p>  \t  This Microsoft Access 2013 training course from Infinite Skills teaches you how to use Access to create a database and build an interface to retrieve and report on your data. This course is designed for the absolute beginner; no prior database design or Microsoft Access experience is necessary in order to get the most out of this video tutorial.  </p>  <p>  \t<br>  \t  Starting with a tour of the interface, this computer based training video will show you how to design and create a table, build queries, and comprehensively demonstrates the creation, and functions, of forms and reports. As you move through the video tutorial, the course covers other topics such as; how to create advanced forms, customizing your reports, and building action queries. Finally, he will take you through the process of creating your own custom web app with Access 2013.<br>  \t<br>  \t  By the completion of this training course, you will be capable of creating databases as well as reports and forms in Microsoft Access 2013, and you will have in-depth knowledge of the tools and functions available to you in this software. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Microsoft Access 2013 Tutorial -A Definitive Guide To Access", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/93102_a68b_12.jpg", 
    "course_url": "https://www.udemy.com/microsof-access-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-16T17:19:11Z"
}