{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<h5 style=\"\">A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p style=\"\">This complete Microsoft Word 2010 training course from InfiniteSkills provides over 100 lessons on the program&#039;s powerful everyday composition tools and extended range of functionality. Whether you&#039;ve been using Word for years and are wanting to take your skills to the next level or you&#039;re starting out with the program for the first time, these hands-on lessons will show you exactly what it takes to produce professional letters, documents and forms from start to finish. The Word tutorial videos begin by helping you learn where the program&#039;s essential tools are: the ribbon, the toolbar, help and other handy options. The course then moves forward to cover editing text, formatting text, inserting images, performing mail merges, proofing, printing, and more. The expert instruction puts the creative process directly onscreen. Even complete beginners will find this powerful Word training easy to follow.</p>  <p style=\"\"><br style=\"\"> <strong style=\"\">What You Will Learn</strong></p>  <p style=\"\">- How to create professional quality letters, manuals and presentation-ready documents with one of the world&#039;s leading office productivity tools.<br style=\"\"> - How to manipulate and implement text and data within complex projects and workflows, including business letters, documentation and email campaigns.<br style=\"\"> - How to create fully compatible documents and projects that can be accessed by users working with Office products and common industry standards.<br style=\"\"> <br style=\"\"> <strong style=\"\"></strong></p>  <p style=\"\"><strong style=\"\">Who Should Take This Course</strong></p>  <p style=\"\">- Anyone who has used Microsoft Word in the past but wanted a better understanding of its full range of features.<br style=\"\"> - Anyone who needs an understanding of Microsoft Office software as it applies to a professional work or academic environment.<br style=\"\"> - Any user new to MS Word wanting a user-friendly guide that introduces the program from the ground up.</p>  <p style=\"\"><br style=\"\"> <strong style=\"\">What People Are Saying</strong></p>  <p style=\"\">&quot;Tim has an awesome teaching style...he really covers the program from top to bottom and pointed out some handy features I never knew existed.&quot;<br style=\"\"> - Veronica Golding<br style=\"\"> <br style=\"\"> &quot;I have to say the biggest thing this course did for me was save me time. I could already use Word at a basic level, but now I know more and can do the basic tasks five times faster.&quot;<br style=\"\"> - Stephen Hartung</p>  ", 
    "end_date": null, 
    "title": "Microsoft Word 2010 Tutorial - Learning Made Easy", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17263_0050_9.jpg", 
    "course_url": "https://www.udemy.com/learning-microsoft-word-2010/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-05T00:21:26Z"
}