{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t Ce cours avancé Excel 2013 fait suite au cours de niveau débutant/intermédiaire Excel 2010 en approfondissant l’utilisation des fonctionnalités les plus connues et en découvrant d’autres outils indispensables pour une utilisation plus poussée du célèbre tableur.<br style=\"\">  \t <br style=\"\">  \t Ainsi vous approfondirez l’utilisation des fonctions de base (SI, fonctions de recherche…) et en découvrirez de nouvelles (MOYENNE.SI, SOMME.SI...). Ce didacticiel vous enseignera également l’utilisation des graphiques de tendance (Sparklines) et vous apprendrez aussi à manipuler les tableaux croisés dynamiques, indispensables lorsque vous travaillez sur d’importantes bases de données. Enfin vous découvrirez l’utilité des macros sous Excel, vous permettant d’automatiser certaines tâches.<br style=\"\">  \t <br style=\"\">  \t Ce didacticiel n’est pas destiné aux débutants. Vous devez maîtriser les bases de Microsoft Excel avant de visionner ce cours.<br style=\"\">  \t <br style=\"\">  \t Pour conclure, ce cours Microsoft Excel 2013 vous permettra d’apprendre à utiliser les fonctionnalités avancées d’Excel de façon autonome et de gagner ainsi en productivité. Les fichiers sur lesquels l’auteur travaille à l’écran vous sont fournis, pour que vous puissiez suivre le didacticiel tout en manipulant Excel en parallèle.  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2013 Pro (en français)", 
    "price": "30.00", 
    "instructors": "Christian Tiessen", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176616_1f53_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2013-pro-en-francais/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T13:08:36Z"
}