{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Microsoft Excel</strong>, Microsoft tarafından Microsoft Windows ve Apple Macintosh işletim sistemleri tabanında çalışmak üzere yazılan ve dağıtımı yapılan bir tablolama programıdır <strong style=\"\">(<em style=\"\">spreadsheet</em>).</strong> İçinde bulunan detaylı finansal çözümlerin yapılabildiği tablolama, grafikoluşturma başarısı ve uygulamalarda kullanılabilecek Visual Basic makro programlama dili sayesinde kendi türünde şu anda dünyadaki en popüler yazılımdır.Microsoft Excel, Microsoft Office&#039;in bir parçasını oluşturur.Microsoft Excel bütün temel tablolama işlemlerine sahiptir, numaralandırılmış sıralardan ve harflerle isimlendirilmiş hücrelerden oluşan bir ızgara kullanarak aritmetik işlemler gibi veri manipülasyonları organize eder. İstatistik, mühendislik ve finansal ihtiyaçları karşılayan fonksiyonlara(fonksiyonların piline) sahiptir. Ayrıca, çizgisel grafikleri, histogramları ya da çizelgeleri ve bir de çok kısıtlı olarak 3 boyutlu grafikleri görüntüleyebilir. Verileri farklı açılardan çeşitli bağımlılıklarına göre kısımlara ayırmaya izin verir. Ayrıca kullanıcıya diferansiyel denklemleri çözme ve daha sonra tabloya sonuçları bildirme gibi imkanlar sunan geniş bir sayısal metot temelli programlama yönü de vardır,<strong style=\"\"><em style=\"\">Visual Basics for Applications</em>.</strong> Son olarak, tabloyu tamamen kullanıcıdan gizleyip kendisini <strong style=\"\"><em style=\"\">uygulama</em> veya <em style=\"\">karar destek sistemi</em>(DSS)</strong> gibi göstermesini sağlayan geniş interaktif kullanıcı arayüzleri vardır. Daha ayrıntılı açıklamayla, bir Excel uygulaması güncel bir listeyi kullanarak otomatik olarak dışarıdan bir veritabanını yoklayabilir, sonuçları analiz edebilir, bunlarla bir Power Point slayt şovu hazırlayabilir veya Word raporu yazabilir ve bunları belirli aralıklarla katılımcılara e-posta yolu ile gönderebilir.</p>", 
    "end_date": null, 
    "title": "Microsoft Excel ", 
    "price": 0, 
    "instructors": "Mühendis Bilgin Kıyak", 
    "commitment": null, 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442066_e71c_22.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel2/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T18:18:56Z"
}