{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong></strong><strong>Microsoft Access Three Course Bundle:</strong></p><ul><li><strong>Access Database Tips:</strong> Time Saving Access Questions Answered</li><li><strong>Microsoft Access Macros:</strong> Automate Your Access Database </li><li><strong>Microsoft Access SQL:</strong> SQL for Non-Programmers</li><li><strong>30 DAY MONEY BACK GUARANTEE</strong></li><li><strong>Click the Green \"Take This Course\" button to Learn Microsoft Access Tips, Macros, and SQL from Anywhere, Anytime</strong></li></ul><p><strong><br></strong></p><p><strong><em>So, what's in this course for you?</em></strong></p><p><strong><em><br></em></strong></p><p><strong>:: Access Tips &amp; Strategies ::</strong></p><p><strong>Learning Microsoft Access tips will absolutely make your workday easier.</strong><br></p><p>From importing and exporting data with Microsoft Excel, to restricting data that is entered into your tables.</p><p>Create cascading combo boxes that display information based off of data in another combo box.</p><p>You'll also find pro tips on using reports, and queries, documenting your database, and simplifying navigation.</p><p><br></p><p><strong>:: Creating Macros for Saving Time ::</strong><br></p><p><strong>Learn to create Macros for more control over the database, get work done faster, and feel efficient.</strong></p><p>You don't need to know any VBA code, you just need a willingness to want to save time with macros, to upgrade your skills, and to invest a few hours of time in the process.</p><p><br></p><p><strong>:: Learning How SQL Can Interact with Your Database ::</strong><br></p><p><strong>This week you can start learning SQL, step by step, and improve your skills.</strong></p><p>Learn to use SQL in your Access databases from the beginning. Select data, as well as filter, and sort.  Learn to create table, and about joins. No prior SQL experience required.</p><p><br></p><p>This bundled course can be completed in hours, but the information can last a lifetime.</p><p>So if you are beyond the basic beginner stage in Access, and want a convenient way to learn, I invite you to enroll.</p><p>This is not an advanced Access course, though advanced users are welcome, and might benefit from lectures within the course.</p><p>Take a look at the course curriculum to help decide if this informative, easy-to-follow course is for you.</p><p>You only have <strong>MICROSOFT ACCESS DATABASE SKILLS</strong> to gain<strong>.</strong><br></p><p>So <strong></strong><strong>Click The Take\nThis Course Button On The Right &amp; I'll See You In Class!</strong><strong></strong></p>", 
    "end_date": null, 
    "title": "Microsoft Access: Beyond the Basics of Access Bundle", 
    "price": "50.00", 
    "instructors": "IsáBel Harrison", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609466_8cad_6.jpg", 
    "course_url": "https://www.udemy.com/microsoft-access/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T21:04:12Z"
}