{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Beginners Step-by-Step Guide to Microsoft Project 2016 </strong></p>\n\n<ul><li>Complete beginner's course gives you extensive mastery of Microsoft Project 2016</li><li>Now have professional organization to any job or project</li><li>Learn valuable new skills for complex projects at work</li><li>Starts right at the beginning with an easy intro to the software</li><li>Clear introduction to the Workspace, The Ribbon, and Help basics, Project Options, and Task Basics</li><li>Gets you started with using Project 2016 on a touch device</li><li>Advance to greater complexity with Subtasks, Dependencies, Deadlines, and Resources</li><li>Learn how to work with costs, deadlines, and overcome scheduling issues</li><li>How to save your project as a template for future projects</li><li>Practice along with included exercise files</li><li>9 hours of professional video with 63 individual lessons that make everything clearer and easy to remember</li></ul>\n\n\n\n<p><strong> </strong></p>\n\n\n\n<p><strong>Learn Microsoft Project 2016 For Beginners</strong></p>\n\n\n\n<p>Here is the easy to understand training every beginner project manager needs to quickly master Microsoft Project 2016. This was one of Microsoft's very first applications created way back in the 1980s. It has since become a standard and constantly evolving tool for project managers.</p>\n\n\n\n<p>Microsoft Project helps you develop a plan, assign resources to tasks, track progress, manage your budget, and analyze workloads. This video course, taught by a professional trainer with a background in project management, takes you step by step from the very beginning through all these functions. You go from very simple projects to more complex understanding and operation of Project's capabilities.</p>\n\n\n\n<p>Since Microsoft Project 2016 is used in a great many businesses and organizations, the skills you learn here could make you more valuable at work. </p>\n\n\n\n<p><strong>Contents and Overview</strong></p>\n\n\n\n<p>This course starts right at the very beginning. It doesn't assume you know anything about Microsoft Project. Beginners will feel right at home. </p>\n\n\n\n<p>The first video lesson introduces you to the software. You learn how to get your own copy of Project 2016, what's new in version 2016, and the structure of this course.</p>\n\n\n\n<p>The 2nd chapter takes on the basics you need to start using Project 2016. It first discusses the Help section where you can get answers and tutorials for any question that comes up. This chapter also discusses creating a Workspace, using Toolbars, using Ribbons, and the Status Bar.</p>\n\n\n\n<p>Next comes using Touch, Task basics, and Project Options. By now students are becoming proficient with Project 2016. The chapters that follow lead learners through all the various aspects of managing a project.</p>\n\n\n\n<p>These more advanced topics carry the student through Tracking Costs, Tracking the Project, Budgeting, and Reporting.</p>\n\n\n\n<p>Each topic is explained with its own professional video that shows you in detail how to properly use the function. Nine hours of enlightening video gives you in-depth understanding of each topic.</p>\n\n\n\n<p>There are 63 individual lessons included. Students will complete the course with an excellent mastery of Microsoft Project 2016, one of the world's most popular software applications.</p>", 
    "end_date": null, 
    "title": "Microsoft Project 2016 For Beginners: Master the Essentials", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/772712_07fe_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-project-2016-training-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-24T08:39:49Z"
}