{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<ul style=\"\"><li style=\"\"><strong style=\"\">Você terá direito à receber um Certificado Digital oferecido pelo Portal Udemy na conclusão do curso.</strong></li><li style=\"\"><strong style=\"\">Você quer aprender e dominar o Excel ?</strong></li><li style=\"\">Você terá uma visão abrangente do Aplicativo partindo dos Menus do Excel, entenderá a estrutura das Guias ou Faixas de opções de maneira que conseguirá adequá-las do seu jeito para otimizar seu trabalho, aprenderá a criar planilhas do zero e conhecerá diversos tipos de formatações para deixá-las com um visual muito agradável, conseguirá desenvolver fórmulas e usar funções simples e avançadas que atenderão uma boa parte das necessidades que surgem nos departamentos, acreditamos que levar à você conhecimento dos recursos bases dos Ambiente do Excel adquira segurança e controle para continuar explorando e aprimorando seu aprendizado no Aplicativo.<span style=\"\"></span></li><li style=\"\"><strong style=\"\">O que você aprenderá ?</strong></li><li style=\"\">Dominar os menus, os diversos ambientes, configurações simples e avançadas, guias ou faixas de opções, grupos de comandos, comandos, pastas, planilhas, linhas, colunas, células, formatações numéricas, textos, datas, classificações, filtros simples e avançados, painéis, agrupamentos, objetos gráficos, galeria de funções, assistente de funções, sintaxes, diversas funções de várias categorias, funções avançadas, aninhadas, função se(), soma(), média(), procv(), somase(), mediase(), funções de contagens, referência absoluta, estrutura de criação de tabelas dinâmicas, diversos tipos de tabelas dinâmicas, estrutura de criação de gráficos, diversos tipos de gráficos, bidimensionais e tridimensionais serão fundamentais para lhe proporcionar o conhecimento necessário diante de novas situações.</li><li style=\"\"><strong style=\"\">Quais materiais estão inclusos no Curso ?</strong></li><li style=\"\">Você receberá como material adicional ao Curso planilhas estruturadas com alguns controles administrativos simplificados que servirão de base para lhe dar ideias, desafiar sua criatividade e desenvolver seus próprios controles, os controles de Compras, Estoques, Vendas, Financeiro e principalmente o Fluxo de Caixa são básicos nas maioria dos negócios comerciais, à vezes possuem outros nomes e conotações mas as operações comerciais sempre envolvem um mínimo de controle, a dica e recomendação é para o Fluxo de caixa, trata-se de um documento de controle primordial em qualquer negócio seja empresarial ou pessoal, através dele se consegue obter um panorama financeiro da Empresa ou Orçamento Familiar que prevê acontecimentos, planejar e acompanhar o desempenho financeiro são técnicas que andam lado a lado ao Fluxo de Caixa,  controles com visões simplificadas contribuem significativamente para o crescimento de qualquer negócio sem burocratizar e sem engessar a estrutura pois são muito bem vindos.</li><li style=\"\"><strong style=\"\">Quanto tempo durará este Curso ?</strong></li><li style=\"\">Foram criadas 120 aulas com 09 horas de duração no total, a duração do Curso somente dependerá de você, no Portal Udemy o Curso é oferecido com acesso vitalício, recomendamos que ao iniciar o Curso siga um rimo diário de estudos do início ao fim.</li><li style=\"\"><strong style=\"\">Por que deve fazer este Curso ?</strong></li><li style=\"\">O nível de detalhes apresentados neste curso serão fatores facilitadores do seu aprendizado, muitas pessoas possuem dificuldade de aprender funções, tabelas dinâmicas ou gráficos mas neste curso esta barreiras serão vencidas, foram desenvolvidos uma variedade grande de exemplos que fortalecerão o seu conhecimento e lhe darão muita segurança nos momentos que criar suas planilhas.</li></ul><ul style=\"\"><li style=\"\"><em style=\"\"><strong style=\"\"></strong></em></li></ul><strong style=\"\"><em style=\"\"></em></strong><ul style=\"\"><li style=\"\"><em style=\"\"><strong style=\"\"></strong></em></li></ul>", 
    "end_date": null, 
    "title": "Microsoft Excel 2013 Legendado - Meu Mundo Excel", 
    "price": "20.00", 
    "instructors": "Donizete Aparecido Sylvestre", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393160_f31f_15.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2013-legendado-meu-mundo-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T17:20:41Z"
}