{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Hi and welcome! My name is Tolan and I'm the Co-Founder of ProductivityMe.</p>    <p>Microsoft Excel is an amazing application. Over the last 30 years, it has become the industry standard for manipulating, organizing, storing, and analyzing data in a tabular form.</p>    <p>Whether you work in a non-profits, a start-up, a fortune 500 firm, or even government, you’re bound to come across needing to know Microsoft Excel, at least a little bit, a some point in your career.  </p>    <p>Working in the consulting industry, I’ve come to acknowledge the importance of Microsoft Excel. For many of us, becoming better at Microsoft Excel isn’t a choice… it’s a NECESSITY!</p>    <p>Learning how to use the program as efficiently and effectively as possible, can save you minutes, even hours per task! </p>    <p>What would you do with another 10, 20, 50 hours per month?</p>    <p>In this short, easy-to-follow course, we’ll cover ten of Excel’s most relevant, job-related shortcuts. These shortcuts may be simple, but they are super useful!</p>  <p>Then, in section three of the course, we’ll apply all ten Excel keyboard shortcuts to a real-world example.</p>    <p>So with that, let’s get started! </p>    <p>Click the green “Take This Course” button today, and stop wasting your time in Microsoft Excel. </p>    <p>Cheers, </p>    <p>Tolan &amp; Ryan<br> The ProductivityMe Co-Founders</p>", 
    "end_date": null, 
    "title": "Microsoft Excel: 10 Useful Keyboard Shortcuts for Beginners", 
    "price": "20.00", 
    "instructors": "The ProductivityMe Company", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669910_5391_4.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-excel-keyboard-shortcuts/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T20:59:57Z"
}