{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Do you want to make your work with Excel faster, more efficient and\nfun?</strong> </p><p><strong>Do you want to learn more about hidden\ntricks that make Excel easier to use?</strong> </p><p><strong>Are you looking for a structured way to get\nreally good with Excel?</strong> </p><p>If your answer was <strong>YES</strong> to some of\nthe questions, this course might be of interest to you. </p><p><em>When I created this course I put full emphasis on a\nstructured and didactically sound way to gently show you how Excel 2016 and\n2013 works. </em><strong><em>This course is especially\nsuited towards a beginners and intermediate user group. </em></strong></p><p>The course was shot with Excel 2016, which basically means that you can\napply the knowledge from this course also to Excel 2013 (and 2010) since those\nversions are quite similar. </p><p>Excel is such a huge and powerful software so that learning it can be\nconfusing. It is advisable to learn it in a structured way so that you can\nimprovise and find proper solutions to new problems. Many users tend to only\nknow the parts of Excel that are needed for their daily routine. Once a totally\nnew problem arises, they are stuck. Having structured training combined with\npractice is key to finding solutions faster and without frustration. </p><p>In this course you will learn about the general interface, the capabilities\nand limitations, popular and efficient functions, useful tools, data\nvisualization, database handling, getting help and much more. Take a look at\nthe course content overview to see how extensive the whole product is.</p><p>At the end of this beginners and intermediate course you should be confident\nin using for your daily tasks. You will know</p><p><em>how to use Excel's functions and other tools</em></p><p><em>what the capabilities of Excel are</em></p><p><em>where to find the appropriate features</em></p><p><em>how to get help</em></p><p><em>and how to work more efficiently with Excel. </em></p><p>Excel is one of the key software products of today’s professional world. You\nwill use it extensively in your work life, and of course your colleagues will\nbe thankful if you can show them some tricks they did not know before!</p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2016  - The Comprehensive Excel 2016 Guide ", 
    "price": "20.00", 
    "instructors": "R-Tutorials Training", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606334_b4aa.jpg", 
    "course_url": "https://www.udemy.com/excel-2016-the-excel-2016-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T21:14:31Z"
}