{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">  What is the course about?</strong>  </p>  <p style=\"\">  \t      By the end of this course you will be able to successfully start Microsoft Office 2010 applications using  a variety of methods, explore windows and identify various features in the window, navigate around software applications, use the ribbons, navigate the various menus associated with each ribbon, create documents, spreadsheets, databases, and presentations, insert text in documents using various methods, save documents using the save and save-as commands, and close a document and properly exit a software application program.  </p>  <p style=\"\">  \t<strong style=\"\">  What kind of materials are included?</strong>  </p>  <p style=\"\">  \t      This course includes step-by-step video tutorials, supplemental documents, hands-on activities, and assessments.  </p>  <p style=\"\">  \t<strong style=\"\">  How long will the course take to complete?</strong>  </p>  <p style=\"\">  \t      The course is designed for 12 weeks, however some learners may take longer to complete the various lessons.  </p>  <p style=\"\">  \t<strong style=\"\">  How is the course structured?</strong>  </p>  <p style=\"\">  \t      The course includes twenty-four sections, along with assessments, weekly video tutorials, and activities.  </p>  <p style=\"\">  \t<strong style=\"\">  Why take this course?</strong>  </p>  <p style=\"\">  \t      Microsoft Office programs are the most widely used applications by students and employees alike, because of their easy to use interface as well as high functionality. The process for learning basic computer skills is incomplete without being fluent at using MS Office products for daily use.  </p>  <p style=\"\">  \t      Research shows that Microsoft Office is the only software package called out within the top 20 skills needed across all occupations, explicitly required in 15 percent of high-growth, high-salary positions. Microsoft Office is No. 3 on the list of skills most required, and Microsoft PowerPoint and Word are No. 11 and No. 13 most required skills. Therefore, in order for you to compete in today&#039;s workforce, it is imperative for you obtain skills in Microsoft Office.  </p>", 
    "end_date": null, 
    "title": "Microsoft Office 2010 Made Easy", 
    "price": "20.00", 
    "instructors": "Dr. Harold L. Fisher", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65771_e494_10.jpg", 
    "course_url": "https://www.udemy.com/office-2010-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-16T03:51:01Z"
}