{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong></strong><strong>Everyone should have all the knowledge of excel concepts and functions if they want to get their work done faster.</strong></p><p>Excel is used everywhere, hence we want that everyone should have the knowledge of advanced as well as the basic excel concepts. Through this training on Excel 2016 Training you will get access to video tutorials, pdf documents, excel sheets on excel 2016. For understanding all the concepts we have taken help of different examples in excel 2016.</p><p>Each calculation will be solved in detail and this step by step understanding of the examples after the concepts will help you understand each function and formula in much detail. So before starting with the course let’s see what exactly is Excel 2016 and why we use it and what are the benefits. Microsoft Excel 2016 is thoroughly used in almost all fields be it finance, statistics, marketing, engineering, human resources and hence it is the basic thing that everyone should know. It is especially used for the businesses which deal with large amounts of data (numbers, statistics). Hence getting to know some advanced excel functions will be quite beneficial for anyone who wants to get the work done faster and in an easiest way available.</p><p><strong>Benefits of the Basic Excel 2016 Training</strong></p><li>Learn Excel 2016 basics from Scratch using an Excel examples Approach that will help you to understand each example in a very easy way.</li><li>Get a very good understanding of the smart features like Charts and Graphs in this course of excel 2016</li><li>Learn to Gain command over powerful features and functions in Excel 2016 through this Excel 2016 Training</li><li>Become Awesome in excel 2016 by this Excel 2016 Training</li><p><strong><br></strong></p><p><strong>About Advanced Excel 2016</strong><br></p><p>Join the Advance Excel 2016 course and learn advance functions in Advanced Excel 2016 and learn to work with data more effectively. You will learn how to use data functions, work with texts, pivot tables, important excel tools and new charts option in Advanced Excel 2016.</p><p><strong>The tutorials will help you learn about</strong></p><li>How to apply useful excel functions such as paste special, logical functions, arithmetic functions, cell information functions</li><li>Use data functions such as Choose function, VLOOKUP, HLOOK UP, Match and index, database function, offset, forecast function</li><li>Understand what if analysis using one dimensional, two dimensional data tables, solver and goal seek.</li><li>Learn how to use and apply array function, transpose and frequency</li><li>We also see how to work with functions for working with text, pivot tables, names and dynamic range, Auditing and Trouble Shooting formulas, Form Controls.</li><li>We shall learn about various important excel tools such as Text to Columns, Grouping Tabs, Subtotal Function, Hyperlinks, Data Validation, Random Numbers, Custom View etc</li><li>The final section deals with charts wherein you get to learn about the New charts in Excel 2016 such as the waterfall chart, box &amp; whisker chart, tree map chart and sun burst chart</li>", 
    "end_date": null, 
    "title": "Microsoft Office Excel 2016 Basic and Advanced", 
    "price": "30.00", 
    "instructors": "Naps Tecnologia Academy Inc", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678460_2215.jpg", 
    "course_url": "https://www.udemy.com/microsoft-office-excel-2016-basic-and-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T17:57:19Z"
}