{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t                                                Have you always wanted to learn Excel but were afraid it would be too difficult?  Do you want to increase your computer skills so you have the potential to earn more money?  Do you want to learn Excel so you have the potential to be more marketable? Do you just want to learn a new skill?</p>  <p>  \t                                                If you've answered \"yes\" to any of these questions, then you've found the perfect course!  </p>  <p>  \t<strong>Master The Fundamentals of Microsoft Excel In This Course Designed Just For Beginners</strong></p><ul><li>Learn the Basics Quickly and Easily</li><li>Edit and Format your Worksheet Like a Pro</li><li>Create Formulas With Amazing Speed &amp; Accuracy</li><li>Learn 10 \"Success Tips\" That Will Help You Be More Efficient </li><li>Step-by-Step Instructions For All Lessons So It's Super Easy To Learn</li></ul><p> </p><p>This course will take you step-by-step through the process of learning the material.  Together, we will start at the very beginning, build a solid foundation of knowledge, and then continue to build upon that knowledge by learning important concepts and features of the Microsoft Excel program.</p><p>To ensure your success with this course, I have also included practice lessons, video solutions for each practice lesson, as well as high quality job aides.</p>", 
    "end_date": null, 
    "title": "Microsoft Excel for Beginners", 
    "price": "20.00", 
    "instructors": "Tom Colorito", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404014_3f77_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T02:37:43Z"
}