{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \tDepuis les bases nécessaires à toute initiation jusqu&#039;aux tâches les plus avancées, en passant par des dizaines d’astuces pratiques pour adapter Excel à vos besoins et vous dépanner en toute circonstance, ce cours vous dit presque tout sur Excel.  </p>  <p>  \t<strong>Prenez un bon départ !</strong>  </p>  <p>  \tPour bien commencer, familiarisez-vous avec l&#039;univers de ce tableur : découvrez le ruban, les barres d&#039;outils, les feuilles et les classeurs, puis saisissez et mettez en forme des données.  Réalisez vos premiers calculs, mettez en page et imprimez vos tableaux. Manipulez les données à l&#039;aide d&#039;outils de tri ou de filtre, du solveur ou de tableaux croisés dynamiques. Transformez vos tableaux en graphiques, puis personnalisez-les pour leur donner un aspect professionnel.  </p>  <p>  \t<strong>Profitez de la puissance d’Excel</strong>  </p>  <p>  \tExploitez les nombreuses fonctions et formules d&#039;Excel pour effectuer des calculs mathématiques, optimiser des opérations financières, analyser des dates ou organiser des listes.  Et si vous voulez plier Excel à vos volontés, profitez des macros pour automatiser des tâches ou créer vos propres fonctions.  </p>  <p>  \t<strong>Dépannage instantané!</strong>  </p>  <p>  \tBesoin d&#039;aide pour résoudre un problème récurrent ou pour vous sortir d&#039;un mauvais pas ? Ce livre vous donne une quantité innombrable d&#039;astuces pratiques et de solutions de dépannage pour profiter au mieux d&#039;Excel.  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel pour les débutants", 
    "price": "25.00", 
    "instructors": "Modulas Académie", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386822_6428_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-pour-les-debutants/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T16:45:43Z"
}