{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This Microsoft PowerPoint 2013 training course will show you how to create high quality presentations using the tools and techniques available to you in this software. PowerPoint has long been the go to choice for presentations and allows you to create dynamic slideshows with music, video and animation that really let your information shine!<br style=\"\"><br style=\"\">This tutorial for PowerPoint 2013 is designed for the beginner. You will start with the fundamentals by creating a presentation from scratch. Erin has included working files with this course to allow you to follow along step by step, using the same content she uses throughout. You will learn how to create themes, how to use outlines effectively, and how to work with text on the slides. You will add objects to the slides, draw and format shapes, insert images and SmartArt, as well as format tables and charts on your slides. Erin also shows you how to add audio and video, animations and transitions to the presentation, and finally how to share and present your finished piece!<br style=\"\"><br style=\"\">By the time you have completed this video tutorial for PowerPoint 2013, you will be fully capable of creating your own presentation using a variety of techniques to make it dynamic and interesting. You will understand what tools are available to you, and how to utilize them effectively to create an interesting and engaging slideshow.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Microsoft Powerpoint 2013 Tutorial", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/56097_04dd_9.jpg", 
    "course_url": "https://www.udemy.com/microsoft-powerpoint-2013-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-23T22:23:25Z"
}