{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<span>This course is for the benefit of everyone. If financial constraints prevent you from enrolling, simply send me a message and I will give you access to all of my courses for free.</span>  </p>  <p>  \tThis training provides you everything you need to know about Microsoft Excel. From the fundamentals, to the most advanced features, after taking this online class you will be able to use Microsoft Excel at an expert level.  </p>  <p>  \tYou can learn Microsoft Excel easily and quickly if it is taught correctly. Developed by a Microsoft Certified Master Instructor, this course covers the most recent version of Microsoft Excel for the Mac - Microsoft Excel 2011. As tenured college faculty in computer information technology, and with over fifteen years of experience teaching individuals of all ability levels &quot;how to use&quot; Microsoft Excel, Todd McLeod has designed, refined, and perfected a method for understanding Excel which will allow you to learn what you need to know about Microsoft Excel as quickly and efficiently as possible.  </p>  <p>  \tWith over five hours of video, you will learn all of the following about Microsoft Excel:  </p>  <ul>  \t<li><span>Learn how to navigate around Excel</span></li>  \t<li><span>Learn how to enter and edit data in Excel</span></li>  \t<li><span>Learn how to adjust the way data and information are displayed in Excel</span></li>  \t<li><span>Learn how to write formulas quickly and easily with the point-and-click method</span></li>  \t<li><span>Learn how to use relative, absolute, and mixed references in Excel</span></li>  \t<li><span>Learn how to create powerful calculations with Excel functions</span></li>  \t<li><span>Learn how to visually represent your data with charts and graphs in Excel</span></li>  \t<li><span>Learn how to use Excel data tools like sorting, subtotaling, and filtering</span></li>  \t<li><span>Learn how to &quot;freeze columns and rows&quot; with freeze panes in Excel</span></li>  \t<li><span>Learn how to remove duplicates from data in Excel</span></li>  \t<li><span>Learn how to &quot;transpose data&quot; - switching the columns and rows in Excel</span></li>  \t<li><span>Learn how to use Excel to leverage data with Pivot Tables &amp; Pivot Charts</span></li>  \t<li><span>Learn how to format worksheets in Excel for impact and appeal</span></li>  \t<li><span>Learn how to automate Excel tasks with time-saving macros</span></li>  \t<li><span>Learn how to integrate Microsoft Excel with Microsoft Word</span></li>  \t<li><span>Learn how to use passwords in Excel to protect your work in multiple scenarios</span></li>  \t<li><span>Learn tips and tricks about Excel, as well as Excel secrets and shortcuts</span></li>  \t<li><span>Learn how to use printing and sharing in Excel</span></li>  \t<li><span>Learn how to harvest data from the web</span></li>  \t<li><span>Learn how to create online forms which allow you to gather data from individuals</span></li>  \t<li><span>Learn how to use templates to quickly create stunning spreadsheets</span></li>  \t<li><span>As a bonus, you can download all of the Excel project files used in the videos so that you can get a “hands-on” approach to learning the material</span></li>  </ul>  <p>  \t<span>This class is guaranteed to teach you Microsoft Excel. Once enrolled, you will have access to this Excel course for the rest of your life. You will always be able to come back to this Excel class to review material or to learn new material about how to use Excel. Described as “fun” and “amazing” and “life changing,” Todd McLeod’s Excel training will forever transform the way you work with numbers. Try this course for yourself and see how quickly and easily you too can learn Microsoft Excel.</span>  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel for Mac - From Beginner to Expert in 7 Hours", 
    "price": "20.00", 
    "instructors": "Todd McLeod", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339438_49c9_5.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T19:50:17Z"
}