{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Founded in 2012, Master of Project Academy taught 50,000+ IT &amp; Business professionals in more than 170 countries around the world.</strong></p><p><strong>Now, Master of Project Academy's exclusive &amp; premium courses are in Udemy!</strong></p><p><strong>Welcome to MICROSOFT PROJECT OFFICALLY APPRECIATED Training!</strong></p><ul><li><strong>More than 5,000 students enrolled</strong></li><li><strong>Course Completion Certificate is provided.</strong></li><li><strong>Learn practical implications of MS Project</strong></li><li><strong>4+ Hours of Comprehensive Content</strong></li><li><strong>Learn HOW TO SAVE THOUSANDS of DOLLARs in your projects</strong></li></ul><p>Note that, this course provides:</p><ul><li>Lifetime access</li><li>30 Days FULL REFUND of your money is guaranteed if you will not be satisfied of this course</li></ul><p><strong>By enrolling in this course, you will be able to:</strong></p><ul><li>Enroll in a MICROSOFT PROJECT APPRECIATED Training</li><li><strong></strong>Create your project plans in MS Project STEP-BY-STEP</li><li>Save THOUSANDS OF DOLLARS in your projects by fixing utilization problems</li><li>Learn how to create a project plan through a real-world project example</li><li>Get prompt answers &amp; support from the instructor within 24 hours!</li><li>Learn what you should have before creating your project plan in MS Project</li><li>Test yourself with quizzes at the end of the sections</li><li>Earn 4 PDUs if you are a PMP already</li></ul><p>This course is for every professional who wants to use Microsoft Project. Microsoft Project has several features to discover. However, for creating a project plan, you do not need to know all these features. <strong>You will know the essentials and most tricky features of Microsoft Project!</strong></p><p><strong>THIS IS NOT A \"This feature does this\", \"This function enables this\" COURSE. YOU WILL LEARN STEP BY STEP CREATION OF A PROJECT PLAN THROUGH A REAL PROJECT EXAMPLE.</strong><br></p><p>Course starts with what you should have prior to creating your project plan in Microsoft Project. Then customization of Microsoft Project for yourself is described in second section.</p><p><strong>From third section onward, creation of a project plan is described step by step in an example scenario. </strong>Tasks are created, dependencies of tasks are defined, resources of a project are created, calendars and exceptions of resources are set and then tasks are assigned to resources step by step.</p><p><strong>Do you have utilization problems and exceeding costs in your projects? Learn how to fix utilization problems with this course. </strong>With team planner view of Microsoft Project, fixing utilization problems are described in detail. <strong>With opted better alternatives, you can save money in your projects! </strong>Learn how to perform same activities within same duration, with better utilization and less money.</p><p>If you are a PMP already, <strong>you can submit 4 PDUs</strong> by taking this course in category B: Continuing Education.</p>", 
    "end_date": null, 
    "title": "Microsoft Project: How to Create Your Project Plan", 
    "price": "20.00", 
    "instructors": "Master of Project Academy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/795082_d21b.jpg", 
    "course_url": "https://www.udemy.com/microsoft-project-how-to-create-your-project-plan-in-ms-project/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T20:16:17Z"
}