{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">IF YOUR PROJECTS are complex, time-bound, requiring high quality, tight budgets, 100s of moving parts, demanding customers - then you NEED this course. Learn to use Microsoft Project like an EXPERT. </em>This is NOT a simplistic point-and-click feature course.<em class=\"redactor-inline-converted\"><br></em></strong></p>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">This course teaches you to identify issues, analyze them, seek multiple resolutions - and apply them - all using Microsoft Project 2016.</em></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Impeccable curriculum, exhaustive topic coverage, holistic teaching - taught from the ABSOLUTE BASICS to ADVANCED TECHNIQUES:</strong> </p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">NO OTHER book, tutorial or course offers these unique set, anywhere on the internet:</em></p>\n\n\n\n\n\n\n\n<ol><li> Brings together Microsoft Project, Project Management principles and Real Life Exercises</li><li>Use Project in EVERY STAGE of project management - Initiation, Planning, Execution &amp; Control - and finally Closing.</li><li>Completely HANDS-ON, 100% subtitled</li><li>100+ downloadable exercise files</li><li>10 real life exercises from a wide variety of domains - Administration, Business, Technology, HR, Civil PM, Marketing, IT/Software</li><li>Identify REAL LIFE problems - scheduling, costing, resourcing, work allocations! </li><li>LOADED with tips, tricks, pitfalls from years of hands-on experience</li><li>Use REPORTS - powerful, automated, DYNAMIC reports and dashboards</li><li>Resolve Resource Overallocations 8+ techniques: Assign to different resources, Push dates - Adding Delays, Increase working hours, Balance allocations, Leveling, Work Contours, Use Team Planner view, Use \"Assign Resources\" feature, Splitting Tasks</li></ol>\n\n\n\n\n\n\n\n<p>\n\n\n\n\n\n</p>", 
    "end_date": null, 
    "title": "Microsoft Project 2016: The MASTERCLASS", 
    "price": "25.00", 
    "instructors": "Srikanth Shirodkar", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831116_92e7_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-project-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-25T07:21:41Z"
}