{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \tProject 2013 Like a Boss is a comprehensive course that takes students from complete newbie to guru with Microsoft's powerful project management application that's used at Fortune 500 companies throughout the world.  </p>  <p>  \tIn other words, students will be able to use Project 2013 to manage their projects... like a Boss.  </p>  <p>  \tThe course includes approximately 8 hours of video instruction delivered in 100 separate lessons, making it perfect for learning the application from the ground up, or for going back to review/refresh on a specific skill.</p><p><strong>New Updates: includes downloadable study guide for the Microsoft 74-343 Exam.</strong></p><p><strong>  \t</strong>Author and Microsoft Certified Instructor Brian Culp has been teaching Microsoft Project since the 2003 edition. In this examination of the 2013 edition, he will give students  a guided tour of the application's newest, most commonly used, and most powerful features.  </p>  <p>  \tStudents of this course will learn:  </p>  <ul>  \t<li>how to start  projects</li>  \t<li>create and edit task  \t</li>  \t<li>assign resources</li>  \t<li>estimate project  costs</li>  \t<li>manage project calendars   \t</li>  \t<li>share project information  \t</li>  \t<li>resolve  problems</li>  \t<li>create project baselines</li>  \t<li>manage task dependencies</li>  \t<li>identify a project's critical path</li>  \t<li>and much more. </li>  </ul>  <p>  \tAdditionally, the objectives of this training will prepare students  for the Microsoft 74-343 Certification Exam.  </p>  <p>  \tAlthough not a requirement, to get the most out of this course, students should be familiar with the basic principals of project management.  </p>  <p>  \tBy simply following along with the hands-on exercises, viewers of this course will be able to create a robust project plan from scratch - all without the need to download course or demo files.  </p>  <p>  \t<strong>What's more, the results are guaranteed!</strong> You'll have a better understanding of projects and Microsoft Project than ever before, and be ready to pass the the MOC 74-343 exam, or your money back. No questions asked.</p><p>There's a saying in the project management business: <strong>\"Projects become a year late one day at a time.\"</strong> </p><p><strong>So don't let this be just another day. </strong>Please enroll now,<strong> </strong>or watch a couple of sample lessons... because every day you're not learning Project is another day further away from that new job or big promotion!</p>", 
    "end_date": null, 
    "title": "Microsoft Project 2013 - Like a Boss. Prep for the 74-343.", 
    "price": "45.00", 
    "instructors": "Brian Culp", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432638_2a37_5.jpg", 
    "course_url": "https://www.udemy.com/project-2013-like-a-boss/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T03:19:47Z"
}