{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">This versatile Microsoft Outlook 2011 for Mac course by InfiniteSkills covers a wide range of the program&#039;s functionality, from powerful email functions to calendar features to comprehensive task management, calendar features and notes. Whether you&#039;re moving from an older Windows version of Outlook or trying out the software for the first time, these step-by-step lessons reveal the secrets of the application and make communication and organization as simple as you&#039;ve always wanted them to be. The training starts with the simple task of setting up email accounts to receive mail into MS Outlook. From there, the tutorials will teach you how to create and send emails, manage messages, and even setup your own custom signatures and aliases. You will learn how to create appointments and meetings, invite and confirm attendees, create actionable tasks, and keep track of your to-do list right within Outlook on your Mac.&nbsp;</p>  <p style=\"\"><br style=\"\" /> <strong style=\"\">What You Will Learn</strong></p>  <p style=\"\">- How to create professional quality emails, professional notes and boardroom-ready events and invitations with one of the world&#039;s leading office communications tools.<br style=\"\" /> - How to manipulate and implement contact and organizational data data across a wide range of projects and accounts.<br style=\"\" /> - How to create fully compatible meetings, contact cards and messages that can be accessed by users working with Office for Mac products as well as Windows counterparts.</p>  <p style=\"\"><br style=\"\" /> <strong style=\"\">Who Should Take This Course</strong></p>  <p style=\"\">- Anyone who has used Microsoft Outlook in the past but wanted a better understanding of its full range of features.<br style=\"\" /> - Anyone who has high demands for email organization, task management and communications requirements.<br style=\"\" /> - Anyone who needs an understanding of Microsoft Office software as it applies to a professional work or academic environment.<br style=\"\" /> - Anyone Mac user new to MS Outlook wanting a user-friendly guide that introduces the program from the ground up.</p>  <p style=\"\"><br style=\"\" /> <strong style=\"\">What People Are Saying</strong></p>  <p style=\"\">&quot;Email was one of the first things I learned as a computer user but it turns out I had been some simple mistakes for years...these videos make it easy to see how smart email policies can streamline a busy person&#039;s work life. Kudos.&quot;<br style=\"\" /> - Kelly McNessa&nbsp;</p>  <p style=\"\">&quot;Finally Microsoft has decided to create a REAL email client for Mac users. This was a great, simple way to get started with the application more quickly.&quot;<br style=\"\" /> - Deval Gupta</p>", 
    "end_date": null, 
    "title": "Microsoft Outlook 2011 for Mac Tutorial", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17169_e306_9.jpg", 
    "course_url": "https://www.udemy.com/learning-microsoft-outlook-2011-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-03T00:39:05Z"
}