{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">This course is for the benefit of everyone. If financial constraints prevent you from enrolling, send me a message and I will give you access to all of my courses for free.</span>  </p>  <p style=\"\">  \tThis training provides you everything you need to know about Microsoft Word. From the fundamentals, to the most advanced features, after taking this online class you will be able to use Microsoft Word at an expert level.  </p>  <p style=\"\">  \tYou can learn Microsoft Word easily and quickly if it is taught correctly. Developed by a Microsoft Certified Master Instructor, this course covers the most recent version of Microsoft Word for the Mac - Microsoft Word 2011. As tenured college faculty in computer information technology, and with over fifteen years of experience teaching individuals of all ability levels &quot;how to use&quot; Microsoft Word, Todd McLeod has designed, refined, and perfected a method for understanding Word which will allow you to learn what you need to know about Microsoft Word as quickly and efficiently as possible.  </p>  <p style=\"\">  \tWIth over five hours of videos, you will learn all of the following about Microsoft Word:  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Learn how to use styles</span></li>  \t<li style=\"\"><span style=\"\">Learn how to automatically generate tables of content</span></li>  \t<li style=\"\"><span style=\"\">Learn how to create references and automatically insert a bibliography</span></li>  \t<li style=\"\"><span style=\"\">Learn how to use character, paragraph, section, and document level formatting</span></li>  \t<li style=\"\"><span style=\"\">Learn how to use mail-merge to create form letters and personalized bulk emails</span></li>  \t<li style=\"\"><span style=\"\">Learn the difference between content and form</span></li>  \t<li style=\"\"><span style=\"\">Learn how to edit and format your content so that it is presented in the best form possible</span></li>  \t<li style=\"\"><span style=\"\">Learn how to create title pages</span></li>  \t<li style=\"\"><span style=\"\">Learn how to work with headers and footers</span></li>  \t<li style=\"\"><span style=\"\">Learn how to automate Word tasks with time-saving macros</span></li>  \t<li style=\"\"><span style=\"\">Learn how to integrate Microsoft Word with Microsoft Excel</span></li>  \t<li style=\"\"><span style=\"\">Learn how to use passwords in Word to protect your work in multiple scenarios</span></li>  \t<li style=\"\"><span style=\"\">Learn tips and tricks about Word, as well as Word secrets and shortcuts</span></li>  \t<li style=\"\"><span style=\"\">Learn how to use printing and sharing in Word</span></li>  \t<li style=\"\"><span style=\"\">Learn how to use templates to quickly create stunning documents</span></li>  \t<li style=\"\"><span style=\"\">As a bonus, you can download all of the Word project files used in the videos so that you can get a “hands-on” approach to learning the material</span></li>  </ul>  <p style=\"\">  \tThis class is guaranteed to teach you Microsoft Word. Once enrolled, you will have access to this Word course for the rest of your life. You will always be able to come back to this Word class to review material or to learn new material about how to use Word. Described as “fun” and “amazing” and “life changing,” Todd McLeod’s Word training will forever transform the way you work with Microsoft Word. Try this course and see for yourself how quickly and easily you can learn Microsoft Word.  </p>", 
    "end_date": null, 
    "title": "Microsoft Word for Mac - From Beginner to Expert in 5 Hours", 
    "price": "20.00", 
    "instructors": "Todd McLeod", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354910_c001_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-word-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T02:18:39Z"
}