{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<span>Learn the expert features and functions in Microsoft Excel 2013, alongside our expert author, to help you get you beyond the basics and have advanced-level proficiency within the Excel 2013 suite</span>  </p>  <p>  \tWhilst in this course we’ll cover the basics of Excel, including SUM, MIN, MAX and other conditional statements, we’ll quickly move onto more advanced-level topics including:  </p>  <ul style=\"\">  \t<li>IF statements</li>  \t<li>VLOOKUP and HLOOKUP</li>  \t<li>Sparklines</li>  \t<li>Pivot Tables and Charts</li>  \t<li>Macro Operations</li>  </ul>  <p>  \t<strong style=\"\">The Ability to Master Excel</strong>  </p>  <p>  \tBy the completion of this computer based advanced Excel training video for Microsoft Excel 2013, you will be comfortable with many of the advanced features and functions that this powerful spreadsheet software from Microsoft has to offer.  </p>  <p>  \tWith the ability to handle advanced tasks in Excel, you’ll be able to get more power out of your worksheets and be able to dramatically shorten your task times and increase your efficiency in the process.  </p>  <p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p>  \tSuitable for beginners with Microsoft Excel (as we’ll cover the basics early on) but also for those who wish to cover the advanced topics in Excel. Through the course of 128 lectures and 10+ hours of content, you’ll learn all of the basic and advanced items of Excel, which will enable you to use Excel expertly within in a personal or commercial environment.  </p>  <p>  \tComplete with working files and code samples, you’ll be able to follow along with the author throughout the lessons, and will receive a verifiable certificate of completion upon finishing the course.  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2013  Advanced. Online Excel Training Course", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/39292_b3f3_9.jpg", 
    "course_url": "https://www.udemy.com/advanced-microsoft-excel-2013-online-excel-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-31T19:22:02Z"
}