{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong></strong></p><p><strong><br></strong></p><p><strong>NEW SECTION 13 ADDED on ACCESS VBA Classic Double Loops!</strong></p><p>Learn how to create what I call a Recordset Walk Thru with a Double Loop.  These little programs can save you lots of time and grief!</p><p><strong>From a Recent 5 Star Review:</strong></p><p><em><strong>This is Absolutely the Best Training in Access</strong><br></em></p><p><em>This is the third Training Course in a series of four. I have now completed this course and I am amazed at the content that has been covered - IT IS A FANTASTIC COURSE!!! - John Ovens<br></em></p><p><strong>ACCESS VBA NEW SECTION 12 on USING POPUP FORMS!</strong>  <br>Learn how to open a form anywhere in your Access Visual Basic (VBA) code and send and receive values from it!</p><p><strong>Feedback on Access VBA for Non-Programmers From a Student:</strong><br></p><p><em>\"This is the best class I've taken on Udemy. There isn't a wasted minute in these videos. Thanks, Bruce!\" - William Vicars</em></p><p><strong>NEW SECTION ADDED (Section 11 - 14 Lectures)! USING ACCESS SUBFORMS! Create a complete Order Entry System!</strong></p><p><strong>NEW SECTION ADDED (Section 9 - 7 Lectures)!  </strong><strong>Learn to create and modify table structures from inside Access VBA Programs!</strong></p><p><strong><strong>Feedback on Access VBA for Non-Programmers</strong> From Another Student:</strong></p><p><em>\"I used to think I was an expert at Access until I took this course. Bruce has a way of presenting material that makes you learn it on the first view. He goes into all nooks and crannies of the subject presented. I highly recommend this course for beginners and experts alike..\" - Rafal Krolik</em></p><p>Learn all the <strong>Access VBA programming</strong> concepts, tools and functions that you will need while you build a fully functional system!  More than 85 Lectures and 8 Hours of content on Microsoft Access Visual Basic!</p><p><strong>From Another Student:</strong></p><p><em>\"Bruce has created a really extensive course about Access. This course is built in bite size bits and every section teaches you an additional function in Access. The best thing about this course is that it is very low key and is really designed to help out the non-programmer. VBA might be very intimidating but this course shows you everything. The pace is good and every part is being explained in an excellent manner. I highly recommend this course especially if you want to learn and while learning create a wonderful tool that truly is useful.\" - Nicky Wong</em></p><p><strong>Build a strong foundation in Access Visual Basic with this tutorial for Non-Programmers!</strong></p><ul><li>Create VBA Subroutines for Forms and Control the Keyboard</li><li>Extensive Training on Handling Errors</li><li>Control Record Sorting and Searching for Specific Records</li><li>Learn How to Move and Pass Data Between Forms</li><li>Create Interactive Pull Down Filters for Form Data</li><li>Build a Complex Report Entirely with VBA</li><li>Introduction to SQL and How to Use SQL in VBA</li><li>Turn the Ribbon and Nav Pane On and Off</li><li>Prevent Form Closure or Resizing</li><li>Learn How to Close Access with VBA</li></ul><p><strong>Powerful Skills That Increase Your Value in the Marketplace</strong></p><p>Learning VBA programming enables you to use <strong>ALL</strong> the power of Access to easily create systems that will be in <strong>high demand</strong> with your current employer or other businesses.  The practical skills taught in this class will give you a solid foundation in creating systems that people can really use! </p><p>There is a <strong>HUGE need in the marketplace</strong> for people who can create systems like this in Access.  This is your opportunity to <em>break away from the pack</em> of people who struggle to create effective Access databases, and learn to easily automate tasks!  This could be your shortest path to <strong>increasing your income!</strong></p><p><strong>Content and Overview</strong> </p><p>All you need to do the course is some basic experience with Access components: tables, queries, forms and reports. This course does <strong>not</strong> require any programming experience or knowledge of macros.</p><p>Even though there are 8<strong>0+ lectures</strong> and <strong>over 7.5 hours of content</strong>, each section focuses on <em>one set of concepts</em> so it is easy to do one section at a time, when your schedule allows.  You will find that each chapter builds on the previous one as you build a complete system, step by step. </p><p>By the time you have finished the course you will have done so much with VBA and it will be so familiar that you will be ready to tackle your own project <em>immediately</em>, putting your new learned skills into practical use and <strong>impressing your boss and coworkers</strong>.</p><p>The course is <strong>complete with working files and finished code samples</strong> for everything that is covered. You will be able to work alongside the author as you work through each lecture and will receive a verifiable certificate of completion upon finishing the course.</p><p>Clicking the <strong>Take This Course</strong> button could be the best step you could take towards quickly increasing your income!  Also, remember that if you don't think the course is worth what you spent, you have a full 30 days to get a no questions asked refund!</p><p><strong>Required Software</strong></p><p>You should have Office 2010 or later.   The course was created using Office 2010.</p>", 
    "end_date": null, 
    "title": "Microsoft Access VBA for Non Programmers-Learn VBA Now", 
    "price": "30.00", 
    "instructors": "Bruce Myron", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421532_4af2_6.jpg", 
    "course_url": "https://www.udemy.com/access-vba-for-nonprogrammers-increase-your-earning-power/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-14T00:56:01Z"
}