{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Through animation and presentation software, this course will define how to use SharePoint for collaborating, capturing and organizing “corporate\" knowledge (activities, ideas and documents). <strong><em>Demonstrations</em></strong> will be shown to show how Non-IT SharePoint Users in various businesses could program their department's SharePoint site without code. </p><p><strong>These demonstrations</strong> are<strong> based on case studies</strong> shared from librarians and information professionals working in universities, associations, government agencies and other business entities in which MS SharePoint had been purchased but improperly implemented in each environment. </p><p>This course has great points for <strong><em>anyone</em></strong> who has to use SharePoint. By replacing library terms with the appropriate terms and technical expertise of your business environment, you will have this course tailored for <strong><em>your</em></strong> specialized business environment. </p><p><strong><em>The Problem with SharePoint</em></strong> is that when it is <strong>out-of-the-box</strong>, it has no specific instructions on how to use it. When properly embedded from within these different business environments, SharePoint is used as a tool to map the activities, ideas and documents of the business, it exists in, to the skills of the staff for current and future collaboration in projects. </p><p>At the end of the course, the students will have a fully functional SharePoint site to help them capture and organize their organization's knowledge. </p>", 
    "end_date": null, 
    "title": "Microsoft SharePoint for Non-IT Users", 
    "price": "20.00", 
    "instructors": "Lorette Weldon", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495550_d352_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-sharepoint-for-non-it-users/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-07T01:00:47Z"
}