{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \tIn this day and age, data management is absolutely crucial, and there’s not much room for error. If you’ve already taken our basic Microsoft Access 2013 course, or know your way around the program already, you’re ready for our Microsoft Access 2013 Advanced course. Get ready to become a data management expert as this 9.25 hour class takes your skills to the next level.  </p>  <p style=\"\">  \tIn the Microsoft Access 2013 Advanced video training course, you’ll take your knowledge up a notch as you get acquainted with Microsoft Access 2013’s most sophisticated features. If you think you know all you need to know about Access 2013, think again, as this course goes way beyond the basics, leaving you with knowledge of all of the best Access tips and tricks out there.  </p>  <p style=\"\">  \tYour professional trainer will show you how to use macros, tables, forms, queries, and other tools to create a professional, working database. Follow along as you learn to create and maintain macros, then see how to effectively link to other data sources.  Get helpful techniques that allow you to link, report, and package your data quickly, and find out how to split a database by splitting the frontend and backend.  </p>  <p style=\"\">  \tWith this informative course, you’ll learn the skills you need to make an impact with sleek, high-performing databases that help you do your job better.  </p>  <p style=\"\">  \t  Plus, when you sign up for our class, you’ll also get these <strong style=\"\">4 BONUSES:</strong>  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">Downloadable &amp; printable keyboard shortcuts</strong> - to help you save time and get your work done faster.</li>  \t<li style=\"\"><strong style=\"\">Exercise files</strong> – to help you become proficient with the material.</li>  \t<li style=\"\"><strong style=\"\">An online quiz (45 questions)</strong> - to test what you&#039;ve learned.</li>  \t<li style=\"\"><strong style=\"\">A certificate of completion</strong> to tell everyone you&#039;ve aced the course.</li>  </ol>  <p style=\"\">  \tWhere else can you find so many extra tools to help you master Access 2013?  </p>  <p style=\"\">  \t<strong style=\"\">  What people are saying:</strong>  </p>  <p style=\"\">  \t<em style=\"\">&quot;Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.&quot;</em>  </p>  <p style=\"\">  \t  - TopTenReviews.com  </p>  <p style=\"\">  \t<strong style=\"\">Note:</strong> All videos are high-definition and are therefore best viewed enlarged and <strong style=\"\">with the HD setting on.</strong>  </p>", 
    "end_date": null, 
    "title": "Microsoft Access 2013 Advanced Course", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/99750_8052_5.jpg", 
    "course_url": "https://www.udemy.com/learn-microsoft-access-2013-training-advanced-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-30T23:35:48Z"
}