{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Go Beyond the Basics</strong></p><p><strong><strong>**************** Course Material Works in Excel 2010, 2013 and 2016 *******************</strong></strong></p><p>Ready to take your Microsoft Office Excel skills to the next level? Then you've come to the right course. Enroll now and you will receive step by step mentoring on mastering Microsoft Excel at an intermediate level and beyond. You will learn how to work with some of the most powerful tools Excel has to offer. </p><p>Using my <strong>10+ years of Microsoft Excel training</strong> I will guide you through these tools preparing you for the most advanced features used my Excel office workers.</p><ul><li><strong>Mastering </strong>Excel Lists (Sorting, Filtering, Subtotals, and more)</li><li><strong>Creating </strong>Powerful Excel Functions in order to Summarize List Data</li><li><strong>Become </strong>an Excel Report Creating Pro with Excel PivotTables</li><li><strong>Harness </strong>the Power of an Excel Add-In, PowerPivot to Create even more robust PivotTables</li><li><strong>Work </strong>with Data from other Sources through Import and Export Commands</li></ul><p><strong><br></strong></p><p><strong>At completion of this Excel Intermediate course</strong> you will have mastered the above mentioned tools and more, supercharging your Excel knowledge and skills to a whole new level of expertise.</p><p>Each section also includes a quiz to test the knowledge you will gain and exercise files for you to download and practice with. These are the same files that are used in the video lectures.</p><p><strong>So, what are you waiting for, enroll now and take the next step in mastering Excel on your way to becoming an Excel Guru!</strong></p>", 
    "end_date": null, 
    "title": "Microsoft Excel 102 - Intermediate Excel", 
    "price": "20.00", 
    "instructors": "Kyle Pew", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/724306_0cba_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-102-intermediate-level-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T17:16:21Z"
}