{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Whether you have never used Excel, or want to master the more advanced features and functions of Excel 2013, this course will make you proficient in no time at all!</strong> </p><p>In this Microsoft Excel 2013 Training course, you will learn by watching the instructor actually conduct the exercises as she explains step-by-step how to perform these functions. The training starts with the absolute basics of creating your very first worksheet and slowly progresses through learning numerous capabilities of this very powerful program. The topics range from creating very basic formulas to more advanced functions like table editing, the help function and more. </p><p>The Microsoft Excel 2013 course will also strengthen the skills that you have already, while also giving you some new techniques for Excel:</p> <ul style=\"\"><li>To organize your worksheet and table data using various Options.</li><li>Create and modify charts.</li><li>Customize workbooks and enhance your Microsoft Office Excel Environment.</li><li>Modify graphic objects in a worksheet, analyze data using Pivot Tables, slicers and Pivot Charts.</li></ul> <p>Taking this course will explain the processes of how to accomplish some common tasks you need in Excel. You will learn to automate common tasks, apply advanced analysis techniques to more complex data sets, troubleshoot errors, collaborate on worksheets, and share Excel data with other applications.</p><p>Check what you&#039;ve learned at the end of each lesson with our quizzes. </p><p>Our Microsoft courses help you to prepare for the official Microsoft Office Specialist exam.</p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2013: Beginner to Advanced", 
    "price": "35.00", 
    "instructors": "SONIC - High Quality Training for Over 20 Years", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/464114_2955.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2013-beginner-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-31T15:18:26Z"
}