{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<h5>A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p>This Powerpoint 2011 for Mac course from InfiniteSkills provides a powerful hands-on resource for learning the world&#039;s most popular professional presentation tool. You&#039;ll go step by step through the creative process of developing compelling presentations, complete with impressive transitions and multimedia elements. The training starts with a simple presentation, with the initial planning stages coming first. You then learn how to add and customize slides slides with text and images, as well as basic animations. As the MS Powerpoint tutorial continues, you will create a professional sales presentation, adding charts, transitions and accessible slide notes. You will then explore the possibilities of a stand-alone presentation, getting more in-depth with organizational charts, animations and music. You will also create slideshows, and build a non-linear presentation with action buttons that a viewer can easily control. Working files are included to help you get started quickly with no prior experience needed.</p>  <p><br style=\"\" /> <strong style=\"\">What You Will Learn</strong><br style=\"\" /> <br style=\"\" /> - How to create professional quality presentations, slideshows and basic animations with one of the world&#039;s leading office productivity tools.<br style=\"\" /> - How to manipulate and implement information and multimedia a wide range of projects.<br style=\"\" /> - How to create fully compatible documents and projects that can be accessed by users working with Office for Mac products as well as Windows counterparts.</p>  <p><br style=\"\" /> <strong style=\"\">Who Should Take This Course</strong></p>  <p>- Anyone who has used Microsoft Powerpoint in the past but wanted a better understanding of its full range of features.<br style=\"\" /> - Anyone who needs an understanding of Microsoft Office software as it applies to a professional work or academic environment.<br style=\"\" /> - Anyone Mac user new to MS Powerpoint wanting a user-friendly guide that introduces the program from the ground up.</p>  <p><br style=\"\" /> <strong style=\"\">What People Are Saying</strong></p>  <p>&quot;I hate to say I got through college with just the most basic understanding of powerpoints but your videos definitely helped me get mine to a more professional standard.&quot;<br style=\"\" /> - Michelle Morris<br style=\"\" /> <br style=\"\" /> &quot;There weren&#039;t a huge number of differences in the Mac version, but enough to throw me off and make it confusing. These quick tutorials were a big help in getting me proficient.&quot;<br style=\"\" /> - Bill Keilman</p>", 
    "end_date": null, 
    "title": "Microsoft Powerpoint 2011 for Mac Tutorial", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17193_0893_9.jpg", 
    "course_url": "https://www.udemy.com/learning-microsoft-powerpoint-2011-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-03T17:20:58Z"
}