{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t Ideal for those seeking to advance their careers by developing top-notch database skills, the Microsoft Access Training: Learn Microsoft Access 2010 course by Simon Sez IT provides 8 full hours of expert quality training videos. Learn Microsoft Access 2010 - Advanced takes the seemingly overwhelming concept of advanced database management and breaks it into several easy to understand, detailed chapters.  A general understanding of previous versions of Microsoft Access will make this Microsoft Access Training: Learn Microsoft Access 2010 course comfortable and will be a great base from which to build.  </p>  <p>  \t Beyond just getting data into the database, you will be taught to create both form and function.  Discover how to create switchboards, autoexec functions, macros, creative reports, custom buttons, deep custom queries for detailed data analysis, and reports that shine—in terms of how they look on paper and the data they provide.  Additionally, you will learn best practices to employ during initial design and creation steps. These will help you minimize headaches as the database design evolves, and enable mass distribution as the amount of data and number of users increases.  </p>  <p>  \t Plus, when you sign up for our class, you’ll also get these <strong style=\"\">5 BONUSES</strong> in addition to the 40 online course videos:  </p>  <ol style=\"\">  \t<li><strong style=\"\">Downloadable &amp; printable keyboard shortcuts</strong> - to help you save time and get your work done faster.</li>  \t<li><strong style=\"\">An online quiz (40 questions)</strong> - to test what you&#039;ve learned.</li>  \t<li><strong style=\"\">Downloadable &amp; printable transcripts (over 160 searchable pages)</strong> – to give you another learning option, if you prefer reading but don’t have time to take notes.</li>  \t<li><strong style=\"\">8 hours of downloadable MP3s to play on your favorite audio device</strong> - to help you learn in the car, while you walk, or in the gym.</li>  \t<li>A certificate of completion to tell everyone you&#039;ve aced the course.</li>  </ol>  <p>  \t Where else can you find so many extra tools to help you master Access 2010?!?!  </p>  <p>  \t So start learning today. Because being a technology dinosaur isn’t going to get you a promotion or raise!  </p>  <p>  \t All of our videos are high-definition videos, therefore, they are <strong style=\"\">best viewed with the HD setting on</strong>, and the videos enlarged.  </p>  <p>  \t <strong style=\"\">What our customers are saying:</strong>  </p>  <p>  \t &quot;Thank you very much for an extraordinaire online tutorial of Access, it has helped me a lot and even enabled me to get a job. Now I work for an asset management bureau in Paris programming and updating databases from Bloomberg on a daily basis!&quot;  </p>  <p>  \t <strong style=\"\">- Lisa R., France.</strong>  </p>  <p>  \t Take this Microsoft Access Training course now and learn Microsoft Access 2010 advanced level.  </p>", 
    "end_date": null, 
    "title": "Microsoft Access 2010 Training - Advanced", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28501_327d_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-access-2010-training-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-02T23:55:46Z"
}