{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>I Will Teach You The Best Way to Automate Your Work, so You Can Impress Your Boss, Work Less and Get More Done </strong>    Even if you know nothing about excel, automation or spreadsheets.  </p><p>  \t<br>  \t    Have you ever been bored, or frustrated at work?  </p>  <p>  \t                                               The fact is, most jobs nowadays make you deal with calculus, tables, schedules, team management, projects, organization tasks etc.  </p>  <p>  \t                                               These tasks are repetitive, mind-numbing and time consuming.  </p>  <p>  \t                                               You may have experimented with Excel before, automating little tasks and saving some time here and there.  </p>  <p>  \t                                               You probably still feel overworked, under appreciated and frustrated though.  </p>  <p>  \t                                               Well, I have some great news for you.  </p>  <p>  \t                                               Now, you can work less, get more done, and get that promotion you deserve, all while doing less work.  </p>  <p>  \t                                               You can do all this easily with Excel. Seriously.  </p>  <p>  \t                                               You may have experimented with Excel in the past, set up some formulas and saved some time, but nothing that was <u>absolutely life changing.</u>  </p>  <p>  \t                                               Let me tell you what I've accomplished with Excel in the last five years.  </p>  <p>  \t                                               I was able to <strong>get promoted</strong> <strong>every 6 months </strong>on average, working at competitive Multinational Technology Companies.  </p>  <p>  \t                                               That’s around three times as fast as most employees can hope for.  </p>  <p>  \t                                               The reason why I was able to get promoted at such a rocket rate is because no-one can keep up with me.  </p>  <p>  \t                                               I consistently impressed my bosses, and all my co-workers were jealous of how little I worked, and how much I got done.  </p>  <p>  \t                                               Since I was so much more productive, I was consistently rewarded with more money, benefits and a new role.  </p>  <p>  \t                                               I’ll tell you exactly how in a minute, but first let me make sure this course is for you. <br>  \t<br>  \t                                  This course is designed specifically for professionals who are looking to ramp up their career through learning new skills that will teach them how to use excel to manage staff effectively, increase their productivity and develop more efficient projects.  </p>  <p>  \t                                               You also should have the latest version of Excel. (It will still work with older versions, but you won’t get the full benefits.)  </p>  <p>  \t<br>  \t                                               Okay, if you’re still reading I assume you fit into that category, so let’s go over exactly what you’ll get in this course, you’ll learn:  </p>  <li>The right mindset to start using Excel, and how to approach the course.  </li>  <li>The basics taught in an easy, intuitive manner. </li>  <li>The difference between workbook and worksheets, and when to use each. </li>  <li>How to <u>save and protect your sensitive files</u> properly. </li>  <li>The best way to set up automated dashboards</li>  <li>16 Ways to organize and manipulate data. </li>  <li>How to create formulas and charts that will <strong>do your work for you.</strong></li>  <br>  <p>  \t                                            Sounds helpful right? You know you want these benefits, and it’s only $69 so go ahead and grab your unique course code now.  </p>  <p>  \t                                               You’ll also get a certificate of completion, so you can add that to your Linkedin profile to boost your credibility.  </p>  <p>  \t                                               I’ve thought about this a lot, and the only reasons I could think of that anyone who could benefit from this course wouldn’t get it is because they already know it, or they think they can learn it on their own.  </p>  <p>  \t                                               If you already know how to automate your work, get more done in less time  and avoid mind numbing robotic tasks on your own, congratulations, that’s spectacular.  </p>  <p>  \t                                               If you spent the time to learn all these techniques it would take you at least 100 hours of studying. (I know, because I did that.)  </p>  <p>  \t                                               Even if your time is only worth $15 an hour, that would be a <u>$1,500 investment.</u>  </p>  <p>  \t                                               Instead, I’ll show you exactly what you need to know, and make sure you get it through quizzes for <em>only $12</em>.  </p>  <p>  \t                                               Logically, it just makes sense. <strong>Join over 300+ satisfied professionals now. </strong>  </p>  <p>  \t                                               You can’t get this information in this concise and in-depth of a course anywhere else.  </p>  <p>  \t                                               I know, I checked.  </p>  <p>  \t                 Oh, and one more thing, you have absolutely no risk.  </p>  <p>  \t                                               I offer an <strong>unconditional 30 day money back guarantee.</strong> No hassles, no hard feelings.  </p>  <p>  \t                                               Don’t let more years of your life slip away entering data, and doing mindless work that should be automated.  </p>  <p>  \t<strong>Enroll Now! Start your path to your next promotion today! </strong>  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2013 Training for Beginners / Intermediate", 
    "price": "30.00", 
    "instructors": "Hugo Matos", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242120_5284_6.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2013-training-beginners-intermediate-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-12T14:11:11Z"
}