{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">     Dans ce cours vidéo Microsoft Excel 2010, je vous forme à l une des plus récentes versions du célèbre tableur.</strong>  </p>  <p style=\"\">  \t               Lors de ce cours, vous allez apprendre en observant l’intervenant <strong style=\"\">exécuter et expliquer les différentes fonctions</strong> d’Excel pas après pas. La présentation du programme Microsoft Excel 2010 commence par <strong style=\"\">l’enseignement des tâches basiques</strong> qui vous permettront déjà de créer votre toute première feuille de travail. Vous serez formés petit à petit aux <strong style=\"\">capacités variées de ce logiciel très puissant</strong>. L’apprentissage couvrira des<strong style=\"\"> thématiques allant des bases jusqu’aux formules et fonctions avancées.</strong> Un chapitre portera sur la façon de trier les données. Vous pourrez également vous entrainer sur un <strong style=\"\">exercice récapitulatif</strong>.  </p>  <p style=\"\">  \t     La structure du cours détaille ce que vous allez apprendre. Commencer la première lecture, allez à votre rythme à travers les cours et les exercices. Chaque lecture a un titre détaillé. <strong style=\"\">Cliquez sur un cours pour commencer and suivez le cours. Vous pouvez suivre vos progrès ici aussi.</strong>  </p>  <p style=\"\">  \t     Je serai ravi d’avoir l’opportunité de vous aider à atteindre vos objectifs. <strong style=\"\">Si vous avez des questions ou des doutes n’hésitez pas à m’envoyer un message.</strong>  </p>", 
    "end_date": null, 
    "title": "Microsoft Excel 2010 (Français - débutants/avancés)", 
    "price": "30.00", 
    "instructors": "Christian Tiessen", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/147314_92f4_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2010-cours-dentrainement-debutantsavances/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-15T15:07:46Z"
}