{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Unlock the Power Of Microsoft Office and Watch Your Productivity Soar!</strong></p><p><strong></strong><strong></strong><strong></strong>Microsoft Office is the #1 office software used by +1 billion people worldwide. While many are familiar with <strong>Microsoft </strong>Office's basic features, few people know about its more advanced capabilities that are designed to save you time, money, and effort. </p><p>Using step-by-step instructions, Simon Sez IT will quickly guide you through the most popular programs of Microsoft<strong> </strong>Office 2013: <strong>Excel, Word, Outlook, PowerPoint, Access,</strong> and <strong>Publisher. </strong>In addition to mastering the basic features, you'll also learn highly useful advanced capabilities of both Excel and Access. </p><p>For example, <strong>Visual Basic for Applications</strong> <strong>(VBA) for Excel </strong>will show you how to automate repetitive tasks and operations that you perform frequently. This valuable time saving tool and productivity enhancer is a critical tool for anyone who uses Excel frequently.</p><p>Work inefficiencies add up quickly over time. If you're always 'learning the hard way' when using Microsoft Office 2013, or under-utilizing its full capabilities, then you'll want to invest in these game-changing courses that include lifetime Udemy access. Let your work productivity soar so that you'll have more time for the other things in life that matter!</p><p><strong>**** Updated November 18, 2015: New Course Added: </strong><em>VBA Intermediate Training: Discover Excel Automation Secrets</em><strong></strong><br></p> <strong>Contents and Overview</strong> <p>In this 10-in-1 course collection, we'll show you important yet often over-looked or unknown features that will help skyrocket your productivity.</p> <ol><li><strong>Microsoft Excel 2013 - Introductory</strong>: Spreadsheets for data analysis and formulas for tracking expenses.<strong></strong></li><li><strong>Microsoft Excel 2013 - Advanced</strong>: apply functions, filter data, and create advanced spreadsheet visuals. </li><li><strong>Microsoft</strong><strong> Word 2013:</strong> Introductory courses on creating documents and brochures, embedding videos, and set up for online collaboration.</li><li><strong>Microsoft Outlook 2013: </strong>Introductory courses on email efficiencies to help clear the email clutter and gain control of your inbox.</li><li><strong>Microsoft PowerPoint 2013: </strong>Introductory courses on how to create dazzling presentations using animation, audio/video, and collaborative tools with minimal time and effort.</li><li><strong>Microsoft Access 2013 – Introductory:</strong> creating and using databases to become a master of data management, tracking customer information and buying patterns.</li><li><strong>Microsoft Access 2013 – Advanced</strong>: improve your database reporting and information security.</li><li><strong>Microsoft Publisher 2013: </strong>Introductory courses on print publications to create professional-looking print material that communicates your organization's strengths and purpose<strong>.</strong></li><li><strong>Microsoft Essential VBA</strong> <strong>for Excel: </strong><strong><strong></strong></strong>learn how to automate repetitive and time-consuming Excel procedures and operations for maximum efficiency. </li><li><strong>VBA Intermediate Training: Discover Excel Automation Secrets</strong><strong>: </strong><strong><strong></strong></strong>learn\nadvanced methods for automating tedious Excel jobs, the next step for anyone\nwho has completed basic VBA. </li></ol> <p><strong>This Course Includes</strong></p><ul><li>10 individual courses<strong></strong></li><li>80 hours of training tutorials</li><li>Hundreds of educational videos</li><li>Exercise files</li><li>A certificate of completion</li></ul> <p><strong>Why Take This Course</strong></p><p>Most work today happens on a computer – optimize your effort by learning useful software tips and tricks that you'll apply for decades to come! And that will save you valuable time, money and effort.</p><p>Want to get noticed by your boss or earn the respect of your colleagues? Become the office superstar by becoming the go-to expert on everything related to MS Office 2013!</p><p>Individual video training for these 6 programs would easily cost thousands of dollars, but this 10-in-1 package is available at one unbelievably low price. Tremendous learning at tremendous savings.</p>", 
    "end_date": null, 
    "title": "MS Office 2013: 10-in-1 Courses To Maximize Productivity", 
    "price": "50.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "80 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565120_07d5_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-office-2013-training-course-bundle/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T13:20:52Z"
}