{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t   Do you want to be a project manager? Maybe you&#039;ve just been given the promotion and now you don&#039;t know where to start.  </p>  <p style=\"\">  \t   The MS Project 2010 course is perfect for you! It teaches you everything you need to know about managing projects.  </p>  <p style=\"\">  \t <strong style=\"\">What You Learn</strong>  </p>    <p style=\"\">  \t   During the course you will learn:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t   ·How to use the MS Project 2010 interface  \t</p>  \t<p style=\"\">  \t\t   ·How to create new projects  \t</p>  \t<p style=\"\">  \t\t   ·How to schedule tasks and assign roles  \t</p>  \t<p style=\"\">  \t\t   ·How to track your resources and costs  \t</p>  \t<p style=\"\">  \t\t   ·And much more!  \t</p>  </ul>  <p style=\"\">  \t   The course is delivered through videos PDF course pack. A case study is used to teach the concepts to help you learn in a hands-on approach. You will feel like you&#039;re a project manager already!  </p>  <p style=\"\">  \t   There is also a self-assessment to test your knowledge as you go.  </p>  <p style=\"\">  \t <strong style=\"\">But Why Should You Enrol?</strong>  </p>    <p style=\"\">  \t   The MS Project 2010 course is comprehensive and teaches you everything you need to know about the software and more! You will become the best project manager your workplace has ever seen.  </p>  <p style=\"\">  \t   It also helps you save money and time. You only learn the features you&#039;re going to need. There&#039;s no need to try out those useless features!  </p>  <p style=\"\">  \t   All you need are basic computer skills and you&#039;ll be ready to go.  </p>  <p style=\"\">  \t   Enrol in the MS Project 2010 course today and become an amazing project manager.  </p>  <ol style=\"\">  </ol>  <p style=\"\">  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t <strong style=\"\">Each Chapter or Section includes:</strong>  </p>  <ul style=\"\">  \t<li>A set of videos that demonstrate the features</li>  \t<li>A comprehensive PDF document that serves as course book. You can download it and read offline at your own pace and use as a reference material.</li>  \t<li>A data file (MS Project 2010 file .MPP) for completing guided exercises</li>  \t<li>Practice exercises to help you better understand each concept</li>  \t<li>A self-Assessment assignment to help you test yourself and improve the learning outcome. You also get the solution for the assignments for reference.</li>  </ul>  <p style=\"\">  \t <strong style=\"\">Other Important Information:</strong>  </p>  <p style=\"\">  \t   Please download all supplementary material - Data files, Exercises and Self Assessments and instructions for using them from Section 8. The Course PDF is added as supplementary material to the first lecture in every section. Please download it when you start the section.  </p>  <p style=\"\">  \t <strong style=\"\">Asian Students can also follow easily as it is Recorded in Asian Voice.</strong>  </p>  <p style=\"\">  \t      We are a Microsoft Learning Solutions Partner. We specialize in MS Project, MS Office, Windows 8 App Development and Azure. We also license our courses to multiple colleges and universities offering online courses.  </p>", 
    "end_date": null, 
    "title": "MS Project 2010 for New and Aspiring Project Managers", 
    "price": "20.00", 
    "instructors": "Trainedge  Consulting", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/122706_ed04_7.jpg", 
    "course_url": "https://www.udemy.com/ms-project-2010-for-new-and-aspiring-managers-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-20T04:50:08Z"
}