{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t  Mit diesem MS Project 2013 Video-Training sind Sie in kurzer Zeit  professionell arbeitsfähig mit MS Project. Sie sind in der Lage, MS  Project 2013 professionell als Planungs- und Controlling-Tool  einzusetzen.  </p>  <p>  \t  Sie können Termine, Kosten und Ressourcen mit MS Project planen, steuern  und überwachen. Sie können umfangreiche Projekte und Multi-Projekte  planen, steuern, überwachen, protokollieren und professionell abbilden.  </p>  <p>  \t Alle Vorteile für Sie auf einen Blick:  </p>  <ul style=\"\">  \t<li>Sie lernen durch Sehen, Hören und Mitmachen, wie Sie MS Project bedienen können.</li>  \t<li>Sie  lernen schnell, MS Project spürbar wirksam für Ihre Projekte zu nutzen.</li>  \t<li>Sie lernen Schritt für Schritt anhand eines praktischen Beispiel-Projekts.</li>  \t<li>Sie können das gesamte Training beliebig oft wiederholen.</li>  \t<li>Sie können für Sie wichtige und interessante Lektionen direkt  aufrufen.</li>  \t<li>Sie bestimmen selbst Ihr Lerntempo.</li>  \t<li>Sie lernen von einem erfahrenen Trainer einen praktischen Umgang mit MS Project.</li>  \t<li>Sie sind nach Ansicht dieses Video-Trainings in der Lage, MS Project produktiv für Ihr Projektmanagement einzusetzen. </li>  </ul>  <p>  \t Was Ihnen das Video Training bringt:  </p>  <p>  \t Sie sind sofort arbeitsfähig mit MS Project!  </p>  <p>  \t Mit diesem MS Project Video Training sind Sie nach 4 Stunden professionell arbeitsfähig mit MS Project 2013. <br style=\"\">  \t <br style=\"\">  \t Sie planen und steuern Ihre Projekte professionell!<br style=\"\">  \t Nach diesem MS Project Video Training sind Sie in der Lage, MS Project professionell als Planungs- und Controlling-Tool einzusetzen. <br style=\"\">  \t <br style=\"\">  \t Sie managen Ihre Multi-Projekte effektiv!<br style=\"\">  \t Sie können umfangreiche Projekte und Multi-Projekte planen, steuern, überwachen, protokollieren und als Szenario darstellen.<br style=\"\">  \t <br style=\"\">  \t Sie sichern Ihre Projekte mit wirkungsvollem Projekt-Controlling!<br style=\"\">  \t Sie können Termine, Kosten und Ressourcen mit MS Project planen, steuern und überwachen.<br style=\"\">  \t <br style=\"\">  \t Sie können aussagestarke Dokumentationen für Ihre Projekte bereitstellen!<br style=\"\">  \t Sie dokumentieren alle Projektinformationen anschaulich und geben sie weiter im passenden Format.<br style=\"\">  \t <br style=\"\">  \t Sie erlernen einen praxiserprobten Workflow!<br style=\"\">  \t Dieses Video-Training enthält alle Trainingsinhalte unseres Live-Trainings, dass von unseren Teilnehmern die Bewertung &quot;5 Sterne&quot; erhalten hat.  </p>", 
    "end_date": null, 
    "title": "MS Project 2013 Training (deutsch / german)", 
    "price": "50.00", 
    "instructors": "Andreas Raupach", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/201334_493e_3.jpg", 
    "course_url": "https://www.udemy.com/ms-project-2013-training-deutsch/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-18T16:55:45Z"
}