{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t          Technology works only if we have the right training and preparation. <strong style=\"\">Learn the MS Word 2010 shortcuts and hot-keys quickly to increase your productivity.</strong> Do your work faster by selecting, moving, and manipulating text and images faster, thanks to the combination of hot-key moves explained in these videos.  </p>  <p>  \t<strong style=\"\">        Learn easy shortcut techniques like</strong>  </p>  <ul style=\"\">  \t<li>How to format paragraphs with power keystrokes</li>  \t<li>How to change capitalization easily on-the-fly</li>  \t<li>How to apply super- and sub-script in a split second</li>  \t<li>How to use F-key shortcuts for super effects</li>  \t<li>How to insert most-frequently used Word Fields with simple keystrokes</li>  \t<li>How to move rows up and down in a Word table</li>  \t<li>And more...</li>  </ul>  <p>  \t<strong style=\"\">        Watch your instructor use these shortcuts in real-time</strong> and then repeat the moves until they become second-nature.  </p>  <p>  \t          These are obviously not all the shortcuts available in Microsoft Word 2010 but the ones your instructor, a <strong style=\"\">Fortune 100 technical writer</strong>, uses on a daily basis. More videos will be added in the future to cover more techniques.  </p>  <p>  \t <em style=\"\"><strong style=\"\">What did they say about this course....</strong></em>  </p>  <ul style=\"\">  \t<li><em style=\"\"><strong style=\"\">&quot;</strong>Wow, I&#039;ve used Word for 15+ years and I learned so much from this course. I think everyone should take this course, even if it is just as a refresher.&quot; </em></li>  </ul>  <p>  \t <em style=\"\">              -- Darlene Almquist</em>  </p>  <ul style=\"\">  \t<li><em style=\"\">&quot;I learnt some of these shortcuts as an editor at a market research firm. But these are way more comprehensive and useful than those. I did have my share of &#039;Ooh&#039; and &#039;Aha&#039; moments! If you regularly use Word for creating documents, this course in keyboard shortcuts will boost your efficiency tenfold.&quot; </em></li>  </ul>  <p>  \t <em style=\"\">              -- Nikhil Khandekar</em>  </p>  <ul style=\"\">  \t<li><em style=\"\">&quot;To be honest, I didn&#039;t know the shortcuts at all before taking this course. Now I know. :)&quot; </em></li>  </ul>  <p>  \t <em style=\"\">              -- Chocolate Lu</em>  </p>  <p>  \t <strong style=\"\">SUPPLEMENTARY PDFs</strong>: Most lectures have downloadable PDFs listing the shortcuts described in the videos. Click the second-from-left button (with down arrow on it) on the upper-right corner of the lecture screen to access these PDF document.  </p>  <p>  \t<strong style=\"\">        Subscribe today</strong> to increase your productivity and mastery over the world&#039;s most popular text editing platform.  </p>", 
    "end_date": null, 
    "title": "MS Word 2010 Power Shortcuts To Finish Projects in Less Time", 
    "price": "20.00", 
    "instructors": "Ugur Akinci, Ph.D.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65001_8be2_5.jpg", 
    "course_url": "https://www.udemy.com/word-2010-shortcuts/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-11T19:42:49Z"
}