{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>THANK YOU ALL FOR CHECKING OUT THE PAGE !</strong></p><p><em>-- It is not only about PowerPoint 2016 ! there is much more --</em></p><p>This is where you will be able to create very high quality presentations and videos for your online courses or any kind of presentations that you might use in your job, university and interviews.</p><p>You don't really need more than 4 hours course to learn every single button and tips n tricks about Power Point 2016 .</p><p>I will explain to you what methods , hardware and software you need to create your videos by recording high quality slides and convert it into videos with your own voice and image!</p><p>You will be introduced to computer hardware that provide higher quality of recording, plus software that we use in order to make voice clear.</p><p>You will see some ways in order to promote your video / course after publishing it, many options to teach you how to record your video and voice.</p><p>The course explain everything A to Z , beginner to advanced ! and you will learn how to create :</p><ul><li>- Slides , videos</li><li>- Designs , shapes</li><li>- Charts , objects</li><li>- Effects and animations</li><li>- Merge video and audio together</li><li>- Split videos into small parts</li></ul><p>And probably about 20 to 30 more options !</p><p>This small platform will let you share presentation online with others ! learn how</p><p>Many people around the world use MS power point in order to give visual speech including slides or videos, so it is already famous and free , you probably can use another website to create slides but i can guarantee that this one will gives you the highest quality of image for free ! and always not for a limited period of time.</p><ul><li>I would like to thank you all for registering this course and if you any questions about the course before registering you can contact me directly please check the introduction video for more information.</li></ul><p><em>The lecture is updated !</em></p><p>Enjoy learning</p>", 
    "end_date": null, 
    "title": "MS-PowerPoint 2016 ( 365 ) A to Z ! Record Full HD videos ", 
    "price": "20.00", 
    "instructors": "Fadi Gilbert Char", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622282_c602_3.jpg", 
    "course_url": "https://www.udemy.com/mspp2016/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-25T15:52:35Z"
}