{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Is it possible to learn Excel in under two hours?</strong></p><p>  \t    Welcome to <strong>New Tricks: Easy Excel</strong>! This course is an introduction to Microsoft Excel. While Excel is a program commonly found on most computers, it can be a little intimidating to learn. In just under 2-hours, I will help you become more comfortable and confident using Excel.  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>Who is this for?</strong>  </p>  <p>  \t<strong>New Tricks: Easy Excel</strong> is for absolute beginners. It is for the person who has seen Excel, heard of it, but has no idea how to get started using it. No prior experience with Excel is necessary for this course. Familiarity with other Microsoft programs, such as Word or PowerPoint, is a plus but not a requirement at all.  </p>  <p>  \t<strong>What are the course requirements?</strong>  </p>  <p>  \t    There is only one requirement for this course: you must have access to Microsoft Excel. Technically, you could watch this course without Excel, but the tutorials are designed to be practiced. I encourage you to have Excel open as you watch the lessons and practice along with me. I am working on Excel for Mac, which means that your version of Excel may look a little bit different than mine if you are on a PC. However, all of the concepts are the same.  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>How is the course organized?</strong>  </p>  <p>  \t<strong>New Tricks: Easy Excel </strong>is composed primarily of video tutorials. In each lesson, I introduce new concepts and walk you through applying them. I take things slowly and repeat each process several times to show you how each is done. As an added bonus, the last lesson is a quick guidebook I created for you to download as a pdf document. It contains how-to directions for most of the concepts we cover in the course. Download this and keep it on your computer desktop as a quick reference while you get more comfortable with Excel.  </p>  <p>  \t    This course is organized into three sections. In “Working with Content\", we will cover the basics of Excel. This includes adding content, editing content, and learning Excel terms (like spreadsheet). The next section, “Formatting and Functions\", will introduce how to change the look of content. We will also explore the secret sauce of Excel, functions, and how these are used to execute math operations. Lastly, I will share with you my favorite Excel techniques in “Everyday Helpful Hints.\" By the end of this course, you will be able to incorporate Excel into your everyday workflow.  </p>  <p>  \t    I look forward to seeing you in class!  </p>", 
    "end_date": null, 
    "title": "New Tricks: Easy Excel", 
    "price": "35.00", 
    "instructors": "Joseph Griffin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/331380_4400_5.jpg", 
    "course_url": "https://www.udemy.com/new-tricks-easy-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-30T05:51:48Z"
}