{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>PowerPoint is the most widely used presentation software. It is also the most abused. Knowing how to use PowerPoint the right way will give a greater visual impact, keep your audience from being overwhelmed, and make your speech more memorable.</p>    <p><em>Visualize yourself giving presentations that people love!</em></p>    <p>When you have completed this course, you will be able to do just that! You will know how to properly use PowerPoint animations and slide transitions to enhance your presentation. You will recognize how to WOW your audience and not overwhelm them.</p>    <p><strong>Why This Course Will Help You</strong></p>    <p>This course will teach you how to use animations and transitions properly so you will excite your audience and make sure your message is delivered. You will learn how to apply animations to all types of objects ~ text, pictures, charts, and even SmartArt.</p>    <p>This course is broken down into <em>short lessons</em> so that you are learning only <em>one concept</em> at a time.</p>    <p><strong>Learn to Create WOW-Worthy Slides</strong></p>    <p>You will learn:</p>    <ul><li>How to use single and multiple animations to get your point across</li><li>How to use slide transitions and timings</li><li>How to add and animate charts </li><li>How to add SmartArt and animate it </li></ul><p><strong><br></strong></p><p><strong>Contents and Overview</strong></p>    <p>You will start off by learning how to work with animations and timings. You will understand how to use entrance, emphasis, and exit animations and how to use more than one of these on a single object.</p>    <p>You will learn how to add and animate charts using the most important information ~ the things your audience wants to know.</p>    <p>You will understand the categories of SmartArt, how each is used, and how to animate it for effectiveness.</p>  <p>And you will know how to use slide transitions and timings in a way that will not overtake the message of your presentation.</p>    <p><strong>Take Action Now!</strong></p>    <p>Give us an hour ~ we will give you the skills!</p>    <p>Enroll now by clicking on the <strong>“Take This Course”</strong> button above!</p>", 
    "end_date": null, 
    "title": "No More Boring PowerPoint!", 
    "price": "20.00", 
    "instructors": "Michaele Downey", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631402_e84c_3.jpg", 
    "course_url": "https://www.udemy.com/no-more-boring-powerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T15:06:24Z"
}