{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>These easy video tutorials will show you how to get maximum value from Office 365 Small Business and Small Business Premium in your small business! Master Word, Excel, PowerPoint, OneNote, OneDrive, Skype, and more. Using realistic small business examples, top Office expert Katherine Murray guides you hands-on through Office 365&#039;s apps, online conferencing, email, web tools, and more. Her course walks you step-by-step through planning for success, accessing your account, setting up users, creating team workspaces, and connecting via Skype online conferencing. Murray shows how to create and collaborate on effective Word documents, Excel worksheets, and PowerPoint presentations. Watch and discover how to take full advantage of OneDrive cloud storage, create public websites with Office 365, and even run Office 365 on mobile devices. Throughout, Murray shares powerful insider tips drawn from 25+ years of experience teaching and writing about Office. Focusing specifically on your needs in your small business, she&#039;ll help you make the most of the Office subscription you&#039;re paying for!<br style=\"\"></p><p>About the instructor:</p><p><strong style=\"\">Katherine Murray</strong> has been writing about technology for 25 years, and specializes in Microsoft products, especially Windows and Office, including Office 365 since its earliest betas. She has written extensively about web products, and wrote a tutorial on SkyDrive (OneDrive&#039;s predecessor product) for Microsoft. Her recent books include <em style=\"\">My Windows 8.1</em>, <em style=\"\">Microsoft Office Professional 2013 Plain and Simple</em>, and <em style=\"\">Microsoft Word 2010 Inside Out</em>.<br style=\"\"></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Office 365 Business Essentials ", 
    "price": "30.00", 
    "instructors": "QUE Videos", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466674_917b_3.jpg", 
    "course_url": "https://www.udemy.com/office-365-business-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T14:12:34Z"
}