{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Office Online gives you web versions of Microsoft&#039;s best productivity apps: all you need is a free Microsoft account. Now, in just one hour, these easy video tutorials will help you master Microsoft&#039;s entire Office Online app collection. <em style=\"\">Office Online: Let&#039;s Get Busy</em> shows how to create and share content with Word, Excel, and PowerPoint apps... stay in touch via Outlook, organize contacts and time with People and Calendar... store your content in the cloud... use Microsoft&#039;s apps together to collaborate, communicate instantly, and manage your whole life! Top Office expert Katherine Murray walks you through practically everything you&#039;ll ever want to do with Office Online (and even tells you what the free version can&#039;t do, so you won&#039;t waste time looking). Now, great Office tools are free wherever there&#039;s a web connection. Make the most of them—with <em style=\"\">Office Online: Let&#039;s Get Busy!</em><br style=\"\"></p><p>About the instructor:</p><p><strong style=\"\">Katherine Murray</strong> has been writing about technology for 25 years, and specializes in Microsoft products, especially Windows and Office, including Office 365 since its earliest betas. She has written extensively about web products, and wrote a tutorial on SkyDrive (OneDrive&#039;s predecessor product) for Microsoft. Her recent books include <em style=\"\">My Windows 8.1</em>, <em style=\"\">Microsoft Office Professional 2013 Plain and Simple</em>, and <em style=\"\">Microsoft Word 2010 Inside Out</em><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Office Online! Let's Get Busy", 
    "price": "25.00", 
    "instructors": "QUE Videos", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468880_1aab_3.jpg", 
    "course_url": "https://www.udemy.com/office-online-lets-get-busy/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T12:15:50Z"
}