{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">COURSE DESCRIPTION </strong><br style=\"\">Many of us work with Microsoft Office applications every day. When a new suite is released, we don&#039;t need training on the full programs. Often we only need a review of what is new, different, exciting and how we can apply these new tools to our work. <br style=\"\"><br style=\"\">This course does just that; it reviews the changes in the Office 2013 applications: Word, Excel, PowerPoint, Access, and Outlook. It also reviews changes appearing across all  applications and are not unique to just one. <br style=\"\"><br style=\"\"><strong style=\"\">Learn and Master the Features New in Office 2013</strong><br style=\"\"></p><ul style=\"\"><li style=\"\">Excel: Flash Fill, quick analysis, chart and PivotTable recommendations </li><li style=\"\">Word: Collapse headings, resume reading, new review features, edit PDFs</li><li style=\"\">PowerPoint: New themes, object formatting, multimedia improvements, Presenter view</li><li style=\"\">Outlook: Preview messages, interface changes, find and filtering, the people card</li><li style=\"\">Access: web applications, automatic UI creation, deployment options</li></ul><p><strong style=\"\">Mastering the Changes </strong></p><p>Getting to know the changes in Office 2013 is about more than just being comfortable in the new versions. It&#039;s about learning and mastering the new tools, tools that are designed to increase your productivity and make many tasks you currently do easier. Who doesn&#039;t like easier? Many of these changes allow you to &#039;buy back&#039; time in your day by reducing the amount of time it takes to complete many tasks. <br style=\"\"><br style=\"\"><strong style=\"\">Contents and Overview </strong><br style=\"\">In over 3 hours of content including 43 lectures, this course covers all the key new features appearing in the core Office applications. Sample files can be downloaded off the introduction lecture. <br style=\"\"><br style=\"\">This course broken into sections based on each Office application: Word, Excel, PowerPoint, Access and Outlook. There is also a section for changes that are applied across all of Office. <br style=\"\"><br style=\"\">Upon completion you will be comfortable working in Office 2013 and utilizing all the new tools and features.</p>", 
    "end_date": null, 
    "title": "Office 2013 New Features", 
    "price": "30.00", 
    "instructors": "CompuWorks Trainers", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400440_9765_3.jpg", 
    "course_url": "https://www.udemy.com/office-2013-new-features2/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T21:06:35Z"
}