{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t  Este curso muestra las capacidades del servicio Onedrive (antes Skydrive) el cual es muy útil para guardar y compartir nuestros archivos. Primero como método de almacenamiento y segundo como método de trabajo en equipo.  </p>  <p style=\"\">  \t  Deberían realizar este curso, por que el servicio onedrive es inherente a su correo electrónico, osea que si posees un <strong style=\"\"><em style=\"\">e-Mail</em></strong> de <strong style=\"\">Hotmail</strong> u <strong style=\"\">Outlook</strong>, los <strong style=\"\">15gb</strong> de almacenamiento están ahí esperando a ser usados por ti. Sube tus archivos mas importantes, tus lecturas mas entretenidas, tus fotos familiares o tu música o vídeos favoritos. ¡Úsalo como gustes, pero úsalo!  </p>  <p style=\"\">  \t  La terminología es sumamente sencilla, si sabe lo común del uso de Microsoft Windows como cortar, copia y pegar, entederá fácilmente este curso.  </p>  <p style=\"\">  \t  Por el momento no existe ningún material para descargar, debido a que es un servicio donde podrán subir sus propios archivos.  </p>  <p style=\"\">  \t  El curso es intensivo e intencionado para terminarlo a lo máximo en 1 hora. Ir al grano es lo preferente aquí.  </p>  <p style=\"\">  \t  La estructura del curso es ir de lo básico a lo profesional.  </p>  <p style=\"\">  \t  La primer sección explica como entrar al servicio de distintas maneras.  </p>  <p style=\"\">  \t  La segunda sección menciona como crear, manejar y compartir archivos, así igual cada una de las opciones que se encuentran en Onedrive.  </p>  <p style=\"\">  \t  Y la tercer sección hace uso de las opciones avanzadas de Onedrive desde la computadora y del celular o la tablet.  </p>  <p style=\"\">  \t  Y como bonus extra un par de exámenes de 7 preguntas cada uno.  </p>  <p style=\"\">  \t  Espero y sea de gran utilidad.  </p>", 
    "end_date": null, 
    "title": "Onedrive Básico a Profesional (Actualización en curso)  .", 
    "price": 0, 
    "instructors": "Gustavo Mendoza", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413747_80f8_3.jpg", 
    "course_url": "https://www.udemy.com/onedrive-de-basico-a-profesional/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T02:53:41Z"
}