{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>\"I can't believe how much I learned The instructor is great and the lessons were so easy to follow.</strong><strong>\" Sherie L.</strong></p><p><strong>Theres a reason it's the top OneNote course on Udemy. There's a reason for the rave reviews... </strong>sign up today to see why.</p><p>  \t    Fully updated for the most recent version, Microsoft <strong>OneNote - Like a Boss</strong> is a comprehensive course that takes  students from complete newbie to guru with Microsoft's note taking and organizing software that's an integral part of the Office suite of applications.  </p>  <p>  \t      In other words, after taking this course, students will be able to use OneNote... like a Boss.  </p>  <p>  \t      The course includes approximately 7 hours of video instruction  delivered in 100 separate lessons, making it perfect for learning the  application from the ground up, or for going back to review/refresh on a  specific skill.  </p>  <p>  \t      Author and Microsoft Certified Instructor Brian Culp will give students  a guided tour of the  application's newest, most commonly used, and most powerful features.  </p>  <p>  \t      Students of this course will learn how to:  </p>  <ul>  \t<li>create and manage OneNote notebooks</li>  \t<li>customize notebook settings and properties</li>  \t<li>manage page layout options and use templates</li>  \t<li>create To Do lists</li>  \t<li>search for contents within and across notebooks</li>  \t<li>insert screen clips and images</li>  \t<li>record audio and video notes</li>  \t<li>apply tags and search for tags</li>  \t<li>link to files and notebook pages</li>  \t<li>and much more. </li>  </ul>  <p>  \t      Additionally, the objectives of this training will also prepare students  for the Microsoft Office Specialist 74-421 Certification Exam.  </p>  <p>  \t      By simply following along with the hands-on exercises, viewers  of this course will be able to create a working notebook with multiple pages and sections, all from  scratch, and all without the need to download course or demo files.  </p>  <p>  \t<strong>What's more, the results are guaranteed!</strong>  </p>  <p>  \tYou'll have a better understanding of projects and Microsoft OneNote than ever before, or your money back. If you need to learn OneNote, and  need to learn it fast, please enroll or watch a couple of sample lessons - it might just change the way you organize your ideas, your classes, or your business.  </p>", 
    "end_date": null, 
    "title": "OneNote 2013/2016/365 - Like a Boss. The Definitive Course.", 
    "price": "45.00", 
    "instructors": "Brian Culp", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/435078_6a15_4.jpg", 
    "course_url": "https://www.udemy.com/microsoft-onenote-2013-like-a-boss/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-28T18:47:20Z"
}