{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>New to Microsoft OneNote? Wondering what it does, or whether it can help you become a productivity ninja at work or at school? </p><p>This is the course for you.</p><p>Because in the time it takes to watch a movie, you can be <strong style=\"\">Up to Speed</strong> with OneNote 2013. </p><p>As you&#039;ll see, there&#039;s a reason Microsoft included it with all versions of Office, and why it&#039;s available for free the App store for use on a Mac.  </p><p><strong style=\"\">The reason is this:</strong></p><p><strong style=\"\"></strong>Imagine having all your notes in one place. Backed up. Searchable. OneNote could  save your bacon when you&#039;re trying to remember what that professor said in last week&#039;s class. It could win you high praise when you&#039;re the only one who can track down those meeting minutes  from 6 months ago.</p><p>And what&#039;s more, it takes just a few minutes to get <strong style=\"\">Up to Speed</strong>.</p><p>In the span of a single  afternoon, students can expect to learn how to: </p><ul style=\"\"><li>create and manage OneNote notebooks</li><li>add and position notes on notebook pages</li><li>work with attachments and images</li><li>email and print notes</li><li>and a few power-user techniques. Just because. </li></ul><p>In fact, once you&#039;ve gone through this course, you might decide that it&#039;s time for your paper notebooks to go the way of your movies on video tape. Because technology.</p><p>So sign up today. Results are guaranteed - you&#039;ve got nothing to lose, besides the headache of keeping track of all that paper.</p><strong style=\"\">About the Instructor:</strong><p>I&#039;m Brian. A Microsoft Certified Instructor. Over the course of 10 years, I&#039;ve authored over 30 technical titles for publishers like O&#039;Reilly, McGraw-Hill and Addison-Wesley. I&#039;ve taught technical subjects to individuals and Fortune 500 companies - clients like Microsoft, Sprint, Sony Pictures Entertainment, and Budweiser.</p><p>But most importantly, I think OneNote is really cool, and think more people would use to keep their lives more organized if they understood a little more about what it can do.</p><p> <strong style=\"\">Praise from Udemy:</strong></p><p>We looked at some data + feedback for your course(s) and found <strong style=\"\">you ranked in the top group of instructors</strong> on Udemy!<strong style=\"\"></strong></p><p><strong style=\"\">What others are saying about Brian&#039;s courses:</strong></p><p><strong style=\"\"></strong>&quot;This course is great. The topics are interesting and Brian involves you in the topic, on each video.&quot; - Jesus</p><p>&quot;Instructor has very good presentation style – very natural and conversational. Like listening to a coworker help give me some pointers.&quot; - Sami</p><p>&quot;This is a great into for anyone learning how to use this program and values real world references.&quot; - Chris<strong style=\"\"></strong></p><p><strong style=\"\">Get Up to Speed - guaranteed.</strong></p><p>As with all my Udemy courses, it comes with a no-questions, 30-day, money back guarantee. So if you need to learn OneNote, and need to learn it fast, please enroll today. There&#039;s absolutely no risk.</p><strong style=\"\"><strong style=\"\"></strong></strong>", 
    "end_date": null, 
    "title": "OneNote 2013 Up to Speed - Master the Basics in Just 1 hr", 
    "price": "20.00", 
    "instructors": "Brian Culp", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/518056_eddb_3.jpg", 
    "course_url": "https://www.udemy.com/onenote-2013-up-to-speed/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-02T14:16:51Z"
}