{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><strong>There's a reason for the 5 star reviews... sign up today and find out why!</strong></strong></p><p>Microsoft Outlook Like a Boss is a comprehensive  video lecture course that takes student from complete newbie to guru  with Microsoft's email, calendar, contacts, and tasks management software - one of the anchors in the Microsoft Office productivity suite.  </p>  <p>  \tIn other words, students will be able to use Outlook... like a Boss.  </p>  <p>  \t            Whether you're using Outlook for the very first time, or a seasoned email ninja, but looking for some power user tips and tricks, author  and Microsoft Certified Instructor Brian Culp will give you  a  guided tour of  the application's newest, most commonly used, and most  powerful  features.  </p>  <p>  \t            Students of this course will learn to:  </p>  <ul>  \t<li>customize the Outlook experience</li>  \t<li>navigate the Outlook interface with confidence</li>  \t<li>set up multiple email accounts, including Exchange</li>  \t<li>organize and sort messages</li>  \t<li>create meetings and appointments</li>  \t<li>manage and delegate tasks</li>  \t<li>schedule resources</li>  \t<li>understand the People pane</li>  \t<li>manage contacts and groups</li>  \t<li>and much, much more</li>  </ul>  <p>  \tAnd for those looking for possible career advancement, the course correlates strongly with the MOC exam 77-423.  </p>  <p>  \tAdditionally, students will learn Outlook by doing. By simply following along with the hands-on exercises,  viewers will set up email, then create calendar items, contacts, and tasks - all without  the need to download course or demo files.  </p>  <p>  \t  You'll use the application just like you would at work or at  school. So don't get frustrated fumbling around when it's so easy to  learn the <strong>right</strong> way to use Outlook.  </p>  <p>  \t          The course includes roughly 8 hours of video  instruction, delivered in more than 100 individual, bite-sized lessons,  making it perfect for learning the application from the ground up, or  for going back to review/refresh on a specific skill.  </p>  <p>  \t<strong>What's more, the results are guaranteed!</strong>  </p>  <p>  \t           You'll quickly gain a mastery of Outlook's capabilities,  or your money back. So if you need to  learn Outlook and need to learn it  fast, please enroll or watch a couple  of sample lessons. Thanks for checking out the course.  </p>", 
    "end_date": null, 
    "title": "Outlook 13/16/365 - Like a Boss. How to be crazy efficient.", 
    "price": "45.00", 
    "instructors": "Brian Culp", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434390_cea9_4.jpg", 
    "course_url": "https://www.udemy.com/microsoft-outlook-2013-like-a-boss/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T19:24:16Z"
}