{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t <strong style=\"\">What is this course about?</strong>  </p>  <p>  \t Exchange Server 2013 is the latest release of the Microsoft Messaging Suite of products.   It brings with it major architectural changes, making it faster, more reliable and most of all more secure.  In this course you will be introduced to Exchange Server 2013 and it&#039;s workings.  We will be focusing on the Design aspects and integration with Active Directory in regards to Windows Server 2012.  This course will take you through the design process to the actual implementation,   This course can help you to study for the MCSE Exchange Server 2013 exams.   It is based on real world concepts and will assist you in deploying a fully functional, redundant Exchange Server 2013 environment.  </p>  <p>  \t <strong style=\"\">What kind of materials are used?</strong>  </p>  <p>  \t The learning will be done through videos.   The videos will have lecture and step by step instructions on how to configure your environment.  </p>  <p>  \t <strong style=\"\">What is the structure of the course?</strong>  </p>  <p>  \t This is Part 1 of the series for Exchange Server 2013 Planning and Implementation.  Part 1 will focus on the design and implementation of the Exchange Server 2013 environment.   Part 1 of the series will take about 4 hours to complete.   There are five sections in Part 1.  </p>  <p>  \t <strong style=\"\">Why take this course?</strong>  </p>  <p>  \t This course will provide you the real world knowledge about Exchange Server 2013 taken from many implementations of the technology and based on an Exchange Server 2013 boot camp.   It is self-paced look into the Exchange technology.   After taking this course you will have knowledge to implement Exchange Server 2013 and also prepare you for the MCSE Exchange Server 2013 exam 70-341, Core Solutions of Microsoft Exchange Server 2013.  </p>  <p class=\"style7\">  \t <strong style=\"\">Recommendations</strong>  </p>  <p class=\"style5\">  \t “I have been blessed attend two classes taught by Michael and I can honestly say he is an outstanding instructor!          He makes you feel empowered by the knowledge he imparts and that is a great asset for any instructor.  I should         know as I have attended much training throughout my IT career.  I am extremely pleased with his abilities as an         instructor.  I plan on utilizing the trainings he offers for years to come. Thanks again for the awesome opportunity         to learn and advance my career!”<br style=\"\">  \t <br style=\"\">  \t Steve Giovanni - MCP, ITIL, CCNA, MCTS: Exchange, Hyper-V<br style=\"\">  \t         ista North America<br style=\"\">  \t           Director of Corporate Infrastructure  </p>  <p class=\"style5\">  \t         &quot;Certainly this was an experience; I was very impressed with the skill and knowledge of the instructor and the way in         which the Exchange 2007 course was presented. The pace was intense but the results were definitely worth the effort.         I have been home less than a week and have our new exchange 2007 server up and running both sending and receiving mail.&quot;<br style=\"\">  \t <br style=\"\">  \t         PS:  Michael and Ellina take great care in making sure stay comfortable. <br style=\"\">  \t <br style=\"\">  \t         Mark Jones <br style=\"\">  \t         CMC Microsystems  </p>  <p class=\"style5\">  \t             &quot;Taking Michaels class was a very enjoyable class. I was able to get all my             questions answered. I had taken an Intro to Exchange 2010 from Microsoft and I             learned a lot more thru Michaels Class than I did in that class. I did the class             thru a web link and it was one of the best classes I have taken. I would             recommend anyone to take his class, or any of his classes he teaches. I am             telling my co-workers to look at the classes he teaches. &quot;  </p>  <p class=\"style5\">  \t Exchange Server 2010  </p>  <p class=\"style5\">  \t Eric Sockwell<br style=\"\">  \t             Network Administrator<br style=\"\">  \t             Georgia Department of Transportation<br style=\"\">  </p>  <p class=\"style10\">  \t             &quot;The Microsoft Exchange 2010 SP2 MCITP Real World Boot Camp was great.  The             information was presented in “real world” fashion.  It focused on             best-practice implementation strategies and helpful routine maintenance             scenarios.  Although it was a lot to take in a short amount of time, the             accompanying exercises helped solidify the material presented.              Additionally, ample opportunity was afforded for questions and all were answered             based on personal expertise of the instructor—not looked up in a manual.              As far as the venue, it’s not your typical “sit in a classroom and follow along             if you can”.  It is geared more like a “working vacation” which is an             interesting twist.  You are encouraged to bring your family and spend             evenings with them after your days of hard work.  If you’re looking for an             intense MS Exchange training workout with an added benefit of great amenities,             this is the only way to go!&quot;  </p>  <p class=\"style11\">  \t E. Schoneck<br style=\"\">  \t             Senior Systems Analyst  </p>  <p class=\"style11\">  </p>  <p class=\"style11\">  \t   &quot;It is with great pleasure and pride for me to write this letter of recommendation for Michael  Krout, who was my Exchange 2013 teacher at in Florida.  Mr. Krout is, without question, one of the most outstanding, knowledgeable and practical teacher I have studied under.  </p>  <p class=\"style11\">  \t He is a careful and creative teacher who brings the actual working experience and knowledge to the class room. He has the terrific ability to turn the class room into a working environment to build students level of confidence. I was deeply moved with his teaching ability to cover a wide range of topics in such a short time and with clarity.  </p>  <p class=\"style11\">  \t <span style=\" color:windowtext;\">Michael is to be commended for his professionalism concern for his students, and quality of instruction. He plans well and works diligently at being organized. His preparation each day is extraordinary.</span>  </p>  <p class=\"style11\">  \t <span style=\" color:windowtext;\"></span> I have found Michael to be uniquely resourceful and adaptive. He has made an outstanding effort to vary course material and present it in different and unusually ways. Heis receptive to new ideas and constantly looks for innovative methods to present course content. He is thorough and precise. Mr. Krout is a man of great knowledge and talent. He is also an engaging teacher. His aptitude to work in classroom and industries has made him very unique in his field.  </p>  <p class=\"style11\">  \t I highly recommend that you consider Mr. Krout for boot camps, consultation for your networking infrastructure. I believe he would be an invaluable asset and the quality of his character will serve as a model for students and faculty alike.&quot;  </p>  <p class=\"style11\">  \t Michael M. Dawkins<br style=\"\">  \t Grand Cayman, Cayman Islands<br style=\"\">  \t Exchange Server 2013 Boot Camp Student<br style=\"\">  </p>  <p class=\"style11\">  </p>", 
    "end_date": null, 
    "title": "Planning and Implementing Exchange Server 2013 Part 1", 
    "price": "50.00", 
    "instructors": "Michael Krout", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/139866_24fc_6.jpg", 
    "course_url": "https://www.udemy.com/planning-and-implementing-exchange-server-2013-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-30T23:06:13Z"
}