{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t    Knowing how to create a PowerPoint slide is one thing. Knowing how to create an effective slide is something all together different! As Roger Courville, author of The Virtual Presenters says - PowerPoint doesn’t teach you to do effective slides anymore than Microsoft Word teaches you how to be a good writer. But this course will! During <strong style=\"\">Power Up Your PowerPoint</strong> you&#039;ll see and experience how creating effective slides will improve your presentations. Specifically, you&#039;ll learn:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t    ·Why the default settings are hurt the effectiveness of presentation slides  \t</p>  \t<p style=\"\">  \t\t    ·The step-by-step process for creating effective slides  \t</p>  \t<p style=\"\">  \t\t    ·How to revise existing slides to be more effective  \t</p>  \t<p style=\"\">  \t\t    ·How to increase audience retention through the design of your slides  \t</p>  \t<p style=\"\">  \t\t    ·Where to find free and low cost photographs for your presentations  \t</p>  \t<p style=\"\">  \t\t    ·The Rule of Thirds and other practical techniques to make slides look their best  \t</p>  \t<p style=\"\">  \t\t    ·Why there’s no such thing as too many slides  \t</p>  \t<p style=\"\">  \t\t    ·Other exciting things you can do to liven up your presentation slides  \t</p>  \t<p style=\"\">  \t\t    ·You don&#039;t have to be a graphic designer to create beautiful, effective slides. Learn how to ditch  \t</p>  \t<p style=\"\">  \t\t    the default setting and Power Up Your PowerPoint.  \t</p>  </ul>  <p style=\"\">  \t    Almost anyone can piece together a PowerPoint presentation. This course offers a great way to learn how to “amp up” your presentations and deliver your message with the power and authority required to communicate effectively.  </p>", 
    "end_date": null, 
    "title": "Power Up PowerPoint!", 
    "price": "20.00", 
    "instructors": "Chip Reaves", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/257710_3308_2.jpg", 
    "course_url": "https://www.udemy.com/power-up-powerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-08T13:22:25Z"
}