{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">This course is the first in a series that covers the new Microsoft Office Specialist exam format for 2013. The new exams are completely different!<br style=\"\"><br style=\"\">PowerPoint 2013: Office Certification Series covers the&nbsp;<a href=\"http://www.microsoft.com/learning/en-us/exam.aspx?ID=77-422\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">PowerPoint 2013 Microsoft Office Specialist Exam #77-422</a>&nbsp;exam from Microsoft. By passing this exam and earning a Microsoft certification you become part of the MCP (Microsoft Certified Professional) network which will enhance job opportunities and could increase pay as well.<br style=\"\"><br style=\"\">With the course you will receive practice materials and the skills needed to pass the PowerPoint 2013 exam. This course should take you only a few days to complete.There are 6 sections in this course, and each lecture is tied directly to one or more skill measures as defined by Microsoft.<br style=\"\"><br style=\"\">This course covers every objective listed by Microsoft and a few skills that are not, but are considered valuable knowledge. Mail merge for example is not covered on the exam, but is a huge time saver when having to compose form letters to multiple recipients.<br style=\"\"><br style=\"\">To register for the exam please visit Microsoft&#039;s exam provider Certiport and purchase an exam voucher. The website is&nbsp;<a href=\"http://www.certiport.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">www.certiport.com</a>.&nbsp;Select Register in the upper right corner, to begin the process. When asked what your purpose is answer &quot;Take an Exam.&quot; Then register for the Microsoft exams. Now you are all set to visit a Certiport testing center to take your exam!<br style=\"\"><br style=\"\">Once you pass the exam, you will receive an exam certification and access to the Microsoft Certified Professional website which offers a wealth of benefits.</p>  ", 
    "end_date": null, 
    "title": "PowerPoint 2013: Office Certification Series", 
    "price": "30.00", 
    "instructors": "Justin Crompton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/57214_204b_5.jpg", 
    "course_url": "https://www.udemy.com/ppt2013certification/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-30T03:10:56Z"
}