{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<ul><li><strong class=\"redactor-inline-converted\">13,000+ Students </strong>have enrolled in my <strong class=\"redactor-inline-converted\">13 Courses!</strong></li><li>The <strong class=\"redactor-inline-converted\">4.65 Rating</strong><strong class=\"redactor-inline-converted\"> from student reviews </strong>shows the value packed in this course!</li><li><strong class=\"redactor-inline-converted\">Practicality: </strong>This course has a <strong>250-slide PowerPoint Template </strong>and is a <strong>step-by-step guide </strong>to using PowerPoint &amp; Excel together.</li></ul>\n\n<p>PowerPoint and Excel are 2 very different pieces of software, however, this does not mean you cannot use PowerPoint and Excel together. In fact, Management Consultants especially have great knowledge of how to use the 2 softwares to create stunning presentations which are automated, data-driven, beautifully designed and impressive to read. Mastering both PowerPoint and Excel and knowing how to work with both at the same time can be invaluable and that's exactly what I strive to present to you in this course.</p>\n\n<p><br></p>\n\n\n\n<p>What would it be like if each and every one of your PowerPoint presentations were stunning and impressed your attendees, co-workers, senior managers or investors without you saying a word yet?</p>\n\n\n\n<p>How about transforming raw data from Excel and turning it into beautiful Charts &amp; Graphs that impress and save you countless hours of work every month?</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>The \"Stunning Presentation\" Guarantee</em></strong></p>\n\n\n\n<p>Commit to take action and I GUARANTEE your Presentation skills will improve tremendously. If that's not the case, I will personally train you to achieve the results you desire. But more on the guarantee later…</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>The Secret</em></strong></p>\n\n\n\n<p>You might have wondered how Management Consultants and Investment Bankers always churn out PowerPoint presentations that look incredible. I mean, give them credit, once you see their decks you instantly think to yourself \"This guy sure knows what he's talking about…\"</p>\n\n\n\n<p>How do they do it? Are they more clever than us? Do they have a talent for crafting presentations and manipulating spreadsheets that we simply don't possess?</p>\n\n\n\n<p>No. They simply have <strong class=\"redactor-inline-converted\">more resources available</strong> to them &amp; <strong class=\"redactor-inline-converted\">the necessary training</strong> to take advantage of them. In fact, I'll even share with you what they have and you might not:</p>\n\n\n\n<ol> <li>Company specific PowerPoint Templates - they don't have to break a sweat to create amazing looking slides.</li> <li>Knowledge about PowerPoint Design - they know how to manipulate those templates and make them work for them</li> <li>Knowledge about Excel Charts &amp; Tables - they manipulate raw data in Excel and link it to PowerPoint effortlessly</li> <li>Specialised software - they use this to make their charts more interactive in PowerPoint and link them to Excel</li> </ol>\n\n\n\n<p>So there you go. I've just laid out to you what you need to reach that level. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">But imagine how much time &amp; money you would save if you took this course and in little more than 3 hours get to that level…</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>The Course</em></strong></p>\n\n\n\n<p>This course is specifically built to make you reach that level . Learn exactly how to make full use of Excel &amp; PowerPoint:</p>\n\n\n\n<ul> <li>PowerPoint Design Fundamentals: Learn how to design PowerPoint decks that will WOW those around you and will make them perceive you as a master presenter</li> <li>Excel Fundamentals: Create stunning charts &amp; tables that can be seamlessly integrated in your presentations</li> <li>The Secret Ingredient walkthrough: Learn what software &amp; tricks Management Consultants use to create mind-blowing data-driven presentations.</li> </ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Plus, 3 bonuses:</strong></p>\n\n\n\n<ul> <li>A<strong class=\"redactor-inline-converted\"> FREE PowerPoint template</strong> with over 200 unique slides strategically built for you to reuse in corporate presentations and client pitches. This will drive you results straight out of the box!</li> <li>The Essential Keyboard Shortcuts PDF to maximise your PowerPoint &amp; Excel efficiency</li> <li>10 Fill-in-the-Data Done-for-You Secret Charts that make your presentations exciting</li> </ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>The Guarantee</em></strong></p>\n\n\n\n<p>If after 30 days you don't feel like you've taken your presentation skills to another level, then I demand you contact me immediately. Apart from refunding your money, I will personally train you via:</p>\n\n\n\n<ul> <li>Analysing your PowerPoint template - overall design elements &amp; Excel charts</li> <li>30 minute coaching call: discuss aspects you struggle with and help you overcome them</li> </ul>\n\n\n\n<p>I hope you can see by now, there is absolutely no risk when purchasing this course.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Enroll now and take your PowerPoint &amp; Excel skills to the next level!</strong></p>", 
    "end_date": null, 
    "title": "PowerPoint & Excel Fusion (+250 PowerPoint Slides)", 
    "price": "40.00", 
    "instructors": "Dragos Stefanescu, Richard Korbut", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525788_d080_4.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-excel-fusion-exec-strategies-250-slide-deck/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T07:20:22Z"
}