{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Welcome To The PowerPoint 2013 Microsoft Office Specialist Certification course</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">⇉ Watch the promo video </strong>to see How You Can Begin creating powerful and effective presentations Today! </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">⇉ This Course is POWERFUL! </strong>You receive over<strong class=\"redactor-inline-converted\"> 3+ hours of video</strong> content in <strong class=\"redactor-inline-converted\">HD 1080p!</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">⇉ Join Over 125,000+</strong> <strong class=\"redactor-inline-converted\">Students</strong> Who Have Enrolled In our Udemy Courses This Year!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">⇉ 2500+ Five Star Reviews Shows</strong> Students Who Enrolling Are Getting Real Results!</p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here Is Everything You Will Learn In Our Complete Course: </strong></p>\n\n\n\n<p>PowerPoint 2013: Office Certification Series covers the <strong class=\"redactor-inline-converted\">PowerPoint 2013 Microsoft Office Specialist Exam #77-422 exam</strong> from Microsoft. By passing this exam and earning a Microsoft certification you become part of the MCP (<strong>Microsoft Certified Professional</strong>) network which will enhance job opportunities and could increase pay as well..</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"></strong></p>\n\n\n\n<p>Here's what you will learn in this complete course:</p>\n\n<p>1.0 Create and Manage Presentations</p>\n\n\n\n<ul><li><strong>1.1 Create a Presentation</strong> \nThis objective may include but is not limited to: creating blank presentations, creating presentations using templates, importing text files into presentations, importing Word document outlines into presentations</li><li><strong>1.2 Format a Presentation Using Slide Masters</strong> \nThis objective may include but is not limited to: applying a slide master, adding new layouts, modifying existing layouts, adding background images, controlling slide numbers, inserting headers and footers, modifying presentation themes</li><li><strong>1.3 Customize Presentation Options and Views</strong> \nThis objective may include but is not limited to: changing page setup options, changing to view in color/grayscale, using views to navigate through presentations, modifying presentation properties</li><li><strong>1.4 Configure Presentations to Print or Save</strong> \nThis objective may include but is not limited to: setting handout print options, printing selections from presentations, packaging presentations for CD, saving presentations as XML, printing presentations in grayscale, printing speaker notes, maintaining backward compatibility</li><li><strong>1.5 Configure and Present Slideshows</strong> \nThis objective may include but is not limited to: creating custom slideshows, configuring slideshow options, rehearsing timing, configuring resolution, using Presenter View, navigating within slideshows, annotating slideshows</li></ul>\n\n\n\n<p>2.0 Insert and Format Shapes and Slides</p>\n\n\n\n<ul><li><strong>2.1 Insert and Format Slides</strong> \nThis objective may include but is not limited to: adding slides layouts, duplicating existing slides, hiding slides, deleting slides, modifying slide backgrounds, applying styles to slides</li><li><strong>2.2 Insert and Format Shapes</strong> \nThis objective may include but is not limited to: modifying shape backgrounds, applying borders to shapes, resizing shapes, inserting shapes, creating custom shapes, applying styles to shapes</li><li><strong>2.3 Order and Group Shapes and Slides</strong> \nThis objective may include but is not limited to: inserting section headers, modifying slide order, aligning and grouping shapes, displaying gridlines</li></ul>\n\n\n\n<p>3.0 Create Slide Content</p>\n\n\n\n<ul><li><strong>3.1 Insert and Format Text</strong> \nThis objective may include but is not limited to: changing text to WordArt, creating multiple columns in a single shape, inserting hyperlinks, applying formatting and styles to text, creating bulleted and numbered listss</li><li><strong>3.2 Insert and Format Tables</strong> \nThis objective may include but is not limited to: creating new tables, modifying number of rows and columns, applying table styles, importing tables from external sources</li><li><strong>3.3 Insert and Format Charts</strong> \nThis objective may include but is not limited to: creating and modifying chart styles, inserting charts, modifying chart type, adding legends to charts, modifying chart parameters, importing charts from external sources</li><li><strong>3.4 Insert and Format SmartArt</strong> \nThis objective may include but is not limited to: adding shapes to SmartArt, changing color of SmartArt, moving text within SmartArt shapes, reversing direction, converting lists to SmartArt</li><li><strong>3.5 Insert and Format Images</strong> \nThis objective may include but is not limited to: resizing images, cropping images, applying effects, applying styles</li><li><strong>3.6 Insert and Format Media</strong> \nThis objective may include but is not limited to: adjusting media window size, trimming timing on media clips, setting start/stop times, setting media options, linking to external media</li></ul>\n\n\n\n<p>4.0 Apply Transitions and Animations</p>\n\n\n\n<ul><li><strong>4.1 Apply Transitions between Slides</strong> \nThis objective may include but is not limited to: inserting transitions between slides, managing multiple transitions, modifying transition effect options</li><li><strong>4.2 Animate Slide Content</strong> \nThis objective may include but is not limited to: applying animations to shapes, applying animations to text strings, adding paths to animations, modifying animation options</li><li><strong>4.3 Set Timing for Transitions and Animations</strong> \nThis objective may include but is not limited to: modifying duration of effects, configuring start and finish options, reordering animations, using the Animation Pane</li></ul>\n\n\n\n<p><em>__________________________________________________________________________</em> <br></p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards mastering Python! </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">When we learn something new,</strong> I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the <strong class=\"redactor-inline-converted\">Udemy</strong> <strong class=\"redactor-inline-converted\">30-day money back guarantee</strong>, you have my personal guarantee that you will love what you learn in this course. If you ever have any questions please feel free to message us directly and we will do our best to get back to you as soon as possible!</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em></p>\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p>This course will not remain this price forever! It's time to take action!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Click the \"take this course\" button at the top right now!</strong></p>\n\n\n\n<p>...<em>every hour you delay is costing you money</em>...</p>\n\n\n\n<p>See you in the course!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Sincerely,</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Syed Raza &amp; Joe Parys  </strong></p>", 
    "end_date": null, 
    "title": "PowerPoint 2013 Microsoft Office Specialist Certification", 
    "price": "20.00", 
    "instructors": "Syed Raza, Joe Parys", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822892_bb16_2.jpg", 
    "course_url": "https://www.udemy.com/microsoftpowerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T15:29:00Z"
}