{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>* Topics covered work in PowerPoint 2007, PowerPoint 2010, PowerPoint 2013 and </strong><strong>PowerPoint </strong><strong>2016</strong></p><p><strong>Join us and learn how to not only create, but deliver a presentation that will knock the socks off your audience members.</strong></p>\n\n<p><strong>But Beware, enrolling in this course will forever change the way that you look at PowerPoint presentations</strong>. This course will walk you through the various techniques of creating and delivering an engaging, dynamic presentation with PowerPoint as your tool. But PowerPoint is only one part of creating an effective presentation. This course will also focus on you. The presenter. The facilitator. The subject matter expert. You will learn how to take command of the room and deliver a presentation that will not soon be forgotten.</p>\n\n\n\n<p><strong>This is course is broken into two main sections, each with relative, supporting sub-topics. (With plenty of exercises on each topic)</strong></p>\n\n\n\n<ol><li><strong>Creating an Impactful PowerPoint Presentation</strong></li><li><strong>Presenting an Impactful PowerPoint Presentation</strong></li></ol>\n\n\n\n<p><strong>So, what are you waiting for?</strong> Join us now to forever change the way you approach creating and delivering a PowerPoint presentation. <em>Oh, and don't forget to hold onto your socks, they just might get blown off.</em><br></p>", 
    "end_date": null, 
    "title": "PowerPoint - Impactful Microsoft PowerPoint Presentations", 
    "price": "20.00", 
    "instructors": "Kyle Pew", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660342_df13_4.jpg", 
    "course_url": "https://www.udemy.com/create-impactful-presentations-with-microsoft-powerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T19:52:04Z"
}