{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course is for beginner and intermediate users of Microsoft PowerPoint to get up to date to higher intermediate - advanced user status. This course is based on PowerPoint 2007, so even if you've used PowerPoint 2003 to a level - this course is still worth taking because a lot of new functions and features have been introduced into this version, plus things aren't in the same place - and it can be confusing to navigate at first.</p><p>The course is designed to give you the handy hints and tips in an easy, focused, jargon-free way, so that you'll get up and running and functioning on PowerPoint 2007 in the shortest possible time.</p><p>The course is structured as a series of video lectures on a different aspect / element of PowerPoint. Where useful, the presentation is attached, so the student can look at what the course tutor has done.</p><p>The course will take approx 3-4 hours to complete. Each lecture is about 10-15 min long, and we cover a different topic in each one. We cover:</p><ul><li>Creating slide layouts</li><li>Creating custom layouts</li><li>Using Pictures</li><li>Creating a photo album</li><li>Clip Art</li><li>Tables</li><li>Adding a movie and sound to your presentation</li><li>Creating and using animation</li><li>Importing Excel content</li><li>Moving graphics between Word and PowerPoint</li><li>Background design</li><li>Working with Charts</li><li>Printing</li></ul>This course is useful for students, workers, writers - anyone who has to use PowerPoint 2007 in a work or home environment, and wants to get to grips with the program and make it do what you want it to do.<p></p><p>You'll particularly benefit from the course if you are currently working on a personal project presentation and want to be able to improve it and 'wow' your audience. The more you use this information (especially for yourself), the more the learning will be practical and useful, and it will stick with you.</p><p>The course tutor has been a user of PowerPoint since 1999. Having done a degree in Accounting with Marketing, there were always presentations to do using PowerPoint, and since graduating and starting a business, the author often gives talks on entrepreneurship and business, and only ever uses PowerPoint to present information. Microsoft PowerPoint is an extremely powerful program, once you know how to use it. Join the course and learn how to do everything with MS PowerPoint 2007.</p>", 
    "end_date": null, 
    "title": "Powerpoint 2007 Made Easy", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/591672_2f65.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-2007/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T09:12:39Z"
}