{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>According to Microsoft estimates, there are more than 30 million presentations created daily. Over 6 million teachers around the world use PowerPoint for classroom lectures, and there are more than 120 million people who use PowerPoint for business presentations. </p><p>The key to  delivering a great presentation that will convey your message with a bang is to master the fundamentals of Microsoft PowerPoint 2013. In this introductory course, you will do just that. </p><p>You will start by learning to navigate the PowerPoint 2013 interface, including the Ribbon, Backstage View and the Quick Access Toolbar.</p><p>As you dive further into the course, you will discover concepts to help you create a basic presentation, use themes and templates, format text boxes, slide transitions, apply animations to objects and use presentation tools in your slide show.</p><p><strong>Learn and master the most popular presentation software in this introductory course.</strong></p> <ul><li>Layout of the PowerPoint interface<strong></strong></li> <li>Opening new presentations and templates<strong></strong></li> <li>Slide layouts<strong></strong></li> <li>Slide customization<strong></strong></li> <li>Working with text boxes and images<strong></strong></li> <li>Slide transitions<strong></strong></li> <li>Animations<strong></strong></li> <li>Presentation tools<strong></strong></li> <li>Saving, sharing, and exporting <strong></strong></li> <li>Setting up a slide show<strong></strong></li></ul> <p><strong>A powerful tool in your hands</strong></p><p>Learning the basics of PowerPoint 2013 puts a powerful and very valuable tool in your hands. PowerPoint 2013 is easy to learn, offers many more options than previous versions, and can be used in many different ways. Build your confidence in a way you never thought you could by learning how to design slides that are engaging and will keep your audience tuned in to what you are saying and what you are showing.</p><p>This course is perfect for anyone who has to design presentations whether it's for school, a job or you're self-employed and want to use presentations to market your product or service.</p><p><strong>Content and Overview</strong></p><p>Suitable for beginning slide creators, through this course of X lectures and X hours of content you'll learn the basics of slide design and form a solid understanding of the concept behind great slide design. Each section ends with practice exercises that allow you to put your new learned skills to use right away.</p><p>Starting with the layout of the interface, this course will take you through navigating the Ribbon and the Backstage areas, formatting slides, working with images, transitions and animations. By creating slides along the way, you will form a solid understanding of slide design. </p><p>After mastering the basics, the course takes you through the steps for setting up a slide show and how to use presentation tools that will enhance your presentation even more.</p><p>Students completing this course will have the knowledge and the skills to create stunning slide presentations for use in any setting (job, school, or business).</p><p>As you complete the practice exercises and share your creations with the class you will gain greater confidence in creating presentations.</p><p><strong>What am I going to get from this course?</strong></p> <ul> <li>20 lectures and 3 hours of content!</li> <li>Learn PowerPoint 2013 from a professional trainer from your own desk.</li> <li>X lectures (9.75 hours of content) teaching you slide customization, using images, slide show setup and presentation tools</li> <li>Suitable for beginner presentation designers and ideal for users who learn faster when shown.</li> <li>Visual training method, offering users increased retention and accelerated learning.</li> </ul> <p><strong>What are the requirements?</strong></p> <ul><li>Microsoft PowerPoint 2013</li> <li>Downloadable practice file</li></ul> <p><strong>What is the target audience?</strong></p><p>Anyone new to PowerPoint 2013.</p>", 
    "end_date": null, 
    "title": "PowerPoint 2013 for Beginners", 
    "price": "20.00", 
    "instructors": "Andrea Moxam", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499878_ebe4_2.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-2013-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T12:16:52Z"
}