{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><strong style=\"\">PowerPoint </strong>can and should be used for video animation, and I want YOU to complete two projects inside of this course to be confident and ready to make any animation you want on your own!</p><ul style=\"\"><li style=\"\"><strong style=\"\">Did you always want to create impressive logo reveals / video animations like the &quot;big guys&quot; do?</strong></li><li style=\"\"><strong style=\"\">Do you struggle to learn advanced animation software like After Effects?</strong></li><li style=\"\"><strong style=\"\">Do you upload videos on Your website, Youtube channel etc. and need to have it branded?</strong></li></ul><p style=\"\">I got you covered because now animations like that are possible and the only software you require and have to use is...PowerPoint. That&#039;s right! In this course I will teach you how to prepare outstanding logo reveal animations without the need to learn advanced animation software like Adobe After Effects, 3DS. Apple Motion. Everything, including placing the sound, animating the logo and export it to video will be made only with help of PowerPoint 2010/2013. </p><p style=\"\"><strong style=\"\">Some of the cool things in the course:</strong></p><ul style=\"\"><li style=\"\">We will prepare together 2 ready-to-use projects</li><li style=\"\">You will use uncommon animation techniques</li><li style=\"\">Learn how to substitute After Effects with PowerPoint</li><li style=\"\">Attract more business with unique design</li><li style=\"\">Learn and make a fun project!</li></ul><p style=\"\"><strong style=\"\">We will work on and complete 2 logo reveal projects - together!</strong></p><p style=\"\">Join me in this course if you are searching for a shortcut to surprisingly awesome Powerpoint tricks and learn effective graphic design using this wonderfull tool. YouTube, video marketing, video content it is all growing rapidly and everyone needs high quality animated material on a daily basis now </p>", 
    "end_date": null, 
    "title": "PowerPoint 2013 - Video Animation in Powerpoint", 
    "price": "20.00", 
    "instructors": "Andrzej Pach", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489318_dd1c_9.jpg", 
    "course_url": "https://www.udemy.com/logo-intro-animations-for-youtube-in-powerpoint-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-29T10:31:13Z"
}