{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Course updated 10/2015 with new lectures.</strong></p><p>Would you like to <strong>become the go to person</strong> when everything is on the line because everyone knows you can deliver?</p><p>Are you ready to take your career to the <strong>next level</strong>?</p><p>75% of those who give presentation say they would like to better at presenting, according to Forbes magazine.</p><p>Discover what a 1000+ students have learned.</p><p><span></span>Distinguish yourself from the crowd by learning to make stunning presentations. <em>Learn to create presentation that will make everyone think you have a team of designers behind you.</em><br> Take the first step in true PowerPoint mastery and get that promotion you deserve. Regular free bonus material.</p><p>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success! </p><p>You will learn:</p><p><span></span>1. Emulate high end user interfaces with PowerPoint</p><p><span></span>2. The best way to add images to shapes because most people do it wrong!</p><p><span></span>3. Master text boxes and push the limits of what you thought was possible</p><p><span></span>4. Learn how to add color casts to images to add extra pop.</p><p><span></span>5. Learn how to make icons using PowerPoint shapes</p><p><span></span>6. Use edit points to create avatars in your presentations</p><p><span></span>7. Master combining shapes for stunning results</p><p><span></span>8. Learn to combine shapes, text, and video for mind blowing results</p><p><span></span>9. Take your first steps in true PowerPoint mastery ... and much, much more!</p><p>Everyday you wait opportunities are passing you by<em>!</em></p>", 
    "end_date": null, 
    "title": "PowerPoint 2013: Learn Advanced Secrets in a Weekend", 
    "price": "20.00", 
    "instructors": "Tyus Durant", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579590_4e1d_4.jpg", 
    "course_url": "https://www.udemy.com/become-a-1000-times-better-at-powerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T23:21:02Z"
}