{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong style=\"\">  Have you wasted your time subscribing to PowerPoint Video programs that start with basics and leave you at intermediate level? </strong>We understand the importance of your valuable learning time and hence, present to you a fast-paced no non-nonsense &quot;really&quot; advanced tutorial on PowerPoint tricks.  </p>  <p>  \t<strong style=\"\">Content:  </strong>  </p>  <p>  \t<strong style=\"\">SHAPES: </strong>Almost all PowerPoint users use PowerPoint Shapes extensively for purposes such as Flowchart, Organisation Chart, Illustration, Investment Banking pitch books etc. Expand your horizon on how they can be used more effectively with the use of special tricks and shortcuts.  </p>  <p>  \t<strong style=\"\">PICTURES: </strong>Organise and Align the slide&#039;s pictures in less than 5 seconds.  </p>  <p>  \t<strong style=\"\">SMART ART &amp; CHARTS: </strong>How to break the Smart Art and Chart elements to apply button-triggered animations.  </p>  <p>  \t<strong style=\"\">SLIDE MASTER &amp; LAYOUTS: </strong>Understanding one of the trickiest areas of PowerPoint and applying the concepts for standardization of templates and in keeping consistent corporate presentation branding. Used to make templates with consistent company-logo based footers and collating different presentations in one.  </p>  <p>  \t                This is a fast-paced lean program of approx. <strong style=\"\">1.5 hrs. </strong>with distilled tricks meant ONLY for advanced users of PowerPoint. Watch the preview video to get a flavor the program&#039;s uniqueness and relevance.  </p>  <p>  \t<strong style=\"\">Recent user reviews:</strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\">&quot;This will save so much time&quot; -  </strong>I am quite a heavy user of PowerPoint but have never formally learned how to use it properly. This course has shown me how incredibly time consuming my ways of using it are - they work, but are very convoluted. The time saving for me will be enormous (not to mention reduction in frustration). Better still, I have learned something that has always bugged me - getting rid of unwanted background from images/logos. That is invaluable for me.</em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">&quot;Fast moving - Step-by-step - Great info&quot; </strong>- This is a well paced, well explained course full of useful shortcuts and information for creating professional slides and presentations.</em>  </p>", 
    "end_date": null, 
    "title": "PowerPoint Tricks for Advanced Users", 
    "price": "20.00", 
    "instructors": "Yoda Learning", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/282852_e6e5_2.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-tricks-for-advanced-users/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-18T05:12:36Z"
}