{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>Learn the most used design skills to quickly transform PowerPoint presentations into well crafted professional works of communication excellence.</p><p><strong>Build a strong foundation to save the world from death by PowerPoint with stunning creative visual approaches</strong></p><ul><li>Gain foundation understanding to dramatically improve visual communication</li><li>Improve effectiveness with visual layouts to command attention</li><li>Solve the challenges of how to create quality visual communication with PowerPoint</li><li>Create and mass produce consistent beautiful graphics for your presentations.</li><li>Discover how industry pros save time by using focused communication methods to impact audiences quickly.</li><li>Customize visual presentations to draw attention to priority content.</li><li>Become the go to person for visual communication excellence.</li></ul><p><strong>A Powerful Skill at Your Fingertips</strong></p><p>Learning fundamentals of PowerPoint design puts a powerful visual design skills at your fingertips. The design techniques are easy to learn and the demonstrations provide ways to follow along, practice with supplied files, and then create based on your original content needs. You will never look at visual layouts the same again. </p><p><strong>Content and Overview</strong></p><p>Suitable for beginning presenters, trainers, online instructors, curriculum developers, managers, speakers, marketers, and creative entrepreneurs, through this course of 78 lectures and 4 hours of content, you’ll learn the most used functions for designing great looking visual presentations with PowerPoint. Each concept is first demonstrated with follow along videos with step by step instructions. Practice sessions are provided with supplied files for your opportunity to try out the techniques. Creative opportunities are unleashed with the starter models for your own custom productions so that you can go from novice to pro in a short amount of time.</p><p><strong>What am I going to get from this course?</strong></p><ul><li>78 lectures and 4 hours of focused content for the skills that matter most!</li><li>Learn visual presentation design from a professional coach from your desk.</li><li>Suitable for beginner educators, trainers, marketers, instructional designers and ideal for people who learn faster when shown.</li><li>Visual training method offering students increased retention and accelerated learning.</li><li>Breaks even the most complex functions into simplistic steps to follow, practice, and then create for producing custom visual presentations</li><li>Custom learning is supported with an active discussion</li></ul>  <p>  \t<strong>Learn in Minutes, a Unique Approach to Fast Learning</strong>  </p>  <p>  \t                                        Make the jump to learning at light speed with the learn in minutes approach which provides edited video demonstrations for quicker contextual understanding. Quicker access to the concepts helps you learn at your own pace with supporting step by step demonstrations and practice files to apply the techniques. The <strong>interactive discussion</strong> allows for <strong>custom feedback </strong>and <strong>constructive learning</strong> support.  </p>", 
    "end_date": null, 
    "title": "PowerPoint University: Learn to Design Like a SuperHero", 
    "price": "20.00", 
    "instructors": "John O'Laughlin", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364544_4e24_20.jpg", 
    "course_url": "https://www.udemy.com/learn-in-minutes-top-10-powerpoint-design-secrets-revealed/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-06T11:19:18Z"
}