{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Do you hesitate to use technology in your classroom, because you don&#039;t understand how to use it? Or worse; you don&#039;t want to look like a fool in front of your students, because you think that they know more than you do about technology? Then <em>PowerPoint for Teachers </em>is the course for you! This introductory PowerPoint course was created for teachers that feel challenged by educational technology, yet want to learn how to use it in their teaching practice so that they can engage their students.</p>    <p> Through a series of video tutorials and exercises, you will learn how to use PowerPoint in your teaching practice. Your students will be&nbsp; amazed with your Ed Tech skills after you have completed this course.</p>    <p><em>PowerPoint for Teachers</em> teaches you:</p>    <ul>  \t<li>how to create, add, and delete PowerPoint slides</li>  \t<li>how to manipulate images in PowerPoint</li>  \t<li>how to insert video and audio clips into your PowerPoint presentations</li>  \t<li>tips and tricks to help you teach your students how to create engaging presentations</li>  </ul>  <p><em><strong>You will also receive:</strong></em></p>    <ul>  \t<li>Classroom-ready PowerPoint presentations that you can use to teach your students PowerPoint concepts</li>  \t<li>Lesson &amp; Project&nbsp; ideas that you can implement in your classroom</li>  </ul><br>    <p>This course lets you control how and when you learn PowerPoint and its potential uses in your classroom.</p>    <p>Imagine learning PowerPoint on your own terms...</p>    <ul>  \t<li>Imagine learning how to use ed tech applications in the comfort of your own home. Picture yourself in your jammies, sitting on your couch with your laptop and a cup of coffee learning how to use PowerPoint.</li>  \t<li>Imagine sitting on your patio, the sun is shining on your face, and you’re learning how you can use ed tech in your classroom.</li>  \t<li>Imagine being able&nbsp; to review a course video as often as you need to until you grasp a particular concept (PowerPoint concepts are fairly easy to grasp, but if you don&#039;t fully understand you have the option of rewinding the course video).<br>  </li>  \t<li>Imagine being able to answer a student&#039;s question about a PowerPoint concept that he/she doesn&#039;t understand - you simply log on to this course from your classroom and find the answer for the student. Imagine that!<strong><em>&nbsp; <br>  </em></strong></li>  </ul><strong><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; </em></strong><strong><em>Stop imagining and register for PowerPoint for Teachers.</em></strong><br>  <br>  <br>  ", 
    "end_date": null, 
    "title": "PowerPoint for Teachers", 
    "price": "30.00", 
    "instructors": "Steve Gillis", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/19285_a8a3_14.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-for-teachers/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-09T13:30:38Z"
}