{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>ENROLL NOW!!!</strong></p><p><strong></strong><strong>This course will not waste your time, Are you tired of watching tutorials that take hours to explain simple concepts? You came to right place. All this course asks you is 2-3 hours of your life.</strong></p><p>This is the class I wish I had when I was trying to learn Powerpoint. I have a unique way of teaching, as I know how it must be overwhelming to learn a very complex software  like Powerpoint. Best part of this course is you need no prior experience with Powerpoint.</p><p>I will walk you through everything you need to make professional Powerpoint Presentations. From Creating slides to complex animations and transitions.</p><p>You will learn by making a powerpoint presentation. This course will make you an expert at using all the Powerpoint Features.</p><p>We will learn my making a real world presentation, so that you'll have a better understanding when to use specific features.</p><p>Starting with the basics, you’ll discover how to work with the  new PowerPoint 2013 interface and to design your your slides to look the best. Then, you’ll learn to add images,  audio, and video for engaging slides. Then you'll learn to create amazing advance animation effects that will blow the mind of your students. You'll also learn the skills needed to grab the attention of the audience.<br></p><p>Beyond that you get access to plenty of tips and tricks that experts use which are only known to a few.</p><p>Who is this class for?</p><p>i.) People who want to make excellent Powerpoint presentations.  </p><p>ii.) Beginners. You don't need any previous experience to take this class. I have been the absolute beginner before and I am more than happy to help you.</p><p>iii.) Those who want to learn Powerpoint fast (0 Waste of Time).</p><p>iv.) For Business men looking to impress their clients with Mind Blowing Presentations.</p><p><br></p><p>What are you waiting for?? Enroll now and let's get started.</p>", 
    "end_date": null, 
    "title": "Powerpoint in 2 Hours: PowerPoint Training for Beginners", 
    "price": "20.00", 
    "instructors": "Ajay R Warrier", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594306_4d2c_2.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-master-in-2-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T19:33:43Z"
}