{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<span>This course is for the benefit of everyone. If financial constraints prevent you from enrolling, send me a message and I will give you access to all of my courses for free.</span>  </p>  <p>  \tThis training provides you everything you need to know about Microsoft PowerPoint. From the fundamentals, to the most advanced features, after taking this online class you will be able to use Microsoft <span>PowerPoint</span><span> at an expert level.</span>  </p>  <p>  \tYou can learn Microsoft <span>PowerPoint</span><span> easily and quickly if it is taught correctly. Developed by a Microsoft Certified Master Instructor, this course covers the most recent version of Microsoft </span><span>PowerPoint</span><span> for the Mac - Microsoft </span><span>PowerPoint</span><span> 2011. As tenured college faculty in computer information technology, and with over fifteen years of experience teaching individuals of all ability levels &quot;how to use&quot; Microsoft </span><span>PowerPoint</span><span>, Todd McLeod has designed, refined, and perfected a method for understanding </span><span>PowerPoint</span><span> which will allow you to learn what you need to know about Microsoft </span><span>PowerPoint</span><span> as quickly and efficiently as possible.</span>  </p>  <p>  \tBy watching high-quality videos, you will learn all of the following about Microsoft <span>PowerPoint</span><span>:</span>  </p>  <ul style=\"\">  \t<li>Learn how to create presentations</li>  \t<li>Learn how to format presentations</li>  \t<li>Learn the secrets of giving a great presenation</li>  \t<li>Learn the difference between content and form</li>  \t<li>Learn how to create transitions between slides</li>  \t<li>Learn how to make your presentation automatically run forever in a loop</li>  \t<li>Learn how to print your slides for your audience</li>  \t<li>Learn how to add notes to your slides</li>  \t<li>Learn how to use templates to quickly create stunning presentations</li>  \t<li>As a bonus, you can download all of the project files used in the videos so that you can get a “hands-on” approach to learning the material</li>  </ul>  <p>  \tThis class is guaranteed to teach you Microsoft <span>PowerPoint</span><span>. Once enrolled, you will have access to this </span><span>PowerPoint</span><span> course for the rest of your life. You will always be able to come back to this </span><span>PowerPoint</span><span> class to review material or to learn new material about how to use </span><span>PowerPoint</span><span>. Described as “fun” and “amazing” and “life changing,” Todd McLeod’s </span><span>PowerPoint</span><span> </span><span>training will forever transform the way you work with Microsoft </span><span>PowerPoint</span><span>. Try this course and see for yourself how quickly and easily you can learn Microsoft </span><span>PowerPoint</span><span>.</span>  </p>", 
    "end_date": null, 
    "title": "PowerPoint for Mac - From Beginner to Expert in 4 Hours", 
    "price": "20.00", 
    "instructors": "Todd McLeod", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/376498_3896.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-23T19:47:22Z"
}