{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course covers Tips &amp; Tricks on Microsoft PowerPoint 2010. It assumes you have used PowerPoint and are familiar with creating, editing &amp; formatting presentations. In a quick and lively manner this will cover what is new in this version of PowerPoint and also show you some tips to increase your productivity in PowerPoint and widen your skills.</p><p>The course begins with a look at how you can use slide masters and custom layouts for customized presentations. The use of PowerPoint templates and Office Themes for a unified look and feel across PowerPoint, Word and Excel is discussed. Slide Sections are detailed for organizing long presentations. Several examples of creating and editing SmartArt for beautiful diagrams are seen. Inserting &amp; editing videos is easy in PowerPoint and is demonstrated including trimming and compressing the video and saving the entire presentation as a video. The mysteries of adding and customizing animations is covered as well as presenter tips like hiding a slide and other tips to control your show. Throughout the course the videos are quick, lively and clearly explained. If you don't have all day to spend on a course this will cover the highlights of what's new and a bit more in less than an hour.</p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong><strong></strong>  <strong></strong></p><p>Microsoft PowerPoint is the dominant and most widely used presentation creation software in the world. Take your presentations to the next level by learning these very cool and nifty tips and tricks. <strong>If you want to impress your boss or client, create professional presentations, make a lasting impression, and be recognized for the quality of your work, this course is for you!</strong></p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p><p>We are so confident that you will get<strong> tremendous value</strong> from this course. <strong>Take it for the full 30 days and see how your work life changes for the better.</strong> <strong>If you're not 100% satisfied</strong>, we will gladly refund<strong> the full purchase amount!</strong></p><p>Take action now to take yourself to the next level of professional development. Click on the <strong>TAKE THIS COURSE </strong>button, located on the top right corner of the page, NOW…<strong><em>every moment you delay you are delaying that next step up in your career…</em></strong></p>", 
    "end_date": null, 
    "title": "Practical PowerPoint 2010 Tips & Tricks", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532214_3ef1_2.jpg", 
    "course_url": "https://www.udemy.com/practical-powerpoint-2010-tips-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T14:48:44Z"
}