{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course covers Tips &amp; Tricks on Microsoft Excel 2010. It assumes you have used Excel and are familiar with creating, editing &amp; formatting worksheets.  In a quick and lively manner this will cover what is new in this version of Excel and also show you some tips to increase your productivity in Excel and widen your skills.  These tips also apply to Excel 2013 so videos 1,2,4,8 &amp; 11 would be good background for Excel 2013 users.</p>The course begins with a review of some basics of cell selection, copy, paste and formatting.  Use of the format painter is shown in detail.  A review of formula entry and the difference between absolute and relative formulas is covered.  How to deal with errors and audit a worksheet is demonstrated.  Intro to tables is next with examples of sorting &amp; multilevel filtering. A Pivot Table is built from scratch in a simple and easy to understand manner and then it is filtered using data slicers and charted with Sparkline charts.  The basics of creating &amp; editing a chart, plotting trend lines, and other fancy chart formatting are demonstrated.  The powerful analysis of conditional formatting is introduced and custom settings reviewed.  Finally some basics on printing and spreadsheet layout are covered.  Throughout the course the videos are quick, lively and clearly explained.  If you don't have all day to spend on a course this will cover the highlights of what's new, a few basics and a little bit more in under an hour.<p><strong></strong></p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong><strong></strong>  </p><p><strong>Over 90% of businesses today and 100% of colleges use Excel.</strong> If you do not know Excel you will be at a distinct disadvantage. Whether you're a teacher, student, small business owner, scientist, homemaker, or big data analyst you will need to know Excel to <strong>meet the bare minimum requirements of being a knowledge worker in today's economy</strong>. But you should also learn Excel because it will simplify your work and personal life and save you tons of time which you can use towards other activities. After you learn the ropes, Excel actually is a fun application to use. </p><p>Amplify your spreadsheet skills by learning a series of really neat tips and tricks that you can immediately apply at your workplace or school or home.</p><p><strong>If you want to learn Excel quickly, land that job, do well in school, further your professional development</strong>, <strong>save tons of hours every year</strong>, and learn neat <strong>Excel tricks</strong> in the quickest and simplest manner then <strong>this course is for you! </strong></p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p><p>We are so confident that you will get<strong> tremendous value</strong> from this course. <strong>Take it for the full 30 days and see how your work life changes for the better.</strong> <strong>If you're not 100% satisfied</strong>, we will gladly refund<strong> the full purchase amount!</strong></p><p>Take action now to take yourself to the next level of professional development. Click on the <strong>TAKE THIS COURSE </strong>button, located on the top right corner of the page, NOW…<strong><em>every moment you delay you are delaying that next step up in your career…</em></strong></p>", 
    "end_date": null, 
    "title": "Practical Excel 2010 Tips & Tricks", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532194_173e_2.jpg", 
    "course_url": "https://www.udemy.com/practical-excel-2010-tips-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T14:35:43Z"
}