{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course provides an in-depth coverage of pivot tables and pivot charts in Excel 2010. These are two of the most powerful, if not <em>the </em>most powerful, data analysis tools in Excel's arsenal, and they should definitely be mastered by anyone who aspires to becoming an Excel “power user.\" As this course will illustrate with many examples, the tools are surprisingly easy to learn and use—once you know they exist. To learn Excel Pivot Tables &amp; Pivot Charts quickly and effectively, download the companion exercise files so you can follow along with the instructor by performing the same actions he is showing you on the videos. </p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p><strong>***** CLEAR AND CRISP VIDEO RESOLUTION *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong><strong></strong>  </p><p><em>“The Optima Train two part series on Pivot Tables is pure gold! The material is so amazingly thorough and clear that anyone watching the videos and doing the exercises provided will without a doubt become a true expert at working with Pivot Tables and likely become a hero at work by applying and sharing this new-found knowledge. There is nothing like it on the market.\" - Phil, FORMER TREASURY OPERATIONS MANAGER - EXXONMOBIL</em></p><p><em>“When I first looked up this site I was a bit skeptical, but I soon realized how amazing these courses are. They have helped me excel in all my business classes. The PowerPivot course now makes business analytics easy and at my fingertips.\" - Wilson Xu, STUDENT</em></p><p>90% of Excel users do not use Pivot Tables but those that do save hours of time and become valuable assets in their companies. The hours of time you'll save translates to real money in your pocket of earning potential! Imagine the power you will have as a knowledge worker in your company that people go to when they need help. Upper management will notice your sharp analysis and will not be able to do without you. Pivot Tables has been called the best thing since sliced bread. Once you start using it you'll never stop. <strong>Pivot Tables and Pivot Charts</strong> are not difficult to learn and it's bewildering that not many people use it – you can take advantage of that short supply of power users in the workforce by becoming a power user yourself and an indispensable resource to your work place. Simplify your work and personal life by learning this extremely useful tool.</p><p>This is the most comprehensive Excel Pivot Tables &amp; Pivot Charts course and has <strong>43</strong><strong><strong> </strong>short video tutorials</strong>. The follow-on course of PowerPivot &amp; Advanced Business Intelligence Tools builds on where this course ends. <strong>There is zero fluff and no time wasted in this course</strong>. The instructor, Dr. Chris, has decades of experience using Excel in real-world settings solving complex business problems. There is no quicker way to learn Excel than to watch these videos and follow along with the free companion <strong>exercise workbooks</strong> <strong>which are downloadable</strong>.   <strong>If you want to stand out among your colleagues, earn a promotion, further your professional development</strong>, <strong>save tons of hours every year</strong>, and learn <strong>Excel Pivot Tables &amp; Pivot Charts</strong> in the quickest and simplest manner then <strong>this course is for you! </strong></p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p>", 
    "end_date": null, 
    "title": "Practical Excel 2010 Pivot Tables and Pivot Charts ", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531342_2d2c_2.jpg", 
    "course_url": "https://www.udemy.com/practical-excel-2010-pivot-tables-and-pivot-charts/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T15:08:14Z"
}