{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course covers Tips &amp; Tricks on Microsoft Outlook 2010. It assumes you have used Outlook and are familiar with email and calendars. In a quick and lively manner this will cover what is new in this version of Outlook and also show you some tips to increase your productivity in Outlook and widen your skills.</p><p>The course begins with a look at using Instant Search to find specific items in your inbox and throughout Outlook. Color Categories are detailed for searches and applying to emails, appointments, contacts and tasks. Keep on top of previously forgotten items with flagging emails for easy follow-up and integration in the To-Do list. Several Calendar views are demonstrated including how to open multiple calendars and view them side by side or as an overlay for a comprehensive view of you or your team's appointments. How to make and change an appointment including recurring appointments is detailed. Different views of the Inbox for read and unread items as well as sorting and grouping by sender, date etc. are demonstrated. There are several ways to view attachments in emails including previews and these are detailed. Unraveling long threaded conversations is demonstrated with some innovative new features like grouping by conversation and ignoring email threads. Using Quick Steps to save time on repetitive Outlook tasks is covered including creating a custom Quick Step. The power of email Rules is revealed and examples are given to save you time every day. See how Contacts can be created and shared with ease. Throughout the course the videos are quick, lively and clearly explained. If you don't have hours to spend on a course this will cover the highlights of what's new in Outlook 2010 and a little bit more in a little more than an hour. This is great review even for experienced Outlook users.</p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong><strong></strong>  </p><p>Almost everybody uses Outlook at work today. But the inboxes keep getting cluttered and it leads to a lot of stress and time management issues. </p><p><strong>If you want to easily and quickly learn how to organize your e-mail better and work far more efficiently using various neat Outlook features</strong>, then this Outlook Tips &amp; Tricks course is the <strong>just right for you! </strong></p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p><p>We are so confident that you will get<strong> tremendous value</strong> from this course. <strong>Take it for the full 30 days and see how your work life changes for the better.</strong> <strong>If you're not 100% satisfied</strong>, we will gladly refund<strong> the full purchase amount!</strong></p><p>Take action now to take yourself to the next level of professional development. Click on the <strong>TAKE THIS COURSE </strong>button, located on the top right corner of the page, NOW…<strong><em>every moment you delay you are delaying that next step up in your career…</em></strong></p>", 
    "end_date": null, 
    "title": "Practical Outlook 2010 Tips & Tricks", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532232_4755_2.jpg", 
    "course_url": "https://www.udemy.com/practical-outlook-2010-tips-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T15:02:28Z"
}