{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course is a deep dive into everything a brand-new user to Microsoft SharePoint 2013 would need to know to get up and running quickly. It introduces the concepts and practical features that someone new to SharePoint needs to know. It shows use scenarios of a typical knowledge worker and does not require or cover administration or programming skills in SharePoint. In a quick and lively manner this will cover the main uses of SharePoint for a new user. This course is also a good review of the end user perspective for SharePoint administrators.</p><p>The course begins with a definition of SharePoint and some basic navigation techniques. It then builds on the concept of Team Sites with a Document Library and its many uses. Document storage and use is covered including checking out a document and versioning. The basics of Team Site creation and customizing are reviewed all from a non-developer skill set. Basics of Alerts are covered and how to use a list including importing and exporting Lists to Excel. Tasks and custom views are demonstrated with a special project view of a timeline. The concept of Workflow is introduced and a basic example shown with a document being routed through multiple users. The powerful Calendar function is addressed and demonstrated. Finally the social aspects of SharePoint are covered including Profiles, Newsfeeds, Discussions and Blogging. A community site is also shown. If you are new to SharePoint this is an excellent introduction that does not get too technical or deep in the weeds. Throughout the course the videos are quick, lively and clearly explained. If you want a good grasp on what SharePoint is and what it can do for you this course will show you in just under 2.5 hours.</p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong><strong></strong>  </p><p>If you are sending e-mails with attachments as a means of collaborating with your work mates then you will want to take a serious look at SharePoint. It is the most popular business web application platform.</p><p>Learn how to use <em>SharePoint</em> in your organization to create websites and use it as a secure place to store, organize, share, and access information from almost any device. Take collaboration to the next level.</p><p> <strong>If you want to stand out among your colleagues, earn a promotion, further your professional development</strong>, reduce<strong> frustrating e-mail chains with attachments</strong>, and help your team become more productive then <strong>this course is for you! </strong></p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p><p>We are so confident that you will get<strong> tremendous value</strong> from this course. <strong>Take it for the full 30 days and see how your work life changes for the better.</strong> <strong>If you're not 100% satisfied</strong>, we will gladly refund<strong> the full purchase amount!</strong></p><p>Take action now to take yourself to the next level of professional development. Click on the <strong>TAKE THIS COURSE </strong>button, located on the top right corner of the page, NOW…<strong><em>every moment you delay you are delaying that next step up in your career…</em></strong></p>", 
    "end_date": null, 
    "title": "Practical SharePoint 2013 Deep Dive into the Essentials", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532360_6d28_3.jpg", 
    "course_url": "https://www.udemy.com/practical-sharepoint-2013-deep-dive-into-the-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T17:25:22Z"
}