{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course covers Tips &amp; Tricks on Microsoft Word 2013. It assumes you have used Word and are familiar with creating, editing &amp; formatting documents. In a quick and lively manner this will cover what is new in this version of Word and also show you some tips to increase your productivity in Word and widen your skills.</p><p>The course begins a review of online account options followed by interface changes in the ribbon and the use of touch screens. Basics of proofing and navigation are covered on a document that is then redesigned with the new Design Tab and saved &amp; read as a PDF document. Collaboration features for shared comments and comparing documents are covered and then removing personal information before sharing a document with the Document Inspector. Many basic editing tips are covered in a couple of quick sections followed by using Quick Parts and drawing tables. Finally you see several examples of how to share documents online and through social media sites. Throughout the course the videos are quick, lively and clearly explained. If you don't have 4 hours to spend on a course this will cover the highlights of what's new and a little bit more in about 90 minutes.</p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong><strong></strong><strong></strong></p><p>Microsoft Word is the dominant and most widely used word processor in the world. Yet many people get caught up in frustrating situations within Word where what should be a seemingly simple task turns into 20 minutes of exasperating head scratching. Eliminate those time wasters from your life and become highly productive by learning these very nifty tips and tricks.</p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p><p>We are so confident that you will get<strong> tremendous value</strong> from this course. <strong>Take it for the full 30 days and see how your work life changes for the better.</strong> <strong>If you're not 100% satisfied</strong>, we will gladly refund<strong> the full purchase amount!</strong></p><p>Take action now to take yourself to the next level of professional development. Click on the <strong>TAKE THIS COURSE </strong>button, located on the top right corner of the page, NOW…<strong><em>every moment you delay you are delaying that next step up in your career…</em></strong></p>", 
    "end_date": null, 
    "title": "Practical Word 2013 Tips & Tricks", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532318_88eb_2.jpg", 
    "course_url": "https://www.udemy.com/practical-word-2013-tips-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T16:32:08Z"
}