{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course covers Tips &amp; Tricks on Microsoft Word 2010. It assumes you have used Word and are familiar with creating, editing &amp; formatting documents. In a quick and lively manner this will cover what is new in this version of Word and also show you some tips to increase your productivity in Word and widen your skills. These tips also work in Word 2013 so this is a good background course for Word 2013 users as well.</p><p>The course begins a review of the basics of formatting text and paragraphs. Fundamentals of copying &amp; pasting are also covered including the new Paste Preview. These are good for any Word user regardless of skill level. Navigating an outline and long documents with the new Navigation Pane is shown in detail. Formatting using styles is demonstrated. Examples of building, formatting and saving a table for later use are shown. A good look at tools for graphics and picture editing in Word is covered. Reuse common document elements with Quick Parts and master mail merge and designing mailing labels in the next clips. For teams working on a document examples of tracking changes, comparing documents and inspecting a document for release are valuable to see. Finally the course concludes with a review of how easy it is to create and work with headers and footers in Word 2010. Throughout the course the videos are quick, lively and clearly explained. If you don't have 4 hours to spend on a course this will cover the highlights of what's new and some good Word fundamentals in about 70 minutes.</p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong><strong></strong>  <strong></strong></p><p>Microsoft Word is the dominant and most widely used word processor in the world. Yet many people get caught up in frustrating situations within Word where what should be a seemingly simple task turns into 20 minutes of exasperating head scratching. Eliminate those time wasters from your life and become highly productive by learning these very nifty tips and tricks.</p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p><p>We are so confident that you will get<strong> tremendous value</strong> from this course. <strong>Take it for the full 30 days and see how your work life changes for the better.</strong> <strong>If you're not 100% satisfied</strong>, we will gladly refund<strong> the full purchase amount!</strong></p><p>Take action now to take yourself to the next level of professional development. Click on the <strong>TAKE THIS COURSE </strong>button, located on the top right corner of the page, NOW…<strong><em>every moment you delay you are delaying that next step up in your career…</em></strong></p>", 
    "end_date": null, 
    "title": "Practical Word 2010 Tips & Tricks", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532160_b04d_2.jpg", 
    "course_url": "https://www.udemy.com/practical-word-2010-tips-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T13:48:07Z"
}