{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course covers Tips &amp; Tricks on Microsoft Outlook 2013. It assumes you have used Outlook and are familiar with email and calendars. In a quick and lively manner this will cover what is new in this version of Outlook and also show you some tips to increase your productivity in Outlook and widen your skills.</p><p>The course begins a with a review of some interface changes and using Quick Peek to glance at a Calendar or Task list without actually opening it. There are several new little features covered that save time in the inbox including filtering for unread messages, replying directly in the reading pane, and new ways to quickly delete emails. Searching is covered with details on where to search and refining searches for items. How to categorize and flag emails and other items is shown. Unraveling long threaded conversations is shown with some innovative new features. A look at Calendar enhancements follows with the Weather Bar and how to view and open other's calendars including side by side views and overlaying of calendars for a comprehensive view of your team appointments. New changes to contacts are covered and how the People Cards work as well as the People Pane for tracking activities of recipients directly in a message. The Out Of Office option has moved and is reviewed in an example. Finally a look at Quick Steps to save time on repetitive Outlook tasks is covered including creating a custom Quick Step. Throughout the course the videos are quick, lively and clearly explained. If you don't have hours to spend on a course this will cover the highlights of what's new in Outlook 2013 and a little bit more in under an hour.</p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong><strong></strong>  </p><p>Almost everybody uses Outlook at work today. But the inboxes keep getting cluttered and it leads to a lot of stress and time management issues. </p><p><strong>If you want to easily and quickly learn how to organize your e-mail better and work far more efficiently using various neat Outlook features</strong>, then this Outlook Tips &amp; Tricks course is the <strong>just right for you! </strong></p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p><p>We are so confident that you will get<strong> tremendous value</strong> from this course. <strong>Take it for the full 30 days and see how your work life changes for the better.</strong> <strong>If you're not 100% satisfied</strong>, we will gladly refund<strong> the full purchase amount!</strong></p><p>Take action now to take yourself to the next level of professional development. Click on the <strong>TAKE THIS COURSE </strong>button, located on the top right corner of the page, NOW…<strong><em>every moment you delay you are delaying that next step up in your career…</em></strong></p>", 
    "end_date": null, 
    "title": "Practical Outlook 2013 Tips & Tricks", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532440_fc64_2.jpg", 
    "course_url": "https://www.udemy.com/practical-outlook-2013-tips-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T19:21:40Z"
}