{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course covers all you need to know to use Microsoft Lync 2010 effectively. It introduces the concepts and practical features that someone new to Lync needs to know. In a quick and lively manner this will cover the main uses of Lync for a new user.</p><p>The course begins with a definition of Lync and some basic navigation techniques. It gives a tour of the user interface. Status or Presence is a key aspect of Lync and the ways it is set and displayed are covered. How to manage and organize contacts is explained with examples. Basic messaging is shown with multiple conversations managed at once. How to do a voice call is shown including group or conference calls. Video calls are demonstrated including conference videos. Meeting integration is strong in Lync with Outlook meetings and this is shown including creating and starting a Lync meeting. Sharing a Desktop and sharing other content in Lync is shown in some detail. Finally how to record a meeting in Lync is explained and shown with publishing options. Throughout the course the videos are quick, lively and clearly explained. If you want a good grasp on what Lync is and what it can do for you this course will show you in just over half an hour.</p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong></p>", 
    "end_date": null, 
    "title": "Practical Lync 2010: Everything You Need to Know", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532310_8f53_3.jpg", 
    "course_url": "https://www.udemy.com/practical-lync-2010-everything-you-need-to-know/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T16:22:09Z"
}