{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This introductory course covers the fundamentals of Microsoft Excel 2010. It assumes you have used Excel, at least at an elementary level, such as opening and saving an Excel file. This course will drastically increase your productivity and broaden your Excel skills.</p><p>The course begins with the Excel user interface: the tabs and ribbons, the backstage view, and the Quick Access Toolbar. It then teaches you methods for performing common Excel tasks, such as moving around large worksheets, selecting ranges, copying and pasting, working with formulas, creating and modifying charts, and printing. It also teaches you best spreadsheet practices for making your spreadsheets attractive and understandable by others. Throughout, the focus is not just on performing common tasks in Excel, but performing them efficiently. To learn Excel quickly and effectively, download the companion exercise files so you can follow along with the instructor by performing the same actions he is showing you on the videos.</p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p><strong>***** CLEAR AND CRISP VIDEO RESOLUTION *****</strong></p><p>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong>  </p><p><em>“As an Accountant, learning the Microsoft Office Suite really helps me out. All of the accounting firms out there, whether Big 4 or mid-market, want their employees to be well-versed in Excel. By taking these courses, I become a stronger candidate for hire for these companies.\" - Robert, <em>ACCOUNTANT</em></em></p><p>There are two questions you need to ask yourself before learning Excel. 1. Why should you learn Excel in the first place? 2. What is the best way to learn?</p><p>The answer for the first question is simple. <strong>Over 90% of businesses today and 100% of colleges use Excel.</strong> If you do not know Excel you will be at a distinct disadvantage. Whether you're a teacher, student, small business owner, scientist, homemaker, or big data analyst you will need to know Excel to <strong>meet the bare minimum requirements of being a knowledge worker in today's economy</strong>. But you should also learn Excel because it will simplify your work and personal life and save you tons of time which you can use towards other activities. After you learn the ropes, Excel actually is a fun application to use. </p><p>The answer to the second question is you learn by doing. Simple as that. Learn only that which you need to know to very quickly get up the learning curve and performing at work or school. Our course is designed to help you do just that. There is no fluff content and the course is packed with bite-sized videos and <strong>downloadable course files (Excel workbooks)</strong> in which you'll follow along with the instructor (learn by doing).</p><p><strong>If you want to learn Excel quickly, land that job, do well in school, further your professional development</strong>, <strong>save tons of hours every year</strong>, and learn <strong>Excel</strong> in the quickest and simplest manner then <strong>this course is for you! </strong></p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p><p>We are so confident that you will get<strong> tremendous value</strong> from this course. <strong>Take it for the full 30 days and see how your work life changes for the better.</strong> <strong>If you're not 100% satisfied</strong>, we will gladly refund<strong> the full purchase amount!</strong></p><p>Take action now to take yourself to the next level of professional development. Click on the <strong>TAKE THIS COURSE </strong>button, located on the top right corner of the page, NOW…<strong><em>every moment you delay you are delaying that next step up in your career…</em></strong></p>", 
    "end_date": null, 
    "title": "Practical Excel 2010 Beginners - for the Workplace", 
    "price": "20.00", 
    "instructors": "Optima Train", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531288_fd59_4.jpg", 
    "course_url": "https://www.udemy.com/practical-excel-2010-for-the-workplace-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T13:57:25Z"
}