{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>When you are finished with your Excel dashboard, or reporting, you need to print it out to present the materials to an audience. The audience might be your boss or a group of people. So you need to learn how to print an Excel worksheet very well. In this “Print and Present your Excel worksheet in Professional ways” crash course, you will learn how to setup and print an Excel worksheet for the best print.<br></p>  <p>Let’s discuss now what you will learn from this course.<br></p>  <ol><li>Three Views of Your Worksheet: At first you will learn how to view your Excel worksheet in three ways: Normal View, Page layout view and Page Break Preview.</li><li>Page Setup Settings: Then you will work with how to setup your page.</li><li>Then how to use Header and Footer effectively.</li><li>How to use water mark to your printing</li><li>Then you will work with Custom Views</li><li>Then you will learn how to run the Spell Checker to check out your spelling in the worksheet.</li><li>Here is not the end of the course. Time to time, I shall add more lectures to the course that will teach you how to get the best print from your worksheet.</li></ol>              So, if you are interested to learn how to take a better print of your worksheets, then this course is for you. Thanks for reading. Enjoy the course!", 
    "end_date": null, 
    "title": "Print and Present Your Excel Worksheets in Professional Ways", 
    "price": "20.00", 
    "instructors": "Excel Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690958_289e_3.jpg", 
    "course_url": "https://www.udemy.com/print-excel-worksheets-in-professional-ways/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T11:28:20Z"
}