{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \tDo you wish you could produce reports that looked really professional? Do you wish you knew how to add something extra to your documents to make them stand out? Do you wish you knew how to effectively use Word to collaborate with others? If so this is the right course for you!  </p>  <p>Instead of walking through all of the features of Microsoft Word as an application, this course focuses on the end result and shows you how to accomplish typical business scenarios by effectively using Word 2013.  </p>  <p>  \t<br>  \t<strong>In this course you will learn how to effectively create professional documents</strong>  </p>  <p>  \t• Articles with attractive layouts<br>  \t• Proposals with winning cover pages and rich content<br>  \t• Professional reports with proper references<br>  \t• Letterhead templates with captivating headers and footers<br>  \t• Blog posts with enriched language  \t</p><p>  \t\t<strong>In this course you will learn how to use the latest technologies available to boost productivity</strong>  \t\t</p><p>  \t\t\t• Collaborate on documents in real-time in Word 2013 using OneDrive/SharePoint/Lync<br>  \t\t\t• Edit documents from anywhere using Word Online or Word for iPad<br>  \t\t\t• Edit PDF documents using Word 2013  \t\t\t</p><p>  \t\t\t\t<strong>Course overview</strong><br>  \t\t\t\tThe course is structured into 5 sections with a total of 13 lectures. Each lecture is taught by Productivity Expert and ex-Microsoft employee, Ulrika Hedlund who shares her extensive knowledge in how to get the most out of Word 2013. Each lecture contains high-quality, High-Definition tutorial videos showing step by step how to accomplish the covered scenario. Sample documents are provided where necessary to enable you to follow along and perform the steps covered in the lecture as well as downloadable User Guides (transcripts with screenshots) of everything covered in the lectures so that you can refer to the video at any time after the course. </p><p><strong>Do yourself a favor and learn how to effectively use Word<br></strong>  \t\t\t\tBeing able to produce high-quality documents is a key skill for a business professional. Do yourself a favor and learn how to use Word effectively today. By knowing how to effectively use Word you will save time by automating a lot of things you would otherwise do manually and by knowing how to create professional documents you will surely become more successful in your role.</p>  \t\t\t<p>  \t\t\t\t<strong>Course details</strong><br>  \t\t\t\tIn the first lecture “Add structure to your documents” you will learn how to create a professional document by using a number of built-in capabilities in Word that can help you add structure to your document. By adding styles you can more easily navigate your document and move things around. In this lecture you’ll learn how to edit PDF documents using Word 2013 which is a very useful feature. <br>  \t\t\t\tIn the lecture called “Enrich your writing” you’ll learn how to enhance your writing using synonyms, how to look up more background information about a topic directly from within your document and how to use the translation tool to translate text into another language. This will save you a lot of time and limit outside distractions.<br>  \t\t\t\tIn the lecture called “Create a professional letterhead template” you will find useful tips on how to create a clean and professional letterhead template which you can use in your correspondence with colleagues and external business partners. <br>  \t\t\t\tYou will also learn how to compose a professional looking report by inserting table of contents in your report, adding page numbers and how to use proper references to your sources.<br>  \t\t\t\tCreating a winning proposal takes time and effort. In the lecture “Write a winning proposal” you will learn how to write a winning proposal with an attractive cover page and live videos. You will also learn some practical tips on how to work with tables, how to inspect your document with “Document Inspector” to make sure it doesn’t contain any hidden data. <br>  \t\t\t\tFinally you will learn how to create an attractive looking article using a number of tools in Word 2013.  You’ll learn how to format text into multiple columns, how to insert and edit images and how to make your article stand out using drop caps and callouts.<br>  \t\t\t\tIn the 9th and 10th lecture you will learn how to personalize letters and email using a capability in Word called Mail Merge. This capability has been in Microsoft Word for many years, it’s powerful, but also quite tricky. You will learn how to personalize letters and emails by using the recipient’s name, how to insert data fields such as date and location and finally you will learn how to use more advanced “if-statements” to fine-tune the contents of your written communication. <br>  \t\t\t\tIf you know how to use these tools well you will be able to save a lot of time when communicating with customers.<br>  \t\t\t\tWhen you’re working on a document it's very beneficial to ask others to review it for you and to track changes they make to the document. In Word 2013 Microsoft has introduced a cleaner, simpler view of tracked changes and a richer experience for adding and responding to comments. In the lecture “Review a document using tracked changes” you will see step by step how different people review a document and how you as the document author can choose to accept or reject the proposed changes.<br>  \t\t\t\tIn the lecture “Co-author a document from anywhere” you will learn how you can be much more efficient using Word 2013 in your collaboration by co-authoring documents in real-time. You can also access your documents from anywhere and edit them from any device using the Web App, Word Online and Word for iPad.  \t\t\t</p>  \t\t\t", 
    "end_date": null, 
    "title": "Professional documents using Word 2013 ", 
    "price": "20.00", 
    "instructors": "Business  Productivity", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333894_bce0_3.jpg", 
    "course_url": "https://www.udemy.com/word2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-02T06:07:30Z"
}