{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t    Microsoft Project helps project managers in plan development, budget control, resources allocation, tracking progress, and reviewing workloads. This is applicable multiple sectors from IT, manufacturing, construction, to healthcare projects. You might think that simple Excel might solve the density for you but you it will impede your progress for complex projects and <strong style=\"\">Microsoft Project 2013 come really handy</strong> in that case.  </p>  <p>  \t    This course includes <strong style=\"\">skill-building in each of the basic functions of Microsoft Project 2013</strong> such as setting up project files, creating tasks, linking and timing tasks, creating resources, assigning tasks, reporting project information, etc. The training course provides an understanding and practice of Project management concepts applicable in real world.  </p>  <p>  \t    This course will cover following topics:  </p>  <ul style=\"\">  \t<p>  \t\t    ·Plan and manage project <u style=\"\">schedules,</u> <u style=\"\">milestones</u> and <u style=\"\">resources  </u>  \t</p>  \t<p>  \t\t    ·Optimize plans and <u style=\"\">organize</u> calendars  \t</p>  \t<p>  \t\t    ·Setting <u style=\"\">baselines</u>, tracking progress and variances (target vs. actual)  \t</p>  \t<p>  \t\t    ·Constructing and changing dependencies  \t</p>  \t<p>  \t\t    ·<u style=\"\">Assign resources</u> to tasks and troubleshoot over-allocation conflicts  \t</p>  \t<p>  \t\t    ·<u style=\"\">Create reports and dashboards </u>to effectively share project data  \t</p>  \t<p>  \t\t    ·Others: Working and The Non-Working Time, Manual and Auto-Scheduling, Task Splitting, Date Constraint, Overtime, Gantt Chart, Slack, Critical Paths, Peak, Milestone Tasks, Task Allocation &amp; Dependencies, Duration, Work and Units  \t</p>  </ul>  <p>  \t    We will also <strong style=\"\">learn few time saving techniques</strong> such as: modifying dependencies so that tasks can start sooner, creating overlapping dependencies, reducing the amount of slack on individual tasks, breaking larger tasks into smaller chunks and drive project using parallel tasks, outsourcing in case of resource constraints, etc. This tutorial is designed for beginners where they will develop important skills in planning a project and using project management software. After the completion of the course, learners are able to effortlessly conduct all basic tasks to create and track projects. Working files are included for the chapter, allowing you to follow along with the author throughout the lessons.  </p>  <p>  \t    The course includes:  </p>  <ul style=\"\">  \t<p>  \t\t    ·`<strong style=\"\">13 Section-wise short quiz </strong>to test your understanding  \t</p>  \t<p>  \t\t    ·Downloadable shortcut sheet for MS Project 2013  \t</p>  \t<p>  \t\t    ·Lifetime support for doubt solving  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Project 2013 for Resource Planning and Project Management", 
    "price": "20.00", 
    "instructors": "Yoda Learning", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/282856_9e67_2.jpg", 
    "course_url": "https://www.udemy.com/project-2013-project-management/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-18T05:14:47Z"
}