{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Getting the data is actually the easy part. Now that you have the data, the hard part is to analyze it. Data is often found in a mess and the job of sorting it and maintaining it, along with analyzing it was once a difficult task. This is before Microsoft Excel came along – making it easier to store, organize, sort, filter and even analyze the data.<br>Our Excel 2016 course is a complete online tutorial designed to not only familiarize you with the Excel program, but to also teach you all the things that Excel is capable of performing. Our tutorial will also cover the differences between Excel 2013 and the latest version – the Excel 2016, teaching you all the new features that are available with the 2016 version.<br>Microsoft Excel is an interactive spreadsheet that allows users to organize, analyze and store data in a tabular form. Originally designed as an alternative for accounting worksheets, Excel has since then evolved into a more complex piece of software. It has enabled users to easily record and analyze information and offers numerous tools to help along with this process. <br>Excel comes in a grid of cells that are arranged in numbered rows and letter-named columns. It allows arithmetic operations and also caters to statistical, engineering and financial requirements. <br>Excel 2016 is a part of the Microsoft Office 2016 suite is the successor to Excel 2013. However, many functions in Excel 2013 are similar to the functions found in Excel 2016.<br>The course will cover topics such as If statements, Vlookup, Round functions, Time functions, Data lookups, Sparklines, Outlining and even Scenarios. From basic formulas and simple functions to complex statements and operators, this course includes it all. It breaks down all aspects of Excel 2016 to give you a complete understanding of this amazing and useful software. <br>To give you an optimum learning experience, each section also comes with working files, practice exercises and even quiz questions and answers to help you along on your learning journey. <br>In this course, you will learn:</p>\n\n<ul><li><strong>Learn how to use the basic formulas – SUM, COUNT, MIN, and MAX functions</strong></li><li><strong>Understand how to use the SUMIF function for selective counting, 'AVERAGEIF' for Mean of selected cells, Multiple Criteria Within 'SUMIF', 'COUNTIF', and 'AVERAGEIF'</strong></li><li><strong>Learn how to use the 'VLOOKUP' function and its various features</strong></li><li><strong>Understand what is Sparkline, how to create a sparkline, altering the design of Sparklines, comparing sparklines and removing sparklines.</strong></li><li><strong>How to perform calculations using time in a worksheet</strong></li><li><strong>How to create, edit and remove an outline</strong></li><li><strong>Understand how to create and compare different scenarios</strong></li><li><strong>What are Custom Views, how to create a Custom View and how to edit and delete a Custom View.</strong></li></ul>\n\n\n\n<p>There is so much more that you can do with your excel sheet. From simply a tool for organizing, excel can now help with simple calculations to performing complex functions, including creating charts, tables and graphs. Enroll now and learn how Excel can simplify your life. </p>", 
    "end_date": null, 
    "title": "Quick Guide to Master Advance Excel", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/744688_dda0.jpg", 
    "course_url": "https://www.udemy.com/quick-guide-to-master-advance-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-28T11:34:39Z"
}