{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Do you have a book inside of you? Most people do! The problem is getting that book out and onto the page - and not just onto the page; but also out into the global marketplace.</p><p>Where do you start?</p><p><strong style=\"\">Can you really self publish your own book?</strong></p><p>This course provides an excellent introduction for anyone who may be toying with the idea of not just writing a book but taking the next step and actually publishing it.</p><p><strong style=\"\"><em style=\"\">It&#039;s easier than you think!</em></strong></p><p>Perhaps you like to write short stories, poetry or maybe you even have a novel in progress that never seems to get finished. You&#039;ve found the right course to finally get your writing out into the market where it belongs.</p><p>This course will show you a simple method to format your manuscript using MS Word so that you can upload it directly to the Amazon KDP and Amazon CreateSpace Marketplace.</p><p>You will also see how you can make a quality book cover using Photoshop in 5 minutes flat! Where to get royalty free graphics that you can use with no attribution required - even for commercial use.</p><p>This short course can be completed in just a couple of hours. 30 minutes of video and several text based lectures. The three sections of the course covers:</p><ul style=\"\"><li>1 How to use MS Word to format a manuscript that will be accepted by Amazon.</li><li>2 Evaluating the self-publishing opportunity. My strategy for approaching the self-publishing opportunity.</li><li>3 Using Photoshop to make free book covers quickly and easily.</li></ul><p>Take the next step, enroll now and get yourself in gear! Learn to self-publish for fun and profit today. An easy introduction to a great work from home opportunity!</p>", 
    "end_date": null, 
    "title": "Self-Publishing Primer: Basic steps for new writers.", 
    "price": "20.00", 
    "instructors": "Patrick Doucette", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447158_4b25_4.jpg", 
    "course_url": "https://www.udemy.com/self-publishing-primer/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-14T10:57:41Z"
}