{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Microsoft recently released their new Operating System Windows 10 and consumers are already downloading it in droves.  By the time you read this, over 120 million people would have installed and played around with Windows 10. </p><p>While there are a lot of resources and websites dedicated to helping consumers understand the basics of Windows 10, there isn't too much out there targeted at helping business owners understand the consequences of installing this software. That's where this course comes in. </p><p>If you are planning to roll this Operating System out to your business, this course is the one for you. We answer some of the basic questions about the business value of Windows 10 and what it takes to implement Windows 10 in a small business environment. </p><p>This course gives guidance about Windows 10 licensing, upgrades, the 12 month free period, Microsoft accounts, networking, backing up data, storage, peripherals, connecting to Windows Server 2012, Windows 10 security options (Windows Hello and Microsoft Passport) and much more.</p><p>If you are deploying Windows 10 in your business and want a good foundational understanding of what this Operating System can do, you need this course.</p><p>OUR BIG BONUS - when you sign up for this course, you get a FREE coupon to our other course on UDEMY - Introduction to Windows 10 (a $50 value).</p>", 
    "end_date": null, 
    "title": "Setting up Windows 10 for a small business", 
    "price": "50.00", 
    "instructors": "Lane Fries", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609636_cc63_5.jpg", 
    "course_url": "https://www.udemy.com/setting-up-windows-10-for-small-business/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-12T00:58:33Z"
}