{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">SharePoint - A Quick Intro on How to Work with a SharePoint Site</strong></p><p>So, you want to learn Microsoft SharePoint. Maybe you're just starting out with SharePoint. Maybe you just landed a new job and the office you work at uses SharePoint to maintain all their important documents. Or, maybe your office has been using and you figure it's finally about time to get to know what SharePoint is all about. Whatever your specific reasons are for enrolling in this course, you've come to the right place to get a quick high level overview of Microsoft SharePoint.</p><p>I've made this course short and too the point. In one sitting you can quickly get up to speed on SharePoint basics and a little more. Topics you'll cover during this course, include;</p><ul><li>Introduction to SharePoint</li><li>SharePoint Interface</li><li>How SharePoint can Help You Become More Productive</li><li>Working with SharePoint Lists and Libraries</li><li>High Level Intro to Other SharePoint Terms and Features</li></ul><p><br></p><p>I've been teaching SharePoint since the 2003 version and I have come to realize that building a solid foundation within SharePoint is something that a lot of office workers have missed out on. Typically, someone's first experience in SharePoint is like having a surprise dentist appointment, where you suddenly wake up in the dentist chair, not sure how you got there and realize you didn't brush your teeth that morning.</p><p>Enroll in this course and I will quickly get you up to speed on what SharePoint is all about and cover the basics. This foundation will prepare you to take a deeper dive into more on SharePoint.</p><p><strong>Enroll now and learn how SharePoint can streamline your efforts. See you in the course!</strong></p>", 
    "end_date": null, 
    "title": "SharePoint 2013 Introduction", 
    "price": 0, 
    "instructors": "Kyle Pew", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806474_4d5c_4.jpg", 
    "course_url": "https://www.udemy.com/microsoft-sharepoint-2013-introduction/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T19:40:53Z"
}