{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Get Organized with SharePoint 2013</strong></p>\n\n<p>Are you looking to become more efficient working with a SharePoint site? Or, maybe you're brand new to SharePoint. In either case, this course is for you.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">I Feel Your Pain</strong></p>\n\n\n\n<p>SharePoint allows you to build a central location for all relevant data. Imagine removing all the pain points that we all experience working with an unorganized shared drive, sending documents through email, following up on tasks, updating an Excel document that everyone else in the office needs to update at the same time. At times, work can become very inefficient!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Don't Waste More Time, Join Me</strong></p>\n\n\n\n<p>As you participate in this course you will learn not only the basics of working with a SharePoint site, but unlock the full potential of SharePoint. Most people think of SharePoint as a place to store documents, but it is so much more than storage.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">During this course you will learn to:</strong></p>\n\n\n\n<ul><li>Build and Maintain an <strong class=\"redactor-inline-converted\">Effective SharePoint Site</strong></li><li>Work with <strong class=\"redactor-inline-converted\">SharePoint Document Libraries</strong></li><li><strong class=\"redactor-inline-converted\">Customize SharePoint</strong> to Fit Your Team's Needs</li><li>Automate Routine Office Tasks by Using <strong class=\"redactor-inline-converted\">SharePoint Workflows</strong></li><li>Build Simple Interfaces to Facilitate <strong class=\"redactor-inline-converted\">Finding Data Quickly</strong></li><li><strong>and much, much more</strong></li></ul><p><br></p><p>Take learning SharePoint a step at a time. I've been teaching SharePoint since the 2003 version, to people just like you, wanting to learn how to become more productive in collaborating with others. Over the years SharePoint has progressed by leaps and bounds. Allow me to guide you through the becoming a SharePoint champion and guru. You will be amazed with all that you can do with SharePoint and eliminate many of your pains in office collaboration.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Enroll now and you'll learn how SharePoint will become your new best friend and you'll even thank me for it.</strong></p>", 
    "end_date": null, 
    "title": "SharePoint 2013 Complete Training", 
    "price": "25.00", 
    "instructors": "Kyle Pew", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/775346_ca40_5.jpg", 
    "course_url": "https://www.udemy.com/sharepoint-2013-complete-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-26T18:44:08Z"
}