{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>You, your co-workers, your company, can't make good decisions without information.</strong><br></p><p>How do you collect that information?<br></p><p>You can collect that data the classic way of distributing paper forms, and wait for them to be returned, if they have been completed at all.  Then when you do get them back you have to tally them.</p><p>Why go through so much trouble when your company already uses SharePoint?</p><p><strong>With this course you can learn how to collect meaningful information with SharePoint.</strong></p><p><strong>With SharePoint Surveys You Can:</strong></p><ul><li>Create web-based questionnaires </li><li>Collect data in an efficient, and cost-effective way</li><li>Summarize your results</li><li>and more.</li></ul><p>______________________________________________</p><p><strong>Take a look at the lectures for the example survey in Section 2, they are free.</strong></p><p>To get a real understanding about <strong>Survey Maintenance</strong>, watch <strong>Section 4.</strong></p><p>When you want to become really comfortable creating surveys in SharePoint, complete all the lectures, including the <strong>Test Your Skills, Bonus Resources</strong>, and <strong>Speed Challenge </strong>sections, after all the name of the course is <em>Create Surveys in a Matter of Minutes.</em><em></em></p><p>This course will help you create SharePoint surveys in no time at all.</p><p>______________________________________________</p><p><strong>Exercises and Handouts</strong></p><p>Along with video content, step-by-step handouts will help you reinforce what you learned, walk you through new survey exercises.</p><p><strong>Is This Course for You?</strong></p><p>This course is for anyone whose job responsibilities include working with SharePoint, and who wants to create a poll, track issues, gather information, or build a tool for in-depth research.</p><p>To ensure your success, knowledge of basic features of SharePoint, like site navigation, is recommended.</p><p>______________________________________________</p><p><strong>Enroll now to learn how to collect meaningful information with SharePoint.</strong></p><p><strong>Lifetime Access</strong></p><p><strong></strong><strong>30 day money back guarantee!</strong></p>", 
    "end_date": null, 
    "title": "SharePoint 2013: Quickly Create Quality SharePoint Surveys", 
    "price": "20.00", 
    "instructors": "IsáBel Harrison", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/521720_6591_2.jpg", 
    "course_url": "https://www.udemy.com/sharepoint2013surveys/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-06T03:14:48Z"
}