{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong>Big data is big business - Excels data analysis tools to help them make sense of their organizational data.</strong>  </p>  <p>  \t    Master statistical analysis with Excel 2013 on your own terms with this one-of-a-kind video training course.   Big data is big business, and many professionals are turning to Excels data analysis tools to help them make sense of their organizational data.  </p>  <p>  \t    Now, you can learn the ins and outs of statistical analysis with Excel - from importing data to utilizing Pivot Tables - with Statistical Analysis with Excel 2013 Advanced Skills.  Our instructors provide expert, straight-forward, user-friendly training to help you tackle new topics the way you want to learn.  Master basic skills, boost your creativity, and challenge yourself in bold new directions.  </p>  <p>  \t    Understand Excels data analysis capabilities and how they can be applied in your organization. Work with data, normal distributions, hypothesis testing, variances, rank, and percentiles. Take advantage of formulas, Pivot Tables, dashboards, and reporting tools to display your data.  </p>  <p>  \t    Includes 5 hours of advanced statistical analysis with Excel 2013 video training with lessons for you to practice what you have learned.  If you&#039;re looking for advanced real-world statistical analysis with Excel 2013 instruction, you&#039;ll find it here.  </p>", 
    "end_date": null, 
    "title": "Statistical Analysis with Excel 2013 Advanced Skills", 
    "price": "50.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286076_d903_3.jpg", 
    "course_url": "https://www.udemy.com/statistical-analysis-with-excel-2013-advanced-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-22T18:13:12Z"
}