{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "  <p>  \t    Are you mystified by Microsoft Excel? Feeling intimidated by spreadsheets? Want to save time and effort by learning how to use spreadsheets the RIGHT way?  </p>  <ul>  \t<li><em>  Spreadsheet programs such as <strong>Microsoft Excel</strong> have replaced paper-based systems throughout the business world. Initially developed for accounting and bookkeeping tasks, they're also used extensively to organize and store tabular lists.</em></li>  </ul>  <p>  \t    In this fun and friendly course suitable for absolute beginners, we'll use a practical, real-world example to learn all about spreadsheet navigation, data entry tips and tricks, calculations, formulas, and more!  </p><p><strong>HOW IS THIS COURSE DIFFERENT?</strong>    </p><p>  \t                          My name is Kathleen, and I've been teaching technology to beginners under the moniker <strong><em>Robobunnyattack!</em></strong> since 2009. I believe that with the right approach, anyone can learn anything.  </p>  <ul>  \t<li><strong>My goal in this course is to help you develop an intuitive understanding of how to use ANY spreadsheet software.</strong></li>  </ul>  <p>  \t                          In this course, we'll build and edit a practical, real-world example. As we work together, I'll explain WHY and HOW things work in spreadsheets, so you can <strong>learn more quickly and with more confidence</strong>.  </p>  <p>  \t                          As we build our spreadsheet, we'll cover:  </p>  <ul>  \t<li>How spreadsheets work, and why they're so useful</li>  \t<li>Data entry tips and tricks to save time and effort</li>  \t<li>Thinking ahead so you can build useful and flexible templates</li>  \t<li>Putting your spreadsheet to work with simple formulas and functions</li>  \t<li>Using spreadsheets to find solutions to real-world problems</li>  \t<li>How to choose the RIGHT file format for your spreadsheet</li>  \t<li>BONUS: FREE alternatives to Microsoft Excel!</li>  </ul>  <p>  \t    I'll demonstrate each step using LibreOffice, a FREE and easy-to-use office productivity suite. You can apply these skills in your preferred spreadsheet software program, such as <strong>Microsoft Excel</strong>, <strong>Apple Numbers</strong>, or <strong>Google Spreadsheets</strong>.  </p>  <p>  \t<strong>By the end of this course, you'll be able to use Microsoft Excel or any other spreadsheet software application with confidence!</strong>  </p>  <p>  \t                          Here's just a sample of what my (awesome!) students have to say about this course:  </p>  <p>  \t<em>\"Really great introductory course. It helped me to really sort out the formulas and lecture 17 on the file endings was a big eye opener as well.\" —Joan B.</em>  </p>  <p>  \t<em>\"I came into this course having no clue how to operate a spreadsheet, after working through Kathleen's lessons I now have a solid understanding on how to setup and operate spreadsheets.\" —Tim C.</em>  </p>  <p>  \t<em>\"Much quicker than using a book.\" —James H.</em></p><p><em></em><strong>WHAT'S INCLUDED?</strong>    </p><ul>  \t<li>This course includes lifetime access to over 2 hours of step-by-step videos.</li>  \t<li>You'll also get supplementary text lectures, free downloads, and links to helpful resources.</li>  \t<li>Short quizzes at the end of each section will help you gauge your own understanding and check your progress along the way.</li></ul><p><strong>HOW LONG WILL IT TAKE ME?</strong>    </p><ul>  \t<li>This completely depends on your availability and learning preference. You can work through all the video lectures in one afternoon, or pace yourself over several days or weeks — it's up to you!</li></ul><strong>WHAT IF THIS COURSE ISN'T FOR ME?</strong>    <ul>  \t<li>This course comes with an <strong>unconditional 30-day Udemy-backed guarantee</strong>. Try out this course for 30 days and see for yourself if my approach to learning how to use spreadsheets is right for you. If you're not 100% satisfied with this course, simply request a full refund within 30 days — no conditions, no questions asked!</li>  </ul>  <p>  \t                          I'm confident you'll LOVE this course, and I'm excited to help you learn. <strong>Enrol now and you can start using spreadsheets with confidence today!  </strong>  </p>  <p>  \t<em>—Kathleen Farley (aka Robobunnyattack!)</em></p>", 
    "end_date": null, 
    "title": "Step-by-step Spreadsheets for Absolute Beginners", 
    "price": "30.00", 
    "instructors": "Kathleen Farley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/160172_1ef5_2.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-spreadsheets-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-08T13:50:59Z"
}