{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>If you wish to prepare for <strong>Microsoft</strong> <strong>Certification Exam 77-418:Microsoft Office Word 2013</strong> <strong>OR Microsoft Certification Exam 77-425 Part 1 and 77-426 Part 2: Microsoft Office Word 2013 Expert</strong>, this course will help you build the skills and knowledge you need.</p> <ul> <li>Step-by-step video demonstrations</li> <li>Companion eBook with 245 pages of detailed instructions</li> <li>Sample documents and images</li> <li>Practice, Quizzes and Skill Test</li> </ul> <p>With this comprehensive, performance-based certification preparation online program, you can build and validate your business computer skills using Microsoft Word 2013 software. You'll cover basic through advanced topics. Upon completion, you'll be prepared to earn your certification and gain an important edge in today's competitive job market.</p><p><strong>In Beginning Microsoft Word, you will cover important topics, including how to:</strong></p> <ul><li>Learn how to navigate online and submit assignments</li><li>Format Text and Paragraphs</li><li>Get skilled at working with Text and Pictures</li><li>Use the Quick Click options and the mini Toolbar to format Text</li><li>Gain experience editing images and shapes with the Picture Tools</li><li>Learn how to create and format SmartArt</li><li>Use Quick parts to create professional documents</li></ul> <p><br></p><p>The <strong>Microsoft Word 2013 Certification Training Program</strong> is part of the Microsoft Business Certification program: Microsoft Office Specialist (MOS). MOS certification is the globally recognized standard for validating expertise with the Microsoft Office 2013 suite. Students who wish to prepare for <strong>Microsoft</strong> <strong>Certification Exam 77-418:Microsoft Office Word 2013</strong> <strong>OR Microsoft Certification Exam 77-425 Part 1 and 77-426 Part 2: Microsoft Office Word 2013 Expert</strong> will find beginning through advanced lessons that demonstrate these required MOS topics.</p><p><strong><br></strong></p><p><strong>This course teaches the objectives for the following certification tests:</strong> Core Certification: Pass any 1 test: Word 2013 Core: Exam 77-418 </p><p>Expert Certification: Pass either test: Word 2013 Expert Exam 77-425 Part 1 or 77-426 Part 2.</p><p><br></p>", 
    "end_date": null, 
    "title": "The Beginning Guide to Microsoft Word 2013", 
    "price": 0, 
    "instructors": "Elizabeth Nofs", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622078_19c3.jpg", 
    "course_url": "https://www.udemy.com/the-beginning-guide-to-microsoft-word-2013/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-25T09:22:08Z"
}