{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">If you wish to prepare for <strong style=\"\">Microsoft</strong> <strong style=\"\">Certification Exam 77-420: Microsoft Office Excel 2013</strong> this course will help you build the skills and knowledge you need.</p><ul style=\"\"><li style=\"\">Step-by-step video demonstrations</li><li style=\"\">Companion eBook with 217 pages of detailed instructions</li><li style=\"\">Sample spreadsheets</li><li style=\"\">Practice, Quizzes and Skill Test</li></ul><p style=\"\">With this comprehensive, performance-based certification preparation online program, you can build and validate your business computer skills using Microsoft Excel 2013 software. You&#039;ll cover basic through advanced topics. Upon completion, you&#039;ll be prepared to earn your certification and gain an important edge in today&#039;s competitive job market.</p><p style=\"\"><strong style=\"\">In Beginning Microsoft Excel, you will cover important topics, including how to:</strong></p> <ul style=\"\"><li style=\"\">Enter data and use basic text formatting in a spreadsheet</li> <li style=\"\">Enter data, format labels and create formulas in a price sheet</li> <li style=\"\">Use and audit formulas from Excel&#039;s formula library to calculate numbers, text, dates and financial payments</li> <li style=\"\">Insert and modify Charts with the Chart Tools and the new Quick Click options</li> <li style=\"\">Insert and format pictures in a spreadsheet</li> <li style=\"\">Use, format and modify Shapes, SmartArt, and Views</li></ul> The <strong style=\"\">Microsoft Excel 2013 Certification Training Program</strong> is part of the Microsoft Business Certification program: Microsoft Office Specialist (MOS). MOS certification is the globally recognized standard for validating expertise with the Microsoft Office 2013 suite. Students who wish to prepare for <strong style=\"\">Microsoft Certification Exam 77-420: Microsoft Office Excel 2013 OR Microsoft Certification Exam 77-427 Part 1 and 77-428 Part 2: Microsoft Office Excel 2013 Expert, </strong>will find beginning through advanced lessons that demonstrate these required MOS topics. <p style=\"\"><strong style=\"\">This course teaches the objectives for the following certification tests:</strong> </p><p style=\"\">Core Certification: Pass any 1 test:  Excel® 2013 Core: Exam 77-420</p>", 
    "end_date": null, 
    "title": "The Beginning Guide to Microsoft Excel 2013", 
    "price": 0, 
    "instructors": "Elizabeth Nofs", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543070_8570_4.jpg", 
    "course_url": "https://www.udemy.com/the-beginning-guide-to-microsoft-excel/", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T12:23:10Z"
}