{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t   Microsoft Project can take any managers skills up to the next level, simplifying the process of running a project, and keeping track of every last detail. There&rsquo;s no better tool out there to make sure that you stay on-schedule and on-budget. Whether you&rsquo;re a manager looking to improve their skills, or are looking to develop management skills for the sake of a promotion, mastery of Microsoft Project is invaluable.  </p>  <p>  \t   Our <strong style=\"\">Ultimate Microsoft Project Training Bundle </strong>contains beginner and advanced courses for both Project 2010 and Project 2013, so that no matter what version you&rsquo;re faced with you have the skills to keep up.  </p>  <p>  \tThis bundle includes:  </p>  <ul style=\"\">  \t<li><em style=\"\"><strong style=\"\">36 hours</strong> of video tutorials</em></li>  \t<li><em style=\"\"><strong style=\"\">180</strong><strong style=\"\"> individual video lectures</strong></em></li>  \t<li><em style=\"\"><strong style=\"\">4 quizzes </strong>with<strong style=\"\"> 175 test questions</strong></em></li>  \t<li><em style=\"\">Certificate of completion</em></li>  </ul>  <p>  \t <strong style=\"\">Courses Included with this Bundle:</strong>  </p>  <p>  \t <strong style=\"\">Learn Microsoft Project 2013</strong>  </p>  <p>  \t   Starting with the basics, you&rsquo;ll discover how to design a custom project and use templates. Next, you&rsquo;ll see how to integrate your data and turn it into a compelling report. You&rsquo;ll then get useful tips for solving tricky Gantt Chart problems by learning to trace task paths. To help you strategize more efficiently with your team, you&rsquo;ll also explore the handy Lync 2010 feature which allows you to communicate with others directly inside the Project 2013 interface. You&rsquo;ll then discover the best ways for exporting your work to other Microsoft programs as well as for sharing information in online meetings and via the cloud.  </p>  <p>  \t <strong style=\"\">Learn Microsoft Project 2013 - Advanced</strong>  </p>  <p>  \t   Get ready to take your project management skills to the next level as you:  </p>  <ul style=\"\">  \t<li>Discover effective methods for sharing resources.</li>  \t<li>See how to create and run effective project reports.</li>  \t<li>Find out about cost management.</li>  \t<li>Explore the use of earned value analysis for your project.</li>  \t<li>Discover advanced options for customizing your workspace.</li>  \t<li>Dive into options for consolidating and splitting projects.</li>  </ul>  <p>  \t <strong style=\"\">Learn Microsoft Project 2010</strong>  </p>  <p>  \t   During the <em style=\"\">Learn Microsoft Project 2010</em> video training course, your professional trainer guides you through project management topics such as task creation, resource management, cost tracking, using WBS codes, critical path reporting, and more.  </p>  <p>  \t   Discover the building blocks of a project. Start with information gathering and documentation, and when you feel comfortable with that, move on to the basics of tasks and resources. Get detailed step-by-step guidance on how to assign and allocate resources. Learn to document a project as you go by properly defining costs and adding notes&mdash;enabling full traceability.  </p>  <p>  \t <strong style=\"\">Learn Microsoft Project 2010 - Advanced</strong>  </p>  <p>  \t   Learn the value of defining costs up front&mdash;baselining the costs so you can track them. Evaluate the project as you go from a detached view to determine resourcing problems. Understand how to assign, level, and divert resources so you can overcome resource problems to keep the project moving forward.  </p>  <p>  \t   Discover how to divide a project into parts and combine them when necessary. Learn how to create links and dependencies between projects and share resources. And discover how to maximize critical tools: customization, macros, views, VBA, writing code, creating new macros, and importing and exporting.  </p>  <p>  \t <strong style=\"\">What people are saying:</strong>  </p>  <p>  \t <em style=\"\">&ldquo;Excellent course overall, well worth investing time and money on. I recommend that participants practice many of the techniques learned on this Basic/Intermediate course before moving on to the Advanced course.&rdquo;</em>  </p>  <p>  \t<strong style=\"\"> - J. Burns</strong>  </p>  <p>  \t <em style=\"\">&ldquo;I was a constant user of MS Project 2007 and was trying to make the leap into MS Project 2013. This course provided a great foundation from which to get comfortable with the new layout of the software plus to utilize the enhanced functionality.</em>  </p>  <p>  \t<strong style=\"\"> - J. Humphrey</strong>  </p>  <p>  \t <em style=\"\"> &ldquo;Everything are well explained, enrich with practice files ready to play along. Starting with the basics up to tricky Gantt Chart problems and more.&rdquo;</em>  </p>  <p>  \t<strong style=\"\"> - Arif N.</strong>  </p>  <p>  \t   &quot;<em style=\"\">Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.</em>&quot;  </p>  <p>  \t<strong style=\"\"> - TopTenReviews.com</strong>  </p>  <p>  \t   Note: All videos are high-definition and are therefore best viewed enlarged and with the<strong style=\"\"> HD setting on</strong>.  </p>", 
    "end_date": null, 
    "title": "The Ultimate Microsoft Project 2010 & 2013 Training Bundle", 
    "price": "50.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "36 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/109822_87f4_5.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-microsoft-project-training-bundle/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-23T21:10:48Z"
}