{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>PowerPoint 2013 Advanced  </strong></p><p>If you wish to prepare for <strong>Microsoft</strong> <strong>Certification Exam 77-422: Microsoft Office PowerPoint 2013</strong>, this course will help you build the skills and knowledge you need.</p>  <ul>  <li>Step-by-step video demonstrations</li>  <li>Companion eBook with 294 pages of      detailed instructions</li>  <li>Sample presentations and images</li>  <li>Practice, Quizzes and Skill Test</li> </ul>    <p>All materials for this program are available online.</p>  <p>The following resources are available to download throughout the lessons:</p>  <ul><li><em>Advanced Guide to Microsoft® PowerPoint 2013</em></li><li><em>Microsoft PowerPoint 2013 Advanced Sample files</em></li></ul>      <p><br></p><p>With this comprehensive, performance-based certification preparation online program, you can build and validate your business computer skills using Microsoft PowerPoint 2013 software. You'll cover basic through advanced topics. Upon completion, you'll be prepared to earn your certification and gain an important edge in today's competitive job market.</p>  <p><strong>In Advanced Microsoft PowerPoint, you will cover important topics, including how to:</strong></p>  <ul><li>Use Tables and Spreadsheets to display data in a presentation</li><li>Learn how to add, format and edit Charts with the Chart Tools and Quick Clicks</li><li>Learn how to design Slide Masters and apply slide Transitions</li><li>Apply Animations to images in a slide show and edit the timing</li><li>Add videos to a PowerPoint presentation and trim the media</li><li>Practice Delivering Presentations with the Presenter’s Tools</li><li>Use the Review Tools to Proof and Protect Presentations</li><li>Learn Options for saving and sharing PowerPoint presentations</li></ul>    <p><br></p><p>The <strong>Microsoft PowerPoint 2013 Certification Training Program</strong> is part of the Microsoft Business Certification program: Microsoft Office Specialist (MOS). MOS certification is the globally recognized standard for validating expertise with the Microsoft Office 2013 suite. Students who wish to prepare for <strong>Microsoft</strong> <strong>Certification Exam 77-422:Microsoft Office PowerPoint 2013</strong> will find beginning through advanced lessons that demonstrate these required MOS topics.</p>  <p><strong>This course teaches the objectives for the following certification tests:<br> </strong> <u>PowerPoint® 2013: Exam 77-422</u>,</p>", 
    "end_date": null, 
    "title": "The Advanced Guide to Microsoft PowerPoint 2013", 
    "price": "20.00", 
    "instructors": "Elizabeth Nofs", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676352_fddc_2.jpg", 
    "course_url": "https://www.udemy.com/the-advanced-guide-to-microsoft-powerpoint-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T11:45:06Z"
}