{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t In today’s workplace, data management skills are absolutely crucial, and Microsoft Access is the most widely available software for the job. Whether you need beginner, intermediate or advanced level Access 2010 training, our <strong style=\"\">Ultimate Microsoft Access 2010 Training Course </strong>has got you covered. Starting with the absolute basics, these informative and engaging courses will take you to the level of total data mastery in both editions of the program, as you work through both beginners and advanced courses.  </p>  <p style=\"\">  \t If you need to manage data at all in your job, or are looking for a promotion to a role where you do, then you simply can’t afford to miss this training.  </p>  <p style=\"\">  \t This bundle includes:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"><em style=\"\">15 hours</em></strong><em style=\"\"> of video tutorials</em></li>  \t<li style=\"\"><em style=\"\">Over<strong style=\"\"> 60 individual video lectures</strong></em></li>  \t<li style=\"\"><em style=\"\">Optional <strong style=\"\">quizzes</strong> to test what you’ve learned</em></li>  \t<li style=\"\"><em style=\"\">Certificate of completion</em></li>  </ul>  <p style=\"\">  \t <strong style=\"\">Courses included with this bundle:</strong>  </p>  <p style=\"\">  \t <strong style=\"\">Learn Microsoft Access 2010</strong>  </p>  <p style=\"\">  \t Discover the fundamentals of database design and construction, as this will allow you to construct a strong relational database that makes future modifications and data analysis easier.  </p>  <p style=\"\">  \t Each chapter builds on the previous one, walking you through topics on tables and their attributes, structures, and field properties. Forms are presented to make information gathering and input a breeze. Learn data analysis using functions, formulas, expression builder, conditional formatting, sorting, filtering, and queries. Discover practical techniques for improving designs, adding existing fields, and grouping/sorting—as your instructor gives you easy to understand methods for working with reports.  </p>  <p style=\"\">  \t <strong style=\"\">Learn Microsoft Access 2010 - Advanced</strong>  </p>  <p style=\"\">  \t Beyond just getting data into the database, in our Advanced level course, you will be taught to create both form and function. Discover how to create switchboards, autoexec functions, macros, creative reports, custom buttons, deep custom queries for detailed data analysis, and reports that shine—both in terms of how they look on paper as well as due to the data they provide. Additionally, you will learn best practices to employ during initial design and creation steps. These will help you minimize headaches as the database design evolves, and enable mass distribution as the amount of data and number of users increases.  </p>  <p style=\"\">  \t Where else can you find so many extra tools to help you master Access?  </p>  <p style=\"\">  \t <strong style=\"\">What people are saying:</strong>  </p>  <p style=\"\">  \t <em style=\"\">&quot;Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.&quot;</em><br style=\"\">  \t<strong style=\"\">- TopTenReviews.com</strong>  </p>  <p style=\"\">  \t <em style=\"\">&quot;Thank you very much for an extraordinaire online tutorial of Access, it has helped me a lot and even enabled me to get a job. Now I work for an asset management bureau in Paris programming and updating databases from Bloomberg on a daily basis!&quot;</em><br style=\"\">  \t<strong style=\"\">- Lisa R., France.</strong>  </p>  <p style=\"\">  \t <em style=\"\">“The instructor is easy to follow. He explains things clearly and takes his time going over it. The best part is that you can review the course as often as you want if there is something you are having a hard time grasping.”</em><strong style=\"\">- Terry J. Stigall</strong>  </p>  <p style=\"\">  \t “<em style=\"\">Easy to understand and informative. I consider myself an advanced user of MS Access, but I learned something useful in every chapter.”<strong style=\"\">- Kathleen Dziubek</strong></em>  </p>", 
    "end_date": null, 
    "title": "The Ultimate Microsoft Access 2010 Training Course 15 Hours", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/216294_826e_6.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-microsoft-access-2010-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-12T15:04:54Z"
}