{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t   In today&rsquo;s workplace, data management skills are absolutely crucial, and Microsoft Access is the most widely available software for the job. Whether you need to use Access 2010 or 2013, our <strong style=\"\">Ultimate Microsoft Access Training Bundle </strong>has got you covered. Starting with the absolute basics, these courses will take you to the level of total data mastery in both editions of the program, as you work through both beginners and advanced courses.  </p>  <p>  \t   If you need to manage data at all in your job, or are looking for a promotion to a role where you do, then you can&rsquo;t afford to give this a miss.  </p>  <p>  \tThis bundle includes:  </p>  <ul style=\"\">  \t<li><em style=\"\"><strong style=\"\">35 hours</strong> of video tutorials</em></li>  \t<li><em style=\"\">Over<strong style=\"\"> 150 individual video lectures</strong></em></li>  \t<li><em style=\"\"><strong style=\"\">4 quizzes </strong>with<strong style=\"\"> 170 test questions</strong></em></li>  \t<li><em style=\"\">Certificate of completion</em></li>  </ul>  <p>  \t <strong style=\"\">Courses included with this bundle:</strong>  </p>  <p>  \t <strong style=\"\">Learn Microsoft Access 2013</strong>  </p>  <p>  \t   Starting with the basics, our certified instructor will teach you to add and delete records to your database. Then, learn to create desktop databases and apps for multiple users before diving into importing data from other sources. Build forms to capture information online. Implement pre-designed templates that track project, employee, issue, or task details. Protect databases with permissions. Run reports that provide valuable business intelligence. And walk away with a solid grasp of how tie it all together with this Microsoft Access Training. <strong style=\"\">Includes exercise files.</strong>  </p>  <p>  \t <strong style=\"\">Learn Microsoft Access 2013 - Advanced</strong>  </p>  <p>  \t   Your professional trainer will show you how to use macros, tables, forms, queries, and other tools to create a professional, working database. Follow along as you learn to create and maintain macros, then see how to effectively link to other data sources. Get helpful techniques that allow you to link, report, and package your data quickly, and find out how to split a database by splitting the frontend and backend.  </p>  <p>  \t   With this informative course, you&rsquo;ll learn the skills you need to make an impact with sleek, high-performing databases that help you do your job better.<strong style=\"\"> Includes exercise files.</strong>  </p>  <p>  \t <strong style=\"\">Learn Microsoft Access 2010</strong>  </p>  <p>  \t   Discover the fundamentals of database design and construction, which will allow you to construct a strong relational database that makes future modifications and data analysis easier.  </p>  <p>  \t   Each chapter builds on the previous one, walking you through topics on tables and their attributes, structures, and field properties. Forms are presented to make information gathering and input a breeze. Learn data analysis using functions, formulas, expression builder, conditional formatting, sorting, filtering, and queries. Discover practical techniques for improving designs, adding existing fields, and grouping/sorting&mdash;as your instructor gives you easy to understand methods for working with reports.  </p>  <p>  \t <strong style=\"\">Learn Microsoft Access 2010 - Advanced</strong>  </p>  <p>  \t   Beyond just getting data into the database, you will be taught to create both form and function. Discover how to create switchboards, autoexec functions, macros, creative reports, custom buttons, deep custom queries for detailed data analysis, and reports that shine&mdash;in terms of how they look on paper and the data they provide. Additionally, you will learn best practices to employ during initial design and creation steps. These will help you minimize headaches as the database design evolves, and enable mass distribution as the amount of data and number of users increases.  </p>  <p>  \t   Where else can you find so many extra tools to help you master Access?  </p>  <p>  \t <strong style=\"\">What people are saying:</strong>  </p>  <p>  \t <em style=\"\">&quot;Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.&quot;</em>  </p>  <p>  \t   - TopTenReviews.com  </p>  <p>  \t <em style=\"\">&quot;Thank you very much for an extraordinaire online tutorial of Access, it has helped me a lot and even enabled me to get a job. Now I work for an asset management bureau in Paris programming and updating databases from Bloomberg on a daily basis!&quot;</em>  </p>  <p>  \t   - Lisa R., France.  </p>  <p>  \t <strong style=\"\">Note:</strong> All videos are high-definition and are therefore best viewed enlarged and <strong style=\"\">with the HD setting on.</strong>  </p>", 
    "end_date": null, 
    "title": "The Ultimate Microsoft Access 2010 and 2013 Training Bundle", 
    "price": "50.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "35 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/109094_6e72_5.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-microsoft-access-training-bundle/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-22T11:41:49Z"
}