{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t Just about everyone will find him or herself having to use Microsoft Excel at work at one point or another, and Excel 2010 is one of the most popular and powerful versions around. That means that everyone could benefit from devoting some time to mastering the program. Excel mastery will not only have a huge impact on your own productivity, but also it can look hugely impressive to your boss.  </p>  <p style=\"\">  \t With our <strong style=\"\">Ultimate Microsoft Excel 2010 Training Course, </strong>you’ll find basic and advanced courses for Microsoft Excel 2010.  </p>  <p style=\"\">  \t This bundle includes:  </p>  <ul style=\"\">  \t<li style=\"\">Beginner and advanced courses for mastering Excel 2010<br style=\"\">  \t <strong style=\"\"></strong></li>  \t<li style=\"\"><strong style=\"\"><em style=\"\">14 hours of video</em></strong> tutorials</li>  \t<li style=\"\"><em style=\"\">Over <strong style=\"\">100 individual video      lectures</strong></em></li>  \t<li style=\"\">Optional quizzes to test what you’ve learned</li>  \t<li style=\"\">Certificate of Completion</li>  </ul>  <p style=\"\">  \t <strong style=\"\">Courses included with this bundle:</strong>  </p>  <p style=\"\">  \t <strong style=\"\">Learn Microsoft Excel 2010 for Beginners</strong>  </p>  <p style=\"\">  \t Our professional instructor will talk you through Excel 2010’s features, starting with the basics like creating files to editing existing documents. Secondly, you’ll move onto moving and managing data across rows and columns, as well as different sheets, in addition to introducing your first formulas. Formatting workbooks comes next, in addition to adding attractive charts and graphs to display your work. You’ll then progress to sorting and filtering data, linking multiple files and, finally, working with some more advanced formulas.  </p>  <p style=\"\">  \t <strong style=\"\">Learn Microsoft Excel 2010 - Advanced</strong>  </p>  <p style=\"\">  \t Discover methods to make your exceptions stand out so you can attack the anomalies and use the data to make your operations better. During this Advanced level course, Excel’s tools are covered in depth and include discussions on setting up live charts, Sparklines, color scales, and icon sets. Your data will become alive as you identify key action items and understand the meaning behind the numbers. Learn how to use Pivot Tables combined with Pivot Charts in powerful ways. By the end of this course, you will be able to move columns and rows to understand more easily than ever before how the numbers relate.  </p>  <p style=\"\">  \t Where else can you find so many extra tools to help you gain advanced skills in Excel?  </p>  <p style=\"\">  \t <strong style=\"\">What people are saying:</strong>  </p>  <p style=\"\">  \t <em style=\"\">“This would have to be the most enjoyable on-line course I have ever done. The material is nicely laid out, the presenter talks at a nice pace and explains things clearly. I highly recommend this course to those seeking Excel tuition.”</em><strong style=\"\"><br style=\"\">  \t - Paul Schrooder</strong>  </p>  <p style=\"\">  \t <em style=\"\">“Cindy is very clear and has organized the course brilliantly. Her explanation and covering of topics is granular enough to pick up once the course if over. Even though I am quite used to using most of what is covered, it was always interesting to hear her describe the features and was not bored!”</em><br style=\"\">  \t -<strong style=\"\"> Sam Malone</strong>  </p>  <p style=\"\">  \t &quot;<em style=\"\">Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.</em>&quot;<strong style=\"\"><br style=\"\">  \t - TopTenReviews.com</strong>  </p>  <p style=\"\">  \t <em style=\"\">“Truly outstanding course. I have been in accounting/controllership for over 40 years. I decided to review the basics of Excel just to make sure I knew it all. I didn&#039;t know it all and this highly detailed, cover everything course did show me new stuff. Cindy&#039;s teaching style is the way it should be done. For someone starting out, very highly recommended.”</em><br style=\"\">  \t - <strong style=\"\">Pierre Nantais</strong>  </p>  <p style=\"\">  \t <em style=\"\">“Very clear easy to follow instructions and extremely well presented. Love the layout and how easy it is to navigate to the section you want. Very quick response to any queries you may have. Some companies wanted to charge over £200 for 4 hours! This is great, you work at your own pace, fit it in around your &quot;hectic&quot; lifestyle and you don&#039;t feel overwhelmed or afraid to look at a spreadsheet. I&#039;ve gone from novice to understanding quite a lot from what I&#039;ve learned so far and I&#039;m not even half way through the course.”</em><br style=\"\">  \t -<strong style=\"\"> Debbie Lee</strong>  </p>", 
    "end_date": null, 
    "title": "The Ultimate Microsoft Excel 2010 Training Course - 14 Hours", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/217584_b681_6.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-microsoft-excel-2010-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-13T18:26:45Z"
}