{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>If you wish to prepare for <strong style=\"\">Microsoft</strong> <strong style=\"\">Certification Exam 77-420: Microsoft Office Excel 2013</strong> <strong style=\"\">OR Microsoft Certification Exam 77-427 Part 1 and 77-428 Part 2: Microsoft Office Excel 2013 Expert</strong>, this course will help you build the skills and knowledge you need.</p><ul style=\"\"><li>Step-by-step video demonstrations</li><li>Companion eBook with 245 pages of detailed instructions</li><li>Sample spreadsheets</li><li>Practice, Quizzes and Skill Test</li></ul><p>With this comprehensive, performance-based certification preparation online program, you can build and validate your business computer skills using Microsoft Excel 2013 software. You&#039;ll cover basic through advanced topics. Upon completion, you&#039;ll be prepared to earn your certification and gain an important edge in today&#039;s competitive job market.</p><p><strong style=\"\">In Immediate Microsoft Excel, you will cover important topics, including how to:</strong></p> <ul style=\"\"><li>Create formulas that use Relative and Absolute values and audit the formulas</li> <li>Use and modify TEXT formulas to combine cells (Concatenate) and format the data</li> <li>Create, use and troubleshoot Named Ranges and use Named Ranges in formulas</li> <li>Understand how to create and use Lookup Tables and use the IF functions</li> <li>Excel In Print: Use page Layout and Page Set up to modify print settings</li> <li>Excel Online: Use and modify Sparklines and hyperlinks</li> <li> </li></ul> The <strong style=\"\">Microsoft Excel 2013 Certification Training Program</strong> is part of the Microsoft Business Certification program: Microsoft Office Specialist (MOS). MOS certification is the globally recognized standard for validating expertise with the Microsoft Office 2013 suite. Students who wish to prepare for <strong style=\"\">Microsoft Certification Exam 77-420: Microsoft Office Excel 2013 OR Microsoft Certification Exam 77-427 Part 1 and 77-428 Part 2: Microsoft Office Excel 2013 Expert, </strong>will find beginning through advanced lessons that demonstrate these required MOS topics. <p><strong style=\"\">This course teaches the objectives for the following certification tests:</strong> Core Certification: Pass any 1 test:  Excel® 2013 Core: Exam 77-420 </p><p>Expert Certification: Pass either test:  Excel 2013 Expert Part 1: Exam 77-427 Excel 2013 Expert Part 2: Exam 77-428</p>", 
    "end_date": null, 
    "title": "The Intermediate Guide to Microsoft Excel 2013", 
    "price": "20.00", 
    "instructors": "Elizabeth Nofs", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543156_e65c_4.jpg", 
    "course_url": "https://www.udemy.com/the-intermediate-guide-to-microsoft-excel-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T14:26:51Z"
}