{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>If you wish to prepare for <strong>college and life after college in a rewarding profession</strong>, this course will help you build the skills and knowledge you need.</p>  <ul>  <li>Step-by-step video      demonstrations</li>  <li>Companion eBooks with detailed      instructions</li>  <li>Sample documents, spreadsheets,      presentations and images</li>  <li>Practice, Quizzes and      Skill Test</li> </ul>    <p>With this comprehensive, performance-based certification preparation online program, you can build and validate your business computer skills using Microsoft Word, Excel and PowerPoint 2013 software. You'll cover basic through advanced topics. </p>    <p>Upon completion, you'll be prepared to complete your college assignments and gain an important edge in today's competitive job market.</p>    <p><strong>The College Guide to Microsoft Office 2013 -Table of Contents </strong></p>  <p><strong>I. Beginning Microsoft Word</strong></p>  <p>•Format Text and Paragraphs</p>  <p>•Get skilled at working with Text and Pictures</p>  <p>•Use the Quick Click options and the mini Toolbar to format Text</p>  <p>•Gain experience editing images and shapes with the Picture Tools</p>  <p>•Use Templates and Quick parts to create professional documents</p>  <p><strong> </strong></p>  <p><strong>II. Intermediate Microsoft Word</strong></p>  <p>•Understand how to use and edit Templates to create documents and resumes</p>  <p>•Create a Web Page that uses a Table for consistent layout</p>  <p>•Use Microsoft Word Online </p>  <p><strong> </strong></p>  <p><strong>III. Advanced Microsoft Word</strong></p>  <p>•Learn effective methods for creating and formatting Tables</p>  <p>•Understanding Styles and how to use Styles to create a Table of Contents</p>  <p>•Apply professional document formatting including Headers and Footers, Citations and References</p>  <p>•Prepare to Share Documents by using the Proofing Tools</p>    <p><strong><br></strong></p><p><strong>IV. Beginning Microsoft Excel</strong></p>  <p>•Enter data and use basic text formatting in a spreadsheet</p>  <p>•Enter data, format labels and create formulas in a price sheet</p>  <p>•Use and audit formulas from Excel's formula library to calculate numbers, text, dates and financial payments</p>  <p>•Insert and modify Charts with the Chart Tools and the new Quick Click options</p>  <p>•Insert and format pictures in a spreadsheet</p>    <p><strong><br></strong></p><p><strong>V. Intermediate Microsoft Excel</strong></p>  <p>•Create formulas that use Relative and Absolute values and audit the formulas</p>  <p>•Use and modify TEXT formulas to combine cells (Concatenate) and format the data</p>  <p>•Create, use and troubleshoot Named Ranges and use Named Ranges in formulas</p>  <p>•Understand how to create and use Lookup Tables and use the IF functions</p>  <p>•Excel In Print: Use page Layout and Page Set up to modify print settings</p>  <p><strong></strong></p>  <p><strong><br></strong></p><p><strong>VI. BONUS Microsoft PowerPoint</strong></p>  <p>•Enter text and use basic text formatting in a presentation</p>  <p>•Format Pictures and apply Themes</p>  <p>•Use Videos and Animation in a Presentation</p>", 
    "end_date": null, 
    "title": "The College Guide to Microsoft Office 2013", 
    "price": "50.00", 
    "instructors": "Elizabeth Nofs", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/643230_3e7c_3.jpg", 
    "course_url": "https://www.udemy.com/the-college-guide-to-microsoft-office-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-17T12:35:47Z"
}