{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Get An Advanced Understanding of the Many Access 2013 Features That Will Enable You to Gather and Interpret Data Faster</strong>.</p><ul style=\"\"><li>Sorting Information and Running Queries</li><li>Creating Tables and Relationships</li><li>Designing Forms (+ Advanced Form Options)</li><li>Generating Reports</li><li>Splitting the Frontend and Backend</li><li>Macros</li><li>Visual Basic for Applications (VBA)</li></ul><p><strong style=\"\">Learn to Capture and Synthesize Information, Becoming a Data Management Guru.</strong></p><p>Being a data rock star is more important than ever. To stand out in the workplace, it&#039;s essential to be able to find information fast and to identify game-changing insights.</p><p>The Microsoft Access 2013 database can help you store and track a variety of information, such as inventory, contacts, or business processes. Logistically, it combines the relational Microsoft Jet Database Engine with a graphical user interface and software-development tools, and is a member of the Microsoft Office suite of applications, included in the Professional and higher editions, or sold separately.</p><p>It is a tool that spans across many fields and is helpful to anyone needing to tightly organize varied data: office managers, project managers, executive assistants, scientists, and busy families to list a few.</p><p><strong style=\"\">Contents and Overview</strong></p><p>Through 96 lectures, 19 hours of quality content, and 2 quizzes, this 19-hour class starts with the basics, teaching students to add and delete records to their database. Students then learn to create desktop databases and apps for multiple users before diving into importing data from other sources. </p><p>Budding Access 2013 users will be taught how to build forms to capture information online, and implement pre-designed templates that track projects, employees, issues, or task details. Students are then lead through protecting their databases with permissions, and learn - in detail - important safeguards and restrictions. The focus then turns to running reports that provide valuable business intelligence. </p><p>Practice files are built right into the curriculum, giving the student working knowledge of the program and building confidence for real-life application.</p><p>This course is appropriate for both those brand new to Microsoft Access or database technology, and for those who have been using Access for their entire career wanting to improve their data management skills. </p><p>          Students completing the course will learn all the functions needed to become a data rockstar, and will have the tools to potentially boost their team&#039;s efficiency and output immediately.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "The Ultimate Microsoft Access 2013 Training Bundle 19 Hours", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "19.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/109092_79c1_5.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-microsoft-access-2013-training-bundle/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-22T11:41:26Z"
}