{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This is a course about using Microsoft Office 365 on your PC, Mac, tablet, or Smartphone. It covers all of the mainstream applications that most schools and office environments demand: Word, Excel, Outlook, and PowerPoint. You'll also learn to use the exciting newer features of Office 365 including OneDrive, OneNote, and the new capabilities for publishing interactive content online, for free, without a website and without knowledge of web design. </p>\n\n<p>This not a course for people who want to specialize in computers, but rather for people who need to use a computer as part of their non-computer job or coursework. If you are frustrated in school or work due to insufficient Word, Excel, Outlook or PowerPoint skills, this course will serve you well. If you have access to Office 365 through school, work, or your personal computer, and you have basic computer skills like knowing how to click, drag, and right-click, then you have what it takes to succeed in this course. </p>\n\n\n\n\n\n<p>All lessons are video tutorials, averaging about 10 minutes each, that are easy to understand and follow. Practice activities and hands-on exercises give you the experience you need to master the most essential skills you need to master these important apps. And the new cloud-oriented approach found in Office 365 makes it easier to access all your Office files using your favorite computers, laptops, tablets, and phones. So all your information is just a few clicks or taps away. You can also share or publish your documents online for free.</p>\n\n\n\n<p>You'll also learn all the new ways that Office 365 allows you to easily publish online, for free, through Docs.com, Mix, Sway, and OneDrive, even if you know nothing about web design. You'll even discover ways to convert business cards and written documents to editable, searchable files and Outlook contacts.</p>\n\n\n\n<p>\n\nThis course is taught by award-winning author and instructor Alan Simpson who has been called a \"mastered communicator\" and whose courses always generate rave reviews from non-computer people and computer experts alike.</p>", 
    "end_date": null, 
    "title": "The Best of Office 365: The Complete Crash Course", 
    "price": "25.00", 
    "instructors": "Alan Simpson", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705100_b917_2.jpg", 
    "course_url": "https://www.udemy.com/easy-office-365/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-23T18:07:24Z"
}