{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Master the Ins and Outs of Microsoft Visio and Create Incredible Diagrams.</strong> </p><p style=\"\"> The <strong style=\"\">Ultimate Microsoft Visio 2010 and 2013 Training Bundle </strong>contains training courses for both Visio 2010 and Visio 2013, so that no matter what version you&#039;re faced with you have the skills to keep up. The course is designed for individuals and office professionals who need to master the capabilities of Microsoft Visio 2010 or Visio 2013.</p><p style=\"\"> <strong style=\"\">Courses included with this 19 hour training bundle:</strong></p><p style=\"\"><strong style=\"\">Master Microsoft Visio 2013 Training</strong><strong style=\"\"></strong></p><p style=\"\">In <em style=\"\"><strong style=\"\">Master Microsoft Visio 2013</strong></em>, get up to speed using Microsoft&#039;s handy diagramming program. Great for building both org charts and flowcharts, Visio 2013 is a simple way to map out technology assets, process enhancements, networks, and other business functions. It&#039;s also an ideal way to generate seating charts and floor plans for events. </p><p style=\"\">The course is designed for individuals and office professionals who need to master the capabilities of the latest edition of Microsoft Visio.</p><p style=\"\">Through over 10 hours of video lectures, exercise files, and an optional quiz, you&#039;ll learn everything you need to know to create sophisticated Visio diagrams using Visio 2013.</p><p style=\"\">Find out how to manipulate and connect shapes, add pictures, and ensure perfect object alignment. Discover how to create sophisticated diagrams that impress your clients and co-workers and make you look like a diagramming pro. </p><p style=\"\">When you complete this course, you&#039;ll be well on your way to becoming a master of using Visio with the tools available in Microsoft Visio 2013.</p><p style=\"\"><strong style=\"\">Master Microsoft Visio 2010 Training</strong></p><p style=\"\"> In <strong style=\"\"><em style=\"\">Master Visio 2010 </em></strong>by Simon Sez IT, get up to speed on Microsoft&#039;s handy diagramming program. Great for building org charts and flowcharts, Visio 2010 is a simple way to map out technology assets, process enhancements, networks, and other business functions. It&#039;s also an ideal way to generate seating charts and floor plans for events. </p><p style=\"\"> Perfect for those seeking Microsoft Visio 2010 training or anyone looking to deepen their Visio knowledge, the Microsoft Visio 2010 training course provides 9 full hours of expert quality training videos. Find out how to manipulate and connect shapes, add pictures, and ensure perfect object alignment. Discover how to create sophisticated 2D images that impress your clients and co-workers and make you look like a diagramming pro. </p><p style=\"\">All of our videos are high-definition videos, therefore, they are <strong style=\"\">best viewed with the HD setting on</strong>, and the videos enlarged.</p>", 
    "end_date": null, 
    "title": "The Ultimate Microsoft Visio 2010 & 2013 Bundle - 19 Hours", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "19.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/518910_9801_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-visio-2010-and-2013-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T09:00:56Z"
}