{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \tMicrosoft Project can take any managers skills up to the next level, simplifying the process of running a project, and keeping track of every last detail. There’s no better tool out there to make sure that you stay on-schedule and on budget. Whether you’re a manager looking to improve your skills or are looking to develop management skills for the sake of a promotion, mastery of Microsoft Project is invaluable.  </p>  <p style=\"\">  \tOur <strong style=\"\">Ultimate Microsoft Project Training 2010 Course </strong>contains beginner and advanced courses for Project 2010, so that no matter what version you’re faced with, you’ll have the skills to keep up.  </p>  <p style=\"\">  \tThis bundle includes:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"><em style=\"\">17 hours</em></strong><em style=\"\"> of video tutorials</em></li>  \t<li style=\"\"><strong style=\"\"><em style=\"\">77 individual video lectures</em></strong></li>  \t<li style=\"\"><em style=\"\">Optional <strong style=\"\">quizzes</strong> to test what you&#039;ve learned</em></li>  \t<li style=\"\">C<em style=\"\">ertificate of completion</em></li>  </ul>  <p style=\"\">  \t<strong style=\"\">Courses Included with this Bundle:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Learn Microsoft Project 2010</strong>  </p>  <p style=\"\">  \tDuring the <em style=\"\">Learn Microsoft Project 2010</em> video training course, your professional trainer guides you through project management topics such as task creation, resource management, cost tracking, using WBS codes, critical path reporting and more.  </p>  <p style=\"\">  \tDiscover the building blocks of a project. You’ll start with information gathering and documentation, and when you feel comfortable with those elements, you will move on to the basics of tasks and resources. Get detailed step-by-step guidance on how to assign and allocate resources. Learn to document a project as you go by properly defining costs and adding notes—enabling full traceability.  </p>  <p style=\"\">  \t<strong style=\"\">Learn Microsoft Project 2010 - Advanced</strong>  </p>  <p style=\"\">  \tLearn the value of defining costs up front—baselining the costs so you can track them. Evaluate the project as you go from a detached view to determine resourcing problems. Through this Advanced Course, you’ll gain a deep understanding of how to assign, level, and divert resources so you can overcome resource problems and keep the project moving forward.  </p>  <p style=\"\">  \tThrough Learn Microsoft Project 2010 Advanced, you will also discover how to divide a project into parts and combine them when necessary. You will learn how to create links and dependencies between projects and share resources. Finally, you will discover how to maximize critical tools: customization, macros, views, VBA, writing code, creating new macros, and importing and exporting.  </p>  <p style=\"\">  \t<strong style=\"\">What people are saying:</strong>  </p>  <p style=\"\">  \t<em style=\"\">“Excellent course overall, well worth investing time and money on. I recommend that participants practice many of the techniques learned on this Basic/Intermediate course before moving on to the Advanced course.”</em><strong style=\"\"> - J. Burns</strong>  </p>  <p style=\"\">  \t<em style=\"\">“I was a constant user of MS Project 2007 and was trying to make the leap into MS Project 2013. This course provided a great foundation from which to get comfortable with the new layout of the software plus to utilize the enhanced functionality.</em><strong style=\"\"> - J. Humphrey</strong>  </p>  <p style=\"\">  \t<em style=\"\">“Everything are well explained, enrich with practice files ready to play along. Starting with the basics up to tricky Gantt Chart problems and more.”</em><strong style=\"\"> - Arif N.</strong>  </p>  <p style=\"\">  \t&quot;<em style=\"\">Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.</em>&quot;<br style=\"\">  \t <strong style=\"\">- TopTenReviews.com</strong>  </p>  <p style=\"\">  \t<em style=\"\">“This course was great very informative and easy to follow.”<strong style=\"\"> Joann Bell</strong></em>  </p>", 
    "end_date": null, 
    "title": "The Ultimate Microsoft Project 2010 Training Course 17 Hours", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "17 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/241608_0413_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-microsoft-project-2010-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-11T18:39:01Z"
}