{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>The Business Guide to Microsoft Office  </strong></p><p>If you wish to be effective and efficient at work, this course will help you build the skills and knowledge you need.</p>  <ul>  <li>Step-by-step video demonstrations</li>  <li>Companion eBook with detailed      instructions</li>  <li>Sample documents and images</li>  <li>Practice, Quizzes and Skill Tests</li> </ul>    <p><strong>All materials for this program are available online. </strong>The following textbooks are available to download throughout the lessons:</p>  <ul><li><em>Beginning Guide to Microsoft® Word 2013</em></li><li><em>Intermediate Guide to Microsoft® Word 2013</em></li><li><em>Advanced Guide to Microsoft® Word 2013</em></li><li><em>Beginning Guide to Microsoft® Excel 2013</em></li><li><em>Intermediate Guide to Microsoft® Excel 2013</em></li><li><em>Advanced Guide to Microsoft® Excel 2013</em></li><li><em>Beginning Guide to Microsoft® PowerPoint 2013</em></li><li><em>Advanced Guide to Microsoft® PowerPoint 2013</em></li></ul>                  <p>With this comprehensive, performance-based certification preparation online program, you can build and validate your business computer skills using Microsoft Office 2013 software. You'll cover basic through advanced topics. Upon completion, you'll be prepared to earn your certification and gain an important edge in today's competitive job market.</p>  <p><strong>In Microsoft Word, you will cover important topics, including how to:</strong></p>  <ul><li>Format Text and Paragraphs</li><li>Get skilled at working with Text and Pictures</li><li>Learn how to create and format SmartArt</li><li>Understand how to use and edit Templates to create documents and resumes</li><li>Create a Mail Merge that sends a personalized invitation to each recipient </li><li>Learn how to select the Mail Merge recipients and troubleshoot errors</li><li>Create a Web Page that uses a Table for consistent layout</li></ul>    <p><strong>In Microsoft Excel, you will cover business topics, including how to:</strong></p>  <ul><li>Create formulas that use Relative and Absolute values and audit the formulas</li><li>Use and modify TEXT, DATES and FINANCIAL data with formulas </li><li>Create, use and troubleshoot Named Ranges and use Named Ranges in formulas</li><li>Understand how to create and use Lookup Tables and use the IF functions</li><li>Excel In Print: Use page Layout and Page Set up to modify print settings</li></ul>    <p><strong>In Microsoft PowerPoint, you will learn how to:</strong></p>  <ul><li>Know how to work with Text Boxes, Format Shapes and apply Themes</li><li>Insert, format and adjust Pictures with the Picture Tools</li><li>Insert and format Shapes and SmartArt to create an effective presentation</li><li>Use Tables and Spreadsheets to display data in a presentation</li><li>Learn how to add, format and edit Charts with the Chart Tools and Quick Clicks</li><li>Learn how to design Slide Masters and apply slide Transitions</li><li>Apply Animations to images in a slide show and edit the timing</li></ul>    <p><br></p><p><strong>Microsoft Office Specialist (MOS) certification</strong> is the globally recognized standard for validating expertise with the Microsoft Office Suite. If you wish to prepare for <strong>Microsoft</strong> <strong>Certification Exams </strong>this course will help you build the skills and knowledge you need.</p>  <strong>This course teaches the objectives for the following certification tests:</strong><br> Core Certification: Pass any 1 test: <br> <u>Word 2013 Core: Exam 77-418</u> <br> <u>Excel® 2013 Core: Exam 77-420</u> <br> <u>PowerPoint® 2013: Exam 77-422</u><br>", 
    "end_date": null, 
    "title": "The Business Guide to Microsoft Office", 
    "price": "50.00", 
    "instructors": "Elizabeth Nofs", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676686_2209.jpg", 
    "course_url": "https://www.udemy.com/the-business-guide-to-microsoft-office/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T18:47:59Z"
}