{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Master the Ins and Outs of Microsoft Excel 2013 and Automate Repetitive Tasks</strong></p><p><strong>Contents and Overview</strong></p><p>The course is designed for individuals and office professionals who need to master the capabilities of Microsoft Excel 2013. The course also includes advanced level training  for individuals and professionals who are new to VBA (Visual Basic for Applications) and who are seeking practical ways to automate tasks in Microsoft Excel that are performed frequently.</p><p>Through 23 hours of video lectures and 3 quizzes, you'll learn the essentials with these 3 popular courses:</p><ul><li>Excel 2013 Beginning/Intermediate: Create basic spreadsheets and use formulas for tracking expenses.</li><li>Excel 2013 Advanced: Learn complex formulas and perform data analysis on your organization's revenue and expense patterns.</li><li>VBA for Excel: Discover how to help automate time-consuming procedures in Excel.</li></ul><p>When you complete this course, you'll be well on your way to becoming a master with Microsoft Excel 2013.</p><p> This bundle includes: </p> <ol><li><strong>23 hours of video</strong> tutorials</li><li>Over <strong>130 individual video lectures</strong></li><li><strong>Exercise files </strong>to practice what you've learned<strong></strong></li><li><strong>3 optional quizzes with <strong>100+ test questions</strong></strong><strong></strong><strong></strong></li><li>Certificate of completion</li></ol> <p> <strong>Courses included with this Bundle:</strong> </p><p> <strong>Microsoft Excel 2013 Beginners/Intermediate Training</strong> </p><p> During this 10-hour <strong>Online Excel 2013 Training</strong>, you'll learn to create Excel spreadsheets with ease. Our expert instructor will show you Excel 2013 features to navigate you through the program. Starting with the basics, you'll discover how to enter and format data in the quickest manner possible. Next you'll be introduced to the power of Excel's functions and formulas to help you calculate data and derive useful information. To help you present it all in a visually appealing format, your instructor will then walk you through how to create sophisticated charts and graphs, and publish them online. Finally, you'll learn to analyze and review worksheets for data discrepancies so you can prevent problems before they arise. </p><p> Turn your long lists of numbers into slick, engaging visuals that bring data to life. Whether you need to create budgets, financial projections, invoices, calendars, schedules, or lists, our elaborate Excel 2013 Tutorial will give you the skills you need to stand out at work. </p><p> <strong>Learn Microsoft Excel 2013 – Advanced</strong> </p><p> <strong></strong>Colorful charts, sleek graphs, and cutting-edge databases that offer insight into financial information are a breeze when you learn the secrets of creating sophisticated spreadsheets in our <em>Learn Excel 2013 – Advanced</em> course. That's because you'll get the tools you need to master Excel's powerful data functions in this information-packed 9-hour video training class. </p><p> Your expert instructor will kick the course off by leading you through graph and chart basics. Then, you'll explore Excel's array of detailed formatting tools and discover how to make these work for you when graphing and charting financial information. Next, you'll explore the roles played by trends, relationships, and differences in charts, and how to work with sparklines for data visualization and data bars. The course will also take you through detailed discussions of pivot tables, bubble charts, radar charts, and more. </p> <strong><strong>Essential VBA Training for Excel - Automate Repetitive Tasks</strong><em><strong></strong></em></strong><p>Great for automating repetitive tasks and operations that you perform frequently, VBA is a powerful tool to increase your productivity. </p><p><strong></strong>The course is designed for individuals and professionals who are new to VBA and who are seeking practical ways to automate tasks in Microsoft Excel that are performed frequently.</p><p>Through 4 hours of video lectures, exercise files, and an optional quiz, you'll learn the essentials you need to know to create powerful macros using VBA for Excel.</p><p>Find out how to use the VBA editor, VBA syntax, keywords, and comments. </p><p>Discover how to define and manage variables, set up subroutines, and create functions.</p><p>Also, find out how to use input boxes and message boxes to interact with end users.</p><p>Learn practical methods for using macro errors to improve your VBA code.</p><p>When you complete this course, you'll be well on your way to using VBA macros in Excel to help you and others automate tasks and operations performed frequently.</p><p> <strong><strong>What people are saying:</strong></strong> </p><p> <em>\"I am now a business analyst and I attribute my promotion directly to your courses. I'm much more savvy and confident with Excel. Thanks Simon.\"</em>- <strong>Daniel Venti</strong> </p><p> \"<em>Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.</em>\"<strong><strong>- Top Ten Reviews</strong></strong></p><p><em>\"Generally I wouldn't find this type of course all that interesting. However, I have found in my current job search that it is a necessary part of my tech skill set in which to become proficient. So, I'm very appreciative that courses like this are offered, and taught by an extremely knowledgeable instructor, who explains lessons clearly and offers opportunities to practice the theme which he has just gone over. He was thorough, and not in the least bit condescending, which I can't say for instructors I have had in the past. So, thank you.\"</em><strong>- Mary Price</strong></p><p> <em><strong><strong>\"</strong></strong>This is a fantastic intro to the advanced operations in Excel 2013.\"</em><strong>- Terril Wright</strong> </p><p> <em>\"This is the one....Simon Sez IT has always been my favorite. Excellent contribution by the author. The lectures are informative and engaging. Style of teaching is enterprising.\"</em><strong>- Jay Dhruv</strong></p><p> <strong></strong><em>\"The best beginners course out there. Very easy to follow, throughout and detailed explanation to each function and step shown in the process. Ideal learning curve for the total Excel newbie like me.\"</em><strong>- Daniel Salwerowicz</strong></p><p> <strong><em>\"</em></strong><em>Excellent course.<strong> </strong>I have some experience with Excel but this course really helped me know the functions available in it and how to use them. The instructor explains the subject very patiently and clearly so the student can follow along and master the details. Production quality was good.\"</em><strong>- Vikram Hegde</strong></p><p> <strong></strong><em>\"Excellent course (VBA course). Absolutely helpful course designed to guide you step by step through basic and advanced VBA code. Very well structured. Instructor sounds calm and competent. Easy to follow the course if you take your time. Exercises are challenging and helpful. Can highly recommend taking this course.\"</em><strong>- Oliver</strong></p>Our videos are high definition; therefore, they are <strong>best viewed with the HD setting on</strong> and the videos enlarged.", 
    "end_date": null, 
    "title": "The Complete Excel 2013 Course for Beginners: Learn by Doing", 
    "price": "35.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "23.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/558676_15e3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-2013-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-19T14:27:56Z"
}