{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Master the Ins and Outs of Microsoft Office and Boost Your Office’s Productivity.</strong>  </p>  <ul style=\"\">  \t<li>Spreadsheets with Excel 2013</li>  \t<li>Documents with Word 2013</li>  \t<li>E-mail with Outlook 2013</li>  \t<li>Presentations with PowerPoint 2013</li>  \t<li>Databases with Access 2013</li>  \t<li>Print Publications with Publisher 2013</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Make Your Office More Efficient with Microsoft’s Premier Office Management Software</strong>  </p>  <p style=\"\">  \t  Whether you need to create a spreadsheet for data analysis, a database of customer contacts, or a brochure that outlines the strengths and appeal of your organization, Microsoft Office is the choice of many office professionals. Enjoy significant control over your calendar and communication with Outlook or create engaging presentations with PowerPoint.  </p>  <p style=\"\">  \t  Many people are aware of the basics of what Office can do, but learning the more advanced capabilities of the programs in Office gives you greater flexibility and opportunities for creativity. Microsoft Office is designed to make accomplishing office tasks easier and more efficient.  </p>  <p style=\"\">  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p style=\"\">  \t  The course is designed for individuals and office professionals who need to master the capabilities of the latest edition of Microsoft Office.  </p>  <p style=\"\">  \t  Through over 71 hours of video lectures and 8 quizzes, you’ll learn everything you need to know to make your office run more efficiently with Office 2013.  </p>  <ul style=\"\">  \t<li>Excel 2013 Beginning/Intermediate: Create basic spreadsheets and use formulas for tracking expenses.</li>  \t<li>Excel 2013 Advanced: Use complex formulas and perform data analysis on your organization’s revenue and expense patterns.</li>  \t<li>Word 2013: Create documents, embed videos, and set up for online collaboration for joint projects for school or work.</li>  \t<li>Outlook 2013:  Gain control of your inbox and avoid accumulating hundreds of unanswered emails.</li>  \t<li>PowerPoint 2013: Make slick presentations for your next business meeting using animation, audio/video, and collaborative tools.</li>  \t<li>Access 2013 For Beginners and Access 2013 Advanced: Become a master of data management, tracking customer information and buying patterns.</li>  \t<li>Publisher 2013: Create professional looking print publications to communicate the strengths and purpose of your organization.</li>  </ul>  <p style=\"\">  \t  When you complete this course, you’ll be well on your way to becoming a master at workplace efficiency with the tools available in Microsoft Office 2013.  </p>", 
    "end_date": null, 
    "title": "The Ultimate Microsoft Office 2013 Training Bundle 71 Hours", 
    "price": "50.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "71.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107342_1746_6.jpg", 
    "course_url": "https://www.udemy.com/microsoft-office-2013-training-courses/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-17T21:49:34Z"
}