{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Learn Project 2013 Inside and Out with This Training Bundle.</strong></p><ul><li>Deepen Your Knowledge and Master More Advanced Skills</li><li>Learn to Create and Trace Critical Paths</li><li>Effectively Split Work Into Sub-Projects</li><li>Consolidate Multiple Projects</li></ul><p><strong>Keep Track of Projects from Start to Finish With Microsoft's Comprehensive Program</strong></p><p>Microsoft Project is the Microsoft corporation's project management software. It is part of Microsoft Office but is not automatically included in the Microsoft Office Suite, which includes Word, PowerPoint, and Excel. Project is available in a standard version as well as a professional version, which includes more advanced features and capabilities.</p><p>Over the years since its initial development, Project has become one of the most widely used project management software in existence. It provides assistance to project managers and overseers by organizing plans, resources, tasks, budgets, workloads, and much more, while keeping track of a project's overall progress from start to finish. Knowledge of Microsoft Project can be an invaluable tool for anyone whose work requires the orchestration of long-term projects and plans.</p><p><strong>Contents and Overview</strong></p><p>This course is perfect for those who are familiar with Microsoft Project 2013 or previous versions, with access to the software, who would like to expand their understanding by mastering more advanced and useful skills within the program. Students of this Simon Sez IT software training course will learn all they need to know about Microsoft Project in order to organize and complete long-term projects and achieve career goals.</p><p>Over the course of 104 lectures and more than nineteen hours of video lectures, you will learn to use this management tool to plan, organize, and keep track of projects in a timely and comprehensive manner.</p><p><strong>Content Covered:</strong></p><ul><li>Designing Custom Projects and Templates</li><li>Integrating Data into Compelling Reports</li><li>Tracing Task Paths</li><li>Communicating within the Project interface</li><li>Exporting Work to Other Microsoft Programs</li><li>Sharing Information in the Cloud</li><li>Keeping Track of Cost Management</li><li>Creating Project Reports</li><li>Using Earned Value Analysis</li><li>Customizing Your Workspace</li></ul><p>You will have mastered both basic and advanced Project features, and you will possess the skills you need to use Microsoft Project 2013 to its full potential, saving you time and money and contributing to your professional success.</p>", 
    "end_date": null, 
    "title": "The Ultimate Microsoft Project 2013 Training Bundle 19 Hours", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "18.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/109814_a9f9_5.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-microsoft-project-2013-training-bundle/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-23T20:52:01Z"
}