{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t    Microsoft Excel is, by a long way, the most widely-used spreadsheet software out there, and the 2013 edition is the most powerful and versatile version yet. Packed with new features and design changes, Microsoft Excel 2013 has plenty to offer for any company.  </p>  <p>  \t    Whether you're new to Excel, or just looking to update your knowledge to the latest version, you'll find that the <strong>Ultimate Microsoft Excel 2013 Training Bundle </strong>will help you put together stunning and impressive spreadsheets with ease, helping you to stand out in the workplace and impress your boss.  </p>  <p>  \t This bundle includes:  </p>  <ol>  \t<li><strong>19.5 hours of video</strong> tutorials</li>  \t<li>Over <strong>100 individual video lectures</strong></li>  \t<li><strong>2 quizzes</strong> with <strong>90 test questions</strong></li>  \t<li>Certificate of completion</li>  </ol>  <p>  \t<strong>Courses included with this Bundle:</strong>  </p>  <p>  \t<strong>Microsoft Excel 2013 Beginners/Intermediate Training</strong>  </p>  <p>  \t    During this 10-hour <strong>Online Excel 2013 Training</strong>, you'll learn to create Excel spreadsheets with ease. Our expert instructor will show you Excel 2013 features to navigate you through the program. Starting with the basics, you'll discover how to enter and format data in the quickest manner possible. Next you'll be introduced to the power of Excel's functions and formulas to help you calculate data and derive useful information. To help you present it all in a visually appealing format, your instructor will then walk you through how to create sophisticated charts and graphs, and publish them online. Finally, you'll learn to analyze and review worksheets for data discrepancies so you can prevent problems before they arise.  </p>  <p>  \t    Turn your long lists of numbers into slick, engaging visuals that bring data to life. Whether you need to create budgets, financial projections, invoices, calendars, schedules, or lists, our elaborate Excel 2013 Tutorial will give you the skills you need to stand out at work.  </p>  <p>  \t<strong>Learn Microsoft Excel 2013 – Advanced</strong>  </p>  <p>  \t<strong></strong>Colorful charts, sleek graphs, and cutting-edge databases that offer insight into financial information are a breeze when you learn the secrets of creating sophisticated spreadsheets in our <em>Learn Excel 2013 – Advanced</em> course. That's because you'll get the tools you need to master Excel's powerful data functions in this information-packed 9-hour video training class.  </p>  <p>  \tYour expert instructor will kick the course off by leading you through graph and chart basics. Then, you'll explore Excel's array of detailed formatting tools and discover how to make these work for you when graphing and charting financial information. Next, you'll explore the roles played by trends, relationships, and differences in charts, and how to work with sparklines for data visualization and data bars. The course will also take you through detailed discussions of pivot tables, bubble charts, radar charts, and more.  </p>  <p>  \tWhere else can you find so many extra tools to help you gain advanced skills in Excel 2013?!?!<strong></strong>  </p>  <p>  \t<strong></strong>So start learning today.<strong></strong></p><p><strong>What people are saying:</strong><strong></strong>  </p><p> <em>\"I am now a business analyst and I attribute my promotion directly to your courses. I'm much more savvy and confident with Excel. Thanks Simon.\"</em>- <strong>Daniel Venti</strong> </p><p> \"<em>Simon Sez IT is one of the best resources if you are looking for Microsoft Office tutorials.</em>\"<strong><strong>- Top Ten Reviews</strong></strong></p><p><em>\"Generally I wouldn't find this type of course all that interesting. However, I have found in my current job search that it is a necessary part of my tech skill set in which to become proficient. So, I'm very appreciative that courses like this are offered, and taught by an extremely knowledgeable instructor, who explains lessons clearly and offers opportunities to practice the theme which he has just gone over. He was thorough, and not in the least bit condescending, which I can't say for instructors I have had in the past. So, thank you.\"</em><strong>- Mary Price</strong></p><p> <em><strong><strong>\"</strong></strong>This is a fantastic intro to the advanced operations in Excel 2013.\"</em><strong>- Terril Wright</strong> </p><p> <em>\"This is the one....Simon Sez IT has always been my favorite. Excellent contribution by the author. The lectures are informative and engaging. Style of teaching is enterprising.\"</em><strong>- Jay Dhruv</strong></p><p> <strong></strong><em>\"The best beginners course out there. Very easy to follow, throughout and detailed explanation to each function and step shown in the process. Ideal learning curve for the total Excel newbie like me.\"</em><strong>- Daniel Salwerowicz</strong></p> <strong><em>\"</em></strong><em>Excellent course.<strong> </strong>I have some experience with Excel but this course really helped me know the functions available in it and how to use them. The instructor explains the subject very patiently and clearly so the student can follow along and master the details. Production quality was good.\"</em><strong>- Vikram Hegde</strong><p>  \t<strong>Note: </strong>All videos are high-definition and are therefore best viewed enlarged and with the <strong>HD setting on.</strong>  </p>", 
    "end_date": null, 
    "title": "The Ultimate Microsoft Excel 2013 Training Bundle - 19 Hours", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "19.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107606_ce50_5.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-microsoft-excel-2013-training-bundle/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-18T17:50:36Z"
}