{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t    The old 80/20 rule for software—that 80% of a program’s users use only 20% of a program’s features—doesn’t apply to Microsoft Excel. Instead, this program probably operates under what could be called the 95/5 rule: <strong style=\"\">Ninety-five percent of Excel </strong><strong style=\"\">users use a mere 5% of the program’s power!</strong>  </p>  <p>  \t    On the other hand, most people know that they could be getting more out of Excel if they could only get a leg up on building formulas and using functions. Unfortunately, this side of Excel appears complex and intimidating to the uninitiated, shrouded as it is in the mysteries of mathematics, finance, and impenetrable spreadsheet jargon.  </p>  <p>  \t<strong style=\"\">Here&#039;s the good news!</strong>  </p>  <p>  \t    I have designed this practical course to give you the ability to master the <strong style=\"\">Top 25 Microsoft Excel formulas with real world examples, by demystifying the building of worksheet formulas, and presenting the most useful Excel functions in an accessible and jargon-free manner</strong>. In this tutorial, you will be able to learn important functions such as:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Financial</strong></li>  \t<li style=\"\"><strong style=\"\">Logical</strong></li>  \t<li style=\"\"><strong style=\"\">Text</strong></li>  \t<li style=\"\"><strong style=\"\">Lookup &amp; Reference, and many more</strong></li>  </ul>  <p>  \t    I have included few bonus tutorials at the end of the course as well:  </p>  <ol style=\"\">  \t<li style=\"\">Modifying templates and styles</li>  \t<li style=\"\">Copying macros between workbooks</li>  \t<li style=\"\">Working with external data</li>  \t<li style=\"\">Tracking changes in Excel 2013</li>  </ol>  <p>  \t    The entire objective of this course is to dive deep into the Excel 2013 environment with regards to formulas in in order to<strong style=\"\"> make you more productive, efficient, and achieve a greater skillset! </strong>  </p>  <p>  \t<strong style=\"\">To top it off: If you would like me to explain a particular formula of your choice, I would be delighted to create a hands-on tutorial - just for you!</strong>  </p>  <p>  \t    With that said, this course will enhance your comfort level working with advanced formulas in Excel 2013. <strong style=\"\">The concepts learned in this course apply to Excel 2007 and 2010 versions of Microsoft Excel as well</strong>. So, enroll now and take your skills to the next level.  </p>  <p>  \t<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Top 25 Microsoft Excel Advanced Formulas: Hands-on Tutorial", 
    "price": "20.00", 
    "instructors": "Syed Raza", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419944_8e26_10.jpg", 
    "course_url": "https://www.udemy.com/top-25-microsoft-excel-advanced-formulas-hand-on-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T06:20:03Z"
}