{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">With this Excel training course you will get a State of the Art introduction to Microsoft Excel 2013. Learning how to use Microsoft Excel has never been more important. No matter what job you have, creating good Excel spreadsheets is a requirement in most jobs, not a bonus. Everything becomes more data driven and creating functional Excel spreadsheet is required for this. This Microsoft Excel training course is here to help, even if you have never used Excel before. This Excel training is a comprehensive course which can be taken by beginners as well as advanced users.</p><p style=\"\">This Excel Course takes a beginner with no prior Microsoft Excel knowledge as well as intermediate users from the basics of Microsoft Excel 2013 into deeper and more advanced functions of this powerful spreadsheet software. Based on the Microsoft Excel Version 2013 and 2010 you will be able to use the most important and frequently used functions for analyzing business and research data. This Excel Training Course is specifically designed for a practical use and illustrates all concepts with easy to follow examples and exercises that you can complete yourself in order to apply what you have learned in this excel course.</p><p style=\"\">What will you learn in this Excel course?</p><p style=\"\">You will learn to apply the best practices of analyzing and displaying data in an easy and understandable way. If you want to learn excel from the ground up and want to know all the functions that you will need 90% of the time then this Excel course is for you. With a clear explanation, many examples and the possibility to try out everything for yourself this Excel training course will accelerate your learning curve significantly.</p><p style=\"\">If you are a more advanced user you can use this Excel training course as a reference guide. Because of its detailed structured you will be able to look up certain functions and refresh your memory on how to use them very quickly.</p><p style=\"\">Once you have completed this Excel training course, you will be able to harness the power of Microsoft Excel and take boring data, analyze it properly and display it so that it is easily understandable.</p><p style=\"\">All working files are included, allowing you to follow along throughout the lessons.</p>", 
    "end_date": null, 
    "title": "Ultimate Microsoft Excel Course - Beginner to Expert in 5h", 
    "price": "20.00", 
    "instructors": "Jan Marc", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/272702_e155_4.jpg", 
    "course_url": "https://www.udemy.com/excel-training-course-ultimate-ms-microsoft-excel-2013-online-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-01T05:50:21Z"
}