{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Join this course to learn some of the best quick tips that the Microsoft Office Suite has to offer. </strong></p><p><strong>**********************************************************************************************************</strong></p><p>Due to the popularity of this course,<strong> I have added 6 additional tips on how you can boost your productivity in the Microsoft Office suite</strong>. These additional tips have come from requests made by students of this course. Tools that these students are interested in learning more about and ultimately boosting their own productivity. So keep an eye out for the bonus lectures beyond the 8 original lectures.</p><p><strong>**********************************************************************************************************</strong></p><p>With each new release of Microsoft Office, Microsoft adds more tools to streamline your work and help you become more productive. During this course I will introduce you to 14 of the best, quick tips that the Microsoft Office Suite has to offer in <strong>Excel, Word, PowerPoint and Outlook (+ bonus tips)</strong>.</p><ul><li>Each of the video lectures contained in this course are short, 2-3 minute clips, and impactful</li><li>Lectures and simple to understand and apply</li><li>Take the tips learned and immediately begin to use them everyday</li><li>Exercise files are provided to immediately practice the material for each lecture</li></ul><strong><p><br></p></strong><p><strong>Quick, enroll now and learn the hottest features of Microsoft Office that will propel your Microsoft Office skills to new heights.</strong></p>", 
    "end_date": null, 
    "title": "Ultimate Microsoft Office Productivity Tips ", 
    "price": "20.00", 
    "instructors": "Kyle Pew", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/685216_af80_2.jpg", 
    "course_url": "https://www.udemy.com/boost-productivity-with-8-simple-tips-from-microsoft-office/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-30T18:23:02Z"
}