{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t                      This two-hour Excel crash course is the quickest way to go from spreadsheet rookie to rockstar. It's an accelerated 'learn-by-doing' approach: we'll solve a business problem by designing a model, collecting data and building a spreadsheet. Along the way, we'll cover the keyboard shortcuts, functions and insider 'best practices' to make your spreadsheets sizzle!  </p>  <p>  \t<strong>Who is this for?</strong>  </p>  <p>  \t                     Anyone who has to build Excel models from scratch. If you fall into one of these groups, this course will suit you particularly well:  </p>  <p>  \t             - Business professionals (consultants, analysts, marketers etc) <br> \t        - Students using Excel to analyze data or entering business careers <br> \t        - Entrepreneurs who use Excel to run their startups, to analyze opportunities and to present to investors  </p>  <p>  \t<strong>What makes this course different?</strong>  </p>  <p>  \t             - It's practical. The instructor has worked in consulting for eight years. That's a lot of Excel. His practical knowledge of how to use Excel in real life, as well as pitfalls and traps to avoid, will save you hundreds of hours of spreadsheet anxiety  </p>  <p>  \t             - It's fast; only two hours. And we believe the quality bar is higher than any other course out there (leave a review to let us know if we are right!)  </p>  <p>  \t             - It uses the 'case-method' pedagogy. By teaching in the context of a real example, retention is significantly higher than a traditional 'formula-led' approach  </p>  <p>  \t<strong>Discounts?</strong>  </p>  <p>  \t  Check out Kieran's blog for periodic coupon codes  </p>", 
    "end_date": null, 
    "title": "Use Excel Like A Pro. Fast.", 
    "price": "50.00", 
    "instructors": "Kieran Luke", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/109436_f634_12.jpg", 
    "course_url": "https://www.udemy.com/use-excel-like-a-pro-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-23T04:41:12Z"
}