{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t This video based SharePoint 2013 training course from Infinite Skills shows you how to utilize SharePoint and get the most out of the program. With SharePoint, you are able to create, manage, store, and retrieve information for yourself or your company. This course is an introduction to SharePoint, meaning no experience with the software is needed to benefit from the tools and techniques you will learn.  </p>  <p>  \t <br>  \t You will start out by navigating the user interface and personalizing SharePoint. From there, you will learn how to understand information in SharePoint lists. Erin will teach you how to sort and filter content, upload and create library items, and how to secure content within SharePoint. You will learn how to use document management features, which is one of SharePoint's most popular uses. In this training course, you will work with lists, wikis, blogs, My Site, SkyDrive Pro, and Office applications. Finally, you will learn about SharePoint's social networking and how you can discover colleagues.<br>  \t <br>  \t By the completion of this video based training course, you will have a solid understanding of how to use SharePoint and its many useful features. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Using Microsoft SharePoint 2013 - A Comprehensive Guide", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/100124_05dc_9.jpg", 
    "course_url": "https://www.udemy.com/using-microsoft-sharepoint-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-01T18:39:41Z"
}