{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>VBA Intermediate Instruction - Become the Office VBA/Excel Expert</strong></p>  <p><strong> </strong></p>    <ul><li>Learn advanced methods for automating tedious Excel jobs</li><li>The next step for anyone who has completed basic VBA  </li><li>Exercise files to practice what you learn</li><li>Optional quiz to test what you've learned</li><li>Advanced VBA Language Details in easy-to-learn form  </li><li>Learn vital Event Patterns</li><li>Extensive discussion of Custom Object possibilities  </li><li>Successfully interfacing with Excel</li><li>Working with References and Libraries    </li></ul><p><strong>More Advanced Intermediate Discussion of VBA</strong></p>    <p>You've completed the beginner course in VBA - or you've used VBA in your personal life or at work. You know your way around this incredibly helpful Visual Basics for Applications that is always associated with power driving MS Excel. You understand how VBA can automate BIG Excel tasks so they can be done quickly, making you look like the office genius. Hey, nothing wrong with that!</p>    <p>Now challenge yourself with the next logical step. Intermediate VBA is the learner friendly course that steps you through powerful, more advanced features and possibilities of making VBA do what you need it to.</p>      <p><strong>Contents and Overview</strong></p>    <p>This professionally produced video course shows anyone with some VBA experience how to super charge Excel. You will learn more advanced procedures for automating tough and time consuming Excel jobs with advanced micros. This course gives you a lot more power to fully customize VBA to do some pretty miraculous things.</p>    <p>The course starts with a very helpful and detailed discussion of more advanced VBA language. Don't let \"more advanced\" scare you away. The course always assumes you've got a life and need these things explained in ways that are quick and easy to fully grasp.</p>    <p>Next is a solid discussion of Event Patterns. This gives you advanced tools for doing just about anything you need with VBA. That is followed by a major section on Custom Objects.</p>    <p>Of course, there is plenty of information on making VBA work smoothly with Excel. Then the course wraps up with a great tutorial on how to use References and Libraries. Just what you need to continue in your study of VBA for as long as you like.</p>    <p>To help you retain the information the instructor has included exercise files to practice what you learned. Then there is an optional quiz to test your knowledge.</p>    <p>This is the Intermediate training you need for advanced abilities with VBA. Make yourself more valuable at work. Or use these concepts for your own business or personal needs.</p>", 
    "end_date": null, 
    "title": "VBA Intermediate Training: Discover Excel Automation Secrets", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647648_295e.jpg", 
    "course_url": "https://www.udemy.com/vba-for-excel-intermediate-training/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T09:10:33Z"
}