{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t              <strong>Udemy's #1 course on Visio! Enroll today and find out why.</strong></p><p><strong></strong>Fully updated for the most recent version of Office, Microsoft Visio Like a Boss is a comprehensive video lecture course that takes student from complete newbie to guru with Microsoft's diagramming and flowcharting tool that's used in companies big an small throughout the world  </p>  <p>  \t        In other words, students will be able to use Visio ... like a Boss.</p><p>  \t          Whether creating a first Visio diagram, or a veteran looking for new understanding of the applications capabilities, author and Microsoft Certified Instructor Brian Culp will give students  a guided tour of  the application's newest, most commonly used, and most powerful  features.  </p>  <p>  \t          Students of this course will learn:  </p>  <ul>  \t<li>how to add and manage shapes in a diagram</li>  \t<li>how to import and manage shape stencils</li>  \t<li>how to add and edit text in shapes</li>  \t<li>connect and group shapes</li>  \t<li>create flowcharts, floor plans, and org charts</li>  \t<li>document business processes</li>  \t<li>link Visio with external data sources</li>  \t<li>create custom Visio shapes</li>  \t<li>and much, much more</li>  </ul>  <p>  \t        What's more, students will learn the Visio application by doing. By simply following along with the hands-on exercises, viewers will be able to start from scratch. They will create and edit Visio shapes, text, and connectors to build out diagrams - all without the need to download course or demo files.  </p>  <p>  \tYou'll use the application just like you would at work or at school. So don't get frustrated fumbling around when it's so easy to learn the <strong>right</strong> way to use Visio.  </p>  <p>  \t        The course includes roughly 7 hours of video instruction, delivered in more than 100 individual, bite-sized lessons, making it perfect for learning the application from the ground up, or for going back to review/refresh on a specific skill.  </p>  <p>  \t<strong>What's more, the results are guaranteed!</strong>  </p>  <p>  \t         You'll have a  better understanding of projects and Microsoft Visio than ever before,  or your money back. If you need to learn Visio, and need to learn it  fast, please enroll or watch a couple of sample lessons - there are no  side effects. :)  </p>", 
    "end_date": null, 
    "title": "Visio 2013/2016/365 - Like a Boss. The Definitive Course.", 
    "price": "45.00", 
    "instructors": "Brian Culp", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/401708_577d_6.jpg", 
    "course_url": "https://www.udemy.com/visio-2013-like-a-boss/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T23:58:12Z"
}