{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<h5 style=\"\">A Verifiable Certificate of Completion is presented to all students who undertake this course.<br style=\"\">  </h5>    <p style=\"\">In this Visual Basic for  Excel training  course, you will learn how to apply the VBA programming language to make your  Excel spreadsheets much more powerful. This course starts you out with the  basics of VB programming, and teaches you to use it to its fullest potential  within Excel.</p><p style=\"\">The tutorial extends  your knowledge past editing odd Macro, directly into creating custom scripts  using the VBA Programming Language. This Visual Basic for Excel tutorial will teach  you about VBA structures, the difference between Functions and Subroutines, how  to manipulate Excel Cells, interacting with the user and very importantly,  error handling. Designed for the beginner, you do not have to be a programmer  already to understand, and implement what you will learn in this software  training course.</p><p style=\"\">        </p><p style=\"\">By the conclusion of  this Visual Basic for Excel training course, you will be familiar with the VBA  programming language, as it applies to Microsoft Excel. You will be able to  apply this knowledge to make interactive and fully functional spreadsheets.  Working files are included to let you work alongside the author as you learn Visual Basic for  Microsoft Excel in this video tutorial.</p>  ", 
    "end_date": null, 
    "title": "Visual Basic for Excel - Microsoft VBA Excel Tutorial", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20611_6f60_9.jpg", 
    "course_url": "https://www.udemy.com/learning-visual-basic-for-microsoft-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-03T22:18:03Z"
}