{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t**** Launching Price Sale Now On . Course Heavily Discounted to $10 ***  </p>  <p>  \t<strong>Windows 8 overview</strong>  </p>  <p>  \tWindows 8 is Microsofts latest installment of their operating system.  In the latest update from Windows 7, Windows 8 offers many new features. The biggest of all being the new UI overhaul. Windows is now split in both the classic desktop UI along with the modern/metro UI. The new user interface offers a whole new way to browse windows. Not only is windows built for mouse &amp; keyboard but now touch based computers as well. It retains the popular aero interface with some noticeable changes like the removal of the windows start menu. On top of everything windows 8 is a lighter, faster, and more efficient OS. Despite the UI changes its under the hood tweaks provide a cleaner and faster experience.  </p>  <p>  \t<strong>Why Upgrade?-</strong>  </p>  <p>  \tUpgrading to Windows 8 isn’t required. However most new PCs today will have it. If your coming from a 7 PC it may be worthy to upgrade as along with windows 8 theres a big unification n process for Microsoft.The modern UI is built with the windows phone &amp; tablet UI in mind. Learning to use windows 8 allows you to also understand navigating their mobile platforms. Additionally if your a user of Microsofts service skydrive, live, and so on then Windows 8 is for you. Windows 8 is built around your live account and accommodates all its services into the OS. If you have older hardware or even new hardware upgrading to windows 8 also brings a speed performance increase. Namely that in boot times, windows 8 is rebuilt from the core and optimizes hardware usage much more than its predecessor.  </p>  <p>  \t<strong>Why Windows 8 is a headache to many ?<br>  \t</strong>  </p>  <p>  \t Not everyone is satisfied with Windows 8, and thats for one main reason. The user interface change has left some new windows users lost. The modern UI leaves older users confused. While the modern UI has many great uses and substitutes that of the start menu its translation is lost between the classic desktop &amp; its own interface. The main issue with Windows 8 is that the two UIs don’t play well together. That issue alone makes many people weary of trying and using windows 8.  </p>  <p>  \t<strong>What people will learn from this crash course ?<br>  \t</strong>  </p>  <p>  \t In this course we cover the basics all the way up to some advanced windows 8 tweaks and tips. The new user interface can be a bit of hassle to navigate and within the series we show you around the new features of windows 8. Going from basic UI to advanced keyboard shortcuts etc. Along with that we show you how to increase your efficiency around Windows 8 and even great 3rd party apps that help fix common issues with windows 8 like the start menu.  Overall you’ll learn the a crash course on everything new in Windows 8 and how to navigate around familiar features that you may have missed from 7.  </p>  <p>  \t<strong>Key Features of the Course-</strong>  </p>  <p>  \t-Basic UI Navigation  </p>  <p>  \t-  Replacing the Windows 8 Start Menu  </p>  <p>  \t-  The Modern UI  </p>  <p>  \t-  Windows Charms  </p>  <p>  \t-  The New Internet Explorer  </p>  <p>  \t-  Useful Shortcuts  </p>  <p>  \tand much more.  </p>", 
    "end_date": null, 
    "title": "Windows 8 Crash Course with 50 Tips", 
    "price": "20.00", 
    "instructors": "Earners Classroom", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/51927_cb3e_4.jpg", 
    "course_url": "https://www.udemy.com/windows-8-crash-course-with-50-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-01T17:03:31Z"
}