{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t Hi,  </p>  <p style=\"\">  \t                       If you’re like me, when you first saw Windows 8… you hated it!  You probably had many of the same questions and complaints I had.  Ugh, those big icons are hideous!  Where’s my desktop?   And, what happened to my Start button?  </p>  <p style=\"\">  \t                       That was my first reaction.  But, after I used Windows 8 for a while, I started to like it.  Now, with the release of Windows 8.1, I love it!  Register for my course and just three hours from now, you’ll love it, too.  </p>  <p style=\"\">  \t                       I begin the course by showing you step-by-step how to update from Windows 8 to Windows 8.1.  Microsoft even gives us the update for free.  How cool is that?  </p>  <p style=\"\">  \t                       From there, we start from the beginning and go step-by-step through all the features of the updated Metro UI.  I then spend several lessons guiding you through the features of the most commonly-used Metro applications like the Mail app, the new Internet Explorer, the People app, the Music app, and SkyDrive.  </p>  <p style=\"\">  \t                       Still want more apps?  No problem.  I take you through the Windows Store where you can download nearly 150,000 apps for anything you can imagine.  </p>  <p style=\"\">  \t                       I walk you through the updated File Explorer (formerly Windows Explorer) and show you how to customize the Desktop using some really cool (and free) third-party apps.  </p>  <p style=\"\">  \t                       Here’s what else you’ll learn:  </p>  <ul style=\"\">  \t<li style=\"\"> Bypassing the Start screen and booting directly to the desktop</li>  \t<li style=\"\"> Set a picture password and 4-digit PIN</li>  \t<li style=\"\"> Login automatically with no password (I don’t recommend it, but I show you how to do it)</li>  \t<li style=\"\"> Connect to a wireless network</li>  \t<li style=\"\"> Create a home group and share files with family members</li>  \t<li style=\"\"> Secure your PC against viruses and spyware</li>  \t<li style=\"\"> Optimize your system performance</li>  \t<li style=\"\"> Troubleshoot common errors</li>  \t<li style=\"\"> Backup and restore your important files</li>  </ul>  <p style=\"\">  \t                       And much more…  </p>  <p style=\"\">  \t                       Think you can’t possibly learn all this in just 3 hours?  Enroll now, and let me prove that you can.  </p>  <p style=\"\">  \t                       See you in class,  </p>  <p style=\"\">  \t                       Kevin Moore  </p>", 
    "end_date": null, 
    "title": "Windows 8.1 Made Simple", 
    "price": "20.00", 
    "instructors": "Kevin Moore", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/150124_23a7_7.jpg", 
    "course_url": "https://www.udemy.com/windows-81-made-simple/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-21T15:14:00Z"
}