{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t       Windows Programming for Everyone  </p>  <p style=\"\">  \t This course will teach you how to program on your Windows computer by building working programs using the Rexx programming language.  </p>  <p style=\"\">  \t Rexx is the Perfect Programming Language to learn quickly and easily.  </p>  <p style=\"\">  \t       Rexx is easy to learn because its like English, uses variables that are typeless and can hold any kind of information, and it provides wonderful interactive tracing capability.  </p>  <p style=\"\">  \t You only need your Windows PC and a download of the free Rexx programming software to get started.  </p>  <p style=\"\">  \t<strong style=\"\">Watch the lectures in full screen and high resolution mode for the best viewing experience, and download and review the source code file included with each lecture.  </strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong><strong style=\"\">To get the most out of this course you should create and run each program on your computer.</strong>  </p>  <p style=\"\">  \t       In this course you&#039;ll learn about variables, program loops, reading and writing files, functions and how to put them all together in a working program.  </p>  <p style=\"\">  \t       You can build applications that are simple but time saving, or large applications to track your business operation.  </p>  <p style=\"\">  \t       We’ll build our programs using Windows Notepad, and run them by double clicking the program name in Windows Explorer.  </p>  <p style=\"\">  \t       You can copy or download information from the internet and shape it in the most useful fashion, or work with information from email or attachments.  </p>  <p style=\"\">  \t Rexx is the best language for everyday applications.  I use Rexx programs to search for files,  reorganize my bank and bill pay accounts, and track the movements of stocks  and options to determine best entry price..  </p>  <p style=\"\">  \t       Rexx will benefit the beginner and the expert.  The beginner has the easiest possible way to learn to program and the expert learns a valuable tool for programming in Windows.  </p>  <p style=\"\">  \t       The course has over five hours of step by step instruction that will prepare you for writing programs on your own.  You can create programs that help you be more productive.  In addition, the course provides a collection of useful programs to get you started.  </p>", 
    "end_date": null, 
    "title": "Windows Programming for Everyone", 
    "price": "50.00", 
    "instructors": "Bill Swartz", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/75640_9226_20.jpg", 
    "course_url": "https://www.udemy.com/windows-programming-for-everyone/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-08T12:54:24Z"
}