{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Dieser leicht verständliche Videolernkurs zeigt Ihnen besonders anschaulich, wie Sie Ihren PC mit dem neuen Windows 10 optimal nutzen. Ihr Trainer Harald Zinkann erklärt Film für Film die neue Benutzeroberfläche sowie alle wichtigen Funktionen von Windows 10 und den mitgelieferten Programmen. Sie lernen, wie Sie im Internet surfen, Briefe und E-Mails schreiben oder diktieren, wie Sie drucken, scannen, und Fotos, Filme und Musik verwalten. Eigene Abschnitte des Trainings beleuchten, welche Vorteile Windows 10 auf einem Tablet-PC oder Smartphone bietet. Das beste daran: Sie können parallel mitmachen und alle Schritte sofort auf Ihrem Computer nachvollziehen!</p><ul><li><span></span>Schneller Lernerfolg – Zuschauen, mitmachen, verstehen!</li><li><span></span>Internet, E-Mail, Texte, Fotos, Videos und Musik mit Windows 10</li><li><span></span> Windows 10 anpassen und optimal nutzen – Film für Film erklärt</li><li>Perfektes Zusammenspiel mit Smartphone und Tablet-PC</li><li><span></span>Ganz neu: Sprachassistent »Cortana« und Internet-Browser »Edge«</li></ul><p>Harald Zinkann ist Informatiker und als IT-Trainer für bekannte Schulungsunternehmen tätig. Für Microsoft hat er das erfolgreiche Schulungskonzept »Fit for Office« mitentwickelt. Er gibt regelmäßig Workshops zu Windows und allen Office-Themen. Harald Zinkann versteht es, Software besonders anschaulich und verständlich zu erklären.<span></span><br></p>", 
    "end_date": null, 
    "title": "Windows 10 – Der verständliche Videolernkurs", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659364_af45.jpg", 
    "course_url": "https://www.udemy.com/windows-10-der-verstaendliche-videolernkurs/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T20:59:04Z"
}