{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>                          ********  For a limited time $9 ONLY   ********</strong></p><p>This course is proper for who is beginner or even expert in some part. Because I will show you most of useful trick and methods to design and manage a text includes everything you need in it.</p>  <p>If you are an academic person, and you need to manage your text as an article or a thesis, you are in the right place! </p>  <p>Yes! You can learn how to perform whatever you need to set your texts up easily, in the shortest time, and in the best form and design.</p>  <p>No need to spend a lot of time to find someone and pay money each time to set your texts.</p>  <p>In this series, you will learn how to use Microsoft Word easily and fast.</p>  <p>You can set up your page, make titles and subtitles. You can design your text in paragraph and different styles, and use bullets and numbering in the easiest method. </p>  <p>You will know how to insert and edit a picture and table. </p>  <p>Also you will learn how to use symbols and write formulas based on your needs.</p>  <p>You can add footnotes, abbreviations and references in your text.</p>  <p>At the end of this course, you will be a professional user of Microsoft word .This 90 minutes course can open new doors to your future success.</p>  <p>Break the routine rules of using Microsoft word and learn the small, useful tips to utilize this software more applicable and comprehendible.</p>", 
    "end_date": null, 
    "title": "Word 2016 for Windows! Easy, Fast and Complete one", 
    "price": "25.00", 
    "instructors": "Azadeh Ahmadi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707226_d0d7_4.jpg", 
    "course_url": "https://www.udemy.com/microsoft-office-word-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-26T21:58:38Z"
}