{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Using my step by step instructions, you will quickly master many of the popular features available in Word.  The included sample documents, instructions and quizzes will ensure you fully understand and can utilize the skills you've learned in this course. By the end of this course, you will be able to create advanced Word documents with ease.\n\n  </p>\n\n<p><strong><u>Some of the many skills you will take with you from this course are:</u></strong>\n\n  </p>\n\n<ul>  <li>How to navigate the tabs and contextual tabs and locate      the commands you need.</li></ul><ul><li>How to use the keytips.</li></ul><ul><li>How to utilize the Quick Access Toolbar so you can work      more efficiently.</li></ul><ul><li>How to protect your document with a password.</li></ul><ul><li>How to Inspect and remove metadata from your document.</li></ul><ul><li>How to utilize the export feature, encompassing it many      options to create a more dimensional document.</li></ul><ul><li>How to work effectively work with styles.</li></ul><ul><li>How to add headers and footers to various types of      documents.</li></ul><ul><li>How to work with footnotes and endnotes.</li></ul><ul><li>How to add, edit, update and troubleshoot a table of      contents.</li></ul><ul><li>How to create a table of authority, including marking      and editing citations and creating categories.</li></ul><ul><li>How to create five different types of tables.</li></ul><ul><li>How to work with tables, including their borders and      styles.</li></ul><ul><li>How to correctly work with track changes, including      setting options and showing markups.</li></ul><ul><li>How to add, remove and create custom watermarks.</li></ul><ul><li>How to add line numbering to documents and sections as      well as to suppress from selected lines.</li></ul>\n\n<p><em><strong>I've also included a Tips and Tricks section which includes quick time saving steps to assist you with utilizing features to their fullest.</strong></em>\n\n  </p>\n\n<p><strong><u>Course Design</u></strong>\n\n  </p>\n\n<p>The course is broken into modules, each covering a feature and going through the steps to access, incorporate and customize the feature. The majority of the modules include sample document so you can follow along as we walk through the features and their options.  Once the module has been completed, you can take a quiz to verify your understanding of the feature.  And, you can also download the step by step instructions for each feature outlined.\n\n  </p>\n\n<p><strong><u>Target Audience</u></strong>\n\n  </p>\n\n<p>This course is targeted for all individuals, whether you are looking for a review or just learning how to use Word.</p>", 
    "end_date": null, 
    "title": "Word 2016 Essentials - A \"How To\" Course", 
    "price": "25.00", 
    "instructors": "Vicky Bisbach", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/846564_4052_6.jpg", 
    "course_url": "https://www.udemy.com/word-2016-essentials-a-how-to-course/", 
    "currency": "USD", 
    "subject_name": [
        "Microsoft"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-11T22:42:18Z"
}