{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>If you have trouble falling asleep or staying asleep, this sleep hacking course is for you.</strong><br></p><p>Whether you have occasional sleep problems or even chronic insomnia, this sleep course can improve your sleep tonight.<br><br><strong>Solve Your Sleep Problems:</strong></p><ul><li>Insomnia (chronic or occasional)</li><li>Can't fall asleep quickly</li><li>Wake up frequently during the night</li><li>Wake up feeling tired</li><li>Sleep Apnea</li><li>Snoring</li><li>Feel anxious or stressed when going to bed</li><li>Don't feel sleepy</li><li>Take prescription medications that may interfere with sleep</li><li>Medical conditions that may interfere with sleep</li><li>Allergies that can cause sleeping difficulties</li><li>Back or neck pain or similar discomfort</li><li>Tinnitus</li><li>And many other conditions...</li></ul><p><br><strong>You'll be able to solve all of these sleep problems and more!</strong><br></p><p>We understand how it feels to have difficulties getting to sleep or staying asleep. It can be frustrating, aggravating and downright miserable. We felt there had to be a better and easier process to get to sleep, because many of things and books we tried in the past didn’t help us fall or stay asleep.</p><p><strong>We found the answer</strong>. We have conducted 1,000s of hours of research and spent years of self-hacking experimentation to produce the \"<em><strong>10 Days to Better Sleep Course</strong></em>.\"</p><p>This course is designed to provide you with <strong>simple, easy</strong> to implement, <strong>safe, effective and powerful sleep hacks</strong> that help you get to sleep quickly and easily.</p><p><strong>You'll learn all of these sleep hacks, tricks, tips and more!</strong><br></p><p>By removing your largest sleep roadblocks, you can quickly and greatly improve the quality of your sleep. The results: you fall asleep faster each night, you sleep through the night and you wake up feeling revitalized and energetic.</p><p><strong>Course Instructors</strong></p><p>Adam and Corey are the co-founders of Sleep Now, co-authors of several books and courses on sleep hacking and co-founders of the Change Academy; a training program that helps you increase your energy, time and money so you can experience fulfillment and personal freedom.</p><p><strong>*Course Bonuses</strong></p><p>As part of this course we have included two of our published books on sleep hacking:</p><p>1) The <em>Sleep Hacking Guidebook</em><br>2) The <em>Sleep Hacking Toolkit</em><br><em>3) </em>Next Level Help</p><p>We look forward to seeing you on the inside and congratulations on your journey to better sleep!<br></p><p><strong>Enroll now and start getting better sleep tonight!</strong></p>", 
    "end_date": null, 
    "title": "10 Days to Better Sleep", 
    "price": "20.00", 
    "instructors": "Adam Hayes, Corey Wenger", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676592_a1ad.jpg", 
    "course_url": "https://www.udemy.com/10-days-to-better-sleep/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T17:02:40Z"
}