{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Being able to take care of your teeth is huge. Oftentimes many people forsake their oral health due to no dental insurance and the costs of the services are expensive. </p><p>Would you like to take care of your teeth without getting dental insurance?</p><p>Would you like to set an example for your kids about the importance of oral health?</p><p>What if you could see a dentist and work out a payment plan, would that make you want to go to the dentist right now?</p><p>If you answered yes to any of these questions, this is the course for you. </p><p><em><strong>GOOD NEWS!! This course provides you with those opportunities and much more. </strong></em></p><p><strong><em><em><strong></strong></em></em></strong>All of the strategies included in this course have been carefully researched. As your instructor, I have even used one and know of other people using some others mentioned. </p><p>You are literally a few clicks away from saving hundreds of dollars on your dental and oral health. </p><p>Take it from me a parent of twins, who normally has a dental situation every couple of years. You owe it to yourself to utilize one of these strategies and protect your oral health. </p><p><strong>A few things you'll learn in this course:</strong></p><ul><li>How many diseases a dentist can detect based on your oral health</li><li>How a dental hygienist can save you money</li><li>The relevance of getting a second opinion</li><li>Dental and Oral Health Terminology</li><li>Where the dental schools are and so much more. </li></ul><p><strong> I will personally answer any question you may have, so you can feel confident your money will be well spent.</strong></p><p>This course comes with a full money back no questions asked guarantee. </p><p>So enroll now and let's get started.</p><p>Talk with you soon, </p><p>Dr. Taffy <br></p>", 
    "end_date": null, 
    "title": "15 Ways to Save Hundreds of Dollars on Dental & Oral Health", 
    "price": "20.00", 
    "instructors": "Taffy Wagner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/710950_960c.jpg", 
    "course_url": "https://www.udemy.com/15-ways-save-hundreds-on-dental-oral-health/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T17:47:54Z"
}