{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Price will rise at the end of December so act now!</strong></p><p>Over 300 Students signed up in one day! Course update July15, 2015.</p><p>Are you someone who lives with pain? Do you wake up stiff? Suffer from headaches? Jaw Problems? Low Back Pain? Sciatica? Shoulder Problems? Knee or Ankle Problems or pain?</p><p>This course is for you!</p><p>Doctor Krista Ryan and VitalityMatrix presents a way to change your pain. Doctor Krista has been a successful chiropractor for over eight years and has taught thousands of people just like you to take control of their lives and change their daily pain. </p><p>This course teaches you the basics of walking and is based on proper kinesiological principles. It helps you to identify problems before they happen and how to take control once they exist. </p><p>Our Course is updated regularly. </p><p>Our course teaches how to identify pain in certain areas, how to change your walk to help these areas and how to support theses areas with nutrition and exercise. </p><p>Enrol in this Course by clicking in the blue box at the bottom of the screen Right NOW!</p><p>Every few minutes you delay you let pain, inflammation and dis-ease fester unattended in your body. You can change your health outcome Right NOW! </p><p>Click now because the price will be increasing very shortly! </p><p>And the promotional free membership to VitaltiyMatrix will be only offered to a limited number of students. </p>", 
    "end_date": null, 
    "title": "31 Ways to a Pain Free Life! Keep the doctor away! ", 
    "price": "30.00", 
    "instructors": "Chiropractor/Health Advocate Doctor Krista Ryan", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/500148_af8b_7.jpg", 
    "course_url": "https://www.udemy.com/learn-how-walking-can-change-back-jaw-hip-shoulder-pain/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T16:41:42Z"
}