{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  I wasn’t always the healthiest person. When I was in college, I was <em style=\"\">diagnosed with a chronic disease</em>. I ate fast food at least 6 times a week and I definitely did not exercise. But, after my diagnosis, <strong style=\"\">I changed my life around</strong>. I started incorporating some of the behaviors discussed in this program. Soon enough, I started to feel better… I had more energy and was less anxious. I then started adding more healthy behaviors to my lifestyle and I began to feel even better. Now, when I go in for check-ups my doctors are amazed. I’ve even been able to cut back on my medication! <em style=\"\">It was this experience that inspired me to create this program</em>.  </p>  <p>  \t  I am here to tell you that no matter where you are in your life, you truly can start feeling better <strong style=\"\">right now</strong>. Researchers have discovered that there are 7 simple steps we should all follow to improve our health. <em style=\"\">I’m going to share those secrets with you here</em>. The good news is they are relatively easy to fit within your current lifestyle. Even better news, if you start just <em style=\"\">one </em>of the new behaviors described in this program, it will still help you feel better and increase your lifespan. As a college professor, a Registered Dietitian for the University of California, and a Certified Health Fitness Specialist (a.k.a. personal trainer), I include different dimensions of health and wellness and incorporate a holistic, or “whole body” approach.  </p>  <p>  \t  And because I follow these behaviors myself I provide practical tips… ones that have helped me and countless others so that you can begin these new habits right away.  </p>  <p>  \t  The course will guide you through each step of my program. I begin each lesson with some important background information so that you can understand why each step is worth your time. I then discuss my recommendations and provide practical tools to help you start these behaviors, <strong style=\"\">right now</strong>.  </p>  <p>  \t  Don’t feel as though you are alone in this: <em style=\"\">I am always available</em> for questions, more information, etc. I hope my program inspires you to begin your path to optimal health and wellness.  </p>  <p>  \t  So, what are you waiting for? Optimal health is just a click away…  </p>  <p>  \t  To your health,  </p>  <p>  \t  Dr. Neal  </p>", 
    "end_date": null, 
    "title": "7 Steps to Feeling Your Best", 
    "price": "20.00", 
    "instructors": "Dr. Neal Malik", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/179738_43a8_3.jpg", 
    "course_url": "https://www.udemy.com/feelyourbest/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-10T08:41:09Z"
}