{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">FINALLY – LEARN about all the AMAZING benefits of testosterone in the male body and the studies that support those benefits – you&#039;ll never wonder about testosterone research again!</p><p style=\"\">You&#039;re a man with no libido or have erectile dysfunction (ED). You feel tired and weak and depressed and you&#039;re always achy, especially in your muscles -- which seem to be wasting away. Ugh. Or you&#039;re a wife and you wonder about your husband&#039;s loss of muscle tone and absence of libido and interest in sex -- his apathy is driving you CRAZY! What&#039;s going on? </p><p style=\"\">Take a walk on the wild side with Dr Dan Purser, an MD who&#039;s been involved in years of endocrine (hormone) research, written a textbook on preventive medicine and tons of other books (TEN #1 books), and is a worldwide educator on men&#039;s &amp; women&#039;s health issues. </p><p style=\"\">Learn what the research says through the eyes of this engaging educator as he shares experiences and articles about men and their testosterone, their libido, and their brain and heart. Wonder no more if it&#039;s safe or helps -- this is detailed and backed by references -- and will help you to decide if testosterone should be part of your life and why... </p><p style=\"\">Men LOVE IT when they optimize their testosterone levels. </p><p style=\"\">I know this first hand after years as a practicing physician and as an endocrinology researcher and properly treating men who were deficient – dealing with them before and after, and seeing the smiles on their faces when they too really realized the wonderful (and SEXY) benefits of testosterone – it was our little guy secret for them to use with their wife. </p><p style=\"\">The challenge is that there&#039;s all kinds of confusing bad information out there – well this little course cuts through all of that as I discuss each study (studies that I chose as a reason and felt that were significant) and what it means to YOU. And I don&#039;t talk like a physician – above your head with big fancy medical words – I grew up on a farm in Oklahoma and I talk like a regular human being. ☺  </p><p style=\"\">Most doctors don&#039;t know these details – but they&#039;re not secret – they just come with the territory for the kind of research I do and books I write – I&#039;ve had TEN #1 BOOKS on health issues and hormones. </p><p style=\"\">This disconnect with you the patient by other physicians and their inability to answer questions patients really have is why so many doctors are missing out on unlocking the wonders of this incredible hormone and treatment option with their exhausted chronically fatigued no libido male patients. </p><p style=\"\">This course was created to change that attitude and in the past has only been available amongst a private, group of elite professionals and high end cash paying patients until now... </p><p style=\"\">This isn&#039;t one of those training programs that gives you some basic theory and sends you out into the trenches only slightly better off then when you started... </p><p style=\"\">By the end of this training you will be armed with hardcore facts about testosterone benefits for men, and some proven tactics for optimizing your levels. </p><p style=\"\">Need to discuss testosterone benefits with your personal physician and don&#039;t know where to start? - you&#039;re covered</p><p style=\"\">Your doc doesn&#039;t know what your testosterone levels should be? - you&#039;re covered</p><p style=\"\">Your personal physician is not sure how to prescribe and in what form? - you&#039;re covered</p><p style=\"\">Your doctor says it will cause prostate cancer? - boom, you&#039;ll learn how to disarm that too</p><p style=\"\">This training covers the current and modern peer reviewed research on testosterone benefits for men and the safety issues (which are minimal). </p><p style=\"\">This premium training by a top notch educator is perfect and for years has delivered results for: </p><p style=\"\">¥\tMen who have muscle wasting and want them to come back</p><p style=\"\">¥\tPatients with osteoarthritis or even rheumatoid arthritis and want relief and healing</p><p style=\"\">¥\tMen with ED that want it to go away naturally</p><p style=\"\">¥\tMen with exhaustion and fatigue and who wonder if it&#039;s due to low testosterone</p><p style=\"\">¥\tMen with absence of libido who want a love life</p><p style=\"\">¥\tMen with unexplained depression – it&#039;s not a fluoxetine deficiency. ☺</p><p style=\"\">When you&#039;re done with this course, starting to feel much better will be in reach...as well as the big time intimacy rewards that come with that. </p><p style=\"\">Below you can find out exactly how the training is laid out, but real quick here are the sections: </p><p style=\"\">1.\tIntroduction – Understanding a little bit about who I am, my Credentials, Background, and from what Direction I Speak and Educate</p><p style=\"\">2.\tMen Using Testosterone – How to Properly Use Testosterone and What Your Real World Options Are.</p><p style=\"\">3.\tProper Diagnosis – Information and Labs we Need &amp; Get in Research And In My Office to Confirm the Diagnosis</p><p style=\"\">4.\tCardiovascular Benefits of Testosterone For Men – the research and studies and what they say (THEY are HUGE -- and NOT what the current news would have you believe)</p><p style=\"\">5.\tDiabetes Benefits – Did you Know Testosterone Helps to Prevent Diabetes? (I&#039;ve Even Seen it Unwind Full Blown Cases of Type 2 Diabetes.) Learn more in this section.</p><p style=\"\">6.\tMuscles and Strength – Getting weaker? More Frail? Can&#039;t figure out why because you eat and healthy and have exercised all your life? This Section May Hold The Answers</p><p style=\"\">7.\tPrevent Mental Decline and Elevates Mood – Worried About Dementia or Alzheimer&#039;s? (Who Isn&#039;t) Or MS? Several Critical Studies on these Benefits Are Detailed.</p><p style=\"\">8.\tBone Health – Testosterone Can Help Prevent Osteoporosis and Even Reverse IT. Has Your Doctor Told You This? Has He Prescribed It Yet for that Nagging Osteopenia? See Why It May Be An AWESOME Natural Option.</p><p style=\"\">9.\tSexual Health – Has This Been And Issue? This Section Is Usually A Man&#039;s Favorite – Especially If You&#039;re Young and Have ED. This May and Is A SUPER SEXY All Natural Option</p><p style=\"\">10.\tGeneral Health – Testosterone Helps So Many Things Naturally and Safely – I Try To Cover Some Here in this Section.</p><p style=\"\">11.\tMore Info – I Detail Ways You Can Contact ME – Just in Case.</p><p style=\"\">Trust me, this is just a small sample of what you&#039;ll learn and by the end of this course you&#039;ll have every tool you need in order to dispel yours&#039; and your physician&#039;s concerns about this amazing hormone. </p><p style=\"\">I will personally respond to any questions you may have as you go through the material so there&#039;s no worry if you&#039;re not sure how to take all of the information and apply it to your personal life. </p><p style=\"\">AND you&#039;ll have access to all of this material as well as the newest stuff I share with everyone on the inside of the course for life! </p><p style=\"\">Also, you&#039;ll receive all future notifications for my newer more advanced courses as they come out and new information as it arises.</p><p style=\"\">REMINDER: this is a risk free purchase with Udemy&#039;s 30 day money back guarantee. Nothing to lose, everything to gain. </p><p style=\"\">Hope to see you on the inside,</p><p style=\"\">-- Dan Purser MD</p><p style=\"\">BTW - This training is something I&#039;ve kept off of everything but my own private patient community site for a long time due to wariness of exposing too many practice and research  secrets. After finally getting convinced by some patients that more women needed to see it, I decided to put it up here on Udemy. I can&#039;t guarantee I will keep making it available to purchase forever considering my initial concerns, so I&#039;d grab it while you still can.</p>", 
    "end_date": null, 
    "title": "75+ Problems with Low Testosterone in Men ", 
    "price": "25.00", 
    "instructors": "Dan Purser", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/536358_bf34.jpg", 
    "course_url": "https://www.udemy.com/problems-with-low-testosterone-in-men/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T17:38:37Z"
}