{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This is a self-guided educational program designed to help adults lower their blood pressure.  It has been designed  for anyone with an interest in maintaining a healthy blood pressure for life. In particular,  people with pre-hypertension and hypertension. Implementing the advice contained in this program should reduce risk of diseases such as heart attacks, strokes and heart failure.  We provide all the information you need to start optimizing your blood pressure. We have only included techniques that have been proven to be effective in clinical trials or are considered best practice by international blood pressure guidelines.  The program is designed to be complementary to your current treatment and is written and presented by qualified, practising Cardiologists.</p><p><strong>It doesn't stop there! </strong>Unlike any other course, you get <strong><em>direct access to two Cardiologists</em></strong>. We will give you direct support to achieve your program goals.  <strong>We want you to succeed, and we will help you get there!</strong></p><p>(Terms of Use: Please note: IF THIS IS A MEDICAL EMERGENCY, PLEASE IMMEDIATELY CALL EMERGENCY PERSONNEL (911) TO GET PROMPT MEDICAL ATTENTION. DO NOT RELY ON ELECTRONIC COMMUNICATIONS OR THIS WEBSITE FOR ASSISTANCE IN REGARD TO YOUR IMMEDIATE, URGENT MEDICAL NEEDS. THIS COURSE IS NOT DESIGNED TO FACILITATE MEDICAL EMERGENCIES. We cannot provide personal medical advice. If you think you may be suffering from any medical condition, you should seek immediate medical attention. This course is not intended to replace the medical advice of your doctor or health care provider. Please consult your health care provider for advice about a specific medical condition. Please remember that the information in this course, in the absence of a visit with a health care professional, must be considered as an educational service only and are not a substitute for professional medical advice, diagnosis, or treatment and are not designed to replace a physician's independent judgment. You should never delay seeking medical advice, disregard medical advice or discontinue medical treatment because of information in this program. Individuals with high blood pressure should first consult with their personal physician before following any of the advice in this course. By submitting communications or content through Udemy, you agree that such submission is non-confidential for all purposes. BY USING THIS COURSE, YOU ACCEPT THESE TERMS. ).</p>", 
    "end_date": null, 
    "title": "A Cardiologist's guide to naturally lower blood pressure", 
    "price": "25.00", 
    "instructors": "Michael MacDonald, Dr Colin Petrie", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461960_4037_2.jpg", 
    "course_url": "https://www.udemy.com/healthy-blood-pressure-program/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-29T09:34:29Z"
}