{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong>450+ students enrolled in the first year </strong></p>\n\n<p>  \t<strong>Last updated: 17th June 2016</strong><strong></strong>  <br></p>\n\n\n\n\n\n\n\n<p>  \t                                                                                Since I stopped drinking in September 2013 I have saved over £6000, lost 12lbs in weight and any symptoms of anxiety or depression have all but gone. Life is better in every way!  </p>\n\n\n\n\n\n\n\n<p>  \t                                                                        Before we stop, we think quitting drinking will be impossible and too hard, so we decide  not to even try, but this course will give you all the information and  tools to make it possible. There are presentations, an e-book, hand-outs and online resources for you to use. The course is designed to be completed in 6-7 hours but deciding to change your relationship with alcohol, and changing it can  be a process which takes some time and as this course gives you lifetime access it will be there for you as long as you need it.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                                                It looks at ways to cut down through moderation, gives you the structure and time to reflect on your drinking while thinking about stopping or preparing to stop.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                                                It gives you knowledge about the impact that alcohol has physically and emotionally and the skills to manage life alcohol free. Then once you are living hangover free tools are provided to ensure that you can stay that way as long as you wish.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                                                It gives supportive resources in terms of books, audio podcasts, films and online communities. Plus I can provide one-on-one support via telephone, email or Skype so if you feel this would be beneficial, please ask about my hourly rate.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                                                This course is for you if you want to look at your relationship with booze and want to change it, be that temporarily or permanently. What have you got to lose? You can always go back to drinking if you change your mind. Although you might find, like me, that life is so much better without it that you'd rather stay hangover free. Enroll now!  </p>", 
    "end_date": null, 
    "title": "A Hangover Free Life", 
    "price": "45.00", 
    "instructors": "Louise Rowlinson", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297002_520c_4.jpg", 
    "course_url": "https://www.udemy.com/ahangoverfreelife/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T10:58:01Z"
}