{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn the five pillars to healthy living by learning invaluable tips on how to Eat Healthy, Proper exercise habits, Learn how to meditate, The importance of proper sleep and rest as well as the importance of doing good deeds.</p><p>Welcome to \"A Quick Start to a Healthy You\"!</p><p><strong>This course will take your personal health and energy to a whole new level.</strong></p><p><em>Are you stuck in a rut with unhealthy living and poor habits?</em></p><p><em>Do you feel a lack of energy and even lethargic in the mornings?</em></p><p><em>Do you struggle balancing healthy living with all of the other responsibilities that you have in life?</em></p><p>Well, if you answered <strong>YES</strong> to any of the above questions than you must take this course!</p><p>As Master Instructors in the Martial Arts for over 30 years as well as Personal Development Professionals, we have helped thousands upon thousands of people to live a healthy lifestyle.  Our names are Master Paul Melella and Master Chris Berlow and we thank you for your interest in our program.  Both of us have owned Martial Arts Schools for over two decades and are partners in a Personal Development Company called Empowered Mastery.  We travel all over the world teaching about healthy living and personal growth.  Both of us are extremely passionate about helping individuals gain a deeper understanding on how not only to live a healthy lifestyle, but to sustain it.</p><p>We are in a constant uphill struggle.  With society as it is today and the media pushing all the unhealthy options are way with tremendous marketing budgets.  Its no wonder why we have become one of the un healthiest nations out there.  We are on a mission to do something about that and would love it if you joined our cause.</p><p>By the end of this course you'll definitely be living a healthier lifestyle and will have the tools to do it.  The results will be astounding as you will look and feel better, have more energy, be more calm and overall a happier person.</p><p><strong>Content and Overview</strong></p><p>First thing you ned to know is that there is no \"FLUFF\" here!  We get right into what we call the five pillars to healthy living.  All videos are high def and professionally produced to help get the messages out to you.</p><p>Be the end of this course, you will successfully learn and develop:</p><p>The Mindset of Healthy Living</p><p>Pillar 1:  What you need to know about healthy eating</p><p>Pillar 2:  What exercise is best for you</p><p>Pillar 3:  Why and how to practice meditation</p><p>Pillar 4:  Why we need to get proper sleep</p><p>Pillar 5:  The importance of Good Deeds</p><p>Each lesson covered will be broken down into easy obtainable action steps to get you moving in the right direction quickly.  It is named \"Quick Start to a Healthy You\" because that is exactly what the program is about.  Getting you to take action right away to start living and feeling better.  </p><p>Each lesson will have a test to take.  (Please be sure to take the test and don't worry, we won't see the scores)  This way you could see how well you retained the information.  There will also be some accompanied pdf's as needed that you could download for your convenience.  The meditation section even has music that you could use to practice meditation at home.  At the end of each lesson will have a synopsis of the content to reinforce what you learned.</p><p><strong>Success Tip:  </strong>The most important tip is that you empty your cup.  Meaning that you need to approach this course with an open mind.  If you are looking to live healthier now, then this is the course for you!!!!</p><p>All the lessons are instructed by both Master Paul Melella and Master Chris Berlow of Empowered Mastery.  Both of them are daily practitioners of the martial arts as well as endurance athletes.  They train for hours a day, run multiple businesses, highly involved with their children and families and are able sustain high energy everyday through the lessons taught in this program.  If they could do it, so can you!</p><p>OK, enough talk, time for action!</p><p>Register today and jump in to \"<strong>A Quick Start to a Healthy You</strong>\"!</p>", 
    "end_date": null, 
    "title": "A Quick Start To A Healthy You. ", 
    "price": "20.00", 
    "instructors": "Empowered Mastery", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581452_155f.jpg", 
    "course_url": "https://www.udemy.com/quick-start-to-a-healthy-you/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T18:52:44Z"
}