{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Wer Tag für Tag gute Leistungen erbringen will, muss erholt sein. Aber vielen Menschen fällt das Abschalten nach Feierabend schwer - und auch das Einschlafen wird durch Grübeln verhindert. Manche wachen auch nachts auf und denken sofort an die Arbeit. Echte Erholung wird so unmöglich. </p><p style=\"\">In diesem Video-Kurs lernen Sie, wie Sie richtig abschalten und endlich wieder gut schlafen können - mit Hilfe von Tipps aus der Schlafpsychologie und Verhaltensmedizin.  </p>In 43 Lektionen - verteilt über 11 Abschnitte - erfahren Sie, <ul style=\"\"><li style=\"\">wie Sie <strong style=\"\">schon tagsüber</strong> das Abschalten nach Feierabend vorbereiten</li><li style=\"\">wie Sie <strong style=\"\">Grübeln / Gedankenkreisen</strong> stoppen und für Ordnung im Kopf sorgen</li><li style=\"\">wie Sie mit <strong style=\"\">nächtlichem Aufwachen</strong> umgehen sollten</li><li style=\"\">wie Sie Ihren Schlaf so vorbereiten, dass er <strong style=\"\">wie automatisch</strong> kommt</li><li style=\"\">wie Sie sich <strong style=\"\">erholen und entspannen</strong> und insgesamt ruhiger werden</li></ul><p style=\"\">In 8 Quizes können Sie überprüfen, was Sie von dem Gelernten behalten haben.</p><p style=\"\">Alle Materialien sind herunterladbar. Die 3 vertonten Folien-Vorträge und 29 Person-Videos (in denen ich zu Ihnen spreche) sowie die 10 Text-Lektionen und 4 Trance-Suggestionen (<strong style=\"\">einschläfernde Texte mit Entspannungsmusik</strong>) liefern Ihnen ein abwechslungsreiches Zusammenstellung von Tipps, mit denen Sie Ihre Abschalt- und Schlaf-Fähigkeiten systematisch ausbauen können. </p><p style=\"\">Es erwarten Sie zusätzlich 2 kleine Selbst-Checks, weitere Materialien zur Vertiefung und insbesondere 1 Plan über <strong style=\"\">ein 3wöchiges Programm</strong>; dieses hat die Bestandteile:</p><ul style=\"\"><li style=\"\">innehalten und beobachten</li><li style=\"\">Veränderungen einleiten</li><li style=\"\">Erfolge stabilisieren</li></ul><p style=\"\">Für jede Woche liefert das Programm je eine pdf-Datei mit Text-Tipps und je eine mp3-Datei, die Sie vor dem Einschlafen hören sollten. </p><p style=\"\">Auch eine <strong style=\"\">Audio-Datei zur Progressiven Muskelentspannung</strong> ist Teil des Online-Kurses. </p>Dergesamte Online-Kurs basiert auf meinen Erfahrungen als Psychotherapeutin<p style=\"\">und <strong style=\"\">Leiterin von Kursen zur Schlafstörungsbewältigung</strong>. Für Sie heißt das, dass Sie erprobte und bewährte Konzepte kennenlernen und keine abgehobene Theorie. Was ich früher in Workshops, Seminaren, Vorträgen und Beratungen vermittelt habe, erhalten Sie nun in komprimierter Form als Online-Kurs.</p>", 
    "end_date": null, 
    "title": "Abschalten und gut schlafen lernen", 
    "price": "30.00", 
    "instructors": "Anne Katrin Matyssek", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481250_016b_3.jpg", 
    "course_url": "https://www.udemy.com/abschalten-und-gut-schlafen-lernen/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T15:24:59Z"
}