{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Bienvenido a mi Academia de Acupresión - ¡El Lugar de Udemy donde aprender sobre Acupresión!</p><p>√ Alivie su dolor por sí mismo Sin Medicación usando Puntos de Masaje Chino Tradicional </p><p>√ Encuentre fácilmente los puntos de masaje correctos con Vídeos Full HD simples y profesionales</p><p>√ Dolor de Cabeza, Dolor de Espalda, Alergia y Puntos de Emergencia: están en el Curso.</p>\n\n\n\n<p> √ Puntos para Tratar enfermedades Cotidianas y Propias de la Mujer: están en el Curso.</p>\n\n\n\n<p> √ Puntos para Aprender Eficientemente, Estar en Forma y Tener una Mejor Vida Sexual: están en el Curso.</p><p>\"En resumen, la acupresión ofrece los máximos beneficios sin los efectos secundarios peligrosos asociados con muchos de los enfoques de la medicina convencional.\" </p>\n\n<p> -William Michael Cargile, B.S., D.C., F.I.A.C.A., Presidente de Investigación de la Asociación Americana de Acupuntura y Medicina Oriental</p><p>La Acupresión es perfectamente adecuada para usted y tiene estos beneficios inmediatos: </p>\n\n\n\n<p> + No necesita perder tiempo visitando a su doctor.</p>\n\n\n\n<p> + No necesita gastar una cantidad considerable de dinero.</p>\n\n\n\n<p> + No hay peligro de ser herido, infectado o de experimentar dolor.</p>\n\n\n\n<p> + Masajee con suavidad los puntos con su propio dedo.</p><p>Los Puntos de Masaje a usar son:</p>\n\n\n\n<p> √ especialmente efectivos</p>\n\n\n\n<p> √ fáciles de encontrar, sin necesidad de asistencia de alguien más</p>\n\n\n\n<p> √ mostrados con Fotos y Vídeos Full HD profesionales</p><p>\"Con el Curso, pude reducir significativamente mi dolor de cabeza. Los puntos son fáciles de encontrar usando los vídeos. Estoy tan contento de llevar el Curso siempre conmigo, en mi iPhone e iPad\"</p>\n\n<p> -Dr. Umin, Director en Siemens en Alemania</p><p>¡Miles de personas ya lo han realizado! Usted también puede hacer el Curso de Acupresión ahora y auxiliarse a sí mismo cuando lo necesite sin medicamentos ni visitar al doctor.</p>\n\n\n\n<p> Por una parte de lo que le cuesta una visita al médico, se lleva un Curso de Acupresión para siempre con actualizaciones gratuitas de por vida con más puntos de acupresión.</p><p>¡Diviértase con el Curso! ¡APÚNTESE AHORA!</p>\n\n\n\n\n\n<p> Su Dr. Bargak </p>\n\n<p> - 30 años practicando con éxito la acupresión</p>\n\n\n\n\n\n<p> ¿Tiene alguna pregunta? Siéntase libre de contactar en Facebook - Sólo busque Dr. Bargak</p>", 
    "end_date": null, 
    "title": "Academia de Acupresión - Más Sano Con Puntos de Masaje", 
    "price": "30.00", 
    "instructors": "Dr. Jakob Bargak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802348_b202.jpg", 
    "course_url": "https://www.udemy.com/academia-de-acupresion-mas-sano-con-puntos-de-masaje-dr-bargak/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T22:32:12Z"
}