{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Welcome to the Acupressure for Business - The Place on Udemy to improve health in order to achieve business goals! </p><p></p><p></p><p></p><p>√ Improve Your Business Performance on your own Without Medications using Traditional Chinese Massage Points </p><p>√ Easily find the right Massage Points with simple and professional Full HD Videoclips </p><p>√ Memory Improvement and Brain Training Points are in the Course. </p><p>√ Fast Relaxation Points are in the Course. </p><p>√ Headache and Back Pain Points are in the Course. </p><p>√ Everyday Health and Quit Smoking Points are in the Course. </p><p>√ Sports and Fitness incl. Yoga Points are in the Course.</p><p>√ Points to Stay Healthy During Business Trips are in the Course.</p><p>√ Emergency Relief and Depression Points are in the Course.</p><p>√ Beauty Acupressure Points are in the Course. </p><p>&quot;In short, it [Acupressure] provides maximum benefits without the dangerous side effects associated with many of the approaches of conventional medicine.&quot; -William Michael Cargile, B.S., D.C., F.I.A.C.A., Chairman of Research for the American Association of Acupuncture and Oriental Medicine</p><p>The Acupressure is perfectly suitable for you with these immediate benefits:</p><p>+ You do not need to spend time visiting a doctor.</p><p>+ You do not need to spend a considerable amount of money.</p><p>+ There is no danger of being hurt, infected or experiencing pain.</p><p>+ You massage the points gently with your own finger.</p><p>The Massage Points to use are:</p><p>√ especially effective</p><p>√ easy to find, no need for someone else&#039;s assistance</p><p>√ shown with professional Full HD Photos and Videos</p><p>&quot;With the Course, I learned to maintain high concentration during long workshops as well as relax deeply in a very short time. Moreover, while travelling I now use acupressure points to effectively combat small everyday ailments, like cough and sniffles, on my own! The points are easy to find using the videos. I am so happy to have the Course always on me, on my iPhone and iPad&quot; -Dr. Umin, Manager at Siemens in Germany&quot; </p><p>Thousands have done it already. Now you can also take the Acupressure Course and help yourself on demand without medications and doctor visits. </p><p>For a fraction of a doctor&#039;s visit cost, you get a proven Acupressure Course for ever with free lifelong updates containing more massage points. </p><p>Have Fun with the Course! ENROL NOW! </p><p>Your Dr. Bargak </p><p>- 30 years of successful acupuncture practice</p><p>Have some questions? Feel free to get in touch on Facebook - Just look for Dr. Bargak</p>", 
    "end_date": null, 
    "title": "Acupressure for Business: Get Healthy For Business Success!", 
    "price": "20.00", 
    "instructors": "Dr. Jakob Bargak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/500086_010c.jpg", 
    "course_url": "https://www.udemy.com/acupressure-for-business-get-healthy-for-business-success/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T15:51:48Z"
}