{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  Welcome to the Acupressure For Everyday Health - The Place on Udemy to treat Everyday Diseases with Acupressure Points!  </p>  <p>  \t<br style=\"\">  \t                                              √ Relieve your pain on your own Without Medications using Traditional Chinese Massage Points  </p>  <p>  \t                                              √ Easily find the right Massage Points with simple and professional Full HD Videoclips  </p>  <p>  \t                                              √ Points for Headache and Migraine Relief are in the Course.  </p>  <p>  \t                                              √ Points for Flu Relief are in the Course.  </p>  <p>  \t                                              √ Points for Allergy, Anxiety and Asthma Relief are in the Course.  </p>  <p>  \t                                              √ Points to Stop Smoking are in the Course.  </p>  <p>  \t                                              √ Points to Relieve Emergency are in the Course.  </p>  <p>  \t                                              √ Points to Relieve Depression are in the Course.  </p>  <p>  \t                                              √ Points to Treat Irregular Periods and other Common Women Diseases are in the Course.  </p>  <p>  \t              √ Points to Improve Memory are in the Course.  </p>  <p>  \t<br style=\"\">  \t                                              &quot;In short, it [Acupressure] provides maximum benefits without the dangerous side effects associated with many of the approaches of conventional medicine.&quot; <br style=\"\">  \t                                              -William Michael Cargile, B.S., D.C., F.I.A.C.A., Chairman of Research for the American Association of Acupuncture and Oriental Medicine  </p>  <p>  \t<br style=\"\">  \t                                              The Acupressure is perfectly suitable for you with these immediate benefits: <br style=\"\">  \t<br style=\"\">  \t                                              + You do not need to spend time visiting a doctor.  </p>  <p>  \t                                              + You do not need to spend a considerable amount of money.  </p>  <p>  \t                                              + There is no danger of being hurt, infected or experiencing pain.  </p>  <p>  \t                                              + You massage the points gently with your own finger.  </p>  <p>  \t<br style=\"\">  \t                                              The Massage Points to use are:  </p>  <p>  \t                                              √ especially effective  </p>  <p>  \t                                              √ easy to find, no need for someone else&#039;s assistance  </p>  <p>  \t                                              √ shown with professional Full HD Photos and Videos  </p>  <p>  \t<br style=\"\">  \t                                              &quot;With the Course, I could significantly reduce my headache. The points are easy to find using the videos. I am so happy to have the Course always on me, on my iPhone and iPad. All common health problems are covered!&quot; <br style=\"\">  \t                                              -Mr. Alin, Manager at BMW in Germany  </p>  <p>  \t<br style=\"\">  \t                                              Thousands have done it already. Now you can also take the Acupressure Course and help yourself on demand without medications and doctor visits.  </p>  <p>  \t<br style=\"\">  \t                                              For a fraction of a doctor&#039;s visit cost, you get a proven Acupressure Course for ever with free lifelong updates containing more massage points.  </p>  <p>  \t<br style=\"\">  \t                                              Have Fun with the Course! ENROL NOW!<br style=\"\">  \t<br style=\"\">  \t                                              Your Dr. Bargak <br style=\"\">  \t                                              - 30 years of successful acupuncture practice<br style=\"\">  \t<br style=\"\">  \t<br style=\"\">  \t                                              Have some questions? Feel free to get in touch on Facebook - Just look for Dr. Bargak  </p>", 
    "end_date": null, 
    "title": "Acupressure For Everyday Health - Heal Yourself Naturally!", 
    "price": "20.00", 
    "instructors": "Dr. Jakob Bargak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276670_048a.jpg", 
    "course_url": "https://www.udemy.com/acupressure-for-everyday-health-heal-yourself-naturally/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-07T16:15:20Z"
}