{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Willkommen bei der Akupressur-Akademie Teil 3 - der Ort bei Udemy, um Akupressur zu lernen! </p><p style=\"\">√ Lindern Sie Ihre Schmerzen ohne Medikamente selbst mit altbewährten Chinesischen Massagepunkten </p><p style=\"\">√ Finden Sie die richtigen Massagepunkte leicht mit einfachen und kurzen Full HD Videoclips </p><p style=\"\">√ Akupressurpunkte für Asthma und Depression sind im Kurs beinhaltet.</p><p style=\"\">√ Akupressurpunkte für sexuelle Potenz und Grippe sind im Kurs beinhaltet.</p><p style=\"\">√ Akupressurpunkte für Gesundheit auf Reisen und Gedächtnisverbesserung sind im Kurs beinhaltet.</p><p style=\"\">√ Akupressurpunkte für Lauftraining, Fussball und Yoga sind im Kurs beinhaltet.</p><p style=\"\">√ Akupressurpunkte für Ebola-Vorbeugung sind im Kurs beinhaltet. </p><p style=\"\">&quot;Kurz gesagt, [Akupressur] bietet den maximalen Nutzen ohne gefährliche Nebenwirkungen, die mit vielen Ansätzen der konventionellen Medizin verbunden sind.&quot; -William Michael Cargile, B.S., D.C., F.I.A.C.A., Forschungsvorsitzender des Amerikanischen Verbunds der Akupunktur und Orientalischen Medizin</p><p style=\"\">Die Akupressur ist wunderbar für Sie geeignet und mit dem Kurs sofort anwendbar. Denn:</p><p style=\"\">√ Zeitraubende Arztbesuche sind nicht erforderlich.</p><p style=\"\">√ Nennenswerte Geldausgaben sind nicht notwendig.</p><p style=\"\">√ Es besteht keine Gefahr der Verletzung, Infizierung oder Schmerzen. </p><p style=\"\">√ Sie massieren die Punkte sanft mit Ihrem Finger. </p><p style=\"\">Die angebotenen Massagepunkte sind: </p><p style=\"\">√ besonders wirkungsvoll</p><p style=\"\">√ leicht und ohne fremde Hilfe zu finden</p><p style=\"\">√ mit professionellen Full HD Photos und Videos dargestellt </p><p style=\"\">&quot;Mit dem Kurs konnte ich meine Depressionen deutlich reduzieren. Mit den Videos aus dem Kurs sind die Punkte sehr einfach zu finden. Ich bin so froh, den Kurs immer dabei zu haben, auf meinem iPhone und iPad!&quot; -Dr. Umin, Manager at Siemens in Germany</p><p style=\"\">Tausende haben es bereits gemacht. Jetzt haben auch Sie die Möglichkeit, an diesem Akupressurkurs teilzunehmen. Damit werden Sie sich selbst ohne Medikamente und Arztbesuche behandeln können!</p><p style=\"\">Für einen Bruchteil der Kosten eines Arztbesuchs bekommen Sie einen bewährten Akupressurkurs zur lebenslangen Nutzung mit kostenlosen Updates, die weitere Massagepunkte beinhalten werden. </p><p style=\"\">Ich wünsche Ihnen viel Spass mit dem Kurs! Melden Sie sich jetzt an!</p><p style=\"\"><span style=\"\"></span>Ihr Dr. Bargak </p><p style=\"\">- 30 Jahre efolgreicher Akupressurpraxis </p><p style=\"\">Haben Sie noch Fragen? Gerne würde ich sie bei Facebook beantworten: suchen Sie einfach nach Dr. Bargak </p>", 
    "end_date": null, 
    "title": "Akupressur-Akademie: Gesund mit Chinesischer Massage, Teil 3", 
    "price": "20.00", 
    "instructors": "Dr. Jakob Bargak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507378_71d6_6.jpg", 
    "course_url": "https://www.udemy.com/akupressur-akademie-gesund-mit-chinesischer-massage-teil-3/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T18:30:44Z"
}