{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  Este curso ofrece información y consejos útiles para <strong style=\"\">mejorar nuestra alimentación y salud de forma sencilla en el día a día </strong>y explicación visual de cómo elaborar 28 recetas anticáncer que cubren todos los momentos, desde el desayuno a la cena, y que podemos integrar en el recetario familiar.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">¿POR QUÉ?</strong></em>  </p>  <p style=\"\">  \t  Existe una gran correlación entre lo que comemos y las enfermedades que desarrollamos. Habitualmente adoptamos la dieta y el estilo de vida del país en vivimos. Pues bien, según cual sea ese país, la repercusión del cáncer varía, así como la incidencia de los diferentes tipos de cáncer.  </p>  <p style=\"\">  \t El cáncer es una enfermedad con una alta prevalencia e incidencia. 1 de cada 3 hombres y 1 de cada 4 mujeres padecerán cáncer a lo largo de su vida.  </p>  <p style=\"\">  \t  El 90-95% de los canceres tienen un origen medioambiental, es decir están relacionados con nuestra alimentación y estilo de vida. El tabaco, el alcohol, la comida basura, el sedentarismo, la obesidad y el estrés crónico son la base de la enfermedad.  </p>  <p style=\"\">  \t  Según datos de la OMS, <strong style=\"\">del 30 al 40% de los cánceres se podrían prevenir con una buena alimentación</strong> basada en el consumo de productos frescos, integrales, locales y de temporada, principalmente vegetales y frutas. La comida rápida, los productos refinados y azucarados, el alcohol y el tabaco por el contrario nos predisponen a enfermar. La dieta que adoptemos no sólo influye en la prevención del cáncer, sino que también lo hace, y mucho, sobre la evolución y progresión de éste.  </p>  <p style=\"\">  \t  Al ser el cáncer una enfermedad estrechamente relacionada con la alimentación tenemos el poder de intentar <strong style=\"\">prevenir su aparición</strong> siguiendo una alimentación y estilo de vida saludable. En caso de estar enfermos, de la mano de la alimentación podemos <strong style=\"\">ayudar a que los tratamientos convencionales</strong> sean más efectivos y mejor tolerados.  </p>  <p style=\"\">  \t  La influencia de la dieta sobre el cáncer varía dependiendo del tipo de cáncer. En el caso del cáncer de próstata el peso de la dieta es de un 75%.  </p>  <p style=\"\">  \t  El curso está diseñado de forma que sea <strong style=\"\">comprensible y útil para la sociedad en general</strong>, tanto para aquellas personas que quieran prevenir y mantener la salud como para las personas enfermas.<br style=\"\">  \t<br style=\"\">  \t  Es un curso sencillo y práctico que queremos poner al alcance de todos para fomentar hábitos de alimentación saludables. Sobre todo,<strong style=\"\"> el objetivo es animar a pasar a la acción y empezar a comer “anticáncer”,</strong> es decir de manera saludable, desde que se realice el curso.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">¿CÓMO?</strong></em>  </p>  <p style=\"\">  \t  A través de 34 vídeos y 12 pdf con documentación escrita.  </p>  <p style=\"\">  \t  El curso se divide en 2 partes: TEORÍA compuesta por 9 vídeos y 6 pdf, y PRÁCTICA con 25 vídeos que explican 28 recetas anticáncer y 2 pdf con la información detallada.  </p>  <p style=\"\">  \t En la <strong style=\"\">primera parte teórica </strong>os enseñaremos que es el cáncer, como se desarrolla y cuáles son los factores que influyen en su aparición y evolución. Veremos qué alimentos y hábitos de vida se relacionan con la aparición de esta enfermedad. Os enseñaremos a cocinar estos alimentos y a planificar un menú semanal basado en los alimentos anticáncer.  </p>  <p style=\"\">  \t En la segunda parte os ofrecemos recetas de cocina saludables, os enseñaremos a cocinarlas y os ofreceremos consejos y trucos para mejorar vuestra alimentación. Recetas<strong style=\"\"> sin carne, sin pescado, sin lácteos, sin azúcar </strong>ni endulzantes  artificiales, sin trigo, sin huevos (menos 1 receta) pero con todo el  sabor y placer.  </p>  <p style=\"\">  \t Además, se ofrecen 4 BONUS EXTRA de libre acceso con la lista de los alimentos anticáncer, la lista de la compra saludable, bibliografía y presentación para que todos puedan tener estos datos.  </p>  <p style=\"\">  \t<strong style=\"\">BIENVENIDOS A UNA NUEVA FORMA DE CUIDARNOS Y DISFRUTAR</strong>  </p>", 
    "end_date": null, 
    "title": "Alimentación Anticáncer", 
    "price": "50.00", 
    "instructors": "María del Mar Jiménez Redal, Dra Odile Fernandez", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/69532_8ef9_6.jpg", 
    "course_url": "https://www.udemy.com/alimentacion-anticancer/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-25T07:07:47Z"
}