{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn how to improve health issues, just by sipping on the right kind of tea.</p>\n\n<p><strong>Build a Strong Knowledge Base on the Subject of TEA and its Potent Anti-Cancer Properties.</strong></p>\n\n\n\n<p>Learn the health benefits of TEA</p>\n\n\n\n<p>Obtain company secrets regarding their tea bags</p>\n\n\n\n<p>Discover 10 different cultural tea ceremonies</p>\n\n\n\n<p>Learn about 5 types of tea best for good health</p>\n\n\n\n<p><strong>A healthy addition to your diet for dynamic health</strong></p>\n\n\n\n<p>Learning the importance of drinking tea puts powerful and useful information at your disposal. Drinking tea is virtually effortless, and requires no special skill; it's tasty and very good for you, providing your cells with potent antioxidants and other vital nutrients your body needs to upgrade your health.</p>\n\n\n\n<p>Learn all about the fascinating TEA traditions from all across the globe. Tea is used by many cultures for medicinal purposes, to heal the sick and maximize the quality of life, while others just enjoy afternoon tea with friends as a social outing. Either way, you cannot go wrong by filling your pantry with the world's most popular beverage, besides water.</p>\n\n\n\n<p>This class is appropriate for all learning levels with 13 lectures and 1 hour of content. You'll study everything about TEA, one of the healthiest beverages of all time and establish a solid understanding of how these tea types can help improve your current health status. The main focus will be on a select 5 different types of tea that I found to be the most beneficial for dynamic health.</p>\n\n\n\n<p>Each section is comprised with a short exercise, putting your newly learned skills into practical use, instantly.</p>\n\n\n\n<p>This course will take you through the history and origin of tea and the many health benefits that comes from drinking it, like reducing chronic conditions such as heart disease, inflammatory disorders and keeping cholesterol levels down and our health and longevity prospects up. Tea has demonstrated a remarkably broad spectrum of health benefits that are widely recognized among Eastern medicine and beyond.</p>\n\n\n\n<p>Upon completion, you will gain a strong understanding on how sipping on a cup of your favorite tea can change your life for the better, by warding off sickness and dis-ease. Students completing this course will be able to enjoy the healing properties of drinking tea anytime. Also, you will receive a verifiable certificate of completion upon finishing the course.</p>", 
    "end_date": null, 
    "title": "All About Tea: Surprising Health Benefits You Should Know", 
    "price": "25.00", 
    "instructors": "Susanna K Green", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508428_e0dd_3.jpg", 
    "course_url": "https://www.udemy.com/all-about-tea-surprising-health-benefits-you-should-know/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T21:02:21Z"
}