{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Have you ever <strong>struggled to get out of bed</strong> in the morning or suffered from the dreaded mid-afternoon <strong>slump in energy</strong>?<br></p><p>Perhaps you sometimes <strong>can't find the words</strong> to finish your sentences? </p><p>Maybe you can't sleep at night or find it <strong>difficult to concentrate</strong>? </p><p>Maybe you just <strong>can't remember</strong> the last time you <strong>felt really good</strong>!</p><p>If any of those problems are familiar to you, then <strong>this course is for you!</strong></p><p>Many years ago, before I became a fitness &amp; nutrition coach, I worked an office job and it nearly killed me! This is the course that I wish I'd had access to back then.</p><p>Like a lot of people, I worked long hours and was really doing all the wrong things in terms of my health – not getting enough sleep, eating nasty food that make me stupid and tired. I always felt stressed, suffered from burn out and fatigue and all of those other things that busy people just take for granted. I was really very far from being at my best, and I didn't <em>really</em> understand why...</p><p>And that's so common today – because one thing that determined and driven people will always do is focus so much on their career, study, or family that they often exclude and neglect the other parts of their lives, (especially health) - never realizing how incredibly counter-productive that is! </p><p>Living this way only <strong>moves us away from success</strong> and <strong>prevents us from doing our best work</strong>. </p><p>The problem of course, is when you <strong><em>don't pay attention to yourself</em></strong>, you don't see the connection between <strong>how you feel</strong> and <strong>how poorly you sometimes perform</strong> in your job, or at life in general. </p><p><strong>It becomes so normal, that most folks don't even realize what their true potential could be!</strong></p><p>My <em>aim</em> with this course is to give you the knowledge to turn that around, so you can begin <strong>performing at your very best</strong> – that means things like …<strong>sleeping really well so you feel rested and ready to go in the morning</strong>, <strong>better food habits</strong> that give you tons of energy, and turn your <strong>brain power</strong> up a couple of notches. I'll explain why <strong>exercise</strong> can give you a reset and keep you feeling great everyday, as well as talking about how to <strong>deal with any stress</strong> you might have.</p><p>As you move through the course, you'll <em>gain a much better knowledge</em> of <strong>why</strong> your <strong>daily habits have an effect on your body</strong>, so it's not so much about following strict plans and prescribed routines...</p><p>...its about having that <em>understanding </em>of <strong>why the little things matter</strong>, so you can <strong>make simple and lasting changes that have massive benefits</strong> for everything you do.</p><p>The course is an introductory level course suitable for people of all backgrounds and no prior knowledge of health &amp; wellness topics is required.  It consists of over 2 hours of video, rich graphic presentations to help explain the topics, links to external resources, and PDF handouts.  </p><p>The lectures are divided into five sections covering the pillars of Healthy Habits for Peak Performance - Energy, Nutrition, Exercise, Sleep, Stress and Mindset, which you can review all at once, or chunk it down into smaller lessons to ease your learning.</p><p>By the end of this course, you will form new health &amp; lifestyle habits that will allow you to be at your best every day and become a superstar at work and in life – to be ready to take on any challenge or push through any problem.</p>", 
    "end_date": null, 
    "title": "An Introduction to Healthy Habits for Peak Performance", 
    "price": "20.00", 
    "instructors": "Ronan McClelland", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510884_c6f4_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-healthy-habits-for-peak-performance/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-25T13:00:45Z"
}