{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Success begins with hard work. Happiness begins with good health.</strong><br></p><p>A healthy body, mind and soul are essential to lead a wholesome life that allows one to capture the essence of living, rather than merely existing.<br></p><p>This shall contribute to a peaceful demeanour built on a foundation of stability and composure. Isn't that what we all yearn for?</p><p> <strong>Well, there is no need to look further to unlock the secrets to a healthy lifestyle.</strong> </p><p>It is as simple as eating right; knowing what to eat and when.</p><p>This course shall help you to achieve a robust life, by introducing you to food habits that give an extra bounce to your step and a sparkle in your eyes.</p><p><strong>Incorporating these habits shall also enable you to have a better body and mental stability; goodbye to obesity and hello to overall well being.</strong></p><p>A broad overview of the course is that it shall introduce you to simple eating habits which you might have been unaware of. We aim to pinpoint certain routines that may have been causing harm to your body than add nutritional value.</p><p><em>Taking care of your body is the first step to a happy life and a sound disposition.</em> </p><p>These lectures shall provide the key to the same. My greatest achievement would be if you understand these lectures and adopt them in your daily life to experience positive change today, tomorrow and always!</p><p><br></p>", 
    "end_date": null, 
    "title": "Ancient secret to optimal health. Change within 1 week!", 
    "price": "20.00", 
    "instructors": "Danish Sinha", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557084_a100_10.jpg", 
    "course_url": "https://www.udemy.com/optimal-health-in-48-days/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T10:53:20Z"
}