{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Do you suffer from dull, yellow teeth?</p>    <p>Are you tired of hiding your smile in photos?</p>    <p>Are you looking for a fast, safe, and effective way to brighten your smile?</p>    <p>Do you want to avoid paying over $500 for teeth whitening at the dental office?</p>    <p>If you’ve answer YES to any of those questions, then this is the right course for you!</p>    <p>Learn the complete guide to affordable at-home teeth whitening for beginners. I will give my professional recommendations as a dental provider on the best and most effective ways to get a bright, white smile!</p>    <p><strong>Content and overview</strong></p>  <p>Suitable for beginners, through this course of over 21 lectures, you’ll learn everything you need to know about whitening your teeth at home. </p>    <p>Starting with the basics of teeth whitening, this course reviews and explains the most commonly misunderstood teeth whitening topics, such as: how at-home teeth whitening works, causes of tooth discoloration, the safety of teeth whitening and so much more.</p>    <p>With these basics mastered, the course will take you through my most highly recommended at-home teeth whitening products, an abundance of professionally recommended tips and tricks for preventing teeth sensitivity and staining and also the best ways to maintain long term whitening results.</p>    <p>By signing up for this course, you will receive lifetime access to: </p>  <ul><li>Hands-on demonstrations</li><li>Diagrams</li><li>Pictures</li><li>Printable PDF documents</li><li>Downloadable content</li><li>Even access to DISCOUNTED teeth whitening products!</li></ul>              <p><br></p><p>Students completing this course will have the knowledge to achieve a bright white smile at home, for a fraction of the cost!</p>    <p>What are you waiting for, enroll today!</p>", 
    "end_date": null, 
    "title": "At-Home Teeth Whitening: How to Easily Whiten Your Smile", 
    "price": "50.00", 
    "instructors": "Jasmine Williams RDH,BSDH", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/704340_405a.jpg", 
    "course_url": "https://www.udemy.com/at-home-teeth-whitening/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-23T02:29:47Z"
}