{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong><em>Take the improvement of your child's condition in your own hands by taking this course today, over 1100 enthousiastic students already enroled!</em></strong></p><p><strong><em>Congratulations on reaching this page: this course is the No1 rated Udemy Course on Autism (students choice, as of November 21st, 2015, based on the quality and quantity of reviews!)</em></strong></p><p>After working for 5 years with ASD individuals I decided to create a practival guide for parents that are facing the diagnosis of the spectrum. </p><p>This course is a useful tool for parents that face the diagnosis of an autistic spectrum disorder. <strong>Genetic factors</strong>, <strong>causes of autism</strong> are discussed, along with the <strong>factors that aggravate the autistic symptoms after birth</strong>. <strong>A specific nutritional approach </strong>is needed in order for the brain cells to work properly, but <strong>external stress factors</strong> such as negative behaviour towards the individual is something that has to be considered as well.</p><p>In this course, a few new symptoms-relieving techniques will be discribed including Quantum biofeedback, Neurofeedback, Crystal Light Therapy, meditation techniques and other useful methods that can <em>decrease the symptoms of autism amazingly fast!</em></p>  <p>  \t<strong><em>#########################</em></strong>  </p>  <p>  \t    What other students say about this course:  </p>  <p>  \t<strong>Silviu M:</strong>  </p>  <p>  \t<em>I recommend this course as it's clear and comprehensive!</em>  </p>  <p>  \t<em>Elena is definitely an expert in her field and I enjoyed the way she presented the course - high-quality information, structured video lessons, practical examples. I really liked that she encourage the students το deal with the causes and not just with the symptoms of autism.</em>  </p>  <p>  \t<em>As a parent who maybe has a child with autism or as a healthcare / alternative practitioner, you can learn the best methods to use in order to improve your child autistic symptoms using non invasive techniques - such as alternative therapy or quantum biofeedback. Again, a highly recommended course!</em>  </p>    <p>  \t<em><strong>Mr Parys: </strong></em>  </p>  <p>  \t<em>Everything you need to know about Autism</em>  </p>  <p>  \t<em>Once a school teacher myself and having to work with special education students I found this course to be very informative. It covers everything you will need to know about Autism in an engaging way. Elena gives nothing but practical and useful information. Great instructor, great information, great course!</em>  </p>  <p>  \t<strong><em>#################</em></strong>  </p>", 
    "end_date": null, 
    "title": "Autism: an Instant Cognition Improvement Course!", 
    "price": "30.00", 
    "instructors": "Elena Seranova", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/349758_c560_7.jpg", 
    "course_url": "https://www.udemy.com/a-holistic-approach-to-autism/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T08:39:43Z"
}