{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong><em>\"This is one of the best massage courses i have ever taken!\"</em></strong><br></p><p><strong><em>\"I had gotten to a point where I wasn't sure if this was a career I really wanted to continue but now I have a renewed sense of passion!\"</em></strong></p><p><strong><em>\"Two Giant Thumbs Way Up!\"</em></strong><br></p><p><em></em><strong><em>\"Excellent and expert instruction. Beautiful videos. These methods are far superior to what we were taught in aesthetic and spa training classes.\"</em></strong></p><p><strong><br></strong></p><p><strong>When it comes to a massage clinic or spa, your best asset is your massage. Without an incredible massage sequence and techniques, it will be very difficult to have a thriving practice.</strong>  </p>  <p>  \t<strong>This course will give you the skills set to give your clients an amazing relaxation massage experience.</strong></p>  <p>  \t<strong>      The Isla Verde spa is the No.1 Ranked Spa on Tripadvisor in their highly competitive region and at one point had 100 out 100 reviews ALL 5 STAR!</strong></p>  <p>  \t                                  It doesn't matter whether you have done massage before or have no experience at all.  </p>  <p>  \t        Mark guides you step by step and shows you not only what his 20 years of experience has helped him, but also he shows you the ways to avoid the mistakes that he has made along the way.  </p>  <p>  \t                    In this course you will learn:  </p>  <ul>  \t<li>Our Full Body Relaxation Massage sequence</li>  \t<li>The Do's and Don'ts of setting up your massage room</li>  \t<li>Correct Body Alignment and Postural Problems</li>  \t<li>How to Set up the right atmosphere for your Client</li>  \t<li>The Importance of First Impressions</li>  \t<li>Plus so much more!</li>  </ul>  <p>  \t                    The most important aspect to any spa or massage clinic is the quality of the massages, because without the ability to deliver great massages most therapists will not succeed and be taken over by the competition in this highly competitive industry.  </p>  <p>  \t              You will be shown not only our secrets to giving incredible massages to your clients, but also know how to use your body correctly and avoid the pitfalls that many therapists fall into. <strong>For the cost of a couple of massages you can enroll in this course and set yourself up for life as a Great Relaxation Massage Therapist!</strong></p>", 
    "end_date": null, 
    "title": "Award Winning Isla Verde Spa Relaxation Massage Masterclass", 
    "price": "20.00", 
    "instructors": "Mark Perren-Jones", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/293170_2550.jpg", 
    "course_url": "https://www.udemy.com/award-winning-isla-verde-spa-relaxation-massage-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-03T13:44:17Z"
}