{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t This course is designed for students of all kinds whose main desire is to focus on preventative health care.  It is no secret that in these modern times, we have deviated slightly from a holistic perspective.  What does that mean?  That we have forgotten that we are all interconnected beings, not only with other humans, but with nature itself.  What happens in nature, happens in us.  We are the five elements.  Learn what those five elements have to do with your health.  </p>  <p>  \t This topic and many more may be found in this course.  Most people are looking for a way to lose weight and find their original weight; that is as a result of an imbalance.  In this course you will also find a very thorough assessment so that you may better get to your perfect state of balance and discover in which area(s) you are out of balance.  </p>  <p>  \t This course is a comprehensive compilation of the most fundamental and basic topics of Ayurveda.  Yet, don&#039;t be fooled that because it is a foundational course it is not powerful!  The exact topics that you are about to learn are the ones that have kept me healthy for the past eight years without having to visit a doctor.  I no longer suffer from any ailments that would blow up into a full manifestation of dis&quot;ease&quot;.  </p>  <p>  \t Ayurveda is yoga&#039;s sister science, and they both act as an integrative system for healing, bringing awareness to your consciousness, and transformation to all levels of your existence.  This is no small matter.  The time has come to expand your horizons and explore what other methods of prevention have to offer.  Invest in your most valuable commodity - your health.  </p>", 
    "end_date": null, 
    "title": "Ayurveda Basics", 
    "price": "50.00", 
    "instructors": "Janet M Perez", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/264788_e62d_7.jpg", 
    "course_url": "https://www.udemy.com/ayurveda101/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-19T20:57:24Z"
}