{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Do you feel exhausted after each day? Do you wake up tired? Do you feel like you&#039;re not &quot;firing on all cylinders&quot;?</em>  </p>  <p style=\"\">  \t<strong style=\"\">Do you want to have an abundance of TRUE ENERGY?</strong>  </p>  <p style=\"\">  \t      Have you ever met people who seem to be able to do it all? Work a full day, manage their household and affairs, see friends and family and still get a full day in either side of their regular work day? They seem to run on endless energy. How do they do it? They seem to sleep less than you, work more, live more and enjoy themselves more.  </p>  <p style=\"\">  \t      The truth is, to do any of that, to live a full and vibrant life, takes an incredible amount of ENERGY. But how do you get it?  </p>  <p style=\"\">  \t<strong style=\"\">My Story and why this matters to you</strong>  </p>  <p style=\"\">  \t      Several years ago I admitted that something in my life wasn&#039;t working. I couldn&#039;t put my finger on what it was. Just that something needed to change. I wasn&#039;t feeling &quot;fired up&quot; by life. I was just going through the motions. During the week I got up, went to work, came home (sometimes going to the gym after work), cooked, ate, watched TV, went to bed only to wake up the next day and do it all again. And again. And again. And….well, you get the picture. By the time the weekend came, I had usually spent Friday night enjoying the pleasures of life too much to have a full productive weekend.  </p>  <p style=\"\">  \t      During the week I was thinking how when the weekend came I would finally make a start on that project I&#039;d been hoping to do. Be that write a book, learn a new skill or whatever. Why the weekend? Well, during the week there simply wasn&#039;t the time or energy. And therein lies the problem.  </p>  <p style=\"\">  \t      Most people I knew then, and know now too, are simply &quot;going through the motions&quot;. Surviving life, but not thriving. No snap. No crackle. And no pop. Ultimately no energy.  </p>  <p style=\"\">  \t<strong style=\"\">Why is this important to you?</strong>  </p>  <p style=\"\">  \t      Because I&#039;ve been there. I know what it&#039;s like to have all these things you want to do, if only you had more time. More energy.  </p>  <p style=\"\">  \t      I got to a point that I realised, if things in my life were going to change, then <strong style=\"\">I</strong> had to change. And so I set about changing them. My journey started off slow. Listening to and reading personal development. Then attending courses. And more courses. Reading books, following guru&#039;s. Listening to what they were saying about success, relationships and more. What was clear though, was to achieve any level of success, I needed more energy. So I started listening to what it took to live with energy. Live with not just an absence of dis-ease, but true health. True vitality.  </p>  <p style=\"\">  \t      In the process I not only increased my daily energy levels, I seemed to need less sleep (1-2 hrs less a night!), hardly ever got ill and had a renewed sense of focus and clarity.  </p>  <p style=\"\">  \t      It transformed things for me on such a level that I started to coach others, speak on the subject and even founded <a href=\"http://thethoughtgym.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">The Thought Gym</a>, to reach a wider audience.  </p>  <p style=\"\">  \t<strong style=\"\">What about this course?</strong>  </p>  <p style=\"\">  \t      I took the fundamentals of what I learnt. The commonalities across all the tools, strategies and advice I spent years learning and synthesised them into a simple, practical and easy to use framework for anyone to follow.  </p>  <p style=\"\">  \t      Most of what I teach is so simple you might think - duh! But trust me when I say this. Unless you are really living it, you won&#039;t realise the benefits. The secret to energetic living doesn&#039;t have to be that complicated. You will get 80, 90%%%% of the way there with the fundamentals. If you truly embody them, you&#039;ll get even further.  </p>  <p style=\"\">  \t<strong style=\"\">Course Details</strong>  </p>  <p style=\"\">  \t      This course is structured into 6 modules where I cover the four main components of my framework for energetic living.  </p>  <p style=\"\">  \t      This course has over 5.5 hrs of video training from me personally (and 20 handouts) and is a comprehensive course designed to give you what you need to know to move forward in your life - <strong style=\"\">with energy</strong>.  </p>  <p style=\"\">  \t      Along with the video training lectures, there are a number of supplementary materials to print out and review. These are well worth it and will help from a practical point of view to implement some of the suggestions, as well serve as reminder for you, or be references for further research.  </p>  <p style=\"\">  \t      You should take this course only if you:  </p>  <ol style=\"\">  \t<li style=\"\">Want to have increased health, vitality or energy.</li>  \t<li style=\"\">Want to accomplish more in your given 24hrs than you do currently.</li>  </ol>  <p style=\"\">  \t      The solutions I provide come from my own personal experience and what I&#039;ve seen work for others.  </p>  <p style=\"\">  \t      If you apply these principles, I know that you will transform your life, as I have mine and the people that I work with.  </p>", 
    "end_date": null, 
    "title": "B.E.A.T. Tiredness -  4 Keys to Unlocking AMAZING Energy", 
    "price": "50.00", 
    "instructors": "Hari Kalymnios", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/157880_ca91_12.jpg", 
    "course_url": "https://www.udemy.com/beat-tiredness/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-04T14:18:10Z"
}