{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tWE have all been HERE !  </p>  <p>  \t  You’re wide awake. It’s the middle of the night… you’re tossing and turning and getting mad at yourself because you can’t settle back down to sleep.  </p>  <p>  \tYou know the alarm will go off much too soon and you’ll be exhausted all day.  </p>  <p>  \tIf you have difficulty settling down for the evening as you get into bed because you’ve had a full and busy day, or if you find yourself counting sheep in the middle of the night, you know will be tired and unhappy the next day and that makes getting to sleep and staying asleep even more difficult.  </p>  <p>  \tThis guided visualisation and breath practice takes away all the frustration and releases tension you feel in your body. You will return to restful sleep and really allow your body to recover and you’ll feel fresh and ready for the next day.  </p>  <p>  \t<u>The 7 benefits of the 7 minute classes</u>  </p>  <p>  \t      1. The techniques are EASY &amp; VERY QUICK to learn and beneficial for everyone.  </p>  <p>  \t      2. Classes are only 7 minutes and you can do them anywhere, anytime.  </p>  <p>  \t      3. It’s a new way to physically relax your body, &amp; calm your mind to increase happiness.  </p>  <p>  \t      4. Many of the breath classes can be done in public – when YOU need them most!  </p>  <p>  \t      5. These NEW techniques gives you the tools to cope with everyday stresses.  </p>  <p>  \t      6. The breaths classes really work – they do what they say, and you will feel instant relief!  </p>  <p>  \t        7. You will feel in control of your body and mind &amp; YOU GET SOME HEALING SLEEP  </p>  <p>  \t      You can also use this wonderful technique to relax yourself so that you can fall asleep easily and enjoy a more restful sleep. Includes:  </p>  <p>  \t      ● Lifetime access to Fully Guided Video with extra setup tips  </p>  <p>  \t      ● Fully Guided Audio with extra setup tips  </p>  <p>  \t      ● Guided Audio that you can put on repeat for a deeper experience  </p>  <p>  \t      ● Printable PDF’s with set up tips and extra information that will help you get the most out of your new skill  </p>", 
    "end_date": null, 
    "title": "BACK to Sleep - 7 Minutes to no frustration & no toss-turn ", 
    "price": "35.00", 
    "instructors": "Millie Swann", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296836_c705_5.jpg", 
    "course_url": "https://www.udemy.com/back-to-sleep-7-minutes-to-no-frustration-no-toss-turn/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T05:12:07Z"
}