{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>200 students enrolled within the first hour of launch!</p><p>New lecture added April 12, 2016.</p>\n\n<p>New lecture added January 1, 2016<br></p>\n\n<p>\"<em>Paula is a wonderful teacher and presenter. The materials are great and offered in a very motivating way. Very convincing stuff! Thank you so much Paula</em>.\" Rainer W<br></p>\n\n<p><strong>____________________________________</strong><br></p>\n\n\n\n<p>Most people don't spend any time thinking about their balance until it's too late - when they actually fall or injure themselves. But balance isn't just a concern for the elderly who are more prone to falls (and the serious complications those falls can cause). Balance training is important for health-conscious pupils who wish to age well, avoid falls, improve athletic ability, coordination, stamina and overall fitness and health.</p>\n\n\n\n<p>If you haven't thought much about maintaining - or improving - your balance, now is a good time to start. Most of the exercises I've put together in this course involve activities to improve balance. Balance is a component of health that you must never overlook; without it, all of the weight training and exercise in the world won’t help you.</p>\n\n\n\n<p>In order to have good balance, you rely on the information given to your brain from three main body systems: your ears, the nerve endings in your muscles, and your eyes (vision).</p>\n\n\n\n<p>As children, we develop balance climbing trees, walking and running on unsteady surfaces, sports, games etc. As adults, we seldom think about balance and rarely practice it. When was the last time you climbed a jungle gym, walked over a log or trying to balance on one leg with your eyes closed? We do all of this and much much more in the course.<br></p>\n\n\n\n<p>Your sense of vision is a big part of good balance. Vision works hand in hand with the inner ear to maintain balance. If you move your eyes or take vision out of the equation altogether, it's harder to balance. You might be surprised how challenging it is to simply stand with your eyes closed. We play a lot with removing vision during some of the more advanced exercises in this course.<br></p>\n\n\n\n<p>By using the balance techniques in this course, you will start to really pay attention to your body as you exercise, and should notice improvements in your balance, coordination, POSTURE, core strength, agility and athletic skill. You even burn more calories during balance training! These exercises can be used to build confidence when you are trying new fitness programs and taken with you as you age to help prevent spills and falls.<br></p>\n\n\n\n<p>Balance training is good for people of every age, so don't be afraid to start incorporating these exercises into your daily workouts. Everyone can benefit from the exercises in this course, and it's a really fun course; so you may not even notice that you are exercising!<br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Balance Exercise for Beginners", 
    "price": "25.00", 
    "instructors": "Dr Paula Moore", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619594_002c_2.jpg", 
    "course_url": "https://www.udemy.com/balance-exercise-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T19:01:04Z"
}