{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Maybe you have broken a bone before and are curious about what happened inside the body while it was healing, or maybe you are studying for a test that covers bone healing in medical school or high school.  For anyone in this situation, this course is quick review that covers the structure and function of bones and how they heal.</p><p style=\"\">We all know what bone is, but not everyone is aware of all of its functions.  It&#039;s more than just a support structure that prevents you from looking like a jellyfish!  This course will give you a good understanding of what bones do besides just that.  Learning bone function and form will prepare you for the rest of this course.  For example, the course covers the basic kinds of cells and how they are arranged.  </p><p style=\"\">In order to take this course, there is only one requirement:  that you have bones and know what they are.  No invertebrates allowed! Beyond that, everything else is explained.  Some grade-school level science and biology would certainly help get you through it too. Nevertheless, it is not just the people new to this subject that can benefit from the course.  Doctors and nurses who want a quick refresher can gain from participating as well.  This course has a way of speaking to everyone at all levels.</p><p style=\"\">Dr. Josh Simon is a Biomedical Engineer specializing in bone tissue engineering and has worked on numerous medical device projects to develop orthopedic devices.  As one of his favorite subjects, basic bone healing is taught throughout this course with a lot of passion, a little humor, and a wealth of knowledge.</p>", 
    "end_date": null, 
    "title": "Basic Bone Healing", 
    "price": 0, 
    "instructors": "Josh Simon", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542748_96ab_2.jpg", 
    "course_url": "https://www.udemy.com/basic-bone-healing/", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T01:56:47Z"
}