{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Help yourself and your relatives live full and happy lives free from diseases and bad habits!</strong>  </p>  <p style=\"\">  \t                          If you or your relatives have problems with health, alcohol, or nicotine dependence, I’m ready to help you right now!  </p>  <p style=\"\">  \t                          My name is Emelianov Anatoly. I’m a parapsychologist and psychic. My extrasensory abilities were inherited from my grandfather and father. Every day many people come to me. Every day I receive patients. But unfortunately, I cannot consult everybody face-to-face. My aim is to use my abilities in the most productive way to help as many people as possible. That is the reason I’ve decided to make a video course that can help even those who cannot come to see me. The video has the same effectiveness as if one had visited me personally. I’ve been practicing my healing sessions since 1982. Since then, <strong style=\"\">I’ve successfully treated more than 3,000 people.</strong>  </p>  <p style=\"\">  \t                          Traditional medicine cannot offer any drug that is able to treat you totally. It gives nothing but a temporary relief and negative consequences at the same time.  </p>  <p style=\"\">  \t                          Moreover, modern medicine will never want you to be healthy. The medical industry, as all the other industries, is aimed at constant and increasing profit. Do you think drug producers are interested in your treatment? Who will buy their products if you don’t? They would be bankrupt. This is obvious.  </p>  <p style=\"\">  \t<strong style=\"\"> - How do you treat yourself once and for all?</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong><strong style=\"\">- How do you regain health?</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong><strong style=\"\">- How do you make all your illnesses stop troubling you and start feeling really healthy?</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong><strong style=\"\">- How do you give up drinking and smoking?</strong>  </p>  <p style=\"\">  \t                          There is a very simple, effective, and proved solution. I’m talking about my unique healing sessions, which have no analogs in the world.  </p>  <p style=\"\">  \t                          People are so desperate, that they are ready to give away all their savings to regain health and to feel power and energy again. Scientists all over the world are trying their best to find a universal remedy for old age and illnesses. There’s no need to pay huge sums of money and no need to invent anything. Human nature is wise enough to treat itself. Yes, it’s true. Every organism can restore itself naturally. All you need is to open this ability in yourself. How? With the help of my healing video sessions!  </p>  <p style=\"\">  \t                          My system has nothing in common with any of the existing methods. I help to bring consciousness, subconsciousness, and biofield into compliance. My system doesn’t treat local problems; it treats the organism as a whole. It removes illnesses themselves – not just the symptoms. It is necessary to provide problematic organs with a flow of energy (this can be done only on the biofield level) and remove blocks from our consciousness and subconscious.  </p>  <p style=\"\">  \t                          When your consciousness is “awake,” this is difficult to do; your thoughts don’t let you do this. It is impossible to throw the illness off if you think about it every second. At the same time, it cannot be done in a state of deep sleep. One needs to be plunged into a specific state on the edge of sleep and wakefulness. This state is called meditation, prayer, or trance. All the religions use this state for a reason – it is a basis of many spiritual energetic practices. Even traditional medicine uses it in the form of hypnosis. In this wonderful state, the consciousness is sleeping and doesn’t create obstacles for healing powers. On the contrary, the subconscious starts working with double force.  </p>  <p style=\"\">  \t                          While watching my video sessions, this state is turning on, and a healing mechanism is being started stage by stage:  </p>  <p style=\"\">  \t <em style=\"\">-The energetic matrix is restored (wholeness of biofield).  </em>  </p>  <p style=\"\">  \t <em style=\"\">-The energetic system is restored (energy inflow).</em>  </p>  <p style=\"\">  \t <em style=\"\">-Healing information comes inside (to consciousness and subconscious).</em>  </p>  <p style=\"\">  \t <em style=\"\">-Illness disappears on an energetic level.</em>  </p>  <p style=\"\">  \t                          The physical body duplicates the energetic one, and the illness disappears on the physical level as well!  </p>  <p style=\"\">  \t                          You recuperate totally – whether you want it or not! (Still, your desire to be healthy is necessary to prevent illness from coming back to your consciousness).  </p>  <p style=\"\">  \t                          It looks like a miracle, but it works! You just start the mechanism of organism self-healing.  </p>  <p style=\"\">  \t <strong style=\"\">           I should repeat - all illnesses will disappear:</strong>  </p>  <p style=\"\">  \t<em style=\"\">- Whether the diagnostics were made or not</em>  </p>  <p style=\"\">  \t<em style=\"\">- Regardless if the illness has a physical or mental nature</em>  </p>  <p style=\"\">  \t                          The story of every patient is unique. But the common link is that they all are healed with the help of my sessions!  </p>  <p style=\"\">  \t <strong style=\"\">           As a gift, this course includes two special sessions that can rescue you from alcohol and nicotine dependence!</strong>  </p>  <p style=\"\">  \t                          You won’t have to wrestle with yourself. No agony. No backslides. Everything is fine on the subconscious level once and for all.  After a couple of sessions, you will feel that the desire for alcohol and cigarettes is waning, and it tastes disgusting to you. Feel full of life without alcohol and cigarettes and help those who need it!  </p>  <p style=\"\">  \t                          The present course is made to help you get rid of any diseases and stop drinking and smoking.  </p>  <p style=\"\">  \t<strong style=\"\">The course consists of three video sessions:</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">1) Session 1: “Be Free of Diseases!”</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">2) Session 2: “Stop Drinking!”</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">3) Session 3: “Quit Smoking!”</strong>  </p>  <p style=\"\">  \t                          In order to make it more comfortable to watch, each video session is divided into two parts. In the beginning of each session I give necessary recommendations about the proper way of watching my sessions.  </p>  <p style=\"\">  \t                          If you want to feel the effectiveness of my sessions, you should watch them every day for one to two months. You will never find anything like this anywhere. These are truly unique healing sessions!  </p>  <p style=\"\">  \t                          I believe every man in the world is obliged to be healthy!  </p>  <p style=\"\">  \t<strong style=\"\">  Live without illnesses </strong><strong style=\"\">and bad habits!</strong>  </p>", 
    "end_date": null, 
    "title": "Be Free of Diseases! Stop Drinking! Quit Smoking!", 
    "price": "45.00", 
    "instructors": "Emelianov Anatoly", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/109678_8c8e_55.jpg", 
    "course_url": "https://www.udemy.com/be-free-of-diseases-stop-drinking-quit-smoking/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-23T15:30:47Z"
}