{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">In this first class of The Wellness Solution, &quot;Health and Wellness Defined&quot; you will learn what true Health and Wellness are and how to begin implementing easy strategies to improve your own health.  Each module will give you easy home based strategies for eating better, getting fit, losing weight, what supplements to take and which to avoid, how to do a cleanse, stress management and much more.  </p><p style=\"\">More about all twelve classes:</p><p style=\"\"> <strong style=\"\">QUICKLY TRANSFORM YOURSELF</strong> </p><p style=\"\"> <strong style=\"\">This wellness &amp; rejuvenation program aims to transform your body &amp; mind to a healthier, more confident, energetic &amp; attractive you.</strong> </p><p style=\"\"> <strong style=\"\">Did you know that 98% atoms that make up your body will be replaced yearly? We lose and replace millions of cells every second. Our wellness program is designed to maximize this replacement process so that you are transformed to a healthier, more energetic, more attractive and confident you. You will be amazed at the difference.</strong> </p><p style=\"\"> <strong style=\"\">Here are some of the things you will learn: </strong> </p> <strong style=\"\">The Wellness Solution</strong> <p style=\"\"> <strong style=\"\">Begin Your Wellness Transformation!</strong> All you need to know about beginning your health transformation in an easy to follow program you can begin immediately. </p><p style=\"\"> <strong style=\"\">Creating your Personalized Wellness and Rejuvenation Plan!</strong> You can easily measure where you are starting and where you want to go with your health. If we have kids we all want to be active with them for a long, long time. Starting now implementing your health goals will make sure that happens. </p><p style=\"\"> <strong style=\"\">Customizing your Fitness and Nutrition Program!</strong> Many people don&#039;t know where to start. Well, we let you know easy steps to start exercising and eating right. Not only will you improve your health, you will enjoy the process. </p><p style=\"\"> <strong style=\"\">Avoid the Hidden Toxins Endangering you Wellness Transformation!</strong> How environmental toxicity and nutritional deficiencies have likely been sabotaging your health and wellness. It is much easier to change these habits than you think! </p><p style=\"\"> <strong style=\"\">Do you Need Supplements and Medications to Treat Diseases?</strong> Did you know you can save thousands of dollars by knowing that you don&#039;t need to take every vitamin promoted as the “next best thing&quot;? Did you know that by improving your health your body may not need that medication anymore? </p><p style=\"\"> <strong style=\"\">How to Eat Healthy and Love Every Bite of it!</strong> It isn&#039;t very hard to change those eating habits to he healthy. You will be surprised at how good healthy foods can be. </p><p style=\"\"> <strong style=\"\">Get Rid of those Toxins without Starving Yourself</strong> It&#039;s like changing your oil. We need to get rid of those bad things that accumulate in our body. We&#039;ll teach you how to do it and make it easy. </p><p style=\"\"> <strong style=\"\">Stuck Finding Healthy Recipes? We got you covered!</strong> Preparing healthy recipes you and your kids is easier than you think. </p><p style=\"\"> <strong style=\"\">How would you like to improve your fitness in only 15 minutes a week?</strong> There are many exercise &#039;gurus&quot; out there. We will teach you the easiest and best ways to improve your fitness. </p><p style=\"\"> <strong style=\"\">Are You Stressed? What Should You Do?</strong> How would you like to manage your stress with a 1 minute mind exercise? You will feel better, think better and improve your productivity and performance.  <strong style=\"\"></strong> </p><p style=\"\"> <strong style=\"\">How Would You Like To Improve The Function of Every Cell, Tissue and Organ of Your Body?</strong> We will teach you how to recognize when you are not functioning correctly and what to do about it. </p><p style=\"\"> <strong style=\"\">Achieve all Your Dreams, Wishes and Goals!</strong> A few simple steps can start you on the path to get everything you want in life. </p>", 
    "end_date": null, 
    "title": "Become an Expert in Health and Wellness", 
    "price": "20.00", 
    "instructors": "Greg Haitz, Dr Daniel Lonquist", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456780_05e0.jpg", 
    "course_url": "https://www.udemy.com/the-wellness-solution-health-and-wellness-defined/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T15:01:31Z"
}