{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tAre you ready to <strong>stop dieting and start living?</strong>  </p>  <p>  \t<strong> </strong>I mean really living... where you wake up <strong>excited and energized and go to sleep feeling fulfilled.</strong>  </p>  <p>  \tAlmost like you&#039;re... <strong>SUPERHUMAN?</strong>  </p>  <p>  \t         The foundation for this kind of life lies in your <em>physical</em> and <em>psychological health</em>.  </p>  <p>  \t         This course teaches you the strategies and psychology to unlock the <strong>body and mind of your dreams.</strong>  </p>  <p>  \tEach section was crafted to make sure that you not only adopt this <strong>HEALTHY LIFESTYLE</strong>, but that you <strong>SUSTAIN</strong> it as well<strong>!</strong>  </p>  <p>  \t         Every video in this course is going to get you another step towards having the <strong>body of your dreams</strong> and <strong>experiencing an abundance of pleasure.</strong>  </p>  <p>  \t         If you&#039;re wondering.. &quot;Does it really work that easy?&quot; Truthfully the answer is &quot;yes&quot; and &quot;no&quot; this course is a lot of work, but it&#039;s also a ton of fun! It delivers on all it&#039;s promises as long as you deliver on your effort and persistence.  </p>  <p>  \t         I was once a <em>250 pound slob</em> and the time came to where I needed a serious shift. I got degrees in exercise physiology, psychology AND nutrition, became obsessed with staying up to date on the most current research and learned the secrets to creating the body and mind I always wanted. At the end of my transformation I was about <em>195 pounds</em> and a <em><strong>Professional Fitness Model </strong></em>working with Nike on a regular basis.  </p>  <p>  \t         How to take this course on?  </p>  <p>  \t         Since I created the course I would say DO IT ALL IN A WEEK, but if that seems intimidating test out one section at a time and watch as your life transforms.  </p>  <p>  \t         Sound pretty good?  </p>  <p>  \t         Then here’s what you should do next..  </p>  <p>  \t         *Scroll back up to the top of the page and click the &quot;Take This Course Button&quot;*  </p>  <p>  \t         I will personally respond to any questions you may have as you go through the course so there&#039;s no worry if you&#039;re not sure how to take all of the information and apply it to your life...  </p>  <p>  \t         So I&#039;m going to stop typing now and you&#039;re going to... Sign up now!  </p>  <p>  \t         Sincerely,  </p>  <p>  \t         Brandon Epstein - Your Personal Fitness Coach  </p>  <p>  \t         P.S. if you want to know EXACTLY what&#039;s in this course check out the outline below.  </p>  <p>  \t          The course will take approximately 5 days to take if you spend about an hour a day on the course. Each day you will learn a new form of mastery.  </p>  <p>  \t          Day 1) You will be introduced to the course and you will get clear on exactly how you want to look and feel for the rest of your life. You will then learn mastery over nutrition. This means you will finish this module knowing exactly what to eat, when to eat and how much to eat of it. Along with this you will learn cutting edge strategies to help you burn fat faster than you&#039;ve ever imagined possible.  </p>  <p>  \t          Day 2) You will learn how to create and sustain unlimited and powerful energy. That means waking up excited and staying energized all day.  </p>  <p>  \t          Day 3) You will learn the most efficient and effective exercise routines for burning fat and gaining lean muscle.  </p>  <p>  \t          Day 4) You will learn how to master your mind. Through psychological training you will learn how to become more productive, more happy and more unstoppable than you&#039;ve ever been. This is a module of the course dedicated to teaching you how to sustain states of immense pleasure.  </p>  <p>  \t          Day 5) You will learn Bio Hacks, which are short cuts to helping you reach your goals faster. These bio hacks will make everything else you do more effective and get you where you want to be even faster.  </p>", 
    "end_date": null, 
    "title": "Become SuperHuman: Unlock the Body and Mind of Your Dreams", 
    "price": "20.00", 
    "instructors": "Brandon Epstein", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/218122_e150_10.jpg", 
    "course_url": "https://www.udemy.com/thinkandeatrich/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-14T06:06:32Z"
}