{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t   Dieser spezielle Video-Kurs schenkt Ihnen ein neues Lebensgefühl. Sie fühlen sich aufrechter, beweglicher und freier in den Gelenken. Schmerzen können sich in Luft auflösen und eine nie gekannte Leichtigkeit stellt sich ein.   Durch die bessere Körperhaltung werden vor allem Rückenschmerzen gezielt bekämpft. </p>\n\n<p>Wer sich für Faszientraining und Faszienfitness interessiert, der ist hier richtig. Statt dumpfer Stretch-, Roll- und Kräftigungsübungen lernen Sie in diesem Kurs, sich im Alltag wieder so richtig zu bewegen, dass Ihre Faszien in Form bleiben. Die Übungen trainieren Ihr Nervensystem statt Ihrer Muskeln, das führt zu schnellen und gleichzeitig nachhaltigen Verbesserungen. (Sie brauchen dazu keinerlei Geräte, auch keine Faszienrolle).</p>\n\n\n\n<p>  \t    Entwickelt wurde der Kurs in mehrjähriger Arbeit von dem bekannten Wiesbadener Faszien-Therapeuten Peter Scholten, Autor des Buches <em>\"Werbelüge \"Starker Rücken\"</em>. Die Übungen sind für jeden leicht durchzuführen und benötigen nur wenige Minuten Ihrer Zeit. Dieser weltweit einmalige Kurs ist Modular aufgebaut und führt Sie automatisch zum Ziel.  </p>\n\n\n\n<p>  \t  Denn nur wer seine Körperhaltung im Alltag verbessert, kann sich von Therapien, Behandlungen und Sport einen dauerhaften Erfolg versprechen.  </p>\n\n\n\n<p>Sie lernen tiefer zu atmen, entspannt zu stehen und richtiges Sitzen. Unser Kapitel über richtiges Gehen im Ballengang - barefoot - ist eine sehr effiziente Entspannungsübung für Ihren Rücken.   </p>\n\n\n\n<p>In einem speziellen Kapitel zeige ich Ihnen, wie Sie Ihren Arbeitsplatz ergonomisch richtig einrichten.</p>\n\n\n\n<p>Sie wollen etwas gegen Ihre Rückenschmerzen tun? Starten Sie jetzt.  </p>", 
    "end_date": null, 
    "title": "Bessere Körperhaltung für ein Leben ohne Rückenschmerzen", 
    "price": "50.00", 
    "instructors": "Peter Scholten", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/104042_7ff4_4.jpg", 
    "course_url": "https://www.udemy.com/bessere-korperhaltung/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-10T08:27:58Z"
}