{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong><strong>Discover the ‘BETTER YOU’ with The BML Fitness 9 week online program!</strong></strong></p><p><strong><strong></strong></strong><strong>The BML 9 Week Challenge</strong> is for anyone looking to overcome a lack of motivation in order to reinvigorate their lives by building healthy exercise and nutrition habits. Whether you have zero experience or plenty of experience with exercising and/or eating well, BML’s three pronged approach, where members will BUILD healthy habits, MAINTAIN them and finally LIVE them, will help you to become the best version of yourself.</p><p>You’ll practice quality workouts combined with the best nutrition plan for you, underpinned by consistent motivation which drives life-changing results. By purchasing the BML Fitness program, you will be taking the first step towards a more invigorating life. Your energy levels will increase, your thinking will become more positive and body will beam from the renewed habit’s you have cultivated.</p><ul><li>More Than 50 Emails Delivered Over 9 Weeks!</li><li>Quick &amp; Easy Video Tips From Our 5 Resident Experts</li><li>Flexible Exercise &amp; Nutrition Programs Fit With Your Plans... Not Ours</li><li>Innovative Motivation &amp; Lifestyle Programs Designed to Keep You on Track!</li></ul>", 
    "end_date": null, 
    "title": "BML Fitness 9 Week Challenge", 
    "price": "45.00", 
    "instructors": "Matt Williams, Jess Moulds, Paul Stead, Anthony Patrickson, Cassandra Brewer", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/696006_2b07.jpg", 
    "course_url": "https://www.udemy.com/bml-fitness-9-week-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-13T00:12:17Z"
}