{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul style=\"\">  \t<p>  \t\t<strong style=\"\">Snoring, sleep apnea, insomnia, asthma, nasal problems, anxiety, panic attacks, breathlessness, chronic coughing… </strong> people with these problems have a ‘disordered breathing pattern’ - a faulty way of breathing, DAY and NIGHT,  which is rarely identified or addressed, yet produces a myriad of distressing symptoms throughout the body.  \t</p>  \t<p>  \t\t  Breathe Away’s online course <em style=\"\">Breathing Retraining</em> teaches you how to return to a physiologically normal (optimal) breathing pattern-  how a person in perfect health breathes, someone who breathes <em style=\"\">slowly, smoothly and silently,</em> and never snores, breathes erratically, <span>gets wheezy, breathless or panicky, or gulps air through their mouth, yawns or sighs a lot.  </span>  \t</p>  \t<p>  \t\t<strong style=\"\">You can change the way you breathe </strong>  \t</p>  \t<p>  \t\t<strong style=\"\">~ it&#039;s as easy as taking your next breath…<em style=\"\"> differently</em></strong>  \t</p>  \t<li>Designed specifically for busy people and needs no special devices</li>  \t<li>First results in under 24 hours -sleep better from the first night</li>  \t<li>Unblock your nose within minutes, using simple breathing technique</li>  \t<li>30% average reduction in total <em style=\"\">symptom score</em> by day 2*</li>  \t<li>90% of participants report less or no snoring, coughing or wheezing by day 5*</li>  \t<li>Less than one third of the cost of a face-to-face course</li>  </ul>  <p>  \t  This course is based on the breathing retraining programs that Tess Graham has delivered for the past two decades to more than 5500 people with extraordinary and consistent success. Tess&#039;s work is complemented by her training in physiotherapy and in the <strong style=\"\">physician-developed Buteyko Breathing Technique</strong>.  </p>  <p>  \t  This 16 lecture course (video, audio, graphics, handouts) includes:  </p>  <ul style=\"\">  \t<li>Breathing pattern assessment and symptom assessment</li>  \t<li>The 5-day breathing retraining program (taken as slowly as you like)</li>  \t<li>The 9 Habits of Healthy Breathing</li>  \t<li>Breathing in speaking, singing and exercise</li>  \t<li>Reassessment, problem-solving, making the changes permanent<br style=\"\">  \t</li>  </ul>  <ul style=\"\">  \t<p>  \t\t<strong style=\"\">Our key points of difference as a breathing course:</strong>  \t</p>  \t<p>  \t\t<em style=\"\">We teach physiologically normal breathing</em> - not the big, ‘deep-breathing’ and ‘full-inhale/exhale’ breathing exercises that are so commonly taught and which may provoke dizziness, coughing, wheezing, anxiety and panic attacks, and perpetuate a snoring problem.  \t</p>  \t<p>  \t\t<em style=\"\">Our course is suitable for people with high levels of anxiety</em>. <br style=\"\">  \t\t   The process is gentle, nothing is forced - you will be amazed at how profound the improvements are while you remain at all times within your comfort zone.  \t</p>  \t<p>  \t\t<em style=\"\">Easily do-able for busy people - success does not depend upon hours of formal practice. </em>You are taught how to blend the practice into your daily life. You breathe approximately 15,000 times while you&#039;re awake – that means countless opportunities to make changes as you go about your day. You can achieve brilliant results just with this ‘informal’ practice and even more stunning results if you commit to completing the simple ‘formal’ breathing exercises.  \t</p>  \t<p>  \t\t  * for people undertaking our breathing retraining program as recommended.  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Breathing Retraining: Asthma Anxiety Snoring Apnea, Buteyko", 
    "price": "50.00", 
    "instructors": "Tracey  Anderson Askew, Tess Graham", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310486_13ca_4.jpg", 
    "course_url": "https://www.udemy.com/breathing-retraining/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T02:29:23Z"
}