{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>How you breathe affects every aspect of your life. If you suffer from stress, anxiety or depression, this coarse will help you tremendously. The challenges and stresses of life can create a vicious cycle of mental worrying, busyness and disconnection from your ability to self regulate and regenerate. This class will guide you through experiential breathing practices, into the amazing healing power of conscious breathing. </p><p>This class is a series of Videos that will show you step by step:</p><ul style=\"\"><li>How to deepen and relax your breathing to calm your nervous system.  </li><li>Simple breathing exercises for increased energy and rejuvenation.  </li><li>Effective techniques to discharge stress and negative emotions. </li><li>The key to breaking out of any cycle of negativity and depression.</li><li>Ways to use the power of your breathing to feel more centered confident and empowered in every aspect of your life. </li></ul><p>If you want to improve your life, then consciously cultivating your way of breathing is the most efficient path to self discovery and empowerment. Don&#039;t wait for your life to get better! Choose to be proactive in creating the life and experience that you long for. Leaning to properly breath will open up many new doorways for you to reach your highest potential. </p>", 
    "end_date": null, 
    "title": "Breathe Yourself Free Of Stress, Anxiety & Depression ", 
    "price": "20.00", 
    "instructors": "Shems Heartwell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/463462_3fc8_2.jpg", 
    "course_url": "https://www.udemy.com/breathe-yourself-free-of-stress-anxiety-depression/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T23:51:19Z"
}