{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t     لربو الشعبي من الامراض الشائعة جدا لدي الاطفال و الكبار بنسبة حدوث من 5 الي 18% من سكان دول العالم المختلفة و مثل تشخيصه تحديا للأطباء كما تنتشر الكثير من المفاهيم الخاطئة عن المرض و طرق علاجه تستدعي تحديث معلومات الممارسين الصحيين لطرق تشخيص و علاج هذا المرض الشائع.  </p>  <p>  \t                   Bronchial asthma is a common health problem among adults and children with prevalence of 5-18% among international populations, Many myths regarding the disease and its  treatement prevail  </p>  <p>  \t     مقرر مخصص للمهنين بالمجال الصحي خصوصا أطباء الرعاية الصحية الاولية و أطباء الأسرة والباطنة والاطفال بالاضافة الي طلبة كليات الطب وكليات و معاهد التمريض.the course is offered to health care professional specially family doctors and other primary care doctors as well as medical students and high nurses  </p>  <p class=\"row-fluid\">  </p>  <p style=\" text-align:right;\">  </p>  <p style=\" text-align:right;\">  \t<strong style=\"\">بنهاية هذه المادة سيصبح الطالب قادرا علي:</strong>  </p>  <ul style=\"\">  \t<li style=\" text-align:right;\">معرفة مدي انتشار الربو الشعبي</li>  \t<li style=\" text-align:right;\">تشخيص الربو الشعبي بناءا علي دلالات اكلنيكية و فحوصات</li>  \t<li style=\" text-align:right;\">تصنيف حدة أزمة الربو و الربو المزمن</li>  \t<li style=\" text-align:right;\">تطبيق الارشادات الحديثة في علاج الربو الشعبي الحاد و المزمن</li>  \t<li style=\" text-align:right;\">عمل خطة علاج للربو و طرق منعه</li>  \t<li style=\" text-align:right;\">تثقيف المرضي بطبيعة الربو الشعبي و طرق اسنخدام أجهزة المتابعة و أجهزة ايصال الدواء</li>  </ul>  <p>  \t  By the end of the course you will be able to succefully evaluate and plan management of bronchial asthma cases and plan an evidence based management  </p>", 
    "end_date": null, 
    "title": "Bronchial asthma diagnosis and management, A GP guide", 
    "price": 0, 
    "instructors": "Dr Saeed S. Abduljalil", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382604_f80d_3.jpg", 
    "course_url": "https://www.udemy.com/bronchial-asthma/", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T01:05:27Z"
}