{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t   “I haven&#039;t had a class with the professor. I found him via an app. Not studying this intense in 20+yrs I found him to amazingly helpful. I&#039;m studying to be a RN in Australia.”  </p>  <p>  \t   -From RateMyProfessor.com (http://www.ratemyprofessors.com/ShowRatings.jsp?tid=1589133)  </p>  <p>  \t   “OK -- you just saved my life.... I had read the text on this process 5 times and was so confused and frustrated that my heart rate was going up....(LOL). However, after watching your 3-part tutorial, I COMPLETELY GET IT......... THANK-YOU so much... Your descriptions are simple, and I love the tips on how to remember things and also how to deduce the answers on the &quot;test&quot; that you showed. Can&#039;t say enough..... you took me from &quot;ready-for-tears&quot; to &quot;ready-for-cheers.&quot;”  </p>  <p>  \t   -From YouTube (https://www.youtube.com/watch?v=OnwPQxKvwVE)  </p>  <p>  \t <strong></strong>  </p>  <p>  \t <strong>What is the course about?</strong>  </p>  <p>  \t    This course aims to teach how blood flows through the heart in simple and fun ways! Not just to take an exam but to remember for the long term. You will learn the different chambers of the heart, the valves (i.e. bicuspid and tricuspid) and how blood flows out of the heart to the body and lungs and back to the heart on the different great vessels (i.e. aorta and pulmonary vessels) as the oxygenation levels change.  </p>  <p>  \t<strong>What teaching tools are available?</strong>  </p>  <p>  \t    I have created short, yet informative, videos with helpful learning tools (i.e. mnemonics) to break down blood flow through the heart. I also have created videos with questions that you can pause after reading and then resume to see me walk you through how to solve such a problem. Lastly, there are quizzes to test your knowledge on the material after watching the videos.  </p>  <p>  \t<strong>How long will the course take to complete?</strong>  </p>  <p>  \t    This all depends on your level of learning. There is approximately half an hour worth of video material along with quizzes.  </p>  <p>  \t<strong>How is the course structured?</strong>  </p>  <p>  \t    It is a 3-step repetitive process: 1) Watch a short video on blood flow; 2) Watch a short video with 2-3 questions and answers, where I walk you through how to solve the questions; and 3) Take a short quiz on your own on that video.  </p>  <p>  \t<strong>Why take the course?</strong>  </p>  <p>  \t    This course is good for anyone from high school, to nursing school, to medical school, to any health care profession and even anyone interested in knowing more about how blood flows through the heart to the body and lungs!  </p>", 
    "end_date": null, 
    "title": "Cardiac Blood Flow Made Simple!", 
    "price": "20.00", 
    "instructors": "John Roufaiel", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/54013_281d_7.jpg", 
    "course_url": "https://www.udemy.com/cardiacbloodflow/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-14T17:25:47Z"
}