{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  ¿Estas listo para Dar el Salto Cuantico y Transformar positivamente tu vida?  </p>  <p style=\"\">  \t  El Metodo Cuantico Bioenergetico Chakra Evolutions Techniques; es un Programa de Capacitacion Integral enfocado en la sanacion, el balance, equilibrio, armonizacion y optimizacion de todas las areas de nuestras vidas por medio de los Centro Bioenergeticos comunmente llamados Chakras.  </p>  <p style=\"\">  \t   Las Tecnicas de evolucion nos permitiran elevar nuestra vitalidad y niveles de frecuencia energetica permitiendonos alcanzar mayor bienestar.  </p>  <p style=\"\">  \t   Incluye material de autoanalisis y analisis cuantico o vibracional para usarlo en consulta.  </p>  <p style=\"\">  \t   En general el curso se puede completar en 1 mes para internalizar y aplicar lo aprendido y reconocer cuales son los Chakras en desarmonia o bloqueados y como influyen directamente en el area relacionada.  </p>  <p style=\"\">  \t  Al final de este Poderoso Programa tendras la capacidad de identificar por medio del analisis y optimizar cada Chakra repercutiendo esto directamente en la liberacion de los bloqueos que frenaban el avance, la plenitud, felicidad y el exito.  </p>  <p style=\"\">  \t  ¿Que necesita?  </p>  <p style=\"\">  \t  Aplicar paulatinamente las tecnicas e ir midiendo los resultados de los cambios en cada aspecto trabajado.  </p>  <p style=\"\">  \t  Testimonios:  </p>  <p style=\"\">  \t  Lucymar Lozada. Venezuela.  </p>  <p style=\"\">  \t  He Aplicado el conocimiento aprendido en este metodo de equilibrio que fusiona tecnicas que han sido enseñadas por grandes maestros espirituales y definitivamente consegui respuestas a situaciones personales respecto a bloqueos en mi prosperidad y amor.  </p>  <p style=\"\">  \t  Ahora comprendo que a medida que elevamos nuestro nivel vibracional atraemos a nuestras vidas aquello que deseamos con mas facilidad y sin lucha.  </p>  <p style=\"\">  \t  Por ello te recomiendo este Poderoso Programa que es un Salto hacia el conocimiento integral de ti mismo.  </p>  <p style=\"\">  \t  Eduardo Mendoza. Venezuela.  </p>  <p style=\"\">  \t  Sencillamente como Masoterapeuta este Programa fue un Impulso tremendo con el cual e tenido un sin numero de herramientas y recursos para optimizar los resultados en el reequilibrio de mis clientes.  </p>  <p style=\"\">  \t  A parte de ello me ha permitido conocer al ser humano y a mi mismo a nivel integral y sanar por medio de la fusion de tecnicas de armonizacion ancestrales mis centros de transformacion viendo excelentes resultados en mis asuntos.  </p>  <p style=\"\">  \t <br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Chakra Evolutions Technique´s", 
    "price": "50.00", 
    "instructors": "Noe Freites (The Master)", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/88380_0474_9.jpg", 
    "course_url": "https://www.udemy.com/metodo-cuantico-bioenergetico-chakra-evolutions-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-05T00:00:50Z"
}