{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  My brain injury inspired me to spend the last 25 years scouring the world for fast, easy, fun solutions to <em style=\"\">CLEARING</em> stress, not just managing it.  </p>  <p style=\"\">  \t- I knew there had to be alternatives to drugs, and I found some doozies!  </p>  <p style=\"\">  \t  I am living proof that these emPOWERment tools work for every kind of stress from <strong style=\"\">money stresses to relationship crisis</strong>; and they are <strong style=\"\">just as effective for kids</strong> as they are for adults.  </p>  <p style=\"\">  \t  - PLEASE teach them to your kids, we should <em style=\"\">all</em> have been taught these things in kindergarten.  Imagine how much easier life would have been if school had taught us to  </p>  <p style=\"\">  \t<em style=\"\">Instantly reprogram our primitive brain centers to have a composed response to stress instead of an automatic stress reaction</em>.  </p>  <p style=\"\">  \tSo that when everyone around you is losing their minds, <strong style=\"\">you are relaxed, and have a clear head REGARDLESS OF CIRCUMSTANCE!</strong>  </p>  <p style=\"\">  \t- Relaxing instantly and keeping a clear head are just the first two emPOWERment tools you’ll learn. They can mean the difference between life and death so they will always be <strong style=\"\">FREE in the first part of the course</strong>.  </p>  <p style=\"\">  \t  The rest of the tools help make life worth living; and everything life throws at us a whole lot easier to cope with.  </p>  <p style=\"\">  \t  The AMA tells us that more than 90% of illness is stress related, but <em style=\"\">stressful situations aren&#039;t usually the cause</em> of long term health problems. <strong style=\"\"><em style=\"\">Our inability to cope with stress is what makes us sick</em></strong>.  </p>  <p style=\"\">  \t  We are not taught how our brains and bodies work, or how to <strong style=\"\">program them for optimal functioning under stress</strong>. Instead we learn to suppress the symptoms that are there to draw our attention to causes that <em style=\"\">need</em> to be addressed.  </p>  <p style=\"\">  \t  This is never long term helpful. It WILL eventually make you sick, and cost you a whole lot to fix in time, money, energy, focus, relationships etc.  </p>  <p style=\"\">  \t  These emPOWERment tools will <strong style=\"\">give you an edge in every part of your life</strong>; from helping to <strong style=\"\">heal the pain of the past</strong>, to moving forward <strong style=\"\">powerfully into the future</strong>.  </p>  <p style=\"\">  \t  They work because they  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  ·Tackle CAUSES <strong style=\"\">not</strong> SYMPTOMS  \t</p>  \t<p style=\"\">  \t\t  ·Provide immediate positive results – 3 minutes or less  \t</p>  \t<p style=\"\">  \t\t  ·Are easy enough for a child to do  \t</p>  \t<p style=\"\">  \t\t  ·Have NO negative side effects  \t</p>  \t<p style=\"\">  \t\t  ·Are FUN!  \t</p>  </ul>  <p style=\"\">  \t  So enjoy bringing your stress down to zero, and then have your mind <strong style=\"\">blown by what the emPOWERment Tools when you AREN&#039;T stressed!</strong>  </p>  <p style=\"\">  \t  Unfriggingbelievable benefits in productivity increase alone!  </p>  <p style=\"\">  \t  Give every technique you learn a fair go to <em style=\"\">find out just how effective it really is</em>, and when you experience the difference, <strong style=\"\">pay it forward</strong>. Tell your mates and everyone you care about.  </p>  <p style=\"\">  \t  Life isn&#039;t getting any less challenging, we have to step up, and skill up.  </p>  <p style=\"\">  \t<em style=\"\">$99 will get you a month&#039;s worth of Valium, or a lifetime supply of emPOWERment tools that could make the Valium redundant.</em>  </p>  <p style=\"\">  \t  Invest in yourself.  </p>", 
    "end_date": null, 
    "title": "Clear stress in less time than it takes to find the Valium", 
    "price": "50.00", 
    "instructors": "Joy Phoenix", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/175590_9817_9.jpg", 
    "course_url": "https://www.udemy.com/clearstressinlesstimethanittakestofindthevalium/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-03T05:30:23Z"
}