{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong style=\"\">El curso más completo sobre entrenamiento y cuidado de la memoria</strong>. Si experimentas problemas de memoria o simplemente quieres disfrutar de una memoria en forma a cualquier edad... ¡este es el curso perfecto para tí!</p><p>Son muchas las personas que entrenan sus memoria a diario. Lo que no saben es que los ejercicios que realizan ¡¡no son eficaces para mejorar su memoria!!  En este curso elaborado e impartido por el experto en memoria Álvaro Bilbao, vas a poder <strong style=\"\">aprender y practicar las técnicas y ejercicios más eficaces</strong> para mejorar tu memoria.</p><p>- Errores frecuentes en el entrenamiento de la memoria</p><p>- Las claves de un entrenamiento en memoria eficaz</p><p>- Las técnicas más eficaces para entrenar los distintos tipos de memoria</p><p>- Todas las claves que te van a permitir cuidar tu cerebro y memoria</p><p>- Ejercicios eficaces para mejorar la memoria a corto plazo</p><p>- Ejercicios eficaces para superar los molestos bloqueos o fallos de memoria</p><p>30 clases diseñadas para guiarte paso a paso en las distintas técnicas que van a fortalecer tu memoria. Explicación de las técnicas, demostración, ejercicios prácticos y todos los secretos de los especialistas en rehabilitación y entrenamiento de la memoria. Este es un curso diseñado por especialistas en mejorar la memoria que cada día aplican estas técnicas para ayudar a personas con problemas de memoria a recuperar su memoria. Olvídate de los sudokus y crucigramas. No dejes pasar esta oportunidad de aprender de manos de un experto, las técncias que sí van a lograr que mejores tu memoria!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Como entrenar la memoria con eficacia", 
    "price": "50.00", 
    "instructors": "Álvaro Bilbao", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306884_0364_5.jpg", 
    "course_url": "https://www.udemy.com/entrenar-memoria-con-eficacia/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-24T14:02:26Z"
}