{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Como paciente y sobreviviente de cáncer testicular, tuve la oportunidad de experimentar situaciones difíciles, sentir en carne propia la posibilidad de morir a temprana edad y al mismo tiempo buscar energía positiva de donde muchas veces no la hay.</p>\n\n<p>En este curso pongo a tu entera disposición cada experiencia que viví, cada pieza de conocimiento que aprendí, cada momento en que me sentí decaído y sobretodo cada momento en que dije que no me iba a morir de cáncer testicular.</p>\n\n<p>Fui diagnosticado con la enfermedad a los 33 años, cuando ni siquiera pensaba que una persona de mi edad podía enfermarse de cáncer, lo que trajo en mi un sentido de conciencia respecto al cáncer y a la salud en general.</p>\n\n<p>Debo decirte que no soy médico. Soy ingeniero de profesión y desde luego este curso no pretende dar una lección sobre complicados términos y tecnicismos médicos pero sí brindarte el conocimiento que adquirí a través de recursos de Internet que cotejé en las distintas citas que tuve con mi médico, lo cual me ayudó a entender y tomar mejores decisiones.</p>\n\n<p>Dado que es un tipo de cáncer poco común y que afecta a una parte íntima del cuerpo del hombre, sé que podría existir un tabú entre los hombres que padecen el cáncer testicular. Es por ello que yo decidí hacer pública mi enfermedad para ayudar a otros pacientes y familiares a informarse, tomar conciencia y ejecutar acciones preventivas a favor de su salud.</p>\n\n<p>Te confieso que desde que decidí compartir mi testimonio con otras personas, me he llenado de satisfacción al saber que personas que escucharon mi testimonio, aprendieron que existe el cáncer testicular e incluso un participante de una de mis charlas me llamó un año después para decirme que un día se encontró una pequeña masa anormal en su testículo y que al recordar lo aprendido en mi charla, fue de inmediato a su médico, quien corroboró el diagnóstico de cáncer testicular, salvando así su vida.</p>\n\n<p>Tú también puedes convertirte en un agente de cambio para beneficiar la salud de las personas. </p>\n\n<p>¡Gracias por leer este contenido y te aprecio por evaluar la posibilidad de tomar este curso que considero puede traer un balance positivo para ti!</p>", 
    "end_date": null, 
    "title": "Cómo Dar La Batalla Al Cáncer y Lecciones Para La Vida", 
    "price": 0, 
    "instructors": "Luis Peluffo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/821640_9436_4.jpg", 
    "course_url": "https://www.udemy.com/cancertesticular/", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-14T03:47:13Z"
}