{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Do you suffer from headaches, migraines, neck pain, lower back aches, spasms, sciatica or just generally feel tense and uncomfortable all the time?</p><p>Did you know you cannot control the amount of tension you build up?</p><p>But don't worry, if you have a stressful job, or a very physcially or mentally challanging one, you don't have to go to the pharmacy for your pain!</p><p>I'll teach you how to get rid of stress related pain without having to reach for the pills, with absolutely practical meditative and physical rewiring of your nervous system you can teach your body to SWITCH OFF stress related pain.</p><p>This isn't a woo woo out there type of meditation either, its the \"krav maga\" of meditation, meaning its alll practical and you can do it anytime, any place anywhere without feeling silly doing it.</p><p>You will get videos on how to turn off pain while:</p><p>Standing</p><p>Walking</p><p>Sitting</p><p>Laying down</p><p>This course contains audios for you to go through these pain killing techniques so you can switch off pain while you're on the bus, in the train, on the plane, while working sat up, siting down or just trying to go to sleep after a hard day!</p><p>As a BONUS, I will show you where to get this little known oil only availible in chinese stores, how to order it (its not conventional) but will give a 10X boost in pain killing effect if coupled with this course AND I'll show you how to apply it safely and effectively.</p><p>You should take this course because you HATE PAIN,</p><p>You should take this course if you want a practical alternative to taking pills</p><p>The money you will save from doing this and not stocking up your med cabinet will PAY FOR ITSELF in the first month.</p><p>30 Day MONEY BACK GUARANTEE: If you don't feel at least relaxed, tension free and pain free or cannot get this course working or you, then you get your money back AND keep the course as a thank you for giving this a shot.</p><p>You have nothing to lose.</p><p>Take the 30 day Pain and Stress Free Challenge today!</p><p>Click the ENROLL button now.</p>", 
    "end_date": null, 
    "title": "Deep Inner Body Age Reversing Relaxation", 
    "price": "20.00", 
    "instructors": "Bryan Chan", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611628_3bee.jpg", 
    "course_url": "https://www.udemy.com/deep-inner-body-age-reversing-relaxation/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T12:12:24Z"
}