{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>A holistic step by step guide to disease free living, including disease prevention and reversal (in some cases). Including cancer, depression and 900 other diseases. Understanding the needs of our cells; to live illness free through purposeful nutrition and positivity. </p>\n\n<p>When we decide to eat 'on purpose' we can change our lives naturally. Just 10 steps is all it takes to gain health and prevent disease. For individuals and/or natural practitioners. </p>\n\n\n\n<p>A look at the four needs of cells to prevent disease and maintain homeostasis on the inside of our bodies; with the possibility of complete disease reversal. 900 diseases can affect the body and this happens when the immune system is compromised by free radicals, stress or incorrect replication of cells. The road to illness can be very quick and the body's defense is needed, quickly.</p>\n\n\n\n<p>Our aim is to promote wellness through nutrition by purposeful design. Knowing exactly what the body needs to fight disease (that is there already), or that may be there in the future, thus, preventing further compromise. </p>\n\n\n\n<p>The 10 steps incorporate exactly what the cells need to keep homeostasis going internally. The body can now maintain itself at the perfect level to prevent and even sometimes reverse disease, completely. Never give up hope...</p>", 
    "end_date": null, 
    "title": "Disease Free Naturally - Cancer and 900+ other Diseases", 
    "price": "30.00", 
    "instructors": "Nat Lind", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/824064_11ee_4.jpg", 
    "course_url": "https://www.udemy.com/disease-free-naturally/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-17T00:42:35Z"
}