{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  Over a two week program you will be sent recipe ideas, motivational emails, fat loss tips, 10 minute workouts to do in your own home and a fun and varied plan to follow to help shed those extra pounds, and give you a zest for life.  </p>  <p>  \t  Depending on your current lifestyle and eating habits, you may find some things more difficult than others, but hopefully with this being a 14 day plan it is something that is realistic, achievable and above all else results driven!  </p>  <p>  \t  You will follow an eating plan and exercise program devised by myself.  It takes on the elements of &#039;clean eating&#039; so basically no processed, fast or cheap packaged food...you are what you eat!  You will also be fitting in 10-15 minute workouts during your day - the only equipment you need: a good shopping list, plenty of good meat, fish and vegetables plus some weights if you have them (cans of beans will do) and a space to workout in - you don&#039;t need lots of room.  </p>  <p>  \t  There will be no counting of calories and there will be no measuring out of ingredients. You will even get a cheat day - where you can eat WHATEVER you like! Yes…crisps, chocolate, roast dinners you name it, even toast - you only need to have a great protein rich breakfast first!  </p>  <p>  \t  You will see results and might even enjoy your new found way of eating - the clean way is flavoursome, colourful and imaginative plus you will be getting fit at the same time, feel more energised, have shinier hair, clearer skin and many other health benefits.  </p>  <p>  \t  What have you got to lose…start today!  </p>", 
    "end_date": null, 
    "title": "Drop a Dress Size with Sarah Dineen", 
    "price": "25.00", 
    "instructors": "Sarah Dineen", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434084_360c_2.jpg", 
    "course_url": "https://www.udemy.com/drop-a-dress-size-with-sarah-dineen/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T13:42:49Z"
}