{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Bedwetting stinks. Literally, it does! Nighttime incontinence, another term for bedwetting, is a common issue that often resolves itself in the first few years of life. But sometimes, wet nights stick around much longer than they&#039;re welcome. </p><p style=\"\">If you have a child who struggles with bedwetting, please take action today. As a child ages, this issue often weighs a heavy toll on their self-esteem and self-confidence. </p><p style=\"\"><em style=\"\"><strong style=\"\">Dry Nights- Goodbye Bedwetting!</strong></em> is a course designed with both you and your child in mind. The course is meant to teach you how to better understand and communicate with your child about this issue and also provides you<em style=\"\"> tools designed to help your child develop the ability to stay dry through the night.</em> </p><p style=\"\">The <strong style=\"\"><em style=\"\">Dry Nights</em></strong> hypnosis recordings are designed to help <em style=\"\">empower your child</em> to create the change within their body they need in order to stay dry through the night. <em style=\"\">Many children have used hypnosis with great success in overcoming this issue permanently</em>. When a child sleeps, only their subconscious mind is awake. Consequently, no matter how much they really want to stay dry and how many goals they consciously set for themselves, they are often met with failure when they wake up to yet another wet bed . Hypnosis works directly with the subconscious mind which is why it is often so helpful with this issue. </p><p style=\"\">Although not all causes for bedwetting can be successfully addressed with hypnosis alone, <em style=\"\">it is a safe and natural approach which is often greatly effective</em>. If you are ready to help your child stay dry through the night, please enroll today. With a <strong style=\"\">30 Day Money Back Guarantee</strong>, you have nothing to lose and so much to gain. </p>", 
    "end_date": null, 
    "title": "Dry Nights- Goodbye Bedwetting!", 
    "price": "30.00", 
    "instructors": "Melody Litton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529946_f71a_2.jpg", 
    "course_url": "https://www.udemy.com/stop-bedwetting/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T01:17:02Z"
}