{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>*<strong>*Updated JUNE 2016 </strong></strong></p>\n\n<ul><li>*<em>Have you been suffering from chronic low back pain?</em></li><li><em>*Do you have tight calves or shin splints?</em></li><li><em>*Do you have knee pain when squatting and lifting</em></li><li><em>*Are your feet constantly in pain from standing at work all day?</em></li><li><em>*Is your lack of flexibility limiting your physical activity?</em></li><li><em>*Are you constantly getting injured from simple, everyday activities to intense physical exercise.</em></li></ul>\n\n<p>  \t    If you have had any of this kind of pain, stress, knots, or have had muscular tightness anywhere in your body for months or years, <strong>foam rolling is the solution for you!</strong>  </p>\n\n<p>  \t<em><strong>Foam rolling (and myofascial release) and  are the most effective methods used to relieve tightness and tension in the body. When you use a muscle or muscle group frequently, your body breaks down muscle fibers so that they can adapt and grow stronger. </strong></em>  </p>\n\n<p>  \t    Fascia is the tissue that surrounds our muscle fibers and organs so that they may glide smoothly past each other to reduce friction in the body.  </p>\n\n<p>  \t           An unfortunate and inevitable side effect of frequent muscle use during exercise or other repetitive movements, is the development of <strong>knots, adhesions, and scar tissue </strong>around the fascia. This causes tightness and soreness in the muscle.  </p>\n\n<p>  \t           Using a foam roller and other myofascial release devices properly on the muscles allow you to break down the scar tissue, knots, and adhesions. Regular use of a foam roller and other SMR (self myofascial release) techniques over time will  </p>\n\n<p>  \t<em>      -Improve flexibility  </em>  </p>\n\n<p>  \t<em>      -Increase circulation  </em>  </p>\n\n<p>  \t<em>      -Increase kinesthetic awareness  </em>  </p>\n\n<p>  \t<em>      -Reduce injury  </em>  </p>\n\n<p>  \t<em>      -Reduce recovery time between workouts  </em>  </p>\n\n<p>  \t    Foam rolling is beneficial for anyone who has muscular tightness, stress, knots, or chronic pain ANYWHERE on your body. This course extremely beneficial for both active and inactive, athletes and non-athletes.  </p>\n\n<p>  \t<strong>       This course will cover...  </strong>  </p>\n\n<p>  \t<strong>*</strong><em>What foam rolling and self myofascial release is  </em>  </p>\n\n<p>  \t<em>*How to use a foam roller and other myofascial release tools that you can find around the house.  </em>  </p>\n\n<p>  \t<em>*The benefits of foam rolling and myofascial release  </em>  </p>\n\n<p>  \t<em>*Safety precautions when using a foam roller and other myofascial release tools  </em>  </p>\n\n<p>  \t          Instructional videos for rolling out the following muscle groups are included:  </p>\n\n<p>  \t          -the feet  </p>\n\n<p>  \t          -IT band and quadriceps  </p>\n\n<p>  \t          -Piriformis and hamstrings  </p>\n\n<p>  \t          -Gastrocnemius and soleus (calves)  </p>\n\n<p>  \t          -Trapezius  </p>\n\n<p>  \t          -Latissimus dorsi and total back  </p>\n\n<p>  \t          -Upper back and shoulders  </p>\n\n<p>  \t          -Pectoralis major and minor  </p>\n\n<p>  \t          -Biceps  </p>", 
    "end_date": null, 
    "title": "Eliminate Chronic Pain Forever with Foam Rolling", 
    "price": "20.00", 
    "instructors": "Jack Wilson", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/104768_b07f_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-a-foam-roller/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-11T20:07:39Z"
}