{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">FINALLY – LEARN about all the UNBELIEVABLE benefits of ESSENTIAL OILS in the female menopausal body and the studies that support those benefits – you&#039;ll never wonder about essential oils and menopause again!</p><p style=\"\">Essential oils and health -- a super hot topic lately. Essential oils and Menopause? Maybe -- but can they help? But Essential oils and Western Medicine? </p><p style=\"\">Now that&#039;s controversial. </p><p style=\"\">But what happens when you combine the technical skills of a western medicine researcher &amp; author with essential oil research &amp; product development? You get me, Dr Dan Purser -- an MD who&#039;s done endocrinology (hormone) research, written a ton of books on the subject (seven #1 titles), done years of essential oil research plus essential oil/hormone product development, and is a master worldwide educator on essential oils and medicine (endocrinology). </p><p style=\"\">In this little course he delves into the medical issues associated with menopause, what the lack of hormones will do to you (in some incredible detailed exclusive reports), the history of some key oils that can apparently alleviate menopause symptoms, and some of the benefits you might expect from their use.</p><p style=\"\">Take this to learn more about menopause and some of the magic of essential oils.</p><p style=\"\">You&#039;re a woman and you&#039;ve lost your libido and have hot flashes and night sweats. You feel tired and weak and depressed and you&#039;re always achy, especially in your muscles -- which seem to be wasting away. Ugh. Your doctor&#039;s told you it&#039;s menopause but you don&#039;t want his synthetic prescriptions – you want to know more! You have to know more. </p><p style=\"\">Take a walk in the world of nature and medicine with Dr Dan Purser, an MD who&#039;s been involved in years of endocrine (hormone) research, written a textbook on preventive medicine and tons of other books (NINE #1 books on AMAZON), and is a worldwide educator on men&#039;s &amp; women&#039;s health issues. </p><p style=\"\">Learn what the research says through the eyes of this engaging educator as he shares experiences and articles about women, menopause, the history of essential oils, and the modern researched benefits. Wonder no more if these work or help -- this is detailed and backed by references -- and will help you to decide if essential oils should be part of your life and why... </p><p style=\"\">Women LOVE IT when they use essential oils – the way they feel, their fragrance/aroma, and the natural benefits they offer. </p><p style=\"\">I know this first hand after years as a practicing physician and as an endocrinology researcher and properly dealing with women who were hormonally deficient – dealing with them before and after they came in for menopause, and seeing the smiles on their faces when they too <em style=\"\">really</em> realized the amazing benefits of essential oils – I&#039;ve looked at well over 2,000 lab panels on women who use essential oils, and have documented the benefits. </p><p style=\"\">The challenge is that there&#039;s all kinds of confusing bad information out there – well this little course cuts through all of that as I discuss each study (studies that I chose as a reason and felt that were significant) and what it means to YOU. And I don&#039;t talk like a physician – above your head with big fancy medical words – I grew up on a farm in Oklahoma and I talk like a regular human being. ☺ </p><p style=\"\">Most physicians don&#039;t know these details – but they&#039;re not secret – they just come with the territory for the kind of research I do and books I write – I&#039;ve had NINE #1 BOOKS on preventive medicine and hormones – so I speak from vast experience and knowledge. But I&#039;ve also listened to you women as you&#039;ve asked for more natural options (begged in many cases) and let me know your regular doctors would not listen. </p><p style=\"\">This disconnect with you the patient by other physicians and their inability to answer questions patients <em style=\"\">really</em> have is why so many doctors are missing out on unlocking the wonders of this incredible natural treatment option. </p><p style=\"\">This course was created to change that attitude and in the past <em style=\"\">has only been available amongst a private, group of elite professionals and high end cash paying patients until now</em>... </p><p style=\"\">This isn&#039;t one of those training programs that gives you some basic theory and sends you out into the trenches only slightly better off then when you started... </p><p style=\"\">By the end of this training you will be armed with hardcore facts about essential oil benefits for women, and why they work, and some proven tactics for optimizing your levels. </p><p style=\"\">Need to discuss essential oil benefits with your personal physician and don&#039;t know where to start? - you&#039;re covered</p><p style=\"\">Your doc doesn&#039;t know which essential oil he/she should suggest? - you&#039;re covered</p><p style=\"\">Your personal physician is not sure these are safe or not? - you&#039;re covered</p><p style=\"\">Your doctor says these oils are bogus and won&#039;t work? - boom, you&#039;ll learn how to disarm that too.</p><p style=\"\">This training covers the current and modern peer reviewed research on essential oil benefits for women and the safety issues (which are minimal). </p><p style=\"\">This premium training by a top notch educator is perfect and for years has delivered results for: </p><p style=\"\">•Women who have menopause symptoms and want them gone</p><p style=\"\">•Patients with osteoporosis and want essential oils that can support their hormones</p><p style=\"\">•Women with headaches that want them to go away naturally</p><p style=\"\">•Women with thyroid issues that want something natural to balance their levels</p><p style=\"\">•Women with menopause sleep problems who want to fall asleep relaxed and naturally – who don&#039;t want to be addicted to big pharma drugs</p><p style=\"\">•Wondering which essential oils support estradiol, or progesterone, or thyroid? It&#039;s all covered.</p><p style=\"\">•Women who are looking for support of their libido or are depressed and wish to use essential oils – it&#039;s not a fluoxetine deficiency. ☺</p><p style=\"\">When you&#039;re done with this course, starting to feel <em style=\"\">much better</em> will be in reach...as well as the big time health rewards that come with that. </p><p style=\"\">Below you can find out exactly how the training is laid out, but real quick here are the sections: </p><p style=\"\">Introduction – Understanding a little bit about who I am, my Credentials, Background, and from what Direction I Speak and Educate</p><p style=\"\">What is Menopause? – Why Menopause Occurs in Women and Medical definitions and what&#039;s missing in your life in a natural and normal menopause. Three Amazing Downloads, too.</p><p style=\"\">Proper Diagnosis – Information and Labs we Need &amp; Get in Research And In My Office to Confirm the Diagnosis. What Lack of Key Hormones Cause (5 MAIN Points Each) and Why You Might Need The Support of Essential Oils.</p><p style=\"\">Western Medicine Options – in order to give you a balanced approach (hey, I am a western doctor, too, you know). Known side effects of Western Meds discussed.</p><p style=\"\">Asking for a Consideration – nice request for a review. Plus you get to see my goobery face speaking. J</p><p style=\"\">Essential Oil: Clary Sage – Ancient History and European History of this amazing essential oil is discussed. Then current research on its&#039; phytoestrogen component (sclareol) is detailed. </p><p style=\"\">Essential Oil: Vitex Agnus Castus – Ancient Roman History and super interesting European/Dark Ages History of this really useful essential oil is discussed. Then current research is detailed on how it supports and rewards progesterone activity and helps maintain a normal menopause.</p><p style=\"\">Oils That Support Sexual Health: Sandalwood and Ylang Ylang are discussed along with Orange Essential Oil</p><p style=\"\">Essential Oil: Myrtle – Again I review the ancient history of Myrtle, and some of the modern medical opinions about this interesting oil and it&#039;s function as an adaptogen and it&#039;s support of the thyroid.</p><p style=\"\">Other Oils: Jasmine, Rose, Lavender, Evening Primrose, are all discussed. </p><p style=\"\">Wrap Up – A quick review.</p><p style=\"\">More Info – I Detail Ways You Can Contact Me – Just in Case.</p><p style=\"\">Trust me, this is just a small sample of what you&#039;ll learn and by the end of this course you&#039;ll have every tool you need in order to dispel yours&#039; and your physician&#039;s concerns about this amazing hormone. </p><p style=\"\">I will personally respond to any questions you may have as you go through the material so there&#039;s no worry if you&#039;re not sure how to take all of the information and apply it to your personal life. </p><p style=\"\">AND you&#039;ll have access to all of this material as well as the newest stuff I share with everyone on the inside of the course for life! </p><p style=\"\">Also, you&#039;ll receive all future notifications for my newer more advanced courses as they come out and new information as it arises.</p><p style=\"\">REMINDER: <em style=\"\">this is a risk free purchase </em>with Udemy&#039;s 30 day money back guarantee. Nothing to lose, everything to gain. </p><p style=\"\">Hope to see you on the inside,</p><p style=\"\">-- Dan Purser MD</p><p style=\"\"><em style=\"\">BTW - This training is something I&#039;ve kept off of everything but my own private patient community site for a long time due to wariness of exposing too many practice and research secrets. After finally getting convinced by some patients that more women needed to see it, I decided to put it up here on Udemy. I can&#039;t guarantee I will keep making it available to purchase forever considering my initial concerns, so I&#039;d grab it while you still can.</em></p>", 
    "end_date": null, 
    "title": "Essential Oils and Healthy Menopause", 
    "price": "35.00", 
    "instructors": "Dan Purser", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/536384_298c_7.jpg", 
    "course_url": "https://www.udemy.com/menopauseandessentialoils/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T17:42:53Z"
}