{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The body is brilliantly equipped with natural self-repair mechanisms that can kill cancer cells, fight infectious agents, repair broken proteins, keep our coronary arteries open and naturally fight the aging process. Allow your body to heal itself and function at it's very best by means of fasting.</p>\n\n<p><strong>Learn and master one of the most powerful techniques to greatly improve your health.</strong></p>\n\n<p>Learn methods on how to fast safely</p>\n\n<p>Acquire natural steps in your healing process without medication</p>\n\n<p>Gain a full knowledge of how fasting can improve your health status</p>\n\n<p>Build a strong awareness of how fasting works</p>\n\n<p><strong>Understand healing principles of fasting</strong></p>\n\n<p>In this 1 hour course, you'll enjoy 11 enthralling lectures packed with tons of content.</p>\n\n<p>We'll learn all about fasting and what it can do for you and your health grade. One of the things you'll learn is how to take control of your own health without the use of traditional medicine. By implementing the fundamentals of fasting, you can extend your lifespan and have a greater quality of life.</p>\n\n<p>I designed this course to help anyone in need of a health boost by showing you how to use fasting as a preventative maintenance treatment or how to aid your body in healing more serious ailments; from increased energy to the reduction of allergies to reversing diabetes.. </p>\n\n<p>You'll get very familiar with how your body detoxes and the symptoms you may experience during the healing process. </p>\n\n<p>Students completing the course will walk away with very important step by step detailed methods of fasting and will be able to make educated decisions about their health.<br></p>\n\n<p>This course is perfect for anyone looking to improve their physical, emotional/mental and/or spiritual health.</p>\n\n<p>Also, you will receive a verifiable certificate of completion upon finishing the course.<br></p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "FASTING: The 'Get Healthy Quick' Fix", 
    "price": "20.00", 
    "instructors": "Susanna K Green", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508418_0ed8_5.jpg", 
    "course_url": "https://www.udemy.com/fasting-the-get-healthy-quick-fix/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T20:58:27Z"
}