{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"> Fertility awareness is a scientifically proven method that allows women to prevent or plan pregnancy naturally and without taking hormones. It works by tracking three signs that teach us what days throughout the month each of our bodies is fertile.</p><p style=\"\">The act of tracking your fertility signs will help you get to know your body&#039;s cycle and your body&#039;s wisdom in a deep, empowering way.</p><p style=\"\"><strong style=\"\">Course Content:</strong></p><p style=\"\"> Introduction to the female reproduction system and fertility cycle</p><p style=\"\"> Learn about fertility signs and how to track them daily in a quick and simple manner</p><p style=\"\"> Learn about your own cycle and its fertile attributes and how to plan pregnancy accordingly</p><p style=\"\">- learn how to improve your fertility and your partner&#039;s fertility with few lifestyle changes</p><p style=\"\">I recommend devoting 3 hours to study the course and 3 minutes for charting each day. </p><p style=\"\">The course contains videos, presentations and handouts you should print. </p><p style=\"\">Please take the time to go over the Udemy tour so you will understand where to find everything</p><p style=\"\">During the course I encourage you to introduce yourself to me and ask me any question so I could answer your needs better</p><p style=\"\">As part of the course you are welcome to send me 3 charts. Having your charts will help me make sure that you understand the method. I will be able to see if there is anything unusual in your charts that might indicate a problem with conception.</p><p style=\"\">If your hormones are not balanced I could suggest ways for you to balance and strengthen yourself</p><p style=\"\">***The knowledge in this course is important for everybody although it&#039;s impossible to use if you are taking any hormones affecting your cycle.</p><p style=\"\">***If you are going through fertility treatment you could use this knowledge only during the breaks you might take from taking the hormones and notice your natural body behavior</p>", 
    "end_date": null, 
    "title": "Fertility awareness - for pregnancy with Avishag Maya Zloof", 
    "price": "35.00", 
    "instructors": "Avishag Maya Zloof", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/406764_9960.jpg", 
    "course_url": "https://www.udemy.com/pregnancy/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T15:43:55Z"
}