{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Fibromyalgia is a painful condition that afflicts many people around the world. Unfortunately, the medical mainstream tends to treat the pain and other symptoms associated with fibromyalgia rather than the root causes of the condition.</p><p>The 7 Day Challenge is the first step to understanding what triggers your body and causes the flares up you experience. Each day we challenge the body as you record your experiences. Our experience shows us that what we put into our mouths causes lot of the pain we experience, either later that day or a couple days later.</p><p>Each day of the Challenge, you will remove certain food groups from your diet. Then journal how you felt that day. Some challenges like removing wheat products and Gluten may be more difficult than others, but the self-knowledge will help you immensely to discover which foods your body is particularly sensitive to.</p><p>When you register, you will join the 4500+ members of our Fibromyalgia Support Group on Facebook as you take proactive steps to reduce pain and fatigue.</p><p>Fibromyalgia is a multifaceted condition and its symptoms can be incorrectly linked to other conditions too, leading to improper or ineffective treatment. Rather than treating just the pain or other symptoms, there exists a combination of treatments to manage the causes of fibromyalgia. </p><p>If you are dealing with general inflammation, aches, pains, chronic fatigue, brain fog and a complex mix of reactions to industrial age toxins, you may be dealing with fibromyalgia. Your immune, digestive and other systems are out of balance. The symptoms that accompany fibromyalgia can include dizziness, headaches, allergies, twitches, brain fog, rashes, tendonitis, bursitis, and general aches. </p><p>The road to relief will have to eliminate the toxins, deal with intestinal dysbiosis with its resultant allergic reactions, right kind and amount of exercise, and fixing your nutritional profile. Even you can experience the joy of a symptom-free life and reverse the fibromyalgia symptoms! Review the articles in the Research section to learn more about fibromyalgia and treatment options.</p>", 
    "end_date": null, 
    "title": "Fibromyalgia - 7 Day Challenge for Pain Free Living & Health", 
    "price": "20.00", 
    "instructors": "Scott Paton, Martin Pytela", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/490142_7800_2.jpg", 
    "course_url": "https://www.udemy.com/fibromyalgia-7-day-challenge-health/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-30T07:11:30Z"
}