{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tChronic fatigue syndrome effects the lives of millions of people everyday. Finding answers on how to fight these debilitating symptoms can be stressful and an uphill battle.  </p>  <p>  \tAs someone who suffered with chronic fatigue syndrome for years and having been through countless tests for autoimmune diseases with very little answers, I know what it is like to deal with the frustration of not having solid answers. It is exhausting trying to understand what is wrong with you and how to get better when the medical community has little information to provide.  </p>  <p>  \tEven after receiving a diagnosis for chronic fatigue syndrome, you may find you really don&#039;t know much more than you did before the diagnosis on how to treat the symptom. It can be an incredibly lonely and demoralizing process.  </p>  <p>  \tMy journey took me outside traditional medicine and into alternative medicine to find answers and methods to treat my symptoms. This course will be the first of several on how to treat chronic fatigue symptoms naturally.  </p>  <p>  \tWhat I learned about how to combat chronic fatigue syndrome is included in my book &quot;Stop Chronic Fatigue: How To Get Your Life Back.&quot; I am not a medical professional but someone just like you who needed answers and found some things that worked in my life and the lives of others like you.  </p>  <p>  \tIn this course you will learn:  </p>  <ul style=\"\">  \t<li>What chronic fatigue syndrome is</li>  \t<li>The symptoms of chronic fatigue syndrome</li>  \t<li>Why traditional medicine has little to offer individuals who are suffering with chronic fatigue syndrome</li>  \t<li>How alternative therapies are being employed to help people who are dealing with chronic fatigue syndrome</li>  \t<li>What essential oils are</li>  \t<li>How essential oils help with chronic fatigue symptoms</li>  </ul>  <p>  \tThis course should provide a couple hours to complete.  </p>", 
    "end_date": null, 
    "title": "Fight chronic fatigue with essential oils", 
    "price": "20.00", 
    "instructors": "Lisa Gibson", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404884_5395_2.jpg", 
    "course_url": "https://www.udemy.com/fight-chronic-fatigue-with-essential-oils/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-27T00:29:28Z"
}