{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t    Você está buscando a mudança em sua vida?  </p>  <p>  \t    Este curso é um guia passo-a-passo para ajudar você finalmente fazer essa mudança e chegar na melhor forma física.  </p>  <p>  \t    Este curso é ideal para : perder gordura corporal extra, ganhar massa muscular, e melhorar os níveis de energia , bem como a saúde geral.  </p>  <p>  \tAtravés de uma sequência de exercícios completos você vai conseguir perder muitas calorias e gordura corporal.  </p>  <p>  \t    Eu estarei lá com você a cada passo do caminho para ajudá-lo a conseguir um corpo que você realmente ira se sentir orgulhosa(o). Se você é iniciado no Fitness, ou é um veterano, esse é o seu curso.  </p>  <p>  \t    Incluído no programa :  </p>  <p>  \tExercício Aeróbico para queima efetiva de gordura.  </p>  <p>  \tExercícios Localizados para ganhar mais massa muscular e definir todo o corpo.  </p>  <p>  \t    Vídeo aulas simples e divertidas  </p>  <p>  \t    Vídeos de treinos completos.  </p>  <p>Todos os exercícios são realizados no conforto da sua própria casa, em que você gere o seu próprio tempo. Em apenas 15-20 minutos algumas vezes por semana, você vai começar a ver melhorias significativas em seu nível de saúde e e bem estar. Com algumas pequenas alterações que estaremos fazendo de uma semana para outra, você certamente vai obter grandes resultados.<br></p><p>Estou disponível para dar orientação sempre que for preciso.<br></p>  <p>  \t    Inscreva-se agora e serei o seu guia para ter mais saúde e o corpo que deseja.  </p>  <p>  \tA minha missão será o seu sucesso!  </p>", 
    "end_date": null, 
    "title": "Fique em forma em 30 Dias", 
    "price": "20.00", 
    "instructors": "Professor André Oliveira", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360440_ef8d_4.jpg", 
    "course_url": "https://www.udemy.com/queimar-gordura-agora-e-ficar-em-forma/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T11:23:33Z"
}