{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">What will </strong><strong style=\"\">You get from this course.</strong>  </p>  <p>  \t<strong style=\"\"></strong><strong style=\"\">1. Clarity    2. Tools    3. Choice</strong>  </p>  <p>  \t  Have you ever felt frustrated with your sleep? Ever wondered why you couldn&#039;t sleep? This course is about really understanding sleep so you can improve it in a way that is specific to you. If you&#039;re struggling to get great quality sleep then this course will offer clarity and tools to help. Why is this sleep course so useful? Because it will give you something the medications cannot, it will offer you choice. There is nothing more frustrating in life than having difficulty sleeping and in that moment choices seem very limited. This course will increase the quality of your sleep because you will understand exactly what you need to do to improve it. This course is punchy and straight to the point and in less than an hour this programme will change your life and sleep patterns forever. The information is primarily in video format with some home study to do and the tools will help with more than just your sleep. Disturbed sleep is just a symptom of an imbalance in your nervous system, hormonal system and perhaps more. Focusing on the sleep problem is missing the point. We need to look deeper and understand sleep. We all know sleep problems are unique which is why the tools we offer are varied, well researched and able to be individualised. If you want a successful life you need your health and sleep is a crucial component. You need great sleep to recharge, to think clearly, to feel alive. If you take the coaching from this program, improved sleep is exactly what you will get, or I&#039;m happy to give you your money back.    </p>", 
    "end_date": null, 
    "title": "Flip the switch to Better Sleep", 
    "price": "35.00", 
    "instructors": "Craig Coman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356642_3b9b_2.jpg", 
    "course_url": "https://www.udemy.com/sleep-better-for-greater-energy-a-clear-mind-better-health/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T02:17:40Z"
}