{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t      Course description GERD  </p>  <p>  \t      That terrible burning in your chest and throat that you call “heartburn” may be acid reflux, or what doctors call “Gastro-Esophogeal Reflux Disease” (GERD). GERD is shockingly common disease; about 20 million Americans are affected. It can present itself with numerous symptoms, including heartburn, voice hoarseness, postnasal drip, regurgitation, nausea, stomach fullness or bloating, or a sensation that something is stuck in your esophagus. Acid reflux, acid reflux disease, <a href=\"http://www.emedicinehealth.com/script/main/art.asp?articlekey=3316\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">esophageal reflux</a>, GERD all have the same meaning: <a href=\"http://www.emedicinehealth.com/script/main/art.asp?articlekey=134245&amp;ref=130197\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">stomach acid and juices</a> flow from the stomach back up into the tube that leads from the throat to the stomach (<a href=\"http://www.emedicinehealth.com/script/main/art.asp?articlekey=133551&amp;ref=130197\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">esophagus</a>).  </p>  <p>  \t      Unfortunately, most people think that acid reflux results from an excess of acid in the stomach. A common misconception is that this abundant acid comes up into the esophagus to create the problem. This idea suggests that the solution to the acid reflux problem is to decrease acid production. This can easily be done by taking antacids.  </p>  <p>  \t      Antacids, however, may mask the symptoms and temporarily relieve the acute esophageal pain associated with acid reflux, but cannot actually fix the underlying problem. This is because the cause of heartburn, acid reflux or GERD is NOT an excess of stomach acid.  </p>  <p>  \t      Many patients come to my practice in despair; they take maximum doses of PPIs or H2 blockers and still have GERD. GERD has numerous causes and every patient should have an individual treatment plan according to the specific cause. I have never had a patient in my practice, however, whose problem stemmed from high production of stomach acid. Quite the contrary, more acid, as opposed to less, is essential in keeping Lower Esophageal Sphincter closed. By taking antacids to reduce acid levels, we are therefore potentially making the true cause of the problem far worse. As we age, we tend to produce less stomach acid; as a result the Esophageal Sphincter relaxes before our stomachs are completely emptied, causing a small amount of acid to travel to the esophagus. We need more acid to complete the digestive processes in the stomach to prevent the sphincter from opening prematurely.  </p>  <p>  \t      Why do we need more stomach acid? Acid is essential for the digestion and absorption of protein, vitamins, minerals and other beneficial nutrients. Low levels of stomach acid are directly linked to poor nutrition and a range of medical conditions including osteoporosis, pneumonia and muscular degeneration, a higher risk of infectious diseases such as small intestinal bacterial overgrowth. These problems often result from acid blocking medications. But your doctor will have a hard time understanding the causes of these diseases because there can be a long time lag after taking your acid blockers before these symptoms appear.  </p>  <p>  \t      Once you are diagnosed with GERD you will be prescribed PPI (Proton Pump Inhibitor) or H2-blocker, commonly prescribed drugs to reduce the amount of acid in the stomach.  </p>  <p>  \t      You may consider going for a second or third opinion to find the root of your acid reflux problem, but these opinions will all be similar because all of your doctors went to the same kind of medical school. All medical schools around the world have the same standard: GERD=PPI treatment! Naturopathic Physicians or nutritionists are more likely to offer alternative treatment ideas, because they are trained to examine the whole person and his or her entire medical history, and to resist treating symptoms in isolation.  </p>  <p>  \t      Now, you had been diagnosed with acid reflex and looking to understand why you have it, these lectures will help you.  </p>  <p>  \t      In the first section will define few terms and set up goals for the course.  </p>  <p>  \t      In the second section you will learn the basics of anatomy and physiology of the esophagus and stomach; you will understand how they work and why the work that way.  </p>  <p>  \t      The third section will cover the clinical presentation of GERD. After completing that section you will be able to match your symptoms with “classic” or “unusual” presentations.  </p>  <p>  \t      In the fourth section you will learn about the “standard” treatment of GERD with OTC and prescription medications. You will also learn about possible side effects of these medications.  </p>  <p>  \t      In the fifth section you will learn about individual approaches to treatment. By this point you should already have identified the cause of your individual condition. Look for your solution in this section.  </p>  <p>  \t      I hope to see you in my course.  </p>  <p>  \t      Here’s to your health.  </p>", 
    "end_date": null, 
    "title": "GERD", 
    "price": "30.00", 
    "instructors": "Veronica Waks M.D., N.D.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/156116_e80c_2.jpg", 
    "course_url": "https://www.udemy.com/gerd-acid-reflux/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-31T21:36:42Z"
}