{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tYOU KNOW how this goes;  </p>  <p>  \t        Have you had a stupidly busy day? And now you’re going out tonight or have a busy evening ahead… and you’re exhausted. Have you been doing just a bit too much lately and you’re physically worn out and emotionally drained?  </p>  <p>  \tDo you need a boost in the middle of a too-long work day?This Tool gives you an energy boost any time you need it, and to relax the mind for clearer thinking it will:  </p>  <p>  \t        ● Give you an energy boost that does not rely on stimulants  </p>  <p>  \t        ● Releases physical symptoms of stress in your body  </p>  <p>  \t        ● Enhances clarity of thinking and physical relief from stress.  </p>  <p>  \t<u>The 7 benefits of the 7 minute classes</u>  </p>  <p>  \t          1. The techniques are EASY &amp; VERY QUICK to learn and beneficial for everyone.  </p>  <p>  \t          2. Classes are only 7 minutes and you can do them anywhere, anytime.  </p>  <p>  \t          3. It’s a new way to physically relax your body, &amp; calm your mind to increase happiness.  </p>  <p>  \t          4. Many of the breaths classes can be done in public – when YOU need them most!  </p>  <p>  \t          5. These NEW techniques gives you the tools to cope with everyday stresses.  </p>  <p>  \t          6. The breaths classes really work – they do what they say, and you will feel instant relief!  </p>  <p>  \t          7. You will feel in control of your body and mind.  </p>  <p>  \t         Includes:  </p>  <ul>  \t<li>Immediately Accessible Fully Guided Video with extra setup tips</li>  \t<li>Fully Guided Audio with extra setup tips</li>  \t<li>Fully Guided Audio for Repeating if you want to do a longer class</li>  \t<li>Downloadable PDF’s with set up tips and extra information that will help you get the most out of your new skill</li>  </ul>  <p>  \t        This method will allow you to recover quickly and give you an energy boost better than caffeine - without the side effects! It will also allow you to be clear-thinking and calm, and let go of any feelings of tightness in your tummy or back that comes from trying to hold it all together all day.  </p>", 
    "end_date": null, 
    "title": "Get Energy & Emotional Stress Recovery - 7 Minute Tool ", 
    "price": "35.00", 
    "instructors": "Millie Swann", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296844_e7ef_5.jpg", 
    "course_url": "https://www.udemy.com/get-energy-emotional-stress-recovery-7-minute-tool/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T05:21:30Z"
}