{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Getting a good night’s sleep has a long list of positive benefits that greatly increase quality of life. </strong></p>\n\n<p>Unfortunately, many of us struggle to sleep well, either we can’t fall asleep or wake up and stay up tossing and turning. Then we spend our day feeling cranky, irritable and not being able to think clearly. Not getting enough sleep can be frustrating because we often feel that it’s not our fault. Sometimes we don’t feel we have the time. Other times we do our best to but find ourselves laying there and stare at the ceiling. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you can relate to this, you’re not alone! 1 in 3 people suffer from mild insomnia and nearly everyone has experienced sleep deprivation at times. It seems that lack of sleep is normal, but that doesn’t mean it’s healthy. In fact, the Centers for Disease Control has labeled insufficient sleep a public health problem. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Lack of sleep has some negative side effects, and studies have shown that the sleep-deprived are more prone to car and work accidents, depression, obesity, and many other chronic illnesses like diabetes and even cancer.</p>\n\n\n\n\n\n<p><strong><em class=\"redactor-inline-converted\">A note from instructor Joeel: \"I learned the importance of sleep the hard way... when extreme life trauma (failing college and losing my brother) and the resulting stress left me unable to sleep, which lead to many health conditions, like high blood pressure and passing out, that you wouldn't expect in a 19-year-old. Learning about how to sleep well, even under the hardest conditions, was a journey that brought me back to health and allowed me to turn that trauma into a powerful life purpose.\"</em></strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">There is good news—you too can use the power of your mind and some simple behavioral changes to improve the quality of your sleep. </strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course will help you:</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Understand why sleep matters and how it works</li><li>Know how much sleep you really need and how waking up at night may be normal</li><li>Learn how to live your life in a way that enhances your sleep</li><li>Learn techniques to help you fall asleep (or back asleep)</li><li>Explore natural remedies to sleep better</li><li>Learn powerful breathing and mental exercises to empower your sleep and your life</li><li>Help you help those you love (or your clients) get a better night’s sleep</li></ul>\n\n\n\n\n\n\n\n\n\n<p>Plus, you receive a 10 minute Guided Progressive Relaxation to help you drift off into a deep, restful sleep!</p>", 
    "end_date": null, 
    "title": "Get Better Sleep Now", 
    "price": "20.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/860790_3e81_2.jpg", 
    "course_url": "https://www.udemy.com/get-better-sleep-now/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-26T18:07:36Z"
}