{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>If you have been wanting to stop smoking and have had lots of excuses as to why its not the right time or you really need a cigarette to calm your nerves. This is the course for you learn the power of using natures gift hypnosis to change how you think and feel about stopping smoking before you even start to quit.</p><p>By using hypnosis you will gain the will power to make that decision easily without any effort at all and when you begin to stop you will find it so easy to stop smoking because you have used hypnosis you will wonder why you used to smoke for as long as you did.</p><p>For most people they start smoking at a young age sometimes to peer pressure and other times to feel more grown up and you have no need to do that anymore as an adult you have more power over the choices you make and are less likely to feel peer pressure and definitely you do not need to smoke to fit in because smoking has become so anti social now. </p><p><em><strong>What I will teach you in this course</strong></em></p><p><em><strong>1.  Learn how to get the best results from hypnosis</strong></em></p><p><em><strong>2.  learn how your mind and body work together with a fun but important lesson that will improve the results of this hypnotherapy session.</strong></em></p><p><em><strong>3.  Learn who can and cannot be hypnotized</strong></em></p><p><em><strong>4.  Get ready to stop smoking forever Hypnosis  bonus section</strong></em></p><p><em><strong>How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings that have been stopping you from feeling great</strong></em></p>", 
    "end_date": null, 
    "title": "Get ready to stop smoking forever Hypnosis ", 
    "price": 0, 
    "instructors": "Alan Kirwan", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420518_2665.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-get-ready-to-stop-smoking/", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T19:47:47Z"
}