{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t    So you’re interested in plants ....<br>  \t<br>  \t    If you’re on this page, then my guess is that you have a fascination with plants, herbs, fungi and all things medicinal...<br>  \t<br>  \t    Perhaps you are...  </p>  <ul>  \t<li>   a mother who wants to bring natural healing into your home and know how to use herbs for healing and first aid</li>  </ul>  <ul>  \t<li>   an elder who always wanted to study plant healing but never had the time and wants to age gracefully</li>  </ul>  <ul>  \t<li>an environmentalist who understands the damage done to our  environment by the manufacture and disposal of synthetic pharmaceuticals  (or pills)</li>  </ul>  <ul>  \t<li>you would rather use plant based medicine when possible because you are cautious of pharmaceuticals</li>  </ul>  <ul>  \t<li>you are a strong spirited individual who wants to empower herself with practical, empirical knowledge</li>  </ul>  <ul>  \t<li>you care deeply about mother earth and you also want to help heal her</li>  </ul>  <p>  \t    You have come to the right course. This course will show you  all you need to know to choose the best healing plants to grow. Why you want to grow these herbs. This course compliments my course on Learn how to make herbal medicines with confidence!. You do not necessarily need a garden to grow herbs as more and more places are supporting community gardens and planting of boulevards.   Through a series  of  videos you will sit in on a live class that goes  through everything you need to know to choose your own safe effective  herbal medicines to grow. In a very short time you will be empowered to grow  your own medicines that you can trust because you grew them and start  saving money (growing them costs a fraction compared to what they  are sold for retail). As you learn to grow medicines you will be  learning the wonderful system of herbalism. You will be studying with a  distinguished elder who has extensive experience in the world of herbs.  </p>", 
    "end_date": null, 
    "title": "Grow Your Own Natural Pharmacy", 
    "price": "20.00", 
    "instructors": "Don Ollsin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431280_403e_4.jpg", 
    "course_url": "https://www.udemy.com/grow-your-own-medicines/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T19:48:55Z"
}