{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t      Over 130 + students making a positive and healthy change in their pregnancy journey !!  </p>  <p style=\"\">  \t      The course is at a special price of $ 19 until 1st January 2015, then will return to normal price of $ 39.<br style=\"\">  </p>  <p style=\"\">  \t      Having the best pregnancy possible is easily attainable. By following the simple guidelines in this course you will become more healthy, happy and relaxed during your pregnancy journey. Being pregnant is such a special time in a woman&#039;s life. You are the bearer of a new little human upon our planet. You are the bringer of a new life.  </p>  <p style=\"\">  \t                                              In this course, Happy &amp; Healthy Pregnancy: An Easy Guide to Having the Best Pregnancy and Healthiest Baby Possible, I focus on the importance of having a healthy and happy Body, Mind &amp; Spirit throughout the pregnancy. Everything that happens in the body affects the mind, which in turn affects the spirit. This also applies in reverse order. If the spirit (or inner energy) becomes despondent or angry, this affects the thoughts and the mind, which in turn affects the health and well being of the body. All is interrelated and connected.  </p>  <p style=\"\">  \t                          For the 9 months of pregnancy you are this child&#039;s caretaker. All that you &#039;eat, drink and think&#039; from now to the end of your pregnancy is directly related to the health of your baby.  </p>  <p style=\"\">  \t                                              Pregnancy is a time of many conflicting emotional, mental and physical states. There are times of high elation, full of energy and vitality, and then there are times of being tired, sick and overwhelmed.  </p>  <p style=\"\">  \t                                              And through all these up and downs, there is a new little human rapidly growing and transforming in your womb. Learn natural and healthy tips and tricks that will make your pregnancy the natural and joyful experience it is meant to be.  </p>  <p style=\"\">  \t                                Included in this course educational videos, 20 lectures, 3 guided meditation audios, Natural and &#039;Green&#039; household cleaner instruction guide and 4 worksheets.  </p>  <p style=\"\">  \t                                          This course gives simple strategies and techniques to have a happy and healthy pregnancy, how to develop intuitive skills, and healthy lifestyle tips and information to ensure you have the best pregnancy and healthiest baby possible.  </p>", 
    "end_date": null, 
    "title": "Happy & Healthy Pregnancy", 
    "price": "20.00", 
    "instructors": "Donna Attard", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/318026_9712.jpg", 
    "course_url": "https://www.udemy.com/happy-healthy-pregnancy/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-12T00:49:53Z"
}