{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tYOU KNOW how this goes;  </p>  <p>  \t        Have you got that annoying tension headache hanging around, and you either don’t want to take headache medication or you don’t have any available? Is your headache keeping you from being productive and happy, or from relaxing?For pain relief from low level headaches.  </p>  <p>  \t        ● Uses simple, natural methods to reduce pain  </p>  <p>  \t        ● Allows you to relax and release tension associated with headaches  </p>  <p>  \t        ● Restores focus and happiness  </p>  <p>  \t<u>The 7 benefits of the 7 minute classes</u>  </p>  <p>  \t        1. The techniques are EASY &amp; VERY QUICK to learn and beneficial for everyone.  </p>  <p>  \t        2. Classes are only 7 minutes and you can do them anywhere, anytime.  </p>  <p>  \t        3. It’s a new way to physically relax your body, &amp; calm your mind to increase happiness.  </p>  <p>  \t        4. Many of the breaths classes can be done in public – when YOU need them most!  </p>  <p>  \t        5. These NEW techniques gives you the tools to cope with everyday stresses.  </p>  <p>  \t        6. The breaths classes really work – they do what they say, and you will feel instant relief!  </p>  <p>  \t        7. You will feel in control of your body and mind.  </p>  <p>  \t        Includes:  </p>  <ul>  \t<li>Immediately Accessible Fully Guided Video with extra setup tips</li>  \t<li>Fully Guided Audio with extra setup tips</li>  \t<li>Fully Guided Audio for Repeating if you want to do a longer class</li>  \t<li>Downloadable PDF’s with set up tips and extra information that will help you get the most out of your new skill</li>  </ul>  <p>  \t        This is a very clever and simple method using light pressure, visualisation and breath that will help you reduce the pain associated with a low level headache. This method will help you feel in control and centred again  </p>", 
    "end_date": null, 
    "title": "Headache & Tension Relief - 7 Minute Tool - Can do in public", 
    "price": "35.00", 
    "instructors": "Millie Swann", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296846_d800_4.jpg", 
    "course_url": "https://www.udemy.com/headache-tension-relief-7-minute-tool-can-do-in-public/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T05:24:24Z"
}