{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul><li><strong>During this ground-breaking course you will be able to get substantial relief from most acute or chronic physical discomforts, such as neck, shoulder, back aches, pains, tension, stiffness also joint problems, headaches and pms</strong><strong> </strong>(very often no matter the cause)<strong> from work, home, sports and accident related injuries and strains to poor posture, even stress! </strong><em>'Paul is great...it helped me!'</em> <strong>Kate Moss</strong> Supermodel </li><li>Easy and simple to understand and implement, the methods you will learn are tried and tested. In-fact <em>tens of thousands</em> of people have already used and benefited from them</li><li><strong>These safe, painless and effective methods are scientifically proven, and have been researched and developed for well over a decade by a team of specialized doctors and health care professionals </strong>(whom I was fortunate to be trained by)</li><li>Throughout the course you will also learn how to quickly reduce, even eliminate the negative emotions that very often contribute to a physical problem, <strong>e.g stress, anxiety, sadness, anger, fear, frustration</strong></li><li>There is a special advanced section that will help you shift any stubborn problem</li><li>The course is a great add on and beneficial additional tool for doctors, nurses, chiropractors, physiotherapists and other therapists to learn then use in their practice!</li><li>Performing the methods only a couple of times is often enough to alleviate a problem</li><li><strong>Although best performed in a quiet private space the methods can be used anywhere, anytime - even in public for quick relief or in a emergency</strong></li><li>Benefits frequently quickly felt</li><li>Methods can be safely used on self, friends or loved ones</li><li>Taught in an easy to follow fashion</li><li>The first course of its kind  - ever!</li><li>No tools or equipment needed</li><li>No previous knowledge required</li><li>Comes with additional complimentary module PDF worksheets</li><li>Course and its benefits can be completed within an hour</li><li>Two Free bonus videos</li><li>Free valuable surprise gift at end of course </li><li>Course supports and compliments the care and advice of a doctor or other licensed medical practitioner e.g chiropractor, physiotherapist</li><li><strong>With nothing to lose and everything to gain <em>please enroll in this course now</em> if you want to <strong>be <em>pain &amp; stress free</em> and just </strong>get on with your life. Enjoy <em>freedom from pain - today!</em></strong></li></ul>", 
    "end_date": null, 
    "title": "Headaches, Neck Shoulder Back Pain? Guaranteed Quick Relief!", 
    "price": "25.00", 
    "instructors": "Paul Emery", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449066_40d9_4.jpg", 
    "course_url": "https://www.udemy.com/freedom-from-pain-today/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T01:48:23Z"
}