{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">***OVER 500 Students Enrolled in the first 48 Hours***</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>If unwanted habits or addictions are causing you to feel <strong style=\"\"><em style=\"\">out of control</em></strong> in your life or are holding you back from all you know you are meant to be, today is a day of hope. <em style=\"\"><strong style=\"\">Heal the Habit</strong></em> guides you on a journey unlike any other. It teaches you how to <em style=\"\"><strong style=\"\">heal on an emotional, physical, and spiritual level </strong></em>and helps you receive this healing in a natural and peaceful way. It goes way beyond willpower or determination and, instead, helps you reach deep within yourself to find the <strong style=\"\"><em style=\"\">desire, motivation, and ability to change </em></strong>your life and to release the unwanted habit. It guides you in learning to claim the healing power available to you and helps you to connect with both yourself and your Higher Power on a deeper and more meaningful level.  The journey incorporates teaching, insight, healing music, guided visualizations, and the<em style=\"\"> power of hypnosis</em> to help <em style=\"\"><strong style=\"\">bring the positive changes</strong></em> you desire.  </p>  <p style=\"\">  \t                      There are ten steps within this journey. Each step includes a short video, a hypnosis/meditation audio recording, as well as time for reflection and journaling. The steps are meant to be taken at the pace that feels best to you. One step per week is often most comfortable and you are encouraged to listen to each audio recording several times before moving forward with the next step.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Heal the Habit</strong></em> is meant for both behavioral and substance addictions, great and small. Any unwanted habit or addiction can be addressed through this course. Some of the issues that can be helped through this course are <strong style=\"\"><em style=\"\">smoking and alcohol addictions, gambling, gaming, and electronic addictions, sugar and food addictions, as well as shopping and sexual addictions, including pornography.</em></strong> The list is endless.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Heal the Habit</strong></em> can complement any other treatment or program you have tried in the past or are currently undertaking. It is not meant to replace medical advice or traditional therapies. It is, however, a beautiful <strong style=\"\"><em style=\"\">new tool</em></strong> to add to your arsenal as you fight the battle for <em style=\"\"><strong style=\"\">freedom</strong></em> and of creating the life you truly desire.  </p>  <p style=\"\">  \t                I encourage you to begin your<strong style=\"\"> journey toward freedom today </strong><em style=\"\">and stop the unwanted habits or addictions that are holding you back!</em><strong style=\"\"> </strong>I am so confident that you will both enjoy and benefit from this course that I offer a <strong style=\"\">30 Day Money Back Guarantee</strong>. You have nothing to lose! <em style=\"\">Enroll today and feel the healing benefits that so many others are already witnessing in their lives</em>.  </p>", 
    "end_date": null, 
    "title": "Heal the Habit - Addiction Recovery on a Whole New Level ", 
    "price": "45.00", 
    "instructors": "Melody Litton", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415156_e357_2.jpg", 
    "course_url": "https://www.udemy.com/heal-the-habit/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T17:40:45Z"
}