{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Life is all about compromises, right? </p><p>Well, if you think you can ignore your bad eating habits just because you exercise regularly, think again. Unfortunately, spending an hour of rigorous exercise in the gym for a greasy double cheeseburger or relying on a good metabolism to take the place of healthy eating habits completely misses the point of living a healthy lifestyle…</p>  <p><em> </em></p>  <p>Eating a healthy diet is far from simple, simply because we humans are very complex beings. We may have it in the back of our minds that we are eating to fuel our bodies, but we actually make the majority of our food choices based on their enjoyment factor. And that is the main reason why it has become so tough in today’s world to switch to a healthy eating habits because we are just not ready to give up on the taste factor and the happiness it brings with it.</p>    <p>Well… what if I tell you can still choose a healthy option? You just need to avoid one things, and that is “OIL”</p>  <p>Don’t worry, I am not telling you to eat bland food or make your mind to switch to eating boiled food only.</p>    <p>In my course I have explained the magic techniques that is required to cook delicious no oil food. I have provided 9 recipes for you to start with and I will keep adding more recipes.</p>    <p>I would appreciate your participation in learning new techniques of no oil cooking and I will look forward to hear from you in the discussion section about what are you interested in learning more and I promise to create it for YOU.</p>    <p>My mission is to create a community of healthy eating people who doesn’t follow a crash diet to achieve result rather make lifestyle change to create a HEALTHY YOU</p>", 
    "end_date": null, 
    "title": "Healthy living with \"No Oil\" Recipes - Non Vegetarian", 
    "price": "20.00", 
    "instructors": "Susmita Dutta", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754112_7441_2.jpg", 
    "course_url": "https://www.udemy.com/no-oil-cooking-meat-recipes-no-cholesterol-fat-free-food/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T05:56:18Z"
}