{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you suffering from a plaguing pain in your knees and joints that hounds you every now and then?</p><p>Or are your joints showing signs of weakening (for example, you need to rely on the support of your hands to stand up) but you don't know what you can do to manage it?</p><p>Common misconceptions may leave you believing that weakening knees and joints are an inevitable part of aging that you have to put up with. </p><p>But, thankfully – because you're here – you will learn the real facts.</p><p><strong>The truth of the matter is: </strong><b>our bones are constantly in the process of remodeling, and with proper care, you can certainly improve your current situation and enjoy stronger knees and joints again!</b></p><p>'Healthy Knees and Joints: Natural Remedies For Pain Relief' is a course that will prove that no matter how old or young you are now, you <em>can </em>get your knees and joints to start feeling happy and healthy again :)</p><p>Using simple self-care techniques that you will learn throughout this course, you will gain the knowledge and skills to restore and care for your knees and joints <i>naturally</i> – without the use of painkillers, steroids or needles.</p><p><em>You don't have to worry about any side effects from drugs that may harm your body (because we will be steering clear of drugs in this course).</em></p><p><em>And you can finally say goodbye to constant complaints of discomfort and pain in your joints and welcome the active lifestyle that you dearly miss with wide open arms.</em></p><p>With 'Healthy Knees and Joints: Natural Remedies For Pain Relief', you will learn how to make pain-free movement a reality for yourself!</p><p><b>~ Healing Your Body From The Inside Out ~</b></p><p>Most conventional methods focus on pain relief and the use of supplements.</p><p>However the reality is: If you do not have a healthy internal system in the first place, no matter how nutrition-packed your food is or how expensive your supplements are, the efforts will be counterproductive and ineffective – for the simple reason that your body is simply unable to absorb nutrients efficiently.</p><p><b>To give you the right head start, this course works on getting your fundamentals right first by improving your internal systems, so that your body can absorb nutrients better and truly heal from the inside out.</b></p><p>'Healthy Knees and Joints: Natural Remedies For Pain Relief' is designed to provide you with a holistic approach to progressively restore your knees and joints to optimum health through a systematic four-week learning plan.</p><p>Here's a quick overview of what you will learn in this comprehensive course:</p> <ul><li>How to strengthen your body internal system using meridian self-therapy techniques</li> <li>Key fundamental concepts on your body's nutrient needs to have strong and healthy bones (P.S. it's not just milk)</li> <li>How to improve your joint health with whole foods that make a difference (rather than relying on medication and supplements)</li> <li>Natural remedies to help you to relieve and avoid aches and pain</li> <li>How to condition your body to have stronger legs and better knee and joint movement with simple exercises that you can practice easily at home</li></ul> <p>.</p><p>By taking this course, you will empower yourself with the relevant knowledge and skills in natural therapy to understand your body internal system and take better care of your knees and joints in the long term.</p><p>Applying the knowledge and regularly practicing the exercises in this course will help you to enjoy greater flexibility, healthier knees and joints, better movement, and most importantly, feel lighter and happier every day!</p><p><strong>Note: </strong>This is not a course to teach you a quick fix for your knee and joint issues! You will need to practice the techniques covered consistently to see progressive results. This course is meant to supplement – not replace – whatever medical treatment that you are undergoing currently.</p><p><b>~ Success Stories To Share ~</b></p><p>I have been conducting in-person workshops with 11 years of experience in the field of natural therapy, and I hope that through converting my program into this online course, more people can benefit from my sharing to have better health and a better life.</p><p>Many of my participants who are in their golden years have shown significant improvements since practicing the techniques that I taught them, and they no longer need to rely on walking aids or knee guards like they used to.</p><p>Here are some of the feedback that I received from my participants (unedited):</p><p> “I came for the training for my left knee problem. After following through the first round of program, <strong>my knee is more flexible and my nagging knee pain does not bug me anymore</strong>. With the Meridian Therapy techniques, I also improve my digestion issue and bowel movement. <strong>I benefit more than I expected</strong>. That is why I asked my classmate to come along.\" – Mdm Tan, Retiree</p><p>(Latest update: Mdm Tan managed to enjoy a good trip traveling in Taman Negara which required plenty of walking and climbing of stairs.)</p><p>“I have problem squatting down and I had challenges following the simple strengthening routine the first two weeks. <strong>Now, I have no problem squatting down and my knee and joints are strengthened</strong>.\" – Mrs Chan, Homemaker</p><p> “Wow, <strong>my legs feel lighter now after the first two weeks</strong>“ - Jasmine, Hairdresser</p><p>“I have been practicing the strengthening routine for the legs for the past one week. <strong>It is effective and it seems that the pain is lesser and sometimes no pain</strong>“ – Cheng Neo</p><p> “I used to need walking stick during my overseas trip. After practicing the routine and techniques consistently, I was <strong>able to walk a long distance in Penang without walking stick</strong> and enjoy my favorite fruits – Durian.\" – Yue Xiang,</p><p>(Update: Yue Xiang can now climb the stairs which she could hardly do previously.)</p><p>This course includes more than 30 detailed video lessons, including step by step instructional videos to guide you through the at-home exercises, as well as weekly action plans that you can download and refer to easily.</p><p>Don't worry if you encounter any difficulties along the way because I will be here to answer any questions that you have and share my personal experiences with you.</p><p>Don't ignore your joint issues and continue to suffer in pain. Take charge of your health by enrolling in this course today.</p><p>Many of my students have gained the confidence to lead an active lifestyle and I believe can do it too!</p>", 
    "end_date": null, 
    "title": "Healthy Knees and Joints: Natural Remedies For Pain Relief", 
    "price": "40.00", 
    "instructors": "Peng Tatt Lim", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485086_bc54_3.jpg", 
    "course_url": "https://www.udemy.com/strong-knees-and-joints-pain-free-movement/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T10:35:12Z"
}