{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This is a unique collaborative course in healing back pain and spine alignment.</p><p>It brings together 2 very powerful practices;</p><p><strong>Acupressure and Kundalini Yoga!</strong></p><p>When these 2 are combined, it ensures incredible results:<br></p><ul><li>The <strong>Acupressure techniques are proven to be fast and effective for back pain relief.<br></strong></li></ul><p>We teach you in minutes exactly how to relieve, or even prevent pain in your back.<br></p><p>This is taught by <strong>Dr Bargak who has 30 years experience</strong> in this field!<br></p><ul><li>We also have a <strong>FULL Kundalini Yoga set</strong> which is specifically designed to bring back pain relief, align your spine and increase your vitality and well being.</li></ul><p>The more you make this set a part of your routine, even if for a few minutes a day, the more you will not only keep your back strong, flexible and healthy, but you will also ensure you <strong>maintain a consistent state of well-being and vitality!</strong></p><p>This is taught by <strong>Mark Keane, the most experienced Kundalini Yogi in the South West of England</strong>.</p><p><strong>If you ever suffer from any back pain, or if you wish to prevent this most common affliction, then this course is for YOU!</strong></p><p><strong>Enroll Now!</strong><br></p><p>30 Day Money Back Guarantee!<br></p>", 
    "end_date": null, 
    "title": "Heal Your Back Pain With Acupressure Points & Kundalini Yoga", 
    "price": "20.00", 
    "instructors": "Mark Keane, Dr. Jakob Bargak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/671128_2f39_2.jpg", 
    "course_url": "https://www.udemy.com/heal-back-pain/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-16T13:25:51Z"
}