{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>There are many home remedies available to us that are simple to make or take at home that can truly lessen the severity and length or a cold or flu illness. Many of these are recipes passed down from our grandmothers and have been used for hundreds of years. Even though many of these remedies are folk medicine, their effectiveness has been backed up by science.</p>    <p>These home remedies don’t just simply mask symptoms like pharmaceuticals or contain unwanted side effects. They really are working with the whole body to boost the immune system and are extremely effective antibacterials and antivirals. They shine at helping to build and restore the system.</p>    <p>In this course, we will cover the foods and teas to get you through the cold and flu season. This includes simple recipes to make before the season begins and really simple recipes once you or someone you care for becomes sick. We will also go through what you can buy at the store to have on hand.</p>        <p>In this course, I also cover various protocols for each type of symptom, sore throat, respiratory congestion, fever and ear infections. Finally and most importantly, I go through that best ways to avoid becoming sick in the first place. </p>    <p>So join me in this highly informative course. When cold and flu season hits this year, you’ll be glad you did!</p>", 
    "end_date": null, 
    "title": "Home Remedies: Secrets for Health this Cold & Flu Season", 
    "price": "20.00", 
    "instructors": "Elizabeth Heck", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/652912_8dc7_2.jpg", 
    "course_url": "https://www.udemy.com/home-remedies-for-colds-and-flu/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T00:25:32Z"
}