{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>ATTENTION ! </p>  <p>Are Chronic Pain symptoms causing misery and inconvenience in your life?</p>  <p>Are you one of the Millions of people suffering from these Symptoms ?</p>  <p>Today Is the day You can Stop spending Thousands Of dollars On Temporary Chronic Pain relief !</p>  <p>In this Course, DISCOVER the LATEST proven method for curing Chronic Pain symptoms COMPLETELY and PERMANENTLY without Drugs, without Surgery, without Exercise and without Physical Therapy!</p>  <p>Typical chronic pain symptoms include : - Lower Back pain, Migraine, Ulcers, Fibromyalgia, Neck pain, Knee pain, Foot pain, Shoulder pain, Skin Disorders, Dizziness, Chronic Fatigue, Irritable bowel, Irritable Bladder, Tension Headache, etc...</p>  <p> If You or Someone You Love is Suffering from Chronic Pain symptoms then This Will Be the Most Important Course You will Ever complete !</p>  <p>Take Action Now !</p>  <p>A single chiropractic treatment for back pain might cost about $65…</p>  <p>A single massage session, maybe $60…</p>  <p>A trip for acupuncture might run anywhere between $45 and $100…</p>  <p>And of course, things start to get very expensive if you start taking medication, getting advanced treatments or surgery.</p>  <p>The bottom line is you could spend a lot of money doing all these things and still only end up with temporary relief for your pain. That’s exactly what I did… for years. I was treating the Pain instead of treating the SOURCE of my pain. This Course focuses on treating the SOURCE of your pain so you will have Permanent relief!</p>  <p>I’ve been exactly where you are right now. With the information in this Course, I cured my Chronic Pain symptoms permanently.  So my goal is to get this information into the hands of as many chronic pain sufferers as possible. </p>", 
    "end_date": null, 
    "title": "How I Cured my Chronic Pain !", 
    "price": "20.00", 
    "instructors": "John Hesnan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709426_54b9_8.jpg", 
    "course_url": "https://www.udemy.com/how-i-cured-my-chronic-pain/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T08:42:16Z"
}