{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong>  Over 250 Students in less than a week!</strong>  </p>  <p>  \t<strong>Thousands of Youtube Testimonials!</strong>  </p>  <p>  \t<strong>1 Million Views!</strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>&quot;Absolutely amazing! You don&#039;t understand how much this helped me! I was in so much discomfort, especially with pain in my left shoulder and arm. I started your exercises immediately and feel almost no pain now. THANK YOU!!! &quot;</strong>..Amanda Sands  </p>  <p>  \t    In this course you are going to learn how easy it is for you to fix your own neck pain and treat any pinched nerves such as pain, tingling or numbness in your arms, hands or fingers.  </p>  <p>  \t                          You will also learn exactly what causes your neck pain and disc bulges so that you can then stop harming your neck because it is essential that you first remove the causes of your neck pain to ever hope to have a pain free neck permanently.  </p>  <p>  \t                          Once you have learnt the causes of your neck pain and start implementing them in your daily life you will then be on the path to healing your neck instead of harming it all day every day.  </p>  <p>  \t                          The course shows you two specific exercises that you need to do to remove your neck pain and treat any disc bulges and pinched nerves. You will learn exactly how and why these exercises work so that you have a clear understanding of what it is your doing to remove your pain and radiating symptoms ( if you have any).  </p>  <p>  \t                          You will also learn other pain relieving techniques such as how to help trigger point pain and knots in your upper back  </p>  <p>  \t                          Once you have studied this course, you will then know:  </p>  <ul>  \t<li> What causes your neck pain and how to remove those causes from your daily life so that your neck can finally get a chance to heal and you can become pain free.</li>  \t<li>How to treat your own neck pain without drugs, treatments or surgery.</li>  \t<li>What causes your discs to bulge and nerves to become pinched and how to avoid this happening in the future.</li>  \t<li>How to save 1000&#039;s of dollars on unnecessary treatments.</li>  \t<li>How to fix your own neck pain if you should ever have a recurrence of your neck symptoms ever again.</li>  </ul>  <p>  \t<strong>    Enroll in this course now to learn how to remove your neck pain and get your quality of life back!  </strong>  </p>", 
    "end_date": null, 
    "title": "How to fix your own neck pain", 
    "price": "20.00", 
    "instructors": "Mark Perren-Jones", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297018_c91a_3.jpg", 
    "course_url": "https://www.udemy.com/spinal-institutes-neck-pain-and-pinched-nerve-solution/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T11:31:07Z"
}