{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>If you're struggling to quit drinking now and you need help, if you’ve struggled in the past, or if want to help someone who is struggling now, this course punctures the bubble of confusing and dangerous misinformation that surrounds the alcohol and the quit alcohol industries, giving you an insight into why you drink alcohol and exactly what you need to do to stop. </p>\n\n<p>Featuring over 12 hours of quality HD videos, this course provides a refreshing way of thinking about stopping drinking.</p>\n\n<p>You will learn about the propaganda that keeps you hooked into the lies, even when you know drinking is not good for you.</p>\n\n<p>You will learn how your language can distort the how you see reality. </p>\n\n<p>We’ll examine your use of words like alcoholic, moderation, recovery, and the demon drink. I’ll show you that by using those words you are making life much more difficult for yourself when it comes to quitting. <br></p>\n\n<p>We will also take a close look at what you should expect once you do quit. We’ll look at the reality of the symptoms and side effects of quitting drinking. I will show you some simple tricks that will alter your thinking and your entire alcohol quitting experience.<br></p>\n\n<p>You will also learn that your fears can hurt you before you even start on your journey and how making some small changes will allow you to step into your new life full of confidence about the great journey that’s ahead of you.</p>\n\n<p>\"I've just watched my first video from the course: Video 09 - \"Your <br></p>\n\n<p>Commitment to Stopping Putting The Alcohol into Your Mouth\" And I just <br>had to email you to say how bloody inspirational it is! It's cheered me <br>right up, and just nudged me back on the right tracks again. Thanks man,<br> you've no idea how much your YouTube channel, books, audio, and videos <br>have helped me over the past couple of years.\" Paul (Yorkshire, UK)\t\t\t\t\t</p>\n\n<p>Thanks for your help!Tim (Adelaide, AU)</p>", 
    "end_date": null, 
    "title": "How to Stop Drinking Alcohol", 
    "price": "50.00", 
    "instructors": "Kevin O'Hara", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793450_fd54_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-stop-drinking-alcohol/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T10:19:08Z"
}