{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This is a course in which you'll be able to fully understand...<br></p><p> - WHY you developed Type 2 Diabetes</p><p> - WHAT were the factors that contributed to this</p><p> - WHAT YOU CAN DO to effortlessly reverse it naturally and restore normal blood sugar levels </p><p>You'll discover <strong>EVERYTHING you need to know about nutrition, exercise, sleep and stress management</strong> to reverse your diabetes and reclaim your health naturally. </p><p>Actually, the course also contains <strong>a 30-day program</strong> at the end which <strong>guarantees</strong> that, if you follow along with it, <strong>you can achieve normal blood sugar levels.</strong> </p><p>Make no mistake about it - this is <strong>THE BEST program out there on reversing Type 2 Diabetes as fast as possible.</strong></p><p>This is a simple course that literally anyone, with any education, can easily understand. You can go through it at your own pace.</p><p>What Are The Requirements:</p><p>A willingness to learn and understand simple-to-grasp concepts and a willingness to apply them to your daily habits.</p><p>ANYONE, with any education whatsoever and with only a bit of desire, can tremendously benefit from this course. </p><p><strong>What Am I Going To Get From This Course?</strong></p><p>Follow the easy 30-day program that will transform you into an \"Ex-Diabetic\" in just 30 days<br></p><p>Find out what you need to do after you've restored your normal blood sugar levels and how to continue improving your health.</p>", 
    "end_date": null, 
    "title": "How To Reverse Your Type 2 Diabetes Naturally and Easily", 
    "price": "30.00", 
    "instructors": "Dr. Iulian Novac", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/734640_be8f_4.jpg", 
    "course_url": "https://www.udemy.com/reverse-your-type-2-diabetes-naturally-in-30-days/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T20:34:00Z"
}