{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is talking about how to quit smoking in 10 step. This 10 steps are quite simple and if you follow all our steps that we show. I sure that you can quit smoking with using this 10 Steps. I will show you all the step in very details to make you all understand what i present.</p><p>This course usually is for those who want to quit smoking but no idea how to quit smoking. This course will have many idea to teach you how to quit smoking with natural ways and also will tell you what is the side effect once you take medicine to stop smoking. And also it is not suitable for those smoker who want to quit but never take action after study our course.</p><p>This course will differentiate normal smoker and heavy smoker the way how to quit smoking. Take medicine or use natural ways to quit, it will teach our student in our course. And also our course also will share some useful herbal remedies to our student.</p><p>This course will take you around 40 minutes and the duration of successful quit of smoking depends on the smokers. If student have many years smoking then i will take longer than few years or more less smokers.</p><p>We will share our student some story like the history of smoking and after that will share to our student the way to quit smoking in details. Other than that, we also will share to them the side effect when take medicine to stop smoking. So basically if our student follow our course teaching then they will quit smoking very successfully. Furthermore, this course will also share some extra knowledge like one cigarette is made by how many ingredients and where the cigarette start.</p><p><span></span>Student need to take this course because they need a healthy life. They want to stay more longer in this world.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "How To Quit Smoking In 10 Steps", 
    "price": "20.00", 
    "instructors": "Jonathan Leong, Hong Guan Lim", 
    "commitment": "29 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471672_be21_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-quit-smoking-in-10-step/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T08:09:41Z"
}