{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">In this course you are going to learn how easy it is for you to fix your own rotator cuff and shoulder pain.</span>  </p>  <p style=\"\">  \tYou will also learn exactly what causes your shoulder pain so that you can then finally stop harming your shoulder. As you will see, it is absolutely essential that you first remove the causes of your pain to ever hope to have a pain free shoulder permanently.  </p>  <p style=\"\">  \tOnce you have learnt the causes of your rotator cuff and shoulder pain and start implementing the techniques and exercises outlined in this course you will see an increase in your range of movement and a decrease in your pain  </p>  <p style=\"\">  \tImportantly, you will also be able to diagnose if your shoulder pain is in fact from a shoulder pathology or if it is from a neck pathology and referring pain into your shoulder. This of course is a vital step to a full recovery and  doing the correct exercises. As you can imagine, it is worthless to do shoulder exercises when its actually neck exercises that you should be doing.  </p>  <p style=\"\">  \tOnce you have studied this course, you will then know:  </p>  <ul style=\"\">  \t<li style=\"\">What causes your shoulder pain and how to remove those causes from your daily life so that your back can finally get a chance to heal and you can become pain free.</li>  \t<li style=\"\">How to treat your own pain without drugs, treatments or surgery.</li>  \t<li style=\"\">How to save 1000&#039;s of dollars on unnecessary treatments.</li>  \t<li style=\"\">How to fix your own shoulder  pain if you should ever have a recurrence of your symptoms ever again.</li>  </ul>", 
    "end_date": null, 
    "title": "How to Fix your own Rotator Cuff and Shoulder pain", 
    "price": "20.00", 
    "instructors": "Mark Perren-Jones", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429046_82e2.jpg", 
    "course_url": "https://www.udemy.com/how-to-fix-your-own-rotator-cuff-and-shoulder-pain/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-22T12:55:32Z"
}