{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t    Does it seem like you have tried everything for your back pain, and either it doesn’t get better or it keeps coming back? This course is for you. If you think your back pain is inevitable, unbeatable, and will require expensive ongoing treatment to manage, think again. Even if you have sciatica, arthritis, or a herniated or degenerative disc, you can get relief.  </p>  <p style=\"\">  \t    Gain a new perspective on your back pain:  </p>  <ul style=\"\">  \t<li style=\"\">What causes it?</li>  \t<li style=\"\">How can you heal it?</li>  \t<li style=\"\">Where should you look for effective treatment?</li>  \t<li style=\"\">Better yet, what should you do for self-treatment? Learn a framework to treat back pain yourself, in the privacy of your own home.</li>  </ul>  <p style=\"\">  \t    These are all lessons that I learned during a decade-long back pain journey following a broken back. I made all the mistakes, and spent years digging into the latest medical literature, so you don’t have to. With this course, you can learn the back pain secret that will put you in the minority of back pain sufferers who successfully beat it.  </p>  <p style=\"\">  \t<strong style=\"\">What am I going to get from this course?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">12 lectures and over 40 minutes of content!</li>  \t<li style=\"\">A new understanding of your back pain and a framework to treat it yourself.</li>  \t<li style=\"\">You will also learn where to find the resources to get the right help if you need it.</li>  </ul>  <p style=\"\">  \t    The course consists of PowerPoint video modules. A PDF handout is also included for the 3 steps to back pain relief, and you will receive a link to download step 1 of the program.  </p>  <p style=\"\">  \t    You can complete this course in one sitting, or whenever you have a few minutes to view an individual lecture.<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "How to Beat Your Back Pain", 
    "price": "20.00", 
    "instructors": "Gillian Hubble", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/258588_ca9c_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-beat-your-back-pain/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-09T20:05:45Z"
}