{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course will give you the information you need to solve many of the problems you may have with your CPAP machine and mask.  And for the problems you can't solve yourself, it will give you the information you need to better communicate with your doctor, the sleep lab, and the therapist or technologist from the medical equipment supplier.</p><p>We are going to first talk about sleep apnea because only by understanding what apnea is, and how it does its harm, can you understand what you are trying to accomplish with your therapy, and why.</p><p>We are also going to discuss some of the alternative therapies for sleep apnea and what factors might make you a candidate for one of them.  I will share with you why CPAP is so often the prescribed treatment and why your doctor seems to prefer CPAP over other therapies.</p><p>Then we will discuss the problems and challenges to living with CPAP, solutions that might work, and other things you can do to help.  There are a couple downloads with a glossary and sleep tips we use.</p><p>Using the Udemy course discussion panel, this course moves my regular CPAP support groups to an online format.  However, <em>this course does <strong></strong></em><strong>NOT</strong><em><strong></strong> give medical advice</em>.  Only YOUR doctor can give you medical advice.  Professional advice requires one-on-one communication with the professional and cannot be provided in a video, a book or other publication. I believe this one-on-one communication should also be face-to-face in the case of medical advice. </p>", 
    "end_date": null, 
    "title": "How to Tolerate CPAP Therapy for your Sleep Apnea", 
    "price": 0, 
    "instructors": "Robert Dawkins", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/586424_f60f.jpg", 
    "course_url": "https://www.udemy.com/how-to-tolerate-cpap-therapy-for-your-sleep-apnea/", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T14:42:37Z"
}