{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  Would you like to add 5, 10, even 20 years to your life? Tens of thousands of people all over the world are doing, and the number is growing. They have learned the secrets to extended life. You can do it, too. This course can help.  </p>  <p>  \t  Hi, my name is Evander Smart, and with a relative of my own who is over 103 years old, I have spent the last year researching how people age, why people die, and how to make the most of this life. A little information goes a long way, so I&#039;ve provided you with a 10 video collection called <strong style=\"\"><em style=\"\">&quot;How to Live to 100 - The Beginners Collection&quot;</em></strong>. They&#039;re all for you to use here on Udemy, and all at no charge to you.  </p>  <p>  \t  This course is your first step in an education on how to live longer, how to avoid deadly diseases, the factors that determine how long you can live, and much more. The vdieos are very easy to follow, with no technical terminology. And there is only one graph in the whole collection. Think of this as your first step in the School of Longevity here on Udemy. For now, enjoy this look into the human lifespan, and open your mind to the possibilities of an ever longer life. There are thousands of people all over the world who have unlocked the secrets of everlasting life. This is your first step towards achieving their true wisdom of a lifetime. Also feel free to take the quiz that comes along with the 10 video training course.  </p>  <p>  \t  There will be another collection coming soon to Udemy called <strong style=\"\"><em style=\"\">&quot;How to Live to 100 - The Centenarian Collection&quot;.</em></strong> It reveals countless secrets to longer life, and will include 20 videos and a special 230+-page eBook, so keep an eye out for it in April 2015. Exclusively here on Udemy.  </p>", 
    "end_date": null, 
    "title": "How To Live to 100 - The Beginners Collection", 
    "price": 0, 
    "instructors": "Evander Smart", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431072_90b7.jpg", 
    "course_url": "https://www.udemy.com/howtoliveto100beginners/", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T15:24:27Z"
}