{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course titled 'Hypnosis - Heal General Illness For Mental Wellness Using Self Hypnosis.' By Pradeep Aggarwal , you will learn -</p><ul><li>The psychological reasons behind general illness affecting your mental and physical wellness</li><li>You will be able to manage your general illness with the powerful techniques of self hypnosis, visualization, imagery and affirmations</li><li>You will be able to relax instantly using self hypnosis techniques</li><li>You will be able to reduce stress, depression , insomnia and negativity using powerful self hypnosis and affirmations</li></ul><p>This course is a must for those who are suffering from general health issues and are unable to get rid of the problems mentally and physically.</p><p>It is ideal for everyone who want to heal their general health and improve their mental health</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 9 lectures in English including bonuses.</p><p>This course contains-</p><p>Lecture1:Introduction</p><p>Lecture2:Remove Myths About Self Hypnosis</p><p>Lecture3:Conscious Mind Vs Subconscious Mind</p><p>Lecture4:How To Enter Into The State Of Self Hypnosis</p><p>Lecture5:How To Master Self Hypnosis To Reprogram Your Subconscious Mind</p><p>Lecture 6:Guided Visualization Exercise: To Heal General Illness</p><p>oLecture7:Summary</p><p>Lecture8:Bonus Exercise - Affirmations For Depression, Stress, Insomnia And Negativity</p><p>Lecture 9:Bonus Exercise : General Healing Audio File</p><p></p><ul></ul>", 
    "end_date": null, 
    "title": "Hypnosis- Heal General Illness For Mental Wellness", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573272_5c96.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-heal-general-illness-for-mental-wellness/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T09:36:17Z"
}