{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis-Develop Proper Eating Habits Now With Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn -</p><p>In today’s fast paced life many people don't care whether their diet is healthy or not. They eat the unhealthy food from some pizza house or road side stalls. <strong>Most fast food is full of saturated fat, fatty acids, sugar and salt and contributes to numerous health problems.</strong> Unhealthy eating habits bring shortage of healthy minerals and vitamins in your body and your health status decreases gradually. All the functioning of stomach disturb, if you adopt bad eating habits. It can lead to heart problems, stroke, diabetes, cancer, gallbladder disease, skin problems, pregnancy complications, fatty liver diseases, high cholesterol, multiple sclerosis, memory loss, menstrual irregularities, poor sex drive, osteoporosis, hair fall, oral problems and much more.</p><p><br> <strong>Some Of The Unhealthy Eating Habits Include:</strong></p><ul><li>Eating in a hurry:</li><li>Skipping breakfast:</li><li>Overeating:</li><li>Under eating:</li></ul><p><strong><br> Psychological Reasons Why People Over-Eat?</strong></p><p>Unhealthy eating habits develop over time. There are many causes of unhealthy eating, such as -</p><ul><li>Boredom</li><li>Stress and Anxiety</li><li>Depression</li><li>Mood Swings</li><li>Loneliness</li><li>Dysfunctional family situation, such as divorce, single parent, or foster care.</li><li>Family not eating meals together</li><li>Poor eating habits modeled by parents/caretakers</li><li>Lack of knowledge about what is healthy to eat</li><li>Busy schedule</li><li>Extreme amounts of traveling</li><li>Lack of desire to eat healthy</li><li>Poverty</li></ul><p>                                              <strong><br> <br></strong></p><p>This course is ideal for people who want to stay healthy mentally and physically because of their stressful and hectic work life . They want to attract a healthy lifestyle and a peaceful mind to stay happy always by following proper eating habits,</p><p>By the end of the course you will be able to remove all the psychological factors that are causing improper eating habits.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 8 lectures in English and a bonus e-book on positive affirmations.</p>", 
    "end_date": null, 
    "title": "Hypnosis-Develop Proper Eating Habits Now With Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632208_889c.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-develop-proper-eating-habits-now-with-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T09:31:46Z"
}