{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course titled 'Hypnosis- Manage Your Diabetes Using Self Hypnosis' By Pradeep Aggarwal , you will learn -</p><p>Diabetes is a very common and faster growing health problem these days. </p><p>Learn how self hypnosis helps you control and manage diabetes and live a healthy life.</p><p>In this lesson, learn the physical and most importantly psychological reasons that cause diabetes. Understand how self hypnosis programming can help you control your diabetes successfully.</p><p>Learn about conscious mind and subconscious mind and how we can program our subconscious mind for better health conditions and changing habits. Also get a detailed insight into self hypnosis. There are lots of myths attached to self hypnosis, let go of all the myths you may have about self hypnosis. Self hypnosis is natural, safe and effective method to treat many of the physical and health problems.<strong></strong></p><p><strong>Problems of Diabetes:<br> </strong></p><ul><li>Poor Vision</li> <li>Kidney Damage</li> <li>Damage to Nerves and Blood Vessels</li> <li>Foot Problems</li> <li>Dental Problems</li> <li>Weak Bones </li><li>You will be able to manage your diabetes and live a healthy and happy life using powerful positive affirmations and self hypnosis techniques and change the negative state of mind into positive state .</li></ul><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English including a bonus E-book</p>", 
    "end_date": null, 
    "title": "Hypnosis- Manage Your Diabetes Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600258_8191_3.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-manage-your-diabetes-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T11:14:38Z"
}