{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course titled 'Hypnosis – Boost Your Immune System Using Self Hypnosis' By Pradeep Aggarwal , you will learn -</p><p>A healthy immune system is the product of a healthy mind and a healthy body. A strong immune system means a healthy body, quick recovery from illness, and strong resistance to infections and diseases. By strengthening your mind and improving your mind body connection, you strengthen your immune system and improve your overall health.</p><p>Practicing self hypnosis, visualization and positive affirmations every day will help you to develop positive and healthy thoughts that will have a deep impact on your subconscious mind, improve the performance of your body, and boost the functioning of your immune system.</p><p>By the end of the course you will overcome all the psychological barriers to your weak immune system and have strong immunity by changing your negative state of mind and feel more confident and happy about your immune system.</p><p>It is ideal for people who have a weak immune system and are prone to lot of general health issues and weakness.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English including a bonus E-book on affirmations.</p>", 
    "end_date": null, 
    "title": "Hypnosis – Boost Your Immune System Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619150_e6ea.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-boost-your-immune-system-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T12:11:10Z"
}