{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course titled 'Hypnosis – Eliminate Stuttering Using Self Hypnosis' By Pradeep Aggarwal , you will learn -</p><ul><li>Stuttering is a problem with the normal flow and timing of speech. </li> <li>Stammering generally occurs in childhood, between three and seven years and is perfectly acceptable. </li> <li>Stammering becomes a cause of concern, when it extends beyond 10 years of age. Statistically, 1 out of every 4 children who stammer, retain it up to adulthood.</li> <li>It can affect men or women but is more common in men than women.</li> <li>Stuttering may lead to damaged self-esteem, low self-confidence and even anxiety.</li></ul><p>  Learn how self hypnosis can help you eliminate stuttering successfully and naturally</p><ul><li>Stuttering is often caused by stress and anxiety</li> <li>Stuttering could be problem of wrong programming from your childhood days</li></ul><p><strong>Problems of Stuttering:</strong></p><ul><li>Lack of confidence</li> <li>Problem at speaking in public, meetings</li> <li>Low self-esteem</li></ul><p>Learn powerful self hypnosis , positive affirmations and visualization exercises to overcome the problem of stuttering mentally and improve your morale and self esteem.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.<br></p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 8 lectures in English including a bonus e-book</p>", 
    "end_date": null, 
    "title": "Hypnosis – Eliminate Stuttering Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599246_d4b1.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-eliminate-stuttering-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T11:33:40Z"
}