{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis- Choose To Be Healthy Using Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn -</p><ul><li>One of the\nvery famous and old saying, 'health is wealth' is absolutely true. Health is\none of the greatest gifts we can give our own self. But often people ignore\ntheir health. To be healthy, we have to make certain choice in life. You have\nto make a choice to be active and healthy – both mentally and physically. When\nyou are not taking any steps for your improvement, then you care certainly\nmaking a choice to me inactive and unhealthy.\n\n\n\nWith stress\nand anxiety come many health issues. Self hypnosis teaches you how to relax and\nstay positive…stay healthy. Learn to say “STOP” to any negative thought that\ncomes to your mind. Say “NO” to other people's negativity. Eat well - think\nright and make a choice for a healthy life.</li></ul><p>This course is ideal for people who want to stay healthy mentally and physically because of their stressful and hectic work life . They want to attract a healthy lifestyle and a peaceful mind to stay happy always.</p><p>It is ideal for students and people working in corporations and business executives .</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English.</p>", 
    "end_date": null, 
    "title": "Hypnosis- Choose To Be Healthy Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582756_9cfb_2.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-choose-to-be-healthy-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T05:51:38Z"
}