{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Hypnosis to Stop Teeth Grinding Bruxism Guided Hypnosis Course has been created to offer you an experience as close as you could get to having a private Hypnosis session with me. <br></p>\n\n<p><strong><em></em></strong></p>\n\n<p>So If you find that you have the habit of grinding or clenching your teeth trough out the day or as you sleep this Hypnosis course is exactly what you need. Because this particular habit us subconsciously triggered without any conscious awareness to how or why you grind your teeth.</p>\n\n\n\n<p>Therefore Hypnosis is the only way you will get relief or eliminate this habit from your life that is sometimes linked to daily tension and in this course we are going to work on two levels.</p>\n\n\n\n<p>The first level is usually all you will need to rid yourself of this habit and that is using hypnosis to offer new programming to your subconscious mind to stop grinding your teeth because this is not good for you and because your subconscious mind only wants to do what is good for you it will reduce and eliminate this habit for you.</p>\n\n\n\n<p>The second level is in the bonus section of this course where I will teach you a technique called EFT (Emotional Freedom Technique) then we will use EFT to work on any negative emotions or feelings of tension and eliminate them. By doing this you will have no need to clench your teeth ever again.</p>\n\n\n\n<p><em><strong>What I will teach you in this course called</strong></em></p><p><em><strong>Hypnosis to Stop Teeth Grinding Bruxism Guided Hypnosis </strong></em></p><p><em></em></p>\n\n<p><em></em></p>\n\n<p><em></em></p>\n\n\n\n<p><em><strong>1.  You will begin by creating an image in your mind of what you want so that you will know where you are going and how you will feel when you are tension free and  not grinding your teeth</strong></em></p>\n\n\n\n<p><em><strong>2.  Learn a secret feel good trigger that will help you through any bad times or set backs on your way.</strong></em></p>\n\n\n\n<p><em><strong>3.  learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</strong></em></p>\n\n\n\n<p><em><strong>4.  Learn how you naturally resist changes even changes that can be very good for you</strong></em></p>\n\n\n\n<p><em><strong>5.  Learn just how powerful words can be and their effect on you physically even if they are only self talk.</strong></em></p>\n\n\n\n<p><em><strong>6.  Learn who can and cannot be hypnotized</strong></em></p>\n\n\n\n<p><em><strong>7.  Learn how you can feel amazing any time you want to</strong></em></p>\n\n\n\n<p><em><strong>8. Hyopnosis bonus section</strong></em></p>\n\n\n\n<p><em><strong>with extra hypnosis session</strong></em></p>\n\n\n\n<p><em><strong> Deep Relaxation Hypnosis</strong></em></p>\n\n\n\n<p><em><strong>How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings that have been stopping you from feeling great </strong></em></p>\n\n\n\n<p><em><strong>All Files and videos are downloadable for easier access</strong></em></p>", 
    "end_date": null, 
    "title": "Hypnosis to Stop Teeth Grinding Bruxism Guided Hypnosis", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434010_79fa_2.jpg", 
    "course_url": "https://www.udemy.com/stop-teeth-grinding-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T11:45:24Z"
}