{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course titled '<strong> Hypnosis - Heal Your Back Pain With Self Hypnosis</strong>.' By Pradeep Aggarwal , you will learn -</p><ul><li>How hypnosis can help you heal your back pain problem with the powerful techniques of self hypnosis, visualization, imagery and affirmations</li><li>Do you have a back pain problem?</li></ul><ul><li>Is your back pain severe and you have done everything to treat your back pain but it still exists?</li></ul><ul><li>Does your back pain make you depressed and lethargic?</li></ul><ul><li>Does your back pain make your everyday activities difficult?</li></ul><ul><li>Or does you back pain stop you from walking, driving, gardening, swimming or taking part in any sports activity?</li></ul><ul><li>If yes, then this is the course for you.</li></ul><p>You will be able to reduce stress, sleep problems, depression and negative thinking using powerful affirmations which is given as a bonus along with the lecture .</p><p>This course is very useful for those are mentally and physically suffering from the affects of back pain.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 9 lectures in English.</p><p>It is ideal for everyone who want to heal their back problems</p><p>This course contains-</p><p>Lecture1:Introduction</p><p>Lecture2:Remove Myths About Self Hypnosis</p><p>Lecture3:Conscious Mind Vs Subconscious Mind</p><p>Lecture4:How To Enter Into The State Of Self Hypnosis</p><p>Lecture5:How To Master Self Hypnosis To Reprogram Your Subconscious Mind</p><p>Lecture6:Guided Visualization Exercise: Heal Your Back Pain</p><p>Lecture7:Summary</p><p>Lecture8:Bonus Exercise : General Healing Audio File</p><p>Lecture9: Bonus Exercise - Affirmations For Depression, Stress, Insomnia And Negativity</p><p></p>", 
    "end_date": null, 
    "title": "Hypnosis- Heal Your Back Pain With Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/568170_c73c.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-heal-your-back-pain-with-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T10:46:52Z"
}