{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>JOIN MY <strong>13,000 SUCCESSFUL STUDENTS FROM 145 COUNTRIES</strong> WHO HAVE ALREADY TAKEN MY UDEMY COURSES AND GAVE ME <strong>OVER 200 5 STAR REVIEWS</strong>!</p><p>  \t                  Course updated on January 6th. </p>  <p>  \t<strong>JOIN OVER 2,700 SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE. </strong>  </p>  <p>  \t                                                                          About this course:  </p>  <ul>  \t<li><em>Over 2,700 very happy students</em></li>  \t<li><em>36 Reviews from VERY satisfied students</em></li>  \t<li><em>Full, free lifetime access</em></li>  \t<li><em>All future extra lectures and upgrades are always included for free</em></li>  \t<li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li>  \t<li><em>Regular free surprise bonuses to help you change your habits even more!</em></li></ul>  <p>  \t                  If your goal is to improve your general health this course is for you.  We will go over how to start <strong>exercising</strong>, start <strong>meditating</strong>, <strong>start journaling<strong>, become more calm, </strong></strong><strong></strong>become <strong>happier </strong>– all based on the Science of Positive Psychology.</p>  <p>  \t                  This program is based on my bestselling book – <strong><em>Habits and Happiness: How to Become Happier and Improve Your Wellbeing by Changing Your Habits</em></strong>,  my Habits and Happiness workshops, individual coaching sessions, and  many years of helping others change their life for the better in the  areas they believe are most necessary.  </p>  <p>  \t                  Regardless of what areas of your life need improvement –  you can only make that happen by changing your habits.  </p>  <p>  \t                  In this course, you will learn:  </p>  <ul>  \t<li>How to establish the <strong>exercise habit</strong> <strong></strong></li>  \t<li>How to <strong>start being more grateful   \t</strong></li>  \t<li>How to<strong> become more calm (on demand) </strong></li>  \t<li>How to<strong> implement a new habit</strong></li>  \t<li>Take a <strong>30 day challenge to introduce new habit <strong></strong></strong></li>  \t<li><strong>How to <strong>make a commitment to new habits and stick to it</strong></strong></li>  </ul>    <p>  \t<strong><strong>Habits and Happiness</strong>  Udemy Program combines years of research by experts in the field of  habits, neuroscience, traditional and positive psychology, and teaches  you how to apply this new information in a very simple and practical  way.   \t</strong>  </p>  <p>  \t<strong>  Implementing habitual behavior in accordance with this program<strong>  will help you become happier and more successful, will improve your  wellbeing, and will assist you in living the life you've always wanted  to live.</strong></strong>  </p>  <p>  \t<strong><strong>Click the \"take this course\" button, top right, now ... </strong><strong>Enroll NOW to become happier and more successful.</strong></strong>  </p>  <p><strong><strong>ENROLL NOW!</strong></strong></p>", 
    "end_date": null, 
    "title": "Improve Your Health Fast by Implementing These Five Habits ", 
    "price": "20.00", 
    "instructors": "Braco Pobric", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/352508_1849_4.jpg", 
    "course_url": "https://www.udemy.com/habitsandhappiness2/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T02:30:06Z"
}