{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Do you ever feel exhausted during and after work? Does your back ache after sitting down for a long period of time? Do bend over with your back to pick up things? Are you always slouched in front of your computer? Do you feel numbness/tingling/pain shooting down your low back area and legs? Do you miss work occasional due to orthopedic injuries or hospital visits? Are you tired of spending large amounts on health insurance and doctors visits? Have you seen your primary physician lately with disappointing news about your blood/heart/vital signs results? Are your joints locking up and feeling weakness in your lower body? If your answer is &#039;YES&#039; then NOW is the time to change all that and start learning the proper body mechanics and ergonomics for working around your office area. This course is learning about your posture, anatomy, kinesiology, and office exercises to keep your body is top shape and form without decreasing your health or increasing injury risks. After a long day of work at a desk or computer, you come home and feel completely exhausted and all you want to do is rest on the couch or go straight to bed. Sometimes you find it hard to eat healthy meals and workout at the gym before or after work. Everyone&#039;s number one reason or excuse is that they never have time to do all those things. The only thing I do not discuss is the nutritional aspect, so I would recommend seeing a dietitian or primary physician. However, within this course you will obtain a combination of everything into one, and feel good about yourself and improve your overall health? All you need for this educational guide and lecture is your eyes, hears, time, and participation. Throughout this powerpoint presentation, this comprehensive course will provide you all the tools, guidance, and programs to achieve success in your overall posture and health. Remember this “A Healthy Lifestyle is the Wealthiest Investment!”</p>", 
    "end_date": null, 
    "title": "Increase Overall Health + Guide Ergonomics & Light Exercises", 
    "price": "50.00", 
    "instructors": "Michael Yi", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527786_e8ce_7.jpg", 
    "course_url": "https://www.udemy.com/ergonomics-training-increase-health-guide-at-work-home/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-14T02:59:07Z"
}