{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">L&#039;initiation à la cohérence cardiaque que nous vous présentons ici permet à tous de découvrir, de comprendre et d&#039;apprendre les bases d&#039;une pratique efficace de cohérence cardiaque personnelle.</p><p style=\"\">La cohérence cardiaque est donc une pratique qui permet, par la respiration, d&#039;interagir sur les système nerveux autonome responsable de toutes les régulations automatiques et de la gestion de l&#039;adaptation aux changements. C&#039;est le système d&#039;adaptation au stress.</p><p style=\"\">Le cours débutera donc par une explication simple de ces éléments physiologiques et de leur implication dans la gestion du stress.</p><p style=\"\">Nous étudierons ensuite la place de la respiration dans la gestion du système nerveux autonome et comment influencer la santé par la respiration.</p><p style=\"\">La cohérence cardiaque permet d&#039;équilibrer le système nerveux autonome par la respiration et donc, d&#039;améliorer la gestion automatique du stress et des stresseurs.</p><p style=\"\">Ce cours est présenté par le Docteur David O&#039;Hare, médecin, spécialiste de la cohérence cardiaque reconnu internationalement, auteur de sept livres consacrés à la cohérence cardiaque.</p><p style=\"\">Le cours comporte trente vidéos pour deux heures de cours. Toutes les notions essentielles sont abordées pour que vous puissiez mettre en place immédiatement les exercices proposés et observer sur vous-même des résultats probants en moins de deux semaines.</p>", 
    "end_date": null, 
    "title": "Initiation à la cohérence cardiaque", 
    "price": "40.00", 
    "instructors": "David O'Hare", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482456_4f67_3.jpg", 
    "course_url": "https://www.udemy.com/initiation-a-la-coherence-cardiaque/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T19:29:35Z"
}