{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong style=\"\">How would you like to wake up Refreshed, Restored and Energized to start a New Day?</strong></p><p><strong style=\"\">Does this sound like a dream?</strong></p><p><strong style=\"\">It is not.</strong></p><p><strong style=\"\">I  show you how I have helped hundreds of people with my proven sleep solutions to cure insomnia.</strong></p><p><em style=\"\"><em style=\"\">I am a psychologist and physicians continually refer people to me who want to achieve restorative sleep without medication.</em><br style=\"\"></em></p><p><em style=\"\">In this course you will receive the same benefits you would receive if you consulted with me in my psychology practice. It would be like we are meeting face to face and I am helping you step by step with practical, proven sleep solutions. </em><br style=\"\"></p><p><em style=\"\"><em style=\"\">I will bring you the same tools, methods and solutions I teach my insomnia clients.<em style=\"\"></em></em></em></p><p>The course not only takes you through an explanation of <strong style=\"\">how </strong>and <strong style=\"\">why</strong> these tools and methods work.  But <strong style=\"\">goes well beyond just understanding </strong>by showing you how to:</p><ul style=\"\"><li style=\"\">Determine your own specific sleep patterns</li><li style=\"\">Design the program that will work for your particular sleep pattern.</li><li style=\"\">Follow a day by day program so that you can stay on track</li><li style=\"\">Use handouts and downloadable tools that help you know what to do</li></ul><p><br style=\"\"></p><p>This course is formatted in a <span></span><strong style=\"\">3 week &quot;</strong><em style=\"\"><strong style=\"\">Bootcamp</strong></em>&quot; model. In this highly effective model  I provide you with: <strong style=\"\"><em style=\"\">Day by Day implementation</em></strong> of tools and resources proven to help people reach the goal of restful, restorative sleep.<br style=\"\"></p><p><strong style=\"\">When you begin to have restful, restorative  sleep your life will change</strong>.</p><ul style=\"\"><li style=\"\">You will finally experience life without fatigue</li><li style=\"\">You will be equipped to handle day to day stress with ease</li><li style=\"\">Your relationships will improve, because you won&#039;t be “grumpy.&quot;</li><li style=\"\">Your overall quality of life will improve.</li></ul><p>Are you ready to take this positive step in your life?</p><p>Sign up today.</p><p>Your enrollment today is backed by Udemy&#039;s 30-Day, No-Questions Asked, Money Back, Guarantee. So you really have nothing to lose by enrolling and you have a whole new world of refreshed, energizing sleep to gain.</p>", 
    "end_date": null, 
    "title": "Insomnia Cure: Wake Up Refreshed and Energized ", 
    "price": "30.00", 
    "instructors": "Ines Roe", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/379078_4d6a.jpg", 
    "course_url": "https://www.udemy.com/insomnia-cure/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-28T11:34:18Z"
}