{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\r\n\tCurso impartido por Rosa Briones.\r\n</p>\r\n<p>\r\n\t  El curso de Introducción al Método TRCD te ofrece una novedosa y original visión de cómo lograr que tu cuerpo y tu mente estén alineados, en armonía y en consonancia, para que tengas tu capacidad física, energética y emocional, disponible al 100 % para abordar tus tareas de vida diariamente. Sentirás que la alegría de vivir y un estado de ánimo alto se instauran en tu cuerpo y así tu mente se agiliza y es creativa para resolver los temas de tu vida emocional.\r\n</p>\r\n<p>\r\n\t  En este curso aprenderás:\r\n</p>\r\n<p>\r\n\t          BASES TEÓRICAS\r\n</p>\r\n<ol>\r\n\t<li>Las bases teóricas del Método TRCD: La ANATOMÍA ENERGÉTICA que describe nuestra estructura energética, la cual se corresponde plenamente con la estructura del cuerpo físico.</li>\r\n\t<li>La FUNCIÓN EMOCIONAL de cada zona corporal: la expresión, la acción y la concreción, la creación de metas de vida y de futuro…</li>\r\n\t<li>La VIBRACIÓN DE COLOR de cada zona corporal y la significación emocional de cada color.</li>\r\n\t<li>El ADN EMOCIONAL: Dónde se encuentra situado en el cuerpo físico y qué información nos da para entender nuestra vida evolutivamente.</li>\r\n</ol>\r\n<p>\r\n\t  METODOLOGÍA\r\n</p>\r\n<p>\r\n\t    APRENDERÁS cómo aplicar el conjunto de herramientas que nos permiten estructurar el cuerpo en su plena capacidad para abordar la vida cada día:\r\n</p>\r\n<ol>\r\n\t<li>Ejercicios físicos con conciencia para hacer tu propio proceso activo de liberación de bloqueos emocionales que deforman tu cuerpo físico.</li>\r\n\t<li>Automasajes para reconducir la energía bloqueada.    </li>\r\n\t<li>Visualizaciones que amplían tu capacidad mental.</li>\r\n\t<li>Pautas de Estilismo Emocional para elevar tu magnetismo y así imantar del exterior lo que deseas conseguir.</li>\r\n\t<li>Pautas de alimentación emocional por el color y la energía de los alimentos.</li>\r\n\t<li>Pintura corporal con formas geométricas y color para crear estructura energética.</li>\r\n</ol>\r\n<p>\r\n\t  VIVENCIARÁS el MÉTODO TRCD porque en cada curso se ilustra la teoría con ejercicios prácticos que te permitirán practicarlos en tu propio cuerpo para vivir sus resultados y, si eres profesional, aplicarlos a tus clientes.\r\n</p>", 
    "end_date": null, 
    "title": "Introducción al Método TRCD", 
    "price": "20.00", 
    "instructors": "María Gemma Sáenz", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/192722_7df8_3.jpg", 
    "course_url": "https://www.udemy.com/introduccion-al-metodo-trcd/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-02T11:14:02Z"
}