{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<p>  \t\t<span style=\" color:rgb(53, 53, 53);\">This course will provide a definition and examples of energy; how we experience multiple exchanges of energy everyday in every part of your life. It&#039;s important that we all have an understanding of how we affect it and it affects us. We will also discuss the impact that we can have on other people and how our energy is reflected upon others. Of course we can’t help but discuss energy without discussing Energy Vampires. What are they? Well join me and find out. </span>  \t</p>  \t<p>  \t\t<p>  \t\t\t<p>  \t\t\t\t<p>  \t\t\t\t\t<span style=\" color:rgb(53, 53, 53);\">Following the energy discussion we will transition into energy healing. What is it? How does it help? What types of tools do energy healers use? </span>  \t\t\t\t</p>  \t\t\t\t<p>  \t\t\t\t\t<p>  \t\t\t\t\t\t<p>  \t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t<span style=\" color:rgb(53, 53, 53);\">In addition, this class will specifically discuss identify and define Aura&#039;s, the importance of Balance and Chakras or the ABC’s of Energy. These may be words you have heard ether inside or outside your circles but don’t really have a solid understanding of what they are and how they interact within the body. I will explain each of the ABC’s and provide an example of how they interact that you can relate to in your everyday life. During the “Balance” lecture I walk you through a grounding exercise that you can use again when you feel “out of sorts”.</span>  \t\t\t\t\t\t\t</p>  \t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t\t\t<span style=\" color:rgb(53, 53, 53);\">In addition, it will provide an introduction to some of the many healing modalities used and resources to begin your investigative journey. I have covered 6 of the major modalities that are available across most parts of the country. This will give you a jump start into investigating your own potential healing career or simply peak your interests. Toward the end of the course, I have provided some websites as reference regarding these covered modalities for you to do further research if you desire.</span>  \t\t\t\t\t\t\t\t\t\t</p>  \t\t\t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t<span style=\" color:rgb(53, 53, 53);\">There are several lectures separated into various topics so you can proceed at your own pace. The entire course should be approximately 35 minutes. At the end of the class, be sure to take the quiz to test your knowledge of the topics discussed. </span>  \t\t\t\t\t\t\t\t\t\t\t\t\t</p>", 
    "end_date": null, 
    "title": "Introduction to Healing/ABC's of Energy", 
    "price": "20.00", 
    "instructors": "Shelly Jo Pinter", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256146_470b_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-healingabcs-of-energy/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-05T17:06:02Z"
}