{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t If you want a fun way to mobilize your body and ease pain then this course is for you.  </p>  <p style=\"\">  \t Since we have all had pain at one time or another then getting to understand mobilizations to get you out of pain is critical.  </p>  <p style=\"\">  \t In order to get yourself out of pain you need to know mobilizations for all of the major joints in your body.  </p>  <p style=\"\">  \t Therefore in this program I will walk you through 3 phases of mobilizations from basic, intermediate, to advanced for the major joints in your body.  </p>  <p style=\"\">  \t If you are going to be successful with a course and make a lasting change then you have to learn how to deliver this system.  </p>  <p style=\"\">  \t In order to understand how to do these exercises and when, I included a video series based on “How to” prepare to do these exercises.  </p>  <p style=\"\">  \t Also, since I care so much about you completing the whole program then I added a FREE series on Self Coaching.  </p>  <p style=\"\">  \t If you are not good at sticking to a program or doing exercises from home then you will love Self Coaching.  </p>  <p style=\"\">  \t This is my personal system that I use in order to complete exercises.  </p>  <p style=\"\">  \t In order to complete a program SUCCESSFULLY I think you need more guidance then these videos alone.  </p>  <p style=\"\">  \t I am giving away 3 FREE WEBINARS where I will share ADVANCED-ADVANCED Mobilizations &amp; GIVING AWAY 3 Ipad Minis.  </p>  <p style=\"\">  \t Therefore inside of those 3 FREE WEBINARS I could not help myself, I care so much about you completing this program and being SUCCESSFUL.  </p>  <p style=\"\">  \t During the FREE WEBINARS I will share details if you want to WIN $10,000 worth of COACHING for FREE.  </p>  <p style=\"\">  \t If you go to the FREE WEBINARS and try to WIN an IPAD MINI then you will also get details on how to WIN $10,000 worth of COACHING for FREE.  </p>  <p style=\"\">  \t In this course you will get:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t 1.An EBook transcription of the whole program  \t</p>  \t<p style=\"\">  \t\t 2.6 Videos of Mobilizations  \t</p>  \t<p style=\"\">  \t\t 3.3 Phase Videos of 3 Months of Mobilizations  \t</p>  \t<p style=\"\">  \t\t 4.3 Phase Videos of 3 Months of Self Coaching  \t</p>  \t<p style=\"\">  \t\t 5.1 Self Coaching Workbook (My personal handbook)  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Joint by Joint Mobilizations", 
    "price": "45.00", 
    "instructors": "Dominic Sessa", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/241514_2078_2.jpg", 
    "course_url": "https://www.udemy.com/joint-by-joint-mobilizations/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-11T16:11:42Z"
}