{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\">Do you wish you could sleep less and yet still feel refreshed and full of energy the next day?</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Are you curious to know how making simple changes to your life could lead to more restful sleep?</em></strong>  </p>  <p>  \t        Sleep related disorders can strike at any point in your life. The number of people experiencing poor quality sleep is rising and is proportional to the changes we&#039;re experiencing in modern day society. As you read this, poor sleep may be affecting your college life, your working life, your personal relationships or just your social life in general. What amazes me is how many chose to live with these problems.  </p>  <p>  \t        It doesn&#039;t have to be that way. Through making simple changes, you could sleep less, have more time to enjoy life and feel refreshed every morning.  </p>  <p>  \t<strong style=\"\">How would it feel to know that sleeping less gives you more?</strong>  </p>  <p>  \t        Learn the basic components of good quality sleep. Sleep Easy gives you the answers you have been looking for. I explain how you sleep, why you need to sleep and I delve into the many potential causes of poor sleep. We don’t stop there, because we then cover all the simple changes that you can make that will give you deeper more nourishing sleep.  </p>  <p>  \t<strong style=\"\">Learn How to Sleep Easily and Effortlessly Through Developing a Deeper Understanding Of The Nature Of Sleep</strong>  </p>  <li>Enjoy a more balanced life</li>  <li>Achieve a better balance between diet, lifestyle and exercise that encourages deeper quality sleep.</li>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">Take Control Of Your Sleep And Enjoy More Free Time And A More Enriched life</strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\"><br style=\"\">  \t</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">What would you do if you experienced deeper more refreshing sleep?</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Would you go out more?</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Would you become more productive a work?</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Would you find your college work easier to do without fatigue or a foggy head?</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Would you embrace your fitness more?</em></strong>  </p>  <p>  \t        All of those things are possible and more…  </p>  <p>  \t        On this course you’ll learn:  </p>  <li>How to create a better sleep environment to ensure quality sleep</li>  <li>The importance of practising good sleep hygiene</li>  <li>How making these simple changes results in you falling asleep quicker</li>  <li>Understanding the factors affecting sleep</li>  <li>The importance of routine in creating good quality sleep</li>  <br style=\"\">  <p>  \t          The course lectures are broken down into easy to understand manageable chunks so you’re not overwhelmed with too much information too quickly.  </p>  <p>  \t        I want you to explore the opportunity to learn just how easy it is to experience refreshing sleep without compromising quality.  </p>  <p>  \t        I’ve got so much more that I want to share with you that can take your understanding of sleep to an even deeper level, however, we need to get the basics right first, and this course is designed to do that.  </p>", 
    "end_date": null, 
    "title": "Learn to Sleep Easy and Free Your Mind to Enjoy Life More", 
    "price": "35.00", 
    "instructors": "Umesh Damania", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387698_0644_4.jpg", 
    "course_url": "https://www.udemy.com/learn-to-sleep-easy-and-free-your-mind-to-enjoy-life-more/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T14:37:24Z"
}