{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>**UPDATED MAY<strong> 2016</strong>** Called <em>\"the most informative and practical course on SLEEP on Udemy\"</em></strong></p>\n\n<p>  \t <strong>Do you wish you had BOUNDLESS ENERGY? </strong>  </p>\n\n\n\n<p>  \t Do you wish you had <strong>more time to be productive and do the things you love</strong>?  </p>\n\n\n\n<p>  \t Are you curious about those people who seem to operate on far less sleep, but are still somehow able to be incredibly productive?????  </p>\n\n\n\n<p>  \t Ummmm yeah..  </p>\n\n\n\n<p>  \t Then join more than <strong><em>8000+ people</em></strong> who've taken this course and gotten hours more waking time each week, while having more energy each day.  </p>\n\n\n\n<p>  \t <strong>The Magical Tale of This Class </strong>(and my sleep hacking adventure)  </p>\n\n\n\n<p>  \t I used to spend an average of 7.5-8 hours a night sleeping....  </p>\n\n\n\n<p>  \t Even though by medical standards this was classified as a sufficient amount, <em>I still found myself tired at times</em> (ARGHH). I was frustrated which is why I started to study and experiment with sleep.  </p>\n\n\n\n<p>  \t Through countless self-experimentations and optimizations over the past year, I've <strong>cut down my sleep time down to about 6 hours of sleep and have never had more energy</strong>. If you compound this difference over the course of a year, that's more than 4 weeks of additional waking time <strong>THAT I GET TO SPEND DOING THINGS I LOVE.</strong>  </p>\n\n\n\n<p>  \t  Does 4 additional weeks this year sound interesting to you? <em><strong>How would you spend them?</strong></em>  </p>\n\n\n\n<p>  \t I wanted to save everyone interested in having more time and energy the countless hours and mistakes I made so I decided to create a brief presentation on it to share with friends. Turns out some really interesting people thought it was pretty good:  </p>\n\n\n\n<p>  \t <strong>\"Good overview for my friends who have sleep difficulty\" </strong>-Reid Hoffman, Founder of LinkedIn  </p>\n\n\n\n<p>  \t <em><strong>\"Some novel ideas here, on getting a better night's sleep\" </strong></em><strong>-</strong>Jeff Weiner, CEO of LinkedIn  </p>\n\n\n\n<p>  \t Don't believe me? See  proof here!  </p>\n\n\n\n<p>  \t The funny thing was I had only scratched the surface of what I'd learned in that presentation. So I decided to do a small private class to test out amongst some people who'd indicated interest. This is what they said:  </p>\n\n\n\n<p>  \t <strong>\"Over the course of the seven days, my sleep improved from four to five hours of actual sleep time during my eight and half hours in bed, to just over seven hours asleep! Scott, thank you, thank you, thank you for presenting this information in a succinct, informative matter\"</strong> - Dana M  </p>\n\n\n\n<p>  \t <strong>\"Scott provides a clear and applicable path towards a better sleep cycle. My habits have drastically changed\" </strong>-Sean C<strong>  \t</strong>  </p>\n\n\n\n<p>  \t <strong>  \t</strong>  </p>\n\n\n\n<p>  \t <strong>\"Good class to take if you are having trouble regulating your sleep. I feel more energy and less anxious since I am better rested and prepared for a long day. I didn't realize sleep could have such an affect. Scott s lessons are quick and easy to follow. All information is practical. Your body will thank you for it.\" </strong>-Aishwarya N  </p>\n\n\n\n<p>  \t I took the information and feedback from this class and expanded upon it to deliver <strong>the ultimate premium class here....</strong>  </p>\n\n\n\n<p>  \t In this course you'll learn:  </p>\n\n\n\n<ul>  \t<li>How to achieve a quality sleep so you can actually feel rested</li>  \t<li>A bunch of simple (<strong>and weird!</strong>) stuff you can do with light to have higher energy  and better sleep</li>  \t<li>How alter your activeness, consumption, environment to achieve quality sleep</li>  \t<li>The best ways to fall asleep, nap, and prevent yourself from waking up 6x a night (THE WORST)</li>  \t<li>A blueprint to take action on everything I'll teach you so that you'll be sleep-hacking in no time!</li>  </ul>\n\n\n\n<p>  \t The class is delivered in easy to follow video modules, and also includes PDF versions so you can go at your own speed if you prefer.  </p>\n\n\n\n<p>  \t No matter who you are, I guarantee you'll learn at least one thing from this class (see the testimonials above for proof). Note* if you're a chronic insomniac you should seek some professional guidance instead of going to Udemy. Also, if you've been studying polyphasic sleep for centuries, you'll probably know a lot of this - managing expectations here peeps!  </p>\n\n\n\n<p>  \t <strong>I will personally respond to any questions you may have</strong> as you go through the material so there's no worry if you're not sure how to take all of the information and apply it to your life. So sign up now!  </p>\n\n\n\n<p>  \t Talk soon,  </p>\n\n\n\n<p>  \t Scott Britton  </p>\n\n\n\n<p>  \t <strong>P.S.</strong> The $49 price is an initial offering to build the students and positive reviews.  </p>\n\n\n\n<p>  \t <em>I believe getting days of your life back is worth far more than 3 DVDs </em>so I plan on raising the price in the near future. If you want to take advantage of the initial price, I'd sign up sooner than later (Like now!)  </p>", 
    "end_date": null, 
    "title": "Learn Optimal Sleep to Improve Your Health, Energy, and Mind", 
    "price": "50.00", 
    "instructors": "Scott Britton", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46182_b6bc_7.jpg", 
    "course_url": "https://www.udemy.com/sleep-hacking-101-have-more-energy-spend-less-time-in-bed/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-17T15:41:22Z"
}