{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Have you always wanted to start a career in healthcare?</strong></p><ul><li>Did you know that healthcare is one of the largest businesses in the United States, accounting for 17.1% of the GDP, or <em>2.87 trillion dollars</em>?</li><li>In nursing alone, it is estimated that there will be a need for 1.05 million nurses by 2022?</li><li>The average yearly salary for a nurse is $68,900 per year?!</li></ul><div><br></div><p><strong>Do you want to create</strong> <strong>apps and Electronic Healthcare Records (EHR) programs?</strong></p><ul><li>Healthcare spent $3.8 billion in 2015 for EHR alone!</li><li>There is now a renaissance in creating medical programs - it is estimated that healthcare is at least 10 years behind in all other industries in using electronic data</li></ul><div><br></div><p><strong>Learning how to understand and speak </strong><strong>medical terminology is a fundamental <em>first step</em> for entering the world of healthcare.</strong></p><p><strong><br></strong></p><p><strong>What you will learn in this course</strong></p><ul><li>Fundamentals of how to use medical prefixes, suffixes and root words</li><li>Anatomical directions</li><li>Common medical abbreviations</li><li>How to read and write a prescription</li><li>A brief overview of human anatomy, diseases and treatments</li></ul><div><br></div><p><strong>How is this course different?</strong></p><ul><li><span></span>You will learn by immersion - not by memorizing rules!   By listening to over 4 hours of basic anatomy, diseases and treatment you will learn how medical terminology, the language of healthcare, is used in conversation and how it is pronounced by an experienced speaker.</li></ul><p><br></p><p><strong>Who is the target audience?</strong></p><ul><li>This is a beginner level course, only needing a desire to learn</li><li>For healthcare students needing supplemental material to help them in class</li><li>For aspiring healthcare programmers, wanting to understand the vocabulary of healthcare</li><li>For medical transcriptionists who want to hear how a native English speaker pronounces commonly used words in medical terminology.</li></ul><div><br></div><p><strong>Who is the instructor?</strong><br></p><ul><li>John has over 20 years experience working in healthcare, both as a nurse and as a nurse practitioner</li><li>He has experience in many different specialties, including cardiology, pulmonology, critical care medicine, hospitalist and office medicine</li><li>He is a native US English speaker with a clear Midwestern accent</li></ul>", 
    "end_date": null, 
    "title": "Learn To Speak \"Medicine\" And Start Your Healthcare Career", 
    "price": "20.00", 
    "instructors": "John Pamperin", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498998_477b.jpg", 
    "course_url": "https://www.udemy.com/learning-medical-terminology/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T14:32:39Z"
}