{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><p style=\"\">Massage Training: Learn Massage for Lovers,  Friends and Family is a video training course which gets you on the fast track  to improving your relationships through easy and enjoyable massage skills. Not only will you create better  relationships, but also generate well-being, good will and gratitude among  friends and family. The author has 14 years of experience in teaching massage  therapy. </p>    <p style=\"\">This massage training course is not intended  for professional massage therapists, but for anyone who wants to learn  effective ways to create intimacy, trust, joy, and meaning in their relationship  through the magic of skilled touch.</p>    <p style=\"\">This massage training course consists of 12  modules with more than two hours of video training. By the end of the training you will  be able to work on the feet, legs, hips, back, abdomen, head and face.</p>    <p style=\"\">The setting  is presented in a way that does not require a massage table. The techniques can  be done with your partner sitting in a chair or lying on a floor mat or on the  bed, and they can be done with your partner undressed or fully dressed. You  don&#039;t need to use oil either.</p>    <p style=\"\">The author of this massage training course  has created the best relationship of his life by applying the principles in  this course. Both he and  his wife work with each other regularly and have brought a new level of  understanding, gratitude, goodwill and harmony into their lives.</p>    <p style=\"\">Take this Massage Training course and learn  massage for lovers, friends and family.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Learn Massage For Lovers, Friends And Family", 
    "price": "30.00", 
    "instructors": "Shama Kern", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/26044_7465_7.jpg", 
    "course_url": "https://www.udemy.com/learn-massage-for-lovers-friends-and-family/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-05T04:35:27Z"
}