{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course has been designed for people who work or study on computers and\nspend long periods of time in front of a computer screen. You may experience\nsymptoms while sitting at a computer such as;\n</p><ul><li>stress</li><li>head tension</li><li>postural discomfort</li><li>mental tiredness</li><li>eyestrain</li><li>eye fatigue</li><li>body stiffness</li><li>body pain, for example, stiff neck, sore shoulders, RSI and back pain.<br></li></ul><p>This course introduces you to the concepts of the traditional Chinese exercise system called Qigong that millions of people practice in China and all around the world everyday. Similar to Tai Chi which is a martial art, Qigong is the medical exercises to maintain superior health in the body.</p><p>Qigong has been practiced for thousands of years in China and is renowned for\nmaintaining health and longevity. It has been a hidden secret and now the\nWestern World is acknowledging its profound effects upon the human body and\nhealth. Included in this course is an abstract of a research document that was\nconducted researching the effects of Qigong exercises on people who suffer from\nstress working with computers.\n</p><p>In this course you will be introduced to a collection of Qigong exercises, 3 Qigong\nexercises for eye strain, 4 Qigong exercises for head tension and 6 Qigong\nexercise for mental stress and strain. They are easy and simple to perform and\nrequires no prior knowledge of Qigong and, it is suitable for everyone to practice.\nYou don't even have to get up from you desk. All of these Qigong exercises can be\nperformed while sitting at you desk.\n</p><p>Included in the course are instructional videos of each of the Qigong exercises. I\ninclude the medical applications and benefits of each exercise in the videos and\nthere are pdf handouts of the exercises that you can download.\n</p><p>To learn these Qigong exercises all you will need to do is spend a few minutes\nevery couples of hours to practice one or two of them through out you're\nworking day as needed.\n</p><p>The course is structured with an instructional video for each exercise. There are\nsafety and training guidelines included to help you get the most out of the course\nand that explains the best and most efficient ways to practice.\n</p><p>This course will help you to:\n</p><ul><li>feel energized\nfeel positive\nmanage stress\nhave clear focus</li><li>have a clear mind</li><li>be able to solve problems clearly</li><li>relieve head tension</li><li>relieve eye strain and fatigue</li><li>increase productivity</li><li>increase you ability to spend longer hours working\nhelp you to relax</li><li>be calm</li><li>feel relaxed and free of tension in your body\nunderstand more about your physical body and posture.<br></li></ul><p>Thank you for joining me on my course, please send me feedback, ask me any\nquestions and please write a review.\n</p><p>Cheers, </p><p>Peter C</p>", 
    "end_date": null, 
    "title": "Learn Qigong exercises that help with stress from computers", 
    "price": "20.00", 
    "instructors": "Peter Caughey", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635814_9961_5.jpg", 
    "course_url": "https://www.udemy.com/learn-qigong-exercises-that-help-with-stress-from-computers/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T12:55:07Z"
}