{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course covers an introduction to the concepts of the Traditional Chinese exercise system called Qigong that millions of people practice in China and all around the world everyday. Similar to Tai Chi which is a martial art, Qigong is the medical exercises to maintain superior health in the body.</p><p>Qigong has been practiced for thousands of years in China and is renowned for maintaining health and longevity. It has been a hidden secret and now the Western World is acknowledging its profound effects upon the human body and health.</p><p>In this course we will cover a series of Advanced Qigong exercises specifically designed to relieve head tension, muddled thinking, lack of concentration, mental fatigue, overthinking, mental stress and strain, mental exhaustion and feelings of being burnt out. The Qigong exercises are easy and simple to perform and requires no prior knowledge of Qigong and they are suitable for everyone to practice.</p><p>Included in the course are instructional videos of each of the 10 exercises and an additional video explaining the medical applications and benefits for each exercise. There is also a pdf handouts for each exercises and their medical applications that you can download.</p><p>To learn this Qigong sequence it will take you half an hour each day focusing on one exercise at a time or you may find that you only need to do one exercise for 5 minutes and that's enough to clear your mind and calm your heart. </p><p>The course is structured with an instructional video for each exercise. There are safety and training guidelines included to help you get the most out of the course, that explains the best and most efficient ways to practice.</p><p>This course will help you to:</p><ul><li>quiet your busy mind</li><li>have a deeper understanding of Traditional Chinese Medicine (TCM) Theory and the         medical applications for each exercise</li><li>feel positive</li><li>manage stress</li><li>have a peaceful mind</li><li>maintain a high level of health</li><li>help you to relax</li><li>feel your own energy in your hands</li><li>aid in maintaining Qi and Blood circulation in the brain and head area</li><li>be calm</li><li>switch your mind off to have a good nights sleep</li><li>feel relaxed and free of tension in your body</li><li>use Acupressure points to calm your busy mind and for stress relief</li><li>understand more about your physical body</li><li>have a Meditation to help to calm the mind</li><li>select useful Chinese Herbal Formulas to help quiet your busy mind<span><br></span></li><li>Experience what it is like to have a quiet mind</li><li>feel connected with yourself and things around you</li><li>have a better quality of life</li></ul><p><br></p><p>Thank you for joining me on my course, please send me feedback, ask me any questions and please write a review.</p><p>Cheers,</p><p>Pete C</p>", 
    "end_date": null, 
    "title": "Learn Advanced Qigong that can help to quiet your busy mind", 
    "price": "30.00", 
    "instructors": "Peter Caughey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/714042_7236.jpg", 
    "course_url": "https://www.udemy.com/learn-advanced-qigong-that-can-help-to-quiet-your-busy-mind/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-03T03:10:37Z"
}