{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">This course covers an introduction to the concepts of the traditional Chinese exercise system called Qigong that millions of people practice in China and all around the world everyday. Similar to Tai Chi which is a martial art, Qigong is the medical exercises to maintain superior health in the body.</p><p style=\"\">Qigong has been practiced for thousands of years in China and is renowned for maintaining health and longevity. It has been a hidden secret and now the Western World is acknowledging its profound effects upon the human body and health.</p><p style=\"\">In this course you will be introduced to a modified version of the famous classical Ba Duan Jin Qigong system (also know as the Eight Brocades) and their medical applications. It is easy and simple to perform and require no prior knowledge of Qigong and it is suitable for everyone to practice.</p><p style=\"\">Included in the course are insturctional videos of each of the eight exercises in the Ba Duan Jin Qigong system, videos on the medical applications and benefits of each exercise, pdf handouts of the exercises that you can download and a full practice sequence at the end of the course so that you can follow along with for your daily practice.</p><p style=\"\">To learn this system it will take you half an hour each day focusing on one exercise at a time and then slowly buiding up to a complete daily practice of all eight exercises which takes about 35 minutes.</p><p style=\"\">The course is structured with instructional video for each exercise. There are safety and training guidelines included to help you get the most out of the course that explains the best and most efficient ways to practice.</p><p style=\"\">This course will help you to create:</p><ul style=\"\"><li style=\"\">a peaceful mind</li><li style=\"\">help you to relax</li><li style=\"\">manage stress</li><li style=\"\">maintain a high level of health</li><li style=\"\">increase your longevity</li><li style=\"\">be calm </li><li style=\"\">sleep well</li><li style=\"\">feel relaxed and free of tension in your body</li><li style=\"\">make your life easier</li><li style=\"\">understand more about your physical body</li><li style=\"\">feel connected with yourself and things around you</li><li style=\"\">and have a better quality of life</li></ul><p style=\"\">Thank you for joining me on my course, please send me feedback, ask me any questions and please write a review.</p><p style=\"\">Cheers,</p><p style=\"\">Pete C </p>", 
    "end_date": null, 
    "title": "Learn Secret Chinese Exercises: Live stress free & happy", 
    "price": "20.00", 
    "instructors": "Peter Caughey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428276_3f6a_3.jpg", 
    "course_url": "https://www.udemy.com/learn-secret-chinese-health-exercises-live-free-from-stress/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T06:22:29Z"
}