{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\t Diet is a four-letter word that is often associated with misery, starvation and stress. <strong>Don't diet.</strong> Learn how to lose 10 pounds easily and effectively without the work and worry of a strict diet. Everyone knows that drinking water instead of soda or taking the stairs instead of the elevator can help you lose weight, but there are other simple calorie-saving secrets that aren't so well known. In this course, we will discover creative ways to lose weight, easily and effectively.</p>  <p>\t<em><strong>Are you excited for a major change in your life? Want to learn seemingly effortless yet creative ways to lose weight?</strong></em>  </p>  <p>\t It takes 21-30 days to rewire your brain to learn a new habit. This system is designed to help you create positive health habits that will help you easily lose weight and dramatically improve the quality of your life on all levels.</p><p><strong>Who Should Enrol in this Course?</strong></p>  <p>\t This course is designed for ALL LEVELS, with videos and practices for beginners, intermediate and advanced as well. This powerful course is comprised of audio classes, videos, activities, and slides -- and is jam-packed with proven effective techniques that are not available from any other source.</p><p><strong>Learn Creative and Easy Ways to Lose Weight</strong></p>  <p>\t Everyone learns in different ways, and this course covers all bases. When you join this course, you will receive bonus material from time to time. As per Udemy, you will have access to the membership area for a <em>lifetime</em> AND you have a <em>money back guarantee</em> if this course doesn't work for you.</p>  <p>\t For years, I have been asked by so many people, “How can I lose weight quickly?” For as long as I can remember, my answer was consistent. “Never try fad diets or the next big celebrity thing. Change a few habits and invent new ways to deal with the stuff you don't like.” Programs that have promised fast weight loss have for the most part been extreme and unhealthy. They propose either a severe restriction in calories; unregulated, non-FDA-approved supplements to help boost the metabolism; or eating plans that call for eliminating entire food categories. These programs have been successful for many, but the harm they can potentially do to the body can outweigh the potential benefits that one achieves with the weight loss. What good is losing 15 pounds quickly if it means you are damaging your kidneys? What good is losing 10 pounds if it means you are going to gain it all back and then some in three weeks once you stop whatever plan it is that you’re following?</p>  <p><strong>Lose that annoying body fat today! Enrol in this fun, interesting course!</strong></p>", 
    "end_date": null, 
    "title": "Learn Creative and Easy Ways to Lose Weight", 
    "price": "50.00", 
    "instructors": "Kayce Mick", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/152828_651c_7.jpg", 
    "course_url": "https://www.udemy.com/creative-ways-to-lose-10-pounds-quickly-and-easily/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-25T22:53:03Z"
}