{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Go from Flat-Lined Libido to Heart-Pounding Intimacy with Your Partner!  </strong>Put an End to Your Struggle with Low Sexual Desire and Unlock the Secret to Feeling Passion Again</p><p><strong>Can you relate?</strong></p><p>You are <strong>constantly dodging your partner’s advances</strong> because you don’t feel like having sex. You love him. You enjoy being with him. But you just <strong>don’t want to have sex with</strong><strong> him</strong> (<em>or anyone else for that matter)</em>.</p><p>You are tired of <strong>struggling with low sexual desire</strong> and rejecting the guy you love over and over and over by…</p><ul><li>Going to bed earlier or later than him to avoid amorous advances</li><li>Leaping out of bed as soon as you’re awake so he won’t roll over and start touching you</li><li>Undressing in your closet so he won’t see you naked and make a pass at you</li><li>Claiming exhaustion, headaches, yeast infections, or that time of the month to get out of it</li></ul><p>And when you do have sex is more likely <strong>due to GUILT</strong> rather than <strong>because of DESIRE</strong>.</p><strong>What if it didn’t have to be that way? Imagine…</strong><p>  <strong>   Never </strong>fighting about sex again</p><p>     Looking forward to <strong>romantic times</strong> with your guy</p><p>     Knowing exactly what turns you on and<strong> how to get in the mood</strong></p><p>     Saying <strong>‘yes’ instead of ‘no’ </strong>and <em>sometimes even making the first move</em></p><p><em>   </em>  AND being <strong>more confident</strong> about what gives you pleasure</p><p><strong></strong></p><strong>Libido 911 is the just the course to help you resuscitate your sexual desire!  It contains:</strong><ul><li>Brief, to-the-point training designed to<strong> help you take immediate action</strong>. Just enough theory is included so you understand the rationale behind the recommendations</li><li><strong>Effective exercises</strong>, many of which include your partner so he can be a part of the solution.</li><li>Brain-hacks and bio-hacks to<strong> leverage science and physiol</strong><strong>ogy</strong> in favor of your libido</li><li>Clues to medical causes of low desire and <strong>great advice for getting the best medical care</strong> and attention when needed</li></ul><p><strong></strong></p><strong>This course is for you if</strong><ul><li>You are in a<strong> generally good relationship </strong> in which the main point of conflict is your sexual desire</li><li>You love your guy and <strong>used to have an appetite for sex</strong> but now you just don’t</li><li>You are so used to saying ‘no’ to his romantic invitations it <strong>almost feels like a reflex</strong></li><li><strong>YOU want to feel desire </strong>as much as he does</li></ul><p><strong><br></strong></p><strong>FAQs</strong><p><strong>Will this course really help me?</strong></p><p>I understand where you are coming from. You have felt this way for so long you think nothing will work. But I promise you that if you take the time to work through the course thoughtfully, you can make a change. And if you are not satisfied, I offer a 30-day money back guarantee - no questions asked. There is nothing to lose.</p><p><strong>How does the course work?</strong></p><p>It is a self-paced series of video trainings (16 core lessons and some extras) that you can do on your own from any desktop or mobile device.  Each lesson is accompanied by a customized worksheet for you to download.  Those worksheets contain self-assessments, notes, and homework to help you apply the content from the lessons.  The course syllabus is below.</p><p><strong>I am a busy woman, how long will this take?</strong></p><p>The lessons themselves are very short and to the point. It won't take you more than an hour a week to view the lessons.  In order to get the full benefit, you do need to put in some time ‘doing homework. You can move at your own pace, though. In fact, I recommend you take your time and spend 4-6 weeks working through the course.</p><p><strong>I am not terribly sexually adventurous, does this course contain material that will be out of my comfort zone?</strong></p><p>Probably not.  The approach is professional and easy going.</p><p><strong>I am thinking about getting this course for my wife. Is that a good idea?</strong></p><p>Absolutely! I’d suggest that you tell her you plan on doing the course yourself so you can better understand what she is feeling and invite her to do it with you. There is plenty here for BOTH of you to learn.</p><p><br></p>", 
    "end_date": null, 
    "title": "Libido 911:  Resuscitate Your Sex Drive", 
    "price": "20.00", 
    "instructors": "Laura McKain, MD", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746880_bff6_2.jpg", 
    "course_url": "https://www.udemy.com/libido911/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T13:45:01Z"
}