{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong>LEARN A NEW WAY TO AWAKE YOUR PERSONAL LONGEVITY POTENTIAL BY COMBINING HOLISTIC/ALTERNATIVE AND SCIENCE/MEDICINE BASED HEALTH STRATEGIES</strong>  </p>  <p>  \t     Improve your long term health, happiness, and longevity with the 10 Principles of Personal Longevity Training Program  </p>  <p>  \t  [And signup to sell our training at personal-longevity dot com]  </p>  <p>  \t  This Course is the result of five years of research on Longevity. It consists of the 10 Principles of a Holistic Philosophy which will improve your long term health, have improved happiness, and extend your longevity. You can start immediately to…  </p>  <p>  \t       * Apply methods to look and feel younger and slow your aging exercises  </p>  <p>  \t       * Learn long term health practices to extend your life many years  </p>  <p>  \t       * Live to accomplish all of your goals in life  </p>  <p>  \t       * Continue to be very active when you are much older  </p><p><em>NOTE: A confused person recently posted an awful review of my course. This is a problem on many sites like Amazon where people consciously try to mess up others products and services. As the Author I want to assure you that this course is a great deal. My professional clients pay $1200 for a version which is about 40% more content with the same structure. None of my professional clients has ever asked for their money back--They rave about it !--Marty Ettington</em></p>  <p>  \t<strong>What are some common Fears and Concerns of Aging?</strong>  </p>  <p>  \t       Do you ask yourselves the following questions concerning AGING from time to time...  </p>  <p>  \t       -Will I be able to accomplish what I want to during my life? (My bucket list)  </p>  <p>  \t       -Will I be able to be active when I am older?  </p>  <p>  \t       -Do I have to lose my looks as I get older?  </p>  <p>  \t       -Do I have to die at a certain age?  </p>  <p>  \t       -Can we learn to Master our Aging process?  </p>  <p>  \t       -How long can a person really live?  </p>  <p>  \t<strong><em>Changing our uncontiuously influencing lifestyle patterns is the key for extending our life! </em></strong>  </p>  <p>  \t       The news show it every day. Life extension strategies are sweeping the world. Therapists and Medical Doctors are taking life extension courses, so they can use it on their patients to get quicker and better results. They have started to recognize that there is an emotional underpinning to almost all “dis-ease\" and they now realize that a holistic mind, body AND soul approach can help their patients, disregarding of which age and ethnic origin.  </p>  <p>  \t       Did you know that life expectancy has increased at a very steady rate of 3 months per year for the last 150 years?  </p>  <p>  \t       This little known fact shows that many different changes in our civilization, medicine, and science have led to much longer lives than our ancestors would have thought possible. New medical science has already provided the proof…  </p>  <p>  \t<strong>We people have and can live much longer than society tells us is possible.</strong>  </p>  <p>  \t<strong>But the reality still looks different</strong>  </p>  <p>  \t       Isn't it so, that everyone around you expects you to just get old \"gracefully\". To resign yourself to being weak, looking old, having less energy, and frankly--just getting ready to die. Even worse, we are bonded in a sea of negative beliefs, imposed by dogmas and the materialistic world, which tell us, that our demographic and economic model must remain “INTACT\", that means, we HAVE to dye with 80, in order to relief the countries pension system and to pay all life insurance premiums in time.  </p>  <p>  \t       On top of that, we feel bombarded with sometimes false unjustified conditioning and we are told by others, what we can achieve and what not in our life, as this is what favors others. But creating our underlying beliefs this way, whether conscious or unconscious has created our reality system and changing our beliefs is more difficult then we think, because we have accepted them already as true. But that does not have to be that way !  </p>  <p>  \t       To positively change our life, and to build up more long term health, higher longevity and increase our happiness in life, we need uplifting and mind-expanding training, which is able to bypass the normal filters that have conditioned us to accept our limitations.  </p>  <p>  \t       That's exactly what this Training Course is all about !  </p>  <p>  \t       Aging fears, chronic health conditions, and other life concerns can be addressed by a powerful combination of psychological, spiritual, vital forces, and physical principles called...  </p>  <p>  \t<strong><em>The PERSONAL LONGEVITY PROGRAM !</em></strong>  </p>  <p>  \t       If you are a person open to the newest developments in life extension from its many \"Spiritual and Vital forces approaches - a combination of concepts, techniques, and approaches which really work, and with YOU in charge of choosing what approaches you will use to improve your long term health and longevity, <strong>you can definitely improve your life expectancy 10, 30 or more years !</strong>  </p>  <p>  \t       The comprehensive series of 10 courses teach students from 18 to 80+ about how to achieve long term health and personal longevity from different aspects of Spiritual and Scientific knowledge.  </p>  <p>  \t       The easy to follow step by step course provides the theoretical learning framework on how this longevity principles and longevity processes work in long lived persons and how everybody especially in our busy western world can apply these principles in his own daily life to maximize his own personal longevity potential.  </p>  <p>  \t       Students find out many things we can do to not only avoid illness, but to actually reverse it ! Our body is designed to heal itself naturally and then keep us healthy — IF we know how to do it.  </p>  <p>  \t       The Personal Longevity Program (PLP) – represents one of the world's first complete personal longevity development course programs, summarizing the latest methods to achieve long term health in combination to providing a precise guide to introduce and advance every health seeker's knowledge in the methods of how to achieve personal longevity.  </p>  <p>  \t<strong>Tap effortlessly into a higher level of awareness that unlocks your full longevity potential</strong>  </p>  <p>  \t       The training course is designed to help students of all age grow to their full long term health and personal longevity potential. You discover more of which energy points has to be leverages, in order to maximize and build up life extension capabilities and how to life the life you truly want to life. The course materials are inspiring, motivating and encourage a higher happiness level.  </p>  <p>  \t       The 10 step course program teaches new scientific based fundamentals in how to extend personal longevity in some once own life. In a variety of different ways students of all age can learn…  </p>  <ul>  \t<p>  \t\t       ·…about the science behind living longer and healthier than you ever thought possible  \t</p>  \t<p>  \t\t       ·…to realize that many of the chronic health conditions most of us face as we grow older can be dramatically helped by an integrated and holistic spirit, mind, and body approach  \t</p>  \t<p>  \t\t       ·…that we can break out of self-exposed expectations that we mostly have to struggle, get old, and just die  \t</p>  \t<p>  \t\t       ·…to recognize, that happiness in life is closely linked to our health  \t</p>  \t<p>  \t\t       ·…to connect to the core spirit which exists in all of us  \t</p>  \t<p>  \t\t       ·…how you can achieve lasting life fulfillment doing the things what you love  \t</p>  \t<p>  \t\t       ·…simple techniques you can use to overcome your limiting beliefs  \t</p>  \t<p>  \t\t       ·…to work on our life purpose and what we want to get out of life in a positive way  \t</p>  </ul>  <p>  \t       During the course the student will experience videos, exercises and insights that will encourage and give a new set of tools which enables and leverages the right set of energy that can facilitate a major shift in the student's ability to accept and rise to a higher level of long term health and understanding how to gain a never before experienced high potential for more longevity within daily life. The course helps to remove subconscious barriers to experiencing a more consciousness based life purpose.  </p>  <p>  \t       Take the chance and implement a new holistic philosophy in your lives of…  \t  \t<strong>Long Term Health, Greater Happiness, and Extended Longevity  \t       The principles are laid out in a step by step process to help people understand and implement these principles in their lives while taking the course...  \t  \tThe 10 Principles of Personal Longevity Course Modules are:</strong>  </p>  <p>  \t       The Reality of Long Lived People  </p>  <p>  \t       Defining Your Purpose in Life  \t  \t       Enabling the Life Urge  \t  \t       Your Spiritual Health  \t  \t       Having Love in Your Heart  \t  \t       Energy Body Health  \t  \t       The Science of Longevity  \t  \t       Physical Body Health  \t  \t       Using your Intuition for Safety  \t  \t       Implementation of these principles  \t  \tCourse Curriculum  \t  \t       The 10 lessons provide the student with methods to connect more deeply with its inner self, than ever thought possible. Students achieve greater clarity and focus and achieve training and guidance, direction and answers to all questions around their life extension potential.  \t  \t       The course starts with helping students creating a first baseline profile intake with the student to understand what the physical and non-physical mind, body and soul health status looks like.  \t  \t       The Course includes workshops like modules like the history of the search for longevity methods, to provide case histories are given of long lived persons over the age of 150 years old, stories of many other persons who may have lived thousands of years, long lived plants and animals, what science says about the search for longevity, a theory about how your physical health relates to your spiritual health, practices to grow spiritually and increase your vital forces, practices to improve your health and longevity, supplements to improve your body's health and longevity, how to avoid accidents and many more.  \t  \t       Enhancing the student's intuition to make smart long term health choices to expand the belief system, lets the student accept and adopt beliefs that empower and let gain greater longevity potential. Each class inspires to feel more connected, motivated and happier.  \t  \t       The training eliminates blocks that sabotage happiness and personal growth. Students have the chance to experience higher dimensions to raise mentally to the next level of personal development. By learning the 10 Principles of Longevity, the student expands his reality to build upon a higher physical, emotional and mental being which creates higher Personal Freedom.&lt;/b&gt;  \t  \tResult of many Years of Longevity Research and Experience  \t  \t       The Course is thought by Marty K. Ettington, Founder of the International Longevity Center in Los Angeles and Author of many books about Longevity. Marty spent his life learning about Spiritual Growth, and reading and learning about natural health practices. In the last five years he has researched and investigated extensively around the world on long term health and longevity.  \t       In 2008 Marty published his first book on longevity \"Physical Immortality: A History and How to Guide\" which has been very successful and has sold all over the world. This book introduced the facts that there are many long lived people in the world, along with theory and practices about how you we all can extend our own life.  \t  \t       In his life he had the rare opportunity to meet with so called \"immortals\" and all of them he met only believed in life and refused to believe in death patterns. Within the Longevity Center in Los Angeles, where everybody can take life seminars on the Personal Longevity Program, a team of scientists, engineers, self-experimenters, and early adopters are continuously researching within the fields of long term health and longevity to generate expert advice, expert research, and expert guidance for the public.  \t  \tWill the 10 Principles of Personal Longevity Really Work for Me ?  \t  \t       As an engineer and \"show me\" type of person Marty Ettington researched the lives of very long lived persons since he wanted to learn how they managed to live so long. As a result he has uncovered many of the reasons for their long lives.  \t  \t       The 10 Principles of Longevity are based on real research on the root causes of long term health, happiness, and longevity. Even following just a few of these principles will dramatically improve your long term health--and therefore you longevity.  \t  \t       The concept of the 10 principles embodies not just psychological, spiritual, vital forces, and physical health issues, but also current research in medical science.  \t  \t       It teaches what therapies are recommended by the latest advances in medicine, as well as longevity supplements, and exercises and practices for many of the principles which are known to improve long term health.  \t  \t       Of course there is no guarantee for any of us to live longer than is normally thought possible, but the practices we teach from a variety of sources are known to work.  \t  \t<strong>Marty Ettington:</strong>  \t  \t       As an engineer and entrepreneur with 30 years' experience in business I bring a unique and \"outside of the box\" focus on health and longevity. I wanted to know not only if we could live a very long time--but why; and how can we take control of our long term health. I've found many of the answers-which I want to share with you.  \t  \t       I've also written over 20 books on Spiritual, Metaphysical, and Longevity related topics.  \t  \t       'Now I Want To Give YOU The Exclusive Opportunity To Learn all about Long Term Health as this is my wish by heart…  \t  \t       I have a mission to get the 10 Principles of Longevity out to the world. One of the best ways to do this is through training for who will learn and apply my principles to their lives and others.  \t  \t       One of the important beliefs necessary to extend our live span to its fullest is the conviction that extending our lives is not only possible, but it is our right as spiritual beings.  \t  \t       Get started now...you will not regret it...and of course you will get a copy of \"The 10 Principles of Personal Longevity\" too (184 pages of facts, theory, exercises, and more – Amazon $39.50!)  \t  \t       So I have a question for you...  \t  \t       Do you want to finally change your life this year once and for all?  \t  \t       Or do you want another 12 months to pass you by?  \t  \t       Because by investing in this unique program, and applying the principles, I GUARANTEE you'll enjoy yourself more and have long term health and extended longevity too. So this really is a fantastic opportunity.  \t  \t       The only question now is... will you take it?  \t  \t       To Your Success,  \t  \t       Marty Ettington  \t  \tTestimonials about our Longevity Programs and Workshops:  \t  \t<em>“I did not realize prior to taking Marty's longevity course just how dependent the length of my life was on my thoughts and beliefs about age. I have only scratched the surface of this important course, and already I can see conditioned thought dissolving as awareness and scientific evidence replaces my upbringing. We may all be able to live a thousand without even knowing it ! Think of the careers I could try out! Think of the bucket list of activities I could accomplish! Think of the enlightened spirit I could arrive at if I did not have to keep starting at age zero over and over again!\"<strong>–Cheryl a successful Diet Coach</strong></em>  \t  \t<em>“Was excited to take this course to share new information with my clients in health and wellness. Was excited to see how it would benefit my health-and it has. I will incorporate what I've learned with all of my clients so they can understand how they can change their lives.\"<strong>-Carmela An experienced Life Coach, NLP, Reiki Master, and several more certification</strong></em>  \t  \t<em>“I was interested in the program so I can add more tools to my practice and help women achieve better health and longevity in their lives. Also, so that my clients can learn to use their intuition for safety in their lives. I learned more about people who have lived really long lives so that now I know it's possible and the importance of my spiritual connection. It will also allow me to better help clients to develop their life purpose\".<strong>-KAT certified hypnotherapist and personal life coach</strong></em>  </p>", 
    "end_date": null, 
    "title": "LONGEVITY PROGRAM-Improve your life span in amazing ways !", 
    "price": "20.00", 
    "instructors": "Martin Ettington", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/57877_edbe_9.jpg", 
    "course_url": "https://www.udemy.com/the-10-principles/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-03T03:01:59Z"
}