{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tSatakunnan ammattikorkeakoulun ja Metropolia Ammattikorkeakoulun yhteistyössä tuottaman lääkelaskennan kurssin (1op) runkona toimii 24 lääkelaskutapausta käsittelevä videokokonaisuus. Jokaiseen videoon liittyy tutorointisivu ja itsearviointitehtävä.   </p><p>HUOM! Kurssin suorittaminen ei tuo pätevyyttä lääkkeiden annosteluun. Pätevyyteen vaaditaan laissa määritelty tutkinto (esim. sairaanhoitaja).</p>  <p>  \tKurssi kattaa lääkelaskennan matematiikan sairaanhoitajan tarvitsemassa laajuudessa. Kurssi on tarkoitettu opintoja aloittavalle opiskelijalle tai työelämässä olevalle henkilölle aikaisemmin opitun kertaamiseen. Kurssin pedagogisena pääteemana on lääkelaskuihin liittyvien pelkojen ja epävarmuustekijoiden poistaminen, sekä oman osaamisen systemaattinen arviointi ja kehittäminen.  </p>  <p>  \tKurssin runkomateriaalin sisällöt on suunniteltu vastaamaan työelämässä eteen tulevia tilanteita, jolloin matematiikan ohella opiskelijalle jää käytäntöön liittyviä muistkuvia laskujen suorittamisesta, laskettujen annosten suuruusluokista sekä hyvistä toimintatavoista. Monella tavalla käytäntöön linkittyvän materiaalin odotetaan tuottavan pysyvämpiä ja laaja-alaisempia oppimiskokemuksia kuin puhtaasti laskentaan keskittyvillä vidoilla olisi voitu saavuttaa.  </p>  <p>  \tKeskeinen osa tällä kurssilla oppimista on itsearviointi: Jatkiuvan itsearvioinnin avulla opiskelijalle tarjotaan reaaliaikaista tietoa omasta etenemisestä suhteessa kurssin kokonaistavoitteeseen. Lisäksi opiskelijalle voidaan tarjota personoituja suosituksia materiaaleista, joita hänen olisi ehkä hyvä lukea optimaalisen etenemisen näkökulmasta.  </p>", 
    "end_date": null, 
    "title": "Lääkelaskut terveydenhuollossa", 
    "price": "50.00", 
    "instructors": "Satakunta UAS & Metropolia UAS", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/435166_1dc4_2.jpg", 
    "course_url": "https://www.udemy.com/laakelaskut/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-28T20:45:06Z"
}