{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  Marijuana occupies a strange place in our society, as both an illegal recreational drug, and a unique herbal medication that holds great potential benefit for the treatment of a variety of illnesses.  We all know the cultural stereotypes of marijuana users: “potheads”, druggies, stoners sitting on the couch for hours on end. Munching on food and doing who knows what. Drug use has rightly gained an extremely negative reputation in modern culture, due to the many harmful effects it has on peoples’ lives, and the fact that recreational use of drugs is almost uniformly illegal in our society.  Marijuana, however, is unlike most other recreational drugs in that it’s a natural plant-derived herbal substance, and isn’t heavily refined, altered, or manufactured.  For thousands of years, the cannabis plant has been used as an herbal remedy for pain relief, prevention of nausea and headaches, and the alleviation of skin conditions and digestive problems, among other ailments.  Proponents of marijuana as medicine point out that it does naturally what modern lab-created medicines do synthetically, with very few side effects. People who are drawn to organic, natural remedies see marijuana as an excellent treatment for many health problems, and scientists are finally beginning to give marijuana the legitimate research and scientific studies that it deserves.  Many countries have recognized marijuana’s medical potential and legalized its use as medicine.  So join our instructor, Donn Kropp, “weed” through the evidence, leaving no “stone” unturned, to discover the facts of medical marijuana.  </p>", 
    "end_date": null, 
    "title": "Medical Marijuana: Helpful or Harmful?", 
    "price": "20.00", 
    "instructors": "Donn Kropp", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46897_349b_4.jpg", 
    "course_url": "https://www.udemy.com/medical-marijuana/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-21T22:09:04Z"
}