{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is for regular people who need to know some medical terminology. If you've ever felt lost when talking to a doctor or just want to learn enough to be able to ask the right questions, this course would be a good place to start. These lessons will start you down the path of learning basic medical terminology as it relates to anatomy, diseases and medications. </p>\n\n<p>Each section will cover a specialty field of medicine. Within each specialty you'll learn anatomical terminology, diseases and common medications. We're starting with cardiology and dermatology. A new field will be added every week for at the least the first six weeks. The price will increase as new fields are added. If you buy now, you'll get the future additions for free.</p>\n\n\n\n<p>The lessons are designed to help you retain what you learn. You'll be presented with new terms a few at a time and then I'll give you the definitions and ask you to provide the word. This will allow you to engage with the new material and activate your short term recall. At the end of the lesson you'll review all of the terms. After the lesson, you should always download and read the handout and take the unit quiz. All of this will cement what you've learned into your long term memory.</p>\n\n\n\n<p>If you're only interested in one field of medicine, you can easily skip directly to that section. Each specialty is a standalone section with lessons on anatomical terms, diseases and medicines. Each lesson includes it's own handout and quiz. The videos are only three to six minutes long. You can spend just a few minutes a day or as long as you like watching the lessons, reading the handouts, and taking the quizzes.</p>", 
    "end_date": null, 
    "title": "Medical Terminology for Regular People", 
    "price": "20.00", 
    "instructors": "Travis Jeffers", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/846536_7d8d_3.jpg", 
    "course_url": "https://www.udemy.com/medical-terminology-for-regular-people/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-11T21:55:47Z"
}