{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn how Mindfulness and Compassion Training can help you integrate effective, practical techniques into your Recovery Lifestyle. You will learn to enhance your own Recovery process with clear and practical video lectures, text lectures and audio guides.</p>  <p><strong> </strong></p>  <p><strong>Welcoming you to a new paradigm in recovery from addiction and Mindful living.</strong></p>  <p><strong> </strong></p>  <p>This course will help you cultivate self-compassion and self-care. You will learn to integrate Mindful practices which will aid posture, breathing and awareness, empowering your Recovery experience.   </p>  <p><strong> </strong></p>  <p><strong>Already proven effective with MBSR (Mindfulness Based Stress Reduction), Mindfulness practices are widely recognized as effective ways to deal with stress and anxiety. </strong></p>  <p><strong> </strong></p>  <p>People in long-term recovery, with extensive clinical experience, developed this course. They understand the challenges of daily life and want to help you enjoy meaningful and sustained recovery.</p>  <p>This course can integrate into any type of Recovery programme you may all ready be working. It is suitable for both beginners and those already established in Recovery.</p>    <p>This programme invites you to deeply connect with a new way of ‘being.’ You can cultivate ‘inner intimacy’ – and learn to tolerate discomfort with a newfound sense of confidence and poise</p>    <p>Mindfulness In Recovery will demystify Mindfulness and provide accessible practices that can be used on a daily basis with the minimum of fuss or disruption to your normal routines.</p>    <p><strong>This course will help you discover:</strong></p>    <ul><li>Tools to combat stress and anxiety</li><li>Techniques to improve your Recovery experience</li><li>How to integrate Practice into daily life</li><li>Bust the ‘myths’ of Mindfulness</li><li>Practical exercises to aid your process</li><li>Simple methods to challenge negative thoughts and feelings</li><li>How to improve self-compassion and self-care</li></ul>              <p><strong></strong></p>  <p><strong>At the end of Mindfulness In Recovery you will be able to apply the practices you have learnt to your personal Recovery programme. You can return to the course as often as you wish in the future to refresh your intentions and motivation, re-connect to your practices and further enhance your Recovery.</strong></p>  <p><strong> </strong></p>  <p><br> <br></p>", 
    "end_date": null, 
    "title": "Mindfulness In Recovery", 
    "price": "50.00", 
    "instructors": "Mandy Johnson - Online Recovery Academy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708602_bf3e_4.jpg", 
    "course_url": "https://www.udemy.com/mindfulness-in-recovery/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T14:37:47Z"
}