{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>You can support your patients using Motivational Interviewing to guide, encourage, and empower them every step of the way on their journey toward a better life. </p>Motivating people to change their behavior requires patience, empathy, and understanding. This course on motivational Interviewing is designed to teach you how to guide patients toward behavior change using this conversational approach. There are times when you may have a patient who is resistant to change for a host of reasons, but you struggle to encourage them to consider something new to improve their health. If you are a health professional seeking to improve your ability to change lives, then this course is for you.  <p>At the end of this course, you will learn:</p><p>a. the different stages of behavior change</p><p>b. the principles and skills of engaging in a patient-centered style of counseling</p><p>c. the practice of empowering patients to see and strengthen the positivity in their lives. </p>\n<p>This course consists of 9 modules and a 10-question quiz, all of which can be completed in under an 1 hour. Each of the modules contain rich information on the behavior change process, the principles of Motivational Interviewing, and how you can implement the recommended tools with your patients. The modules include lessons on:</p><p>a. the Stages of Behavior Change - How do you know where a patient is in their readiness for behavior change?</p><p>b. the Art of Listening - What does it mean to be a good listener?</p><p>c. Appreciative Inquiry - Why is it important to focus on those things that are good about your patient?</p><p>Upon completion, you will gain a better understanding of the purpose and application of Motivational Interviewing, how to use complementary tools to support behavior change in patients, and how to discover your personal style when approaching patients with Motivational Interviewing. </p>", 
    "end_date": null, 
    "title": "Motivational Interviewing: Health Professional Training", 
    "price": "20.00", 
    "instructors": "Christine W. Thorpe", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/463630_a75e_2.jpg", 
    "course_url": "https://www.udemy.com/motivational-interviewing-training-for-patient-navigators/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-31T04:13:12Z"
}