{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p class=\"MsoNormal\">Aquí te explico brevemente en qué consiste  el programa y todos los recursos con los que cuentas para terminarlo con éxito,  es decir, para culminar con tu transformación y obtener el Máximo Rendimiento.  Eres una persona con grandes cualidades y capacidades que debes capitalizar.  Pero también, como muchos, debes tener algunos o muchos malos hábitos que te  impiden gozar de mayor salud, tener más creatividad, innovación y  productividad.</p>Para eso estás aquí, para cambiar esos malos hábitos en  hábitos que te ayuden a crecer y superarte.<p class=\"MsoNormal\">El programa se compone de 10 capítulos. Cada semana  recibirás un nuevo capítulo en video que te explica las razones por las que  deberás incluir un nuevo hábito saludable, así como los ejercicios que debes  empezar a realizar a partir de esa semana. Si quieres profundizar en el tema,  te recomendaré bibliografía y tendrás al alcance artículos y videos  adicionales.</p><p class=\"MsoNormal\">También puedes comunicarte conmigo vía mail si tienes alguna  duda o inquietud acerca de tu proceso de transformación a  marco@maximorendimiento.org</p><p class=\"MsoNormal\">Te recomiendo invitar a tus amigos y familiares a unirse a  este proceso ya que es de gran ayuda que encuentres apoyo entre personas de tu confianza.  De esta manera podrán intercambiar sus impresiones, experiencias e impulsarse  unos a otros para acelerar la transformación. </p>", 
    "end_date": null, 
    "title": "Máximo Rendimiento", 
    "price": "20.00", 
    "instructors": "Marco Preciado", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447360_eb7d.jpg", 
    "course_url": "https://www.udemy.com/maximorendimiento/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-14T17:37:47Z"
}