{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em>Today, you can change the way you run <strong>from a style that's damaging to your knees</strong> and hip joints with every running step you make - literally - to a style that will enable you to practice running for life - <strong>injury free</strong>!</em><br></p><p>This style is called <strong>Natural Running</strong> - and it's based on our anatomical design! Simple as that.</p><p>Let me explain..</p><p>We humans can move by foot through space in two different ways only - <em>by walking, and by running</em>.</p><p>So far so good.. <strong></strong><strong>W</strong><strong>hat's the problem</strong>?</p><p><em>The problem is this: almost all of us know how to walk correctly, but <strong>almost none of us know how to run correctly</strong>! I'm serious!</em></p><p>The incorrect running technique - the technique that most runners actually use -<em> is not only inefficient but outright dangerous</em>!</p><p>Chances are high that <strong>you are one of those people who do NOT know how to run correctly</strong>! <em>That's the bad news!</em></p><p><em>But, there is good news!</em> And, the good news is getting rid of the dangerous unnatural running technique and adopting the anatomically correct running technique requires <strong>one amazingly simple change.. and 20-30 steps</strong>! That's how many steps you will need to take in order to feel the difference, remember the sensation and learn what you need to do in your next run!</p><p><em>By the way, I don't blame you for possibly being one of these unfortunate runners! I was just like you.</em></p><p><strong>I used to run using a bad and dangerous running technique</strong> until about 10 years ago... when things suddenly changed for me (it was a tiny book I read).</p><p><em>And, because of this change I made 10 years ago... </em></p><ul><li><em>I haven't had a single running-related injury at all! </em></li><li><em>I run faster </em></li><li><em>I run better, and </em></li><li><em>I run for longer.. if that's what I want</em></li></ul><p>In this course I will show you the change I made, <em>so you can make the same change yourself!</em></p><p>Every minute you delay learning the Natural Running technique <strong>is potentially getting you one step closer to your next running-related injury!</strong></p><p><strong>Enroll now!</strong></p><p>++++++++</p><p>Hi, I'm Ivan.</p><p><strong>I have dedicated my life to studying how the human body works and what makes it  work even better.</strong> I am a life-long athlete and my athletic endeavors have taught me to easily distinguish between body movements that are good for my health and overall fitness and those that are not. I can easily tell what is outright damaging...<strong> I experiment on myself personally</strong> - all the time!</p><p>In all the years I've been an athlete and in all the sports and movements I've practiced and attempted - some worked, most didn't. <em>From some I suffered injuries, some left me unharmed, some made me better, stronger, faster and healthier.</em></p><p>In this course I am sharing with you <strong>the technique of Natural Running</strong> - the exact running technique which we all used before civilization took over our lifestyles! <em>And, the exact running technique we (almost) all have conveniently forgotten!</em></p><p><em>I want to help you go back to what is anatomically the better way for you to run! </em></p><p>Incidentally, this better way <em>will also make you more efficient, and in time - more fit - </em>because you will be able to practice running - as an exercise or sport - for as long as you want to, <em>and not for as long as it takes to get the next knee, hip or lower back injury!</em></p><p><strong>This course is for you regardless of whether you are an absolute beginner or you are a life-long runner! </strong>All that is required is two legs, a desire to learn about running and desire to keep the health of your joints!</p><p><strong>If you are a beginner</strong> - that's great! You will learn what is the right way to run - before you get injured.. And, you will be able to continue injury-free possibly for life - if that's what you want (and I hope that you do want that!).</p><p><strong>If you are an advanced runner </strong>- you will be able to correct a previous bad running technique in no time! If you have current running-related injuries you will know how to avoid future injuries. You will also find new ways to become better, more efficient in your running - I mean faster while using less energy!</p><p>Just like everything in life, <em>this Natural Running course, too, is NOT for everybody!</em></p><p><strong>This course is NOT for you...</strong></p><ul><li>If you plan to walk all your life and never attempt to run</li><li>If you are disabled in some way and cannot run</li></ul><p>If you don't fall into one of these two categories above then you certainly want to be able to move through space by foot via both ways available to us humans - walking and running.</p><p><em>And, if that's the case you absolutely must use the anatomically proper way of running - <strong>Natural Running</strong>. </em></p><p>If that's not the case, you may be very close to your first or next running-related injury.. And, not to scare you but one of these might be your last.. And, then you are back to walking only.</p><p><strong>So, enroll in this course now! </strong></p><p><em>This knowledge will serve you your entire life and it will forever change the way you move when you run. </em></p><p>The price of this course <strong>is a small price to pay for keeping the health of your joints and for becoming a more efficient human animal!</strong></p><p>~ Ivan</p>", 
    "end_date": null, 
    "title": "Natural Running - Avoid Injuries, Become Efficient, Stay Fit", 
    "price": "45.00", 
    "instructors": "Ivan Nikolov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/445284_545b_3.jpg", 
    "course_url": "https://www.udemy.com/natural-running-avoid-injuries-become-efficient-stay-fit/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T22:56:44Z"
}