{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  Is it possible that you could effortlessly and instantaneously see more by simply looking less?  </p>  <p style=\"\">  \t  Try it right now.  </p>  <p style=\"\">  \t  Without doing anything differently with your eyes or body, shift your mind to thinking about what you are seeing out of the corners of your eyes.  </p>  <p style=\"\">  \t  Does that feel like a whole new way of seeing?  </p>  <p style=\"\">  \t  If you notice a difference, it means that you have not been using your full peripheral vision.  </p>  <p style=\"\">  \tYou just accomplished your first peripheral vision exercise.  </p>  <p style=\"\">  \tNow stop being extra aware of your peripheral vision...  </p>  <p style=\"\">  \tYou can&#039;t, can you?  </p>  <p style=\"\">  \tThat is the reason this program works so well, and so effortlessly.  </p>  <p style=\"\">  \tOnce you bring your consciousness to feeling your feet on the floor right now...  </p>  <p style=\"\">  \tThere is a residual effect of increased awareness and vitality that lingers on.  </p>  <p style=\"\">  \tThe same is true for the eyes and your vision.  </p>  <p style=\"\">  \tWe will start with peripheral vision because it is the first to be lost under any kind of stress.  </p>  <p style=\"\">  \tAnd it is the most important foundation for building efficient, stable high level visual abilities as you progress into future courses.  </p>  <p style=\"\">  \t<strong style=\"\">Peripheral Vision Exercises</strong>  </p>  <p style=\"\">  \t  This course is designed as the foundational course for improving eye fitness and vision performance. Peripheral awareness, or the volume of active, real-time spatial perception in our consciousness, is the foundation of every higher order visual ability that we want to restore, maintain and develop. Peripheral vision is the context for any visual content we are interested in. It is the ground for every figure that we discern. It is the space in which we have the freedom to think and move. It is the space inside the box, and the room to think outside the box as well. When it comes to movement and physical performance issues, such as are challenged at a high level in sports, it is the peripheral awareness that becomes the database from which we can program and coordinate all movement. It determines the quality of input that determines the reliability and ability to recall our visual and other embedded memories. Our relationship to our visual space guides us in navigating the social sphere, and leads our journey into the transcendent connection with our non-local source, as well as our mission of manifesting that transcendent nature here and now in this life for the benefit of all.  </p>", 
    "end_date": null, 
    "title": "Natural Vision Improvement - Peripheral Vision Exercises", 
    "price": "50.00", 
    "instructors": "Rev. Dr. Glen Swartwout", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/194166_2604_6.jpg", 
    "course_url": "https://www.udemy.com/natural-vision-improvement/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-05T08:01:16Z"
}