{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\"<em class=\"redactor-inline-converted\">Lots of information and hope</em>.\" <strong class=\"redactor-inline-converted\">Mary Gramajo</strong><br></p><p>\"<em class=\"redactor-inline-converted\">This course is so THOROUGH - so easy to understand - everything so clearly stated on matters that have puzzled me for years! All the same questions, practitioners I've had in the past only brushed aside, Dr Paula has answered in spades! I especially appreciate the photographs, x-rays, and - wow! the dialogue between her and real patients</em>.\" <strong class=\"redactor-inline-converted\">Marty Richert</strong></p><p>\"<em>Clear, detailed, explanations. Very informative. Great visuals</em>.\" <strong>Peggy Crabtree</strong></p><p><strong></strong>_________________________________________________</p><p>Do\nyou wear high collars to hide the unattractive lump of fat on the\nback of your neck? What is the fatty neck lump? How did you get it\nand how can you get rid of it? </p>\n\n<p>I\ndesigned this course with the help of nearly 200 real posture pupils\nconcerned about their posture appearance. By the end of the course,\nyou'll understand the cause and have an actual rehabilitation routine\nto get rid of your fatty neck hump.</p>\n\n\n\n<p>I'll\nbe teaching exercises based on a highly researched technique called\nCBP the Clinical Biophysics of Posture. This technique is perfect for\nthose with a visible fatty neck hump that has failed to respond to\ntreatment or exercises already tried. </p>\n\n<p>Not only will I cover the 4\nspecific causes of neck hump, and the 6 most frequently asked\nquestions, but I'll demonstrate on my own neck, how to perform 7 very\nspecific movements that will get right under the fatty hump to the stiff,\nachy joints below in ways likely not seen before. I'll be with you\nevery step of the way!</p>\n\n\n\n<p>Feel\nfree to take a look through the course description now. I look forward\nto seeing some of you on the course!<br></p>", 
    "end_date": null, 
    "title": "Neck Hump| How to Get Rid of the Fat at the Top of Your Back", 
    "price": "30.00", 
    "instructors": "Dr Paula Moore", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/821996_558c_3.jpg", 
    "course_url": "https://www.udemy.com/neck-hump/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-14T14:44:18Z"
}