{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"></strong>Weight loss by feeling good?  Is it possible?  ABSOLUTELY! Complete this course and follow what you learned for 30 days and if not completely satisfied simply utilize the 30 day money back guarantee.  </p>  <p style=\"\">  \t<strong style=\"\">LOSE WEIGHT - SECRETS OF A FEMALE MASTER HYPNOTHERAPIST - A WEIGHT LOSS INTENSIVE DESIGNED SPECIFICALLY FOR WOMEN</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t            Why just for women?  Because our minds are wired differently from men. What works for them doesn&#039;t necessarily work for us.  Discover what does work for you.  </p>  <p style=\"\">  \t            My name is Patricia Gilmore and let me tell you, this course is very different.  I am going to be teaching you my powerful secrets for helping people make permanent and lasting change in their lives.  My students and clients have incredible success with my <strong style=\"\">PLEASURE PROGRAMMING/FEEL GOOD</strong> methods. I am a woman, my clients are women, so I know women.  I know what works for them and what doesn&#039;t work for them, what motivates to the core and what doesn&#039;t resonate.  As a Clinical Master and Medical Hypnotherapist and International Speaker I have literally taught thousands of people how to change their internal programming to get what they want.  Now you too can learn my secrets.  </p>  <p style=\"\">  \t            When you enroll for this course you will learn  </p>  <ul style=\"\">  \t<li style=\"\">how to identify your true core motivation for desiring to lose weight and why knowing it is so important.  Discover your core seed and you are more than halfway to your goal.</li>  \t<li style=\"\">how masculine pain programming (THE OUCH FACTOR) is effective but not the best way to get what you want.  Pleasure (THE FEEL GOOD FACTOR) simply works better for women.  Nurturing and support is the language we understand not programs using motivational &quot;yelling&quot;. We often shut our ears and zone out in the presence of shouting. Learn a better way.</li>  \t<li style=\"\">how the mind works and how to bypass that devil on your shoulder that keeps you from making weight loss progress.  Defeat that guy by going in the side door of your mind.  Learn how.</li>  \t<li style=\"\">how to find your own personal &quot;channel&quot; and how to tune into it to access the part of your mind that can help you lose weight faster and more effectively.</li>  \t<li style=\"\">how to eliminate overeating and switch your desires to healthy foods and lifestyle practices by simply changing your internal program.</li>  \t<li style=\"\">how to de-emphasize the word &quot;exercise&quot; (if it represents something you don&#039;t like) and fall in love with moving your body.</li>  \t<li style=\"\">how to hire a professional hypnotherapist. Learn what to look for so as to get the best quality for your money and your time.</li>  \t<li style=\"\">how to create your own customized programs. Learn all the do&#039;s and don&#039;ts to tap into your subconscious mind faster, better and <em style=\"\"><strong style=\"\">safely</strong></em>.</li>  </ul>  <p style=\"\">  \t            In addition to over 25 lectures and supplemental materials in this course there are four separate 20 minute self-hypnosis/guided imagery sessions to download to your computer, phone or listening/viewing device.  Utilize them daily and speed along your effortless weight loss.  The titles of the sessions are  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">FEELING GOOD</strong></li>  \t<li style=\"\"><strong style=\"\">THE END TO OVEREATING</strong></li>  \t<li style=\"\"><strong style=\"\">EXERCISE AND ENERGIZE </strong></li>  \t<li style=\"\"><strong style=\"\">THE CRYSTAL BALL - YOUR BRIGHT FUTURE</strong></li>  </ol>  <p style=\"\">  \t            Dive on in the warm love tub of <strong style=\"\">PLEASURE PROGRAMMING.  </strong>  </p>  <p style=\"\">  \t<strong style=\"\">LOSE WEIGHT by FEELING GOOD!  BECAUSE YOU ARE WORTH IT!  ENROLL TODAY!</strong>  </p>  <p style=\"\">  \t<em style=\"\">NOTE: This course does not include a diet or exercise program.  For that you will need a different course.  This course is about changing behaviors and beliefs by utilizing the power of your subconscious mind. </em>  </p>", 
    "end_date": null, 
    "title": "No Effort Weight Loss - Top Tips of a Master Hypnotherapist", 
    "price": "35.00", 
    "instructors": "Patricia Gilmore", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292624_f9d6_6.jpg", 
    "course_url": "https://www.udemy.com/lose-weight-secrets-of-a-master-hypnotherapist/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-02T19:40:07Z"
}