{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Using current medical research this approx. 2-hour course takes you through why inflammation occurs, what diseases are related to it (you'll be surprised HOW MANY - including: arthritis, psoriasis, eczema, gout, asthma, allergies, irritable bowel syndrome, crohn’s, colitis, diabetes, certain cancers, lupus, celiac disease, Multiple Sclerosis, fibromyalgia, and other autoimmune diseases), and then this course moves on to teach you how to prevent and deal with inflammation using natural methods such as diet and lifestyle.  Learn what foods trigger inflammation and the best nutrients and supplements to fight it.  Discover the most common myth related to nightshades, and other foods often believed to be inflammatory. </p>\n\n<p>When you finish this course not only will you have a full color cookbook specifically designed for inflammation and auto immune disorders, but with over 10 cooking videos you will have skills to cook the right foods for great health. You will be able to create delicious meals that follow the recommendations of health professionals in preventing and dealing with disease. You will be able to make some serious life style changes that will reduce, and even in some cases eliminate, pain and other symptoms related to inflammation by following your doctor’s recommendations and the scientific evidence in this course for proper nutrition and lifestyle. </p>\n\n<p>If you are leaning toward vegetarian, you will find this transition easier but you don't have to be to take this course. However, through this course, you will have to make some choices about what is more important: freedom from pain, and other symptoms, or your current diet and lifestyle.  We want to help you, so you are NOT alone in this adventure.  Please watch the free introduction and other videos to learn more (the first 3 lessons are FREE as well as 2 of the cooking videos!).</p>", 
    "end_date": null, 
    "title": "Nutrition 2 Fight Inflammation", 
    "price": "45.00", 
    "instructors": "Angela Poch, NC", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/804086_8283_2.jpg", 
    "course_url": "https://www.udemy.com/nutrition-2-fight-inflammation/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-25T20:53:10Z"
}