{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Having problems sleeping?</strong></p><p><strong>Relying on coffee and energy drinks to make it through the day?</strong></p><p><strong>How often do you sleep well and wake feeling great?</strong><br></p><p><br>Don't feel bad because you're not alone. Over 60 million people suffer in the U.S. alone.</p><p>As a physician, I see tons of people for sleep problems and the health issues directly related to poor sleep. I was once just like you. As an EM physician, being rested and sharp was critical; lives depended on it. Fortunately, I was in the ideal place to figure it out. Surrounded by great medical minds, I compiled the best techniques and blended that together with current science.  That’s why I created this course for you.</p><p>With the frenetic pace of today’s world, getting good sleep has never been more important.  You are here because either you or someone you care about has a problem with not sleeping - am I right?</p><p>This course is straightforward, the material is easy to understand, and no advanced knowledge or medical degree is needed. I promise.  </p><p>If you want to sleep better, feel more rested, and wake up with tons of energy this course is for you.</p><p>You might be a friend or family member of someone who sleeps poorly and you’re here to learn how to help them.</p><p>My goal in this course is to give you an understanding of why sleep is eluding you or a loved one and provide you with an action plan.</p><p>The goal of One Week To Better Sleep is to give you the information, tools and techniques to start sleeping better.</p><p>There is no Sleep Bank, so learning this is critical for your health.</p><p>I’ll be sharing the 7 P’s of getting good sleep.  Each day layers on another strategy to ensure you are getting the sleep your body needs.</p><p>Each module corresponds to a day of action or activity. By the end of the week, you will have a firm grasp on the how and why of getting better sleep.</p><p>If you’re someone who reaches for the coffee or energy drink just to get through the morning, this course if for you.  Find yourself tossing and turning and watching the clock tick by, don’t waste another night counting sheep.  There is a better way.</p><p>I look forward to interacting with you and sharing One Week To Better Sleep.</p><p>Mitchel Schwindt, M.D.</p><p>Physician, Author, Healthy Living Expert and Creator of the <em>One Week To Better Sleep Course.</em></p>", 
    "end_date": null, 
    "title": "One Week To Better Sleep", 
    "price": "20.00", 
    "instructors": "Mitchel Schwindt", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/623152_332b_2.jpg", 
    "course_url": "https://www.udemy.com/one-week-to-better-sleep/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-26T17:12:33Z"
}