{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Sie leiden unter Nackenverspannungen? Dann könnte dieser Kurs genau richtig für Sie sein. In 48 Lektionen und über 4 Stunden Videomaterial, bietet dieser Kurs anschauliche Erklärungen, hilfreiche\nInformationen und wirksame Übungen, mit denen Sie Ihre Nackenverspannungen\nerfolgreich bekämpfen können. Zusätzlich soll die Nackenkur dabei helfen, den Weg zu\neiner gesunden Lebensweise zu finden, in dem Sie lernen, Ihre Lebensgewohnheiten zu\nändern.<br></p><p>Dieser Kurs bietet zahlreiche Möglichkeiten, aktiv gegen Verspannungen anzugehen. Spezielle Übungen dienen zur Kräftigung, Mobilisierung und\nDehnung deiner Muskulatur. Zusätzlich werden einfache therapeutische Ansätze, wie\nzum Beispiel Kinesio Taping, Techniken der Osteopathie und Gua Sha, näher gebracht. </p><p><br></p><ul><li>Sie bekommen eine umfangreiche Sammlung von Übungen, Methoden und Tipps, die in der Praxis schon erprobt und erfolgreich angewendet werden.</li></ul><ul><li>Mit einem praktischen Selbstcheck finden Sie Ihre Schwachstellen und lernen gezielt diese zu verbessern.</li><li>Sie werden lernen Ihre Körperhaltung zu verbessern und muskuläre Dysbalancen zu beseitigen</li><li>Lernen Sie mit osteopathischen Techniken, Kinesiotaping, Gua Sha und Triggerpunkt-Behandlung, Ihre Verspannungen zu lösen.</li><li>Verbessern Sie Ihre Haltung und Kraft durch gezielte Kraftübungen.</li><li>Machen Sie sich geschmeidig, mit Mobilitäts- und Entspannungsübungen. </li><li>Verändern Sie Ihre Verhaltensweisen in bestimmten Situationen um entspannt durch´s Leben zu gehen.</li><li>Mehr als 4 Stunden Videomaterial, zzgl. Audiodatein und Arbeitsblätter zum downloaden</li></ul><p><br></p><p><br></p><p><strong>Für wen ist dieser Kurs geeignet?</strong></p><ul><li>Dieser Kurs ist für Menschen die immer wieder an Schulter-, Nacken- und Rückenverspannungen leiden.</li><li>Aber auch zur Verbesserung der Körperhaltung und Prävention</li><li>Für Trainer und Therapeuten, die auf der Suche nach effektiven Methoden und Übungen sind. </li></ul><p><strong>Für wen ist dieser Kurs nicht geeignet?</strong></p><ul><li>Menschen mit akuten Beschwerden, sollten vorher einen Arzt aufsuchen. </li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Online-Nackenkur - Selbsthilfe bei Nacken- & Rückenschmerzen", 
    "price": "50.00", 
    "instructors": "Rohit Mathur", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706518_85d8_5.jpg", 
    "course_url": "https://www.udemy.com/die-online-nackenkur/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-25T18:27:18Z"
}