{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  Pain is keeping you tense and anxious while you are healing from illness or injury - and this stress actually interferes with the healing.  </p>  <p>  \t  This technique is highly effective if you are healing from an illness or injury and you need to relieve pain. It can be done any time, even in a public place, and others will not be aware you are doing it. It can also help you release the anxiety and frustration associated with pain, to give your body a greater ability to heal much more quickly.  </p>  <p>  \t<u>The 7 benefits of the 7 minute classes</u>  </p>  <p>  \t                1. The techniques are EASY &amp; VERY QUICK to learn and beneficial for everyone.  </p>  <p>  \t                2. Classes are only 7 minutes and you can do them anywhere, anytime.  </p>  <p>  \t                3. It’s a new way to physically relax your body, &amp; calm your mind to increase happiness.  </p>  <p>  \t                4. Many of the breaths classes can be done in public – when YOU need them most!  </p>  <p>  \t                5. These NEW techniques gives you the tools to cope with everyday stresses.  </p>  <p>  \t                6. The breaths classes really work – they do what they say, and you will feel instant relief!  </p>  <p>  \t                7. You will feel in control of your body and mind &amp; the more you use the tool the better it works.  </p>  <p>  \t                You will almost instantly feel calm, relaxed and in control of your emotions, and your thinking will become clear and sharp once again &amp; the pain will receed. Includes:  </p>  <p>  \t                ● ImmediatelyFully Guided Video with extra setup tips  </p>  <p>  \t                ● Fully Guided Audio with extra setup tips  </p>  <p>  \t                ● Guided Audio  that you can put on repeat for a deeper experience  </p>  <p>  \t                ● Printable PDF’s with set up tips and extra information that will help you get the most out  </p>  <p>  \t                of your new skill  </p>  <p>  \t              This tool is excellent to ease anxiety and stress due to pain, and to manage pain during healing from illness or injury.  </p>  <p>  \t              ● No one will be aware you are doing this technique  </p>  <p>  \t              ● Works quickly to ease the emotional and physical symptoms of pain  </p>  <p>  \t              ● Improves your mindset, to promote healing  </p>", 
    "end_date": null, 
    "title": "Pain & Healing - 7 Minute relief for Busy people, in public", 
    "price": "35.00", 
    "instructors": "Millie Swann", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296840_a014_7.jpg", 
    "course_url": "https://www.udemy.com/pain-healing-7-minute-relief-for-busy-people-in-public/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T05:18:55Z"
}