{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>\"Prolonged sitting should be considered within occupational health and safety policies and practices just like other elements of posture.” </strong><span style=\"\"><strong>~ British Journal of Sports Medicine</strong></span></p><p>Learn\nhow to avoid a potentially lethal disease by following simple steps.\nThe sitting disease, which is linked to long periods of sitting while\nworking, is becoming a health concern for many people.  See how I\naddress this problem with two easy steps without affecting\nproductivity or using expensive equipment.</p><p>\nInactivity\nphysiology is a relatively new branch of the science of physiology. \nI believe any person who uses a computer for work or has to sit\nat a desk for extended periods of time should have a basic\nunderstanding of this new scientific field.</p><p>\n<strong>Start\nimplementing your own intervention to make sure you feel energized\nand less stiff while working and ensure optimal health for the\nfuture. </strong>\n</p><p><strong><br></strong></p><p>\n-\nSitting disease basics.</p><p>\n-\nSurprisingly simple prevention principles.</p><p>\n-\nEasy steps to apply interventions.</p><p>\n-\nPossible obstacles.</p><p>\n<br>\n</p><p>\n<strong>Start\nworking in a way that does not endanger your health.</strong></p><p>\nLearn\nwhat all the hype around the “sitting disease” is about and find\nout what you can do about it.  If you have to sit while working for\nmore than two to three hours at a time (for example, working on a\ncomputer), you may be at risk of developing some of the health\nproblems associated with the “sitting disease”.  Problems such\nas; an increasing waistline, type-2 diabetes, cardiovascular disease,\nhigh blood pressure, cancer and depression have been linked to long\nperiods of sitting.</p><p>\nApplying\ninterventions against the “sitting disease” can help you to lower\nyour risk of developing these problems, as well as help you to feel\nbetter while you work.  Instead of feeling stiff and experiencing\nback pain after working – you can feel revitalized and energized.</p><p>\n<br>\n</p><p>\n<strong>Content\nand Overview</strong></p><p>\nThis\ncourse is an introduction to the sitting disease and possible\ninterventions against the sitting disease.  Learn what the sitting\ndisease is and how to approach successful interventions.  Factors\nthat can have an impact on the success of these interventions are also discussed.  The applications described in the course are\nespecially useful for any person who is required to sit for more\nthan two to three hours at a time while working, and who have not yet\napplied successful interventions.  For example, if you are a software\ndeveloper who works on a computer for extended periods at a time.</p><p>\nBy\nthe end of the course you should be able to start planning your own\ninterventions with confidence.  Although I cannot advise you about\nany specific interventions you may want to do in your own working\nsituation, I can help with guidance and ideas.</p><p>\nThis\ncourse does NOT provide exercises (such resources are not difficult\nto find), but instead the aim is to explain the principles behind\npossible interventions and to help you to plan changes to how you\nwork.</p><p>\nAlways\nbe safe and cautious when changing your physical activity and it is\nrecommended you consult with your health care provider. I do not\nprovide medical or therapeutic services – my aim is to raise\nawareness about the sitting disease and to bring about change to\ncurrent mainstream workplace environments and approaches.</p><p>\nAlthough\nthe interventions suggested in the course may not be practical in all\nworking situations, the basic principles behind the interventions can\nbe creatively applied and adapted to various different working\nenvironments.</p><p>\nBy\nchanging a few simple things in your approach to your workspace, you\ncould easily change your work environment from a potentially harmful\nenvironment, to one that is enjoyable and healthy!</p>", 
    "end_date": null, 
    "title": "Physiology of sitting: how to improve health and fitness", 
    "price": "35.00", 
    "instructors": "Katarina Debro", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622208_0276_5.jpg", 
    "course_url": "https://www.udemy.com/sitting-disease-prevention-for-those-who-sit-while-working/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-25T14:01:40Z"
}