{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Post-Traumatic Stress Disorder (PTSD and sometimes known as Post-Traumatic Stress Syndrome) has been known by many names:&nbsp;<em style=\"\">Shell Shock, Battle Fatigue, and Gulf War Syndrome</em>&nbsp;are but a few. Post-Traumatic Stress Disorder is delayed grieving due to an overwhelming trauma or stress. It can also be caused by numerous less severe traumas experienced over time.This educational DVD presents new healing treatments for this disorder.<br style=\"\"></p><p style=\"\">This course on Post-Traumatic Stress Disorder addresses the enormous problem of trauma and trauma resolution. After a traumatic or violent experience, either physical or emotional, people might lose the ability to deal with everyday life. This translates into a mentally debilitating state called Post-Traumatic Stress Disorder or PTSD. People that have lived in dysfunctional families are time and again affected at a high level. Early treatment and understanding of this condition will effectively help a person with<em style=\"\">&nbsp;Post-Traumatic Stress Disorder</em>&nbsp;overcome this mental issue and to achieve a better mental health state.Trauma has always been with us, but is also on the rise. The Oklahoma City bombing and the World Trade Center Twin Towers in New York on 9/11 are only the most sensational in the United States. As terrorism continues to grow it becomes imperative to truly understand the intricacies of this mental health disorder.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Post-Traumatic Stress Disorder Causes, Symptoms, Treatments", 
    "price": "20.00", 
    "instructors": "Jef Gazley, M.S., LMFT", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/34178_90a9_5.jpg", 
    "course_url": "https://www.udemy.com/post-traumatic-stress-disorder-causes-symptoms-treatments/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-02T19:01:09Z"
}