{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Two new lectures added April 12, 2016.<br></p>\n\n<p><strong>1500+ students enrolled; 14, 5* reviews!</strong></p>\n\n<p>Following on from an incredibly successful introductory Posturecise course, it was clear that Posturecise Pro was needed for those of you who wanted just a little bit more in the way of challenge and desired to take your posture correction to the next level.<br></p>\n\n<p>  \t<strong>This is what some of our pupils are saying:</strong>  </p>\n\n<p>\"Great Course!<strong> </strong><em>I work at an office job, and spend a lot of time commuting. This course was exactly what I needed. The course starts with measuring your posture, and then moves on to outline specific stretches, exercises, and massages to target key areas like forward head and rounded shoulders. Definitely recommend if you are willing to do the work to improve your posture.\"     </em><strong>Shannon Everett</strong><strong></strong></p>\n\n<p>\"<em>Posturecise has helped me release my upper back tension in a short time. It was amazing to see how a few simple, well structured and targeted exercises could make such a difference so quickly</em>.\" <strong>Sabrina Colvin Sterling</strong><br></p>\n\n<p>  \t   \"<em>I've been looking for an easy to learn system for improving posture for a long time. And now I have found it</em>.\" <strong>David Ed Wilkes</strong>  </p>\n\n<p>  \t  \"<em>Ive had posture problems for a long while now and much as I have struggled to correct it, I just havent found the consistent technique that you taught here. Poor posture always left me feeling tired constantly and just doing a bit of your course helped boost my energy. I will endeavor to follow your 21 Day Challenge. Thanks again!</em>\" <strong>Abrl Pglng</strong>  </p>\n\n<p>  \t  _____________________________________________________</p>\n\n<p>  \t<strong>Dr Paula Moore</strong>  </p>\n\n<p>  \t  In the early 90s, frustrated by years of pill-popping and chronic daily headaches, I took myself to a chiropractor. I was so amazed with the results, that I moved to the UK (from Toronto) to study Chiropractic.  </p>\n\n<p>  \t   Several years after qualifying, I was horrified by a picture of myself. I had developed horrible forward head posture - I was embarrassed to be a healthcare professional with bad posture. I become obsessed with how to improve my posture. I spent years studying x-rays and trying new products and exercises. I later qualified with a fellowship in the physics of posture correction. I fell in love with posture!  </p>\n\n<p>  \t  Regaining attractive, tall, confident posture takes time and commitment but a commitment to your health and well-being that you can learn to love, until one day you wake and look in the mirror and you see that you are oozing posture confidence – and boy, that will be a day to celebrate.  </p>\n\n<p>  \t  _____________________________________________________ </p>\n\n<p>  \t<strong>Posturecise Pro </strong>- The advanced version of the original Posturecise course  </p>\n\n<p>  \tPosturecise Pro is all about YOU and helping you regain attractive, youthful posture. Posture that you're proud of, posture that makes you feel confident.  </p>\n\n<p>  \tThe course includes my posture Golden Rules and includes a whole series of self tests that you can do to help you to determine where you are starting from and helps you monitor your progress as you move through the course.  </p>\n\n<p>  \tThe Posture Strengthening section of the course will help you target the worse posture areas by far (neck stabilizers, rotator cuff, abdominal core and pelvic architecture). This is a tough section.  </p>\n\n<p>  \tThe Posture Stretching section targets whole muscle groups - the muscles responsible for round shoulders, hunch back, the chronically tight lumbar region and the muscle tension in our necks due to our busy desk-based lives.  </p>\n\n<p>  \tA really exciting section of the Posturecise Pro course is an entire section on Self Treatment: You'll learn lots of self massage techniques and particularly how to remove painful muscle knots from your shoulders, back and buttocks.  </p>\n\n<p>  \tPosturecise Pro goes beyond creating a new habit. This course is designed to help you create attractive, youthful posture that will leave you thriving and practically oozing posture confidence!  </p>\n\n<p>  \t_____________________________________________________ </p>\n\n<p>  \t<strong>What this course is not:</strong>  </p>\n\n<p>  \t<em>A bust your gut boot-camp for fitness slaves that feel the need to pound their bodies and sweat profusely.</em>  </p>\n\n<p>  \t<em>A quick fix - I can not stress this enough. Good posture is not a quick fix and Posturecise is not a miracle cure. Good posture is a life-long commitment and one you can learn to love and enjoy!</em>  </p>\n\n<p>  \t<em>I will not look at your posture on this course but I do teach you how to do you own posture self-analysis.</em>  </p>\n\n<p>  \t<em>I can not tell you how long it will take to correct your posture because there are many factors that contribute to your rate of healing: past injury, nutrition, emotional health, fitness levels, age etc.</em>  </p>\n\n<p>  \tBut if you want my personal experience with posture - remember I have been doing posture for almost 20 years and I have helped thousands of people improve their posture and regain confidence, then you may just love this course.  </p>\n\n<p>  \t_____________________________________________________</p>\n\n<p>  \t<strong>You'll Receive:</strong>  </p>\n\n<ul>  \t<li>40 lectures! (Video/Audio/Quiz/PDF)</li>  \t<li>5 self analysis tests that help you analyze where you are starting from and monitor your progress</li>  \t<li>My two Golden Rules – The two biggest secrets about posture, you've never heard about</li>  \t<li>8 posture strengthening exercises (includes the 10Ib chin tuck, Paula's Plank and the Walking Lunge)</li>  \t<li>8 posture stretching exercises (includes the Extreme Neck Stretch and R<em>ound Shoulders Be Gone!</em>)</li>  \t<li>6 self treatments (includes How to Remove Painful Muscle Knots Yourself)</li>  \t<li>Instruction from a qualified primary health care physician (not a trainer)</li>  \t<li>Open email communication with Dr Paula Moore encouraged</li>  </ul>\n\n<p>  \t_____________________________________________________</p>\n\n<p>  \t  Click the \"take this course\" button, top right, now ... <em><em>every hour you delay is costing you your health ...</em></em>  </p>\n\n<p>  \t   Dr Paula Moore  </p>", 
    "end_date": null, 
    "title": "Posturecise Pro-How To Age Well With True Posture Confidence", 
    "price": "35.00", 
    "instructors": "Dr Paula Moore", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355734_a2fa.jpg", 
    "course_url": "https://www.udemy.com/posturecise-pro-how-to-get-attractive-tall-confident-posture/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T23:35:43Z"
}