{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>The benefits of Holistic Natural </strong>remedies<strong> and Natural medicine is that they are gentle, non-toxic and safe</strong>.  They improve the general health of the patient.  <br></p>\n\n<p>Learn how to use Natural remedies and Holistic medicine for your entire family, cats, dogs, animals and people. </p>\n\n<p>You want to do your best for your family- animal and people but you might be  getting conflicting advice about which medications/drugs are safe and which Natural products work effectively.  </p>\n\n<p><strong>I am a Holistic/Natural Veterinarian whose passion is to keep animals (and humans) healthy using natural remedies, natural medicine and holistic medicine, i</strong>ncluding Homeopathic remedies, herbs and Natural supplements. <br><strong>  </strong></p>\n\n<p><strong>I am here to teach you how to use Natural remedies for many of your pet’s (and your) common problems and </strong>help you avoid the toxic side effects of conventional drugs/medications.  </p>\n\n<p><strong></strong> </p>\n\n<p>I have over a decade of experience treating animals for all types of \nhealth issues including cancer and chronic disease. I use Natural herbs \nand homeopathy for my patients and also for my own family, pets and \npeople.<strong> This keeps my family and patients healthy and avoids the side \neffects of drugs/medications.</strong> Learn from me how to keep your own family healthy using natural medicine and natural remedies.  (A<em>s an added bonus, many can be used for yourself and your (human) children too!) </em></p>\n\n<p>I have given countless seminars on using Natural remedies and \nhomeopathy.                      My seminars have been taken by people \nfrom all walks of life, who want to keep their pets healthy and avoid \nthe side effects of drugs/medications.  My students tell the seminars have given them the confidence to use Natural remedies and \nhomeopathy for their pets and themselves.   Now you can learn how to use Natural remedies and homeopathy from me on-line without having to come to my seminars.<br><em></em></p>\n\n<p>I am one of  a few Veterinarians in North America who is also certified as a Classical Homeopath with the CHC, Council for Homeopathic Certification, which means I am trained to treat people as well as animals. This extra knowledge allows me to teach you how to use Natural remedies even better.  </p>\n\n<p><strong>Learn how to use these non-toxic, safe and gentle natural remedies for your own family, whether pets or humans. </strong></p>\n\n<p>Learn how to keep your pets and family healthy by using Natural medicine and Natural remedies.  No prior experience is needed, I will teach you what you need to know in this course.  You will begin to learn how to use this valuable method of healing. using natural remedies and natural medicine, for your own family (animal or human) and feel confident in doing the best for your family. Then you can avoid many toxic drugs and medications.  </p>\n\n<p><em>What my students are saying about this course:</em></p>\n\n<p>\"I enjoyed this course, good basic information on this \nwonderful healing modality. I even learned how to properly dispense the \nlittle pellets from the tube! Used to just pull out the dispenser with a\n fork...</p>\n\n<p> Since having Dr. Rehanni use homeopathy on me \nand my family-animal and human-I`ve seen wonderful results. This course \nteaches you to be aware of safe, effective solutions you can use for \ncommon issues.\"</p>\n\n<p>\n                                        <strong>\"Great Success!!</strong>\n                                    </p>\n\n<p>Dr Rehanni (the \ninstructor) does a great job simplifying homeopathy, why it is important\n and how it works!  This course is easy to understand, follow and is \nvery informative! I have used well over half of the remedies she talks \nabout either on myself, my kids or my pets and have had great success! I\n would highly recommend this course to anyone, the remedies and things \nthat are discusses would be help to anyone and their pets. </p>\n\n<p>Thank you Dr Rehanni for sharing you knowledge with us!\"</p>\n\n<p>\n                                        <strong>\"Great Course! I feel Empowered!</strong>\n                                    </p>\n\n<p>Thank you Dr. \nKhaseipoul for a great course on natural medicine for not only my pets, \nbut my family too. You have a wonderful knowledge of homeopathy which \nyou shared clearly. You helped me 'catch the vision' of how it could \nmore fully help my family of humans and pets. I have some of the items \nyou recommended in my home already and will add the others to my \nhomeopathic first aid kit. The best thing is, that they won't sit on the\n shelf any longer, as I feel empowered to use them.  I love that I can \ncontinue to refer back to the course for review as often as I want. \nThanks so much!\"</p>\n\n<p>______________________<br></p>\n\n<p>About this course: </p>\n\n<ul><li><em>Full,      free lifetime access to this online course, any time of day or night (24/7)</em></li><li><em>Learn      at your own pace, in the comfort of your home</em></li><li><em>All      future courses and upgrades are received by my students at a discounted      price</em></li><li><em>Unconditional      Udemy 30 day money-back guarantee </em></li><li><em>Includes      <strong>several </strong>pages of downloads you can reference forever and make part      of your Natural library.</em></li></ul>\n\n<p><strong>YOU'LL LEARN HOW TO: </strong></p>\n\n<ol><li>Keep      your pet healthy using Natural herbs &amp; Natural remedies like homeopathy, and      household products like Epsom salts and tea!</li><li>Treat      simple conditions at home using these Natural, gentle, non-toxic and safe remedies</li><li>Learn alternatives to drugs and medications      as drugs/medications can have negative side effects for your pet’s health</li><li>Learn how to detoxify your pet from previous      drugs and medications that were used in the past</li><li>Save $ money on Vet bills </li><li>Feel confident learning about your pet's health      from a reliable source, an experienced Veterinarian and Homeopathic      practitioner whose passion is Natural health for pets and people. </li><li>Retain this knowledge &amp; information for the      life of your pet (and yourself!)</li><li>Use these skills and tips to improve your      health (and your human family) too!</li><li>Topics we will cover include:</li></ol>\n\n<ul><li>How to treat cuts/abrasions/hot spots</li><li>How to treat sprains, strains or injuries to joints/muscles/tendons</li><li>How to treat simple infections</li><li>How to treat anxiety</li><li>How to deworm your pet without harsh chemicals</li><li>How to detoxify the liver</li><li>How to treat diarrhea and vomiting</li><li>How to treat bug bites and allergic reactions</li></ul>\n\n<p><strong>After doing this course, you will begin to have your own foundation of Natural care for your pets and family.  You will feel confident in keeping your pet healthy using Natural remedies.</strong></p>\n\n<p>I have put a lot of time and thought into this course, I hope you enjoy it and I would love your feedback on what you like, what is helpful, and what other topics you want to learn about. My mission is to spread the knowledge about Natural medicine to those who want it, all over the world.  </p>\n\n<p>Sincerely, </p>\n\n<p>Dr. Rehanni Khaseipoul </p>\n\n<p><em><strong>*To enroll\n in this course, click the \"take this course\" button, top right and \nlearn how to prevent &amp; treat disease in your pets and family using \nNatural Remedies</strong></em><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Powerful Natural Remedies For Your Dog , Cat & You", 
    "price": "20.00", 
    "instructors": "Dr. Rehanni Khaseipoul, DVM, CCH, RCSHom", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553894_ccd9_2.jpg", 
    "course_url": "https://www.udemy.com/how-i-take-care-of-my-animals-using-natural-remedies-vol-1/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T01:50:21Z"
}