{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Each day is an experience to learn how your mind, body and soul can be healthier. In each hypnosis session you will access your subconscious mind,\napplying all of the resources you need to instruct your cells to make the\nchanges needed for health. </p><p>Hypnotherapy can have a profound effect on your internal organs, blood flow, hormones, immune system, pain, and illness. This powerful hypnosis program will affect everything, to bring you to a better understanding of your health. You will create a state of harmony to create excellent health.\n</p><p>VIDEOS- There are 8 videos, watch one each day. You will watch the video and gain an understanding of how each process can help you heal. The rest is easy. <br><br>HYPNOSIS AUDIOS- Audio Download Sessions are easy.  Just download the hypnosis session for the day, get relaxed and make sure you won't be disturbed. The hypnotherapy session will relax you deeply and create a new belief about your health, looking at it from several aspects of healing.<br><br>After you experience all the sessions, you can use the hypnosis sessions again and again. Need to help your body relieve some pain, or heal more quickly, or let go of a headache? Just choose your session, relax and listen. <br></p><p>Some people like to use Headphones, to deepen the experience.<br>PLEASE never use while driving or doing any activity. This is Hypnotherapy and it will deeply relax you and help you heal while in trance.<br>I have seen thousands of miraculous healings  with the work I have done for over 20 years. I am sure you will enjoy the enlightenment and power that you discover when you complete this course.</p><p><br></p>", 
    "end_date": null, 
    "title": "Powerful Mind Body Healing with Hypnosis, 8 day program", 
    "price": "20.00", 
    "instructors": "Wendi Friesen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690550_4256_2.jpg", 
    "course_url": "https://www.udemy.com/mind-body-healing-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T20:37:20Z"
}