{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong></strong></p><p><strong>Practicing the 5 exercises </strong>will train and awaken your perception of the energy moving through space. </p>  <p><strong>It will increase your centering and grounding power.</strong></p>  <p><strong>It will activate the connection</strong> between the energy moving inside you and in the outer space all around you. You will feel less separated, more at one.</p>  <p><strong>The course is primarily made for beginners</strong> experiencing with the body energy field at large or with the Qi Gong practice itself. It will give them a strong ground to then go on studying other styles of Qi Gong.</p>  <p>The exercises can be performed together or separately, repeating them 3, 6 or 9 times according to your feelings and to your need at the moment.</p>  <p><strong>Learning these movements is quick</strong> and possible to anybody who can stand for a while without too much difficulty. <strong>2 or 3 practice sessions</strong> for <strong>a total of</strong> <strong>a few hours</strong> should be enough to be able to execute the movements without having to think about what they are about and how to do them. Then the student will progressively get into the feeling. The general health condition of the \nbody-mind will be greatly improved with time and practice. Regularity \nwill enhance flexibility, inner strength and mental peace.</p><p>Mastering the way to conduct the energy in and out of the body takes of course a consistent practice over some longer time. </p><p>There is always more to discover and enjoy even when practicing such simple movements; but for maximum benefit, remember to let go of all expectations and to enjoy the present moment. </p>  <p><strong>The course includes:</strong></p>  <p><strong>ONE video - 6mn </strong>general introduction + <strong>5mn</strong> stepping into the practice. </p>  <p><strong>FIVE videos - </strong><strong>3  to 5</strong><strong> mn each - </strong>demonstrating the 5 movements<strong>, </strong>including general information, detailed explanations to improve your practice and <strong>downloadable PDF documents</strong> to further deepen your overall understanding of the Qi Gong practice. </p>  <p><strong>TWO videos -</strong> about <strong>9mn each - </strong>presenting the full sequence with a different atmosphere:<strong> \"Fire / Water\" mode. </strong></p>  <p><strong>ONE 3mn video </strong>rounding off the course where I share with you a bit more of my experience and understanding.</p><p><br></p>    <p><strong> </strong></p>", 
    "end_date": null, 
    "title": "Qi Gong  for Beginners / 5 Basic Movements ", 
    "price": "20.00", 
    "instructors": "Sonia Bruce", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/689638_3c60.jpg", 
    "course_url": "https://www.udemy.com/qi-gong-for-beginners-5-basic-movements/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-05T15:38:10Z"
}