{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t This course is an in-depth study into the practices of qi gong and Taoist meditation. Included are instructions for self-healing, stress reduction, energy enhancement, emotional balance, and spiritual insight. I’ve designed this program to give you lots of tools in your toolbox, tools that can take you from where you are to where you want to be—energetically, physically, emotionally, and spiritually.  </p>  <p>  \t There are three kinds of materials included in this course: written, video, and audio. The written materials are designed to combine historical, theoretical, and practical information in order to give you the map of the territory. Here, you will find explanations of the exercises and meditations found in the course’s video and audio components. In addition, you’ll find self-assessments, journaling exercises, and opportunities for reflection that will help you deepen your practice. As you go deeper into the material, you’ll be able to develop your own healing prescriptions simply by noting how your body, mind, and spirit respond to particular practices and meditations.  </p>  <p>  \t The video segments are designed to give you practical, everyday ways to utilize and dive into your qi gong practice. They are your workouts; they focus on the movement of the body as a way to circulate qi. These workouts use the body as a way to calm the mind, activate internal energy, and awaken spiritual energy for deep connection. The workouts in the video series should be used synergistically and as a way to cross-train.  </p>  <p>  \t The audio material serves as a deepening of your practice and as a complement to the videos. The videos are a great medium to experience and learn movements; the audio material is a great way to learn and be guided into the meditative aspects of the practice. Each session contains one or more guided meditations to deepen the spiritual aspects of your qi gong path.  </p>  <p>  \t Initially, you should follow the practices, both audio and video, in the order in which they’re presented. After that, you can use your own wisdom and the information gathered in your journaling exercises (using the online workbook provided with this course) to determine how to get the most out of the program. You may also wish to create a qi gong journal; that way, you can repeat the journaling exercises as often as you wish, and have space to create further practice plans.  </p>", 
    "end_date": null, 
    "title": "Qi Gong for Health and Healing by Lee Holden", 
    "price": "50.00", 
    "instructors": "Lee Holden, Sounds True", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/224498_b189_2.jpg", 
    "course_url": "https://www.udemy.com/qi-gong-for-health-and-healing/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-20T21:52:13Z"
}