{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Shibashi - or 18 stances - is a worldwide known qigong set, although the popularity of the higher numbered sets is not as large as set one, having followers in most countries around thte globe.  Some Instructors have made derivitive versions of the original, adding or taking away aspects as it suited; sometimes for esoterical reasons rather than functional.<br></p><p>Shibashi Set Three of the series, is a qigong set of 18 moves, simple to learn and perform but extremely effective for improving health. The seven sets of qigong were developed by Chinese master Lin Hou Sheng and comprise movements taken from qigong and Yang style tai chi forms.   This course shows you his way although as with all Qigong, once learnt, you're encouraged to make it your own by practising without comparison to the original.<br></p><p>Each move has specific purpose, which is to aid Qi movement around the meridians, thereby improving health and preventing illness in the same way as acupuncture.   Performed by everyday Chinese in groups, in China it is also prescribed by medical doctors as a means to healing. <br></p><p>This course is easy to follow via video and spoken narrative, with slow motion for more difficult aspects of the movement (where appropriate). The set can be learnt fairly quickly, however the student must practise regularly to improve the effectiveness of each movement.</p><p>In the East, people learn qigong for a variety of reasons; mostly because they already have a condition that they wish to help improve or they just wish to remain healthy.  In the West, it's popularity is surpassed by better known modalities such as yoga.  Unfortunately, a lot of people are missing out on the health benefits of qigong through a lack of understanding, to the extent it is becoming more well known but not to the same level as more established programmes.<br></p><p>In reality Qigong works as a preventative system of simple exercise that relaxes the body and mind, without the hard work and exhaustion of other exercise programmes.  It aims to unite body and mind, which the Western medicine system separates.  Chinese medicine focusses on the whole body and to that aim, Qigong movements are physically demanding but in an easy way.<br></p><p>For the less able (either through illnesss or age) Qigong can also be performed seated. Students are advised to seek advice from their GP before taking up any form of new exercise programme, however the majority of GP's advise their patients to start practise of tai chi (qigong) as it is recognised as a good way to exercise safely.</p><p><br></p><p><strong>NOTE</strong></p><p><strong></strong>Even though the student will work to their own limits, please note that this course has been notified \"intermediate\" due to the fact that the movements are physically demanding and may require beginners to practise other sets before undertaking them.</p>", 
    "end_date": null, 
    "title": "Qigong Shibashi Set Three", 
    "price": "50.00", 
    "instructors": "Andy Wright", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/769524_5969_3.jpg", 
    "course_url": "https://www.udemy.com/qigong-shibashi-set-three/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-21T14:14:39Z"
}