{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Shibashi set one is a qigong set of 18 moves, simple to learn and perform but extremely effective for improving health.  The sets were developed by Chinese master Lin Hou Sheng and comprise movements taken from qigong and Yang style tai chi forms.  They each have specific functions to improve qi movement around the meridians, thereby improving health and preventing illness in the same way as acupuncture.  </p><p style=\"\">The course is easy to follow via video and spoken narrative, with slow motion for more difficult aspects of the movement (where appropriate).  The set  can be learnt fairly quickly, however the student must practise regularly to improve the effectiveness of each movement.  </p><p style=\"\">People learn qigong for a  variety of reasons; mostly because they already have a condition that they wish to help improve, but in reality it works as a preventative system of simple exercise that relaxes the body and mind, without the hard work and exhaustion of other exercise programmes.  </p><p style=\"\">For the less able, it can also be performed seated.    Students are advised to seek advice from their GP before taking up any form of new exercise programme, however the majority of GP&#039;s advise their patients to start practise of tai chi (qigong) as it is recognised as a good way to exercise safely.</p>", 
    "end_date": null, 
    "title": "Qigong Shibashi Set One", 
    "price": "50.00", 
    "instructors": "Andy Wright", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/567172_ba4c.jpg", 
    "course_url": "https://www.udemy.com/qigong-shibashi-set-one/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-28T11:15:36Z"
}