{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn simple, easy to follow, self help massage and acupressure techniques, to release tension in your muscles. A practical approach ~ no medical terminology. I demonstrate everything slowly, on myself so that you can easily follow. </p><p>There are photos to highlight where the muscles are positioned. You will learn effective techniques that you can use anytime, while watching TV, in your lunch break or even sitting on the toilet!! Ideal to make them a part of your daily maintenance routine...like cleaning your teeth. </p><p>For problems that you have had for many years or months, be patient, they may just take a little longer to respond. Don't quit early, keep focused. The progress for most people is steady. Your muscles may feel numb or solid to start. Once they start to loosen, they may feel uncomfortable as your circulation improves. </p><p>That's when the real progress begins and you start to feel the benefits. If you use these methods regularly as an ongoing tool ~ you will be creating a healthy habit and keeping those pains away. No materials needed.. just yourself! The course has 8 lectures and takes 32mins in total.</p><p>We start by working on your thumbs, then hands and fingers, forearm, upper arm and shoulder, neck and head. The recap, helps you to understand how each section is connected to the next and the importance of posture and breathing.</p><p>The bonus ~ encouraging positive, uplifting, quirky, warm hearted messages... to make you smile. </p><p>If you use a computer daily, you need to know how to keep yourself comfortable.</p><p><strong>DISCLAIMER: This course should not be taken by anyone who has high/low blood pressure, heart problems, breathing difficulties, circulation problems, pregnant, unstable diabetes or any serious health issues. If you do, please contact your medical advisor for a more suitable treatment.</strong></p>", 
    "end_date": null, 
    "title": "Reduce computer or RSI muscle strain ~ feel great today!", 
    "price": "20.00", 
    "instructors": "Sarah Hewlett, Ben Hewlett", 
    "commitment": "22 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617190_18a5_2.jpg", 
    "course_url": "https://www.udemy.com/reduce-computer-or-rsi-muscle-strain-feel-great-today/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T12:09:50Z"
}