{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>In This Course Titled</strong></p><p><strong>Reduce alcohol enjoy life Hypnotherapy Hypnosis solution</strong></p><p><strong><em>All Files and videos are downloadable for easier access</em></strong></p><p>You are reading this it is because you have the desire to live a healthier happy life by reducing the amount of alcohol you drink. So how are you going to make those changes, by using the hidden power in your subconscious mind with natures gift of hypnosis.</p><p>I have created and recorded a hypnosis session for this course  to program your mind to focus on having a positive attitude to life by programming your mind with positive ideas for your benefit and also suggestions for having less desire to drink alcohol because there is so much joy in your life that you do not want to miss a bit.</p><p>You may say at this point that you don't have that much joy in your life so how can Hypnosis change that. Hypnosis will help you to change your perspective and allow you to see the joy in every aspect of your life so that you see your life more as living with a glass half full instead of half empty.</p><p>This course will do much more than just use suggestions while you are in Hypnosis because in the bonus section I will teach you how to use an easy to apply life changing technique EFT and once you have learned how to use EFT I will guide you through 3 EFT sessions.</p><p>One session is for letting go negative feelings or emotions another session will help you reduce cravings for alcohol and the last session will help you deal with any feelings of anger, this actually the most important EFT session as anger can be a sabotaging emotion and can keep you stuck in life because when you are angry at someone you actually keep them in your life instead of  letting go of them so you can move forward with your life leaving them in the past with the past.</p><p><strong>What I will teach you in this course</strong></p><p>1. You will begin by creating an image in your mind of what you want so that you will know where you are going and how your life will change when you are having a happier life.</p><p>2. Learn a secret feel good trigger that will help you through any bad times or set backs on your way.</p><p>3. learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</p><p>4. Learn how you naturally resist changes even changes that can be very good for you</p><p>5. Learn just how powerful words can be and their effect on you physically even if they are only self talk.</p><p>6. Learn who can and cannot be hypnotized</p><p>7.  Reduce Alcohol Intake Hypnosis MP3</p><p>9. How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings and improve your life with a special section on cravings in the FREE Ebook Emotional first aid on tap.</p><p><strong>EFT Sessions:</strong></p><p>Negative Emotions Session</p><p>EFT For No More Cravings</p><p>Eliminate Anger</p><p><strong>All Files and videos are downloadable for easier access</strong></p>", 
    "end_date": null, 
    "title": "Reduce alcohol enjoy life Hypnotherapy Hypnosis solution", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/500922_de61.jpg", 
    "course_url": "https://www.udemy.com/reduce-alcohol-enjoy-life-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-13T11:44:42Z"
}