{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Welcome to the course \"Relieve Back Pain Naturally with Acupressure and Exercises!\", the online training that will teach you simple physical exercises and acupressure tehniques that will help you get rid of your back pains or prevent them in a natural and beneficial way for you.</p><p><strong><em>Did you know that back pain is one of the top most common affections meet in the world right now?</em></strong> People from all over have back pains soone or later because of the lifestyle that we have. We don't exercise enough, we are stressed and frustrated, we sit a lot at the office and in the traffic and we adopt bad physical postures. All of these translate in back problems that can cause us horrible back pains.</p><p><strong><em>Medicine and other type of treatments should be the last resort and we should try to fix this problem from early stages in a natural manner and that is why we have created this amazing course for you.</em></strong></p><p><strong><em>This course will bring the best combined experience from two different fields, physical therapy and acupressure, in a 5 day simple to follow plan, so that you can resolve your back pain problems fast and effective from the comfort of your own home.</em></strong></p><p><strong><em>You will learn:</em></strong></p><ol><li><strong><em>10 Different types of physical exercises that will help you get rid of back pains.</em></strong></li><li><strong><em>How to get organized and have a routine so that you have long term results.</em></strong></li><li><strong><em>10 Different Acupressure tehniques to get rid of different types of back pains.</em></strong></li><li><strong><em>Acupressure tehnique for lower back pains</em></strong></li><li><strong><em>Acupressure tehnique for neck and chest pains</em></strong></li><li><strong><em>Acupressure tehnique for scoliosis</em></strong></li><li><strong><em>Acupressure tehnique for hand and feet numbness</em></strong></li><li><strong><em>A 5 Day Plan of Exercises that you can do from home</em></strong></li></ol><p><strong><em><br></em></strong></p><p>and more others...</p><ul><li>Lifetime Access to all other updates, SUPRISE BONUSES, Methods and System that appear and we will present in the course!</li><li>FULL Support thorugh the discussion area of the course!</li><li>30 Day Money Back GUARANTEE if you feel like this course didn't help you at all and you can't apply anything...that is how dedicated I am to your success!</li></ul><p><br></p><p><strong>So, what are you waiting for? Click the \"take this course\" button now ... <em>every day and hour you delay things are just geting worst</em><em>. </em>Enroll now and let's start improving your health today!</strong></p><p><br></p><p><em><strong>All the best,</strong></em></p><p><em><strong>Doctor Jakob Bargak and Therapist Adrian Gherghe</strong></em></p>", 
    "end_date": null, 
    "title": "Relieve Back Pain Naturally with Acupressure and Exercises!", 
    "price": "25.00", 
    "instructors": "Dr. Jakob Bargak, Adrian Gherghe", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654336_555a_2.jpg", 
    "course_url": "https://www.udemy.com/relieve-back-pain-naturally-with-acupressure-and-exercises/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T08:50:19Z"
}