{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>How can thoughts and dreaming slow the aging process?</strong></p><p><strong>How can you utilize your brain's power to remain young and healthy?</strong><br></p><p><strong>Learn How to Boost your Vitality Using Your Brain’s waves</strong><br></p><ul><li>Learn how your thoughts affect your health</li><li>Learn how to select positive thoughts in few minutes</li><li>Discover what are the 7 major anti-aging factors</li><li>Dream big and overcome your barriers to your happiness and further growth</li></ul><p><strong>By changing your perspective, you can live longer and healthier</strong></p><p>This course is designed for those who: </p><ul><li>feel older than they would like to</li><li>think that they are running out of time and energy to accomplish their dreams or -even      worse- have stopped dreaming</li><li>want to improve their health and happiness levels with the minimum effort</li></ul><p>The majority of health-related topics are focused at the benefits of a healthy diet and regular exercise. This course is unique because it is focused at the importance of the emotional well-being as a major anti-aging factor. Moreover, it shows practical mental exercises on how to retain your emotional well-being.</p><p>The course contains  short lectures and easy to follow exercises which anyone can do during a busy day. After listening to the introduction, you can actually continue with any lecture appeals to you. You will get the most out of the course though, if you repeat the suggested exercises on a daily basis.</p><p><strong>What will I need?</strong></p><p>The only tool you will need is your brain and your willingness to try new things.</p><p><strong>Why to take this course?</strong></p><p>You will learn:</p><ul><li>How our thoughts affect our health. </li><li>How to watch your thoughts and how to create the thoughts you want.</li><li>How to get rid of negative emotions by changing your body posture.</li><li>How to identify your obstacles for success and overcome them to create happiness.</li><li>How to forgive yourself for your mistakes, accept and love yourself. </li><li>What to do every day to remain young.</li></ul><p>Additionally, you will have:</p><ul><li>Free lifetime access to the course, future course updates and bonus material</li><li>Unconditional Udemy 30-day money back guarantee</li></ul><p><strong></strong></p><p><strong>Click the \"Take this course now\" button at the top right of the screen and enroll now!</strong></p><p><strong>Any minute you hesitate, you loose the chance to boost your vitality!</strong></p>", 
    "end_date": null, 
    "title": "Remain Young using These Brain Tips", 
    "price": "20.00", 
    "instructors": "Marina Prifti", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673378_1a5a_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-remain-young/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T14:46:30Z"
}