{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t      This is a practical course, with three fantastic stretching routines;  Morning, Daytime and Evening, which you can enjoy by stretching along to at home.  </p>  <p>  \t      You will love these simple and practical stretching exercises that are designed to open you up, lengthen you, improve your posture and help you to stretch out old tissue and habits that are not useful to you, leaving you taller, brighter, more energetic and shiny!  </p>  <p>  \t      You do not need prior experience of resistance stretching, just learn by doing, as I did, and have fun exploring the abilities of your body. You can enjoy working with your resistance for once, rather than trying to overcome it! One huge benefit of resistance stretching is that you can do it whether you are very inflexible or very flexible, each person's stretching session will give them just what they need.  </p>  <p>  \t      I created these programs from scratch just for this course and you will not find them anywhere else. I hope you enjoy these stretches, which are part of the         Revive Stretching™  technique (reviewed in Tatler, the Evening Standard and Fabric Magazine) created by myself. I have made this course so that more people can experience:  </p>  <ul>  \t<p>  \t\t      ·Improved posture  \t</p>  \t<p>  \t\t      ·Better energy levels  \t</p>  \t<p>  \t\t      ·More graceful movements  \t</p>  \t<p>  \t\t      ·Improved physical performance  \t</p>  \t<p>  \t\t      ·Greater mental clarity  \t</p>  \t<p>  \t\t      ·Better mood  \t</p>  </ul>  <p>  \t      I recommend that you do your daily stretching with the intention of enjoying yourself and your body, a desire to free yourself from old patterns rather than push yourself (especially not through pain) and use it as some high-quality “me-time\" that leaves you feeling happy and relaxed.  </p>  <p>  \t      Enjoy this course and please check out Revive Stretching for more information on our stretching!  </p>", 
    "end_date": null, 
    "title": "Resistance Stretching the Fascia to Boost your Flexibility", 
    "price": "40.00", 
    "instructors": "Suzanne Wylde (formerly Waterworth)", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434520_2a75_2.jpg", 
    "course_url": "https://www.udemy.com/resistance-stretching-for-great-posture-energy-and-vitality/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T22:24:39Z"
}