{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><strong>En este curso vas a aprender:</strong></p><ul><li>Por qué tu intestino se relaciona con todos los sistemas corporales y es la base de tu vitalidad</li><li>Cómo optimizar la salud digestiva con un protocolo natural</li><li>Cuál es la mejor dieta y los mejores suplementos para conseguirlo. Dónde conseguirlos y cómo tomarlos de forma responsable</li><li>En qué forma se relacionan nuestras hormonas y neurotransmisores con la salud intestinal...y ¡mucho más!</li></ul>El curso se dirige a todas aquellas personas interesadas en <strong>optimizar</strong> su salud intestinal. Se incluyen videos con <strong>presentaciones, documentos en word y pdf</strong> con detalles específicos de la dieta recomendada, los suplementos y los artículos científicos que respaldan la información que se presenta. <p><br>El estilo de presentación <strong>no es técnico sino didáctico </strong>ya que es muy importante entender los fundamentos para así llevarlos a cabo con mayor motivación. El curso tiene <strong>tres secciones principales</strong>:<br></p><ol><li>Fundamentos básicos y relaciones fisiológicas del sistema digestivo</li><li>El protocolo natural de 90 días para optimizar tu salud en detalle</li><li>Ideas adicionales para mejorar la digestión no sólo durante el protocolo sino para el resto de tu vida</li></ol>Si te interesa mejorar tu salud, este curso es para ti. Hace más de 2000 años Hipócrates, el padre de la medicina moderna, dijo que \"todas las enfermedades empiezan en el intestino.\" Por eso, cuidar de tu digestión y tu salud intestinal es crucial para tener vitalidad y longevidad. Invierte en tu salud y tendrás siempre el mejor retorno.", 
    "end_date": null, 
    "title": "SALUD DIGESTIVA: cómo optimizarla de forma natural", 
    "price": "25.00", 
    "instructors": "Guillermo Martín", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566440_d39a_3.jpg", 
    "course_url": "https://www.udemy.com/como-optimizar-tu-salud-digestiva/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T19:53:56Z"
}