{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn simple, easy to follow, self help massage and deep relaxation techniques, to release tension in your body and calm your mind. Preparing your self for a better night’s sleep. A practical approach ~ no medical terminology. I demonstrate everything on myself so that you can easily follow.</p>  <p>You will learn effective techniques that you can use during the evening, before you want to drop off to sleep or during the night, if you wake up then.  </p>    <p>I cover methods for releasing negative thoughts and developing more positive ones.</p>  <p>The importance of creating a peaceful, comfortable and attractive room space where you feel calm and can escape the outside world.</p>    <p>You will have a selection of tips to choose from, some will appeal to you more than others so try those first. </p>  <p>Find your favorites, make them part of your daily routine. Others to use, when you feel the need.</p>  <p>Keep practicing, it takes time to establish new habits. For sleep problems that you have had for many years or months, be patient with yourself. The progress for most people is steady. </p>    <p>You will need a chair and a bed, the towel and lotion are optional and a desire to spend time valuing and cherishing yourself.</p>    <p>The course has 9 lectures and takes about 30 mins.</p>  <p>The bonus ~ encouraging positive, uplifting, quirky, warm hearted messages... to make you smile. </p>        <p><strong>DISCLAIMER: This course should not be taken by anyone who has high/low blood pressure, heart problems, breathing difficulties, circulation problems, pregnant, unstable diabetes or any serious health issues. If you do, please contact your medical advisor for a more suitable treatment.</strong></p>  <p><strong></strong></p>  <p><strong>All my tips and suggestions I am sharing with you come from 1000’s of client’s feedback, that they are effective. I cannot guarantee 100% they will work for you.</strong></p>", 
    "end_date": null, 
    "title": "Sarah's Simple Solutions ~ top tips for better sleep tonight", 
    "price": "20.00", 
    "instructors": "Sarah Hewlett, Ben Hewlett", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636682_14a2_2.jpg", 
    "course_url": "https://www.udemy.com/sarahs-simple-solutions-top-tips-for-better-sleep-tonight/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-10T14:09:53Z"
}