{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Follow these strategies, tests and exercise programs to improve your posture.  </p><p><strong>Improving your posture can help reduce your neck and shoulder pain, allow your body to move more functionally and increase your confidence. </strong></p><ul><li>Understand What Causes Poor Posture</li><li>Tests to Isolate What's Causing Your Poor Posture</li><li>Exercise Programs to Help Fix Your Specific Issues </li><li>Tips You Can Use to Improve Your Posture in Everyday Life</li></ul><p><strong>A Step by Step Guide to Improve Your Posture</strong></p><p>Do you ever look in the mirror and wish you had better posture? Your poor posture may be having negative effects of your current and future quality of life. This course was designed to help you isolate what could be causing your poor posture and gives you the strategies you need to deal with each potential issue.   </p><p>This course offers a series of video lectures, a downloadable e-book, exercise programs, demonstrations and support material to make your learning experience as complete as possible. You'll learn the causes and effects of poor posture, the exercises and stretches that will help prevent it and much, much more. You won't need any background knowledge or exercise experience to excel in this course. All you need is the willingness to learn, to make behaviour changes and to exercise and be more active! Are you ready to look and feel stronger and more confident? Then let's get started!<br></p>", 
    "end_date": null, 
    "title": "Say Goodbye to Your Granny Shoulders", 
    "price": "20.00", 
    "instructors": "Jonathan Chant, Kyle Paterson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580186_5ff9_4.jpg", 
    "course_url": "https://www.udemy.com/say-goodbye-to-your-granny-shoulders/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T14:38:16Z"
}