{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\"Sound\" has be used in hospitals and clinics around the world to assist in killing cancer cells and breaking up kidney stones. AND... new research is pointing to music/sound as a healing modality to help with Parkinsons, Alzeimers, MS, Dystonia and more! </p><p>This course is about self-healing through sound... and can be used as a way to enhance wellness, personal growth, reduce stress and engage deeper healing. (Additionally this is the advanced training, which includes the first introductory course as well. So, you are getting both courses for the price of one!) </p><p>When you begin to learn about the various scientific aspects of sound, along with utilizing simple tools like deep breathing and mind-body awareness, you can begin to create a powerful setting for your physical, mental and emotional body and ignite a pathway to help you heal.</p><p>In this advanced course,<strong> </strong>I go deep into the subject of \"sound\" as a healing modality and give you several energy strategies you can apply immediately to help you enhance your healing journey. I also go over the science that explains why \"sound\" is a serious (and successful) modality to consider.</p><p><strong>You will have the opportunity to go through a full body sound healing session that includes 7 sound activities and come back to the course at anytime in order to use it again and again.</strong></p><p>By <strong>empowering</strong> ourselves to participate in our own healing, our physical, mental and emotional bodies are engaged in ways that can bring about <strong>incredible transformation</strong> if we just take the time to apply and use the information . . . <strong>allowing us to potentially create a life full of thriving and joy</strong>.</p><p><em>Give yourself a fresh start by enrolling in this life-changing course now.</em></p><p>Any updates to this course are always free and you have lifetime access.</p><p><strong><em>And ... there's a 30 day no questions asked, money back guarantee - my personal promise to ensure your satisfaction.</em></strong></p>", 
    "end_date": null, 
    "title": "Secrets of Sound for Self Healing (Advanced Course) ", 
    "price": "40.00", 
    "instructors": "Tam Katzin", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531836_1b05.jpg", 
    "course_url": "https://www.udemy.com/music-as-medicine-how-to-heal-yourself-with-sound-main/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T02:46:39Z"
}