{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Finally get someone to tell you the truth on how to reverse diabetes and live life the way it was meant to be lived.</p><p style=\"\">After this course you are never going to have to spend another dime on </p><ul style=\"\"><li style=\"\">insulin</li><li style=\"\">test stripes</li><li style=\"\">needles</li></ul><p style=\"\"></p><p style=\"\">I know this topic is controversial but if you listen and take this course it may take your life forever or your loved ones life.</p><p style=\"\">the kind of materials in this easy to watch course is going to blow your mind of how simple it is to live your life back to normal and reverse diabetes.</p><p style=\"\">this course will take  15-90 days to complete after you do everything that I tell you.</p><p style=\"\">even if you are a mess right now you can change everything right now and not be in risk of health problems.</p><p style=\"\">this course is only about 30 minutes long so you can take the information and put it into your life as soon as possible instead of having to read a 10 hour long book.</p><p style=\"\">this course is structured in a simple 1 2 formula that anyone can understand so this course is understandable for any age.</p><p style=\"\">The reason you should take this course is because if you have been suffering from diabetes and believe that is no cure for diabetes. This may be the turning point for your life. </p><p style=\"\">There is nothing to lose all the risk is on me. </p><p style=\"\">I am going to give you a 60 day money back guarantee if your health does not get better after you do everything that is in this easy step by step course.</p><p style=\"\">What you are about to learn with this course is not what the big companies want you to know.</p><p style=\"\"> Now what are you waiting for lets me help you reverse diabetes as soon as possible without all the lies.</p>", 
    "end_date": null, 
    "title": "Simple Guide On How To Reverse Diabetes Proven Diabetic Diet", 
    "price": "20.00", 
    "instructors": "Anthony Rico", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/492382_0f57_8.jpg", 
    "course_url": "https://www.udemy.com/secret-guide-on-how-to-reverse-diabetes-proven-diabetic-diet/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-03T06:38:45Z"
}