{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>New Lecture added April 12, 2016</p>\n\n<p>950+ Students enrolled and 15, 5* reviews!</p>\n\n<p>“<strong>Another superb\ncourse from Dr Paula</strong>.<strong>\n</strong>The exercises are demonstrated clearly, videos are of good\nquality, with Pdf chart for self-accountability, doable number of\nexercises. Overall, I am very pleased with the course because it is\nsomething that I can actually do! No info overload!” <strong>Maria Shellyn\nChua</strong></p>\n\n<p>“<strong>Great video for\npeople who need to sit for their jobs or studies</strong>. I can't\nrecommend Dr Paula's videos highly enough. If you are in an\nenvironment where you need to sit a lot and are feeling the effects\nof this (remember we are not meant to sit for hours at a time!) then\nthis course is definitely for you. Dr Paula is also very open to\nsuggestions and questions.” <strong>Monika Newman</strong><br></p>\n\n<p>“<strong>Wow! A Simple Yet\nEnergizing Workout</strong>. Paula said the program she teaches is so\nsimple you can’t fail. And she really delivers on that promise.\nThis course is fun, engaging, and truly energizing. The routines are\nshort, easy to follow, and you do not need to purchase any special\nequipment. There is a printout of the different routines, which helps\nyou remember the steps in each one. After taking this course, I now\nunderstand how to increase my energy and comfort levels while I am\nworking for hours at my computer. I highly recommend this course for\nanyone who has a job that requires a great deal of sitting.” <strong>Autumn\nGal</strong><br></p>\n\n<p>_____________________________________________________</p>\n\n<p><strong></strong><strong>Course Description</strong></p>\n\n<p>This online office exercise course will teach you how to sit less and move more, using <em>active</em> sitting.</p>\n\n<p>This course is designed to undo the damaging effects of prolonged sitting, even if you have little to no experience with exercise, and will help you feel more energetic, confident and attractive and even more successful at work!</p>\n\n<p>While there are plenty of fitness and/or posture courses that focus on specific styles or how to get rid of pain, it's hard to find a practical, usable course like this one, which specifically targets the needs of any desk-based office worker.</p>\n\n<p>This course is designed for all levels - those who want to address their sedentary lifestyles and improve their posture while they work.</p>\n\n<p>Click the \"take this course\" button, top right, now - every hour you delay is costing you your health!</p>", 
    "end_date": null, 
    "title": "Sit Less Move More - Office Desk Exercise To Improve Posture", 
    "price": "25.00", 
    "instructors": "Dr Paula Moore", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430228_26e5_3.jpg", 
    "course_url": "https://www.udemy.com/sit-less-move-more-office-desk-exercise-to-improve-posture/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T19:33:21Z"
}