{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em>Does your sleep suffer?  Do you struggle to get to sleep, or stay asleep?  Do you wake up tired?</em></p><p>If you answered \"<strong>yes</strong>\" to any of those questions then this is the course for you. </p><p>I used to suffer with bad sleep - for years! But by applying what I'm going to teach you in this course, you will learn the best ways to improve your sleep - naturally and safely. </p><p>By the end of this 2 hour course spread over 16 lectures you will know:</p><ul><li>Why we need sleep and what our sleep cycle is</li><li>What can prevent you from sleeping at your best</li><li>How to improve your sleep</li><li>Natural supplements that you can use to safely fall asleep</li><li>Natural techniques to improve your sleep</li></ul>You should take this course if:<ul><li>You have trouble falling asleep</li><li>You have trouble staying asleep</li><li>You wake up still feeling tired</li><li>You get tired during the day</li><li>You find yourself irritable or frustrated because of lack of energy</li></ul><p>Along with the core lectures, each video lecture has a supplementary summary pdf that you can download so you have the key points so you can apply them. </p><p>So, if you value your sleep (and therefore your health and energy), then I look forward to sharing with you the principles that took me years to understand but can help you in under 2 hours to get back to sleeping like a baby!</p>", 
    "end_date": null, 
    "title": "Sleep Better Tonight", 
    "price": "40.00", 
    "instructors": "Hari Kalymnios", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/575686_e6f0.jpg", 
    "course_url": "https://www.udemy.com/sleep-soundly/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-06T13:29:39Z"
}