{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<span>Stop smoking is a difficult task. You are going to encounter any kind of psychological and physical discomfort and this will make you more and more uncomfortable until your decision weakens and you finally restart smoking. These discomforts can be lightened recurring to appropriate quit smoking products. Quit Smoking Today are one of such products and a very popular one for many reasons.</span>  </p>  <p>  \tQuit Smoking Today tips many and varied are helpful if it’s important for you to quit smoking cold turkey, or to quit smoking naturally. These quit smoking today tips may be the support that will help put you in control of your quit and might make your quit a little easier. Which one(s) will help you kick the smoking habit?  </p>  <p>  \tTry to quit smoking and fail at least a dozen times and you start to become convinced that you have no control at all over those little white cylinders. The last thing you want to do is tell anyone you’re going to try to quit smoking “again”. That’s were I was when I accidently found the “switch” that turned off every desire I had for cigarettes like a light. And 4 easy to adopt mind-sets was all it took.  </p>  <p>  \tYou’ve finally made the ultimate decision to quit smoking and you’re nervous. You have doubts, but you know it’s important to quit. Learn the secrets to my success as well as some startling facts about the dangers of patches, pills, gums, lozenges and other chemical aids.  </p>", 
    "end_date": null, 
    "title": "Stop Smoking Today!", 
    "price": "25.00", 
    "instructors": "Dr. Sal Turhan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339130_7610_4.jpg", 
    "course_url": "https://www.udemy.com/guaranteed-stop-smoking-today/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T08:42:05Z"
}