{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Stop Leaking! 7 Surefire Steps to Stop Peeing Your Pants will teach you the techniques you need to use in order to stay dry and get through your day without leaking urine.</p><p>This course will teach you everything from creating a proper schedule  to developing a proper diet to effectively managing whatever level of incontinence you may be experiencing. </p><p>Incontinence is not just about wearing a diaper.  If you leak one drop of urine—or if you leak gas when you don’t mean to—you are incontinent.  This course will educate you on bladder, bowel and pelvic floor functioning so you can understand your body and help it to be the optimal environment you need to stay dry. </p><p>This course if for all levels.  Whether you are a young athlete, a new mom or in a silver sneakers exercise class, this course will help you to safely and effectively stop leaking!</p><p>You will learn the proper exercises from a highly credentialed expert.  This professionally filmed webinar will give you the visuals you need to understand pelvic functioning and how to exercise properly.</p><p>Learn what tools you can use while exercising to maximize safe and effective results.  Learn proper positioning as well mental tricks to help get you through your day without stressing about your bladder. </p><p>This course will take roughly 1 hour to complete.  Quizzes are included throughout.  Stop Leaking is full of practical information that you can immediately apply to your daily life to keep you dry and get you back to living a full life without fear of leaking. </p>", 
    "end_date": null, 
    "title": "Stop Leaking!", 
    "price": "30.00", 
    "instructors": "Denise Jagroo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664298_4f94_2.jpg", 
    "course_url": "https://www.udemy.com/stop-leaking/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T02:37:53Z"
}