{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><br></p><p><em><strong>All Files and videos are downloadable for easier access</strong></em></p><p><em><strong></strong>Did you Know that Hypnosis has been used for a long time as an easy method for habit a behavioural change smoking has always been the one habit that hypnosis helps to stop smokers from smoking without all that cold turkey and awful cravings that people have to battle to quit smoking.</em></p><p><em>Hypnosis is like a magical medicine when taken you don't need </em>will power or to battle cravings you just immediately become a natural non smoker. But not only that with so many people having so many excuses about when they should start to quit smoking or why they cant stop yet I have added a bonus Hypnosis MP3 to get you ready to stop smoking before you actually do quit. The great thing about having this MP3 is you can download it an listen to it when you have decided to stop smoking forever and ave a long healthy life.</p><p><strong>       Is it not time to stop paying for a shorter life </strong></p><p><strong><em>Here is What Happens When You Stop Smoking</em></strong></p><p><strong><em>Immediately Air around you no longer is dangerous to children and other adults.</em></strong></p><p><strong><em>20 minutes after quitting Blood pressure drops to normal.</em></strong></p><p><strong><em>Pulse rate drops to normal as you stop smoking</em></strong></p><p><strong><em>Temperature in hands and feet increases to normal.</em></strong></p><p><strong><em>after 8 hours not smoking Carbon monoxide level in blood drops to normal.</em></strong></p><p><strong><em>Oxygen level in blood increases to normal.</em></strong></p><p><strong><em>After 24 hours Chance of heart attack decreases.</em></strong></p><p><strong><em>After 48 hours Sense of smell and taste improves when you stop smoking</em></strong></p><p><strong><em>2 to 12 weeks Circulation improves.</em></strong></p><p><strong><em>as you stop smoking Breathing improves.</em></strong></p><p><strong><em>Walking becomes easier.</em></strong></p><p><strong><em>1 to 9 months Coughing and sinus congestion decreases.</em></strong></p><p><strong><em>Stop Smoking &amp; Shortness of breath decreases.</em></strong></p><p><strong><em>Overall energy increases.</em></strong></p><p><strong><em>Lungs increase ability to self-clean and reduce infection.</em></strong></p><p><strong><em>1 year Risk of premature coronary heart disease is half the risk of a smoker.</em></strong></p><p><strong><em>5 years Risk of stroke comparable to that of a nonsmoker.</em></strong></p><p><strong><em>10 years Life expectancy comparable to a nonsmoker.</em></strong></p><p><strong><em>Lung cancer death rate is about half the rate of a smoker.</em></strong></p><p>What I will teach you in this course </p><p>1. You will begin by creating an image in your mind of what you want so that you will know where you are going and how your life will change when you stop smoking</p><p>2. Learn a secret feel good trigger that will help you through any bad times or set backs on your way.</p><p>3. learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</p><p>4. Learn how you naturally resist changes even changes that can be very good for you</p><p>5. Learn just how powerful words can be and their effect on you physically even if they are only self talk.</p><p>6. Learn who can and cannot be hypnotized</p><p>7. Learn how you can have a feeling excellence any time you want to</p><p>8. Stop smoking bonus section </p><p>with a extra hypnosis session</p><p>Get ready to stop smoking Hypnosis session MP3</p><p>Stop smoking in 15 Minutes </p><p>9. How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings and improve your life with a special section on cravings in the FREE Ebook Emotional first aid on tap.</p><p>All Files and videos are downloadable for easier access</p>", 
    "end_date": null, 
    "title": "Stop smoking Fast track with quit in 15 minutes Hack added", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343280_c5c4_3.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-stop-smoking/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T14:56:31Z"
}