{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The Master Wong Tai Chi Chen Style Course is the next stage of learning within The Master Wong Tai Chi System. Chen style is much more physically challenging due to the continuous variations of speed, power &amp; body positioning from high to low.</p><p>This style of Tai Chi can be used to improve health, as well as used for Combat.</p><p> <strong>Over 70 EASY TO</strong> <strong>UNDERSTAND</strong> training videos <strong>GUARANTEED</strong> to teach you everything you need in order to master the first stage of this Ancient Chinese Art for health and Combat. </p><p>The course further develops your understand of the concepts of Yin and Yang for meditation and moves on to the basic movements and the form. By the end of this course you will have learned the 1<sup>st</sup> &amp; 2<sup>nd</sup> Cannon Fist Form of Tai chi. You will also cover basic combat application.</p><p>The user-friendly style of this production makes Master Wong your real life personal trainer! He is with you throughout each moment, every rep, every stance and exercise helping you to complete each task. Not all Tai Chi was created equal!  This modern realistic approach to training provided in HD, brings you the secrets of the ancient art of Tai Chi. This is your interactive step-by-step course, provided by Master Wong, making it easy for anyone, anywhere to learn Tai Chi.</p>", 
    "end_date": null, 
    "title": "Tai Chi Chen Style", 
    "price": "50.00", 
    "instructors": "SiFu Wong", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766422_eab4_2.jpg", 
    "course_url": "https://www.udemy.com/tai-chi-chen-style/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T10:58:21Z"
}