{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Ever wished you could control your sugar cravings, have more energy, be less cranky and shed some of those extra pounds, in short................RESIST, insulin resistance, without drugs or supplements ?</p><p>You know your SUGAR MUNCHING habits are not a recipe for optimum health and you&#039;re always FULL of remorse following a SUGAR BINGE.  You&#039;re not ready to give up sugar TOTALLY.  But, you&#039;re sick and tired of being a SLAVE to your sugar cravings and long to feel in control of what you&#039;re eating.</p><p>What if it stopped being a psychological battle of wills, that it was as simple as &quot;fixing&quot; the biology that drive the desire for sugar ?</p><p><strong style=\"\">This course combines the latest science, with a little fun, while introducing you to a range of easy to deploy biology-based weapons, that will help you take on your sugar gremlin and WIN.</strong></p><p>And, that&#039;s not all.</p><p>Because I want to make this as simple as possible for you, you&#039;ll also receive some great bonuses that are going to give you a huge leg up.</p><p>Including....</p><ul style=\"\"><li>cheat sheets, which will put you at a huge advantage, because they&#039;ll allow you to deploy the most appropriate weapon quickly and efficiently.</li><li>a sugar gremlin identi-kit, which will greatly increase your results, because when you can see your sugar gremlin clearly, it is a lot easier to take aim............... and blow it out of the water.</li><li>on going support, which is important because sugar gremlins cannot be obliterated, they&#039;re part of your biology. Taming your sugar gremlin will be an on-going process</li></ul>", 
    "end_date": null, 
    "title": "Tame your Sugar Gremlin", 
    "price": "20.00", 
    "instructors": "Sandy Evans", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465668_85e5_5.jpg", 
    "course_url": "https://www.udemy.com/tame-your-sugar-gremlin/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-02T07:57:21Z"
}