{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Moxibustion is an ancient healing therapy that originated in ancient China and is practiced in Traditional Chinese and Oriental medicine.  </strong><br></p>  <p>  \t  In this course you will learn about:  </p>  <ul><li>How you can use moxibustion to relieve pain, tension and tightness</li><li>How to use it safely and effectively</li><li>How to bring greater warmth and energy into the body for enhanced healing</li><li>How moxibustion works and when to use it</li><li>Where to get moxibustion supplies quickly and affordably</li><li>And much more..</li></ul>  \t              <p>  \t  Have you ever wanted to know more about and/or learn more techniques and methods from the ancient healing system of Traditional Chinese medicine (TCM) without having to enroll into an expensive college or university? Then this course is for you.  </p>  <p>  \t  If you are a massage therapist or natural medicine practitioner, this course will show you how to easily add moxibustion into your treatments to enhance results (and save your hands).  </p>  <p>  \tAt the completion of this course you can choose to receive a  \"Certificate of Completion\" that will count as 3 extra study hours which  you can then present to your preferred Association.  </p>  <p>  \t  Moxibustion is perfect for treating:  </p>  <ul><li>Tight and stiff shoulders and back</li><li>Lower back pain</li><li>Painful knees</li><li>Sore elbow and wrist joints</li><li>Digestive problems and digestive sluggishness</li><li>Cold body temperature</li><li>Overall lack of energy and fatigue</li></ul>  \t                <p>  \t  This is the exact same moxibustion course that I have taught to massage and Oriental medicine students in colleges and workshops in Australia.  </p>", 
    "end_date": null, 
    "title": "The Healing Art of Moxibustion For Beginners ", 
    "price": "30.00", 
    "instructors": "Michael Hetherington", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319816_90b4.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-moxibustion-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-15T00:18:33Z"
}