{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<span>Πόσες φορές σε έχει πιάσει πονοκέφαλος, πόνοι περιόδου ή κάποια πιο σοβαρή ασθένεια και δεν ξέρεις τι να κάνεις για να θεραπευτείς; Μέσα σου νιώθεις οτι όλα γίνονται για κάποιο λόγο;</span>  </p>  <p>  \tΣτο THE BODY θα μάθεις τον λόγο που το σώμα σου ασθενεί, αλλά δεν μένουμε μόνο εκεί. Η βαθιά γνώση που θα σου προσφέρει θα σε βοηθήσει να αποκωδικοποιήσεις όλο το σώμα σου και θα καταφέρεις να το φέρεις σε μια κατάσταση συνεχούς υγείας!  </p>  <p>  \tΣτην εκπαίδευσή του, μαθαίνεις ποιά είναι τα συναισθήματα που επηρεάζουν το σώμα σου και δημιουργούν την ασθένεια. Με το πέρας της εκπαίδευσής σου θα μπορείς χωρίς βιβλία, να αποκωδικοποιήσεις άμεσα και κατανοητά όλες τις ασθένειες ή τους τραυματισμούς και θα γνωρίσεις τι χρειάζεται να κάνεις για την ολοκληρωτική και άμεση θεραπεία τους!  </p>  <p>  \tΤα seminars είναι η ολιστική εκπαίδευση της Expansion Method, που συνδυάζοντας όλες τις επιστήμες, θεωρίες - μεθόδους καταφέρνουν την πλήρη κατανόηση της ανθρώπινης συμπεριφοράς, με σκοπό την άμεση και μόνιμη βελτίωση της καθημερινότητας.  </p>  <p>  \tΤο course που θα παρακολουθήσεις το έχουν ήδη ολοκληρώσει εκατοντάδες άτομα, σε μορφή σεμιναρίου, στην Ελλάδα με εκπληκτικά αποτελέσματα στην υγεία και στην καθημερινότητά τους!  </p>  <p>  \tΜε videos, animated presentations και παιχνιδιάρικα Quiz, η εκπαίδευση γίνεται παιχνίδι! Συνδυάζουμε την τεχνολογία και την τεχνογνωσία των πιο νέων τάσεων στην εκπαίδευση και πετυχαίνουμε να μεταφέρουμε όλες τις πληροφορίες χωρίς να χρειάζεται μελέτη, διάβασμα και προσπάθεια!  </p>  <p>  \tΗ διάρκεια της εκπαίδευσης είναι 5 ώρες περίπου. Προτείνεται να μην το παρακολουθήσεις σε μια μέρα. Οι πληροφορίες είναι συμπυκνωμένες και χρειάζονται χρόνο στην κατανόησή τους.  </p>  <p>  \tΤο THE BODY απευθύνεται σε όλους τους ανθρώπους που επιθυμούν τη βαθιά κατανόηση του σώματός τους.  </p>  <p>  \tΑν θέλεις:  </p>  <ul style=\"\">  \t<li style=\"\">Να γνωρίσεις πώς συνδυάζεται το συναίσθημα με το σώμα σου.</li>  \t<li style=\"\">Να κατανοήσεις τον λόγο ύπαρξης της κάθε ασθένειας.</li>  \t<li style=\"\">Να γνωρίσεις έναν νέο, αποκαλυπτικό και άκρως επαναστατικό τρόπο για να θεραπεύεσαι από <em style=\"\">κάθε</em> ασθένεια...</li>  </ul>  <p>  \t...τότε το The BODY είναι το καλύτερο σεμινάριο που μπορείς να βρεις online!  </p>  <p>  \tJoin the (R)evolution!  </p>", 
    "end_date": null, 
    "title": "The Body Basics: Release all Diseases", 
    "price": "50.00", 
    "instructors": "Argyris Stravelakis, Angeliki G. Arvaniti", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431830_80db.jpg", 
    "course_url": "https://www.udemy.com/thebodybasics/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T09:39:14Z"
}