{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Is this course for you?</strong>\n\n\n\n\n\n\n\n\n\n</p>\n\n<ul><li>As a busy professional, do you sit for the majority of your days?</li><li>Have you seen in the news that \"sitting is the new smoking\" and are you concerned as to what sitting is doing to your health?</li><li>Are you stiff and sore by the end of your day?</li><li>Do you suffer from low back pain, headaches, shoulder pain, or any other musculoskeletal conditions?</li><li>Has your doctor told you that you need to sit less or perform anti sitting stretches, but not sure where to start?</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">THEN SITTING SOLUTIONS FOR THE BUSY PROFESSIONAL IS FOR YOU!</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Are you a busy professional who sits in traffic on your way to work, works all day sitting in front of a computer, gets \nhome after dark and does not have the energy to do anything else but sit\n on the couch and watch T.V.? Has sitting all day, made you feel sluggish, and zapped your energy? Has your sitting job created health problems for you like weight gain or pain in your body? </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you answered yes to any of these questions you are absolutely not alone! The vast majority of us sit all day long and have no real way to fix the issue. You may have recently heard that \"sitting is the new smoking\" and can cause all kinds of health issues. <strong>But what in the heck are we supposed to do?</strong> Many of us have tried exercise as a way to counter act the effects of sitting only to get injured.  Fads, scary news, and the fact that life is just dang too busy can become extremely overwhelming, confusing, \nand stressful. At this point most people just give up because they have no idea where to start. Where DO you start? Who DO \nyou believe? It all becomes too overwhelming to even start at times.</p>\n\n\n\n<p>Sitting Solutions For The Busy Professional Make It Simple \nTo Give You Mastery Over Your Body, Reverse The Effects Of Sitting, Reduce Pain, Lower Risk Of Injury, And Have More Energy!\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><em class=\"redactor-inline-converted\">Confidently understand if sitting is affecting your body through an assessment system</em></li><li><em class=\"redactor-inline-converted\">Learn if sitting truly IS the new smoking</em></li><li><em class=\"redactor-inline-converted\">Easily find if you need to start at the 1. beginner 2. intermediate, or 3. advanced level</em></li><li><em class=\"redactor-inline-converted\">Learn the 5 minute \"fix\" that will reverse the effects of sitting on your body</em></li><li><em class=\"redactor-inline-converted\">Become confident in what your body can do when sitting is not an issue</em></li><li><em class=\"redactor-inline-converted\">Increase your balance, strength, and coordination</em></li><li><em class=\"redactor-inline-converted\">Learn the 30 second \"Pattern Interrupt\" that you can implement immediately to reset your body's patterns toward sitting</em></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">The Sitting Solutions For The Busy Professional, comes with the Udemy 30 Day 100% Money Back Guarantee.</em><em class=\"redactor-inline-converted\"> You have nothing to lose, EXCEPT THE STIFFNESS SITTING HAS CREATED!</em></strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Meet your teacher:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My name is Dr. Michael Weir, and I am a wellness based chiropractor \nwith over a decade in private practice, helping my busy, professional \npatients reach their fullest health potentials. My practice is in Bellevue, Washington home of Microsoft, Google, and Amazon, and the vast majority of my patients sit at a computer all day long, some for as many as 12 hours a day! I was recently asked what the main problem is that I help, and my answer was \"SITTING\". </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My back ground and post-doctorate education is in the field of \n\"chiropractic neurology\" and postural restoration. Poor posture has become an epidemic in our culture creating problems such as headaches, low back pain, mid back pain, shoulder discomfort and hip pain. Sitting is the main issue creating poor posture in our current culture. Not only does sitting create the poor posture related to pain, these postures are unsightly, make us look fatter than we actually are and reduce our overall confidence.</p>\n\n<p>One of the things that greatly separate me from some other teachers \nis that I am still in daily private practice working one on one with my \npatients just like you in the real world. These principles in the Sitting Solutions are the principles that I have been teaching my patients one on one, for the last 12 years. I understand the struggles of sitting, because I hear the struggles that my patients deal with on a daily basis.</p>\n\n<p><strong class=\"redactor-inline-converted\">Why did I create The Sitting Solutions for the Busy Professional?</strong></p>\n\n<p>After over a decade in dealing with the struggles my patients have with sitting I found that each person who sits for too long deals with very similar issues. I have taken 1000's of x-rays of these patients and found that each person presents with varying degrees of the same problem. I have also found that the correction of these problems is also very similar in each of these \"sitters\". These patterns lead me to develop the specific correction plans that make up The Sitting Solutions. </p>\n\n<p>This has become my expertise and I want to now give the gift of how to fix these issues to you. I have taken the education that I teach my patients on a one on one basis and recorded video of how to do each step of the process. This is a process that my patients will easily pay well over $1000 for. I want to make it accessible to anyone who sits the majority of their day.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What is The Sitting Solutions For The Busy Professional? </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Sitting Solutions is about demystifying the steps necessary to fix the damaging effects of sitting. You see it on Facebook, Twitter and even in the news now that sitting is bad for you, but they don't give you solutions for how to fix it. Some websites may give you a few ways to help with the sitting effects, but do not give the entire process which leaves you feeling \"half way put together\". Its four simple tools to help you fix your body in a \nsimple, uncomplicated way. Sitting Solutions gives \nyou the tools, the knowledge, and the motivation to make fixing your body  a \npart of your life.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why Sitting Solutions For The Busy Professional? </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I have found in over a decade private practice that if my busy \npatients did not make simple lifestyle changes there was no way that they would\n be able to 1) feel better and 2) even if they did start to feel better they had a terrible time sustaining those changes. That is why I \nwanted to make a program and a course that was easy to make into a life \nstyle. I wanted to make it something that you look forward to instead of\n dreading.These reutines should be very easy, take a short amount of time and be something that you need very little space for. It should also be something that you could do at the office with ease, and this is all what The Sitting Solutions does for you.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Don't forget that with The Sitting Solutions For The Busy Professional, you have the Udemy 30 Day 100% Money Back Guarantee!</em>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Is The Sitting Solutions For The Busy Professional Exercise Program?</strong></p>\n\n<p>Not in the traditional sense...The Sitting Solutions is more of a movement program designed to specifically counteract the effects of sitting on the body. There is no cardio, no weight lifting, but we will be doing some stretches, and some strength building to break the stiffness and muscle imbalances that sitting creates. <br></p>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">30 Day Trial of Sitting Solutions For Busy Professionals</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You really wouldn't believe how excited I am for you to join me in \nthis course, and bring your health and fitness to its greatest potential! I know though, that this course may not be for every one out \nthere. Every one is at a different point in their journey, so if you are\n for any reason unhappy with the results you are seeing from The Sitting Solutions I want you to find a program that is going to work for you. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So, if for any reason you aren't happy with the results you are \nseeing from The Sitting Solutions For The Busy Professional, you have the \nUdemy <em>30 Day 100% Money Back Guarantee.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So you have absolutely not one thing to lose...except maybe pain, stiffness, and that lack of energy!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Isn't it time that you finally moved past your battle with sitting, and live life you want to?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Join me today and together, we will find the SITTING SOLUTIONS!\n</p>", 
    "end_date": null, 
    "title": "The Sitting Solutions For The Busy Professional", 
    "price": "20.00", 
    "instructors": "Dr. Michael Weir", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/751432_3ba2_2.jpg", 
    "course_url": "https://www.udemy.com/the-sitting-solutions-for-the-busy-professional/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T17:07:21Z"
}