{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The Ultimate Weight Management Game Plan is a course about weight loss and weight management using psychology, science, observation and real world experience from a seasoned personal trainer who has helped countless people lose weight and keep it off. The course is structured in simple yet effective way to help you lose weight and keep it off.</p><p>Look at everything included in the course:</p><ul><li>A quick start plan to get started right away</li><li>50 tips and concepts to lose weight, and improve your health</li><li>How to come up with your own plan and vision for your health weight management</li><li>10 reasons why people fail and what to do instead</li><li>Quizzes and other fun work to inspire you to continue when things get challenging</li><li>Bonuses including example meal plans for weight loss</li><li>More bonuses including 10 easy exercises that almost anyone can do</li><li>How to make a vision board, make I am statements, how to set goals</li><li>Downloadable PDF's, power point, videos, and much more</li></ul><p>Who should take this course?</p><ul><li>Anyone who wants to lose weight</li><li>Anyone who wants help maintaining their current weight</li><li>Entrepreneurs, business owners, professionals, and moms who struggle with weight loss and are open and willing to go through and complete the course.</li></ul><p>Why take this course?</p><p>Jeremy Belter B.S. CPT has over 10 years full time personal training experience. After training over 15000 training sessions and helping busy people in the real world lose weight some common obstacles kept appearing. He helps you recognize these problems and gives steps to combat them. Finally, we do not just look at one thing but many different variables to combat the problem so you will never have to worry about weight again.</p>", 
    "end_date": null, 
    "title": "The Ultimate Weight Management Game Plan", 
    "price": "50.00", 
    "instructors": "Jeremy Belter BS, CPT, RBT", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/623176_47fd_3.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-weight-management-game-plan/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-26T17:37:39Z"
}