{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Effective, 100% natural solutions to smash your excess fat and eliminate disease and ailments. Without feeling deprived. Once and for all.</strong> </p><p>Imagine feeling like you are 15 again...</p><p>Imagine a life without aches, pains, excess weight and stiffness. </p><p>Imagine feeling desirable and beautiful again.</p><p>Have you ever seen a wild animal with gout, arthritis or obesity? Nope, neither have I.</p><p>So is it really normal for animals and humans to suffer from:</p><ul><li>Gout</li> <li>Infections</li> <li>Osteoporosis</li> <li>Diabetes</li> <li>Cancer</li><li>Excess weight</li> <li>Heart Disease? </li></ul><p><strong>Or are our lifestyles and food choices to blame?</strong></p><p><b>Choices</b>. Hm. Powerful word. <b>What choices have you made about your health</b>?</p><p>Do you bounce out of bed in the mornings, or do you continue pressing the snooze button for just a few more moments sleep? Are you able to get through the day without feeling fatigued?</p><p>Do you suffer from any ailments? Disease? Do you depend on caffeine to feel good?</p><p>Here's the good news: <b>you don't have to continue suffering</b>. But…</p><p>You have to make a choice. A choice to commit to doing what it takes to get healthy and to lose weight.</p><p><strong>And that is what this Alkaline Diet Lifestyle course is about. It's all about achieving your health goals so you can be the person you want to be.</strong></p><p>It's about eradicating:</p><ul><li>Illness</li> <li>Disease</li> <li>Weight</li></ul><p><strong></strong></p><p><strong>Check Out What Other Students Are Saying:</strong></p><p>\"<em>Ms. Tuchowska is a very passionate and talented expert in the Alkaline Diet way of life.</em></p><p><em>The course helped me expand my knowledge in the topic. I really like the instructor's emphasis on <strong>mindset</strong> and how easy it can actually be to implement a different health lifestyle with the proper mind. This will definitely help keep the motivation going throughout the journey.</em></p><p><em>I love the <strong>pdf exercises and bonuses</strong>. The instructor went above and beyond what I was expecting. To top it all up, she is very <strong>engaged in</strong> the forum and answers questions from students.</em></p><p><em>If you are trying to live a healthier lifestyle or looking for a certain diet. This course will help you <strong>achieve your goal</strong>. Worth the time and money</em>.\"- by Jonny Bell</p><p><strong></strong></p><p>     <strong>Get your health and wellness questions answered today!</strong></p><p>You can have the answers you've been searching for. Right now. But before you get those answers, you have to decide to do what it takes to achieve your goals. Because no one else is going to achieve them for you.</p><p> <strong>Have you been lied to?</strong> </p><p>Perhaps you suffer from fatigue, aches and pains, stiffness, or perhaps you would like to lose weight. </p><p>You've been to doctors, are taking health supplements, and for the life of you, just can't understand what's making you feel worse than you should be feeling.</p><p>Perhaps you feel that you are simply ageing, and you need to expect to feel not-so-good anymore.</p><p><b>Hogwash. </b><b></b></p><p>That's what the manufacturers of drugs and supplements want you to think so that you are forced to keep buying their products. So that they keep benefitting and you become dependent on their products. Not for your profit, but for theirs.</p><p><strong>If that's the case, you have the power to change it!</strong></p><p> Change your life with The Alkaline Diet Lifestyle </p><p><strong>The Alkaline Diet Lifestyle is no diet. It contains no theoretical fluff. If you follow the steps, this is what you can expect:</strong></p><ul><li>Feel happy and victorious when you lose weight and get healthy <strong>without dieting</strong>.</li> <li>Fulfillment is yours when you learn to<strong> think bette</strong><strong>r</strong> from the alkaline foods you eat.</li> <li>Arm yourself with scientific proof about the<strong> benefits</strong> of the alkaline diet.</li> <li><strong>Feel happy</strong> with yourself because you are finally eating the foods your body was created to eat.</li> <li>Enjoy<strong> delicious meals and snacks</strong> that are good for your body.</li> <li>Feel relief because there is<strong> no calorie counting</strong>, deprivation or diet mindsets.</li> <li>If you've struggled with being overweight for a while, you will feel hopeful again by learning how to change the way you think about<strong> food, fitness and health</strong>.</li> <li>Get and <strong>stay motivated</strong> to achieve your health goals.</li> <li>Victory is yours when you achieve your health goals.</li> <li>Learn how to <strong>change the mindset</strong> you've always had and which has always set you up for failure.</li> <li><strong>Heal</strong> your body, avoid disease and correct your weight.</li> <li>Live a simpler, cleaner life by using the practical tips of the <strong>Alkaline Diet Lifestyle</strong> course.</li> <li>You won't need to stress or feel guilty when you \"cheat\".</li></ul><p>Now of course you don't need to take my word for it. </p><p>   Why you're still overweight, unhappy, depressed and sick </p><p><strong>Dr. Robert O' Young, Director of Research at the pH Miracle Living Center, says that your fat may be protecting your very life against the acidity in your body. He goes on to make a bold statement that:</strong> </p><p>“There is only one disease: The Constant Acidification of the Body\".</p><p>What this means, is that every disease, including excess weight, is because of a body that is too acidic. </p><p> <strong>Your body is too acidic because of what you've put into it.</strong> </p><p>It makes sense that if you attend the root cause of the problem, by implementing a lifestyle rich in alkaline forming foods, it will naturally take care of what plagues you.</p><p>Claire is a 41 year old professional woman who suffered from obesity for many years. As a result of her overly acidic body from all the poor food choices she made, she experienced tremendous pain from gastric reflux, so much so that her doctor wanted to operate on her. </p><p>But once she started following an alkaline diet, she stopped having gastric reflux pain, began losing weight, all without feeling deprived. And she found more energy to get more done each day.</p><p>Read my students' reviews for more inspiration. </p><p>People who have changed their diets to an alkaline diet all experience huge benefits and there is plenty scientific proof to back it up. </p><p>It makes complete sense when you think about it: you would not throw soil or burgers into your car's engine if you wanted it to have long life. In the same way, we can't expect to throw junk into our mouths and think our bodies will respond kindly.</p><p><strong>The Alkaline Diet Lifestyle course is not about taking away the foods you love. Instead, it gently guides you to learn about:</strong></p><ul><li>What foods you should eat to achieve optimal health and to lose weight</li> <li>How to succeed at transformation</li> <li>How to make it all simple and easy</li><li>Create focus on foods that help you achieve your goals</li></ul><p>   <strong>But it's a waste of your money if…</strong> </p><p>The Alkaline Diet Lifestyle course will change your life. On the other hand, it will be a waste of your money if you don't decide to do what it takes to achieve your health goals. </p><p>All worthwhile results take work. Your success on this course is no different. It's all about choosing the path you want to take.</p><p> <strong>Frequently asked questions about the Alkaline Diet Lifestyle course:</strong></p><p><em>  -Do I have to give up my favorite foods?</em> </p><p>The course is not about dieting or eliminating your favorite foods. It's more about adding more of the good and learning how to make better food choices.</p><p><em>-What if the course doesn't help me to lose weight or doesn't heal my body?</em> </p><p>Every step in this course is used by me. I completely trust the process. There may be unusual cases where a person can't eat the way I recommend, but I have never personally come across them. If you follow the steps, and they don't work for you, you can always <b>get your money back</b>, so there really is no risk.</p><p>There are also times when a disease is too far advanced and you won't experience healing straight away, but it's worth a shot, isn't it?</p><p><em>-What do I need to do the course?</em> </p><p>Skip on over to the requirements below. That should answer your question.</p><p> <em>-How long will the course take me to complete?</em> </p><p>That all depends on how much you tackle each day. I would recommend going through it slowly though because achieving health is not a race. Rather take in everything you learn and absorb it before going on to the next section.</p><p>Some people take a few days to do the course and others a couple of weeks. Rest assured that once you've paid for it, you have <b>permanent access forever</b>.</p><p>If you're keen today, then don't delay until tomorrow. You could start ridding your body of excess weight, toxins, acids and disease <b>today</b>, and that's one step closer than yesterday.</p><p>And hey, the course comes with a guarantee, so if you're not happy, you have <b>30 days to get your money back</b>. No questions asked. </p><p>P.S: Don't wait. Don't you think you've waited for good health and permanent weight loss long enough? If you wait until tomorrow, you may never return. And 5 years from now, you'll just be sicker, more fatigued and fatter.</p>", 
    "end_date": null, 
    "title": "The Alkaline Diet Lifestyle in 7 Simple Steps", 
    "price": "40.00", 
    "instructors": "Marta Tuchowska", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443464_4046_2.jpg", 
    "course_url": "https://www.udemy.com/alkaline-diet-lifestyle/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T07:16:35Z"
}