{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Top Sleep Tips - Practical and Life Changing Sleep Advice</strong></p>\n\n<p><strong>\n</strong></p>\n\n<p><strong>Do you struggle to get to sleep at night, often wake up during your sleep, or feel tired and unrefreshed even after a whole night of sleep? Top Sleep Tips</strong><strong> is a practical programme designed to help you take control of your sleep to feel your absolute best every day. If you're finding a lack of quality sleep is affecting your mood, productivity, weight, and happiness, then this course will CHANGE YOUR LIFE. </strong></p>\n\n<p>This course is absolutely packed full of practical, budget friendly, and tried and tested advice. Overcoming insomnia need not be complicated or expensive, and by following a few simple changes you will see a dramatic improvement in your sleep quality and overall energy levels. It covers everything you could need: from choosing 'sleep friendly' foods, adapting your exercise routine, incorporating mediation and relaxation techniques, choosing between medicinal and complementary treatments, and so so much more. It looks at lots of real life examples and gives practical tools you can use right away to get better results.</p>\n\n<p>Pat Duckworth is an international speaker, and widely published author, who's been teaching Sleep Techniques in workshops and one-on-one to thousands of people over recent years. She specialises in women's health and is a regular guest at the WI and on BBC Cambridgeshire Radio. This course is guaranteed to keep you engaged and amused, and teach you life changing skills for feeling fantastic.<br></p>\n\n<p>The course overview includes:</p>\n\n<ul><li>Discover foods that can dramatically increase your energy levels, and ease of falling to sleep</li><li>What to do if you wake up in the night</li><li>How to overcome insomnia</li><li>Using relaxation and meditation techniques</li><li>Choosing between medicinal and complementary treatments</li><li>Revamping your bedroom envrionment to make it soothing and calm</li><li>How sleep work and why it doesn't always</li><li>Keeping a sleep journal to track down the source</li><li>Adapting your diet to help your body ease into sleep</li><li>And lots lots more!</li></ul>\n\n<p>Start taking control of your sleep patterns say goodbye to stress, fatigue and unhappiness. This course could change your life.... if you let it!</p>", 
    "end_date": null, 
    "title": "Top Sleep Tips: Practical and Life Changing Sleep Advice", 
    "price": "20.00", 
    "instructors": "Pat Duckworth, Louise Croft", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/839362_7005.jpg", 
    "course_url": "https://www.udemy.com/top-sleep-tips/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-04T11:32:43Z"
}