{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn what <strong style=\"\">healthy</strong> muscle really is; why fitness with weights does not build or maintain <strong style=\"\">healthy</strong> muscle tissue; and the motivations and end results of this form of muscular abuse.</p><p><strong style=\"\">Understand The Long Lasting Damage to Muscle Tissue and the Body From Weight Lifting.</strong> </p> <ul style=\"\"><li>Learn why fitness with weights produces unhealthy muscle</li> <li>Recognize the motivators of muscular abuse</li> <li>Find options for improving muscular health</li> <li>Learn the best way to prevent muscular pain as you age</li></ul> <p><strong style=\"\">Healthy Muscle Fitness In An Age of Fad Fitness </strong></p><p>The body building and fitness industries have been telling us for years that what they recommend is the right thing or the best thing for maintaining or achieving the ultimate in fitness. Yet they ignore muscular health in favor of an image of physical strength and perfection.</p><p>We&#039;re going to examine if this image really represents muscular perfection and what the overall cost of this alleged perfection is. We will also take a look at what happens to the muscles during weight lifting and determine how and if strength is really achieved.</p><p>This course is can easily be understood by beginners to the fitness and health arena. I designed this course because there are a lot of people working out in gyms with weights, or considering this as a form of exercise for fitness. Additionally, there are a lot of businesses in the fitness arena selling the idea that to be fit, you must either be hard, or have bulging muscles. I disagree. I think people should be given as much information as possible when deciding if a lifestyle choice is the right one for them, especially when their health and well-being is involved.</p><p>In the first place, how much do we all really know about the muscles, other than what these “fitness gurus&quot; tell us? And aren&#039;t they trying to sell their products or memberships? The question is, are we really being given <strong style=\"\">all</strong> the info? These people have been telling us for years that what they recommend is the right thing or the best thing for maintaining or achieving the ultimate in fitness.</p><p>However, what if they are wrong? What if what we have been programmed to believe is harmful in some way? What then? Don&#039;t we have the right, as a society to get that information? I believe we do, but no one is connecting the dots. No one is out there telling us any different. For instance, do you even know what the definition of healthy muscle is? This course will tell you that. This course asks the questions that have not been asked by the purveyors of “muscle fitness,&quot; and examines a side of this issue that people seldom see or are even aware of.</p>", 
    "end_date": null, 
    "title": "Top Reasons Why Fitness with Weights is Unhealthy.", 
    "price": "30.00", 
    "instructors": "Sandra M Urquhart", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/488744_1c0e.jpg", 
    "course_url": "https://www.udemy.com/top-reasons-why-fitness-with-weights-is-unhealthy/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-28T17:42:46Z"
}