{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong>Update</strong>: Over 200 students in under 12 hours of going live!! Join the Get Fit, Get Smart Revolution today!!!!<br>  </p>  <p>  \t_______________________________________________________________________  </p>  <p>  \tDo you suffer with symptoms of depression and anxiety? Do you feel the blues? Feel nervous before big events? These are the silent killers of the braina nd body but they don&#039;t have to be!  </p>  <p>  \t  Exercise and movement are the secret keys to dealing with these issues (in addition to whole host of other health conditions) but nobody is telling us how it works?  </p>  <p>  \t  Our brains and hearts have neurological growth factors that become amazing brain boosters that flood our bodies and minds.  </p>  <p>  \t  These brain boosters can even reverese the effects of stress!  </p>  <p>  \t  Learn how to treat depression, anxiety, get fit, get smart and get healthy all through movement!  </p>  <p>  \t  Learn about the exciting new research coming out of the top universities in the world, including Harvard!  </p>  <p>  \t  Learn what no doctor in the world will tell you!  </p>  <p>  \t  Learn how to save your own life, boost your brain and live a healthy life!  </p>  <p>  \t  This course will show you HOW these brain boosters work, what they can do for you and how exercise can help boost your brain!  </p>  <p>  \t  Supported by a wealth of research!  </p>  <p>  \t  Resources on how to tackel fitness now matter how you prefer to do it!  </p>  <p>  \t  No gym, no problem! Bodybuilding? There&#039;s a great book for that! Want to learn the secrets of exercising properly? I will show you the best resource for that!  </p>  <p>  \t  I have a personal knowledge of both physical and psychological problems people face every day. I have a degree in psychology with a background in clinical neuroscience. I&#039;m also a certified life coach and an ISSA fitness trainer with almost ten years of training experience myself. I was once classified as overweight, suffered with depression/anxiety, had high blood pressure  - I even almost had brain surgery! Exercise and my devotion to fitness is what helped me crawl out of that dark place and lose 50 pounds. I saved my own life and hel become a better me!  </p>  <p>  \t  You can too!  </p>  <p>  \t  I&#039;m here to help and want to share my knowledge!  </p>  <p>  \t  Take this course and be armed with all the knowledge and motivation for fitness you will ever need!  </p>", 
    "end_date": null, 
    "title": "Treat Depression and Anxiety With Exercise!", 
    "price": "20.00", 
    "instructors": "Louis Lakatos", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358800_fe4b.jpg", 
    "course_url": "https://www.udemy.com/treat-depression-and-anxiety-with-exercise/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-29T01:24:16Z"
}