{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">  What is this course about?  </strong>  </p>  <p style=\"\">  \t       This course is only suitable for people suffering from Meniere’s disease, benign paroxysmal positional vertigo (idiopathic vertigo). You will be able to self-diagnose what type of vertigo you suffer from according to Traditional Chinese Medicine (TCM). You will understand what causes vertigo according to TCM. You will know how to use the best combination of acupressure points to get rid of your vertigo.  </p>  <p style=\"\">  \t<strong style=\"\">Who SHOULD TAKE this course? </strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>Are you frustrated because of feeling dizzy, lightheaded, foggy, and woozy?  </p>  <p style=\"\">  \t      Do you feel unbalanced when walking, have a ringing sound in your ears, and have nausea or even vomiting?  </p>  <p style=\"\">  \t      Do you feel annoyed that your life is miserable because of vertigo?  </p>  <p style=\"\">  \t      Have you been very upset that no one seems to be able to get rid of your dizziness or Meniere’s disease, even your doctor and specialist?  </p>  <p style=\"\">  \t      This course is designed for anyone who suffers from vertigo, whether you have been diagnosed with benign paroxysmal positional vertigo (idiopathic vertigo), Meniere’s disease.  </p>  <p style=\"\">  \t      You may have done a lot of western treatment or other alternative treatments such as osteopathic/homoeopathic/chiropractic/physiotherapy/vertigo specialist/acupuncture and have experienced only minor results, or with a good result in the beginning but not continuing, or without any results at all. Then this course is for you.  </p>  <p style=\"\">  \t      My purpose is to help as many people as I can. But I understand that not everyone is suited for my course, so who should not take this course?  </p>  <p style=\"\">  \t<strong style=\"\">Who SHOULD NOT take this course</strong>:  </p>  <p style=\"\">  \t      This course will involve a lot of practical hands on “do it yourself” treatment - at least a 3 month plan of 30 to 60 minutes per day of self-treatment - so don’t take this course if you:  </p>  <p style=\"\">  \t      * Expect someone to do all the work for you and are not prepared to take action NOW.  </p>  <p style=\"\">  \t      * Plan on sitting through the course with your arms folded not being actively engaged in the course.  </p>  <p style=\"\">  \t      * Are not prepared to change, try new things and new ideas.  </p>  <p style=\"\">  \t      * Have not got an open mind to alternative treatment.  </p>  <p style=\"\">  \t      * Only believe in western medicine.  </p>  <p style=\"\">  \t       * Have a negative attitude and think that the world is conspiring against you and holding you back from the health and wellbeing that you deserve.  </p>  <p style=\"\">  \t<strong style=\"\">What will you need to know or do before starting the course?</strong>  </p>  <p style=\"\">  \t      This course contains over 95 lectures and 4.5 hours of content. It&#039;s designed for anyone who Meniere’s disease, benign paroxysmal positional vertigo (idiopathic vertigo), who wishes to get rid of their vertigo.  You will need a pen which you will use to learn to draw and locate some meridians on your hands and legs. You will need one or two heat packs. I will let you know how big you need to get or make it yourself. All the acupressure points are done by your hands or you could find some massage device (optional).  </p>  <p style=\"\">  \t<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">How much do I normally will you pay if you come to see me?</strong>  </p>  <p style=\"\">  \t      I normally charge $135 NZD for first consultation and follow up treatment for $95 NZD, 3 treatments weekly for at least 12 weeks, which normally will cost you $3830 NZD (it&#039;s about $3000 USD). But today you only pay $299 USD to get this course, you SAVE about $2700 USD.  </p>  <p style=\"\">  \t      I know you are taking a risk in buying this “Acupressure to Get Rid of Vertigo at Home” course. You pay your money upfront, you spend your time to learn, and you might worry about the possibility that it is not the right thing for you.  </p>  <p style=\"\">  \t<strong style=\"\">Here is my GUARANTEE to you:</strong>  </p>  <p style=\"\">  \t      To remove that risk, I am offering you a <strong style=\"\">GUARANTEE</strong>: if, at the end of the course, you are not comfortable with my program, or you think you did not learn anything in my course, or you just can’t perform these techniques, or for any other reasons, you can have your money back within 30 days. You can keep all my text copies that you download and a lifetime account to access to my “Learn Acupressure Points for Wellbeing at Home”, which will be published in June 2015.  </p>", 
    "end_date": null, 
    "title": "Vertigo Treatment: DIY Get Rid of Vertigo at Home. ", 
    "price": "45.00", 
    "instructors": "Szenan Phua", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387568_6c29_2.jpg", 
    "course_url": "https://www.udemy.com/acupressure-to-get-rid-of-vertigo-at-home-guarantee/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T11:27:37Z"
}