{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong>Unique Advanced Healing 8 Hour Course To Complement any Wellness Plan</strong>  </p>  <p style=\"\">  \t        A highly effective educational approach to optimize immunity, super charge inner power and remove any hidden obstacles preventing us from living our dreams. Proven to dramatically lower the risk of developing common illness, discover why so many describe the Voyage to Betterment as the best thing that ever happened to them. Designed with critical point analysis to focus on the critical elements without fluff, this 8 hour class has more value than many 4 year University health educations, yet can be done in a day.</p><p style=\"\">Originally a 16 hour online course, it has been reworked and condensed to 8 hours of mainly video so that students can view it all in one day if they wish. There is no need for strenuous work either. Students benefit simply by viewing videos and being part of the field.</p><p style=\"\">3 Simple Steps to Complete this Online Class:</p>  <p style=\"\">  \t              1. View and listen to about 8 hours of entertaining and educational video including: </p><p style=\"\">a) The original Voyage to Betterment Film, now available only in this class </p><p style=\"\">b) The Voyage to Betterment Nutrition &amp; Cooking Class Video Workshop, </p><p style=\"\">c) The Voyage to Betterment Full Day Workshops filmed in front of a live audience </p><p style=\"\">2. Read the 30 page student guide &amp; implement the lifestyle recommendations one wishes.<br></p>  <p style=\"\">  \t              3. Do the Homework: A daily 10 minute contemplative practice for 90 days.  </p>  <p style=\"\"><strong>  \t              That's it. Simple and Proven Effective. </strong></p><p style=\"\">Join over 20,000 that have already jumped on board the Voyage to Betterment.  </p>  <p style=\"\">  \t<strong>This Wellness Class</strong> has evolved over 17 years at a cost exceeding a half million dollars. The content was first revealed in the 2009 film Voyage to Betterment with Doctors T Colin Campbell, Neal Barnard MD &amp; David R Hawkins MD, then tested on 400 people in the Body Mind Spirit Challenge in 2013. Before &amp; after blood &amp; stress tests show the work effective at optimizing well being &amp; dramatically reducing stress &amp; illness.  </p>  <p style=\"\">  \t<strong>This Online Course is updated</strong> &amp; includes Andrew's recent collaboration with a woman who is now 95 &amp; remains sharp as a whip. The understanding and application of her discovery of a hidden order of the Universe in Nutrition alone, will allow students taking this course to be 30 years ahead of the latest and greatest in Nutrition. The value of her work did not elude David R Hawkins MD. He said that she made an important discovery that corroborated his 45 years of clinical experience and confirmed it was decades ahead of its time.  One day it will likely change the face of nutrition &amp; medicine. There is no need to wait until the Scientific community discover and validate her work. Students can discover how to implement her discovery to maximize immunity right now in this wellness class.  </p>  <p style=\"\">  \t<strong>Lifestyle Freedom:</strong> The course supports your freedom to eat, exercise &amp; believe whatever you wish. What you believe matters most because that is what will affect you.  </p>  <p style=\"\">  \t<strong>Every individual is unique and so it is imperative that students use their own discretion prior to following any recommendations. Please do not take this class if you are not prepared to take full responsibility for your own level of health and happiness. Prior to making any changes to lifestyle seek the advice of your doctor.</strong>  </p>", 
    "end_date": null, 
    "title": "Voyage To Betterment Wellness Class", 
    "price": "50.00", 
    "instructors": "Mr Andrew Facca", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/144754_055b_9.jpg", 
    "course_url": "https://www.udemy.com/voyagetobetterment/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-09T20:37:00Z"
}