{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong><em> </em></strong><strong><em>Weight Loss – Big Secret</em></strong></p>  <p><strong><em>You’ve heard a lot of bad publicity about weight loss and fitness. But here’s something you may not have known.</em></strong></p><p><strong><em>________________________________________________________________________</em></strong></p>    <p><em>Why is this weight loss program different from others </em><em>and Why should I believe it will work?</em></p>  <p>I must admit that there are 1000’s of weight loss programs and ideas on how to shed those unwanted fatty parts of the body. Some of which will be good and many are just plain harmful. One of the reasons why my weight loss program is ideal for most people is that it leans heavily on using the natural body movements with long-term approaches to achieve results. It does not promise you a 1-week result without any effort. But it is perfect for those who have not done much for so many years and want to start. Plus those who have gone through the yo-yo periods of dieting and weight loss programs will also find it useful.</p><p>________________________________________________________________________</p>    <p><em>What is the proof that it has worked?</em> </p>  <p>Everything I have spoken to people who have lost weight and continue to maintain their weight I have been fascinated by how they all seem to enjoy the process, look great and confident they can continue. Whenever I have asked how they have arrived at their ideal weight and attitude the response has always been the same; it take long term consistent effort. Here lies one of the big secrets. We used to think some were either born to look trim whiles other were born to be overweight but the truth is that anyone can change the way they look by consistent, action towards a goal. Sooner or later you will get there. Hence, the program detailed in the course is to help you achieve the weight they want by starting with a small habit that will propel you towards the destination you want! That is what has helped me to lose weight nad continue to help me.</p><p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>  <p><strong> So what is required:</strong> </p>  <p>It doesn’t require you to be very fit when you start because the program is tailored to help you wherever you are starting from.</p>  <p>It doesn’t require to know the right techniques. I will be giving you all you need to know to get you started. The rest can be learned as you go on,</p>  <p>It doesn’t require “luck.” But taking small steps that will help you enter in new habit that ensure you enjoy the process</p>  <p>It doesn’t require “talent.” Just the determination to change and be better</p><p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>    <p><strong>In this course we will cover:</strong></p>  <ul><li>The proof that my program works</li></ul>  <ul><li>Reasons you should exercise</li><li>The Role of food and water</li><li>How affirmation will help you</li><li>Why going the gym did not work for me</li><li>Why dieting can be harmful</li><li>Biggest exercise mistakes</li><li>My 12 Months Exercise Program</li><li>Resources / Updates / Reviews</li></ul>                <p>Remember I Am Here To Help You!</p><p>========================================================================</p>  <p><strong><em>Important information before you enroll:</em></strong><br></p>  <ul><li>You are covered by<strong> a 30-day money back guarantee, full refund, no questions asked!</strong></li><li>You also have <strong>unlimited, lifetime access to the course!</strong></li><li>You will enjoy<strong> free access to any updates I will provide</strong></li><li>You are free to<strong> ask any questions and will get a reply as soon as possible</strong></li></ul><p><strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p><p><strong>So what are you waiting for?</strong></p><p><strong>Every delay is a barrier stopping you from feeling good and looking great. Sign Up Now!</strong></p><p><strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p>", 
    "end_date": null, 
    "title": "Weight Loss - The Untold Story", 
    "price": "50.00", 
    "instructors": "Boomy Tokan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/717472_932a.jpg", 
    "course_url": "https://www.udemy.com/weight-loss-big-secret/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-05T19:28:37Z"
}