{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>X3pure is the first online, confidential, streaming-video solution for men dealing with sexual addiction. This workshop provides you with the \r\nabsolute fundamentals for understanding compulsive sexual behaviors like\r\n masturbation, pornography use, extra-marital/pre-marital sex, or \r\nvisiting strip clubs or prostitutes. Easy to understand and accessible, \r\nyou can log on to this 30-day program from any internet-connected \r\ncomputer or mobile product (with internet browser) at any time.</p><p>There are 15 workshops lasting between 15-25 minutes.&nbsp; A downloadable companion workbook with 15 lesson exercises comes with the course.&nbsp; <br></p><p>The primary objective of X3pure is to enable a speedy and effective \r\nrecovery for people dealing with internet pornography&nbsp;and other \r\nsex-related addictions in the most confidential and professional manner \r\npossible.&nbsp; <strong>**This is a single-user workshop.**&nbsp; If you are looking for a small group curriculum for multiple users please check out the </strong><a href=\"http://xxxchurch.shopsilentempire.com/product/344/x3_pure_men\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">small group kits here. </a> </p><p>While sexual addiction is not a religious-only or Christian-only \r\nproblem, these workshops have been authored by a Christian but can be \r\nviewed by people of all religions or of no religious belief.</p>\r\n<p>Additionally, the program was created by a team of people who \r\nunderstand what you are going through--and specifically the unbelievable\r\n barriers to getting help. We understand the need for confidentiality \r\nand the need for a program that can help without you having to tell four\r\n different people that you need help.</p><p><br><strong></strong></p>\r\n", 
    "end_date": null, 
    "title": "X3pure - 30 days to purity.", 
    "price": "50.00", 
    "instructors": "Jake Larson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/35222_fa52_5.jpg", 
    "course_url": "https://www.udemy.com/x3pure-30-days-to-purity/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-08T22:07:53Z"
}