{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Добро пожаловать в третью часть Школы Акупрессуры - лучшее место на Udemy, чтобы узнать об акупрессуре! </p><p>√ Справьтесь с болями самостоятельно без медикаментов при помощи китайских точек массажа</p><p>√ Легко найдите нужные точки, пользуясь короткими и доступными Full HD видеоклипами</p><p>√ Курс изучает точки для воздействия на астму, депрессию, потенцию и простуду.</p><p>√ Курс изучает точки для улучшения здоровья в путешествиях и общего состояния памяти.</p><p>√ Курс изучает точки для улучшения показателей бега, игры в футбол и занятий йогой.</p><p>√ Курс изучает точки для предотвращения заражения Эболой.</p><p>\"В двух словах, она [Акупрессура] обеспечивает максимальную пользу без риска возникновения побочных эффектов, свойственных многим подходам классической медицины.\" </p><p>-Уильям Майкл Каргайл, бакалавр наук, доктор хиропрактики, F.I.A.C.A., Председатель отдела исследований Американской ассоциации акупунктуры и восточной медицины</p><p>Акупрессура на каждый день - это прекрасно подходящий для Вас метод лечения. Используйте его при помощи данного курса. Тогда:</p><p>+ Вам больше не понадобятся требующие много времени визиты к врачу.</p><p>+ Не понадобятся ощутимые денежные затраты.</p><p>+ Отпадёт опасность внесения инфекции, повреждений тела или болей.</p><p>+ Вы мягко массируете точки пальцем руки. </p><p>Предлагаемые точки массажа:</p><p>+ Особенно эффективны</p><p>+ Находятся легко и без посторонней помощи</p><p>+ Представлены в профессиональных и высококачественных Full HD видеоклипов</p><p>\"Благодаря курсу я смогла значительно снизить влияние депрессии! Благодаря видео, поиск точек не составляет большого труда. Я счастлива, что курс всегда со мной, на моем iPhone и iPad\"</p><p>-Доктор Умин, Менеджер в компании Siemens, Германия</p><p>Тысячи людей уже используют этот курс. Теперь Вы тоже можете им воспользоваться и помочь себе без медикаментов и визитов к врачу.</p><p>За малую долю цены одного визита к врачу, вы навсегда получаете проверенный опытом и временем курс акупрессуры, с бесплатными обновлениями, которые будут содержать новые массажные точки. </p><p><span></span>Проводите время весело, изучая курс! ПРИСОЕДИНЯЙТЕСЬ ПРЯМО СЕЙЧАС!</p><p>Ваш доктор Баргак</p><p><span></span>- 30 лет успешной практики в акупрессуре</p><p><span></span>У вас есть вопросы? Не стесняйтесь писать мне в Facebook - просто введите Dr. Bargak в поисковую строку</p>", 
    "end_date": null, 
    "title": "Школа акупрессуры - ваше здоровье и точки для массажа, ч. 3", 
    "price": "30.00", 
    "instructors": "Dr. Jakob Bargak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527014_133e.jpg", 
    "course_url": "https://www.udemy.com/acupressure-academy-part-3-chinese-massage-points/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-12T19:28:20Z"
}