{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tКурс «СуперИммунитет: здоровье и энергия в большом городе» рассчитан на городских жителей, живущих в неблагоприятной экологической обстановке, напряженном ритме жизни, стрессах, депрессиях и вечной нехватке энергии.  </p>  <p>  \tКурс особенно подойдет тем, кто испытывает:  </p>  <ul>  \t<li>повышенную утомляемость;</li>  \t<li>чувство постоянной усталости;</li>  \t<li>повышенная сонливость;</li>  \t<li>наблюдается бессонница;</li>  \t<li>ощущаете ломоту в мышцах и суставах;</li>  \t<li>есть хронические болезни;</li>  \t<li>страдает аллергией;</li>  \t<li>болеет более 3 раз в год;</li>  \t<li>из любой болезни выходит с трудом – болезнь плохо поддается лечению, долго восстанавливаетесь;</li>  \t<li>болеет герпесом;</li>  \t<li> увеличены лимфоузлы в нескольких местах.</li>  </ul>  <p>  \tКурс «СуперИммунитет: здоровье и энергия в большом городе» позволит вывести уровень иммунитета и защитных сил организма до состояния действительно сибирского здоровья, когда целых 365 дней в году вы будете оставаться здоровыми, бодрыми, полными сил.  </p>  <p>  \tНа курсе вы получите подробную информацию и схемы выполнения следующих практик:  </p>  <ol>  \t<li><span>Массаж специальных точек здоровья и особых зон на теле, которые зарядят вас здоровьем и энергией.</span></li>  \t<li><span>Прием лечебных трав и определенных продуктов минерального и растительного происхождения для максимального насыщения вашего тела витаминами и микроэлементами.</span></li>  \t<li><span>Практики оздоровления ЛОР-сферы: уха, горла, носа.  Вы полностью забудете о насморках и ангинах.</span></li>  \t<li><span>Целебная работа со стопами - это связь с силами Земли, регуляция артериального давления и подпитка от природы. Стопа представляет собой проекцию всего нашего тела в миниатюре. Выполняя определенные двигательные практики, массажные практики,  дыхательные практики, вы максимально заряжаетесь энергией.</span></li>  \t<li><span>Специальные техники закаливания. В первую очередь, речь пойдет об особых зонах, через которые, чаще всего, в человеческое тело входит болезнь – это ухо-горло-нос, шея, поясница, стопы и еще ряд мест на нашем теле.</span></li>  \t<li><span>Специальные приемы для активизации клеточного дыхания, чтобы каждая клеточка вашего тела максимально активно захватывала кислород, с помощью которого перерабатывала все негативное в вашем организме, убивала нехорошие бактерии и микробы и максимально активно выбрасывала продукты распада.</span></li>  </ol>  <p>  \tКурс «СуперИммунитет: здоровье и энергия в большом городе» позволит вам <strong>оставаться молодым, здоровым, с ясным умом и крепкой памятью, максимально активным</strong>.  </p>  <p>  \tКурс состоит из 18 видео уроков. Каждый урок курса будет поднимать ваши жизненные силы на 5,5%. Добросовестное выполнение каждого урока и следование рекомендациям позволит вам значительно укрепить свой иммунитет и поднять уровень энергии.  </p>  <p>  \tРекомендуемый темп прохождения курса: <strong>1 день – 1 урок.</strong>  </p>  <p>  \tНекоторые уроки могут у вас потребовать чуть больше времени на усвоение и отработку, поэтому проходите курс в комфортном для вас ритме. Мы не рекомендуем проходить курс быстрее, тогда высока вероятность того, что вы хуже усвоите материал и не отработаете практики, что может снизить эффективность курса.  </p>", 
    "end_date": null, 
    "title": "Энергия и здоровье в большом городе (RUS)", 
    "price": "30.00", 
    "instructors": "Dr. Alexey Mamatov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/275816_0730_3.jpg", 
    "course_url": "https://www.udemy.com/health_and_energy_and_the_city_rus/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-06T07:42:05Z"
}