{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\n\t  הקורס הזה הוא חלק מתוך הקורס המלא של שיטת מודעות לפוריות הנותן מענה גם לנשים המעוניינות למנוע הריון באופן טבעי. כאן אני מתמקדת בכניסה להריון בלבד ומלמדת אותך לזהות מתי הם הימים הפוריים שלך במחזור, כך שתדעי מתי כדי לקיים יחסי מין , ומתי אין טעם לנסות .\n</p><p>\n\t  וכל זאת ללא בדיקות ביוץ, בדיקות דם ומעקב רופא.\n</p><p>\n\t  בקורס תלמדי לעקוב אחרי שני סימנים המשתנים בגופך כל יום, וכך תדעי מתי את פורייה ויכולה להכנס להריון.\n</p><p>\n\t  במידה והכל תקין מנסיוני תוך 3-4 חודשים לרוב משיגים הריון והרבה פעמים על הנסיון הראשון</p><p>הידע וההיכרות עם הגוף מאפשרים לנו פעול באופן שמעלה את הסיכויים באופן משמעותי \n</p><p>\n\t  כמו כן המעקב אחר הסימנים יכול לספר לנו אם ישנו מצב שמונע הריון ובמידה וקיים מצב כזה אני מציעה כלים מעולם הרפואה הטבעית (תזונה, צמחי מרפא, תוספים מזון , שינוי אורח חיים וכדומה)\n</p><p>\n\t  הנחיות בסיסיות לשיפור וחיזוק הפוריות , תוכלי לקבל בסרטונים האחרונים בקורס הזה .\n</p><p>\n\t  את הקורס את יכולה ללמוד בקצב שלך , ולמעשה ניתן ללמוד את כולו בערב אחד בנחת מול המחשב מהבית.\n</p><p>\n\t  תלמידות מספרות:\n</p><p>\n\t  הרגשתי שאני מקבלת את השליטה על הגוף שלי, אבישג לימדה אותי איך להכיר את עצמי בדרך אחרת , חשבתי שהתהליך יהיה יותר ארוך כי ידעתי שאני סובלת משחלות פוליציסטיות, אבל בטבלה השניה כבר היינו בהריון\n</p><p>\n\t  -תהילה\n</p><p>\n\t  איך לא מלמדים אותנו את הידע הזה כבר בבית הספר, אני לא יודעת. אני זוכרת שהתחושה הראשונה שחשתי כשלמדתי את השיטה , זה כעס...על מה שיכולתי לדעת על עצמי והסתירו ממני\n</p><p>\n\t  -מור\n</p><p>\n\t  כבר התחלנו לעשות בדיקות ונתקלנו באבישג שחסכה לנו בדיעבד המון זמן , כסף ותסכול. היום אני יודעת לדבר עם הרופאים , ולהחליט החלטות בקלות יותר בנוגע לגוף שלי\n</p><p>\n\t  טלי-\n</p><p>\n\t  אני ואחותי החלטנו שאנחנו רוצות להכנס להריון ביחד, ושמחנו לגלות שאפשר , תודה לך אבישג על ההומור על הסבלנות וכל הפתיחות\n</p><p>\n\t  גלית-\n</p>", 
    "end_date": null, 
    "title": "להכנס להריון באופן טבעי בעזרת שיטת מודעות לפוריות ", 
    "price": "35.00", 
    "instructors": "Avishag Maya Zloof", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/254498_5090_2.jpg", 
    "course_url": "https://www.udemy.com/pregnantnow/", 
    "currency": "USD", 
    "subject_name": [
        "General Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-02T14:37:40Z"
}