{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Does the thought of manually packing and shipping your own products day in and day out heighten your anxiety? </strong></p><p><em>Then let me show you an alternative way to sell your custom designed products. </em></p><p>This course aims to teach you how to build a WordPress eCommerce store to sell your t-shirts with Printful. You’re not limited to selling t-shirts. Printful is an on-demand, online printing fulfillment and shipping company. Printful will print your custom designs on posters, t-shirts, shirts, canvas, and mugs to just name a few. </p><p><em>By the end of this course you’ll be able to synchronize your WooCommerce products with printful and start selling!</em></p><p><strong>You’ll learn how to integrate WooCommerce with Printful to build a fully functional eCommerce store with WordPress.</strong></p><ul><li>You’ll setup a free Printful account</li></ul><ul><li>Sync your designs and products</li></ul><ul><li>Printful will fulfill your order </li></ul><p><br>Customers purchase your products using your payment platform such as PayPal. Your shop will automatically place your order with Printful.</p><p><strong>Have you ever wanted to sell your own designed t-shirts without the hassle of manually fulfilling each order?</strong></p><p><em>I can show you how to effortlessly build your own WooCommerce store with WordPress and Printful.</em></p><p><strong>Once you’ve enrolled in the course you’ll do the following:</strong></p><ul><li>Choose a WordPress theme.</li><li>You can also use the free theme by WooThemes called Storefront if you don’t have a theme.</li><li>You’ll install WooCommerce and Printful.</li><li>If you have a t-shirt design that’s great! </li><li>If you don’t have a t-shirt design well now is a good time to create one or you can use my design mockup for your course project.</li><li>In a few hours you can immediately start selling your products.</li></ul><p><strong>Why use WooCommerce?</strong></p><ul><li>It’s free.</li></ul><ul><li>It’s flexible as it integrates easily with Printful.</li></ul><ul><li>It’s customizable as it’s based on the popular WordPress platform.</li></ul><p><strong>What is Printful?</strong></p><ul><li>Printful is an online drop shipping and custom print fulfilment service that allows you the freedom to focus on selling your product.</li><li>Your WooCommerce store will automatically send your orders to Printful.</li><li>Printful takes care of the printing, shipping and quality.</li></ul><p>You’ll be able to manage your own WordPress site with WooCommerce, the most popular eCommerce solution that gives you complete control to sell your products.</p><p>I designed this course to be easily understood by WordPress WooCommerce beginners to intermediate users.</p><p>Complete with resources and project files you’ll be able to work alongside me, your instructor and receive a certificate of completion upon finishing the course.</p><p><strong>Get started today by clicking \"Take This Course\" and get full, lifetime access with all future updates and all current and future course materials included!</strong></p>", 
    "end_date": null, 
    "title": "Build a WooCommerce eCommerce T-Shirt Store with WordPress", 
    "price": 0, 
    "instructors": "Susan Cork", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687242_79a2_3.jpg", 
    "course_url": "https://www.udemy.com/build-a-woocommerce-ecommerce-t-shirt-store-with-wordpress/", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T19:00:32Z"
}