{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>(New 2016)</strong> <strong>e</strong><strong>Commerce WordPress Website: The Complete Course</strong></p>  <p><strong></strong></p>  <p><strong>&gt;</strong>All the WordPress plugins used in this course are of the <strong>latest</strong> versions<strong>&lt;</strong></p>  <p><strong>++++++++++++++++++++++++++++++++++++++</strong></p>  <p>This <strong>COMPLETE &amp; COMPREHENSIVE</strong> WordPress eCommerce course will teach you exactly <strong>How to Build a fully-functional e-commerce (online store) website</strong> using the powerful CMS, which is WordPress and also using the powerful Wordpress plugin/addon, which is <strong>WooCommerce</strong>! After completing this WordPress and eCommerce course, you will be prepared to start your own online business using WordPress and custom products with minimal upfront costs.</p>    <p>In this Comprehensive<strong> </strong>online WordPress course, you will not only build an eCommerce site with WordPress, but you will also be given some tips on how to drive traffic to your Wordpress eCommerce website.</p>      <p>In this course I'll walk you through every step in how to use <strong>WordPress</strong> and build an ecommerce website through a series of videos. </p>  <p>This course explains the most basic to advance features of WordPress ecommerce </p>  <p>By the end of this WordPress ecommerce online training you will have enough knowledge to create a Professional ecommerce WordPress website of your own and not only that but you can create websites for your clients.</p><p><br></p>                            <p><strong>Would you like to learn how to instantly create an amazing WordPress eCommerce website for your business, blog or any other endeavor?</strong></p>  <p><strong>Would you like to make money charging over your clients?</strong></p>  <p><strong>Would You like me to teach you each and everything that are needed to create a professional online ecommerce WordPress website?</strong></p>  <p>If You answered <strong>~YES~</strong></p>    <p>Then you are ready to start. Click <strong>Take This Course</strong> button and discover the step by step process to creating an amazing eCommerce Wordpress website from scratch.</p>    <p><strong>See you inside the course!</strong></p>", 
    "end_date": null, 
    "title": "Build eCommerce Websites With Wordpress ", 
    "price": "20.00", 
    "instructors": "Alex Addo", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593890_8525_3.jpg", 
    "course_url": "https://www.udemy.com/build-ecommerce-websites-with-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T11:03:14Z"
}