{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Drupal is a CMS platform very similar to WordPress, but much more powerful. Plugins (called modules) are free, open source, with open support. This allows you to customize and add functionality to your website without paying for expensive plugins.<br><br>Use these various tools and skills to begin listing and selling your products on your own store <strong>today</strong>! Save time by removing the hurdles that come with programming and designing websites from scratch.<br></p>\n\n<p><strong>Build an online store in Just a Few Hours</strong></p>\n\n<ul><li>Step by step instructions from selecting a host, to accepting credit card payments</li><li>Tips driving traffic to your website and optimizing for search engine results</li><li>Sell physical products, recurring products such as memberships, or digital downloads</li><li>Easily edit the content on your website without writing a single line of code</li><li>Tools to allow users to easily share your website content</li><li>Setup an e-mail collection process to send out beautiful newsletters to potential customers</li><li>Learn key Drupal skills like building content types, blocks, views, and more</li><li>Skills you learn in this course can be used to build any type of website, and even land you an entry level Drupal developer job</li><li>Save tons of time by avoiding the hurdles that come with learning code</li></ul><ul><li>Start earning money from your own online store today!</li></ul>\n\n<p>First, I'll show you how to choose a web host, create a MySQL database, and upload your files via FTP. Then, you'll learn how to install and setup the Drupal platform on your database.</p>\n\n<p>From there, you'll be creating various product types and creating blocks and views. You can create basic websites with simple features or more complex ones with many different pages and functionality.</p>\n\n<p>Then, you'll see how to drive traffic to your newly created websites by writing blogs, enabling sharing buttons, building an e-mail list, and search engine optimization (SEO)!</p>\n\n<p>Whether you know nothing about building websites or you just need a quicker way to develop them for clients, this is the best course for you! Additional lectures may be added to the course, plus you'll get prompt, friendly, responsive support by email or on the Udemy forums to help you every step of the way and answer any questions you may have.</p>", 
    "end_date": null, 
    "title": "Build Your Own Online Store - No Coding Required!", 
    "price": "20.00", 
    "instructors": "Cameron Wills", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/818136_b2c5_2.jpg", 
    "course_url": "https://www.udemy.com/creating-e-commerce-websites-with-drupal/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-10T20:41:13Z"
}