{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>O Opencart é uma poderosa ferramenta Opensource de E-commerce que veio para revolucionar o mercado. Seu maior diferencial com relação aos outros sistema de e-commerce é a facilidade de instalação gerenciamento e o principal: sua leveza de processamento e carregamento. Uma das categorias mais procuradas para Lojas virtuais é a venda de camisas e essa categoria cresce com passos largos no gosto dos compradores Online e movimentam bilhões todo ano.</p><p>O sistema é altamente indicado para quem pretende comercializar quaisquer produtos Online, mas este curso foca exatamente no comércio de camisas, visto que ensinamos diversos recursos e plugins únicos para esta categoria.</p><p>Você aprenderá por exemplo a trabalhar com um excelente plugin que permite ao usuário escolher a melhor estampa para sua camisa. Também é abordado recursos da ferramenta e integrações com os principais intermediadores de pagamento do mercado, entre eles o Pagseguro.</p><p>Esta é uma oportunidade única de se especializar em criação de lojas para comercialização de camisas e vestuário em geral em uma das plataformas de e-commerce que mais crece no mundo.</p><p>O curso Criando Lojas Online de camisetas oferece uma gama de recursos com um ótimo tema para T-Shirt, onde destacaremos plugins essenciais para o funcionamento de diversas opções indispensáveis para quem pretende vender vestuário em geral pela web.</p><p><strong>Obs: </strong>O tema e plugins usados no curso são disponibilizados para download sem custos adicionais</p>", 
    "end_date": null, 
    "title": "Criação de lojas virtuais com Opencart - Loja de camisetas", 
    "price": "50.00", 
    "instructors": "MX Cursos", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792542_158b.jpg", 
    "course_url": "https://www.udemy.com/criacao-de-lojas-virtuais-com-opencart-loja-de-camisetas/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T16:25:30Z"
}