{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Build your own custom Portfolio Website, with E-Commerce - for FREE. </strong></p><p><strong>You <strong>DO NOT need an expensive \"web designer.\" You can </strong></strong><strong>Do It Yourself in just about 2 hours! Jay and Robert make it SIMPLE, with step-by-step instructions!</strong></p><p><strong></strong>If you are an Artist or Photographer looking for a gorgeous Portfolio Website - with a shopping cart to sell your work - here is the ultimate budget-conscious solution! </p><p><strong>No programming or coding. No need to be a web designer or webmaster.</strong></p><p>In a few hours, you can have your own, personalized portfolio website - and start selling your work.</p><p>For the past two decades, Jay Jacoby has been teaching, evangelizing and creating inexpensive, high quality websites for clients.<br></p>For the past five years, those websites have been built on WordPress, an extraordinarily easy to use and FREE software! <br>Now, he's showing you how to do it!<br>Of course, your website will have all the features you'd expect if you would have paid thousands to a web designer …<ul><li>A fantastic slide-show slider to tease visitors into staying on your page</li><li>A handsome portfolio area to show off all your work that's for sale (or not!)</li><li>Fully-functional Menus</li><li>An \"About the Artist\" page</li><li>A \"Contact Us\" page</li><li>Footer and Icon Services</li><li><span></span>And, a highly functional E-Store set-up, so that you can SELL YOUR WORK</li></ul><p>DO NOT WAIT! Within a few hours, you could be selling your artwork or photography on your OWN personalized website!</p><p>And, of course, we offer a NO QUESTIONS ASKED 30-day money-back guarantee - as well as our personal promise that this is your best choice on Udemy for building your own portfolio site - for FREE!</p><p><br><br></p><p><br><br></p>", 
    "end_date": null, 
    "title": "eCommerce Website, No Coding - DYI Artist/Photo Portfolio", 
    "price": "20.00", 
    "instructors": "Robert Scot, Instructor Jay Jacoby", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631872_80c2_5.jpg", 
    "course_url": "https://www.udemy.com/wordpress-free-portfolio-website-with-no-coding/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T01:13:20Z"
}