{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>*** Update February 10 2016:</p><p>When you buy this course you get the Divi theme for <strong>free </strong>within this course. Yes that is right. For <strong>free</strong>! That theme will cost you normally $69. You get support trough this course if you have any issues with the theme.<br></p><p>***</p><p>This step-by-step course will teach you how to <strong>design </strong>your <strong>eCommerce </strong>store with <strong>WordPress </strong>and WooCommerce. When you are finished with the course you will know how to create a beautiful design and configuration for your store.<br></p><p>in this <strong>new </strong>and <strong>improved </strong>course (updated February 10th 2016!) there are now <strong>two</strong> themes covered in this course. <strong>Divi </strong>by Elegant themes and <strong>Flatsome</strong>. </p><p>Over 4 hours of video in which you will learn everything you need to know to get you started with designing your Online store. I will tot only teach how to install a theme but also what to do and what not to do. But there is more. If you want, I <strong>create a lecture</strong> specially for you! Yes, that is right, you can send me a message and I will record as many lectures needed to help you. That request can be for a specific theme, plugin or function in WordPress or WooCommerce. There are so many plugins and extension available for WordPress and WooCommerce it is very difficult for me to please all of you right from the start. So do not hesitate to contact me, i will make sure I deliver and i will deliver within 30 days, so if you are not pleased with the content, you can ask for a <strong>100% refund</strong>, no questions asked.<br></p><p>Starting an eCommerce business has been made very very easy with WordPress and WooCommerce. A few years ago everything i did was with Magento and custom build systems. <strong>WooCommerce </strong>was way to immature for our business. But now it is a fully functional and 100% professional system that has everything that you need.</p><p>In this course we will focus on the <strong>look and feel</strong> of your online store. I take one approach with one theme that will show you the possibilities of a theme and WordPress. Please note that the possibilities are endless!</p><p>A few examples:</p><ul><li>Installing and configuring a Theme;</li><li>Setting up the Home page;</li><li>Setting up Shop pages (like the product page);</li><li>Creating other pages like the contact page. </li></ul><p>After this course the only thing you need to do is implement everything you learned, create a beautiful store AND start selling those products.</p>", 
    "end_date": null, 
    "title": "eCommerce with WordPress and WooCommerce - Theming a store", 
    "price": "25.00", 
    "instructors": "Patrick Gerrits", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479298_caf7_4.jpg", 
    "course_url": "https://www.udemy.com/ecommerce-with-wordpress-and-woocommerce-theming-a-store/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-17T20:05:07Z"
}