{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This step-by-step <strong>free </strong>course will teach you how to build your <strong>eCommerce</strong> store with <strong>WordPress</strong> and <strong>WooCommerce</strong>. When you are finished with the course you will know how to use the WooCommerce functionality and know how utilize your business.<br></p><p>The course will teach you all the basic information you need to start running your eCommerce store with WooCommerce. This course is a free and introduction level course, my fully featured course is available as well here on Udemy with more in depth content. <br><br>Starting an eCommerce business has been made very very easy with WordPress and WooCommerce. A few years ago everything i did was with Magento and custom build systems. WooCommerce was way to immature for our business. But now it is a fully functional and 100% <strong>professional</strong> system that has everything that you need.<br></p><p>In this course I will guide you<strong> step by step</strong> throughout the usage of WordPress and WooCommerce. If you already familiar with Wordpess, skip that part and move on to the WooCommerce part.</p><p>A few examples:</p><ul><li>Installing and configuring WordPress and WooCommerce;</li><li>Creating products, pages, emails and much more;</li></ul><p>After this course the only thing you need to do is <strong>implement</strong> everything you learned, create a beautiful store AND start selling those products.<br></p><p>Joining this course will grant you acces to a discounted price for my other courses. </p>", 
    "end_date": null, 
    "title": "eCommerce With WooCommerce - Lite Edition", 
    "price": 0, 
    "instructors": "Patrick Gerrits", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764126_6af5_2.jpg", 
    "course_url": "https://www.udemy.com/ecommerce-with-woocommerce-lite-edition/", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T07:54:28Z"
}