{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>If you want to <strong>learn how to use Google AdSense </strong>to <strong>monetize your website</strong>, you can find a lot of practical tips and motivation in this course!  When I started out, I had no idea how to actually get an Google AdSense website to make money. I may have never learned unless I took a step to purchase an Google AdSense website from someone else.</p>\n\n<p>I took what I learned from purchasing that website to create more websites that turned out to be even more profitable. Now, I have <strong>taken my experience and packaged it into this course</strong>. I spent $2500 on my first website to be able to learn how to run a successful Google AdSense website.</p>\n\n<p>$2500! And since that time I have spent hundreds of hours figuring out how to improve my Google AdSense earnings and determining what makes a site successful. Take what I learned about buying Google AdSense websites and creating my own to <strong>start your very own Google AdSense empire</strong> <strong>at a fraction of what it cost me to do it!</strong></p>\n\n<p>If you are going to learn a skill from someone, you want to learn from the one who has successfully achieved the goal you want. Is your goal to make enough money to live off of from Google AdSense? I have already been there and done that. I have made over $100,000 in one year from Google AdSense.</p>\n\n<p><strong>Take this course today</strong> to get <strong>lifetime access</strong> to everything I know about <strong>Google AdSense</strong> in just a few hours!</p>", 
    "end_date": null, 
    "title": "Google AdSense for Business and Beginners!", 
    "price": "50.00", 
    "instructors": "Jordan Arsenault, Jerry Banfield", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427800_d975_3.jpg", 
    "course_url": "https://www.udemy.com/how-i-made-over-100k-in-adsense-in-one-year/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T15:55:51Z"
}