{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  If you want to sell a product or service on your website, you will need a payment solution to accept and process payment. If you are selling more than one product or service, you may also need a shopping cart program to let your customers buy multiple products and check out. This course teaches you how to create a PayPal account to start selling products and accept payment online and how to create “Buy Now” and “Add to Cart” buttons on your html website or Wordpress site.  It also teaches you how to manage your transactions such as disputes management, fraud prevention and keeping transaction records for tax purpose. This informative and easy to follow course will help you to integrate PayPal payment gateway into your website fast so you can start making money online quickly.  </p>  <p style=\"\">  \t<strong style=\"\">Who Should Take This Course?<br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t  This course is for anyone who wishes to use PayPal as their payment gateway for selling online without the need to pay for complex and expensive shopping cart program. This step-by-step and easy-to-follow course contains 40 minutes of video tutorials spread over 30 lectures to help you start making money online.  </p>  <p style=\"\">  \t<strong style=\"\">What are the requirements?</strong>  </p>  <li>  This course is structured for beginners and covers the essential of using Paypal as a payment gateway. All you need is to know how to surf the web and clicks on the web browser. </li>  <p style=\"\">  \t<strong style=\"\">Topics include:</strong>  </p>  <ul style=\"\">  \t<li>Setting up an account</li>  \t<li>Creating Buy Now buttons for your web site</li>  \t<li>Setting up a simple shopping cart using Add to Cart buttons to sell multiple products</li>  \t<li>Requesting payment via email and creating e-invoice</li>  \t<li>Withdrawing funds from a bank account</li>  \t<li>Set postage and shipping charges</li>  \t<li>Issuing refunds</li>  \t<li>Download and keep detailed records for accounting purpose</li>  \t<li>How to handle customer dispute</li>  \t<li>How to prevent online fraud</li>  \t<li>Understanding PayPal protection for buyers and sellers</li>  \t<li>Introduction to the new PayPal interface</li>  </ul>", 
    "end_date": null, 
    "title": "How To Sell Products Online Using PayPal ", 
    "price": "45.00", 
    "instructors": "Goh Kheng Chuan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431548_a3cd.jpg", 
    "course_url": "https://www.udemy.com/how-to-sell-products-online-using-paypal/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T02:13:59Z"
}