{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">This course is for anyone who wants to know how to build an internet store.</strong></p><p style=\"\">This course teaches you how to set up an internet store; using an ecommerce software wordpress theme and plugins. That means that you will be able to work from home (if you want).</p><p style=\"\">I make it simple with easy to understand steps and language. When you have completed this course, you will be able to run your online store with minimal startup costs.</p><p style=\"\">Most lectures are in video format so that you can watch them over and over again. I do include pfd documents as well.</p><p style=\"\"><strong style=\"\">The course can be completed in less than an hour and a half.</strong></p><p style=\"\">I teach you how to :<br style=\"\"><br style=\"\"></p><p style=\"\">Decide what domain to get<br style=\"\">How to handle hosting<br style=\"\">Install wordpress<br style=\"\">Install wordpress themes<br style=\"\">Install wordpress Plugins<br style=\"\">What settings you need for mystile wordpress theme and for<br style=\"\">woocommerce.<br style=\"\">How to set up digital products|<br style=\"\">How to set up simple products|<br style=\"\">How to set up products that have variations (such as tshirts)<br style=\"\">How to set up shippping<br style=\"\">How to set up taxes<br style=\"\">How to add affiliate links (to make more money)<br style=\"\">What widgets are and how to set up widgets<br style=\"\">and much more</p><p style=\"\">You should take this course if you are looking to make money online now or in the future. Online shopping is growing every year and owners of online stores profit.</p><p style=\"\">The one aspect of  an internet store that stops most people in their tracks is creating the store. <strong style=\"\">This course removes that barrier and allows you to make your ecommerrce site easily.</strong></p><p style=\"\"><strong style=\"\">So why don&#039;t you profit online? It&#039;s your turn!</strong></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "How to Create Internet Stores  the EASY WAY Using Wordpress", 
    "price": "20.00", 
    "instructors": "Pat Selby", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/474248_eef4_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-internet-stores-the-easy-way-using-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-12T17:16:33Z"
}