{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>** Updated April 2016</em></p>\n\n<ul><li><strong><em>Added 13 New Course Videos </em></strong></li><li><em><strong>Bonus Checkout &amp; Shipping Plugins Now Available ($189 Value)</strong></em></li><li><em><strong>The Most Complete Course From Start to Finish </strong></em></li></ul>\n\n\n\n<p><strong><em></em></strong></p>\n\n\n\n<p>  \t<em>Want to build your own eCommerce store?  In this series of tutorials I teach you how to create your own ecommerce site using the hottest free ecommerce platform without typing any code.  This includes step by step tutorials from buying your first domain to setting up your store an selling your first product!</em>  </p>\n\n\n\n<p>  \t   I primally focus on wordpress woocommerce which is the fastest growing ecommerce platform.  After this course you will have a complete understanding on how Woocommerce works.  Not only will you be able to customize your store, you will have a fully functional site to market your products.  Avoid paying the high monthly fees an create your free ecommerce store today  </p>\n\n\n\n<p>  \t  I have been in the eCommerce industry for over 8 years. I have created many ecommerce business that specialize in various niche markets.  This is your chance to learn from someone who not only practices in the field daily but is an active store owner an web designer, you'll get the best of both worlds.  </p>", 
    "end_date": null, 
    "title": "Jumpstart Your Ecommerce Business With Wordpress Woocommerce", 
    "price": "20.00", 
    "instructors": "Daniel Marko", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/120060_741a_5.jpg", 
    "course_url": "https://www.udemy.com/jumpstart-your-ecommerce-business-with-wordpress-woocommerce/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-14T22:56:13Z"
}