{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Günümüzde insanlar, sosyal medya veya farklı internet siteleri üzerinden video içerik paylaşmaktadırlar. Bu eğitim içerisinde, internet üzerindene canlı yayın yapabilmek için gereken en temel bilgiler ve örnekler bulunmaktadır.</p><p>Bu eğitimin sonunda, aşağıdaki işlemleri rahatlıkla yapabileceksiniz.</p><ul><li>Youtube üzerinden canlı yayın yapmak</li><li>UStream veya LiveStream gibi canlı yayın hizmeti veren sistemler üzerinden canlı yayın yapmak</li><li>Bilgisayara bağladığınız web kamerasının görüntüsünü canlı olarak sunmak</li><li>Bilgisayarınızın ekran görüntüsünü canlı olarak yayınlamak</li><li>Bilgisayarınız üzerinde yayın yapacağınız onlarca farklı ekran oluşturup, birbirleri arasında geçiş yaparak yayın yapmak.</li><li>Daha önceden kayıt ettiğiniz videoları yayınlamak</li></ul><p>Eğitim içerisinde canlı yayın yapmak için en çok kullanılan portallara yer verilmiştir. <br>Bu portallar,  </p><ul><li>YouTube</li><li>UStream</li><li>LiveStream</li></ul><p>Ayrıca canlı yayın yapabilmek ve birçok avantajlı işlemi yapabilmek için kullanabileceğiniz XSplit uygulamasının kullanılmasına da bu eğitimde yer verilmiştir.</p><p>XSplit üzerinden canlı yayın sırasında arka planını temizleyerek  (chroma key) profesyonel yayınlar yapmak. Temizlenmiş arka plana, istediğiniz resmi veya videoyu ekleyebilirsiniz. Bu işlemleri anlık olarak yapabilmeniz (realtime), canlı yayınızda ayrı bir kolaylık sağlamaktadır.</p><p><br></p>", 
    "end_date": null, 
    "title": "Kendi TV Kanalını Oluşturmanın Temelleri", 
    "price": "20.00", 
    "instructors": "Ersin Sengul", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705052_0151.jpg", 
    "course_url": "https://www.udemy.com/kendi-tv-kanaln-olusturmann-temelleri/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-23T17:19:39Z"
}