{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<ul><li>Are You Looking To Build A Professional Looking eCommerce Website?</li><li>Want To Skip The Enormous Amount of Time it takes Learning How To Code?</li><li>Then This Course if For you!</li></ul>\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>Welcome To Learn How To Build An eCommerce Website Using WordPress 2015</strong></p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>⇉ Watch the promo video </strong>to see How You Build Your Own eCommerce Website Using Wordpress</p>\n\n\n\n<p><strong>⇉ Join Over 100,000+ Students</strong> Who Have Enrolled In My Udemy Courses This Year!</p>\n\n\n\n<p><strong>⇉ 2500+ Five Star Reviews</strong> Shows Students Who Enrolling Are Getting Real Results!</p>\n\n\n\n<p><strong>⇉ You receive</strong>  Lectures and  Hours of HD Video Content</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>Student Success Testimonials: </strong></p>\n\n\n\n<ul><li>Paul M. DePaw</li></ul>\n\n\n\n<p>10 days ago</p>\n\n\n\n<p>Well done!</p>\n\n\n\n<p>Excellent course showing you how to build your professional looking Wordpress eCommerce website. Step by step just as described. Easy to follow along and understand. Highly recommended.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p>In this course you will learn how to build your very own professional looking eCommerce website using Wordpress. Wordpress is \"a free and open source content management system (CSM) based on PHP and MySQL. Wordpress is used by more than 23.3% of the top 10 million websites as of January, 2015\" -Wikipedia</p>\n\n\n\n<p>We show you step by step how you can simply and easily build your very own professional website. We start by discussing an introduction to hosting, domains, what Wordpress is and how to use it, and much more. We then move into the installation process and getting comfortable navigating around Wordpress. We then teach you all of the necessities to building your professional website</p>\n\n\n\n<p>Here is What You Will Learn Throughout Our Entire Course:</p>\n\n\n\n<ul><li>How Websites Work &amp; Function</li><li>What The Domain is &amp; How To Find One For Your Website</li><li>What Hosting is And How To Find Efficient Hosting</li><li>Setting Up Wordpress</li><li>A Complete Guide To Using The Basics of Wordpress and Beyond</li><li>We Then Create A Website Right Before your Eyes</li><li>So Much More!</li></ul>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards Building your own professional eCommerce website using Wordpress</p>\n\n\n\n<p>When I learn something new, I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the Udemy 30-day money back guarantee, you have my personal guarantee that you will love what you learn in this course.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em> </p>\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p>This course will not remain this price forever! It's time to take action!</p>\n\n\n\n<p>Click the <strong>\"take this course\"</strong> button at the top right now!</p>\n\n\n\n<p>...<em>every hour you delay is costing you money</em>...</p>\n\n\n\n<p><strong>See you in the course!</strong></p>\n\n\n\n<p>Sincerely,</p>\n\n\n\n<p><strong>Joe Parys &amp; Justin Nifong</strong></p>", 
    "end_date": null, 
    "title": "Learn How To Build An eCommerce Website Using Wordpress ", 
    "price": "20.00", 
    "instructors": "Joe Parys, Justin Nifong", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599806_7ac2_2.jpg", 
    "course_url": "https://www.udemy.com/ecommercewebsite/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T22:32:06Z"
}