{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t                Have you ever wanted to make your own online store and sell your own products online? It is not as hard as you might think.  </p>  <p style=\"\">  \t          If you use Wordpress and WooCommerce you can have a full ecommerce website that allows you to selling anything imaginable, from physical products to digital products.  </p>  <p style=\"\">  \t                WooCommerce lets you turn your WordPress-powered website into an incredibly user-friendly online store. WooCommerce is a popular plugin and the most trusted ecommerce solution for WordPress.  </p>  <p style=\"\">  \t                This course will teach you everything you need to know about building an ecommerce website using WooCommerce.  </p>  <p style=\"\">  \t        This course teaches you the step by step process of how to design and implement the WooCommerce ecommerce plugin.  </p>  <p style=\"\">  \t        And once you’re set up, this course will help you master WooCommerce so you can start selling online.  </p>  <h4 style=\"\">TOP FEATURES</h4>  <ul style=\"\">  \t<li>2 hours of content and 29 lectures. </li>  \t<li>Learn WooCommerce Basics – adding products and images, checkout process, managing orders, shortcodes, shipping, taxes, payment gateway configuration, and more</li>  \t<li>Advanced Techniques – Learn about advanced products types and shipping methods, taxes and tax classes, coupons, order &amp; inventory management, product reviews and more</li>  </ul>", 
    "end_date": null, 
    "title": "Learn WooCommerce: Build An Ecommerce Website With Wordpress", 
    "price": "20.00", 
    "instructors": "Zachary G.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404560_af06_2.jpg", 
    "course_url": "https://www.udemy.com/learn-woocommerce-build-an-ecommerce-website-with-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T17:43:49Z"
}