{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">Updates : </em></strong><strong style=\"\">Join Over 1500 Delighted Students On This Amazing Course!</strong><br style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">The secret to getting ahead is to get started</strong><br style=\"\"></p><p><strong style=\"\"></strong>This course is designed for non-programmers who are willing to make dynamic websites either in any field. In this course we are going to make an e-commerce site using wordpress and for this you have not to write a single code. Wordpress provides us GUI to work which everyone can handle easily.<strong style=\"\"> <em style=\"\">Either you want to build your own site or for your client, wordpress can save a lot time &amp; money that you spent on building &amp; maintaining your website.</em></strong></p><p>Now a days wordpress is becoming very popular because of it&#039;s awesome features. Every day many themes &amp; plugins are introduced which make wordpress very reliable to use &amp; build dynamic websites. If we go back to few years before, wordpress was just blogging tool but now that&#039;s not true. It&#039;s the most popular CMS of the world. </p><p>This course is designed for everyone i.e. from beginner to advance. We have covered all topics from scratch &amp; assumed that you have not any experience in html, css or in any programming language. </p><p style=\"\"><strong style=\"\">Okay, let us explain why to take this course while there are many Wordpress courses in less prices.<br style=\"\"></strong></p><ul style=\"\"><li><strong style=\"\">While designing this course we have analyzed individual&#039;s problems &amp; needs. Everyone faces a lot of problems which are so general that it becomes difficult to find their solution. So we have taken care of your problems &amp; needs so that you have not to look for youtube videos, other websites, asking for help again &amp; again etc.</strong></li></ul><ul style=\"\"><li><strong style=\"\">Course is designed in such a way that you will be able to handle any theme. You will be able to make any protfolio site, any business site, any blog and can use any site for e-commerce purpose in just few clicks.</strong></li></ul><ul style=\"\"><li><strong style=\"\">Shortcodes, editor, HTML mode of pages &amp; handling core files using FTP are expined well so that you will able to handle multiple wordpress sites.</strong></li></ul><p style=\"\"><br style=\"\">We commend that you will get value content for your each penny. If you face any problem, we are always here to help you.<br style=\"\"></p><p>. </p>", 
    "end_date": null, 
    "title": "Making E-Commerce Sites With Wordpress", 
    "price": "20.00", 
    "instructors": "Aksh Animation", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428464_ea4e_2.jpg", 
    "course_url": "https://www.udemy.com/making-e-commerce-sites-with-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T13:57:31Z"
}