{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Con este curso vas a poder crear tu <strong>negocio online en la Red</strong>. Se explica de manera detallada desde elegir <strong>el hosting de alojamiento</strong>, instalación de prestashop hasta la gestión íntegra de toda la tienda. Se explican como gestionar:</p><p>* Productos<br>* Clientes<br>* Empleados<br>* Categorías<br>* Etc.</p><p>Hay muchas soluciones de comercio electrónico pero <strong>PRESTASHOP </strong>es una de las más utilizadas por su sencillez, la comunidad de usuarios que ya lo utilizan y las ayudas que existen entre los miembros de dicha comundad.</p><p>El software es<strong> totalmente gratuito</strong> y está continuamente en desarrollo y mejora. Al mismo tiempo también existen módulos de pago ( pero a bajo precio ) que permiten que el programa sea mucho más completo.</p><p>Una de las características más interesantes de <strong>PRESTASHOP</strong> es que permite configurar la  apariencia de la tienda y poder <strong>elegir un tema</strong> que se adapte a nuestra temática.</p><p>El curso lo completarás siguiendo los vídeos en 30 horas. Para ello debes de ser constante y visualizar un vídeo o dos diarios para seguir una línea de aprendizaje contínuo, y no espaciar mucho las clases.<br></p><p>Si te apuntas a este curso crear tu<strong> tienda online</strong> no tendrá secretos para tí. No te arrepentirás y te convertirás en un profesional de dicha herramienta.</p>", 
    "end_date": null, 
    "title": "Prestashop 1.6 en ESPAÑOL: Tu negocio online", 
    "price": "20.00", 
    "instructors": "Federico Huércano Ruiz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674368_dbc8_2.jpg", 
    "course_url": "https://www.udemy.com/prestashop-en-espanol-tu-negocio-online/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T12:09:09Z"
}