{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em>Shopify Power: How To Build A Website, Sell Your Products, And Grow A Business On Shopify. </em></strong>Taught by award winning CEO and Adjunct Professor of Marketing at Northwest University - Jason Miles. </p>\n\n<p><strong class=\"redactor-inline-converted\">About The Instructor &amp; His Authentic Credibility On This Topic: </strong>Together with his wife, Miles has sold millions online and their popular shopify website (Pixie Faire) has even been featured by Shopify as one of the sites premiere success case studies. Miles shares their insider tips, techniques, short-cuts and hard-won lessons acquired as they personally set up and built their Shopify site, which currently transacts 40,000-50,000 orders a month and serves over 1 million pageviews. </p>\n\n<p><strong class=\"redactor-inline-converted\">How Is This Course Different? </strong>This course includes analysis, opinions, techniques, short-cuts, and tips from the instructor that you won't find on the help pages of Shopify, or in other Udemy courses. </p>\n\n<p><strong class=\"redactor-inline-converted\">Who Is This Course Designed For? </strong>Students should have a basic understanding, or willingness to learn web-building, such as having previously set-up a blog. They should also have the time, patience, and willingness to implement the lessons and details taught in this course. Students should already have a product, product idea, or product plan. If you have a private label product you sell on Amazon, or are an artist, crafter, or seller of unique items - and need a fully functional ecommerce website - then this course will be of value to you. </p>\n\n<p><strong>You May Find This Course Too Basic If... </strong>If you are a professional site builder, ecommerce professional, or seasoned web veteran, then many of the topics will be familiar to you, maybe too familiar. But the insider tips, App recommendations, walk-throughs, and additional Shopify specific details related to site functionality will still be of value.</p>", 
    "end_date": null, 
    "title": "Shopify Power: Build An Ecommerce Website & Sell Products", 
    "price": "20.00", 
    "instructors": "Jason Miles", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/879166_1936_2.jpg", 
    "course_url": "https://www.udemy.com/shopify-power/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-15T15:08:32Z"
}