{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">This course will walk you through the steps of setting up your online store with the Shopify.</p><p style=\"\">Have you ever wanted to sell products online? Well, with Shopify&#039;s clean, simple, and easy-to-use ecommerce platform you can get an online shop setup quickly and without all the headaches. </p><p style=\"\"><strong style=\"\"></strong>When first opening up an account with Shopify, the backend area and settings can be a bit confusing. Well, have no fear, this course will guide you through all of Shopify&#039;s settings so you can be up and selling quickly.</p><p style=\"\"> This course will guide you through all of Shopify&#039;s different settings. First, we&#039;ll look at how to sign up for the service, and configure everything. Then we&#039;ll explore the settings and configurations to make sure everything is set up right. I&#039;ll show you how to add and organize new products. How to create new pages and blog posts. </p><p style=\"\">You&#039;ll also learn how to configure the look and feel of the site with themes and we&#039;ll look at configuring payments, shipping, and how to manage orders and much much more!</p><p style=\"\">From start to finish you will  learn how to setup your store with Shopify! After taking this course and going through all the steps you will have your site ready to go live so that you can start making money!</p>", 
    "end_date": null, 
    "title": "Shopify Bootcamp: Create an Online Store with Shopify", 
    "price": "20.00", 
    "instructors": "Black Sheep Studios", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499104_8e67.jpg", 
    "course_url": "https://www.udemy.com/create-an-online-store-with-shopify/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T16:38:20Z"
}