{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>This course teaches you all you need to know about starting an online store which can easily be integrated with your eBay, Amazon, Etsy and Facebook marketplaces meaning you can populate any/all these marketplaces from your own online store saving you countless hours having to manually upload your products across four different sales channels.</strong>  </p>  <p>  \t<strong>==================================================================</strong>  </p>  <p>  \t<strong><strong><em>Over 11'500 Students</em> and counting are getting the know how to start their businesses online today so please take action now and join them!</strong></strong></p><p><strong>==================================================================</strong><br></p>  <p>  \t<strong><em></em><strong>If you are selling physical products or thinking of selling physical products don't miss the golden opportunity of a potential flood of customers by not having your own online outlet. This shopping cart is the business.</strong></strong>  </p>  <p>  \t<strong>==================================================================</strong>  </p>    <p>  \t<strong>You Will Learn the following;</strong>  </p>  <ul>  \t<li>How to get a FREE Domain Name for life</li>  \t<li>How to set up hosting so you maintain full control of your website</li>  \t<li>How to set up a domain relevant email address</li>  \t<li>How to set up subdomains</li>  \t<li>How to personalise your store</li>  \t<li>How to set up categories and subcategories</li>  \t<li>How to set up geo zones for shipping and tax purposes</li>  \t<li>How to set up manufacturers for brand name search</li>  \t<li>How to set up your products for refine search options</li>  \t<li>How to set up downloadable products</li>  \t<li>How to insert product options and attributes</li>  \t<li>How to add products optimised for search</li>  \t<li>How to add images and a short-cut for adding bulk images in one go</li>  \t<li>How to integrate your store with eBay and Amazon</li>  \t<li>How to set up recurring payments</li>  \t<li>How to set up wholesale accounts alongside your retail store</li>  \t<li>How to customise your store with slideshows, banners, featured products etc.</li>  \t<li>How to set up affiliate accounts for your store</li>  \t<li>How to set up discount coupons and gift vouvhers</li>  \t<li>How to use customer product reviews</li>  \t<li>How to handle returns</li>  \t<li>How to set up multiple languages</li>  \t<li>How to set up multiple currencies that auto update</li>  \t<li>How to set up five different shipping methods</li>  \t<li>How to customise the checkout of your store</li>  \t<li>How to set up various payment methods e.g. PayPal, Bank Transfer, Cheques</li>  \t<li>How to add on additional functions to your store</li>  \t<li>How to set up additional users for your stores backend</li>  \t<li>How to install themes which can be changed at the click of a button</li>  \t<li>How to submit your stores sitemap to Google in a few clicks</li>  \t<li>How to backup and restore your store</li>  \t<li>How to use reporting functions</li>  \t<li>How to bulk email your clients directly from your store</li>  \t<li>How to upgrade your store if new functions and features become available</li>  </ul>  <p>  \t<strong>With hours and hours of video to watch at your leisure your sure to create a stunning website for your retail or wholesale customers to use. With the Step By Step guide and Stop Start flexibility of video learning you can master your store in this home study course in one day if you really wanted to.</strong>  </p>", 
    "end_date": null, 
    "title": "Start An Online Store A to Z Guide - OpenCart 1.5 Ecommerce", 
    "price": "50.00", 
    "instructors": "Paul Keaveney", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/199041_ad08_9.jpg", 
    "course_url": "https://www.udemy.com/start-your-own-online-store/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-14T23:26:58Z"
}