{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"text-align: justify;\">  \t           Classifieds websites are the perfect way for a long term sustainable revenue, and if you don't know how to make one then you're in the right place.  </p>  <p style=\"text-align: justify;\">  \t           Do you want to create a website like <strong>craigslist,</strong> <strong>OLX</strong>, <strong>Quikr</strong> or any other popular classifieds website out there? then you've reached your desired destination.  </p>  <p style=\"text-align: justify;\">  \t<strong>“Create a Classifieds Site”</strong> course will open the doors to converting your creative <strong>idea into action</strong>, adapting to the online business world without the hindrances of <strong>lack of technology knowledge</strong>, funds or human resources.  </p>  <p style=\"text-align: justify;\">  \t<strong>                     This training course is targeting you! </strong>one who takes initiative and puts their ideas into action while minimize efforts and time-wasting. Be assured that in few hours of the course you will know that you're able to do the whole thing on your own without any outside help or other advanced development knowledge.  </p>  <p style=\"text-align: justify;\">  \t                     Just follow through with the<strong> hours</strong> <strong>of useful contents</strong> and be sure that you have basic and indispensable knowledge to start managing your own classifieds site.  </p>  <p>  \t                     The course consists of the <strong>five main sections</strong>:  </p>  <p>  \t<strong>1. Before starting your empire</strong>  </p>  <p style=\"text-align: justify;\">  \t                     General view introducing to the world of classifieds sites including: main definitions, examples of the successful websites, first steps to your website (target audience, costs, revenues, mobile devices, domain name, hosting, software)  </p>  <p>  \t<strong>2. Getting Started</strong>  </p>  <p>Differences between a self-hosted software and a hosted solution. Installing a self-hosted software.</p>  <p>  \t<strong>3. First steps</strong></p>  <p style=\"text-align: justify;\">  \t                     Basics items to adding and managing: Categories, Location, Ads, Texts, Currency etc.  </p>  <p>  \t<strong>4. Advanced Features</strong>  </p>  <p style=\"text-align: justify;\">  \t                     Additional items to improve your site: Comments, Terms, Widgets, Social Auth, Custom fields, Newsletters etc.  </p>  <p>  \t<strong>5. Bonus:</strong>  </p>  <p style=\"text-align: justify;\">  \t                     Good to know tips: Data Backup, Password Security, Email Marketing  </p>  <p style=\"text-align: justify;\">  \t                     The course includes the list of short, rich in content, <strong>38 </strong><strong>videos</strong> explaining step by step the main issues and the <strong>Open Classifieds Full User Guide in PDF</strong> (nearly 150 pages).  </p>  <p style=\"text-align: justify;\">  \t                     Everything what you should know at the beginning in a nutshell!  </p>  <p style=\"text-align: justify;\">  \t                   Don't allow your ideas go astray, let's get started in making your successful business a reality!  </p>", 
    "end_date": null, 
    "title": "Start a Classifieds Website From Scratch", 
    "price": "30.00", 
    "instructors": "OC open-classifieds.com", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/279342_6a6b_5.jpg", 
    "course_url": "https://www.udemy.com/classifieds/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-12T10:08:48Z"
}