{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">Rapidly deploy the latest FREE WordPress eCommerce theme developed by WooThemes™.</em></strong>  </p>    <p>  \t<strong style=\"\"><em style=\"\">You will be able to effortlessly customize the new Storefront WordPress theme.</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Bulletproof your WordPress site with hassle free theme and plugin updates as Storefront seamlessly integrates with WooCommerce™.</em></strong>  </p>    <p>  \t<em style=\"\"><strong style=\"\">Join now</strong> </em>and at  the end of my WordPress course you will have a lean and mean eCommerce store on a customized WordPress site.  </p>  <hr style=\"\">  <p>Review Excerpt from <strong style=\"\">WPLift </strong>- An influential WordPress site providing tutorials, theme roundups, plugin guides and general WordPress news</p><p><strong style=\"\">Does This WordPress eCommerce Online Course Deliver?</strong></p><p><em style=\"\">&quot;When it comes to getting started with this eCommerce course, you have the option of taking a tour of the program to help you understand the lay of the land. You can quickly view the topics for each of the 38+ lessons and see their length. </em></p><p><em style=\"\">The step by step tutorial sections of course, such as installing WordPress via cPanel, installing the WooCommerce plugin and Storefront theme, and then configuring your website, are all easy to follow. </em></p><p><em style=\"\"> At the end of the course you can use the checklist to ensure that you&#039;ve completed all the necessary steps for your website. You can also download the Storefront user manual eBook for more detailed information.</em></p><p><em style=\"\">Overall, this course definitely delivers on its objective of teaching you how to build an online store using WordPress, WooCommerce, and the Storefront theme, with some nice additional lessons on top of that.&quot;</em></p>  <hr style=\"\">  <p style=\"\">  \t <strong style=\"\">New Bonus Section</strong> now available: <strong style=\"\">Build Your Email List With Bloom – A New Email Opt-in Plugin for WordPress</strong>. You will learn how to install Elegant Theme&#039;s new opt-in plugin with your Storefront WordPress theme. This plugin is available to you as a student of this course. </p><p style=\"\"><em style=\"\">If you haven&#039;t started building your email list yet, then today&#039;s the day to take action.</em></p><p style=\"\">Also, if you&#039;re looking for an effective way to generate and convert leads, I&#039;ll show you how to setup Bloom with an email provider for your WordPress website. </p><hr style=\"\"><strong style=\"\"></strong><strong style=\"\">eBook WordPress Storefront Manual</strong>    <p style=\"\">  \t          As an added bonus I&#039;ve included an ebook for this course with screen shots and detailed instructions for you!  </p>  <hr style=\"\">  <p>  \t                                                                               This course is an introduction to the <strong style=\"\">WordPress Storefront</strong> theme developed by WooThemes.  </p>  <p>  \t                                                                        If you are a <strong style=\"\">beginner</strong> or new to WordPress and WooCommerce software, then this <em style=\"\"><strong style=\"\">is the perfect course for you</strong></em>.  </p>  <p>  \t<em style=\"\"><strong style=\"\">By the end of my WordPress course you will </strong><strong style=\"\">have a fully functional WordPress eCommerce online store.</strong></em><strong style=\"\"></strong>  </p>  <p>  \t                                                                                                           Storefront by WooThemes is <strong style=\"\">FREE</strong>. All the software and plugins demonstrated in this WordPress course are free.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">What are we going to cover in this WordPress course?</strong>  </p>  <p>  \t                                                                    Before you get started I&#039;ll show you how to assess your eCommerce needs and have a plan of action for your new WordPress website project.  </p>  <p>  \t                                                                    I&#039;ll review the requirements of this course.  </p>  <p>  \t                                                                    I&#039;ll show you how to install WordPress and the Storefront theme.  </p>  <p>  \t                                                                    You will recreate the WordPress Storefront demo and you&#039;ll populate the store with the WooCommerce data.  </p>  <p>  \t                                                                    As an optional bonus, I will show you how to create and install a WordPress child theme.  </p>  <p>  \t                                                                    At the end of my course you&#039;ll have a customized WordPress eCommerce store.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Why should you choose Storefront?</strong>  </p>  <p>  \t                                                                                           Storefront is a <strong style=\"\">FREE</strong> WordPress theme integrated with WooCommerce. Storefront was developed by <strong style=\"\">WooThemes</strong> the makers of WooCommerce.  </p>  <p>  \t                                                                                                       Perhaps you have some items to sell and you would like to get your feet wet by setting up your own online WordPress store. The default <em style=\"\"><strong style=\"\">Storefront design is clean and simple</strong></em>. It&#039;s an excellent starting point from which to customize your store to match your brand, whether that&#039;s using the WordPress customizer or a custom plugin / child theme.  </p>  <p>  \t<strong style=\"\">Storefront is a flexible and simple solution.</strong>  </p>  <p>  \t                                                                                                       Maybe you have a bricks and mortar store and you haven&#039;t found the right software. Storefront is a <em style=\"\"><strong style=\"\">simple solution</strong></em> to help you get started.  </p>  <p>  \t<strong style=\"\">Storefront can be an excellent alternative</strong>  </p>  <p>  \t                                                                                                       Perhaps you have an outdated or antiquated online store and you would like to upgrade to something new and easy to use. <em style=\"\">Storefront can be an excellent alternative to get you fitted with the latest WordPress theme and functionality</em>.  </p>  <p>  \t<strong style=\"\">Perhaps you want to sell eCommerce WordPress solutions to your clients.</strong>  </p>  <p>  \t                                                                                                       Maybe you are a graphics or web designer and you want to start selling eCommerce WordPress solutions to your clients. <strong style=\"\"><em style=\"\">With Storefront you can create a child theme as I show you in this course and make your CSS customizations.</em></strong> Or you can utilize the built in WordPress customizer to make your design change.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Extra bonus resources and worksheets available</strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\">Download the WordPress eCommerce Project Checklist</strong>:</em> The checklist will help you organize and successfully launch your new online WordPress store. The checklist provides a list of essential steps, product descriptions, and customer support service tasks to be performed. You can download or print the checklist for ongoing reference.  </p>  <p>  \t<strong style=\"\"><em style=\"\">Download the WordPress Website Creative Brief Worksheet:</em></strong> The brief will help you define the purpose and goals of your WordPress eCommerce project. By completing the worksheet you will have a clear plan to remain focused and on track.  </p>  <p>  \t<strong style=\"\"><em style=\"\">Download the Contents Worksheet</em>:</strong> You&#039;ll be able to generate ideas for your site structure. The worksheet will help you organize and write your site content in a cohesive manner. This ensures that you will have a well structured website.  </p>    <hr style=\"\">  <p>  \t<strong style=\"\">Trademarks Disclaimer  </strong>  </p>  <p>  \t                                                                                                             WooThemes<strong style=\"\"><em style=\"\">™</em></strong> is the market leader in premium themes and plugins for WordPress. The instructor of this course has no affiliation with WooThemes<strong style=\"\"><em style=\"\">™</em></strong>.  This course is training for WooThemes<strong style=\"\"><em style=\"\">™</em></strong>/WooCommerce<strong style=\"\"><em style=\"\">™</em></strong> new Storefront theme.  </p>  <p>  \t                                                                                                             WordPress is a registered trademark of Automattic Inc.<br style=\"\">  \t                                                                                                               This instructor is not affiliated with or sponsored by Automattic or the WordPress open source project.  </p>  <hr style=\"\">  <p>  \t                                                                All future updates to this course are free – <strong style=\"\">And there&#039;s a 30 day absolutely no questions asked full money back guarantee - my personal guarantee of your satisfaction! </strong>  </p>", 
    "end_date": null, 
    "title": "WordPress eCommerce with Storefront for WooCommerce Beginner", 
    "price": "20.00", 
    "instructors": "Susan Cork", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358076_802e_9.jpg", 
    "course_url": "https://www.udemy.com/install-storefront-wordpress-theme-integrate-woocommerce/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-27T21:53:21Z"
}