{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Update April/2015</strong>: This course is now the most popular and highest-rated WordPress eCommerce and WooCommerce course on Udemy (9000+ students).  When you take the course you will see why: we teach you in a progressive way that allows you to quickly pick-up the basics in order to create your first ecommerce store in as little as 15-30 minutes -- while at the same time covering almost the entire WooCommerce functionality in the more advanced videos.  This course will save you hours of trial-and-error in setting up your first ecommerce store, and may also give you ideas that will enhance your sales and help manage your site and user-experience better.  Equally important, we will show where another type of ecommerce solution is best.  </p>  <p>  \t      ______  </p>  <p>  \t        This course takes you step-by-step through the process of adding a  shopping cart to your WordPress website and collecting money for your  products or services.  </p>  <p>  \t                     We start by reviewing the most common shopping cart  systems used on WordPress websites.  We explore when you should choose a  WordPress shopping cart plugin (such as WooCommerce) and when you would  choose another type of cart (such as, a hosted cart solution).  </p>  <p>  \t                     Then we discuss various WordPress cart plugins,  leading up to a thorough review and  demonstration of the recommended  solution, WooCommerce.  </p>  <p>  \t                     Then we proceed towards mastery of WooCommerce, as follows:  </p>  <p>  \t                     The <strong style=\"\">Quick Start Section</strong> shows you  all the basics: shop page layouts and shortcodes, adding products and  images, the checkout process for digital downloads and shippable  products, PayPal configuration, and more.  We also discuss the themes  that will work best.  </p>  <p>  \t                     The <strong style=\"\">Reference Section</strong> goes into more  detail, including the advanced products types &amp; shipping methods,  taxes and tax classes, coupons, order &amp; inventory management,  product reviews and more.  </p>  <p>  \t                     And finally the <strong style=\"\">WooCommerce Styling and Programming Section</strong>  provides more advanced information (some of it for programmers, but  presented for a non-programming audience) on creating your own email  templates, working with Actions and Hooks, and CSS styling of your site.  </p>  <p>  \t                     This is the most comprehensive, impactful and to-the-point WordPress eCommerce course on the web.  Why?  Because:  </p>  <ol style=\"\">  \t<li style=\"\"> We only show you what you need to know.  WooCommerce leads the  other WordPress shopping carts by a wide margin.  There is rarely any  need to choose another shopping cart plugin (except for simple PayPal  sites, which we cover as well).  So why waste your time?</li>  \t<li style=\"\">    The videos are quite comprehensive -- for instance we show you  the exact steps to take to configure PayPal to properly accept your  digital download orders.</li>  \t<li style=\"\">    Our professionally-produced videos get to the point.  We will save you hours of research and trial &amp; error.</li>  </ol>  <p>  \t                     This is one of WP Academy&#039;s most recent and best  courses.  We hope you enjoy it.  It is part of a larger effort called  the WordPress Business Encyclopedia , which is a complete web technology  training system.  Please  visit us on the web and check out the free resources including the  WordPress Business Toolkit.  </p>  <p>  \t                     Here is the full content list:  </p>  <p>  \t<strong style=\"\">Section 1: Introduction to WordPress Shopping Carts</strong>  </p>  <ul style=\"\">  \t<li style=\"\">  Choosing a WordPress Shopping Cart Plugin</li>  </ul>  <p>  \t<strong style=\"\">Section 2: WooCommerce Quick Start</strong>  </p>  <ul style=\"\">  \t<li style=\"\">  WooCommerce Review Part 1</li>  \t<li style=\"\">  WooCommerce Review Part 2: Popular Extensions; MarketPress &amp; Shopp comparison; Total cost of ownership</li>  \t<li style=\"\">  Installing WooCommerce, WooCommerce Pages</li>  \t<li style=\"\">  Products, Product Categories &amp; Images</li>  \t<li style=\"\">  WooCommerce Settings &amp; Shop Page Layouts</li>  \t<li style=\"\">  Shop Page Shortcodes &amp; WooCommerce Widgets</li>  \t<li style=\"\">  Checkout Process; PayPal Payment Gateway</li>  \t<li style=\"\">  Digital Downloads</li>  \t<li style=\"\">  Flat-Rate Shipping</li>  \t<li style=\"\">  WooThemes or Other Theme?</li>  </ul>  <p>  \t<strong style=\"\">Section 3: WooCommerce Reference</strong>  </p>  <ul style=\"\">  \t<li style=\"\">  Types of Products, Upsells &amp; Cross-sells, Grouped Products</li>  \t<li style=\"\">  Product Attributes &amp; Variations; Layered Nav Widgets</li>  \t<li style=\"\"> Advanced Shipping, Shipping Classes, Bulk Product Editing</li>  \t<li style=\"\"> Taxes &amp; Tax Classes</li>  \t<li style=\"\"> Coupons</li>  \t<li style=\"\"> Order Management &amp; Reporting</li>  \t<li style=\"\"> Inventory Management</li>  \t<li style=\"\">Product Reviews</li>  \t<li style=\"\">WooCommerce User Roles</li>  </ul>  <p>  \t<strong style=\"\">Section 4: WooCommerce Styling &amp; Programming</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Email Template Customization</li>  \t<li style=\"\">WooCommerce Programming Basics: Hooks, Actions, Filters</li>  \t<li style=\"\">WooCommerce CSS Styling, Theme Compatibility</li>  </ul>", 
    "end_date": null, 
    "title": "WordPress eCommerce with WooCommerce ", 
    "price": "20.00", 
    "instructors": "Marc Beneteau", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/174116_3b6b_3.jpg", 
    "course_url": "https://www.udemy.com/woocommerce-free/", 
    "currency": "USD", 
    "subject_name": [
        "E-Commerce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-27T23:02:42Z"
}