{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong style=\"\">How to Capture Amazing Sunset Images.</strong></p>    <p style=\"\">Come along with me and I”ll show you everything you need to know, to capture these amazing sunsets. Never miss another beautiful sunset again. Your friends and family will be so impressed by your creativity.</p>    <p style=\"\"><strong style=\"\">Capturing an Amazing Sunset can be Frustrating</strong></p>    <p style=\"\">Are you frustrated with the dull-looking sunset photos you are getting with you digital SLR camera? Have you seen an amazing sunset, photographed it and then when you got home were disappointed in the final images - that looked nothing like the impressive sunset you just witnessed?</p>    <p style=\"\"><em style=\"\">&quot;Where is the best place to photograph sunsets, what camera gear should I bring along, what camera settings are best &amp; how do I edit these images so that they look awesome?&quot; If you have ever asked any of these questions then this course is definitely for you.</em></p>    <h5 style=\"\">I will teach you how to photograph an Amazing Sunset - my way, creating the most amazing, visually stunning images every single time.</h5>    <p style=\"\"><strong style=\"\">My Sunset Photography System - it works!</strong></p>    <p style=\"\">Come along with me on a real sunset photo shoot, where I show you what works when it comes to photographing sunsets. Use my system to create amazing sunset images every single time.</p>    <p style=\"\">This step-by-step video series covers the following:&nbsp;The equipment, location, techniques and tricks for capturing the sunset, HDR, Long Exposure, post processing and then sharing these images online – and getting a great response!</p>    <p style=\"\">I have even included my original images from this shoot – download and edit along with me.</p>    <p style=\"\"><strong style=\"\">Short &amp; Sweet Videos Lessons</strong></p>    <p style=\"\">Included are 7 short videos (average length 4-10 minutes), quiz&#039;s and original images that you can edit step by step with me.</p>    <p style=\"\"><strong style=\"\">Easy Self-Paced Learning</strong></p>    <p style=\"\">Take this course at your own pace, come back and re-watch sections &nbsp;if you like, or watch the entire course in one-go. It&#039;s recommended that you watch one section at a time and then go out and practice what you have learned.</p>    <p style=\"\"><span style=\"\"><strong style=\"\">If you have ever wanted to know the secrets to capturing amazing sunset images, then this course is for you. I reveal all of my techniques here - nothing has been left out.</strong></span><br style=\"\">  </p>    <p style=\"\"><span style=\"\">Recommend taking my&nbsp;<a href=\"http://www.udemy.com/essential-photography-skills-beginner-digital-slr-training\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Essential Photography Skills Course</a><span style=\"\">&nbsp;(Introduction to digital SLR photography) before taking this course, unless you already know the basics of how your camera works.</span></span></p>    <p style=\"\"><span style=\"\"><strong style=\"\">Who is Brent?</strong></span></p>    <p style=\"\"><span style=\"\">Brent is an award winning photographer who runs a very successful photography studio near the beach in Australia &amp; has published a sold-out landscape photography book (included in this book are many sunset images).</span></p>    <p style=\"\"><strong style=\"\">Are you ready to take your sunset photography to the next level?</strong><span style=\"\"><br style=\"\">  </span></p>", 
    "end_date": null, 
    "title": "Amazing Sunset Photography", 
    "price": "30.00", 
    "instructors": "Brent Mail", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46221_2230_7.jpg", 
    "course_url": "https://www.udemy.com/amazing-sunset-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Landscape"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-17T23:31:06Z"
}