{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "\n\n<p><em>\"Charlie, you are one of the best instructors I have ever had regardless of subject. You never talk over my head and sound like you actually want me to learn and not just earn yourself a pay check. I thank you. - Gerald S.<br><br></em></p><p>Do you love nature and photography and wish to make money photographing the great outdoors? Would you like to make outdoor and nature photography your career?<br></p>\n\n\n\n<p>  \t<strong>Learn how to be a professional outdoor and nature photographer!</strong>  </p>\n\n\n\n<p>  \t                                    There is no more fulfilling \"career\" than being a full time Outdoor and Nature Photographer.  </p>\n\n\n\n<p>  \t                                    ·Do you want to get published in magazines, brochures, and calendars?  </p>\n\n\n\n<p>  \t                                    ·Do you want to photograph assignments for magazines and outdoor product companies?  </p>\n\n\n\n<p>  \t                                          I have been published in over 1000 calendars, many of the major outdoor magazines, advertising  brochures, photographed magazine assignments and outdoor product catalogs, and I have founded and co-founded two stock photo agencies.  </p>\n\n\n\n<p>  \t                  I can show you how to create images for the markets and GET PAID!!!  </p>\n\n\n\n<p>  \t<strong>You will learn:</strong>  </p>\n\n\n\n<p>  \t                                          ·How the outdoor and nature photography markets work.  </p>\n\n\n\n<p>  \t                                          ·Techniques and approaches for making marketable images of nature and outdoor adventure.  </p>\n\n\n\n<p>  \t                                          ·What type of camera equipment and other gear is needed.  </p>\n\n\n\n<p>  \t                                          ·How to organize your stock photos and set up your business.  </p>\n\n\n\n<p>  \t                                          ·How to make even more money with concept photography  </p>\n\n\n\n<p>  \t                                          ·How to create marketable compositions  </p>\n\n\n\n<p>  \t                                          ·How to master natural light and supplemental flash and strobe lighting  </p>\n\n\n\n<p>  \t                                          ·How to master the technical sides of photography  </p>\n\n\n\n<p>  \t<strong>Marketing and promotion is crucial to the success of any business and I will show you several strategies that work. </strong>  </p>\n\n\n\n<p>  \t                                          ·How to market yourself and your business  </p>\n\n\n\n<p>  \t                                          ·How to price and negotiate a photo sale  </p>\n\n\n\n<p>  \t                                          ·How to be represented by stock photo agencies  </p>\n\n\n\n<p>  \t<strong>One key ingredient that will insure your success as an outdoor photographer is photography assignments. <em>YOU</em> will learn:</strong>  </p>\n\n\n\n<p>  \t                                          ·How to bid on photo assignments  </p>\n\n\n\n<p>  \t                                          ·How to photograph outdoor products and portraits  </p>\n\n\n\n<p>  \t                                          ·How to plan and prep for the big assignment  </p>\n\n\n\n<p>  \t                                          ·How to create a portfolio and present it in a meeting  </p>\n\n\n\n<p>  \t                                          ·How to find models  </p>\n\n\n\n<p>  \t                                          This course also includes a downloadable stock photo pricing guide to help you determine a fair and accurate price for your photographs.  </p>\n\n\n\n<p>  \t<strong>What are the course requirements?</strong>  </p>\n\n\n\n<p>  \t                                          ·Passion!  </p>\n\n\n\n<p>  \t                                          ·A love for the outdoors, nature, wildlife, and the environment  </p>\n\n\n\n<p>  \t                                          ·A sense of adventure and love of travel  </p>\n\n\n\n<p>  \t                                          ·A willingness to work hard  </p>\n\n\n\n<p>  \t                                          ·Oh, a camera, tripod, a computer, and software  </p>\n\n\n\n<p>  \t<strong>What’s included?</strong>  </p>\n\n\n\n<p>  \t                                          ·Over 125 videos and 10 audio lectures</p>\n\n\n\n<p>  \t                                          ·A downloadable pricing guide  </p>\n\n\n\n<p>  \t                                          ·Examples of top selling images  </p>\n\n\n\n<p>  \t                                          ·See a photograph my friend captured that has earned over $900,000. (That's not a typo)  </p>\n\n\n\n<p>  \t                                          ·Strategies for pricing and selling your photography  </p>\n\n\n\n<p>  \t                                          ·Strategies for succeeding in the business  </p>\n\n\n\n<p>  \t                                        At the end of this course you will be able to plan your business strategy, organize and market your business,  and submit your quality photographs to publications and clients.<br>  </p>\n\n\n\n<p>  \t                                        You get full unlimited access to this course forever including all future video lectures.!<br>  </p>\n\n\n\n<p>  \t                                          And in case you did not know, <strong>Udemy has an unconditional 30 day money-back guarantee</strong> and it is not your standard guarantee, it's my promise to you that you will have the needed information to succeed in outdoor photography.  </p>\n\n\n\n<p>  \t<strong>______________________________________________________________________</strong></p>\n\n\n\n<p>What they say:<br></p>\n\n<p>This was by far the best course I have taken! – Joe C.<br></p>\n\n\n\n<p>Better than ever expected. This course has taken me from zero knowledge to understanding how a huge amount of work goes into even one promo shot in a catalogue. This course does not hold back or sugar coat the work behind the great photos or give you constant reassurance - it honestly teaches all areas of the experience from taking better photos for your own benefit through to what the most professional client would require. I'm very grateful for Charlie Borland to be so helpful and present in such a lovely manner it makes the experience very rewarding and easy. -Michelle C.</p>\n\n\n\n<p>Hi Charlie,<br>I'm not quite finished getting through all of the video but what a tremendous amount of work you have gone through for this course!<br>Not to mention all of the content. It's simply a staggering variety of such valuable, insightful and important information.<br>I wold have been bumbling about forever without your course, what a difference it will make as I begin and go forward from here.<br>Thank you for all of your time and effort and for sharing your knowledge so generously, it is greatly appreciated!!!<br>-Angela P.</p>\n\n\n\n<p> __________________________________________</p>", 
    "end_date": null, 
    "title": "How to be a Professional Outdoor and Nature Photographer", 
    "price": "50.00", 
    "instructors": "Charlie Borland", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/298480_8e0a_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-professional-outdoor-and-nature-photographer/", 
    "currency": "USD", 
    "subject_name": [
        "Landscape"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-11T16:18:24Z"
}