{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t <em style=\"\">Learn to photograph and post-process landscape images from a pro!</em>  </p>  <p>  \t                   This class does one thing and it does it well: it shows Nicole&#039;s straightforward approach to photographing and processing landscape photographs. With her clear and approachable teaching style, she shows you how to process ten photographs from start to finish using Lightroom, and in some cases Photoshop, onOne Software&#039;s Perfect Photo Suite 7 and Nik HDR Efex Pro 2.  </p>  <p>  \t                  Throughout these videos you will learn several techniques, including:  </p>  <ul style=\"\">  \t<li>HDR Processing</li>  \t<li>Layer masking to hide and reveal elements of different layers</li>  \t<li>How to use Blending modes to change the way layers interact</li>  \t<li>Non-destructive dodging &amp; burning</li>  \t<li><strong style=\"\"><strong style=\"\"></strong></strong>Basic sky replacement</li>  \t<li>... and more!</li>  </ul>  <p>  \t           There is also an eBook included with even more insight behind the photography, gear and setup to create these photographs.  </p>  <p>  \t                 If you learn best by watching <em style=\"\">real</em> photographers at work, then this class is for you! Nicole holds nothing back and shares all of her tricks and stylization techniques while processing ten beautiful landscape photographs.  </p>  <p>  \t<strong style=\"\">Downloadable Content: </strong>All content with this course is completely downloadable. That way you can take it with you when you are on the road or away from an Internet connection.  </p>  <p>  \t<em style=\"\">The content included in this course (videos, eBooks, and any additional materials) are © 2013 Nicole S. Young (All Rights Reserved)</em>  </p>", 
    "end_date": null, 
    "title": "Light & Process: Landscape Photography", 
    "price": "50.00", 
    "instructors": "Nicole Young", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/82374_1c1a_6.jpg", 
    "course_url": "https://www.udemy.com/nicolesy-landscape-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Landscape"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-22T20:58:51Z"
}