{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t    Building an attractive, useful and usable website is difficult, and can take much time, thought and creativity. Even so, the quality of a site’s <strong>user interface</strong> can be the most important part of a site’s success. This is especially true as websites and web ‘apps’ become more complex, feature rich, and mobile responsive.  </p><p>This course begins with a detailed presentation of over 250 usability software tools. I have spent over a year researching and categorizing these tools, and have made this research available to you on my website. Many of the tools have no cost associated with them. Much of the course content will be referring to a lot of the better software tools and discussing when and where these tools can be best applied in the context of User Experience Design.</p><p>It is important to point out that I am not endorsing, promoting or encouraging anyone to buy or sign up for any of the software tools, books or resources that are presented on the site. The purpose of presenting the research and rankings of the software tools, books and resources, is to make you aware of the existence of such tools and to help you to make a decision on what types of tools will benefit you in the field of User Experience Design.</p><p>The topics presented in this course are not necessarily required to be viewed in a linear fashion. Feel free to choose topics that are of interest to you and view those lectures about which you would most like to learn.</p>  <ul>  \t<li>Wouldn’t it be great to have an updated list of virtually ALL usability <strong>software tools</strong>, and have them<br>  \t<ul>  \t\t<li>Separated into reasonable categories, and then</li>  \t\t<li>Ranked by popularity?</li>  \t</ul>  \t</li>  \t<li>Don’t you wish you knew which were the top, most up-to-date <strong>books</strong> on web usability and user experience (UX) design?</li>  \t<li>Couldn’t you benefit from knowing the latest <strong>research</strong> results on user  experience design?</li>  \t<li>Wouldn’t you like to know which operating systems and browsers are most used, so you can focus on ensuring that your sites work well on them?</li>  </ul>  <p>  \t                    This course not only provides a discussion of the best tools, books and research, but also ranks them to help you better understand which are most popular with your colleagues, including thousands of website designers and user experience (usability) professionals.  </p>  <p>  \t                    What makes this an <strong>advanced</strong> ‘user experience’ course?  </p>  <ul>  \t<li>We assume that you already know the basics or fundamentals of good user interface design for websites and web apps, so we will not waste your time by repeating what you already know,</li>  \t<li>We know that the world of user experience design is constantly changing, so we do not try to force ever-aging information into a static book or a limited training course,</li>  \t<li>We take full advantage of the most useful characteristics of the Internet by making it an integral part of the course, giving you access to Web-based information (dynamic content) that is updated even as you are taking the course,</li>  \t<li>We include the latest ideas, knowledge and expertise of the top usability and user experience experts, by including information from their best books, insights from their software tools, and perceptions gained from their latest research reports,</li>  \t<li>·Finally, we focus on the future by helping you to understand which are <em>currently </em>the most popular books and software tools<em>, </em>so you do not waste time on old ideas, outdated knowledge and last year’s ‘look and feel’,</li>  </ul>  <p>  \t                    Keep in mind that it is the most professional, state-of-the-art user interfaces that lead to <strong>excellent user experiences</strong>.  So prepare yourself to dive deep into an exciting, new training experience. Just click the blue ‘Take This Course’ button (upper right on this page), and let’s get started. Your view of ‘user experience’ will never be the same!  </p>", 
    "end_date": null, 
    "title": "Advanced User Experience (UX) Design", 
    "price": "25.00", 
    "instructors": "Dr. Bob Bailey", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/180510_2515_4.jpg", 
    "course_url": "https://www.udemy.com/advanced-user-experience-design/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-11T18:47:29Z"
}