{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong></strong><strong>CURSO ANALISANDO A CONCORRÊNCIA QUANDO A USABILIDADE - VÍDEO AULA</strong></p><p>O curso Analisando a concorrência quanto a Usabilidade é uma aula sobre como analisar a concorrência direta e indireta em relação à usabilidade e experiência do usuário, com o objetivo de conhecer as melhores práticas, assim como os pontos fortes a serem seguidos e os pontos fracos a serem evitados no desenvolvimento, 100% prático. O curso é em vídeo aulas, 100% a distância. Você recebe login e senha para acessar as aulas, logo após a aprovação de seu pagamento e pode estudar de onde quiser, a hora que quiser.</p><p><br></p><p><strong>Objetivos:</strong></p><ul><li>Conhecer a concorrência, seus erros e acertos em usabilidade</li><li> Ter ideais e novos conceitos para criar seu projeto de usabilidade e UX</li><li> Ter uma visão mais profunda da concorrência, para propor soluções mais funcionais.</li></ul><p><br></p><p><strong>Duração:</strong></p><p>O Curso Analisando a concorrência quando a Usabilidade em vídeo aulas tem carga horária total de 65 minutos.</p><p><br></p><p><strong>Público Alvo:</strong><br></p><p>O curso Analisando a concorrência quando a Usabilidade destina-se a designers, arquitetos da informação, desenvolvedores e gestores da área de tecnologia.</p><p><br></p><p><strong>Professor:</strong></p><p>Daniel Mendes é pós graduado em Marketing e graduado em Design industrial, geriu numerosos projetos de portais, sites e aplicativos móveis enfatizando a experiência do usuário e a gestão do conhecimento. Fundador da Fluida - agência digital e mobile e da plataforma Socialise.</p><p><br></p><p><strong>Conteúdo Programático:</strong></p>O curso traz o conceito de usabilidade e uma análise prática entre algumas marcas conceituadas no mercado de E-commerce, de forma que encontrem pontos fortes e pontos negativos afim de melhorar a usabilidade de seu site.<p><strong>Por que escolher a ComSchool?<br></strong></p><ul><li>Única escola no Brasil com cinco livros publicados na área digital</li><li>Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li>Programa inovador, fundamentado no conhecimento prático dos professores</li><li>Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li>Estude com alguns dos nomes mais influentes da Internet brasileira</li><li>A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas</li></ul>", 
    "end_date": null, 
    "title": "Analisando a concorrência quanto a usabilidade", 
    "price": "20.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/726018_7237_2.jpg", 
    "course_url": "https://www.udemy.com/analisando-a-concorrencia-quanto-a-usabilidade-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T19:45:55Z"
}