{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em><strong>JOIN OVER 1000 SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE!</strong></em></p><p>--------------------------------------------------------------------------------------------</p><p><strong>Course content is being updated every week! Suggestions for additional course content are highly appreciated!</strong></p><p>--------------------------------------------------------------------------------------------<br></p><p>In Android Material Design: Learn UX, UI &amp; Android Marshmallow course you're going to learn how to design mobile applications by going through all User Experience, User Interface Design techniques, and finally designing the whole application from very start to the very finnish. </p><p>Also, we‘re going to focus on Android Design and in particular Android Material Design, which is the latest visual language developed by Google.</p>  <p>Android Material Design was firstly introduced with Android Lollipop operating system, which is quite different from the older Android versions.  The latest Android Marshamallow OS is using Android Material Design guidelines and visual language, so we‘re going to cover what has changed and how we can design beautiful Android applications.</p>  <p>Also, in this course you‘re going to learn User Experience design principles and techniques, which will make your app not only beautiful, but also usable, useful and valuable for the users. </p>  <p>Finally, we are going to put everything together and go from the very start to the very finnish and design example Students 4 Students application by using User Experience Techniques, User Interface and Android Material Design guidelines. We‘re going to learn the process step by step without leaving any details behind. </p>  <p>But if it‘s not enough for you, we‘re also going to learn a little bit of coding to create a basic application which is going to be a perfect one to introduce you into some of the coding techniques for Android Lollipop and Marshmallow. </p>  <p>At the end of this course you will be able to turn your initial app idea into fully functioning Android Material Design based application which can be published to Google Play Store or just show it to your cat.</p>  <p>We created this course as a great resource for anyone, who wants to start their own career journey in UI/UX design, especially in mobile design business. Personally, I structurized this course and put myself into beginner’s shoes, with only practical and interactive lectures. </p><p>Feel free to go through course description, curriculum and I hope that I will see you inside this course!<br></p>", 
    "end_date": null, 
    "title": "Android Design: Master UI/UX Techniques and Material Design", 
    "price": "20.00", 
    "instructors": "Deimantas Brandišauskas", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434984_7b75_5.jpg", 
    "course_url": "https://www.udemy.com/android-material-design-ux-ui/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-28T16:12:14Z"
}