{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Here's what students have said:</p><p><em>\"This course is the most valuable UX course I've ever bought on Udemy!\"</em> - Jody T.<br></p><p><em>\"Brendan's course is AMAZING! It helped me land my first UX job!\" </em>- Phillip C.<br></p><p><em>\"First course, which I found useful from practical point of view. Not just some broad, abstract philosophical narrative about UX.\"</em> - Viacheslav M.<br></p><p><em>\"Great instructor! He's able to deconstruct complex ideas and easily break them down into digestible content. I really recommend this course for UX practitioners of all levels.\"</em> - Nutte<br></p><p><em>\"After viewing Brendan's lectures and completing the project, I felt much more confident about entering the field of UX and my project ended up being one of the best pieces in my portfolio. I used it during an interview to land my first internship\" </em>- Ana K.<br></p><p><em>\"The instructor's enthusiasm shines through as does his deep UX knowledge and real life experience. Certainly one of the most thoroughly thought out and well presented courses I have experienced on Udemy. I believe this course is suitable for beginners and UX practitioners as each can get different outcomes based on experience.\" </em>Simon C.<br></p><p><em>(All quotes from reviews below.)</em></p><p><strong>Description:</strong></p><p>User Experience, or UX, is an exciting field. It's essentially about empowering people to do the things they want to do, which is both fun and gratifying. And, <strong>having a great user experience drives business success</strong>.<br></p><p><strong>Learning UX, however, can be a challenge</strong>. Since it's a relatively young field, there's no real gold standard yet for how things are practiced, or taught, which can frustrate people who are just trying to learn things the right way, in order to apply UX immediately to what they're doing, as well as students looking to become practitioners.</p><p>I created this course because I believe your time is precious, and you shouldn't have to hunt around to get a practical foundation in UX. This course takes you through the <strong>key concepts and steps of UX, as they would occur across a real-world project</strong>, so you <strong>gain a complete understanding of how to practice UX</strong> - from Research, to Strategy, to Design.</p><p>There's a fair bit of material to share, but the content is mostly<strong> short, entertaining, to-the-point videos</strong>, followed by <strong>assignments where you'll apply what you're learning</strong> so it sinks in. And, I'm confident you'll like this material because I've already taught it to <strong>hundreds of professionals and university students</strong> who have<strong> enjoyed and benefited from it</strong><strong>.</strong></p><p>Whether you need to effectively learn UX and apply it immediately, or you're looking to supplement your skillset, or you're just curious about entering this fun and lucrative field, this course is designed for you</p><p>After taking the course you'll possess a powerful understanding of UX and the key activities related to the field. You'll also be able to take that knowledge, and put it to use to <strong>make better work and advance your career!  </strong>(And, you'll have some great portfolio pieces if you complete the assignments!)</p><p>See you in class!<br></p><p>- Brendan</p><p><em></em></p><p>** Course published 08/02/15 **<br></p>", 
    "end_date": null, 
    "title": "Become a UX Designer | Learn the Skills & Get the Job", 
    "price": "50.00", 
    "instructors": "Brendan Bolton-Klinger", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/52512_7152_10.jpg", 
    "course_url": "https://www.udemy.com/learn-real-world-ux/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-06T05:36:53Z"
}