{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>This <strong>UX course</strong> has just been launched on May 2015, <strong>last updated on April 5, 2016.</strong></em></p>\n\n<p>*Tip: Remember to<strong> add this course to your wishlist</strong> to be in the know of <em>Udemy special promo prices</em> ;)</p>\n\n\n\n<p>Our <strong>fast-growing community </strong>has <strong>more than 1,000 </strong><strong>students </strong>in<strong> less than 8 months. </strong>Our students include <strong>UXers from </strong><strong>global IT companies</strong> like <strong>Globant</strong>, <strong>Infragistics</strong>, <strong>Dokko Group</strong>, <strong>Elementary</strong>, <strong>DevSpark</strong>, <strong>Avenida</strong> and <strong>Ind-ie</strong>. Recently, even <strong>Microsoft </strong>has been recommending it!</p>\n\n\n\n<p>And there are <strong>a lot</strong><strong> more things to come...</strong></p>\n\n\n\n<p>****<br></p>\n\n\n\n<p><strong>Come with me on a journey to the UX</strong><strong> Consultancy fast-track ... in less than 4 hours!</strong></p>\n\n\n\n<p>I've teached about <strong>digital business strategy</strong> to <strong>thousands of students </strong>thru <strong>LaEscuelaTK</strong>, <strong>University of Palermo,</strong> <strong>ITBA </strong>(Technology Institute of Buenos Aires) and by my <strong>advanced UX Bootcamp</strong>: <strong>Solutionants</strong>. </p>\n\n\n\n<p>This is <strong>the work of my lifetime</strong> as an <strong>entrepreneur </strong>&amp; <strong>UX Project Leader</strong>. </p>\n\n\n\n<p>This <strong>system provides</strong> tested-in-the-field<strong> skills of</strong> <strong>management on</strong> <strong>product &amp;</strong> <strong>service design</strong>, and also has <strong>everything I know about self-management.</strong></p>\n\n\n\n<p>****</p>\n\n\n\n<p>Have you heard about the mighty “<strong>Senior UX Design Strategist</strong>\"? The one that everybody admires for being able to <strong>understand and manage</strong> the<strong> client</strong>, the <strong>team</strong> and the <strong>product</strong>... everything <strong>at the same time</strong>?</p>\n\n\n\n<p>I've been working in <strong>UX</strong>-related projects since 2009. Some of them were amazing, others were sh1t. And after all, I came to understand what REALLY works.</p>\n\n\n\n<p>My experiences have really paid off... and I decided to share them here <em>for the very first time</em>. </p>\n\n\n\n<p>I worked with a wide range of clients: <strong>from local SME's and StartUps</strong> in my<strong></strong> hometown of Buenos Aires, Argentina<strong> </strong> to <strong>Fortune 500</strong> companies from <strong>USA's</strong> <strong>Silicon Valley</strong>, <strong>United Kingdom</strong>, <strong>Netherlands</strong>, <strong>Israel</strong> and <strong>Chile</strong>. </p>\n\n\n\n<p>I've gone <strong>from </strong><strong>selling products</strong> as a digital marketer in MercadoLibre, <strong>to </strong><strong>lead</strong> a <strong>software development</strong> team for several of the <strong>most important banks in the world.</strong> </p>\n\n\n\n<p>That was before I've decided to <strong>create the first advanced UX practicum</strong><strong> in spanish</strong>, <strong>Solucionantes</strong>.</p>\n\n\n\n<p>So, <strong>I know a way to work it.</strong></p>\n\n\n\n<p>Every single <strong>technique</strong> which I reveal in this course is <strong>easy to</strong> <strong>put in place in minutes</strong> - and aims to give you <strong>instant returns</strong>.</p>\n\n\n\n<p>All my knowledge is shown in the lectures, nothing is kept secret. In this <strong>UX course</strong> I reveal ALL I know, and as I test new things, those that are successful are added to the course - <strong>at no extra cost to you! </strong>This is <em>a course that will continue to grow</em>.</p>\n\n\n\n<p>As well as the <strong>Udemy 30-day guarantee</strong>, you have my personal promise that you will be delighted by what you'll learn in the next 4 hours ... and <strong>you'll be shaming yourself if you already are a UX Design Consultant</strong> and have been missing out on this fabulous potential.</p>\n\n\n\n<p>****</p>\n\n\n\n<p>What this course is <strong>not</strong>:</p>\n\n\n\n<p>- This <strong>UX course</strong> does not cover items that are basic about <strong>UX </strong>Design. <strong>I'll present you management techniques, strategies and tactics.</strong></p>\n\n\n\n<p>- I will not make one-on-one coaching or consultancy. <strong>I </strong><strong>understand that for that, a written response is not enough. </strong></p>\n\n\n\n<p>- This is <strong>not an english class</strong>: my english is kinda imperfect. I'm from Argentina, and you'll notice some errors. But please, don't let this be a blocker in trying the <strong>value of the contents that I share.</strong> Remember that <strong>you can always ask for a 30-day refund from Udemy</strong>, <strong>no questions asked</strong>.</p>\n\n\n\n<p>- I barely appear on camera:<strong> I like to get “to the meat\" when I teach</strong>, to get each minute of each video <strong>full of value</strong>.</p>\n\n\n\n<p>If you want a <strong>complete system to work, crafted in the field</strong>- you need to get this course now.</p>\n\n\n\n<p>You'll even get a complete listing of all the <strong>free “Tools of the trade\" </strong>that I use in my daily <strong>UX </strong>work.</p>\n\n\n\n<p><strong>Every minute you delay is actually COSTING you money...</strong></p>\n\n\n\n<p><strong>Enrol now!</strong></p>", 
    "end_date": null, 
    "title": "Become a Senior User Experience (UX) Design Strategist", 
    "price": "50.00", 
    "instructors": "Mariano Goren", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461142_5ae8_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-an-user-experience-ux-consultant-and-strategist/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-28T03:20:24Z"
}