{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t    Flat design is very much in vogue these days. More than half of the websites out on the internet are using Flat design interfaces including Microsoft, Apple, Facebook and others. As a designer, it is good to keep ourselves upgraded with the trends.  </p>  <p>  \t    It is generally easier to find courses which simply teach you how to use Photoshop or illustrator. But how exactly made a designer to pick the color he used? What made him end up with a great design that the world admires? This is what the course focuses on. I made this course from the view point of a learner.  </p>  <p>  \t    I don&#039;t focus so much on using a software. Instead, I focus on teaching the principles which make you kick-start quality flat design illustrations, graphics or websites (keep in mind that I don&#039;t teach you how to code websites either)  </p>  <p>  \t    What exactly are you going to learn from this course?  </p>  <p>  \t    You will learn the fundamental principles, limitations, and the core aspects of flat design. Then, I will walk you through the creation of a flat illustration using a reference photograph. We&#039;ll learn about choosing the right colors, which is a very important aspect of design. Finally, we&#039;ll design a webpage using the techniques we have learnt.  </p>  <p>  \t    Lets get started and see you inside.  </p>", 
    "end_date": null, 
    "title": "Beginner's guide to Flat Design", 
    "price": "20.00", 
    "instructors": "Creative  Dunes", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/233706_3177_4.jpg", 
    "course_url": "https://www.udemy.com/beginners-guide-to-flat-design/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-30T09:22:10Z"
}