{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">In this 3 hour course, I will go through the most effective persuasive design patterns and explain how you can easily apply them to your own design. You will learn the underlying psychological principles that drive us toward action.</p><p style=\"\"><strong style=\"\">You will learn how to design for engagement</strong></p><p style=\"\">The starting point will be in psychology rather than in graphical design. We will examine how we are as humans: how we think. You will learn what motivate us <em style=\"\">when</em> we make decisions and <em style=\"\">how </em>we make decisions. After this course, you will be able to apply this principles to make seductive user experiences, that drive users toward action.</p><p style=\"\"><strong style=\"\">The full life-cycle</strong></p><p style=\"\">The appropriate approach to engaging your users depend on where they are in your product&#039;s lifecycle. We will examine all stages of your user-relationship:</p><ul style=\"\"><li style=\"\">How to get people onboard</li><li style=\"\">How to get people started and discovering all your product has to offer</li><li style=\"\">How to make them stick around (and love your product)</li></ul><p style=\"\"><strong style=\"\">An always growing course</strong></p><p style=\"\">I believe in creating the best possible course for you to enjoy. This is why I will continuously be adding more lessons. If you liked the course in its current state then be sure to buy it now, to get free access to all existing and future lessons at the current low rate.</p>", 
    "end_date": null, 
    "title": "Build Persuasive Products", 
    "price": "35.00", 
    "instructors": "Anders Toxboe", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436858_7cf7_2.jpg", 
    "course_url": "https://www.udemy.com/designing-engaging-user-experiences/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T20:00:48Z"
}