{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Are you ready to blow people&#039;s minds?</strong>  </p>  <p style=\"\">  \t        Go from amateur to <strong style=\"\">&quot;iPhone App Design Badass&quot;</strong> by using the power of prototypes. Learn to take a blank page and transform it into a complete, high-fidelity, and interactive prototype on your phone.  </p>  <ul style=\"\">  \t<li style=\"\">Design iOS assets from scratch using flat design (so trendy).</li>  \t<li style=\"\">Create complete flows and pixel-perfect screens (so sharp!).</li>  \t<li style=\"\">Prototype your creation on any smartphone (so smooth).</li>  \t<li style=\"\">Reproduce amazing transitions and interactions with no coding at all (so smart).</li>  </ul>  <p style=\"\">  \t<em style=\"\"><span style=\"\">(Warning: High Risk of Mind Explosions)</span></em>  </p>  <p style=\"\">  \t                  I&#039;ll walk you through the entire process, while skipping the boring theoretical knowledge. You will go straight to the juicy stuff, and start building the app of your dreams right away. For the prototype, we&#039;ll be using the <strong style=\"\">free</strong> tool <strong style=\"\">Marvel App</strong> (coming soon: InVision) and the design will be build on Adobe Illustrator (free trial available).  </p>  <p style=\"\">  \t<strong style=\"\">So, why did I create this course?</strong>  </p>  <p style=\"\">  \t        Working as a designer, documentation is often the main deliverable for clients. The problem is that when dealing with complicated interactions, documents get bulky and hard to read (google search: boring). Nobody wants to see an app on paper, they want to play with it on their phone; tap, swipe, scroll, and do a little dance. That’s why I found that creating quick mock-ups and prototypes were a more powerful way of telling a story. People are amazed to see the idea in action and you end up looking like a total champ.  </p>  <p style=\"\">  \t<strong style=\"\">Who is this course for?</strong>  </p>  <p style=\"\">  \t                              This course was made for beginner to advanced designers who want to improve their skill set and want to show how their creations actually feel on a phone. Or for anyone that wants to mock-up their ideas in a realistic way.  </p>  <p style=\"\">  \t                              Entrepreneurs will find this course useful to bring their dreams to the real world in an easy way. Pitching a prototype to investors will have them writing checks in no time.  </p>  <p style=\"\">  \t                              This course will also prove valuable for UX and user testing. Upon completion, your designs will be transformed into interactive, high-fidelity products -  without the use of expensive programmer$$$.  </p>  <p style=\"\">  \t<strong style=\"\">  What you’ll learn  </strong>  </p>  <p style=\"\">  \t                              In this course we’ll start from a blank screen until we have a complete iPhone 6 app. You will follow along through the entire process.  </p>  <p style=\"\">  \t                              We&#039;ll build a fashion shopping app following common iOS 8 patterns in navigation, animations, layouts, icons and graphics, buttons, interactivity and even color and typography. We’ll prototype a signup flow, an onboarding screen, discovery flow, search screens, and user settings. We’ll create product detail screens, brand pages, a selection menu, a tabbed menu, an image slideshow, and you&#039;ll even be able to put your smiling mugshot as a profile pic. Sweet, right?  </p>  <p style=\"\">  \t<strong style=\"\">Prototyping is powerful</strong>  </p>  <p style=\"\">  \t        Creating a prototype as a mock-up or final delivery allows for greater interaction with the product and a better understanding of how it works. It&#039;s an impactful way to present an experience or tell a story. <em style=\"\">People know how to interact with products.</em>  </p>  <p style=\"\">  \t      Stop documenting. Start prototyping.  </p>  <p style=\"\">  \t                              Take a look at the introductory video and take my free preview. I look forward to seeing you inside.  </p>", 
    "end_date": null, 
    "title": "Design and Prototype an iOS8 Mobile App on Illustrator", 
    "price": "20.00", 
    "instructors": "Pablo Stanley", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/328832_598a_9.jpg", 
    "course_url": "https://www.udemy.com/mobileprototype/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T01:54:03Z"
}