{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t   Good information architecture is key to creating engaging, easy-to-use and intuitive websites. This online course, comprising 10 easy-to-follow lectures, will walk you through the card sorting process.  </p>  <p style=\"\">  \t   Card sorting is a professional exercise undertaken with participants that determines the best navigational structure (formally called ‘information architecture’) for your site. Card sorting can be carried out face-to-face, or online using a software program called OptimalSort. In this course, you will learn how to master both methods.  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t   Developing an Information Architecture with Card Sorting also comes with resources, such as a moderation guide and research templates, created and used by the U1 Group consultancy team.  </p>  <p style=\"\">  \t <strong style=\"\">The benefits of card sorting</strong>  </p>  <p style=\"\">  \t   Carrying out card sorting prior to web design and development enables you to:  </p>  <ol style=\"\">  \t<li style=\"\">See how users map out relationships between your content</li>  \t<li style=\"\">Figure out where users think content should (or shouldn’t) sit</li>  \t<li style=\"\">Observe what navigation paths don’t make sense to users and why</li>  \t<li style=\"\">Learn the language that users label categories of information with.</li>  </ol>  <p style=\"\">  \t   Through this research, you gain insight on how to create the most intuitive Information Architecture possible. The result is a user-friendly website structure that you can rest assured people will want to come back to, again and again.  </p>  <ul style=\"\">  \t<li style=\"\">You’ll hear comments like: “Wow! I can actually find the content I need!”</li>  \t<li style=\"\">You’ll start seeing an increase in conversion rates</li>  \t<li style=\"\">You’ll lower incoming phone and email queries</li>  \t<li style=\"\">You’ll improve the overall customer experience, which builds advocacy.</li>  </ul>  <p style=\"\">  \t   …just by understanding how to best present content on your website, thanks to card sorting. To get started, download our course now!  </p>", 
    "end_date": null, 
    "title": "Developing an Information Architecture with Card Sorting", 
    "price": "50.00", 
    "instructors": "U1 Group, Joji Mori", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/236914_a7bc_4.jpg", 
    "course_url": "https://www.udemy.com/developing-an-information-architecture-with-card-sorting/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-04T05:19:28Z"
}