{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Gamification: the hottest marketing trend</strong>  </p>  <p>  \t<strong style=\"\">- learn how to win new audiences and engage existing customers.</strong>  </p><br style=\"\">  <p>  \t      LIMITED OFFER - <strong style=\"\">3 BONUSES</strong> INCLUDED IN COURSE!  </p>  <ul style=\"\">  \t<li>BONUS #1 - Full book about Gamification for FREE</li>  \t<li>BONUS #2 - Certificate of getting this course done</li>  \t<li>BONUS #3 - Great gamification idea!</li><br style=\"\">  </ul>  <p>  \t<strong style=\"\">About the course</strong>  </p>  <p>  \t    You&#039;ll discover a series of handy tips and dozens of real examples of businesses that used gamification to great results.  </p>  <p>  \t    This course features both a wealth of expert knowledge and many fitting case studies that prove gamification is a necessary component in current marketing.  </p>  <p>  \t        We have years of hands-on experience in gamification, and would love to share it with you to help you design a gamification strategy tailor-made for your customers, whether your business is an online retail store, small local flower shop, advertising agency or barber&#039;s.  </p>  <p>  \t        Course is full of valuable tidbits and reliable knowledge that will let you understand your customers and their choices and approach them in a way that win their affection. As the average consumer becomes indifferent to standard advertisement, it&#039;s time you used something special and remarkable to get the results.  </p>  <p>  \t<strong style=\"\">Follow the emotions...</strong>  </p>  <p>  \t  If you&#039;re thinking of introducing a loyalty program, building up a brand identity or engaging customers in things they were avoiding before, there are two elements to remember about: the narrative and fun. They both underpin the aspect that drives customers: emotions.  </p>  <p>  \t  The best loyalty programs can engage clients in fun on a cerebral level. Good gamification engages you into wanting to achieve a goal. That&#039;s the thing you focus on: doing something. Rewards only come later.  </p>  <p>  \t  When you know what motivates your customers, you can offer them absorbing gamification that will encourage them to fight for a better status and appreciation in your company. Priority customer service? A lifelong discount on company products and priority unlimited access? What about being personally greeted by the chef in a prestigious restaurant? Customers are willing to do a lot to gain these privileges, and that&#039;s why you ought to give them a chance to do it.  </p>  <p>  \t<strong style=\"\">Go for it!</strong>  </p>", 
    "end_date": null, 
    "title": "Gamification - engage customers in your business!", 
    "price": "20.00", 
    "instructors": "Infolia Business Academy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/203004_a304_3.jpg", 
    "course_url": "https://www.udemy.com/gamification-course/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-22T07:11:34Z"
}