{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Learn how to carry out one of the most in-demand user experience techniques — the Usability Expert Review. </strong>  </p>  <p style=\"\">  \t          Knowing how to competently carry out an expert review is a skill that should be in every UX consultant&#039;s toolbox.  </p>  <p style=\"\">  \t                Expert reviews are a great way to identify &quot;usability bloopers&quot; with a product or web site. They are quick, cost-effective and provide an immediate sanity check for the design. Expert reviews are also an ideal way to ensure that a product or web site will meet usability standards.  </p>  <p style=\"\">  \t                 But many people find it difficult to identify specific usability issues from generic usability heuristics. Beginners also find it hard to derive action-oriented recommendations that can be passed to the design team.  </p>  <p style=\"\">  \t                 This seminar reveals <strong style=\"\">the practitioner secrets behind expert reviews</strong> and will teach you how to think like a usability expert.  </p>  <ul style=\"\">  \t<li style=\"\">Appreciate the difference between a <strong style=\"\">usability inspection</strong> and someone’s <strong style=\"\">personal opinion</strong>.</li>  \t<li style=\"\">Learn and practice some <strong style=\"\">quick techniques</strong> for carrying out usability reviews of prototypes and finished products.</li>  \t<li style=\"\">Apply Jakob Nielsen’s <strong style=\"\">heuristic evaluation technique</strong> to software, products and web sites.</li>  \t<li style=\"\">Compare Nielsen&#039;s heuristics with other sets of guidelines, like ISO’s 7 dialogue principles, Shniederman’s 8 golden rules of dialog design and Tog’s 16 principles of interaction design</li>  \t<li style=\"\">Uncover the elements of your design that lead new users to make errors, using the task-based <strong style=\"\">cognitive walkthrough method</strong>.</li>  </ul>  <p style=\"\">  \t                 As well as a set of comprehensive notes, you&#039;ll download <strong style=\"\">detailed usability checklists and workbooks </strong>to help you carry out the most valuable techniques: the Heuristic Evaluation and the Cognitive Walkthrough.  </p>  <p style=\"\">  \t<strong style=\"\"></strong>You&#039;ll also download an<strong style=\"\"> expert review reporting template </strong>in PowerPoint and Keynote format that you can re-brand and use to report back the results of your own expert reviews.  </p>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\"></strong></strong>  </p>  <p style=\"\">  \t                 - <strong style=\"\">All of the video lectures and worksheets are download-enabled.</strong> If you have a slow internet connection, or want to take this course with you on your laptop, smartphone or other portable device, sign up and download all the videos and other course materials now.  </p>  <p style=\"\">  \t                 - <strong style=\"\">Every lecture has been fully transcribed as a text document.</strong> This is useful if English isn’t your native language or if you just want a readable and searchable version of the course.  </p>  <p style=\"\">  \t                 - On completion of the training, <strong style=\"\">you will receive a certificate of completion</strong> and be eligible for free, e-mail-based, refresher training.  </p>", 
    "end_date": null, 
    "title": "How to carry out a usability expert review", 
    "price": "50.00", 
    "instructors": "David Travis", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65542_10e4_5.jpg", 
    "course_url": "https://www.udemy.com/ux-reviews/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-15T11:36:06Z"
}