{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course is for those who would like to understand what makes a web or mobile experience<strong class=\"redactor-inline-converted\"> engaging</strong> and how to design for it in a <strong class=\"redactor-inline-converted\">systematic</strong> way. How to make people take action, come back and stick to your application?<br></p>\n\n\n\n\n\n\n\n<p>This workshop <strong class=\"redactor-inline-converted\">has two parts:</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>1. During the first part, we explore the <strong class=\"redactor-inline-converted\">key principles of an engaging digital experience</strong>.<br>What do people expect at every touch point with a digital service? How can we meet these expectations in the most effective way? Which engagement and motivational techniques to use?</p>\n\n\n\n\n\n\n\n\n\n<p>We will dive deeper into the elements of <strong>content, branding, usability best practises, visual design, layout, game mechanics </strong>and<strong> motivational techniques</strong>. Using real examples, we will analyse when and how to use them in the most appropriate way in order to make people to take action, come back, stay and become loyal users of a digital service.</p>\n\n\n\n<p>2. The second part is more <strong class=\"redactor-inline-converted\">hands-on</strong>. Using a real-life case study, we'll go through the initial phases of the user experience design process. Through <strong class=\"redactor-inline-converted\">5 hands-on exercises</strong>, we will crystallize the product's idea and turn it into a product sketch.</p>\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">After taking this course, you will:</strong><br></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Understand which factors govern the conversion, adoption and retention rates of a digital service. How to identify where the improvements in the experience are needed.</li><li>Understand the various touch points people have with a digital service (web &amp; mobile) and their expectations at each touch point.</li><li>Understand how to meet people's expectations at each of these touch points; which design strategies and techniques to use and how.</li></ul>\n\n\n\n\n\n\n\n<ul><li>Know how to crystallize an idea and turn it into a product  sketch. </li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br>What's the format?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>The course consists of <strong class=\"redactor-inline-converted\">19 video lectures.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>I presented the design strategies and techniques in a <strong class=\"redactor-inline-converted\">structured framework</strong>. It will serve you like a system you can easily apply for making any web or mobile experience more engaging for the people. </p>\n\n\n\n\n\n\n\n\n\n<p>You'll also find <strong class=\"redactor-inline-converted\">lots of examples</strong> from various contexts, which clearly illustrate what makes or breaks an engaging digital experience.</p>\n\n\n\n\n\n\n\n\n\n<p>And you will practically experience how to crystallize an idea and turn it into a product sketch. </p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">A few final notes…</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Together with my design team at InfinVision, we've been designing web and mobile experiences for diverse clients in New York, London, Paris, Dublin, Santiago de Chile over the last 10 years. We have also launched a design-briefing tool – My Visual Brief, which helps graphic and web design teams to set the right direction for a design project. </p>\n\n\n\n\n\n\n\n\n\n<p>The goal of this course is to share this experience with you in a systemized way while helping you to design better digital experiences for the people. </p>\n\n\n\n\n\n\n\n\n\n<p> Let's get started!</p>", 
    "end_date": null, 
    "title": "How to Design Engaging User Experiences (UX)", 
    "price": "45.00", 
    "instructors": "Egle Karalyte", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/451312_1dca_5.jpg", 
    "course_url": "https://www.udemy.com/user-experience-design-fundamentals2/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T15:49:27Z"
}