{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t           In an age of ever-increasing distractions, quickly creating customer habits is an important characteristic of successful products. How do companies create products people use every day? What are the secrets of building services customers love? How can designers create products compelling enough to &quot;hook&quot; users?  </p>  <p style=\"\">  \t           Nir Eyal, author of &quot;Hooked: A Guide to Building Habit-Forming Products&quot; shows you how. Nir is a two-time Silicon Valley entrepreneur who has taught the &quot;Using Neuroscience to Influence Human Behavior&quot; course as a Lecturer at the Stanford Graduate School of Business. His writing has appeared on TechCrunch, Forbes, Psychology Today and his blog, NirAndFar.  </p>  <p style=\"\">  \t           In this course, Nir shares a framework for designing habit-forming products called &quot;the Hook Model.&quot; The framework gives entrepreneurs and product designers a new way for thinking of the necessary components of influencing user behavior. Nir will share the tactics companies like Facebook, Pinterest, and Twitter use to drive repeat engagement.  </p>  <p style=\"\">  \t           Companies need to know how to harness the power of hooks to improve peoples&#039; lives. This workshop will provide attendees with a powerful toolkit and framework for creating better products and likely change the way they see the world.  </p>", 
    "end_date": null, 
    "title": "How to Build Habit-Forming Products", 
    "price": "50.00", 
    "instructors": "Nir Eyal", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/126684_9100_11.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-habit-forming-technology/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-28T22:48:44Z"
}