{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">This online class will teach you both the basic and advanced features of Axure RP 7.</strong>  </p>  <p style=\"\">  \t Whether you are a <strong style=\"\">beginner</strong> or an <strong style=\"\">intermediate</strong> <strong style=\"\">Axure user</strong>, this course will come in handy as it includes theory at first, starting with the environment and then building up to presenting the panes and their uses.  </p>  <p style=\"\">  \t After this complete overview, I will also give you a <strong style=\"\">practical example</strong>, which is <strong style=\"\">creating a proper interactive website homepage</strong> of a well-known coffeehouse company.  </p>  <p style=\"\">  \t Most courses only teach you theory and the basics of using Axure, that’s why I tried to create something different, so that you can actually see the power of rapid prototyping with this software.  </p>  <p style=\"\">  \t <em style=\"\"><strong style=\"\">Together with the video courses you will have access to the Exercise Files that include the fully-functional prototype.</strong></em>  </p>  <p style=\"\">  \t Another issue that I encountered in time is that most courses don’t ask students to actually do some work, and I find them pretty boring as they are one-sided and don’t give you a sense of accomplishment.<br style=\"\">  \t<br style=\"\">  \t  Therefore, at the end of the course I will give you a test in which you can try out your newly developed skills. The test consists of creating a section of the website by using a new feature in Axure 7.<br style=\"\">  \t<br style=\"\">  \t  Of course you will have the section available for reference as an RP file in the Exercise Files, but I encourage everyone to try and develop a fresh prototype by their own.  </p>  <p style=\"\">  \t <strong style=\"\">I will provide proper feedback and improvement suggestions</strong>, so you can contact me at <a href=\"mailto:radu@creative10.com\" rel=\"nofollow noreferrer\" target=\"_blank\" class=\"external-link\" style=\"\">radu@creative10.com</a> and attach the RP file you created.  </p>  <p style=\"\">  \t Therefore, even if you already have hands-on experience with Axure, you might find this course suitable to improve your skills and become an Axure specialist.  </p>  <p style=\"\">  \t <strong style=\"\">Course updates</strong>  </p>  <p style=\"\">  \t Based on your feedback and suggestions, I will constantly improve the quality of the lessons and also add more information wherever there is need for.  </p>  <p style=\"\">  \t As a conclusion keep in mind that my main goal is to provide a better learning experience so <strong style=\"\">I am looking forward to your feedback and suggestions</strong> at <a href=\"mailto:radu@creative10.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">radu@creative10.com</a>.  </p>  <p style=\"\">  \t <strong style=\"\">What is Axure RP?</strong>  </p>  <p style=\"\">  \t Axure is the most used prototyping software in the world at this moment.<br style=\"\">  \t  I will not dive into why we should use prototypes as one of our main communication tools within a design process, as my belief is that all of you are aware of their importance.  </p>  <p style=\"\">  \t Axure was first released in 2003 as a tool that was supposed to revolutionize the creation of powerpoint and word specifications.  </p>  <p style=\"\">  \t Nowadays, it is considered the standard in software prototyping tools, being used by tens of thousands of UX designers and product managers.  </p>", 
    "end_date": null, 
    "title": "Mastering Axure RP 7 : UX Design Prototyping", 
    "price": "25.00", 
    "instructors": "Radu Fotolescu", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/161790_62fb_5.jpg", 
    "course_url": "https://www.udemy.com/mastering-axure-rp-7-from-theory-to-practice/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-11T09:31:06Z"
}