{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong><em><br></em></strong></p><p><strong><em>Join Over 400 students!</em></strong></p>  <p>  \t            Start designing mobile apps immediately. Create your Logo , Icon , UI Interface, basically all you need to create that great looking app!</p>  <p>  \t            The course will guide you through designing your first app from the initial idea to actually having a app prototype that you can show around and how to create and design a working website. Zero Photoshop or coding experience needed. </p><p><strong><em>This course is not for people that do not wan't to design apps in the near future.</em></strong></p><p>The lectures are current and will be updated in the future if needed. But it will most help people who wan't a complete guide so they can launch a compelling app in a decently short period of time.</p>  <p>  \t<strong>Some of the things that you are going to learn are:</strong>  </p>  <p>  \t<em><strong>Photoshop Basics</strong></em>  </p>  <p>  \t<em><strong>Creating a logo from scratch.</strong></em>  </p>  <p>  \t<em><strong>Creating Icons.</strong></em>  </p>  <p>  \t<em><strong>Designing UI Elements.</strong></em>  </p>  <p>  \t<em><strong>Structuring your app.</strong></em>  </p>  <p>  \t<em><strong>Designing your app completely.</strong></em>  </p>  <p>  \t<em><strong>Designing a Website for your app with Photoshop.</strong></em>  </p><p><em><strong>Turning your Website design into a real Website with Dreamweaver. </strong></em></p>  <p>  \t<em><strong>Design Tips.</strong></em>  </p>  <p>  \t<em><strong>And more content comes continuously!</strong></em></p>  <p><strong><em>Try it Risk Free 30 day money back guarantee!</em></strong><br></p>  <p>  \t          This course you will be going through design fundamentals to creating user interfaces all by yourself. The course is mainly focused on breaking things down so that they are easy to understand and give you the possibility to tailor to your own projects.  </p>  <p>  \t                                          Getting the right design takes a lot of time , you might have tons of great app ideas but if you have to hire a designer for all of them you'r energy will deplete since you will be paying for things that don't return your investment.  </p>  <p>  \t                                          Equipped with the knowledge you get from this course you will be able to go through different designs without having to give any dollar , this will allow you either to design your UI and UX by yourself , but it could also help you give a clear picture to your designer and be on the same page thus potentially saving you thousands of dollars for each project you create.  </p>  <p>  \t             If you already using some other software for design that wont be a problem, since you will most likely be able to create the same things with ease.  </p>", 
    "end_date": null, 
    "title": "Master UI Design : Complete Guide To Creating Great UI", 
    "price": "20.00", 
    "instructors": "Sam Bing", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416522_5f18_5.jpg", 
    "course_url": "https://www.udemy.com/master-ui-design-complete-guide-to-creating-great-ui/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T15:16:19Z"
}