{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Mobile devices are now used for everything from banking to gaming – so user interface (UI) and user experience (UX) design has never been more important. If a website is difficult to navigate or the layout of an app is confusing, users will be gone in seconds. An in-depth understanding of mobile UI/UX design is critical for good mobile usability, for keeping your users engaged, and for ensuring your product stays relevant.</p><p style=\"\"><strong style=\"\">Make your Mobile UI Design Pop</strong></p><ul style=\"\"><li style=\"\">Understand the basics of UI/UX mobile application design</li><li style=\"\">Learn each step of the design process from planning to project completion</li><li style=\"\">Gain an insight into current mobile UI/UX design trends and developments</li><li style=\"\">Develop key skills to plan, manage and develop mobile usability</li></ul><p style=\"\"><strong style=\"\"></strong><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Understand the Mobile UX Design Process </strong></p><p style=\"\">While UI and UX design are often bundled together as one, they are in fact two separate disciplines. UI design is centered on layout and the fine detail of how the user interacts with the product (i.e a slide vs. a simple tap on an app). UX design however is about the overall experience, the look and feel of the product, and how the user navigates through it from start to finish. Despite their differences the two go hand-in-hand, and an understanding of both is essential for seamless mobile usability. In short, mobile UI/UX design is one of the most important elements of any digital project. <strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Course Overview</strong></p><p style=\"\">This course covers all aspects of the mobile UI/UX design process from start to finish, with graphic designers, stakeholders, designers from non-tech backgrounds, and developers in mind. If you need a crash course in mobile UI/UX design, you&#039;ve come to the right place.</p><p style=\"\">The course is divided into six sections, with each section focusing on key &#039;design deliverables&#039;. You will explore each phase of the design process, starting with requirements assessment and design project planning, to user experience recommendations and user interface design and documentation, to design implementation guidelines and management. </p><p style=\"\">Along the way you&#039;ll pick up all of the technical terminology involved, learn about current design trends and the latest developments in the ever changing world of mobile usability, and discover some expert tips to make your project a resounding success. Recommended exercises are presented at the end of each section so you can put your knowledge to practical use.</p><p style=\"\">At the end of the course, you will be equipped with all the skills needed to oversee a mobile application&#039;s experience and interface design, from the planning stages right up to the finished product.</p>", 
    "end_date": null, 
    "title": "Mobile UI and UX Design", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506016_62cf_3.jpg", 
    "course_url": "https://www.udemy.com/mobile-ui-and-ux-design/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T10:43:14Z"
}