{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t    Are you interested in designing beautiful mobile apps?  </p>  <p>  \t    Do you have an idea for an app, and want to make sure it’s well-designed before handing it off to a developer?  </p>  <p>  \t    Do you want to learn the secret sauce that makes apps like Instagram and Snapchat explode, while others fade into obscurity?  </p>  <p>  \t    Ummmm yeah..  </p>  <p>  \t    How this class came to be (and why mobile UX is a gamechanger)  </p>  <p>  \t    I’ve been designing mobile and web applications since 1999. I’ve seen it all, and worked with companies like Sprint, Lowes, Hallmark and Samsung to design mobile applications and delightful user expeirences. I even wrote a book, Designing Mobile Interfaces (published by O’Reilly), to explore and teach this important topic.  </p>  <p>  \t    Now, I’m teaching this class because I’m tired of seeing great app ideas fail because the designers don’t understand a few basic UX principles. This course aims to change that.  </p>  <p>  \t    Through countless projects and experiences over the last decade, I&#039;ve learned so much about the principles and secrets that go into designing beautiful applications. I now have a design process (which I cover in the course) that allows me to quickly figure out how to design a delightful user experience and create an app that users fall in love with.  </p>  <p>  \t    Does learning about the UX principles behind popular apps like Lyft and Google Maps excite you? In this course, you’ll learn:  </p>  <ul style=\"\">  \t<li>How to understand your users and their goals, and how to design a mobile experience that your users will fall in love with</li>  \t<li>The principles that all successful apps follow, and why some take off (and others fail)</li>  \t<li>How to run usability tests and find out the ideal design that will hook your users</li>  \t<li>How to understand the specific needs of the mobile user, and not just generic “web” usability</li>  </ul>  <p>  \t    Mobile is the way of the future, and learning the ins and outs of mobile UX will be a critical part of designing that mobile future. It’s not just me that thinks these skills are important. According to a recent report, &quot;UX designer&quot; and &quot;UI designer&quot; are two of the ten fastest growing job titles in the last 5 years. This course will teach you everything I know about UX principles, and make you a much more valuable employee or consultant.  </p>  <p>  \t    With 30 lectures, over 7 hours of material, you will learn how to develop a workflow for your idea, find the right way to design and build your app, and understand the design principles and considerations behind the most popular apps in the world.  </p>  <p>  \t    After completing this course you’ll be able to create an engaging mobile app design from start to finish, no previous experience is needed to learn the UI design principles. This course will benefit entrepreneurs, developers, and designers looking to move into the mobile applications market.  </p>  <p>  \t    And, as an added bonus, I will personally respond to any questions you may have as you go through the material. I’ll also help you think through design decisions that go into your app, a service that I normally charge thousands of dollars for. All yours for the price of this course!  </p>  <p>  \t    See you inside,  </p>  <p>  \t    Steven  </p>  <p>  \t    P.S. If for any reason you don’t LOVE the information I’ve pulled together in this course, no worries - I offer a 30 day money-back guarantee for everyone who purchases the course. No questions asked.  </p>", 
    "end_date": null, 
    "title": "Mobile User Experience: The Complete Guide to Mobile", 
    "price": "20.00", 
    "instructors": "Steven Hoober", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420396_1433.jpg", 
    "course_url": "https://www.udemy.com/mobile-user-experience-the-complete-guide-to-mobile/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T17:59:46Z"
}