{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong><em>JOIN OVER 3400 SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE!</em></strong></p><p><em>---------------------------------------------------------------------------------------------------------------</em></p>  <p>You're going about your day as usual and <em>BAM! Y</em>ou think of this awesome app idea. It's simple, people would love it and you can't find it ANYWHERE in the app store.</p>  <p>  \t                  Or maybe you want to develop a highly profitable skill with which you can make a profitable income <em>EVERY DAY</em> by working when you want from where ever you want?  </p>  <p>  \t<strong>  This course is optimized for anyone who is looking to efficiently learn the most important design techniques that will help design perfect apps! Because well designed mobile apps are just as important as well-built apps.  </strong>  </p>  <p>  \t<strong>Specifically, you are going to learn how to design user friendly, engaging, beautiful looking mobile apps from scratch, by doing assignments, quizes, and practical work between the lessons.</strong>  </p>  <p>  \t<strong>Mobile App Design is not just about how to design pretty app. It's also about designing </strong><strong>an app that looks great and works </strong><strong>smoothly.</strong>  </p>  <p>  \t            Although this course mainly covers iOS 8 Mobile App Design, but after completing it, you are going to develop a skill, with which you are going to start designing mobile apps for all major platforms (iOS, Android and Windows Phone) in no time!  </p>  <p>  \t<strong>Course content:</strong>  </p>  <ul>  \t<li>Learn how to start from scratch with your own app idea</li>  \t<li>Go through all the user researching steps on finding your target audience.</li>  \t<li>How to figure out who to target (marketing tips).</li>  \t<li>Learn how to create sketches and wireframes.</li>  \t<li>Learn User Experience Design (UX) techniques which are trending in job market right now.</li>  \t<li>Learn how to use Adobe Photoshop for designing User Interface (UI) Designs.</li>  \t<li>I'm going to show you my workflow and how I'm going to start design my own app idea, News Reader App, from absolute zero to the great looking iOS 8 design style.</li>  \t<li>You are going to implement everything you learned in the previous lessons and in the final section, I'm going to show you a bunch of different tips and resources, how to start making big money with your new skills.</li>  \t<li>Assignments which are going to help you learn UI / UX Design for Mobile App</li>  \t<li>Quizes, which will help you recap what you learned in the previous section</li>  </ul>  <p>  \t<strong>Mobile App Design: Learn To Design The Perfect App </strong>is a comprehensive course where you are going to earn exactly those skills and make money instantly.  </p>  <p>  \t                  Mobile App UI / UX Designers typically earns around $100K/per year working for companies and startups.  </p>  <p>  \t                  But if you decide to work as a freelancer online, you can expect to get $100/hour for the work as a UI / UX designer.  </p>  <p>  \t<em>Where is no coding or programming required.</em>  </p>  <p>  \t                  ===================================================  </p>  <p>  \t                  After this course, you can go to the world and start seeking for a jobs at the biggest world companies or startups, or start freelancing online on your own and in your own home.  </p>  <p>  \t                  With those freelancing tips applied, you can expect to <strong>earn $100/h of your work</strong>.  </p>  <p>  \t                  Where is no problem if you don't know Photoshop at all.  </p>  <p>  \t                  Plus you are going to get Adobe Photoshop for free for the first 30 days, so you don't need to buy it.  </p>  <p>  \t<strong>All in all, you are going to get 5 courses in one:</strong>  </p>  <ul>  \t<p>  \t\t                  How to come up with your own app idea  \t</p>  \t<p>  \t\t                  User Experience skills to research your target audience and create sketches and wireframes for the app  \t</p>  \t<p>  \t\t                  Learn Adobe Photoshop from ground zero  \t</p>  \t<p>  \t\t                  Design your own app in Adobe Photoshop  \t</p>  \t<p>  \t\t                  How to make money with your new skills, so effective freelancing and job seeking in the companies and startups.  \t</p>  </ul>  <p>  \t                  Plus, you are going to get fast and responsive answers from me, your instructor.  </p>  <p>  \t                  Also, if you don't like my course you have 30 days money back guarantee, so you don't lose anything! <em>NO QUESTIONS ASKED!</em>  </p>  <ul>  \t<ul>  \t</ul>  </ul>", 
    "end_date": null, 
    "title": "Mobile Design: Learn UX/UI and Start Your Freelancing Career", 
    "price": "20.00", 
    "instructors": "Deimantas Brandišauskas", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338400_7e9a_23.jpg", 
    "course_url": "https://www.udemy.com/ios-8-mobile-app-design-course/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T12:01:17Z"
}