{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>  Are your web conversion rates low? </strong>Do you <em>know</em> whether your web site is effective at meeting your goals?  Do users get &quot;stuck&quot; and aren&#039;t able to complete the tasks they want to?  Are your forms effective? How can your mobile app be improved?<br>  \t<br>  \t    It&#039;s becoming easier and easier to create web sites and mobile apps-- But harder and harder to measure the <em>effectiveness</em> of these applications. In Joe Natoli&#039;s well-designed course User Experience Design Fundamentals you&#039;ll learn how to create effective web sites, mobile sites and mobile applications that encourage conversions<br>  \t    and leave users wanting more.<br>  \t<br>  \t    It&#039;s not enough to simply have a web presence -- you must have a web presence that&#039;s effective to be successful.  In this dynamic course Joe will guide you through the critical elements of user experience -- <strong>strategy</strong>, <strong>scope</strong>, <strong>structure</strong>, <strong>skeleton</strong> and <strong>surface</strong>. As you learn you&#039;ll be able to apply the knowledge Joe teaches in dynamic lab exercises-- and later to your own work as a developer or designer.<br>  \t<br>  \t    If you&#039;re a designer moving into a more complex digital world or a developer who has to occasionally function as a designer as well, this course is for you. You&#039;ll feel more confident as you make design related decisions about layout, color, information, design and typography after completing this exciting course.  </p>", 
    "end_date": null, 
    "title": "User Experience Design Fundamentals", 
    "price": "45.00", 
    "instructors": "Joe Natoli", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58207_2ec2_6.jpg", 
    "course_url": "https://www.udemy.com/user-experience-design-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-04T16:49:16Z"
}