{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Do you want to find out more about the BCS Foundation Certificate in User Experience?</strong></p><p>Perhaps you're thinking of taking the exam and you want to know what it covers.</p><p>Or maybe you're a training provider and you want to understand the scope of the syllabus.</p><p>Or perhaps you'd like to try out some sample questions from the exam.</p><p>If so, then this course is for you.</p><p>Note: A handful of students have given this course a poor review because they have not read this course description. <strong>This course is not an introduction to user experience. This course describes the syllabus of a certification exam.</strong><strong></strong> If you want an introduction to UX, try my other courses.<br></p><p><strong>The BCS Foundation Certificate in User Experience</strong> aims to provide a recognised development pathway for UX professionals to demonstrate their skills and accelerate their careers. It is an independent certification scheme developed by BCS, the Chartered Institute for IT.</p><p>To pass the exam, you'll need to demonstrate your knowledge of the core concepts, techniques and methods in user experience in a 1-hour multiple choice examination.</p><p><strong>This course describes the syllabus of the BCS Foundation Certificate in User Experience.</strong> </p><p>The syllabus covers user-centered design principles in nine competency areas:</p><ol><li>Guiding Principles</li><li>User Research</li><li>Illustrating the Context of Use</li><li>Measuring Usability</li><li>Information Architecture</li><li>Interaction Design</li><li>Visual Design</li><li>User Interface Prototyping</li><li>Usability Evaluation</li></ol><p><strong>This aim of this course is to explain the syllabus and provide some tips for people taking the exam</strong>. It will be useful to students who are preparing for the exam and for training organisations that want to understand the syllabus content.</p>", 
    "end_date": null, 
    "title": "User Experience Certification", 
    "price": 0, 
    "instructors": "David Travis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/663850_1c1c_3.jpg", 
    "course_url": "https://www.udemy.com/certificate-in-ux/", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-08T15:27:53Z"
}