{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>UPDATE (03/01/2016)</strong>: New Section!</p><ol><li>Just added a new section where we go over the most modern design and prototyping tools.</li><li>We discuss design tools like Sketch 3, Photoshop, and Illustrator, so you can decide what to use.</li><li>Overview of static prototyping tools like Marvel App and Invision</li><li>Quick introduction to granular animation prototyping tools like Pixate, Flinto, FramerJS</li><li>We create a simple design flow using Sketch!</li><li>We put our prototype on Marvel</li></ol><p><strong>/////////////////////////////////////////////////////////////////////</strong></p><p><strong>Overview</strong></p><p>Interested in learning what makes a great web or mobile app? How to understand users? Or do you want to expand your web design or development skills? If so, you've come to the right place.</p><p><em>User Experience Design: The Accelerated UX Course </em>is the quickest, and most cost-effective UX course you'll find on the web – or your money back. We'll provide you with the knowledge of each of the major areas of UX Design, so you can begin designing web and mobile apps on your own. </p><p>User Experience Design (UXD or UX) is the process of enhancing user satisfaction by improving the usability, accessibility, and “delight\" provided in the interaction between a user and product. It's about making your apps intuitive, easy to use, and most of all – effective at solving problems. Throughout the course, we'll walk you through the major knowledge areas of UX Design, and get you started on a path to UX Mastery. </p><p>This interactive and on-demand course includes everything you need to go from zero-to-60 in the world of UX. While it takes years to achieve mastery, our goal with this course is to help you fast-track the beginning steps. </p><p><strong>What's included in the course?</strong></p><p>The course is divided into 7 meticulously-designed sections, each developed with ease of learning in mind. While UX books, and other online UX courses require hours of reviewing theoretical content, this course fast tracks you to just the good stuff. </p><p>Combing the expertise of two instructors based in heart of the Silicon Valley technology scene, you'll dive deep into best parts of UX, so you can finish the course QUICKLY. To get started creating beautiful experiences right away, we'll walk you through a handful of sections that include:</p> <ul><li>History and Background of UX</li> <li>Understanding Users</li> <li>Information Architecture</li> <li>Visual Design Principals</li> <li>Functional Layout Design</li> <li>User Psychology</li> <li>Real-World Tips and Tricks</li></ul> <p>We've designed the course to make learning both quick and fun. And, I've used techniques proven to effortlessly lock-in knowledge. So what are you waiting for? If you're looking for a course to learn User Experience Design, and FAST, then look no further. </p><p>Still not convinced? The course includes full money back guarantee, so long as you request it within 30 days of your purchase. No questions asked. </p>", 
    "end_date": null, 
    "title": "User Experience Design: Complete UX Fundamentals Course", 
    "price": "40.00", 
    "instructors": "Adam Treister, Pablo Stanley", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315150_fc60_7.jpg", 
    "course_url": "https://www.udemy.com/user-experience-design-the-accelerated-ux-course/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T16:42:33Z"
}