{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t    OVER 500 SUCCESSFUL STUDENTS HAVE ALREADY TAKEN THIS COURSE  </p>  <p>Learn the fundamentals of UX (user experience) design and process.</p><p>If you design a product that people interact with, then you are designing a user experience. If you want your product to be easy to use, engaging, what people expect, and meet the goals of the organization, then you want to make sure you design an optimal user experience. In this course you will learn the basic principles, processes of good user experience, and what a user experience professional should know and be able to do.  </p>  <p>  \t    Examples of what is in the course:  </p>  <ol>  \t<li>What is user experience?</li>  \t<li>What makes a user experience good?</li>  \t<li>7 Principles of a great user experience</li>  \t<li>The process you need to follow to create a great user experience</li>  \t<li>Controversies in the field of user experience</li>  \t<li>The skills and knowledge that a user experience professional needs</li>  \t<li>The obstacles to great user experience design and how to overcome them</li>  </ol>  <p>  \t<em>and much, much more!</em>  </p>  <p>  \t<em>About This Course:</em>  </p>  <p>  \t<em>Over 500 very happy students</em>  </p>  <p>  \t<em>Unconditional 30 day money back guarantee from Udemy</em>  </p>  <p>  \t<em>All future upgrades and lectures are included for FREE</em>  </p>  <p>  \t    Click the \"Take This Course\" button at the top right of this page now and get started right away to learn the basics of user experience right away.  </p>", 
    "end_date": null, 
    "title": "UX  Fundamentals", 
    "price": "20.00", 
    "instructors": "Susan Weinschenk, Ph.D.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/217508_816c_2.jpg", 
    "course_url": "https://www.udemy.com/introtoux/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-13T17:22:41Z"
}