{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">This course will teach you <strong style=\"\">everything you need to know about UX, including design, content, and coding</strong>. And you&#039;ll learn from the ground up, so it doesn&#039;t matter how much experience you have when you start.</p><p style=\"\">You&#039;ll be exposed to principles and strategies, but, more importantly, you&#039;ll learn how to actually apply these abstract concepts by coding <strong style=\"\">three different websites</strong> for <strong style=\"\">three very different audiences</strong>.</p><p style=\"\"><strong style=\"\">Improve Your Website with UX Strategies</strong></p><ul style=\"\"><li style=\"\">Apply UX strategies to a site&#039;s content &amp; design</li><li style=\"\">Understand Information Architecture to enhance the content on your website</li><li style=\"\">Know what dictates how your website should look</li><li style=\"\">Design and code a B2B website, a B2C blog, and an ecommerce site</li></ul><span style=\"\"></span><p style=\"\"><strong style=\"\">Understand UX and Learn How to Develop Winning Websites</strong></p><p style=\"\"><strong style=\"\"></strong>This course will help you stand out as a web designer, teaching you how to apply User Experience (UX) strategies that will make every site you build useful, usable, and valuable.</p><p style=\"\">Reinforce what you&#039;re learning using the <strong style=\"\">bonus 30-page downloadable UX Guidebook</strong>. Filled with exercises and activities, the UX Guidebook is a great tool to reference as you progress through the course, or while developing your own custom sites. </p><p style=\"\">You&#039;ll also get <strong style=\"\">hands-on experience</strong> <strong style=\"\">designing and coding three different types of sites</strong>. This will give you the confidence to pursue similar projects if you&#039;re already a website designer, if you want to get into web design, or if you want to enhance your current business site.</p><p style=\"\"><strong style=\"\">Contents and Overview</strong></p><p style=\"\"><strong style=\"\"></strong>Even if you&#039;re a complete beginner, this course will show you how to make a website <strong style=\"\">functional, attractive</strong> and <strong style=\"\">successful</strong>. It will walk you through all of the steps required to enhance the User Experience on any site, right down to the code, content, and design.</p><p style=\"\">You&#039;ll begin by defining <strong style=\"\">who your website users are</strong> and <strong style=\"\">what they expect </strong>from the website. You&#039;ll also learn how business goals — yours or your client&#039;s — have to be uncovered and addressed for site success. </p> <p style=\"\">You&#039;ll learn <strong style=\"\">what questions to ask both groups</strong>, and you&#039;ll use the answers to inform your content and design decisions.</p> <p style=\"\">Next, you&#039;ll dig into<strong style=\"\"> Information Architecture (IA)</strong>, which looks at the content on your website, how you should categorize it, what you should call it, and more. </p> <p style=\"\">This will lay the foundation on which you can further build out your website to make users flock to it, stay on it, and hopefully make purchases.</p><p style=\"\">Plus, you&#039;ll tackle how to design your website depending upon who your visitors are, whether your website is B2B (business-to-business), B2C (business-to-consumer), or an ecommerce site for selling products online. </p> <p style=\"\">Different audiences have different needs, so learning <strong style=\"\">what your target user expects from your site</strong> means you&#039;ll be able to design and build a site that meets those expectations and leads to greater conversions. </p> <p style=\"\">In addition to knowing what you need to put into your website to make it stand out from the crowd, you&#039;ll also learn how to identify and remove <strong style=\"\">UX- and UI-related obstacles.</strong> </p> <p style=\"\">The ability to see and solve these problems will ensure every website you build moving forward will be <strong style=\"\">useful, usable</strong> and <strong style=\"\">valuable</strong> to the people who use it.</p><p style=\"\">Most importantly, you&#039;ll then learn how to actually <strong style=\"\">build</strong> and <strong style=\"\">code</strong> these types of sites using HTML, CSS, WordPress, and more. </p> <p style=\"\">You&#039;ll not only know how to <strong style=\"\">effectively design B2B, B2C, and ecommerce sites</strong>, but you&#039;ll also know exactly how to develop these sites, from start to finish.</p><p style=\"\">By the end of this course, you&#039;ll have an <strong style=\"\">in-depth understanding of UX and web design</strong>, as well as the tools to develop a variety of sites with the right code.</p><p style=\"\">You&#039;ll know why UX is so important to both users and businesses, what <strong style=\"\">content</strong> is needed on a site, what <strong style=\"\">UI design</strong> is appropriate, and how to transform your vision into a <strong style=\"\">fully functional website</strong> using the most effective tools available.</p>", 
    "end_date": null, 
    "title": "UX & Web Design Master Course: Strategy, Design, Development", 
    "price": "50.00", 
    "instructors": "Joe Natoli", 
    "commitment": "23 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412738_4543.jpg", 
    "course_url": "https://www.udemy.com/ux-web-design-master-course-strategy-design-development/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T23:24:36Z"
}