{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t            What is the key ingredient that <strong>makes apps</strong> <strong>successful</strong>?  They start with a laser focus on <strong><em>what users need</em></strong>. This course teaches you the tools and techniques needed to help you step into the shoes of customers – allowing you to shape concepts that connect and design products that stick.  </p>  <p>  \t            Learn the professional secrets of conducting crucial user research <strong>quickly and</strong> <strong>inexpensively</strong>. Following a 6-step approach you will learn how to:  </p>  <ul>  \t<li>  Shape a concept   </li>  \t<li>Screen app ideas   </li>  \t<li> Conduct primary research (IDIs, surveys)   </li>  \t<li> Create customer journeys, personas and empathy maps   </li>  \t<li>  Use participatory design to refine and prioritize     </li>  \t<li> Use Voice of the Customer research post-launch    </li>  </ul>  <p>  \t            There are <strong>dozens of techniques</strong>, tools and apps discussed.  </p>  <p>  \t            Taught by veteran digital strategist and UX design researcher Dr. Todd Greenwood, this course is appropriate for <strong>an</strong><strong>yone who is planning to build a mobile tech solution</strong>: app entrepreneurs, UX designers, and programmers.  </p>  <p>  \t            Along the way, Todd will highlight success stories and research that were used to develop some of the most successful apps like AirBnb and the research that <u>should </u>have been done for…well, the failures whose designers thought they could skip it.  </p>  <p>  \t            This 35-lesson course is <strong>hands-on</strong>, with a wealth of cost-effective techniques for gathering and analyzing <strong>survey data and qualitative insights</strong>. You’ll know when to DIY and when and where to find companies (many research solutions have recently emerged in the mobile space) that you can call upon to help.  </p>", 
    "end_date": null, 
    "title": "UX Research for Apps: User-centric from Concept to Launch", 
    "price": "20.00", 
    "instructors": "Todd Greenwood", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302306_10f9_3.jpg", 
    "course_url": "https://www.udemy.com/app-design-ux-research-from-concept-to-launch/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T18:58:58Z"
}