{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>As website designers/developers and UX designers, website accessibility is often something that is pushed to the bottom of the pile. The guidelines can be tricky, clients don&#039;t always appreciate the reasons behind it, and, to be honest, in the absence of an informed argument other competing factors always win out.</p><p>But what if you could stand out from the crowd? UX, and more specifically, accessibility is becoming more and more important, and in some industries it&#039;s a legislative requirement.</p><p><strong style=\"\">We&#039;ve created a simple and easy to follow course which holds your hand through the accessibility process. </strong></p><p>During 2003 the Australian Bureau of Statistics revealed that one in five people had a disability. Can you really risk marginalising up to 20% of your website&#039;s visitors with an inaccessible website?</p><p><strong style=\"\">Why this course?</strong></p><p>U1 Group&#039;s unparalleled accessibility expertise and face-to-face teaching experience not only demystifies website accessibility, but allows you to put it into practice on your website.</p><p>You&#039;ll see how we practically apply guidelines to many common aspects of websites, which dramatically benefits your learning process.</p><p>After completing this course you will hold a competitive advantage over other designers and will be able to add tremendous value to your clients. </p><p><strong style=\"\">What will I learn?</strong></p><p>This course comprises of 12 modules, 10 downloadable &#039;cheat sheets&#039;, and will provide you with meaningful tools which will allow you to confidently develop accessible websites. </p><p>Topics covered in this course include:</p> <ul style=\"\"><li style=\"\">A crash course in to accessibility.</li><li style=\"\">Ensuring your website is navigable by all users.</li><li style=\"\">Creating accessible text content.</li><li style=\"\">How to apply accessibility techniques to multimedia content.</li><li style=\"\">How to optimise the use of colour to enhance accessibility.</li><li style=\"\">How you can create more accessible forms.</li><li style=\"\">Guidelines for creating accessible images and non-text elements.</li><li style=\"\">How to design and implement accessible HTML tables.</li><li style=\"\">How to enhance the accessibility of dynamic and rich internet content, and</li><li style=\"\">Guidance on selecting an accessible content management system (CMS)</li></ul> <p>If you have any involvement in UX design or website development, then this course is for you. </p><p>Without this knowledge you run the risk of losing work to more qualified professionals, or worse yet, leaving your clients open to litigation due to having an inaccessible website. </p>", 
    "end_date": null, 
    "title": "Web Accessibility: Learn Best Practices, Tools & Techniques", 
    "price": "50.00", 
    "instructors": "U1 Group", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302536_4b87_3.jpg", 
    "course_url": "https://www.udemy.com/website-accessibility-course/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-18T00:09:37Z"
}