{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t              This course covers the factors that will help ANY web site increase the conversion rate beyond anything you currently hoped for.  </p>  <p style=\"\">  \t              This video set breaks  into the 6 critical pieces you need to influence to max out your  conversion rates.  </p>  <p style=\"\">  \t<strong style=\"\">However, the reality is, almost every website is missing on at least 3 or 4 of these factors, and a lot of them need help on every factor.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">It&#039;s not rocket science,</strong>  but this is actually very   clear, confirmed aspects of every site, or better  yet   service or product, that must be considered when a web site is put  together. Each aspect requires a serious look from you, if you want to maximize the effectiveness of your website(s).  </p>  <p style=\"\">  \tNow, do you have to focus on all 6 elements to make a site improve?  </p>  <p style=\"\">  \t<strong style=\"\">The answer is no.</strong>  There is no reason that a site that converts at all can&#039;t keep rolling  while you carefully evaluate each one of these elements. You see, as you  effect each one you will start to see that changes occur in your  results.  </p>  <p style=\"\">  \tWe&#039;ve written a LOT of copy over the  last 10 years.  During that time we have discovered and learned a lot  about a myriad of businesses concepts and types of people<strong style=\"\">. </strong>Here is a list of some clients and brands we worked with over the years, the work we did all based on the 6 factors we demystified in this course:  </p>  <ul style=\"\">  \t<li style=\"\">Bayer</li>  \t<li style=\"\">The Body Shop</li>  \t<li style=\"\">HONESTe Online</li>  \t<li style=\"\">SnapTotes</li>  \t<li style=\"\">FGI Research</li>  \t<li style=\"\">7 Mile Advisors</li>  \t<li style=\"\">Instancy</li>  \t<li style=\"\">Brand Fuel</li>  \t<li style=\"\">Carver Yachts</li>  \t<li style=\"\">Nightingale Contant</li>  \t<li style=\"\">and a lot more...</li>  </ul>  <p style=\"\">  \t          Again, this is not rocket science but rather a guided change in thought through which we are going to take you.  </p>  <p style=\"\">  \t<strong style=\"\">This is very precise material that will help you walk through many facets of  success with your web site.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Website Conversion Factors Demystified", 
    "price": "20.00", 
    "instructors": "Henry Zeng", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/197966_55a4_3.jpg", 
    "course_url": "https://www.udemy.com/website-conversion-factors-demystified/", 
    "currency": "USD", 
    "subject_name": [
        "User Experience"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-12T15:23:22Z"
}