{"selfpaced": false, "topic_name": ["Teacher Development"], "description": "\n\n                    \n                    \n                    Confidence as a trainer comes from the knowledge that you are well prepared in your topic and the resources you’ll use to present your information. Confidence, is also understanding that an effective trainer is someone who presents in a professional manner, is an effective communicator and has developed an awareness of the learning needs of their learner group.\r\nIn this course, we’d like to share with you our combined experience in the vocational education sector working with adult learners. Our focus will be on the more practical aspects of training and facilitation and we’d like to draw on some of the skills and knowledge we've gained through our respective training careers to offer you some practical techniques, approaches, hints and suggestions that you may be able to apply to your own training environment. Whether you’re an experienced trainer or just starting out, this course aims to develop the skills that you already have and help you become a more confident and accomplished vocational educator.\r\nWhat will I learn?\r\n\r\nJumping in as a first time trainer\r\n\r\nQualities of a confident trainer\r\nLearning styles\r\nBuilding rapport\r\n\r\nHow do people learn?\r\n\r\nWhy do Adults learn\r\nCreating a safe learning environment\r\n\r\nHow do you know if your students are learning?\r\n\r\nWhy do we need to assess?\r\nProviding feedback to your learners\r\n\r\nDeveloping flexibility in training\r\n\r\nDealing with difficult learners\r\nAddressing diversity\r\nTips to becoming a confident trainer\r\n\r\n\r\nThis course requires approximately 2 - 4 hours of study per week, but can vary depending on the student. This includes watching videos, and taking quizzes and assessments.\r\nIf you pass this course you'll receive a Certificate of Achievement. While this certificate isn't a formal qualification or credit, you can use it to demonstrate your interest in learning about this area to potential employers or educational institutions.\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nEnterprise trainer\r\nEnterprise assessor\r\nRegistered training organisation trainer\r\nTraining advisor or Training analyst\r\nVocational education teacher\r\n\r\n \n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: JUMPING IN AS A FIRST-TIME TRAINER\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: OUR BRAINS AT WORK: HOW DO PEOPLE LEARN?\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: ASSESSING: HOW TO TELL IF STUDENTS ARE LEARNING\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: DEVELOPING FLEXIBILITY IN TRAINING\r\n\r\n\r\n\r\n\n                                    ", "end_date": "2016-02-08T00:00:00Z", "title": "Becoming a Confident Trainer", "price": 0, "instructors": "Peter Green and Karen Turnbull", "institution_name": ["TAFE SA"], "commitment": "", "subject_name": ["Education & Teaching"], "course_url": "https://www.open2study.com//node/1767", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Open2Study"], "start_date": "2016-01-11T00:00:00Z"}