{"selfpaced": false, "topic_name": ["Teacher Development"], "description": "\n\n                    \n                    \n                    Join us on this exciting course covering the hugely important topic of developing digital skills in our classrooms. Digital skills are already an essential requirement for young people to succeed in an increasingly digitized society. Not only are these skills demanded for an increasing number of jobs, they also are a requirement and a right of citizens, if they are to be functional in today’s society. Schools and teachers therefore need support to work with their students to develop a wide range of digital skills that ensure young people leaving school have the skills required by the labour market and by an increasingly digitized society. The course therefore aims to guide teachers in how to develop a range of digital skills and to introduce them to the tools and resources that are available to them. At the end of the course, teachers should be able to design lessons that focus on a range of digital skills, make use of innovative tools to assist their own and the students’ work in this area. The course is organized around thematic areas of digital skills that are relevant at all levels of primary and secondary schooling. In 6 modules it explores the definition and role of digital skills generally and then looks at specific skill areas and how to address them in the classroom. The focus of these modules is on how pedagogically the skill area can be addressed and what tools there are available to help the teachers and students.At the end of the course participants are required to prepare a final lesson project which can be submitted as part of the eSkills for Jobs Awards competition. The course is part of the eSkills 4 Jobs campaign by the European Commission where you can also find additional resources about the topi\n\n                                    ", "end_date": "2016-05-23T00:00:00Z", "title": "Developing Digital Skills in your Classroom", "price": 0, "instructors": "Ollie Bray and Benjamin Hertz", "institution_name": ["European Schoolnet Academy"], "commitment": "", "subject_name": ["Education & Teaching"], "course_url": "http://www.europeanschoolnetacademy.eu/web/developing-digital-skills-in-your-classroom-2nd-round", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Independent"], "start_date": "2016-04-04T00:00:00Z"}