{"selfpaced": false, "topic_name": ["Teacher Development"], "description": "\n\n                    \n                    \n                    Thinking about teaching your university subject in English but it’s not the Language you normally use? \nThen, English for teaching purposes is the course for you. A course on English and teaching methodology that aims to help university lecturers do their teaching in English, in line with university internationalisation policies.\n\nThe course structure is the same for all learners and there are opportunities for them to link up with colleagues from universities all over the world who share the same discipline and discourse community, to ask questions and exchange ideas.\nThis MOOC targets lecturers who wish to begin using English in their teaching. A priori, this means university lecturers from countries where English is not the L1 or a widely-used language (Romance language-speaking countries, for example), though in fact the course is open to teachers from all educational stages who want to teach through English, following the principles of EMI (English Medium Instruction).\n\nOn completing the course, you should be able to do the following.\n\na) Teach a university subject in English, having gained the necessary confidence and skills.\n \nb) Integrate all aspects of CLIL (methodological, pedagogical, strategic, attitudinal, motivational, linguistic, sociolinguistic and pragmatic) to put together their own English-medium course on their particular subject.\n\nc) Describe the characteristics of the university lecture discourse genre (planning, agents, channels, phases, dynamics, and current flexibility of the genre).\n\nd) Understand and perform the basic linguistic macro-functions within English teaching discourse.\n\ne) Understand and perform, using the appropriate linguistic exponents (vocabulary, structures, and phraseology), the main micro-functions in English teaching discourse: metalinguistic, informative, evaluative, inductive, and social.\n\nf) Consolidate their oral expression and interaction skills, and their grammar and vocabulary, at English levels C1 and C2 as defined by the Council of Europe.\n\n\nEnglish for Teaching Purposes is a course provided by the Language Service at the Universitat Autònoma de Barcelona (UAB).\n\n                                            Syllabus\n                        Unit 1. Implications for lecturers switching to English as the classroom languageAnalysing the critical issues (contextual, linguistic, motivational and methodological aspects). Level of English. Managing anxiety. Improve through re-thinking your teaching to improve it. Teachers’ discourse. Analysing real practice and choosing a particular class as a basis for later course work.Unit 2. Functions related to delivering courses through English (1)Functions related to discourse structure: beginning and ending a class, concluding. Functions related to clarifying concepts for the students: giving examples,  classifying, comparing and contrasting, defining. Unit 3. Functions related to delivering courses through English (2)Functions related to information management: describing processes, expressing cause and effect, describing graphs, helping learners to manage new information. Functions related to evaluation: expressing certainty, presenting evidence, giving one’s opinions. Functions related to induction: giving instructions, motivating learners. Functions related to socialisation: handling classroom interactions and questions in the learning environment.Unit 4. Recording your classRecording the class sequence analysed throughout the course.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "English for Teaching Purposes", "price": 0, "instructors": "Ian James", "institution_name": ["Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"], "commitment": "4-6 hours", "subject_name": ["Education & Teaching"], "course_url": "https://www.coursera.org/learn/teaching-english", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}