{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    Without customers, your business does not exist. Marketing helps you understand your potential user and focus your product on their needs. This course will help you organize a strategy of identifying your perfect user, find ways to connect with them and what you’ll say when you find them. This covers research, planning, execution and most importantly how to grow your user base.\n\nThis course is part of our Tech Entrepreneur Nanodegree Program, click [here to learn more](https://www.udacity.com/course/tech-entrepreneur-nanodegree--nd007).Why Take This Course?You’re going to come up with a plan to acquire users and grow! By the time you’re done, you will have a robust marketing plan, including a slide deck with a description of your value to your customers, how you stack up against competitors, who your target audience is, and to grow your customer base.\n\n                                            Syllabus\n                        ###Lesson 1: Understand the User\nLearn to define and create a targeted marketing plan for specific user segments. Analyze your competitive advantages and disadvantages through market segmentation and the five level of market competition and learn how to position your product. Conduct competitive analysis in order to create your unique value proposition.\n\n###Lesson 2: Pre-launch \nCreate marketing goals in order to focus your marketing plan. You’ll start thinking about your distribution plan and consider what keywords work best for your goals. You’ll also create the materials to help prepare you for launch and learn about your app listing page. Finally, you’ll learn about the beta-testing community, beta-testing groups, and prepare your landing pages.\n\n###Lesson 3: Launch! \nPrepare, launch, execute, and gain your first users. You’ll outline a go-to-market strategy and gain the know-how to execute on it. You’ll learn SEO (search engine optimization) and ASO (app store optimization) skills as well as growth hacking tips to get your first 1000 users. \n\n###Lesson 4: Customer Acquisition\nLearn about paid and free customer acquisition methods from AdWords, social marketing, email marketing and more. \n\n###Lesson 5: Measurement Fundamentals\nLearn to use data to iterate and optimize your marketing plan.\n                                    ", 
    "end_date": "2015-11-02T00:00:00Z", 
    "title": "App Marketing", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Google"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.udacity.com/course/app-marketing--ud719?utm_medium=referral&utm_campaign=api", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-10-19T00:00:00Z"
}