{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    Nos habitudes de consommation ont profondément changé avec l’utilisation massive des Smartphones et des tablettes. Il s’agit d’un tournant majeur qui impacte les entreprises comme le quotidien des particuliers. Ce cours vous donnera les clés et vous permettra de comprendre cette révolution qui a lieu au fond de votre poche.\r\nIllustré de nombreux exemples, d’interviews d’experts et de cas concrets, ce cours se veut pragmatique. L’objectif est de vous permettre de comprendre la déferlante que représente la mobilité, les impacts sur nos habitudes de consommation ainsi que sur la relation marques/ usagers. Ce cours, grâce à son cheminement progressif, ses « aides vocabulaire &amp; définitions » vous expliquant le vocable spécifique à cette industrie et sa partie pratique vous guidant dans la création de votre projet mobile. Que vous soyez un chef d’entreprise souhaitant vous lancer dans l’aventure mobile ou encore un étudiant voulant enrichir vos connaissances, ce cours s’adresse à tous.\r\nA la fin de ce cours, nous vous proposerons une certification pour attester de vos connaissances.\r\nPré-requis\r\nAucun pré requis spécifique n’est nécessaire pour suivre ce cours.\n\n                                            Syllabus\n                        \r\nDécouvrez la plateforme\r\nSuccess stories et la mobilité de demain\r\nComprendre le marché\r\nUsages de la mobilité\r\nMobilité et objectifs marketing\r\n\n                                    ", 
    "end_date": null, 
    "title": "Consommation mobile : clés et enjeux marketing", 
    "price": 0, 
    "instructors": "Karen Sutton", 
    "institution_name": [
        "IONIS"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://courses.ionisx.com/courses/ionisx/7/mooc/about", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "IONIS"
    ], 
    "start_date": "2014-09-18T00:00:00Z"
}