{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    This course builds on the theory and foundations of marketing analytics and focuses on practical application by demystifying the use of data in marketing and helping you realize the power of visualizing data with artful use of numbers found in the digital space.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\n                                            Syllabus\n                        Course Overview and Marketing Analytics ProcessIn this module, you will become familiar with the course, your instructor, your classmates, and our learning environment. The orientation also helps you obtain the technical skills required for the course. Lesson 1 will lay out the Marketing Analysis Process (MAP), a step-by-step procedure for conducting thorough and insightful digital data analyses. Each step of MAP will be introduced with key activities.Data CollectionIn this module, you will learn the steps of the Marketing Analytics Process, unstructured data, three primary methods for collecting web-based data and tools analysis can use to collect, store, and analyze data. As a result of these activities, you will learn extensively about planning for and collecting data for your analysis projects.Data AnalysisIn this module, you will learn about data collection, data review, data biases, and data management tools. As a result of this module’s activities, you will have an in-depth understanding of structured data and know how to ensure your data is error-free and ready for analysis.Data VisualizationIn this module, you will learn how to coax insights from data that can be used to direct marketing decisions and the effective communication of data insights to stakeholders. As a result of this module’s activities, you will gain hands-on experience in data analysis and learn to make more memorable presentations and data visualizations.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Digital Analytics for Marketing Professionals: Marketing Analytics in Practice", 
    "price": 0, 
    "instructors": "Kevin Hartman", 
    "institution_name": [
        "University of Illinois at Urbana-Champaign"
    ], 
    "commitment": "8-10 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/digital-analytics", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}