{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    Marketing excellence is a prerequisite for success in any business, from startups to the world’s most established enterprises, yet the art and science of marketing is constantly evolving. Arm yourself with the essential principles and practices of marketing in the digital economy by making this course, taught by Internet consumer shopping expert and Wharton professor David Bell, an indispensable part of your knowledge base.\n\nIn this business and management course, you will gain an understanding of how the digital economy works and develop the critical insights necessary to succeed in e-commerce and digital and social media marketing.\n\nThe fixed and mobile Internet and related technologies exert a profound influence on how business and social institutions evolve, how they are challenged—and sometimes, even displaced. Companies that were non-existent a few short years ago, including Facebook, LinkedIn, and Uber, have dramatically changed how we interact, communicate and get from point A to B. Even Amazon and Google are relatively “young” by any measure. If you’re an entrepreneur, investor, manager, or student, you need thoughtful approaches to navigate and win in this new environment.\n\nThis course is organized around four broad themes and we will use relevant theory and analysis, as well as numerous practical examples to develop our key learning points.\n\nThe themes are:\n\nBehavioral foundations for understanding and navigating the new online-offline landscape\n\tNew forms of interaction, including formation of networks and reputation building\n\tTools and principles of digital marketing action including online advertising on fixed and mobile devices\n\tNew media platforms and emergence of “organic” celebrities and communities\nThis course is beneficial to marketing professionals, analysts, entrepreneurs, small business owners, investors, and consumers This course evolved from the University of Pennsylvania’s Wharton School’s very first course on digital marketing and e-commerce.\n\n                                    ", 
    "end_date": "2016-05-23T00:00:00Z", 
    "title": "DigitalMarketing1.1x: Digital Marketing, Social Media and E-Commerce for Your Business", 
    "price": 0, 
    "instructors": "David Bell", 
    "institution_name": [
        "University of Pennsylvania", 
        "Wharton School of the University of Pennsylvania"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/digital-marketing-social-media-e-wharton-digitalmarketing1-1x", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-04-18T00:00:00Z"
}