{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    This short course introduces you to exciting new concepts and applications of digital marketing. It takes an informal “story telling” approach, encouraging you to share your own stories as consumers and/or marketers for the benefit of the learner group as a whole.\n\nWhat will I learn and how might this benefit me?\n\nWe will focus on emerging trends in digital culture and online consumer behaviour, data analytics and privacy. Throughout the course, we examine the implications of these developments for both marketers and consumers.\n\n\n  Week 1 will introduce you to the course, the tutors and how it all works. We will examine the evolving changes in how we behave online and what this means for the organisations we support and do business with.\n  Week 2 will discuss developments in the technologies we use and the relationship between “online” and “offline” - is this still a meaningful distinction?\n  Week 3 will examine the opportunities and challenges in obtaining value from the vast amounts of social data now generated, at a time when much uncertainty still exists about personal privacy and control of online assets.\n\n\nWhat will the learning experience be like and what will be expected of me?\n\nThe course will take place online and will consist of a variety of videos, articles, discussions and activities based on your experience.\n\nYou should be willing to reflect upon the ideas we will discuss in the context of your own experiences, and to share your stories and reflections with others on the course.\n\nYou will be encouraged to create and share digital assets through interactive exercises and games and post a short video at the end of the course reflecting on what you have learned and how you will make use of the skills you have acquired.\n\n\n                                            Syllabus\n                        \r\nWeek 1 will introduce you to the course, the tutors and how it all works. We will examine the evolving changes in how we behave online and what this means for the organisations we support and do business with.\r\nWeek 2 will discuss developments in the technologies we use and the relationship between “online” and “offline” - is this still a meaningful distinction?\r\nWeek 3 will examine the opportunities and challenges in obtaining value from the vast amounts of social data now generated, at a time when much uncertainty still exists about personal privacy and control of online assets.\r\n\n                                    ", 
    "end_date": "2015-11-09T00:00:00Z", 
    "title": "Digital Marketing: Challenges and Insights", 
    "price": 0, 
    "instructors": "Lisa Harris", 
    "institution_name": [
        "University of Southampton"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://www.futurelearn.com/courses/digital-marketing?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-10-19T00:00:00Z"
}