{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    In this third course in the Social Marketing Specialization - \"The Engagement &amp; Nurture Marketing Strategies\" - you will learn two of the most effective social strategies used by organizations today. You'll see real-world best practice examples and learn what metrics they use to gauge success. You will also learn the importance of infographics and the impact a well-designed landing page can have on your bottom line. All of the social skills you have learned thus far will be put into action with a multimedia filter and focus blog that you will create to demonstrate how social can enable real-time marketing results. After this MOOC, you will have developed a plan to reach your target consumer markets and know when it is best to either use or avoid specific social marketing strategies.\n\nAdditional MOOC 3 faculty include: \n* Randy Krum (Data Visualization &amp; Infographics Designer | Consultant | Author | Speaker | President, InfoNewt)\n* Stanford Smith (CEO, Pushing Social)\n* Andy Crestodina (Co-Founder &amp; Strategic Director, Orbit Media Studios)\n* Ellen Valentine (Veteran Marketing Leader &amp; Evangelist, Silverpop, IBM)\n\n                                            Syllabus\n                        Social Strategy OverviewIn this module, you will learn the three social strategies being used by organizations today. Engagement StrategyIn this module, you will learn the social engagement strategy. You will see how organizations are using it today, what metrics they use to gauge success, and a real-world best practice example. Nurture Marketing StrategyIn this module, you will learn the nurture marketing strategy. You will understand why landing pages are so important and how to effectively use a multimedia filter and focus blog to enable real-time marketing results.  Developing a Great BlogIn this module, you will learn how to develop a filter and focus blog, create engaging content, and tips to be effective with it. \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Engagement & Nurture Marketing Strategies", 
    "price": 0, 
    "instructors": "Randy Hlavac", 
    "institution_name": [
        "Northwestern University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/nurture-market-strategies", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}