{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    \r\nSEO changes fast. Join 14,000+ students in the most popular, comprehensive and up-to-date SEO course on Udemy.\r\n\r\n\r\nSee what students are saying about The Complete SEO Course:\r\n\r\n\"This Course is F#$%&amp;ng AMAZING! Easy [things] anyone can implement – FREE. Can't say enough good things about this course! Thank You, Thank You, Thank You!\"\r\n\"WOW, I've seen a lot of SEO advice but this tops them all.\"\r\n\"Hands down the best course I've ever seen on SEO. Nothing I've purchased in the past has even been close to this.\"\r\n\"[Even] as a SEO specialist myself...let me tell you, I learned TONS! Well worth the price for both seasoned SEOs and beginners.\"\r\nIn this course, you'll learn to:\r\n\r\nImprove conversions 100% by increasing the speed of your site\r\nMake your site mobile-friendly (more people using smartphones than desktop)\r\nOptimize every post/page on your site so that Google sees your content as high-quality, authoritative and informative\r\nIncrease the amount of time people spend on your site\r\nMassively boost click-through rate with a rarely used technique\r\nBuild links from high SEO visibility sites\r\nPut your links and site on the 1st page of Google every time\r\nLead your visitors from informational posts to purchase pages\r\nCreate 240+ backlinks for your local business today\r\nGet your website mentioned on high-traffic news domains (CNN, NY Times)\r\nGo viral with two amazing plugins and one proven strategy\r\n\r\nIn addition to all of the ideas and strategies you get in the course, you'll also receive $175 worthof Google/Bing and Facebook advertising credits and a presentation from SEO expert Rand Fishkin, the founder and former CEO of MOZ.\r\nBy the way, there is one misspelled word in this description.  Shoot me a message if you think you've found it :)\r\nAll of the lessons are screen recorded in HD 1080p so you can see everything I mention during the lectures (check out the free preview sections).\r\nAnd there's a checklist at the end of each section with a link to every website you see in the videos.\r\nI'll personally be answering any questions you have and I'll be happy to provide links, resources and any help I can offer you in improving your site's rankings.\r\nI'll also be updating the course every month with new tactics and approaches to SEO so that you're always up-to-date.\r\nAt this point, you've read the reviews, you know about the free bonuses and you've got me on call.\r\nClick Go To Class and l'll put your site at #1. Every second you wait is just lost traffic and sales!\r\nDid you find the mispelled word?\r\n\r\nWhat are the requirements?\r\n\r\nStudents will need a Wordpress-based blog or website to use some of the plugins in the course\r\n\r\n\r\n\r\nWhat am I going to get from this course?\r\n\r\nOver 109 lectures and 5.5 hours of content!\r\nImprove conversions 100% by increasing the speed of your site\r\nMassively boost click-through rate with a rarely used technique\r\nOptimize every post/page on your site so that Google sees your content as high-quality, authoritative and informative\r\nGo viral with two amazing plugins and one proven strategy\r\nGet your website mentioned on high-traffic news domains (CNN, NY Times)\r\nCreate 240+ backlinks for your local business today\r\nLead your visitors from informational posts to purchase pages\r\nMake your site mobile-friendly (more people using smartphones than desktop)\r\nIncrease the amount of time people spend on your site\r\nBuild links from high SEO visibility sites\r\nLearn how to optimize your site to bring in more search engine traffic \r\n\r\n\r\n\r\n\r\nWhat is the target audience?\r\n\r\nThis course is for anyone looking to improve their position in the search results\r\nThe course is for anyone with their own website\r\nIf you want to improve the position of someone else's site (your employer, for example)\r\nIf you want to learn the skills necessary to optimize a website for Google\r\n\r\n\r\n \r\n\r\n \n\n                                    ", 
    "end_date": null, 
    "title": "How I Hit #1 on Google: The 2016 Complete SEO Course", 
    "price": 22.0, 
    "instructors": "", 
    "institution_name": [], 
    "commitment": "5-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.udemy.com/seo-ultimate-guide/?couponCode=LINKED", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udemy"
    ], 
    "start_date": "2016-04-30T00:00:00Z"
}