{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    This course will provide learners with a fundamental understanding of the characteristics and marketing strategies related to two key global industries, sports and entertainment. The growth in both industries have been fueled by their ability to innovate via CCCI, i.e. cross-country and cross-industry expansion. There will be a graded quiz that will consists of 10 questions during the first two weeks (together worth 50% of the grade)  and a final quiz that contains 20 questions (worth 50% of the grade) in the third week. \n\nPeople who successfully complete this course will obtain the following outcomes:\n\n(1) You will learn the key characteristics of sports marketing.\n(2) You will learn the key characteristics of entertainment marketing.\n(3) You will be able to apply cross country growth strategies to your business in the sports and entertainment industry. \n(4) You will be able to apply cross industry growth strategies to your business in the sports and entertainment industry”. \n(5) You will be able to reference CCCI, i.e. cross-country and cross-industry Innovation best practices via interviews with key experts in the sports and entertainment industry such as from adidas, Audi, and YG Entertainment (home to Psy and Gangnam Style).\n\n                                            Syllabus\n                        Sports MarketingDuring Week 1, learners will discover how to conceptualize Sports Marketing in two different ways. Sports Marketing is not only the marketing of sports but also the marketing via sports. This definition explains in clear terms how sports itself can be marketed but also how sports can be used to market other industries. Learners will then, via many examples, identify the prototypical and differentiating characteristics of sports marketing such as Fan Marketing, Influence Marketing, Storytelling in Sports, and Sports Sponsorship. In this module you  can activate sports marketing via lessons from experts from Professor John Davis at Duke, CE and Josh Mora, Sports Marketing and Media Program Director at Full Sail University. Entertainment MarketingDuring Week 2, learners will conceptualize the basic definition of Entertainment Marketing. Entertainment Marketing, as with sports, is not only the marketing of entertainment properties but also marketing via entertainment characteristics. Therefore here too learners will discover that entertainment itself can be marketed but also that other industries can benefit by employing entertainment characteristics or as a medium. Learners will then identify the many of differentiating and trending characteristics of entertainment such as Show Business Marketing, Creating Creative Content, Virtual Reality and Over the Top TV, Entertainment Branding (Placement) and Digital Viral Marketing. In this module you will learn how to apply the wisdom and expertise of Woo Jin Kim, the manager of Psy at YG Entertainment, to your own viral marketing campaigns.Cross Country &amp; Cross Industry Innovation in Sports and Entertainment MarketingIn Week 3 learners will be instructed on how companies can seek growth opportunities by cross-country and cross-industry innovation using both sports or entertainment. For both sports and entertainment, they can be the source or the beneficiary of innovation ideas. We frame this as innovation exporting or innovation importing whether it is at the cross-industry level or the cross-industry level, hence CCCI. Learners interested in activating sports and entertainment in a cross country or cross industry manner can adopt the various strategies covered in the interviews with Jörg Dietzel at Audi and HyeongKeun Kang at adidas. \n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "International Entertainment and Sports Marketing", 
    "price": 0, 
    "instructors": "Dae Ryun Chang", 
    "institution_name": [
        "Yonsei University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/international-entertainment-sports-marketing", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}