{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    This course offers a unique perspective into the differentiating aspects of business to business (B2B) marketing that can be contrasted to traditional business to consumer (B2C) marketing that is the subject of most other marketing curricula. Moreover, as one of the courses in the Specialization: International Marketing &amp; Cross Industry Growth, here too there is an emphasis on how companies can expand by cross-country and cross-industry innovation.  \n\nBy taking this course learners will obtain the following outcomes:\n\n(1) understand the differences between B2C and B2B marketing.\n(2) approach marketing problems from an inter-organizational perspective, in particular, learn about decision making at buying centers.\n(3) innovate B2B marketing via a CCCI, i.e. Cross Country &amp; Cross Industry Innovation approach.\n(4) gain insights about CCCI Innovation and best practices via interviews with top B2B industry experts.\n\n                                            Syllabus\n                        What is B2B Marketing?During Week 1, learners will obtain a fundamental and solid understanding of the characteristics of business to business (B2B) marketing. Some key constructs such as the buying center is used to explain the complex web of interactions that occur when B2B marketing takes place. The first week will  offer learners very practical methods that they can use to proactively market to B2B customers such as the 4W's Approach. This week learners will also \"learn\" from the experience of two practitioners, Alex Teo and Prasanna Meduri who discuss B2B marketing in international markets and how it is changing. There is a practice quiz and a graded quiz in Week 1 for learners to accustom themselves to a formal evaluation of basic B2B marketing knowledge acquisition.B2B Marketing MixDuring Week 2, learners will begin to dive more in depth to the specific B2B marketing elements, i.e. product, price, place and promotion. For product marketing, the key emphasis will be on how customer needs are defined in the organization during the total buying process. For price marketing, given the B2B2C nature of including the end-user, price and value, as well as costs, can be varied depending on the application. For place marketing, based on the principle that distribution is the analysis of service or functions demanded by the customer, learners will understand when and how the total channel can be designed by the various channel members including the manufacturer. For promotion marketing, boxing is used as an analogy of the combination and sequence of communication tools that a marketer can use to gain attention, instill interest, stir desire and finally move customers to action. There is a practice quiz and a graded quiz in Week 2 for learners to accustom themselves to a formal evaluation of B2B marketing mix knowledge acquisition.B2B Cross Country and Cross Industry GrowthDuring Week 3, the course concludes with how companies can pursue CCCI Growth, i.e. Cross Country and Cross Industry Growth in B2B Marketing. In Cross Country Growth learners will recap the initial issue of testing the validity of going abroad and if found, how to proceed. In Cross Industry Growth, learners will discover that the fundamental definition of B2B2C, i.e. the variation of applications of B2B products lend themselves to Cross Industry Growth possibilities. In Week 3, learners will also \"learn\" from the Cross Country and Cross Industry Innovation experience at Rolls Royce (Aero Engines), and ThyssenKrupp (Elevators) via interviews with Dr. Alex Jun and Mr. Wayne Park. There is a final quiz to assess the cumulative learning for the International B2B Marketing course.\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "International B2B (Business to Business) Marketing", 
    "price": 0, 
    "instructors": "Dae Ryun Chang", 
    "institution_name": [
        "Yonsei University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/b2b-marketing", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}