{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    Aprende las bases de Marketing llegando al fondo de toma de decisiones del cliente. Después de completar con éxito este curso, puedes aplicar estas habilidades en un reto empresarial de la vida real como parte de la Programa Especializadode Fundamentos de Negocios de Wharton.\n\n                                            Syllabus\n                        BRANDING: Estrategias de Marketing  y Posicionamiento de Marca Mercadeo La profesora Kahn nos propone comenzar con los dos primeros módulos de branding: Estrategia de Comercialización y Posicionamiento de Marca. Te aconsejamos que leas el programa que aparece más abajo, donde encontrarás un resumen de los conceptos que se cubren en el curso. Encontrarás información adicional en las Páginas del Curso. Por favor, ¡participa en los foros de debate ya que tus aportaciones mejorarán la experiencia global de este curso!ORIENTACIÓN AL CLIENTE: Los Límites del Pensamiento Centrado en el Producto y Las Oportunidades y Retos de la Orientación al ClienteEl Módulo 2 lo imparte el profesor Peter Fader, que se centrará en los conceptos relacionados con la Centricidad en el Cliente. En una economía que cada vez responde más a los comportamientos de los clientes, es imprescindible centrarse en los clientes adecuados para conseguir una ventaja estratégica. En las siguientes semanas proporcionaremos las bases necesarias para construir previsiones centradas en los clientes. Si quieres leer más sobre las opiniones del profesor Fader sobre la centricidad en el cliente, no dudes en seguirle en Twitter (@faderp). Con frecuencia comparte perspectivas y lecturas de interés.ESTRATEGIAS DE INSERCIÓN AL MERCADO: Interacciones En Línea y Convencionales y Cómo Encontrar Usuarios Principales y Facilitar la Influencia y el Contagio¡Una vez que empezamos nuestro tercer módulo, el profesor David Bell toma el relevo esta semana!  Esta vez nos vamos a centrar en  el tema crucial “Estrategias de Mercado”.  Las “estrategias de mercado” ofrecen más posibilidades que antes ya que las compañías tienen el potencial de dirigirse a los consumidores tanto online como sin conexión, a través de una variedad de plataformas. El profesor Bell ha trabajado en estos temas com varias empresas emergentes fascinantes y usará esas experiencias para ayudar a ilustrar el material de esta semana.BRANDING: Estrategias de Comunicación  Eficaz de Marca y Estrategias de ReposicionamientoLa profesora Kahn vuelve en cuarto módulo, el segundo de sus Módulos de Branding, donde tratará las estrategias efectivas de comunicación de marca y estrategias de reorientación. Uno de los aspectos más importantes para entender el comportamiento del consumidor es el de cómo los clientes perciben el mensaje y la comercialización de tu marca: lo que los consumidores perciben es lo que afecta a sus acciones, y lo que ellos perciben ¡no tienen que ser necesariamente cierto! La profesora Kahn en el último módulo del curso, profundiza en el comportamiento del cliente y en su percepción y explora estrategias eficaces para influir en ambos.\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Introducción al Marketing", 
    "price": 0, 
    "instructors": "Barbara Kahn, Peter Fader and David Bell", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "5-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/wharton-introduccion-marketing", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}