{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    Como un mercadólogo, tenemos claro que nuestra función principal en las empresas es identificar las necesidades del mercado y con base en ellas establecer estrategias de compra – venta que causen impacto y satisfagan las necesidades de los consumidores. Éste es un reto importante, pero además de ser creativos en la definición de estas estrategias, tenemos que tener en cuenta el desarrollo que a través de los últimos años ha tenido el Internet y atrás de él las redes sociales. Es por ello que hay que estar conscientes de la importancia que las redes van teniendo y cómo pueden ayudar a la promoción de los productos y servicios que como proveedor estamos ofreciendo. \n\nEn este curso podrás conocer cómo se ejecuta una estrategia de redes sociales y las consideraciones que debes de tener para controlar y medir el desempeño de tu estrategia. Podrás identificar cómo evaluar si es posible gestionar la estrategia con recursos propios, si es necesario utilizar una agencia o si es apropiado hacerlo con un esquema mixto; también reconocerás la importancia de realizar una escucha activa y las herramientas que te permitirán desarrollar esta actividad, las plataformas más convenientes y la frecuencia más apropiada para tu negocio, los indicadores clave de medir y cómo hacerlo y finalmente las técnicas para optimizar el desempeño de tu estrategia de redes sociales y lograr tus objetivos.\n\nSeguramente te serán de gran utilidad dentro del ámbito de la mercadotecnia.\n\n                                            Syllabus\n                        BienvenidaEn este módulo conocerás cómo establecer los objetivos para llevar a cabo una campaña con redes sociales y de qué manera están conectados con las actividades comerciales clave de la marca para que generen resultados. Sabrás cómo implementar un mecanismo de escucha para validar el éxito de la campaña, establecer métricas y analizar los resultados.Módulo 1. Estableciendo objetivosA través de este módulo podrás aprender cómo establecer objetivos que manifiesten lo que quieres lograr y cómo medir que realmente se logró lo que te hayas propuesto.Módulo 2. Planeando las actividades en redes socialesEn este módulo podrás revisar las diferentes actividades que se deben desarrollar para poner en marcha una estrategia en redes sociales. Módulo 3. Los recursos para redes socialesA través de este módulo podrás conocer cuáles son los recursos que se requieren definir para el desarrollo de una estrategia en redes sociales y evaluar cuándo es adecuado usar una agencia y cuándo recursos internos.Módulo 4. Evaluación y reportesEn este módulo podrás conocer los indicadores clave de rendimiento que se pueden medir para evaluar el éxito de un programa de medios sociales, así como las herramientas que puedes utilizar.\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Las redes sociales en acción", 
    "price": 0, 
    "instructors": "María de los Angeles Ramos Solano  and José Antonio Cano Chambonnet", 
    "institution_name": [
        "Tecnológico de Monterrey"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/red-social", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}