{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    Vous êtes probablement tous des utilisateurs plus ou moins « voraces » d’Internet : sur votre ordinateur, tablette ou smartphone. Vous faites vos courses en ligne, vous vous informez ou encore, ou encore, vous regardez des vidéos sur Youtube !\r\nAujourd’hui, même si l’e-commerce représente rarement plus de 10% du chiffre d’affaires du commerce dans les pays fortement développés, cet élément a chamboulé toute la dynamique du commerce moderne, y compris bien entendu au niveau des nouveaux rôles des magasins et points de vente.\r\nDans ce nouveau contexte, les consommateurs veulent utiliser simultanément l’ensemble des canaux à leur disposition. Il commence par consulter un produit en ligne depuis leur smartphone dans le métro, puis, vont en boutique pour l’essayer, et reviennent sur le site générique comme Amazon pour l’acheter depuis leur tablette ! Pourquoi ? Parce qu’ils recherchent de l’immédiateté et beaucoup d’adaptabilité lié à leur nouveau mode de vie ultra connecté.\r\nCette nouvelle façon d’acheter chez le consommateur ou expérience client a été baptisée « omnicanal ». Les entreprises ont donc pour défi de mettre en synergie tous les éléments du système marketing et « voir le marché à travers les yeux du client connecté ».\r\nDans ce cours, nous vous proposons donc de vous montrer pourquoi cette démarche est fondamentalement différente et beaucoup plus ambitieuse que ses ancêtres dit « multi canal » ou « cross-canal ». Nous vous aiderons à relever le défi d’une expérience client sans faille, grâce à quelques clés essentielles pour développer une stratégie marketing gagnante dans cette bataille concurrentielle qu’est l’omnicanal.\r\nCa vous tente ? Alors inscrivez-vous à ce cours !\r\n \n\n                                    ", 
    "end_date": null, 
    "title": "Le commerce omnicanal pour transformer la relation client", 
    "price": 0, 
    "instructors": "Charles Waldman", 
    "institution_name": [
        "ICD International Business School"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://openclassrooms.com/courses/le-commerce-omnicanal-pour-transformer-la-relation-client", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "OpenClassrooms"
    ], 
    "start_date": "2015-12-01T00:00:00Z"
}