{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    Vous allez découvrir les mécanismes à l’œuvre derrière les grandes décisions qui relèvent du marketing opérationnel :\n\nla conception d’un produit\n\tla fixation du prix auquel celui-ci sera vendu\n\tla sélection des canaux de distribution pour la vente\n\tle choix des moyens de communication par lesquels l’entreprise va informer ses clients.\nCes décisions s’appuient bien sûr sur des analyses mobilisant des concepts importants que nous vous présenterons. Tout au long du MOOC, vous aurez l’occasion d’appliquer la théorie à une étude de cas réel qui vous placera dans la peau d’un décideur marketing. Vous bénéficierez aussi d’interviews d’experts et d’échanges privilégiés et interactifs avec les professeurs lors de conférences en direct. \n \nTous les jours, consommez-vous des biens ou des services ? Ce MOOC vous permettra de saisir la logique du marketing et de devenir un consommateur plus responsable.\n\nEtes-vous un praticien non encore averti en marketing ? Ce MOOC vous permettra de comprendre le pourquoi des décisions du marketing opérationnel et de les mettre en œuvre dans un cas concret.\n\nEtes-vous étudiant et curieux ? Ce MOOC vous permettra de vous familiariser avec les pratiques du marketing, dans les secteurs marchands et non marchands.\n \nEtes-vous un étudiant en gestion ? Ce MOOC vous offrira un complément aux cours de stratégie et de marketing stratégique. Il vous permettra d’opérationnaliser les décisions dans quatre composantes classiques à savoir le produit, la distribution, le prix et la communication (les « 4 P »).\n \nQue vous soyez consommateur, praticien ou étudiant, ce MOOC vous offrira un regard éclairé sur l’éthique du marketing.\nAvec le partenariat des éditions Dunod pour l'ouvrage Lambin, J.-J., &amp; de Moerloose, C. (2012). Marketing stratégique et opérationnel. Du marketing à l'orientation-marché (8ème édition).\n \n\nThis class will provide you with an overview of the various dimensions of operational marketing (marketing decisions). These decisions concern product development, setting of a price for this product, selecting one or several distribution channels and finally communication tools in order to promote this product. Of course, these decisions rest on conceptual concepts that we will also present. You will have the opportunity to concretely apply course content through weekly case studies for which you will play the role of a manager. This MOOC provides content through videos, quiz, expert interviews, a forum, discussion (hangouts) and additional readings.\n \nTo consumers, this class will offer you an understanding of the logic behind marketing and it will enable you to become a more aware and responsible consumer.\n \nTo practitioners with no marketing background, this MOOC will enable you to understand the reasoning behind marketing decisions and to apply this reasoning in real situations.\n \nTo students with no business background, this MOOC will help you to become familiar with marketing practices both in commercial and non-profit marketing and to understand and analyze important operational decisions in marketing.\n \nTo business students, this MOOC will be complementary to strategy and marketing strategy classes. It will enable you to operationalize decisions using the 4 ‘P’s’: Price, Product, Place and Promotion.\n \nTo everybody involved in this MOOC, the ethical issues in Marketing will be highlighted. \n Ce cours est enseigné en français. This course is taught in French.\n\n                                    ", 
    "end_date": "2016-11-22T00:00:00Z", 
    "title": "Louv11x: Découvrir le marketing", 
    "price": 0, 
    "instructors": "Anne-Laure Bartier, Claude Pecheux and Chantal de Moerloose", 
    "institution_name": [
        "Université catholique de Louvain"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/decouvrir-le-marketing-louvainx-louv11x-1", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-10-04T00:00:00Z"
}