{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    Al finalizar este curso serás capaz de diseñar y ejecutar campañas para productos, servicios o iniciativas relacionadas con algún tema ambiental, así como también de crear propuestas de valor para cualquier producto o servicio con criterios de sostenibilidad ambiental, es decir, generando el mayor valor para la marca y el menor impacto posible en el entorno. \n\nEl curso de Marketing Verde te ofrece la oportunidad de tener mayores elementos de competitividad en tu gestión profesional, ya que es un espacio en el que serás capaz de definir cómo el tema ambiental puede ser un valor agregado que puedes vincular al direccionamiento estratégico y creativo de las marcas. Si eres un profesional que se desempeña en el área de mercadeo o un estudiante que tiene inquietud por el tema y pronto iniciarás tu vida laboral en el campo, Marketing Verde te dará herramientas para desarrollar tus habilidades creativas, de planeación y ejecución llevando los conceptos del marketing verde a la práctica en el diseño de estrategias y actividades empresariales. Empodérate para desarrollar una gestión de mercadeo más responsable y con criterios de sostenibilidad. \n\nPara tomar el curso de Marketing Verde debes contar con unos conocimientos básicos de mercadeo que garantizarán que puedas desarrollar y culminar este curso con éxito. Para saber si estás listo, te invito a tomar el examen de diagnóstico que plantea 10 preguntas muy sencillas de conceptos básicos de mercadeo; también, te ofrezco un material de apoyo sobre Fundamentos de Mercadeo que puedes consultar para repasar los conceptos básicos en caso de que lo necesites.\n\nDe lo general a lo particular, el curso de Marketing Verde abordará conceptos asociados a la realidad ambiental y su relación con la gestión empresarial, la planeación estratégica para productos y servicios verdes, el análisis del consumidor y su relación con el tema ambiental y las principales decisiones de mercadeo (segmentación, targeting, posicionamiento y marketing mix) vinculando el atributo ambiental.\n\n                                            Syllabus\n                        Introducción, contexto y concepto del Marketing VerdeEn este módulo nos aproximaremos al contexto que da origen al marketing verde, identificando la realidad ambiental, los conceptos básicos relacionados con el tema, los efectos de la actividad empresarial en el entorno, además de llegar a la visión y el concepto del marketing verde. Al finalizar este módulo estarás en la capacidad de: definir 3 hechos, características o aspectos que justifican la existencia del marketing verde como campo de estudio; comparar los tres enfoques de negocios que han vinculado el tema ambiental a la gestión de las empresas; resumir la visión y concepto del marketing verde en una definición propia del mismo.Planeación estratégica verdeEn este módulo abordaremos aspectos particulares de la planeación estratégica para productos y servicios verdes, entendiendo cómo el tema verde genera ventajas competitivas, la diferencia entre táctica y estrategia, y las etapas necesarias para el proceso de planeación del marketing verde. Al finalizar este módulo, estarás en la capacidad de: identificar las diferencias entre táctica y estrategia cuando se hace planeación enfocada en el tema verde; describir cómo el tema verde puede ser un generador de ventajas competitivas para las empresas; describir los pasos necesarios para hacer un proceso de planeación estratégica que vincula el tema ambiental.Consumo y consumidor verdeEn este módulo abordaremos la relación entre consumo y las problemáticas ambientales, así como el rol del consumidor y su proceso de decisión de compra para productos y servicios verdes. Vincularemos el rol de las empresas en el consumo verde y el concepto de consumo sostenible o responsable. Al finalizar este módulo, estarás en la capacidad de: describir tres relaciones entre el consumo humano y las problemáticas ambientales; describir la relación entre la gestión de las empresas y el consumo verde; identificar las etapas que intervienen en el proceso de decisión de compra y consumo de productos/servicios con atributos verdes.Exploración del valor verdeEn este módulo exploraremos dónde está el valor verde que las empresas pueden vincular a sus estrategias, a partir del análisis del mercado y los procesos de segmentación, targeting y posicionamiento. Al finalizar este módulo estarás en la capacidad de: describir qué significa explorar valor verde; comparar las tres estrategias del proceso: segmentación, targeting y posicionamiento; definir tres variables de segmentación que se tienen en cuenta cuando se quiere definir un mercado objetivo para productos/servicios verdes; enumerar las implicaciones que existen cuando se posiciona un producto/servicio a través de un atributo verde.Entrega del valor verde vía estrategias de marketing sosteniblesEn este módulo vincularemos el tema verde a las estrategias y tácticas de la mezcla de mercadeo, entendiendo ésta como la forma de entregar el valor verde vía estrategias de producto, precio y canales de comercialización. Al finalizar este módulo estarás en la capacidad de: describir cinco aspectos que relacionan el tema verde con la variable de producto; construir una propuesta de producto/servicio verde definiendo en qué consiste y enumerando las principales características del mismo que lo hacen verde; describir cinco aspectos que relacionan el tema verde con la variable de precio; describir cinco aspectos que relacionan el tema verde con la variable de plaza o canales de comercialización.Comunicación del valor verde vía planes de CIM sosteniblesEn este módulo abordaremos la variable de promoción o comunicación de la mezcla de  mercadeo desde una perspectiva integral, entendiendo conceptos clave como el greenwashing, las herramientas de comunicación como parte clave del mensaje verde y los aspectos fundamentales para diseñar un plan de comunicaciones con criterios de sostenibilidad, vinculando a su vez el rol de las marcas verdes. Al finalizar este módulo estarás en la capacidad de: ilustrar a través de 3 ejemplos o situaciones el concepto de greenwashing; proponer una estrategia de comunicación verde para una iniciativa verde; describir los principales elementos que debe tener un plan de CIM orientado al tema verde; enumerar las principales características de una marca verde.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Marketing Verde", 
    "price": 0, 
    "instructors": "Claudia Patricia Arias Puentes", 
    "institution_name": [
        "Universidad de los Andes"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/marketing-verde", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}