{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    The Course\r\nYou’ve developed an innovation, program or service to help the poor. Now how do you assess whether you’re really reaching your target market? Customers at the bottom of the pyramid are diverse. They span different ages, poverty levels and occupations and use products and services in different ways. The more you know about your target customers, the better you can develop strategies and offerings that meet their needs.\r\nThis On Demand course from +Acumen and the Grameen Foundation will teach you about market segmentation, or how to divide your market into clusters that have relatively similar needs. You’ll learn about new survey tools like the Progress Out of Poverty Index; understand the nuts and bolts of market segmentation; complete a customer segmentation matrix; and start to build customer personas so that you can better identify who you’re targeting and design products or programs with them in mind. We’ll draw from case studies of companies who have used the Progress Out of Poverty Index to collect meaningful customer insights including Starbucks, Unilever, CARD Bank, and, Samasource. After this 2 hour course, you’ll be better prepared to implement market segmentation and use new survey tools that can yield important insights about your customers.\r\n\r\n \r\nKey Learning Outcomes:\r\nBy the end of this course, you will:\r\n\r\nUnderstand how market segmentation can help you answer strategic business questions\r\nLearn more about your customers by segmenting your market\r\nBuild a customer matrix and customer personas that help your organization strategically serve the bottom of the pyramid\r\n\r\n \r\nMore questions?\r\nPlease visit our +Acumen Page for more information. We invite participants to form groups to work together on this course. If you'd like to form a group with others, please send this link to your friends or colleagues to ask them to sign up!\r\nhttps://novoed.com/market-analysis/\r\nIf you don't have a group, no problem. On the the NovoEd platform you will have an option to form a group. Or, you can also participate as an individual and interact with others on the course forum. If you have any questions, please contact us atcourses@plusacumen.org\r\n \r\nThis Course Is For You If:\r\n\r\nYou’re an aspiring or practicing social entrepreneur targeting the poor\r\nYou’re a global development professional who wants to understand if your program or service is reaching your target market\r\nYou took the Measuring Social Impact course from +Acumen and want to learn more about a specific application for the Progress Out of Poverty tool\r\n\r\n\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Market Analysis at the Bottom of the Pyramid", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "+Acumen"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/market-analysis", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2015-02-17T00:00:00Z"
}