{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    Learn practical research tools and how to leverage them to obtain customer understanding and insight. Learning will center on emerging areas of market research such as ethnography where customers are observed in their “home environments”, and where deep insights in their consumption behaviors can be developed. Unlike conventional survey or quantitative research, qualitative approaches provide insight into why customers make the decisions they do.\nQualitative research methods can help to uncover unmet wants and needs that customers sometimes cannot express in a traditional survey approach. This can be very useful in the early stages of innovation development where organizations are often dealing with “unknown unknowns.”\nParticipants will be taken through a systematic approach to designing different types of qualitative research that can help to uncover deep customer insights. After completing the course you will be able to effectively leverage these methods to facilitate success in early stages of the innovation process of an organization.\n\nYou will earn a professional certificate from the University of British Columbia and edX upon successful completion of this course. Certificates can be uploaded directly to your LinkedIn profile.\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Marketing5503x: Customer Insight through Qualitative Research", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/customer-insight-through-qualitative-ubcx-marketing5503x", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-01-31T00:00:00Z"
}