{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    Understanding who your customers are and what they need and want is at the heart of successful marketing strategies. In this course you will explore how to identify and classify customers and the different methods that marketing professionals use to shed light on how they make purchase decisions.\n\nThe course will cover the following:\n1. Marketing Fundamentals\n2. Product, Pricing and Channel Decisions \n3. Building Strong Brands \n4. Communication Strategy\n\n                                            Syllabus\n                        Course Overview &amp; Week 1Welcome! Before you start today's videos, please have a look at the syllabus. In this first session, I'll give you an overview of what marketing is all about and why it's key to communicating a company’s value proposition. You’ll also get a grasp of marketing essentials, particularly how to frame challenges and what to think about when making decisions. Objectives: To gain insight into the basic pillars of marketing.\nWeek 2: Product, Pricing &amp; Channel DesignIt’s hard to remember what the world was like before iPods, iPhones and iPads. But when Apple released the first iPod in 2001, it was not an automatic blockbuster. The product was great, but it took a lot of marketing savvy to set it on it’s successful path. All companies – whether selling electronics, gastronomic experiences, or credit cards – need to worry about making product, pricing and channel decisions. In this second session, we will explore what a product really is, how to estimate its demand and manage it. In addition, we’ll discuss the fundamentals of pricing, channel design and channel management. Objective: To gain an understanding of what a product really is, how to manage pricing and make decisions about channels.\nWeek 3: Building Strong BrandsStrong brands make a great impact on individuals and society; they are key to communicating value and getting the word out about a product or service. In this session we will explore the importance of brands as assets and branding in general. We will define the concept of brand equity and the essence of managing brands for value. Objective: To understand how branding contributes to a company’s value and how to go about developing a strong brand.\nWeek 4: Communication StrategyOnce a company has a good grasp of its customers, it can now develop a communication strategy to appeal directly to their interests and needs. In this session I will introduce a framework that will show you how to organize your communication strategy in order to successfully launch a product or service. We will also discuss what the objectives and target market of that strategy should be. Mapping the decision-making process is also key since you will need to learn to adapt the message and content to each stage of the customer journey. Objective: To define the elements and list the steps for building a sound communication strategy.\n\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Marketing: Understanding Your Customers", 
    "price": 0, 
    "instructors": "Mario Capizzani", 
    "institution_name": [
        "IESE Business School"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/marketing-iese", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}