{
    "selfpaced": false, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n                    \n                    \n                    ¿Te has preguntado cómo se manejan las campañas a través de las redes sociales? ¿Cómo es el proceso que se realiza? ¿Cómo puedo sacar provecho de ellas para posicionar mi producto o mi servicio? \n\nÉstas y muchas más preguntas nos hacemos al ser parte de los consumidores que adquirimos un producto o servicio y que el medio por el cual nos enganchamos a él, fue una red social, pero también y principalmente como proveedor, nos interesa cómo sacar provecho de ellas para favorecer nuestro negocio.\n\nEn este curso podrás conocer cuáles son los elementos que necesitas considerar para realizar tu estrategia de redes sociales. El pilar de todo esto es tener una técnica apropiada que te ayude paso a paso a llevar a cabo cada etapa, en donde todo comienza con una buena planeación. Es preciso, así mismo, contar con una estructura que permita pasar de la planeación a la ejecución y finalmente saber qué y cómo medir de los resultados. Una estrategia debe de ser realista y medible, por ello, este curso está diseñado para que aumentes las posibilidades de éxito utilizando la metodología que sugerimos.\n\n                                            Syllabus\n                        BienvenidaEn este módulo te damos la bienvenida al curso y te expondremos a grandes rasgo los temas a tratar y los objetivos a alcanzar.Requerimientos para hacer social media marketingA través de este módulo podrás comprender el significado de social media marketing, los tipos de redes existentes y la importancia de enganchar con los clientes. Modelo SOSTAC: Definición de la estrategiaEn este módulo podrás revisar cuáles son los primeros pasos del Modelo SOSTAC que ayudan a ir definiendo una estructura para el desarrollo de una estrategia con redes sociales.Modelo SOSTAC: Content MarketingA través de este módulo, podrás conocer qué es una estrategia de Content Marketing y el por qué es importante en el desarrollo de una estrategia con redes sociales.Modelo SOSTAC: Estrategia de comunicaciónEn este módulo podrás conocer el cómo crear una estrategia de comunicación, la integración de los equipos de mercadotecnia, la creación de contenido, así como su plan de acción.\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Requerimientos, planeación, ejecución y medición de estrategias para redes sociales", 
    "price": 0, 
    "instructors": "María de los Angeles Ramos Solano  and José Antonio Cano Chambonnet", 
    "institution_name": [
        "Tecnológico de Monterrey"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/mercadotecnia-sociales", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}