{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>In Advanced Arduino Boards and Tools, I take you on a tour of some of the best technology that the Arduino ecosystem has to offer. This course will contain more than 8 hours of video, presented in over 50 lectures.</p>\n\n<p>The Arduino Uno is awesome: rugged, easy to use, low cost, configurable, open source. But sooner or later, you will feel that it is not enough for your projects. Not enough inputs and outputs. Not enough speed. Not enough memory. Not enough communications options. The list goes on.</p>\n\n\n\n\n\n\n\n<p>The Arduino ecosystem has you covered. There are more powerful alternatives to the Arduino Uno. You can leverage your existing equipment and components, and especially the time and effort investment that you have made to the Arduino, and adopt a more powerful and specialised Arduinos for your next project.\n</p>\n\n\n\n\n\n\n\n<p>In this course, I present some of the best currently available advanced Arduino boards. I try to help you understand what is special about each one, how you can use them in your projects, and what to look out for when you migrate from the Arduino Uno.</p>\n\n\n\n\n\n\n\n<p>Of course, advanced Arduino projects depend on software, as well as on hardware. Advanced projects need advanced tools! In this course, I also have this covered. Learn about advanced debugging and editing tools, cloud-based automation, and Arduino-PC collaboration.</p>\n\n\n\n\n\n\n\n<p>In this course, I cover these advanced Arduino boards:</p>\n\n\n\n\n\n\n\n<ul><li>Arduino Mega 2560</li><li>Arduino Due</li><li>Arduino 101</li><li>Arduino Zero</li><li>Arduino Galileo Gen 2</li></ul>\n\n\n\n\n\n\n\n<p>For each board, I discuss the features that distinguish them apart from other Arduino (their \"special powers\"). I demonstrate these features through experimentation.</p>\n\n\n\n\n\n\n\n<p>I also cover these tools:</p>\n\n\n\n\n\n\n\n<ul><li>Atmega Studio, an advanced editor and debugger</li><li>Atmega Atmel-ICE, a debugger and programmer device</li><li>Temboo, a cloud automation platform for the Internet of Things</li><li>Processing, a language and framework for creating desktop applications that inter-operate with the Arduino</li></ul>\n\n\n\n\n\n\n\n<p>All demo sketches are available for download from Github, so you will not need to do much typing.</p>\n\n\n\n\n\n\n\n<p>To make the most of this course, you should already have some working experience with a basic Arduino board, like the Uno. If you are just starting now, I suggest that you consider enrolling to Arduino Step by Step, and working through the project in Beginning Arduino.</p>\n\n\n\n\n\n\n\n<p>You do not need to own one of these boards to take advantage of the materials in this course. You can use this course as a reference guide to understanding each board's benefits and disadvantages before you choose one for your next project.</p>\n\n\n\n\n\n\n\n<p>Start learning about Advanced Arduino Boards and Tools now!</p>", 
    "end_date": null, 
    "title": "Advanced Arduino Boards and Tools", 
    "price": "30.00", 
    "instructors": "Peter Dalmaris", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/799240_d402_4.jpg", 
    "course_url": "https://www.udemy.com/advanced-arduino-boards-and-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T01:04:30Z"
}