{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Este es el segundo curso de la serie “Topografía con drones”. En estas publicaciones ofreceremos todos nuestros conocimientos de sobre UAVs y procesado de datos que ya ofrecemos en nuestros cursos presenciales, de manera que cualquiera pueda acceder a esta información, en cualquier lugar del mundo y desde la comodidad de su casa u oficina.</p>\n\n<p>La información que te proporcionaremos la hemos adquirido con muchísmas horas de estudio, pruebas, y trabajo de campo. Está resumida y explicada de forma fácil, pero es información muy valiosa y difícil de obtener.\n\n  </p>\n\n<p>Si quieres comenzar en la topografía con drones, participar en este curso te va a ahorrar semanas de trabajo investigando por tu cuenta lo que nosotros ya hemos investigado, haciendo las pruebas que hemos hecho, y cometiendo los errores que ya hemos cometido.\n\n  </p>\n\n<p>Si podemos ahorrarte un solo accidente con tu dron, o un solo trabajo mal realizado, estos cursos habrán valido la pena.\n\n  </p>\n\n<p>En esta segunda parte, nos centraremos en cómo crear una misión de fotogrametría, veremos los aspectos técnicos más importantes de un dron y, por último, veremos cómo ejecutar los vuelos autónomos que son necesarios para realizar la topografía.\n\n  </p>\n\n<p>Hemos detallado cada tarea paso por paso y hemos explicado los motivos detrás de cada decisión y consejo que damos. Te recomendamos hacer ejercicios prácticos con tu dron después de acabar el curso, para afianzar los conocimientos.  </p>", 
    "end_date": null, 
    "title": "Aprende a realizar topografía con drones (2/5)", 
    "price": "45.00", 
    "instructors": "Jose Alberto Soler", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830694_3f6c.jpg", 
    "course_url": "https://www.udemy.com/topografia-con-drones-parte-2/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-24T16:15:31Z"
}