{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Have you ever wanted to build your own computer? What components do you buy? Will they fit together? Are they the right ones? </p>\n\n<p>These are all questions that Brian had when he thought about building his own computer. So he approached one of his good friends, Dan, to help walk him through the process.<br></p><p>Over the course of a couple hours, we'll look at how to take some of the scariness out of building a computer. One of the key things Brian found out when building his computer is that there's a ton of different options. Do you pick an Intel processor? AMD? How much RAM do you need on your GPU? How can you make sure your power supply supports everything in your computer?</p><p>These are all tough questions that you'll need to answer every time you build a computer. And since every computer is built differently, there's not necessarily a <em>correct </em>answer for every scenario. A huge part of the computers you build is dependent on <em>why </em>you want to build it and what you'll be using it for.</p><p>So instead of focusing on the specific parts Brian picked out for his computer, we'll look at <em>why </em>they were picked and talk about how you can start choosing your own.<br></p><p>We've structured this in a way where both Brian and Dan will chat about each component first. We'll start each module with an introduction where we'll look at what the component is, why we picked that particular one and offer some tips and insights for how you can pick your own parts.</p><p>From there, in each module we'll take a look at how the components are installed. Again, we'll focus on not only the specific pieces we're building in this course but looking at some more general tips you can use for your own build.</p><p>Join Brian and Dan on this journey as they take the stress out of building a computer and help you do the same.<br></p>", 
    "end_date": null, 
    "title": "Beginner's Guide to Building Computers", 
    "price": "20.00", 
    "instructors": "Dan LeFebvre, Brian Collins", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741836_c43e_3.jpg", 
    "course_url": "https://www.udemy.com/stress-free-computer-building-on-a-budget/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T04:47:24Z"
}