{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t       This course is designed for beginner makers. I will help you get started with the basics of creating circuits with the Arduino prototyping board, and by the end of this course you will have an Internet-connected home environment monitoring gadget, build with your own hands!  </p>  <p>  \t       The only prerequisite is a basic understanding of concepts like voltage, current and resistance, and ability to download and install software on your computer. A very basic understanding of programming is a bonus, but not absolutely necessary.  </p>  <p>  \t       Along the way, you will learn about programming, sensors, and communications.  </p>  <p>  \t       The course is split in three parts:  </p>  <p>  \t       Part 1 is an introduction, which will gently help you create your first circuit and open your appetite for more.  </p>  <p>  \t       Part 2 contains a primer on making with the Arduino, focusing on the Integrated Development Environment and the sketching language.  </p>  <p>  \t       Part 3 is about making JING. JING (not an acronym!) is the environment monitoring system that you will put together piece by piece, and line by line.  </p>  <p>  \t       If learning by making sounds like the way to go, then this course is for you!  </p>  <p>  \t<strong style=\"\"> Materials: </strong>  </p>  <p>  \t       To fully take advantage of this course, you will need (all of these are easily sourced from Ebay):  </p>  <p>  \t       1) An Arduino (I suggest a genuine Arduino Uno)  </p>  <p>  \t       2) A photoresistor  </p>  <p>  \t       3) A DHT22 temperature and humidity sensor  </p>  <p>  \t       4) A BMP085 barometric sensor breakout  </p>  <p>  \t       5) A 16x2 LCD screen based on the Hitachi HD44780 driver (or compatible, these are very common)  </p>  <p>  \t       6) A potentiometer  </p>  <p>  \t       7) Assorted resistors  </p>  <p>  \t       8) A small breadboard  </p>  <p>  \t       9) Lot&#039;s of breadboard wires.  </p>", 
    "end_date": null, 
    "title": "Beginning Arduino: Make your own environment monitor system", 
    "price": "20.00", 
    "instructors": "Peter Dalmaris", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342122_628c_3.jpg", 
    "course_url": "https://www.udemy.com/beginning-arduino/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T06:31:59Z"
}