{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \tThis course starts off with an overview of the interface of Civil 3D, showing you how Civil 3D applies settings and styles to automate object placement. Building on this knowledge, you will learn to create and edit surfaces, alignments, and profiles. Once you have the core components to roadway modeling ready, you will discover how to create assemblies and subassemblies which are the building blocks of your corridor. You will then build your corridor model, and learn how to use the intersection design wizard to create a complete road. Finally, you will learn how to lay out and edit a pipe network. By the end of this course, you will be able to apply what you&#039;ve learnt to create all Civil 3D objects necessary to build a road.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<span><strong style=\"\">Seth Cohen</strong> is Vice President of 3C CAD Inc. 3C CAD specializes in civil engineering and CAD applications including Civil 3D, Map 3D, AutoCAD, MicroStation, and InRoads. 3C CAD Inc conducts many classes for CAD professionals and specializes in providing project start-up and CAD standards implementation for commercial and government organizations. Founded over 15 years ago, 3C CAD Inc has extensive experience in civil engineering, helping managers, designers, and construction firms implement CAD, produce plans, as well as aid in AMG (Automatic Machine Guidance).</span>  </p>", 
    "end_date": null, 
    "title": "Building a Road using Civil 3D", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363690_9d84_2.jpg", 
    "course_url": "https://www.udemy.com/building-a-road-using-civil-3d/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T08:45:34Z"
}