{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t  This video course teaches you how to make a 3D printer for yourself and  calibrate and adjust it perfectly. You will get to know how to solve and  prevent common problems and discover alternative solutions to tailor  your 3D printer to your liking and needs. You will learn how to assemble  parts for your 3D printer and build it with ordinary tools and skills.  The course starts off with assembling of the Y-Unit and the XZ-Unit  before moving on to the extruder and wiring. Next, you will be shown how  to execute some simple calibrations and suddenly you&#039;re printing in 3D  with your very own 3D printer. By the end of the video, you will be a  junior 3D printing expert. This 3D printer used for demonstration in  this course is especially designed for easy assembly and use, and gives  you a head start in building your own 3D-printers for now and for the  future.  </p>  <p>  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p style=\"\">  \t<strong style=\"\">Bram de Vries</strong> is a mechanical engineer and social scientist dedicated to open hardware. He has previously worked at Demotech, developing pro-poor technologies in Guatemala, Ethiopia, and India.  </p>  <p>  \t  The overarching aim of his work is to open up innovations and make  them accessible. For the last four years, his focus has moved from water  pumps to open source 3D printing. He also tutors Blender courses.  </p>", 
    "end_date": null, 
    "title": "Building a RepRap 3D Printer ", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351774_2695.jpg", 
    "course_url": "https://www.udemy.com/building-a-reprap-3d-printer/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T09:58:26Z"
}