{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Discover how, at an extremely low cost, you can create your own retro games machine and play </strong><strong>all your favourite games from years gone by, whatever the game, whatever the platform.</strong></p><p>Game emulators have been around for years, but they can be confusing to set up, and often the games you want to play, simply just don’t work!</p><p>Dedicated hardware exists to emulate certain game systems. But they emulate just ONE system, usually miss out vital things you need to play your games, and cost FAR more than the Raspberry Pi based system you’ll create yourself by the end of this course.<br></p><p>Where is the fun in buying something that is limited in what it can do, when you can build your own, far more powerful solution at a fraction of the price? And one that does exactly what YOU want.</p><p>In this course you will be taken, step-by-step, through exactly what you need to know in order to create your own retro gaming machine. Not only is it tiny and can be permanently connected to your TV, out of site, and ready for whenever you want a quick blast from the past, but you will have access to a huge selection of different games systems and games.</p><p><strong>Many people have tried building something like this and end up with over 90% of the games not </strong><strong>working – because they don’t have the information that is covered in this course. </strong></p><p>Take a look at just <em>some </em>of the systems this course shows you how to emulate...</p><ul><li>Amstrad CPC</li><li>Atari 2600</li><li>Atari 800</li><li>Atari Lynx</li><li>Atari ST</li><li>Apple II</li><li>Colecovision</li><li>Commodore Amiga</li><li>Commodore Pet</li><li>Commodore 64</li><li>Gameboy</li><li>Gameboy Color</li><li>Gameboy Advance</li><li>Intellivision</li><li>MSX</li><li>NeoGeo</li><li>NeoGeo Pocket Color</li><li>Nintendo Entertainment System</li><li>Nintendo 64</li><li>Sega Game Gear</li><li>Sega Master System</li><li>Sega Megadrive</li><li>Sega CD</li><li>Sony Playstation</li><li>Super Nintendo</li><li>Vectrex</li><li>ZX Spectrum</li><li>Thousands of arcade machine games!</li></ul><p><br><strong>And this is <em>nowhere</em> near a complete list! </strong>There are many more games consoles and microcomputers that you could be playing.<br></p><p>Learn from someone who has built his own machine, has tried all the major options out there, and has cut through the minefield of misinformation, confusion, and problems that trying to do something like this on your own entails. Let me help you build YOUR ideal retro gaming machine so you too can relive the fun and excitement.<br><br></p><p><strong>FAQ</strong></p><p><strong>Q. Will I need to do any soldering or know any electronics to do this?</strong><strong></strong><br><em>A. No. The hardware side of this simply involves clipping things together and plugging in cables.</em><em></em></p><p><strong>Q. Do I need to do any programming, know Linux, or edit files?</strong><strong></strong><br><em>A. No. I’ve made things as straightforward as possible – no coding of any sort required! This is a Raspberry Pi project that is aimed at Pi newbies and experts alike. If you are a Linux or Raspberry Pi </em><em>expert then feel free to dive right in though, and customize things even further if you want to.</em></p><p><strong>Q. Do I need to know about the Raspberry Pi before I do this course?</strong><br><em>A. No. I take you through everything you need to know, covering what it is and where to get it.</em></p><p><strong>Q. What if I run into problems?</strong><strong></strong><br><em>A. It’s unlikely that you will because I’ve made everything as straightforward as possible, but in the unlikely event that you do then I’ll be there in the discussion area, ready to give you help, should you </em><em>need it.</em></p><p><strong>Q. I’m experienced with the Raspberry Pi, what else can I do with this?</strong><strong></strong><br><em>A. A lot! For example, instead of a simple case, why not build a custom arcade cabinet, or house the Raspberry Pi inside a controller, or program genuine arcade sticks to work with it? If you are experienced with hardware projects and coding on the Pi then there are no end of ways you can </em><em>extend this project.</em></p><p><br></p>", 
    "end_date": null, 
    "title": "Build Your Own Retro Games Machine with Raspberry Pi", 
    "price": "20.00", 
    "instructors": "Chris O'Connor", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573646_ec31_3.jpg", 
    "course_url": "https://www.udemy.com/retrogames/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T16:07:27Z"
}