{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Have you ever wanted to build your own super computer? Do you want to write programs that can run simultaneously on as many computing nodes as you wish? Do you want to learn what it takes to combine the processing powers of two, four, eight or more Raspberry Pis and run simulations at a fraction of the time and cost of running on a mainframe or even a high-end desktop computer?</p><p>If you&#039;ve answered yes to any of these questions, then this course is for you. In this step-by-step series of video lectures, you&#039;ll learn how to set up your own computer cluster using cheap, affordable computers - and it doesn&#039;t get any more affordable than the Raspberry Pi.</p><p>Whether you&#039;re a Raspberry Pi enthusiast, a scientific researcher in need of cheap, expandable processing power, a programmer looking to expand their horizons with multithreaded algorithms, or a student looking to learn more about using Linux to build computing clusters, then you&#039;ll find plenty of value in this class as you build your own Raspberry Pi super computer.</p><p>These lectures are specially tailored to the Raspberry Pi 2 B+ board using Raspbian (a distribution based on Debian), which is a good place to start if you&#039;re unfamiliar with the Linux command line or building computer networks. If you are comfortable with the various flavors of Linux, you can use this course as a guideline for what it takes to build your own cluster using a different distribution.</p><p>Lastly, this class is a &quot;living course&quot;, which means as we receive feedback and requests for specialized tutorials or updates, we&#039;ll continually update and add more to improve the quality and content of the course.</p>", 
    "end_date": null, 
    "title": "Build Your Own Super Computer with Raspberry Pis", 
    "price": "20.00", 
    "instructors": "Ben Heidorn", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/558166_4432_3.jpg", 
    "course_url": "https://www.udemy.com/build-your-own-super-computer-with-raspberry-pi/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-18T18:04:00Z"
}