{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t  This coursework is on Multisim. In this coursework students will get opportunities to simulate, design and analyse the analog and digital electronic circuits along with Spice Modeling.  </p>  <p>  \t  Some of the circuits includes Slew Rate calculation circuit, RC Circuit, Voltage Regulator, Half wave rectifier, NOR Gate using CMOS, AND Gate etc.  </p>  <p>  \t  In this coursework all the relevant materials related to Multisim has been included. Students will gain a comprehensive knowledge once they finish this coursework.  </p>  <p>  \t  This coursework is two hours fifteen minutes long. So a serious engagement with this course will hardly take a day to have a firm grip on Multisim.  </p>  <p>  \t  This course has been structured in the following ways :  </p>  <p>  \t  1. Circuit design of Analog and Digital Circuits.  </p>  <p>  \t  2. Circuit analysis .  </p>  <p>  \t  3. Brief description of each circuit and its operational methodology.  </p>  <p>  \t  4. Spice modeling .  </p>  <p>Right from beginners to those who are interested in quick refresh of Multisim should take this course. This coursework has everything that a beginner wish i.e. circuit design, analysis, description of the circuit and spice modeling. For those who wish a quick refresher for them this coursework has been made as short as possible.  </p>  <p>  \t  So, this coursework should be taken by all those who has a strong desire to understand electronics in details.  </p>", 
    "end_date": null, 
    "title": "Circuit Design, Analysis and Spice modeling using Multisim", 
    "price": "20.00", 
    "instructors": "Ifind Tutorials", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432306_b52d_2.jpg", 
    "course_url": "https://www.udemy.com/circuit-design-analysis-and-spice-modeling-using-multisim/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T19:34:28Z"
}