{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Have you wanted a powerful computer. <strong style=\"\">Welcome to Customize PC 2015</strong>.</p><p>DIY is the best solution. Why not just buy off the shelf package from Dell, Acer, HP or others?Off the shelf is good for people that do not need customisation.Off the shelf PC also come with a heavy price tag. And most of the time you want some of the component in Dell and other component in Acer, you can pick and match.</p><p>DIY is your solution, first of all if you are getting similar specification with the branded PC, DIY will be must cheaper comparing apple to apple.</p><p>DIY offer you the following benefitYou get to choose the casing you want, do you want a big or small casing, how about USB port do you want it to be at the front or at the back or even both. How about DVD Drive do you want 1 or 2 DVD drive. Having 2 DVD drive mean you can copy DVD disk easily. Most of the branded PC has only 1 DVD Drive and adding 1 more Drive mean extra money and it is much more than you buy a DVD drive at your local hardware shop or even Amazon.Choose the motherboard you wantGraphic card if you are a gamer or do you want just a normal (good) graphic card but spend the budget away for more RAM or getting a SSD harddisk</p><p>with DIY anything is possible, it is only your imagination</p><p>In this course I show you how to build and customized a PC from scratch.</p><p><strong style=\"\"><em style=\"\">And if any component is faulty along the years, you will know how to replace it. No need to bring down to your hardware guy as you are the one that assemble it and you can replace it yourself</em></strong></p>", 
    "end_date": null, 
    "title": "Computer How to build a customized PC Computer from Scratch", 
    "price": "20.00", 
    "instructors": "Cory Saton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592496_5895.jpg", 
    "course_url": "https://www.udemy.com/build-a-customized-pc-from-scratch-in-under-2-hour-guranteed/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T04:53:17Z"
}