{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Themes in Moodle are plugins that help you to create a different look and feel for your Moodle courses. These themes act as custom “skins&quot; which help you to make your courses stand out from the rest. With your personalized themes, you will enjoy functionality and elevated performance along with a very unique design for your own “brand&quot; of courses.</p><p>This tutorial offers you a step-by-step guide to building your own customized themes on top of the existing Moodle plugins. </p><p>This comprehensive video tutorial will introduce you to the process of selecting the Moodle themes that best suit your requirements and then further customizing them to your design needs. You will learn to identify the elements that will make your Moodle course better, followed by ways to achieve superior functionality.</p><p>You will learn how themes can help you build an exclusive look for your courses and create a positive user experience for your viewers. You will go through a quick tour of pre-installed themes in Moodle, and then learn how to customize the appearance of elements of any theme that you select. If you are working with a Moodle administrator, you&#039;ll learn how to download and install new themes, and to modify their appearance quickly and easily using Cascading Style Sheets (CSS). A quick drive through this course and you will be on the road to developing a strong brand identity for all your Moodle courses and programs.</p><p><strong style=\"\">About the Author</strong></p><p><strong style=\"\">Susan Smith Nash</strong>, who has been involved in the design, development, and administration of e-Learning programs and courses since earning her Ph.D. in the late 1990s, has developed and administered online courses on many platforms, using many different learning management systems. She is responsible for developing degree and certificate programs delivered in online and hybrid formats and has worked on implementing e-Learning in universities, corporations, and associations.</p><p>The author of the award-winning e-Learning blog E-Learning Queen and several books on e-Learning, Susan Smith Nash has focused on developing courses that optimize user experience and enhance performance, outcomes, and course persistence/completion.</p><p>Her portfolio of publications includes peer-reviewed articles and books, including the following:</p><li> The video Moodle for Training and Professional Development, Packt Publishing, 2013</li>", 
    "end_date": null, 
    "title": "Designing Moodle Themes", 
    "price": "35.00", 
    "instructors": "Packt Publishing", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542994_2a52_2.jpg", 
    "course_url": "https://www.udemy.com/designing-moodle-themes/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T10:37:23Z"
}