{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  <strong>******** This course is updated to May 1, 2016 ********</strong> \n\n  </p>\n\n<p>Being a capable electronics designer does not make you a good one.  \n\n  </p>\n\n<p>Being an expert in Arduino, Raspberry, firmware, embedded software and microcontrollers, hardware, PCB design, digital and analog design, is only a part of what designers need to know.  \n\n  </p><p>A beautiful and functional product can be appealing, but if basic safety rules are not taken into account even before starting the actual  design activities, a <em>poor design can endanger people and cause its designer big troubles</em>. </p>This course focuses on design safety with respect to electrical/electronics application, including PCB design. It covers the most important aspects that designers need to know, and it teaches a general methodology to develop electronics and electrical applications (including PCB) in compliance with safety principles and international standards.\n\n  <p><strong>+++++ Have a look at the course curriculum +++++</strong><br></p>\n\n<p>At the end of the course:\n\n  </p>\n\n<ul><li><em>you will be able to find      in international standards and understand the applicable electrical safety      requirements for your electronics project</em></li><li><em>you will be able to      calculate the most important parameters like clearance/creepage distance      and solid insulation, to be considered during insulation, electronics and PCB design</em>\n\n</li><li><em>you will be able to      choose the proper IP isolation against ingress of water and solid      particles</em>\n\n</li><li><em>you will be able to      choose critical electronics components and verify their certifications</em>\n\n</li><li><em>you will know what      insulation diagrams are and how to make and use them</em>\n\n</li><li><em>you will know what      international standards are, how they are made and where you can find them</em>\n\n</li><li><em>and you will understand      the design process and steps toward a compliant product</em>\n\n</li></ul>\n\n<p>so basically you will be able to design a functional, safe and ready for the market electrical application.\n\n  </p>\n\n<p><strong>HAVE A LOOK AT THE LESSONS AVAILABLE FOR FREE IN THE COURSE CURRICULUM !!!</strong></p><p>We will introduce the basic concepts and techniques of electrical, electronics and PCB design for safety, teaching you the path to a project compliant with product safety legislation.</p>We will cover both basic electrical definitions like the product classification and more advance concepts like creepage calculation and critical electronics components.\n\n<p>Throughout the course you will find practical examples on how to use these techniques on electrical and electronics household appliances design (e.g. food mixers and electric toasters). \n\n  </p>\n\n<p>We will take as a reference the most important and recognised international safety standards, like IEC 60335 series, IEC 60529, and the like.\n\n  </p>\n\n<p>The last section will be dedicated to describe the whole design process, from the design specifications to final verification and validation, with a practical example on an electric toaster design.\n\n  </p><p>------------------------------------------------------------------ \n\n  \n\n</p><p>The course is made essentially of video lessons, but reference to guidelines and datasheets are provided, when considered useful.  \n\n  </p>\n\n<p>You will also find several tests. We strongly recommend to take the tests before proceeding to check the concept you have learned.  \n\n  </p>\n\n<p>If you really want to understand the safety related part of an electrical/electronics and PCB design and complete your technical culture with this important cornerstone, this course is a must.\n\n  </p>\n\n<p><strong>HAPPY LEARNING!!!</strong></p>", 
    "end_date": null, 
    "title": "Electrical,  Electronics and PCB Design Safety & Compliance", 
    "price": "20.00", 
    "instructors": "Marco CATANOSSI", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647780_132c.jpg", 
    "course_url": "https://www.udemy.com/designers-guide-to-electrical-safety-isolation-standards/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T12:51:41Z"
}