{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t Fast Track to Adobe Captivate 6 will teach you how to design, develop, and share e-learning faster than ever before and get the most out of your Adobe Captivate experience.  </p>  <p>  \t Fast Track to Adobe Captivate 6 provides you with the essentials for getting started with Adobe Captivate 6 with useful examples and best practices on how to construct an e-learning course from start to finish in about 2 hours.  </p>  <p>  \t In this course, you’ll be learning how to use built-in themes, create styles, import images, round trip with PowerPoint slides, add relevant content, and work with animations and smart interactions. Additionally, you’ll learn how to prepare for and record a software simulation, add and synchronize video, record audio, and build quizzes into your project. This course will enable you to reach a wider audience by publishing projects to the web, desktops, YouTube, notebooks, tablets, and learning management systems.  </p>  <p>  \t Overall, the goal of this video course is to make you a better e-learning developer by mastering the basic skills first. Each section is self-contained and provides a practical exercise designed to help you recall the information you just learned and apply it when you’re on your own.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<span>During <strong style=\"\">Anita Horsley</strong>’s years as a firefighter in Atlanta, she trained firefighters to be nationally certified personal fitness trainers. She also developed, from initiation to implementation, the health and safety program. As a Training and Development Specialist at the Oregon Office of State Fire Marshal, she founded the e-learning track and worked on all areas of training. Anita was the domain manager for the LMS, program coordinator of the e-learning implementation team, and managed the Oregon State Captivate user group. She currently teaches Adobe Captivate to local and state agencies and develops e-learning courses as an independent contractor. Anita is an Adobe Certified Expert and has her Master’s degree in Education.</span>  </p>", 
    "end_date": null, 
    "title": "Fast Track to Adobe Captivate 6 ", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399880_d7c9_2.jpg", 
    "course_url": "https://www.udemy.com/fast-track-to-adobe-captivate-6/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T08:44:22Z"
}