{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Learn how to build your very own custom gaming PC from the ground up! No prior experience or knowledge is required to enroll in this do-it-yourself project course.</strong></p>\n\n<p>My name is Cody Ray Miller, an IT professional and complete computer geek. I'll be walking you through the process of building your own PC step-by-step.</p>\n\n<p><strong class=\"redactor-inline-converted\">The course covers everything from selecting custom parts, to putting it all together. </strong>Plus bonus sections to help you DIG DEEP inside each piece of hardware and understand how it works and why..</p>\n\n<p>Although intended for absolute beginners, anyone can enroll in this course and follow along to build an awesome gaming PC for less than $1,000.</p>\n\n<p>After taking this course, you'll know exactly how to <strong class=\"redactor-inline-converted\">DESIGN</strong> and <strong class=\"redactor-inline-converted\">BUILD</strong> a computer system of any kind, for any purpose. You'll be fully equipped to create systems for other people, according to their specific needs.</p><p>You'll also increase your knowledge of all system components, thereby improving your ability to diagnose, troubleshoot, and repair PC hardware.</p><p><strong>All course updates are 100% FREE.</strong> Buy this course one time and you own it for life. Not only that, but you will also gain lifetime access to me as your personal instructor. Have a question about building a PC? Just ask! You, as my student, are my #1 priority.</p><p>Wait, are you still reading this?! The course comes with a genuine 30 day, no hassles, money-back guarantee. So, there is absolutely nothing to risk here. <strong class=\"redactor-inline-converted\">Enroll today!</strong><br></p>", 
    "end_date": null, 
    "title": "How to Build a Custom Gaming PC", 
    "price": "20.00", 
    "instructors": "Cody Ray Miller", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802604_f3a9.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-gaming-pc/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T05:10:58Z"
}