{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Solderless breadboards, also known as protoboards are used to make a temporary electronic circuit, or a prototype of a proposed circuit. They are also often used for electronics students to set up various circuits that they are taught in electronics engineering college programs.<strong></strong></p><p><strong>Seting Up and Using Protoboards or Solderless Breadboards</strong></p><p>In order to test an electronic circuit design, or to build a prototype of a desired design, protoboards are very useful because they allow the user to set up a temporary circuit that does not require any printed circuit boards or soldering of any components. Components can easily be reconfigured or rearranged until the circuit  becomes what is desired.</p><p>These are some of the advantages and benefits of protoboards:</p><ul><li>They require no soldering or permanent connection of any components.</li><li>They can be rearranged or reconfigured quickly and easily.</li><li>They allow easy access to all components in the design, for testing.</li><li>Test equipment (multimeters, oscilloscopes, signal generators) can easily be attached to the circuit for initial testing and verification of circuit characteristics.</li><li>Circuits can be disassembled in a very short time.</li></ul><p>This course covers all of the details necessary for the user to understand the mechanics of protoboards, there use, how to set up power and ground and how start with a schematic and the indicated electronic components (resistors, capacitors, transistors, etc.) and properly recreate that exact circuit on a protoboard.</p><p>The primary teaching tools for this course is an instructor led PowerPoint presentation that uses diagrams, photos and short instructional videos, so that the student can follow along with the instructor to develop the knowledge and skills required to properly and effectively use protoboards in the design and testing of electronic designs and projects.</p>", 
    "end_date": null, 
    "title": "How to Use Solderless Electronic Breadboards (Protoboards)", 
    "price": "20.00", 
    "instructors": "Richard Vannoy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551516_246d_3.jpg", 
    "course_url": "https://www.udemy.com/protoboard/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-11T02:24:25Z"
}