{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>This is an intermediate level course on IoT and Raspberry Pi. This is a follow on course to the #1 Raspberry Pi course on Udemy - \"Introduction to Raspberry Pi\".</strong></p><p><strong>Take your IoT and Raspberry Pi skills to the next level with this course.</strong></p><p><strong>Bonus content added regularly. Latest update on 7-Nov-15. We\nwill keep adding new content, so that our students have something to look\nforward to</strong></p><p><strong>All our students\n(Makerdemy brand) get VIP pricing ($8) for all our new courses. We have 10\ncourses under our brand and will be releasing a new course every 2 months.</strong></p><p>___________________________________________________________________</p><p>After creating a successful beginner course on IoT, We are back with another amazing course that will take your basic coding skills to next level. <strong>Internet of Things </strong><strong>Automation using Raspberry Pi 2 </strong>is ideal for those who are interested in exploring the possibilities of IoT using Raspberry Pi 2. The course assumes basic knowledge of computer hardware and software. However, knowledge of Python programming will help you in getting up to speed.</p><p>You will learn how to connect multiples of <strong>DS18B20 waterproof sensors</strong> to GPIO pins of Raspberry Pi and access the raw temperature via Linux command. You will code the sensors to display the temperature automatically and also get notified via email alert when the temperature crosses a certain limit. Implementation of IoT through Python programming will make the device remotely accessible. If you are a technology enthusiast and want to learn the cutting edge technology then this is the right course for you.</p><p>Finally, you will learn how to connect multiples sensors to an open source cloud and access the updated temperature through a web portal dashboard. </p><p>The course provides the complete source code of the real time project.</p><p>The entire course can be completed over a fortnight, including the hardware assembly and coding in Python programming.</p><p>By the end of this course, you will have a firm foundation on Internet of Things using Raspberry Pi 2. You can build own IoT controlled devices.</p><p><strong>What are you waiting for? Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "Internet of Things (IoT) Automation using Raspberry Pi 2", 
    "price": "20.00", 
    "instructors": "Venkatesh Varadachari, Satyajeet Sah", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/568968_de14.jpg", 
    "course_url": "https://www.udemy.com/internet-of-things-automation-using-raspberry-pi-2/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T07:07:33Z"
}