{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This is a free course which will teach you how to get up and running with field programmable gate arrays (FPGA's). You will learn the basics of programming in HDL on an inexpensive FPGA development board which is a valuable tool for both the hobbyist interested in \"making\" or the full time engineer with an interest in expanding his career options. FPGA's are both fun and challenging and provide many useful applications that can be applied to the real world. Whether you are a student, hobbyist, or engineer it is important to have the skills demanded in the digital age. By having a working knowledge of FPGA's you can differentiate yourself from your competitors in the marketplace and turbo charge your career with an additional, well paid, skill set that is currently needed in the marketplace. With these new digital skills you can help design communication equipment, audio and video, or signal processing and filtering applications; the ability to program and implement FPGA's can help you succeed in whichever engineering career path you choose..</p><p>This courtse will be taught using the Elbert V2 FPGA demonstration board and the Xilinx tool flow with the Xilinx Webpack ISE. I will explain the basics of FPGA development on the Elbert V2 board and end up the introduction to FPGA's with an uploaded programming example to see the HDL code at work on the Elbert development board. This free lecture will be followed by a more extensive lecture series getting into further detail of programming and implementing FPGA's.</p>", 
    "end_date": null, 
    "title": "Introduction to FPGA's and prototyping with the Elbert ", 
    "price": 0, 
    "instructors": "Stephen Borsay", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563070_9b78.jpg", 
    "course_url": "https://www.udemy.com/inexpensive-fpga-development-with-the-elbert-v2/", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T22:06:50Z"
}