{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>#1 IoT using Arduino course on Udemy, in terms of students (over 600)</strong></p><p><strong>#1  IoT using Arduino course\non Udemy, in terms of reviews (8)</strong></p><p><strong>#1  IoT using Arduino course\non udemy, in terms of 5 star reviews (8)</strong></p><p><strong>Bonus content added\nregularly. Latest update on 17-Nov-15. We will keep adding new content, so that\nour students have something to look forward to</strong></p><p><strong>All our students\n(Makerdemy brand) get VIP pricing ($8) for all our new courses. We have 10\ncourses under our brand and will be releasing a new course every 2 months.</strong></p><p>____________________________________________________________________<br></p><p>This is an introductory course on Internet of Things (IoT). <strong>However, this is not an introductory course on Arduino. <strong></strong></strong>Arduino is one of the cost effective boards you can purchase &amp; start programming with to interact with physical elements using logic &amp; create results the way you want it. It can be used in your Engineering projects, Industrial Projects and Home Automation related projects.<br></p><p>This course is ideal for those who are interested in exploring the possibilities of Internet of Things using Arduino. The course lesson will explain <strong>“How to work on IoT using Arduino\"</strong>.</p><p>If you are a technology enthusiast and want to learn the cutting edge technology then this is the right course for you.</p><p>In this course you will learn how to implement the communication between smart phones and home appliances using Arduino to control the home appliances. This project is significant to reduce wastage of electricity, Improve technology used in a home, to provide convenience, security and increased quality of life and help you to use various wireless technologies.</p><p>You will learn how to use Android device to wirelessly control electrical outlets using relay switches in order to prevent wastage of electricity. How to configure your Bluetooth module to operate in the communication speed used in the Arduino.</p><p>Android app to help you control the pins of your Arduino Uno from your Android phone wirelessly.</p><p>App employs a simple Android user interface to </p><p>1) Control Arduino Uno's digital and PWM pins </p><p>2) Send text commands to Arduino </p><p>3) Receive data from Arduino over Bluetooth serial using the ever popular and really cheap HC-06 Bluetooth over serial module.</p><p>This project can be used to control various Home Appliances. And we can control device from a long distance, thus it gives ease of access. Faster operation and efficient. No need to carry separate remote or any other controlling unit.</p><p>In this project, a Relay and Bluetooth module is connected with Home appliances and is powered by Arduino which using Android app we can send commands to the Arduino to control the home appliances.</p><p>I will teach you step by step how to go about building this project. I will also share the code with you so that you can replicate the project yourself.</p><p>At the end of the course, you'll be fully familiarized with Arduino and ready to build your own home appliances. If you're interested in Arduino, or microcontrollers in general, and don't know where to Start - you've found the perfect course. I look forward to you joining this course. It provides the complete source code of the real time project. You will have a firm foundation on Internet of Things using Arduino. You can easily climb the stairs of IoT advance projects.</p><p>What are you waiting for? Enroll now!</p>", 
    "end_date": null, 
    "title": "Introduction to Internet of Things(IoT) using Arduino", 
    "price": "20.00", 
    "instructors": "Venkatesh Varadachari, Kamesh Dkr", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576330_441c_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-internet-of-things-iot-using-arduino/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T07:40:25Z"
}