{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>#1 Raspberry Pi course on Udemy, in terms of students (over 3,000)</strong></p><p> <strong>#1 Raspberry Pi course on Udemy, in terms of reviews (over 80)</strong></p><p><strong>#1 Raspberry Pi course on udemy, in terms of 5 star reviews (over 40)</strong></p><p><strong>Bonus content added regularly. Latest update on 7-Nov-15. We will keep adding new content, so that our students have something to look forward to</strong></p><p><strong>All our students (Makerdemy brand) get VIP pricing ($8) for all our new courses. We have 10 courses under our brand and will be releasing a new course every 2 months.</strong></p><p>___________________________________________________________________</p><p>  \t    This is an introductory course about the credit card sized computer Raspberry Pi. This course is ideal for those who are interested in exploring the possibilities of Raspberry Pi as a computer. The course does not assume any prior knowledge on computers or programming. However, a knowledge of Linux operating system and Python programming language would greatly help you in getting up to speed.  </p>  <p>  \t    If you do not know Linux or Python, no need to worry. The course has sections that cover the basics of Linux and Python to get you started.  </p>  <p>  \t    Small as it is, The Raspberry Pi packs quite a punch. The course will teach you to hook up the Pi with a key board and monitor so that you can use it as a low cost computer. You will also learn how to interact with the hardware of the Pi, something that you normally do not do with your home computer or laptop.  </p>  <p>  \t    You will learn from 2 complete projects. The first one teaches you how to write a software program to make the most of your Raspberry Pi, using the Python language.  </p>  <p>  \t    The second project involves learning how to control the Raspberry Pi hardware using a computer program written in Python. You will hook the Pi up with a Christmas tree light and will use your program to create various lighting patterns. Sounds exciting?  </p>  <p>  \t    Jump in straight ahead!  </p>  <p>  \t    The course provides complete code for both the above mentioned projects.  </p>  <p>  \t    The entire course can be completed over a period of 2 hours, including the hardware assembly for the Christmas tree light project.  </p>  <p>  \t    By the end of this course, you will learn how to boot and wire up a Raspberry Pi. You will also have learnt how to write your own python code to make the Raspberry Pi do some really cool things.  </p>", 
    "end_date": null, 
    "title": "Introduction to Raspberry Pi", 
    "price": "20.00", 
    "instructors": "Venkatesh Varadachari, Satyajeet Sah", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356084_a359_4.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-raspberry-pi/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T12:06:36Z"
}