{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Over 1,000 students &amp; 20+ 5 star reviews.</strong></p><p><strong>This course is a follow on course to our immensely popular #1 Raspberry Pi course on Udemy - \"Introduction to Raspberry Pi\".</strong></p><p><strong><br></strong></p><p><strong>Bonus content added regularly. Latest update on 7-Nov-15. We\nwill keep adding new content, so that our students have something to look\nforward to</strong></p><p><strong>All our students\n(Makerdemy brand) get VIP pricing ($8) for all our new courses. We have 10\ncourses under our brand and will be releasing a new course every 2 months.</strong></p><p><br></p><p>_______________________________________________________________________</p><p>This is an introductory course on IoT.<strong> However, this is not an introductory course on Raspberry Pi. </strong>This course is ideal for those who are interested in exploring the possibilities of Internet of Things using Raspberry Pi. The course assumes basic knowledge of computer hardware and software. However, knowledge of Operating system Installation and networking will help you in getting up to speed.</p><p>The GPIO pins on Raspberry Pi are a great way to interface with physical devices like resistors and sensors. The implementation of IOT within the device will change the operating possibilities. If you are a technology enthusiast and want to learn the cutting edge technology then this is the right course for you. </p><p>You will learn how to access the complete Graphical User Interface of your Raspberry Pi in your Windows computer. You don't need to buy a Monitor, Keyboard or Mouse separately for this mini kit. By which you can possibly save $100 or more by substituting your personal laptop instead of buying separate peripheral devices. The idea is to reduce costs and use existing devices to interact with the mini kit.</p><p>You will also learn how to eliminate the use of flash drive and transfer the files wirelessly between Raspberry Pi and Windows computer and vice-versa.</p><p>Finally, you will learn how to deploy the program remotely and access the GPIO pins. You will execute the program from your Windows computer and the output can be seen afar with peripheral devices connected to Raspberry Pi 2. </p><p>The course provides the complete source code of the real time project.</p><p>The entire course can be completed over a fortnight, including the hardware assembly and coding in Python.</p><p>By the end of this course, you will have a firm foundation on Internet of Things using Raspberry Pi 2. You can easily climb the stairs of IOT advance projects.</p><p>What are you waiting for? Enroll now!</p>", 
    "end_date": null, 
    "title": "Introduction to Internet of Things(IoT) using Raspberry Pi 2", 
    "price": "20.00", 
    "instructors": "Venkatesh Varadachari, Satyajeet Sah", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524836_4173_4.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-iot-using-raspberry-pi-2/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T04:41:51Z"
}