{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">IOT enabled Aeroponics using Raspberry Pi 3</strong> is an <strong class=\"redactor-inline-converted\">intermediate course</strong> on the newly launched Raspberry Pi 3. The course is ideal for those who want to explore the possibilities of Raspberry Pi in the field of agriculture. This course will take your intermediate coding skills to the next level. The course covers two projects. </p>\n\n<p>In the first project, you will learn how to program the flow sensor to measure exactly one or more litres of liquid or gas. This can be implemented in any project where you want to know the consumption day by day.<br> Going forward you will learn how to program the small LCD screen and display the dynamic data. Once you are done with it, we will proceed to our major project Aeroponics system. In this, you will learn how to build the system from the ground up and control it remotely using the Raspberry Pi. <br>You will also learn how to integrate with the IoT platform and control the entire system remotely. You will have a dashboard where you can visualize the data in the form of a graph, table, gauge meter, etc. Apart from that, you can also control the mist machine by turning ON and OFF through a virtual switch on your dashboard. This will be a fun project, and you will learn to program for Internet of Things.</p>\n\n\n\n<p><br><strong>The course provides the complete source code of both the projects.</strong></p>\n\n\n\n\n\n\n\n<p><br>The entire course can be completed over a fortnight, including the hardware assembly and coding in Python programming.</p>\n\n\n\n\n\n\n\n<p><br>By the end of this course, you will have enough knowledge about the Aeroponics system and how to implement in the real time scenario.</p>", 
    "end_date": null, 
    "title": "IoT enabled Aeroponics using Raspberry Pi 3", 
    "price": "30.00", 
    "instructors": "Venkatesh Varadachari, Satyajeet Sah", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854866_d8d4.jpg", 
    "course_url": "https://www.udemy.com/iot-enabled-aeroponics-using-raspberry-pi-3/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T09:48:38Z"
}