{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t                           Learn the basic concepts, tools, installation, operation and configuration of KNX and how you will become a KNX partner. Create building automation with KNX.  </p>  <p>  \t<strong style=\"\">Build a strong foundation in KNX and building automation with this tutorial for beginners.</strong>  </p>  <p>  \t                  Recognize KNX componenets  </p>  <p>  \t                  Install a KNX system  </p>  <p>  \t                  Operate and configurate a KNX system  </p>  <p>  \t                  Learn how to become a KNX partner  </p>  <p>  \t<strong style=\"\">A Powerful Flexible World Standard for Building Automation</strong>  </p>  <p>  \t                  Learning the fundamentals of KNX puts a powerful and very useful, flexible tool at your fingertips. KNX is easy to learn, has excellent documentation from the product manufacturers and is the <span style=\" color:rgb(85, 85, 85);\">the Worldwide STANDARD for Home and Building</span><span style=\" color:rgb(85, 85, 85);\"> Control.</span>  </p>  <p>  \t                  Projects with KNX is like a lego game. KNX give you the ability to extend and to modify any time your installation.  </p>  <p>  \t<strong style=\"\">Content and Overview </strong><br style=\"\">  \t<br style=\"\">  \t                  Through this course of 20 lectures and 120 minutes of content, you&#039;ll learn all of the KNX fundamentals and establish a strong understanding of the building automation with KNX concept. Each chapter sums it up with quizes,<strong style=\"\"> </strong>putting your new learned skills into theoritical use immediately.  </p>  <p>  \t                  We are going to start with a small glimpse of the history of KNX, and then we will go deep into KNX. We will explain what is KNX, KNX components, installation, operation and configuration.  </p>  <p>  \t                  Later on, we will examine KNX application examples, see its benefits and learn how we can save on energy. Finally we will show you how someone who is interested can become a KNX partner.  </p>  <p>  \t                  Completing the course, you&#039;ll be able to understand how a KNX system works and you will decide whether you wish to become a <strong style=\"\">partner of the amazing world of KNX,</strong> taking the exam of KNX certification.  </p>", 
    "end_date": null, 
    "title": "KNX - The Ultimate Beginner's Guide for Building Automation", 
    "price": "50.00", 
    "instructors": "Building Automation e-training Institute", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365706_666e_4.jpg", 
    "course_url": "https://www.udemy.com/knx-the-ultimate-beginners-course-for-building-automation/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T09:52:23Z"
}