{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t    Learn the basic ways to edit your video using a very popular editing program, iMovie.  </p>  <p style=\"\">  \t<strong style=\"\">Master a strong method to editing videos with quick shortcuts taught in a very easy to understand way.</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Enhance Your Videos</li>  \t<li style=\"\">Learn How To Add Transitions</li>  \t<li style=\"\">Decrease Upload Time</li>  </ul>  <p style=\"\">  \t<strong style=\"\">A Life Long Skill at Your Fingertips</strong>  </p>  <p style=\"\">  \t    Learning the fundamentals of iMovie puts a high level skill right on your computer for you to learn. This could be used for many reasons which include a Youtube Channel, a Film Editor, a Promo Editor and many more. Remember every video you see has been edited. Anyone can use iMovie as long as they have installed it and have a mac it is a very simple and easy to use program with many advanced features.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \t    Suitable for anyone this course features 9 lectures and over 30 minutes of content this will certainly teach you the basic knowledge. The first lecture is about importing your footage and creating the movie. You need this step to start the movie. In the second lecture I will teach you how to Add the footage to your timeline this is also fundamental and is extremely easy to do. In lecture 3 I will teach you how to Enhance your video. This is very important as it will improve your videos overall appearance and audio quality. The 4th lecture teaches you all about adding titles. Lecture 5 teaches adding transitions for a smooth or snazzy feel to your video. In lecture 6 I will show you how to add Music &amp; Sound Effects this can give your video a amazing flow. In lecture 7 I will show you how to export your video whether its to Youtube, Facebook or just to your computer. In lecture 8 I will show you all the necessary keyboard shortcuts to make editing speedy and easy to do. In the final lecture I will show you how to Decrease your upload time. this is very important if you need to make videos on a tight schedule.  </p>  <p style=\"\">  \t    If you complete this course you will be able to edit a video that looks semi professional and be able to use a range of keyboard shortcuts for speed. Also you will be able to add Music, Sound Effects, Transition and Title&#039;s. Extremely handy life skills.  </p>", 
    "end_date": null, 
    "title": "Learn iMovie Version 10.0.9", 
    "price": "20.00", 
    "instructors": "Christopher Young", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402882_65c0.jpg", 
    "course_url": "https://www.udemy.com/learn-imovie-version-1006/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T11:18:56Z"
}