{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">This course was designed to equip you with the knowledge and skill that will get you up to speed with <em style=\"\">FPGA</em> Design in<em style=\"\"> VHDL</em>. You will be expected to have some basic knowledge on digital electronics such as the meaning of <em style=\"\">Flip Flops</em>, <em style=\"\">Gates</em> and <em style=\"\">Finite State Machine</em>, and also some basics of programming language would help in the course.</p><p style=\"\">Although the design flow will be dealt with in almost its entirety, the course starts from the basics and take you up to an intermediate level, where you will be able to take a design from a concept through the different stages of design until seeing the design work on a board.</p><p style=\"\">The course is structured in four parts, starting with a simplistic view at how<em style=\"\"> FPGA&#039;s</em> work and the resources that are available on a typical <em style=\"\">FPGA</em>. The tool <em style=\"\">FPGA Editor</em> will be used. Then an overview of <em style=\"\">ISE Flow</em> will be presented in part 2, along with demos on how  the tool is downloaded, installed and used. The third part of the course will explain and demonstrate how the most useful <em style=\"\">VHDL</em> syntaxes are written, and at each step, the <em style=\"\">Technology Schematic</em> is viewed to understand how <em style=\"\">VHDL</em> codes are synthesized into logic.</p><p style=\"\">The last part is about designing a Home Alarm System from the concept and <em style=\"\">State Diagram</em>. A step-by-step approach is used to show all the stages of the flow, including writing of the codes, <em style=\"\">Synthesize</em>, add constraints, run<em style=\"\"> Implementation</em>, Timing Analysis, <em style=\"\">Behavioural Simulation</em> and <em style=\"\">Post implementation Simulation</em> and <em style=\"\">Configuration </em>of the<em style=\"\"> FPGA</em> and<em style=\"\"> PROM</em> on a<em style=\"\"> Basys 2 board</em>.  </p><p style=\"\">The course consists of 6 hours of videos, spread over 50 lectures, and provide demos to show how the tool is used effectively. </p>", 
    "end_date": null, 
    "title": "Learn VHDL, ISE and FPGA by Designing a basic Home Alarm", 
    "price": "20.00", 
    "instructors": "M Ajmir GOOLAM HOSSEN", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/454160_7299_5.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-fpga-ise-and-vhdl/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-22T21:23:47Z"
}