{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \tTeach yourself the analysis and synthesis of digital systems using VHDL to design and simulate FPGA and ASIC digital systems. Participants learn the fundamental concepts of VHDL and practical design techniques using a Xilinx FPGA Development Board and ModelSim simulation software for hands-on experience. The VHDL methodology and design flow for logic synthesis addresses design issues related to component modeling, data flow description in VHDL and behavioral description of hardware. An emphasis is placed on understanding the hardware description language, VHDL design techniques for logic synthesis, design criteria, and VHDL applications.  </p>  <p>  \tAt the end of this course, participants will be able to accomplish the following:  </p>  <ul style=\"\">  \t<li>Describe and explain VHDL syntax and semantics</li>  \t<li>Create synthesizable designs using VHDL</li>  \t<li>Use Xilinx FPGA development board for hand-on experience</li>  \t<li>Use the Xilinx ISE toolset</li>  \t<li>Use ModelSim simulation software</li>  \t<li>Design simple and practical test-benches in VHDL</li>  \t<li>Design and develop VHDL models</li>  </ul>  <p>  \tPrerequisites:  </p>  <ul style=\"\">  \t<li>Familiarity with digital logic design, electrical engineering, or equivalent experience.</li>  </ul>  <p>  \tEven if you&#039;re now already familiar with VHDL but you&#039;ve:  </p>  <ul style=\"\">  \t<li>Never used an attribute other than ‘event?</li>  \t<li>Never used variables?</li>  \t<li>Always used a process where a single concurrent statement would have sufficed?</li>  \t<li>Never used assert or report statements except (maybe) in a test-bench?</li>  \t<li>Never used an unconstrained vector or array?</li>  \t<li>Never used a passive process inside of an entity?</li>  \t<li>Never used a real or the math_real library package in synthesizable code?</li>  \t<li>Always used a single process per signal assignment?</li>  </ul>  <p>  \tthen this course will definitely have something for you as well.  You will learn finite state machine design, the two-process design methodology, test-bench design, combinatorial and sequential logic, and extensible synthesizable designs that are reusable.  </p>", 
    "end_date": null, 
    "title": "Learn VHDL Design for use in FPGA and ASIC Digital Systems", 
    "price": "45.00", 
    "instructors": "Clyde R. Visser, P.E.", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/30487_3433_8.jpg", 
    "course_url": "https://www.udemy.com/vhdl-design-and-modeling-of-digital-systems/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-24T23:57:39Z"
}