{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>#1 Scratch for Arduino course on Udemy, in terms of students (close to 1,000)</strong></p><p><strong>#1 Scratch for Arduino course\non Udemy, in terms of reviews (over 50)</strong></p><p><strong>#1 Scratch for Arduino course\non udemy, in terms of 5 star reviews (over 30)</strong></p><p><strong>Bonus content added\nregularly. Latest update on 17-Nov-15. We will keep adding new content, so that\nour students have something to look forward to</strong></p><p><strong>All our students\n(Makerdemy brand) get VIP pricing ($8) for all our new courses. We have 10\ncourses under our brand and will be releasing a new course every 2 months.</strong></p><p><br></p><p>____________________________________________________________________</p><p>Scratch for Arduino (S4A) is a modified version of Scratch and it has been used by many people in a lot of different projects around the world. Projects are designed to interact with the real world using Scratch which helps one easily receive inputs from many sensors. This course is primarily targeted at learners who wish to explore Arduino and learn about microcontrollers. This course requires one to have basic knowledge in electronics of concepts like voltage, current and resistance.</p><p><span></span>The course taker also needs to download and install the software on their computer and they are good to go. No prior knowledge of programming or coding is required however basic knowledge about the same is a bonus! </p><p>The course is structured as a series of interesting real time projects, through which you can learn how to use the software interface to make Projects of your own. Arduino can be used to change surroundings by controlling lights, motors, and a number of other accessories. It's intended for anyone looking to make interactive hardware projects.</p>", 
    "end_date": null, 
    "title": "Master Arduino without coding", 
    "price": "20.00", 
    "instructors": "Venkatesh Varadachari, Kamesh Dkr", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455496_b723.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-scratch4arduino/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T06:04:13Z"
}