{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course is designed to teach students how to design a digital logic circuit to perform a specific desired function. Taking this course will give students a much better understanding of how the internals of a computer work. This course has detailed lectures that talk about all the different logic gates used when designing digital logic circuits. In this course students will use MultiSIM BLUE which is a branch of National Instruments MultiSIM, collaborated with Mouser Electronics. MultiSIM BLUE is used to simulate the digital circuits students will design. This course covers how numbers are stored and represented in digital circuits. Students will learn how to work with negative numbers as well as the arithmetic skills to manipulate numbers in binary and hexadecimal form. This course covers the properties and rules regarding Boolean algebra and how these skills can be used to design a digital circuit. This course covers how digital circuits are designed and optimized so that they maintain functionality while reducing cost. This course covers several different optimization methods including Karnaugh maps, product of sums, sum of products, and the Quine-McCluskey method. There is a project included in this course that utilizes the concepts taught in this course to show students how these skills can be used in real world applications.<br></p>  <p>Course Structure:</p>  <p>This course is structured in such a way that each section is dedicated to a specific topic in regards to digital electronics. The lectures contained in each section describe in detail the different tools and techniques used to design digital logic circuits.</p>  <p>There are assignments throughout this course that students can use to put the theory taught to practical use. There are also solution videos that show the student just how to approach and solve the assignment if they are having difficulty.</p>  <p>This course contains quizzes that are used to determine whether or not the students fully understand the material. Successfully answering all the questions in the quizzes is a good way indicator letting students know that they understand that section well.</p>  <p>There is a project in this course that is used to help students understand the entire design process for a digital circuit.</p>", 
    "end_date": null, 
    "title": "Master the Concepts of Digital Circuit Design", 
    "price": "20.00", 
    "instructors": "Jordan Christman", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642400_8abb_3.jpg", 
    "course_url": "https://www.udemy.com/master-the-concepts-of-digital-circuit-design/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T13:22:25Z"
}