{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\"> <u style=\"\"><strong style=\"\">The course is laboratory based</strong></u>. Almost every lecture and section of the course leads directly to a hands-on laboratory assignment. The more practice you get using the “real world&quot; Texas Instruments hardware and software the more proficient you will be.</p><p style=\"\"> <u style=\"\"><strong style=\"\">The course does not waste your time</strong></u>. From the very beginning, we jump right in to your first laboratory assignment – Let&#039;s Get Started.</p><p style=\"\"> <u style=\"\"><strong style=\"\">The course is modular in nature</strong></u>. Are you new to the world of microcontrollers? Great! Start at the beginning, and we&#039;ll teach you everything you need to know. Do you have some background in microcontrollers but want to learn more? Fantastic! You can pick and choose the modules that you need.</p><p style=\"\"> <u style=\"\"><strong style=\"\">The course is packed with information</strong></u>. From the beginnings of the C programming language to advanced microcontroller peripherals, the course teaches you all of the building blocks you would need to build your own electronic systems.</p><p style=\"\"> <u style=\"\"><strong style=\"\">We use lots and lots of examples</strong></u>. We take you step-by-step through the lessons – each time providing sample code and documentation to make sure you are supported through the course.</p><p style=\"\"> <u style=\"\"><strong style=\"\">We are here to help</strong></u>. We are educators with a singular focus of providing a meaningful experience for our students. And, while we cannot do the work for you, we are willing to work WITH you help you succeed.</p>", 
    "end_date": null, 
    "title": "Microcontrollers and the C Programming Language", 
    "price": "20.00", 
    "instructors": "Mark M. Budnik", 
    "commitment": "32 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503306_adab_2.jpg", 
    "course_url": "https://www.udemy.com/mcu_msp430/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T20:28:21Z"
}