{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \tDemonstrating competency and a mastery of skills is more important than ever in today’s rapidly changing workplace. It often requires worker certification and legal compliance with training mandates. You can provide online training in a flexible way by taking advantage of Moodle&#039;s powerful capabilities.<br style=\"\">  \tMoodle for Training and Professional Development walks you through all the areas that you need to know in order to build your own courses, develop registration databases, create assessments, and administer interactive training for synchronous and asynchronous delivery. <br style=\"\">  \tWith Moodle for Training and Professional Development, you&#039;ll learn how to design, build, administer, and archive results with effective online training using the popular open source Learning Management System(LMS).<br style=\"\">  \tThis video guide shows you how to create courses, incorporate highly effective multimedia instructional materials, create interactive lessons and training sessions, build interactive assessment, streamline course administration, and manage certification. <br style=\"\">  \tLearn how to use the powerful, popular Learning Management System(LMS), Moodle, to build courses that meet the needs of your learners to receive training and certification in solid, content-rich courses, with reliable, and effective assessment. <br style=\"\">  \tMoodle for Training and Professional Development covers everything you need to design the course, build content, create discussion forums, workshops, incorporate outside multimedia materials, including text, graphics, audio, video, web conferencing, presentations, develop collaborative and individual portfolios, and more. With the capability of incorporating both synchronous (chat, web conferencing, live streaming media), and asynchronous content (archived and streaming), it’s possible to deliver content and testing how and where you want it. <br style=\"\">  \tThis video guide breaks the process into functional units and allows you to quickly build the kind of training and assessment you need to deliver high-quality certification courses and professional development in an online format.  </p>", 
    "end_date": null, 
    "title": "Moodle for Training and Professional Development", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399986_ed10_2.jpg", 
    "course_url": "https://www.udemy.com/moodle-for-training-and-professional-development/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T10:40:35Z"
}