{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\"><strong>There is many reasons Why You should Take this course</strong><strong>:</strong><br></p><p style=\"\"> ■Commercial Training Kits have many functions that you might never use and add an additional cost which make the overall cost of a kit very high.  </p><div>■There is no chance that you will find a kit that match your exact needs.  <div>■Making things with your own hands will give you a very good understanding of how electronic boards are made and will help you be a professional in making permeant Printed circuit boards.  <div>■You can easily adjust the items of the kit and make many copies at your home at a very low price.  <p>■You will get to practice playing with electronics.<strong></strong></p><p><strong>So This course will offer you:</strong><br></p></div></div></div><ul><li>A-Z Guide to designing,\n drawing and testing different training kit circuit that comes in hand, using \none of the most popular software in the electronics industry, after this\n course you will be a master at making your own trainning kit instead of buying it.</li><li>You\n will become professional in making your own circuits, you \nwill even be able to master mass producing any electronic module for Microcontroller that \nyou find useful.</li><li>Video and Text lectures are included along with the software package that will be used in this course.</li><li>All what you need for this course is your laptop and headphones.</li><li>This course is open for comments and suggestions.</li><li>Another reason Why\n you should take this course, well, because you will learn by doing not \nby listening and you will become an expert in making your own circuits.</li></ul>", 
    "end_date": null, 
    "title": "PIC Microcontrollers: Design & Manufacture Your Training Kit", 
    "price": "20.00", 
    "instructors": "Ashraf Al-Madhoun", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/779814_432c.jpg", 
    "course_url": "https://www.udemy.com/pic-microcontrollers-design-manufacture-your-training-kit/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T08:20:57Z"
}