{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t  Der Raspberry Pi hat viele Möglichkeiten. Eine davon ist, den RPi in ein Internet-Radio und MP3-Player zu verwandeln. So kann er Ihre vollständige MP3-Sammlung verwalten und abspielen.  </p>  <p style=\"\">  \t  Im Grunde ist es ganz einfach. Unser Raspberry Pi ist im Grunde ein Linux-Computer und deswegen bringt er auch die Möglichkeit mit Audio-Signale auszugeben. Der Raspberry Pi bringt sogar mehrere Möglichkeiten mit. Der Ton kann analog und digital ausgegeben werden, ganz wie Sie es wünschen.  </p>  <p style=\"\">  \t  Damit bestimmen Sie auch die Tonqualität. Schließen Sie entsprechende Lautsprecher z.B. über HDMI an und sie haben eine Hi-End Stereoanlage. Oder, wenn es günstiger sein soll, normaler Lautsprecher einfach über ein 3,5 mm Klinkenkabel verbinden. Besseren Ton als den Ton über den analogen Ausgang bekommen wir, wenn wir eine USB-Soundkarte an dem USB-Port einstecken.  </p>  <p style=\"\">  \t  Auch die Zeitsteuerung ist kein Problem für unseren Raspberry Pi. Schalten Sie Ihren Raspberry Pi MP3-Player zeitgesteuert ein, damit Sie mit Ihrem Lieblingssong geweckt werden. Oder damit das Radio schon die Nachrichten abspielt, wenn Sie morgens Ihren Kaffee trinken.  </p>  <p style=\"\">  \t  Doch das ist noch nicht alles. Auch die Lautstärke können wir über Scripte steuern. Damit ist er die optimale Einbuchsschutz. Laut Auskunft der Polizei ist der beste Einbruchsschutz der, wenn der Einbrecher glaubt, dass jemand in der Wohnung ist. Mit dem Raspberry Pi können Sie Ihr Radio scriptgesteuert einschalten, umschalten und auch die Lautstärke automatisch ändern. So entsteht der Eindruck, dass Sie tatsächlich Zuhause sind.  </p>  <p style=\"\">  \t  Das Beste am Raspberry Pi ist dabei seine Modularität. Sie können ganz klein anfangen und ihn dann später beliebig zu vergrößern.  </p>  <p style=\"\">  \t  Die Steuerung Ihres MP3-Players / Web-Radios ist dabei nicht auf den Raspberry Pi beschränkt. Selbstverständlich können Sie den RPi auch über einen Windows-PC steuern. Linux nutzer können den RPi selbstverständlich über Linux steuern. Auch die Steuerung vom Mobiltelefon ist problemlos möglich.  </p>  <p style=\"\">  \t  Sie sehen, es gibt keine Grenzen.  </p>  <p style=\"\">  \tDieser Kurs hat eine Erfolgsgarantie. Ein funktionierendes Image des Raspberry Pi stellen wir Ihnen am Ende des Kurses zur Verfügung.  </p>", 
    "end_date": null, 
    "title": "Raspberry Pi: MP3-Player und Webradio", 
    "price": "35.00", 
    "instructors": "Andreas Sprecher", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332740_efcb_4.jpg", 
    "course_url": "https://www.udemy.com/raspberry-pi-mp3-player-und-webradio/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T16:20:59Z"
}