{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>The goal of this course is to guide the student through a 1-day process of configuring their Raspberry Pi to work as a robust and powerful emulation machine. RetroPie, which is a free operating system for the Raspberry Pi, allows us to play games from dozens of systems using any USB-compatible controller. The course is aimed at beginners who may have just picked up a Raspberry Pi or are thinking about doing so. </p>\n\n<p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Things you'll need:</strong></p>\n\n<p>Raspberry Pi 2 or 3 (I'll be using the Raspberry Pi 3 Model B)<br>Micro SD Card - At least 4GB<br>Micro SD Card Reader<br>USB Flash Drive <br>USB Wall Socket Power Adapter (you can resuse an old phone adapter)<br>Micro USB -&gt; USB Cable<br>USB Gamepad (I use the PS4's DualShock 4 controller)<br>USB Keyboard for configuring your Raspberry Pi<br>Windows Desktop or Laptop<br></p>\n\n<p><br></p>\n\n<p>This is the first course in a series of upcoming courses aimed at those that have a Raspberry Pi and are eager to learn about technology! This <strong>\"Day Project\"</strong> will show students step-by-step how to set up their retro gaming machine. By following along with the instructor, students will be able to quickly configure their system while getting an introduction to the electronics behind the project. </p>", 
    "end_date": null, 
    "title": "Raspberry Pi 3 Day Project: Retro Gaming Suite", 
    "price": 0, 
    "instructors": "Nick Thomas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/811906_8e54_2.jpg", 
    "course_url": "https://www.udemy.com/raspberry-pi-3-day-project-retro-gaming-suite/", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-04T01:16:28Z"
}