{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t        In diesem Kurs werden die Grundlagen des Rasbperry Pi angesprochen.  </p>  <p style=\"\">  \t        Der Raspberry Pi ist ein kreditkartengroßer Einplatinencomputer , der sich seit seiner Einführung im Jahre 2012 immer größerer Beliebtheit erfreut. Großen Anteil am Erfolg hat der günstige Preis von ca. 30,- EUR. Trotz dieses Preises bietet der Raspberry Pi alles, was auch ein großer Computer bietet. Vom USB-Anschluss über Netzwerkanschluss, von HDMI zu analogem Audio-Ausgang ist alles dabei. Der Anschluss einer Kamera rundet das Bild ab. Verbreitet ist z.B. die Anwendung als Mediacenter, da der Raspberry Pi Videodaten mit voller HD-Auflösung (1080p) dekodieren und über die HDMI-Schnittstelle ausgeben kann. Inzwischen wurden fast 4 Millionen Geräte verkauft.  </p>  <p style=\"\">  \t        Als Betriebssystem steht ihm mit Rasbian, einer Variation des Linux Betriebssystems Debian die ganze Linuxwelt zur Verfügung.  </p>  <p style=\"\">  \t        Aus diesem Mix lassen sich hunderte Produkte einfach, schnell und günstig umsetzen. Viele Beispiele stellen wir im Intro-Video dieses Kurses dar, welches Sie sich kostenlos anschauen können. Doch es kommt noch besser. Damit Sie optimal feststellen können, ob der Raspberry Pi auch bei Ihnen sinnvoll zu Einsatz kommen kann, ist der ganze Grundkurs kostenlos.  </p>  <p style=\"\">  \t        In weiteren Kursen folgen dann u.a. die Umsetzung eines eigenen Web-Radios, einer Alarmanlage, einer Spy-Cam sowie die Möglichkeiten zur Relais-Steuerung (z.B. um einen Rollladenmotor anzusteuern. Setzen Sie Ihre eigene Heimautomation um.  </p>  <p style=\"\">  \t        Zielgruppe ist jeder Teilnehmer, der Grundkenntnisse im Umgang mit einem Computer und Windows oder Linux hat. Der Grundkurs ist dual aufgebaut, so dass wichtige Teile des Kurses jeweils für Linux-Nutzer und Windows-Nutzer gezeigt werden. Auch wenn Sie als Windows-Nutzer vielleicht noch nie mit Linux gearbeitet haben, sollten Sie nicht vor diesem Kurs zurück schrecken. Die Vorteile sind fast unbegrenzt und werden Ihnen bei Ihrem Verständnis von Computern, Linux und dem Internet weiter helfen.  </p>  <p style=\"\">  \t        Werden auch Sie Teil dieser großen Gemeinschaft lernen Sie eine neue Welt kennen. Machen Sie jetzt den ersten Schritt mit dem kostenlosen Grundkurs des Raspberry Pi.  </p>", 
    "end_date": null, 
    "title": "Raspberry Pi: Der Grundlagen-Kurs", 
    "price": "20.00", 
    "instructors": "Andreas Sprecher", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314398_94b7_6.jpg", 
    "course_url": "https://www.udemy.com/raspberry-pi-grundlagen-kurs/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-06T16:24:30Z"
}