{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>After creating a successful intermediate course on IoT, We are back with another stunning course that will take your intermediate coding skills to the advance level. <strong>Raspberry Pi Robotics</strong><strong> </strong>is ideal for those who are inquisitive in exploring the possibilities of IoT using Raspberry Pi 2. The course assumes basic knowledge of computer hardware and software. However, knowledge of Python programming will help you in getting up to speed.</p>  <p>You will learn how to connect <strong>L239D Integrated circuit</strong> to the GPIO pins of Raspberry Pi and control the DC bo motor. You will code the integrated circuit to rotate the motor in different directions and accept the user keyboard input to run the robot in user defined space. Implementation of IoT through Python programming will make the device remotely accessible. If you are a technology enthusiast and want to learn the cutting edge technology then this is the right course for you.</p>  <p>The course provides the complete source code of the real time project.</p>  <p>The entire course can be completed over a fortnight, including the hardware assembly and coding in Python programming.</p>  <p>By the end of this course, you will have fundamental knowledge about building a basic robot using Raspberry Pi 2 and control it remotely.</p>  <p><strong>What are you waiting for? Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "Raspberry Pi Robotics", 
    "price": "20.00", 
    "instructors": "Venkatesh Varadachari, Satyajeet Sah", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639096_c1fd.jpg", 
    "course_url": "https://www.udemy.com/raspberry-pi-robotics/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T10:31:32Z"
}