{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Electricity </strong>is all around us, it is some hidden energy force driving many applications we all use in our daily life. The theory behind electricity is based on some amazing phenomenon in nature and some several materials properties that were discovered by a great scientists. <strong class=\"redactor-inline-converted\">Electronics</strong> is a theory developed around the useful applications of electricity.  So first thing that we can say about electricity is that it is <strong class=\"redactor-inline-converted\">really interesting subject!</strong></p>\n\n<p>Today, electronics is becoming much<strong class=\"redactor-inline-converted\"> </strong>more<strong class=\"redactor-inline-converted\"> friendly hobby</strong> for many people worldwide that would like to easily combine hardware and software and do things by themselves, the price of electric components is keep dropping, easy to use development platforms have been created (e.g. Arduino) and it is easy more than ever to collaborate and learn the subject in a few mouse clicks. </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Internet of Things</strong> is also emerging driving force for innovators looking to build things<strong class=\"redactor-inline-converted\"> </strong>using electronics and harness the power horse of the web technologies to create new products, services or just cool projects! </p>\n\n\n\n\n\n\n\n<p>This course is a <strong class=\"redactor-inline-converted\">starting point</strong>, to learn the basic building blocks of electronics with step by step education program, easy to follow chapters, simple circuits’ demonstrations, quizzes to evaluate your understanding and review the key things to remember using mind mapping templates. </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Join me with one of the biggest Makers Movement!</strong><br></p>", 
    "end_date": null, 
    "title": "The Theory Behind Electronics  - A Beginners Guide", 
    "price": "25.00", 
    "instructors": "Idan Gabrieli", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/53911_4529_2.jpg", 
    "course_url": "https://www.udemy.com/the-theory-behind-electronics-a-beginners-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-14T07:44:28Z"
}