{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>TVs, Home Cinema and Digital Displays are getting more and more advanced every year and new technologies constantly appear like <strong>Plasma</strong>, <strong>OLED</strong>, <strong>4K</strong>, <strong>3D</strong> and <strong>Virtual Reality</strong>. Choosing the best TV for yourself could be a difficult task as it's easy to spend money on features you don't really need.</p><p><strong>TV manufacturers want you to buy the largest and most expensive TV so understanding what you are paying for can save you a lot of money. Make sure you only buy that 4K TV if you really need it!</strong><br></p><p>This course will teach you all about these technologies from the basics to help you understand the benefits of every single feature. Next time you visit your electronic store you will be able to make a choice that best suite your requirements and living room.</p><p>In this course you will:</p><ul><li>Understand what the <strong>ultimate visual experience</strong> is</li><li>Look at the <strong>history of TVs</strong>, monitors and mobile phone displays</li><li>Learn about <strong>pixels</strong>, pixel arrays and<strong> LCD</strong>, <strong>Plasma</strong> and <strong>OLED</strong> panel types</li><li>Learn about <strong>IPS</strong> and <strong>TN</strong> panels, <strong>LED</strong> backlighting and black levels</li><li>Understand the difference between <strong>720p</strong>, <strong>1080p</strong>, <strong>Full HD</strong>, <strong>4K</strong>, <strong>8K</strong></li><li>Look at the different <strong>TV sizes</strong> and how it affects your field of view</li><li>Understand what <strong>HFR video</strong> is and wether you should buy <strong>Active</strong> or <strong>Passive 3D</strong></li><li>Learn about <strong>Virtual Reality</strong></li><li>Be able to calculate the<strong> perfect TV size, resolution and viewing distance combination</strong> for your own living room</li></ul>", 
    "end_date": null, 
    "title": "Ultimate TV and Home Cinema Display Guide", 
    "price": 0, 
    "instructors": "Mate Marschalko", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679210_576a.jpg", 
    "course_url": "https://www.udemy.com/ultimate-tv-and-home-cinema-display-guide/", 
    "subject_name": [
        "Hardware"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T09:14:55Z"
}