{
    "selfpaced": false, 
    "topic_name": [
        "Industry Specific"
    ], 
    "description": "\n\n                    \n                    \n                    Applied Real Estate: What you need to know about buying and selling residential real estate. The purpose of this course is to provide consumers of real estate and real estate services the necessary information in order to facilitate their real estate decision making. This course is meant to help create an aware and thinking real estate marketplace. Topics covered in this course include (but are not limited to): property pricing, seller’s net from closing, purchaser’s total investment, negotiating strategies, buy vs. rent, loan refinancing, and healthy real estate markets. After this course is completed, students should be capable of being proactive participants in today’s real estate marketplace, as opposed to passive bystanders taking the deal structure as a given. There is no perfect information source that guarantees optimal results in all real estate transactions, and this course DOES NOT make any such claim. Thus, viewers of this course and its materials use this information at their own risk and agree to hold Ken H. Johnson, FIU, and FIU Online harmless from any actions taken on the viewer’s part or non-actions on the viewer’s part stemming from their understanding of the material herein.\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Applied Real Estate", 
    "price": 0, 
    "instructors": "Ken H. Johnson", 
    "institution_name": [
        "Florida International University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursesites.com/webapps/Bb-sites-course-creation-BBLEARN/courseHomepage.htmlx?course_id=_241368_1", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open Education by Blackboard"
    ], 
    "start_date": "2013-02-26T00:00:00Z"
}