{
    "selfpaced": false, 
    "topic_name": [
        "Industry Specific"
    ], 
    "description": "\n\n                    \n                    \n                    Managing a company in the food and beverage industry is a fascinating task.\n\nFood and beverage products are so deeply rooted in the culture of most countries that making and selling them is not only a matter of making and selling good and tasty products, but products that nurture people's body, soul, and heart. Given this, it's not difficult to see that the task quickly becomes complex.\n\nThe objective of this course is twofold: first, we will focus on contemporary challenges that managers and entrepreneurs in food and beverage businesses should be able to face; and second, we will provide models and tools to design and implement appropriate courses of action to satisfy customers and build an advantage over the competition.\n\nThis course is made up of four modules and an introduction, each exploring one dilemma that food and beverage companies face. You will be presented with a set of video lectures and guest speakers. These lectures combine an accessible introduction to specific topics integrated with interviews of managers and experts that will give precious insights and examples to the participants.\n\nTo enhance your learning experience with us, we will make a Documentary on the Excellences of the Modena District available for you, which is in a format that we have developed specifically for this course in order to give you the chance to experience first-hand the territory as our on-campus students usually do.\n\nEach module is paired with an evaluated quiz and weekly discussion forums to reflect on the variety of the F&amp;B world, its complexity, and the power of the network that we will build together during the course.\n\nSuccessful completion of the quizzes is required for a course certificate as explained in the Grading Policy.\n\nBelow the guest speakers of the course:\n\nMasterchef Italia Sky – Nils Hartmann, Head of Movie Channels at Sky Italia – www.masterchef.sky.it\nEataly - Paolo Bongiovanni, Marketing Director Italy – www.eataly.net\nBerlucchi – Paolo Ziliani, Owner – www.berlucchi.it\nJoia Restaurant – Alta Cucina Naturale – Pietro Leemann, Owner and Chef – www.joia.it\nBranca – Nicolò Branca, Owner – www.branca.it\nBarilla – Giuseppe Morici, President Region Europe – www.barilla.com\nProyecto Expo 2015 Chile – Guillermo Ariztia, Chile Pavillon Director – www.expomilan.cl\nWinery Il Cavallante, Milano – Sergio Morpurgo, Owner\nHeineken – Floris Cobelens, Marketing Director – www.heineken.com\nTRDN – Martin Oetting, Managing Director – www.trnd.com\nGROM – Federico Grom, Owner and Founder – www.grom.it/en\nTetra Pak – Matthew Hatton, Director Competitor Intelligence – www.tetrapak.com\nBioHombre – Matteo Panini, CEO – www.hombre.it\nAcetaia Maletti – Carmen &amp; Claudio Maletti\nCantine Riunite &amp; CIV – Vanni Lusetti, CEO; Francesca Benini, Sales &amp; Marketing Manager; Elena Lottici, Export Manager; Mario Vandi, Brand Manager – www.riunite.it\nGlemGas – Marco Guerzoni, Program Product Manager – www.glemgas.com\nBibendum Catering – LaFranceschetta58 – Sabrina Lazzereschi &amp; Marta Pulini, Owners and Founders – www.bibendumcatering.it , www.franceschetta58.it\n\nDISCLAIMER - Since most of the videos are conducted with those whose native language is not English, we have decided to sometimes preserve their more emphatic speech to keep a tighter match between the audio and the subtitles.\n\n                                            Syllabus\n                        Information about the Course and RulesLearn about the complexities of food and beverage companies, and acquire the competences needed to work in the industry.Products vs. MarketsHow products generate value for the customer and how customers value products and their quality.Tradition vs. InnovationThe role of tradition and innovation along the customer experience in the food and beverage industry. The value of brands in the tradition and innovation dilemma.Local vs. GlobalThere is value in being local in a global market and there is value in being global in a local market. The role of distribution networks in international food and beverage markets.Small vs. BigLeveraging on size to build a competitive advantage in food and beverage markets. The design of growth strategies in different markets.Great Insights from the FieldHere you can find some additional material to let you discover some practical insights of the food and beverage world.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Food & Beverage Management", 
    "price": 0, 
    "instructors": "Gabriele Troilo", 
    "institution_name": [
        "Università Bocconi"
    ], 
    "commitment": "3-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/food-beverage-management", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}