{
    "selfpaced": false, 
    "topic_name": [
        "Industry Specific"
    ], 
    "description": "\n\n                    \n                    \n                    The food industry is one of the most important commercial sectors in the world. Everyone uses it, but how many people abuse it? As we witness the increasing globalisation of the supply chain, a growing challenge is verifying the questionable identity of raw materials in the food we eat.\n\nIn this course we will look at topical issues concerning ‘food fraud’ and explore ways in which analytical chemistry can help in its identification and prevention. We’ll share fascinating examples, such as the history of white bread and a surprising ingredient once found in bitter beer.\n\nThe University of East Anglia has joined forces with the world-renowned Institute of Food Research (IFR) to bring you this unique course. You’ll be led by Kate Kemsley, a specialist in the use of advanced instrumentation for measuring the chemical composition of food materials. Course content is linked with UEA’s MChem postgraduate programme, which supports final-year students’ practical research projects in this area of science.\n\nWhere could this course take me?\nIf you are planning to study Chemistry at college or university - this course will give you an essential overview of some instrumental techniques that you are likely to encounter. This includes exploration of infrared technology, NMR and mass spectrometry; important areas of Chemistry for A-Level students to grasp.\n\nThis course is also designed to support the professional development of those currently working in the food industry, who want to delve deeper into the methods analytical chemists take in the measurements of food materials and ingredients. It will act as the perfect refresher for your current knowledge base, as you can interact online with thousands of individuals working in the food sector today.\n\nWhat and how will I learn?\nYou’ll acquire knowledge and understanding of infrared technology, NMR and mass spectrometry with practical examples linked to current standards and issues in the food sector. You will gain a global perspective of the value of chemistry in this area and learn from analytical chemists in action.\n\nBy enjoying a balance of theory and practical applications, students learn directly from academics at the University of East Anglia and scientists from the Institute of Food Research, with a brilliant chance to network throughout the duration of the course.\n\n\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "Identifying Food Fraud", 
    "price": 0, 
    "instructors": "Kate Kemsley", 
    "institution_name": [
        "University of East Anglia"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://www.futurelearn.com/courses/food-fraud?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-07-11T00:00:00Z"
}