{
    "selfpaced": false, 
    "topic_name": [
        "Industry Specific"
    ], 
    "description": "\n\n                    \n                    \n                    This course will benefit those who are interested in doing midwifery as a career choice. This course will allow you to see the scope of practice of the midwife and understand that the focus of midwifery care is the woman. If you are considering a career in midwifery or a parent–to-be, this course will give you insight into the world of the midwife, pregnancy and childbirth.You will explore the role of the midwife in working with women and their families during pregnancy, labour and birth and the time following birth when the woman is supported in her new role as a mother.\r\nWhat will I learn?\r\n\r\nThe origin and definition of the word ‘midwife’\r\nThe  history of midwifery and how society impacts on contemporary midwifery practice\r\nThe roles and responsibilities of the midwife\r\nHow midwives are educated and practise around the world\r\nHow partnership and woman-centredness are essential to midwifery work\r\nAbout the woman’s right to choose her birth options and be involved in care decisions\r\nHow discourse impacts on midwifery and birthing practices\r\nAbout the concept cultural safety in relation to midwifery care\r\nAbout the link between social disadvantage and poor birth outcome\r\nHow midwives support socially disadvantaged women\r\nThe aims of antenatal and postnatal care\r\nHow midwives support women through labour and birth\r\nThe importance of breastfeeding\r\nHow midwives support women and partners following birth\r\n\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nMidwifery\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: MIDWIFERY\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: WORKING WITH THE WOMAN BEFORE BIRTH\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: WORKING WITH THE WOMAN DURING LABOUR AND BIRTH\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: WORKING WITH THE NEW MOTHER AND FAMILY\r\n\r\n\r\n\r\n\n                                    ", 
    "end_date": "2016-02-08T00:00:00Z", 
    "title": "Midwifery", 
    "price": 0, 
    "instructors": "Dr Lyn Ebert", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.open2study.com//node/1789", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open2Study"
    ], 
    "start_date": "2016-01-11T00:00:00Z"
}