{
    "selfpaced": false, 
    "topic_name": [
        "Industry Specific"
    ], 
    "description": "\n\n                    \n                    \n                    In today’s hotel sector an increasingly complex network of traditional and web based channels have to be managed to insure hotel success. Key questions include: how should you distribute over the web? What should you include on your brand.com website so people book through it?  How can you maximise the potential of online travel agents (OTAs)?  With the distribution environment both highly complex and constantly evolving, this course will give you  comprehensive foundation of current industry practices to help jumpstart your career in this fascinating domain.\n\nAcknowledgements: Claire Bertrand, Vincent Chatain, Jessica Moses, Benjamin Six (ESSEC Business School), Emilie Dupré (Image-In), Gregory Halidy (Triplay)\n\n                                            Syllabus\n                        Setting the sceneThe hotel business has evolved from its early days to today. Through this evolution, it has become increasingly specialized. This module introduces the business models, strategies for growth, levels of competition and biggest changes and challenges hotels have to face today.A deep dive into hotel distributionAfter a rapid introduction of key pieces of terminology and technology, this module will examine in details the components of online distribution today, and focus on how to make the most of an increasingly complex distribution system.Direct distribution: the key to hotel successDistributing directly, thus building an effective and efficient website, is an essential success factor. Through this module, you will have a deep understanding of the web development process but also understand the cost of driving traffic, and the importance of using indirect distribution and online marketing techniques.How to manage your OTAIn this final module you will attack the critical issue of how to work better with Online Travel Agents. Learning best practices from OTA managers themselves, you will make sure that you are exploiting these valuable and fast growing points of sale to their maximum potential. \n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "The fundamentals of hotel distribution", 
    "price": 0, 
    "instructors": "Peter O'Connor and Nicolas Graf", 
    "institution_name": [
        "ESSEC Business School"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/hotel-distribution", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}