{
    "selfpaced": false, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                    \n                    \n                    This course is presented in Mandarin.\n\n《世界文化地理》是介绍世界文化地理的格局、形成、发展过程，培养学 生用地理学的眼光去观察和分析世界上文化现象的发生、发展与空间分布特点。 《世界文化地理》是北京大学最受本科生同学欢迎的通选课之一。课程内容信息量很大，包罗万象，把世界地理同世界历史、文化、艺术等融合在一起。任课教师带 领学生用地理空间的观点、时间变化的角度，去观察和分析世界上的文化现象。课程内容兼具科学性和趣味性，每年吸引了大量学生选课。  《世界文化地理》具体内容包括：世界文化地理的基本研究方法，世界文化区的划分，世界人口分布与人口迁移，农业的起源、传播与区域差异，城市的起源与扩 散，城市形态的区域差异与特点，世界主要语言、宗教、人种的空间分布及其相互关系，地理大发现与世界殖民体系的形成，世界地缘政治与世界地理系统的空间结 构特点，全球经济议题化、城市化现象及其伴随的政治、经济、社会问题，等等。  《世界文化地理》的授课内容兼及自然地理和文化地理两大方面，课程综合吸收国内外相关的最新教材和研究论著的内容，采取地图、照片、图表等表现形式，力图 生动浅显地展示世界文化地理格局的基本空间差异和变化过程，注意专题介绍与综合分析相结合，空间差异分析与世界变化分析相结合，重视培养大学生的两种能 力：运用地理学的、空间的眼光来观察、分析世界上文化现象的能力和从时间的角度来看待世界上文化现象发展变化过程的能力。  课程有期中和期末两次考试，最终有期末成绩。\n\n点击上方绿色按钮报名。\n\nCultural Geography of the World is one of the most popular undergraduate courses at Peking University. It is an inclusive, general introductory course, combining natural and cultural geography with history and art. Through the lens of humanism and independent thinking, learners will be encouraged to observe and analyze cultural phenomena from spatial and time perspectives. This course has 12 chapters: The basic research method of world cultural geography; The division of world culture areas; The world's population distribution and migration of population; Origin of agriculture; Diffusion and regional differences; The origin and spread of the city; Regional differences and characteristics of urban morphology; The spatial distribution of the major languages, religions, ethnicities in the world and their relationship; The great geographical discovery and the formation of the world colonial system; World geopolitics and the spatial structures of the world geography system; Global economic integration; Urbanization and its political, economic, social impacts. Using relevant domestic and foreign textbooks, publications, maps, photos, and charts to show the difference and the changing progress of spatial patterns of the cultures, learners will be asked to observe and analyze cultural phenomena with geographic and spatial vision and to consider the development and changing process of the cultural phenomena in light of time sequence. The course will include a midterm and final exam.\n\nThe course is one of the PKU-DeTao MOOCs, which is a joint effort by Peking University and DeTao Masters Academy.\n\n该课程是“北大-德稻网络开放课程”中的一门，由北京大学与德稻教育联合提供\n\n \n\nWhat is the length of the course?\n\n\nCultural Geography of the World will have 11 lectures.\n\n本课程面向的对象是怎样的？持续多少周？\n《世界文化地理》是面向大学文、理本科生开设的通选课，全部课程内容分为11讲。\n\nHow will the students be evaluated?\n\nMethods of evaluation will include homework exercises, a mid-term exam and final exam, accounting for 25%, 25% and 50% of the grade, respectively. Students who earn 60 points and above can obtain a certificate for the course.\n\n本课程如何考核？怎样算合格？\n对学生的考核分为课后练习、期中考试和期末考试三个部分，分别占总成绩的权重为25%、25%和50%，总成绩60分（含60）以上者视为通过课程，可以取得证书。\n\nWill this course have subtitles?\n\nAs of now, this course will not have subtitles, though we hope to have some in the near future. We also hope to recruit volunteers who could help us with translation.\n\n课程是否有字幕？\n很抱歉，目前课程还没有字幕。中文字幕将在半年内制作完成。我们非常欢迎有选修该课程的志愿者帮助进行翻译。\n\n \n\n                                    ", 
    "end_date": "2013-12-16T00:00:00Z", 
    "title": "01339180X: Cultural Geography of the World", 
    "price": 0, 
    "instructors": "Deng Hui", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/cultural-geography-world-pekingx-01339180x", 
    "duration": "12 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2013-09-23T00:00:00Z"
}