{
    "selfpaced": false, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Social Sciences\n                                                                                                    &gt; Anthropology\n                                                            \n                            \n                                                \n                    \n                    \n                    As contemporary humans, we are a product of our evolutionary past. That past can be directly observed through the study of the human fossil record, the materials preserved for archaeological study, and the DNA of living and extinct human populations. This course will provide an overview of human evolutionary history from the present--contemporary human variation in a comparative context--through our last common ancestor with the living great apes, some 5-7 million years in the past. Emphasis will be placed on major evolutionary changes in the development of humans and the methodological approaches used by paleoanthropologists and related investigators to develop that knowledge.\n\nThe course will begin by asking basic questions about how evolution operates to shape biological variation and what patterns of variation look like in living humans and apes. We will then look at how the human lineage first began to differentiate from apes, the rise and fall of the Australopithecines, the origin and dispersal of the genus Homo, and eventually the radical evolutionary changes associated with the development of agricultural practices in the past 15,000 years. Throughout the course students will be exposed to the primary data, places and theories that shape our understanding of human evolution.\n\n                                    ", 
    "end_date": "2015-11-26T00:00:00Z", 
    "title": "ANTH207x: Introduction to Human Evolution", 
    "price": 0, 
    "instructors": "Adam Van Arsdale", 
    "institution_name": [
        "Wellesley College"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/introduction-human-evolution-wellesleyx-anth207x-1", 
    "duration": "12 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-03T00:00:00Z"
}