{
    "selfpaced": false, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                    \n                    \n                    ¿Sientes curiosidad por la civilización del antiguo Egipto? ¿Eres un apasionado de su cultura e historia?\n\nEn este curso nos acercaremos a los templos de los antiguos faraones, a sus complejos funerarios, a sus ciudades, a su escritura jeroglífica, a su religión y a muchos otros aspectos de esta gran civilización. Con ello pretendemos ofrecerte una visión general de la historia y cultura de esta fascinante civilización; proporcionarte un planteamiento docente y unos materiales de alto nivel académico que te permitan introducirte en la disciplina egiptológica con una cierta profundidad y sin concesiones a los consabidos tópicos que la rodean, para, después, si lo deseas, seguir profundizando por tu cuenta. \n\nDe momento te dejamos con este vídeo: https://youtu.be/FPPhkYxWvfI\n\n¿Querrías acompañarnos en este viaje?\n\nACLARACIONES\n* Puedes realizar el curso de manera gratuita. Con ello puedes acceder a todo los contenidos (vídeos, lecturas, cuestionarios, foros). Sin embargo, no permite la opción de obtener un certificado. \n* Obtener el certificado implica cumplir una serie de requisitos, entre los cuales, abonar el coste asociado.\n\nEtiquetas: egiptología, egyptology\n\n                                            Syllabus\n                        Bienvenida y presentaciónComenzamos este viaje a través de la civilización del Antiguo Egipto.OrígenesEl contenido de este módulo será impartido, en su totalidad, por el instructor Josep Cervelló. Junto al aspecto introductorio de parte del contenido de la lección, lo cual nos será muy útil de cara al resto del temario, ORÍGENES nos sitúa en un espacio cronológico centrado en los inicios del estado egipcio. En relación a ello y a la invención de la escritura estudiaremos también algunos sitios arqueológicos concretos, como las tumbas T23 de Hieracómpolis y la Uj de Abidos.PirámidesEn PIRÁMIDES, que es como hemos titulado el contenido de esta parte del curso, trataremos la época del Reino Antiguo focalizando nuestra atención en la época y el mundo de las pirámides, sin duda una de las imágenes más representativas del Egipto faraónico. Analizaremos su simbolismo, los Textos de las Pirámides, la solarización de la monarquía en ese período, así como la construcción y otros aspectos de la arquitectura de las pirámides.SinuhéEl módulo SINUHÉ nos lleva al Reino Medio egipcio, una época de esplendor en la que destaca la creación de grandes obras literarias que, como la Historia de Sinuhé, se convertirán en auténticos clásicos. Por ello, será momento de explicar la historia de la lengua egipcia en sus diversas fases, sus diferentes escrituras, así como una aproximación a la propia Historia de Sinuhé. Desde el plano histórico, haremos un recorrido por la dinastía XI, desde la gestación de Tebas como poder nacional, hasta el final de la dinastía XIIHyksosEl módulo HYKSOS servirá para introducirnos en una época en el que el contacto entre egipcios y semitas ofrecerá un nuevo panorama en el territorio egipcio. Para ello, hablaremos de la situación en el Sinaí, y de la invención del alfabeto con el protosinaítico. Desde el plano histórico, trataremos las dinastías XIII-XVII, conociendo las fuentes que nos permiten establecer una cronología relativa de este período.AmónEl módulo AMÓN nos introducirá en el mundo de los principales dioses de Menfis y Tebas, los dos grandes centros religiosos y de poder de la época. También hablaremos de los dioses de ultratumba, y de los textos funerarios y literarios del Reino Nuevo. Desde el punto de vista histórico y arqueológico, nos centraremos en el inicio de la dinastía XVIII hasta Amenhetep III, por un lado, y en los templos de Karnak y Luxor así como en las necrópolis y templos funerarios de Tebas oeste, por otro.AmarnaEl módulo AMARNA nos acerca a uno de los períodos más populares de la historia de Egipto. Será momento de explicar el significado, en cuanto a la divinidad, del uno y los múltiples y de conceptos como politeísmo, henoteísmo y monoteísmo. Con ello podremos pasar a analizar con más detalle la religión de Amarna, reflejada en los Himnos a Atón. Dentro del aspecto histórico hablaremos de Akhenaton, Smenkhkara, Neferfefruaton y Tutankhamon y, como no, de la arqueología de Amarna.RamsésEl módulo titulado RAMSÉS será impartido en su totalidad por el instructor José Lull. Nos introduciremos en el inicio de la dinastía XIX para después desarrollar el contenido con la época de Ramsés II. Hablaremos también de los Pueblos del Mar con Ramsés III y de los problemas al final de la dinastía XX. Aprovecharemos para ofrecer unas nociones de economía ramésida. Y como introducción al último milenio de historia de Egipto trataremos su inicio, con la dinastía XXI, y su final, con las últimas dinastías indígenas y segunda ocupación persa.RosettaEl módulo titulado ROSETTA nos lleva al último capítulo de la civilización faraónica. Será momento de hablar de la interpretación que se hizo de los jeroglíficos desde la antigüedad tardía así como de Champollion y los fundamentos de la escritura jeroglífica egipcia. Desde el plano histórico, realizaremos un último recorrido desde la conquista de Alejandro Magno, pasando por el dominio lágida, de Ptolomeo I a Cleopatra VII, y el dominio romano, hasta el cierre del templo de Filae por orden del bizantino Justiniano. Examen finalEn este módulo encontrarás el examen final del curso\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Egiptología (Egyptology)", 
    "price": 0, 
    "instructors": "Josep Cervelló and Jose Lull", 
    "institution_name": [
        "Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/egypt", 
    "duration": "9 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-16T00:00:00Z"
}