{
    "selfpaced": false, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                    \n                    \n                    Nowadays music is all around us: we listen to it while we are on our way to work, when preparing lunch or even while showering. All this music is written down in its own language - the notation system. But did you ever wonder where this came from? Have you ever looked at a medieval music manuscript and wondered how to read it?\n\nIn this free online course, we will answer the key questions, including:\n\n\n  What happens to music when we write it down? How did this evolve through history?\n  Who wrote down music? And why?\n  Which strategies of visualization came into play?\n  Are notes just another scripture?\n  How does it help us play and listen to music today, if we understand how music was written in earlier times?\n\n\nTranscribe early music manuscripts\n\nThis course will enable you to understand the theoretical and practical principles of reading musical notation from the Middle Ages until the Early Modern Period. We will show you how to decode and transcribe early notational systems. And we will discuss the challenges and principles of music notation, referring to semiotic approaches and visual theory.\n\nEnjoy medieval music\n\nAs well as the theoretical and practical parts, this course offers more than 15 recordings of ancient music performances provided by musicians of the Schola Cantorum Basiliensis - the renowned institution for ancient music in Basel. These will give you the opportunity to listen to many of the musical pieces that we will discuss during the seven weeks.\n\n\n                                    ", 
    "end_date": "2015-12-21T00:00:00Z", 
    "title": "From Ink to Sound: Decoding Musical Manuscripts", 
    "price": 0, 
    "instructors": "Angelika Moths and Professor Matteo Nanni", 
    "institution_name": [
        "University of Basel"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/from-ink-to-sound?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-11-02T00:00:00Z"
}