{
    "selfpaced": true, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                    \n                    \n                    As books “go digital,” we can appreciate what is gained in terms of convenience, accessibility and interconnectedness. However, we should also consider what is lost as texts transition to a digital sphere.\n\nThis module of The Book: Histories Across Time and Space seeks to re-introduce learners to the codex – a handwritten and hand-constructed book - as a three-dimensional object whose characteristics produce meaning in the experience of the reader.\n\nThis module is designed to walk you through the process of making a medieval manuscript. Using a wide variety of examples from the collections of Harvard’s Houghton Library, it will familiarize you with basic terms and concepts and give you a “feel” for the shapes, sizes, formats, materials and considerations of craft that went into the making of the book as we know it.\n\nThroughout the Middle Ages there existed an intimate relationship between making and meaning. Codices were tactile as well as visual objects designed to engage multiple senses. In the illuminated manuscript, it is often impossible to distinguish neatly between text and image; rather, letters assume imagistic forms and images take the form of letters.\n\nBookmakers were sensitive to the interplay of materials, from the parchment of the pages to the wooden boards, designed to protect the contents. Each of these elements conditioned a reader’s interaction with the book. Bookmaking required a significant material investment. The production process was laborious and lengthy, involving many separate stages and craftsmen.\n\nBooks participated in a wide range of ritual, liturgical, devotional, educational and practical contexts, each of which in turn conditioned the presentation and reception of both their form and content.\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.\n\n                                    ", 
    "end_date": "2015-11-09T00:00:00Z", 
    "title": "HUM1.1x: The Book: Making and Meaning in the Medieval Manuscript", 
    "price": 0, 
    "instructors": "Jeffrey F. Hamburger", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/book-making-meaning-medieval-manuscript-harvardx-hum1-1x", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-21T00:00:00Z"
}