{
    "selfpaced": true, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                    \n                    \n                    This module of The Book: Histories Across Time and Space focuses on the physical qualities of books, the role of books in 17th and 18th century France, and the emergence of literature as a modern form of culture.\n\nWe will focus on the importance of books as physical objects and the raw material of literature--namely, paper.  By considering the nature of paper and how it was made during the early modern period--from Gutenberg's time to the early nineteenth century--we can begin to understand the character of books and the way they worked.\n\nThis module also examines how books fit into the legal and political system of France under the Old Regime during the seventeenth and eighteenth centuries, when the French set standards imitated throughout Europe.  Before modern copyright, legal books had privileges, granted by the king, which provided a guarantee of quality as well as certification of   orthodoxy.  To qualify for a privilege, books had to be approved by censors.  Uncensored books, including most of the works of the Enlightenment, were usually produced outside France and circulated in the kingdom through a vast underground distribution system. \n\nIn addition, this module addresses the emergence of literature as a modern form of culture, which can be studied best in eighteenth-century England.  The first copyright law (1710), a high rate of literacy, a booming consumer market, a precocious periodical industry, and entrepreneurial publishing concentrated in London led to the development of a new kind of author--the independent writer. Samuel Johnson epitomized this new phenomenon. This module will allow you to get a close look at him and everything he represented by providing access to the Hyde Collection of Johnson's books and papers in Houghton Library at Harvard.\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.\n\n                                    ", 
    "end_date": "2015-09-28T00:00:00Z", 
    "title": "HUM1.4x: The Book: The History of the Book in the 17th and 18th Century Europe", 
    "price": 0, 
    "instructors": "Robert Darnton", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/book-history-book-17th-18th-century-harvardx-hum1-4x", 
    "duration": "1 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-21T00:00:00Z"
}