{
    "selfpaced": true, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                    \n                    \n                    Medieval Europe has preserved enormous quantities of books and documents—many millions of pages, in fact—written in Latin and other languages. However, only a tiny percentage of these texts have been edited and published. To gain access to the rest, you need to learn the art and science of reading medieval handwriting,\n\nThis module of The Book: Histories Across Time and Space introduces students to the world of medieval paleography, the science of reading old handwriting. This particular module focuses on notarial handwriting from the city of Marseille in the 14th and 15th centuries. The module features household inventories, which identify some of the fascinating objects found in people’s houses. Assessments and quizzes will allow you to track your progress as you move from letter-group to letter-group. In addition to learning the handwriting, we will take special care to explore some of the many abbreviations and other elements of the secular registers of the later Middle Ages.\n\nSome knowledge of Latin or another Romance Language will be very helpful for understanding the texts you will read, but students without these language skills will still enjoy this chance to explore medieval handiwork.\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.\n\n                                    ", 
    "end_date": "2015-10-12T00:00:00Z", 
    "title": "HUM1.6x: The Book: Monasteries, Schools, and Notaries, Part 1: Reading the Late Medieval Marseille Archive", 
    "price": 0, 
    "instructors": "Daniel Lord Smail", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/book-monasteries-schools-notaries-part-1-harvardx-hum1-6x", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-21T00:00:00Z"
}