{
    "selfpaced": false, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                    \n                    \n                    In this course we build the distinctive stories of Aboriginal and Torres Strait Islander people in Australia and Māori people in Aotearoa New Zealand over four modules. Our aim is to provide you with an understanding of our past and present realities.\r\nIn the first module we overview the arrival of both Māori and Aboriginal and Torres Strait Islander peoples and settlement in our lands, exploring our respective culture and societies. In the 2nd module we detail the period of colonisation for both peoples, from the first European claims of discovery and ownership to establishment of Colonial Governments, the frontier wars and the disruption to our traditional societies and ways of life and the colonial containment practices that followed.\r\nThe third module’s focus is how colonisation impacted on the lives of Aboriginal and Torres Strait Islander and Maori from the mid 1800s until the late 20th century. We explore not just denial of Indigenous citizenship but also the resistance and activism of both our people’s to re-assert our sovereignty and basic rights. The final module draws the material from the previous three together to outline the position of Aboriginal and Torres Strait Islander and Māori peoples within our respective nation states and dominant cultures.\r\nWhat will I learn?\r\n\r\nThe long history of Indigenous peoples in Australia and Aotearoa New Zealand\r\n\r\nAboriginal arrival more than 45,000 years ago and migration across Australia – 500 nations and more than 260 languages\r\nMāori migration theories and the seven waka and Māori customary locations and traditional worldviews\r\n\r\n\r\nThe similarities but also the differences in how British colonisation came to, and was established in Australia and Aotearoa New Zealand and the various ways our peoples sought to resist their dispossession from their traditional lands\r\n\r\nHow Australia and Aotearoa were ‘discovered’ ‘renamed’ and ‘claimed’\r\nAustralia as a convict colony and the arrival of the first fleet of British military, convicts and settlers\r\nCrown/Māori relations, treaties and Land wars\r\nAustralian frontier wars including the Black Wars in Tasmania and the incarceration of our people at Wybalenna\r\n\r\n\r\nHow colonisation impacted on the lives of Aboriginal and Torres Strait Islander and Māori peoples from the mid 1800s to the late 20th century\r\n\r\nThe disenfranchisement, cultural destruction and dislocation and use of statutes and laws to contain Aboriginal and Māori peoples\r\nThe resistance and activism including the Day of Mourning, the Freedom Rides and the 1967 Referendum in Australia and the Land March, Bastion Point and Foreshore and Seabed in Aotearoa\r\n\r\n\r\nBeing Aboriginal and Torres Strait Islander or Māori today including our identity and presence in each of our countries\r\n\r\nSocio-economic marginalisation and disadvantage\r\nTreaty of Waitangi Claims\r\nPolitical movements – representation and reconciliation including Constitutional reform and reviews\r\nContemporary social, economic organisation\r\n\r\n\r\n\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nCommunity work\r\nForeign affairs\r\nMāori development\r\nPolicy analysis\r\nResearch\r\nTeaching\r\nTranslation services\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: OUR PEOPLES\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: EUROPEAN COLONISATION\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: COLONISED PEOPLES\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: OUR PEOPLES NOW\r\n\r\n\r\n\r\n\n                                    ", 
    "end_date": "2016-02-08T00:00:00Z", 
    "title": "Indigenous Studies: Australia and Aotearoa New Zealand", 
    "price": 0, 
    "instructors": "Dr Maggie Walter and Huia Tomlins-Jahnke", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.open2study.com//node/1791", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open2Study"
    ], 
    "start_date": "2016-01-11T00:00:00Z"
}