{
    "selfpaced": false, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                    \n                    \n                    Comment les humains s’organisent-ils en sociétés ? Qu’appelle-t-on « familles » et comment se constituent-elles ? Quel regard et quels types d’analyse l’anthropologie propose-t-elle sur les systèmes de parenté, symboliques, politiques, religieux ?\n\nL’anthropologie prospective nous aide à comprendre et à anticiper les phénomènes qui transforment nos modes de vie contemporains. Elle pose un regard transversal sur les actions, les pratiques et les dires des personnes avec lesquelles travaillent les chercheurs.\n\n« Entrer en anthropologie », c’est accepter de changer son regard sur le monde et de se décentrer par rapport à ses habitudes. Si vous désirez comprendre un peu mieux le monde et ses changements contemporains, suivez ces chercheurs sur leur terrain et expérimentez d’autres repères culturels.\n\nDurant ces quelques heures, vous serez amenés à débattre avec des professeurs et des étudiants autour de questions sur la famille, les migrations, les mondes virtuels ou encore les mondes des invisibles. Vous apprendrez les bases de l'approche anthropologique et ce qu'elle peut vous apporter en termes de réflexion sur votre propre société, sur votre vie et votre quotidienneté. Ce cours vous donne l’opportunité de comparer vos expériences et d’échanger vos points de vue avec des personnes d’autres horizons.\n\nLes six semaines de cours aborderont une série de thématiques illustrées par des exemples concrets de modes d’existence divers et disséminés sur le globe. Des enseignants plongés au cœur des pratiques sociales et des enjeux politiques et économiques les plus variés partageront avec vous leur expérience après des années d'immersion sur les terrains de recherche qui les passionnent.\n\nSi vous êtes curieux de tout et que comprendre votre propre société mais aussi des sociétés méconnues vous intéresse, ce cours s'adresse à vous !\n\nHow do human beings organize themselves in societies? What do we call “families” and how do they form? What type of analysis does anthropology propose about parenthood, and symbolic, political and religious systems?\n\nProspective anthropology helps us to understand and anticipate phenomena that transform our ways of life today. It gives a cross-cutting look at the actions, practices, and words of those people with whom anthropological researchers work.\n\nTo understand anthropology is to accept changing your view of the world, and to shift your perpsective of your own habits. If you want to understand the world and its contemporary changes more deeply, follow these researchers in their field, and experiment with other cultural references.\n\nIn this course, you will debate with professors and students about family, migrations, virtual worlds, and the world of « invisibles. » You will learn the basis of the anthropological approach and what it can bring you as a reflection tool about your own society and your everyday life. This course gives you the opportunity to compare your experiences and to exchange points of view with people from all around the world.\n\nProfessors immersed in the heart of various social practices, political and economic issues will share their experiences with you after years of research in fields that they are passionate about.\n\nIf you are curious about everything, and if you are interested in understanding your own society but also unknown societies, this course is for you!\n\n                                    ", 
    "end_date": "2017-10-19T00:00:00Z", 
    "title": "Louv6x: Découvrir l'anthropologie", 
    "price": 0, 
    "instructors": "Anne-Marie Vuillemenot, Olivier Servais, Jacinthe Mazzocchetti and Pierre-Joseph Laurent", 
    "institution_name": [
        "Université catholique de Louvain"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/decouvrir-lanthropologie-louvainx-louv6x-0", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-10-13T00:00:00Z"
}