{
    "selfpaced": false, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                    \n                    \n                    Archaeology is, among human sciences, the discipline with the strongest importance for the rediscovery, but also for the preservation and protection of cultural heritage, as Humankind’s universal patrimony. You will be introduced to the way we ourselves reflect on and are engaged with the study of human past: from the practical and material recovery of ancient traces in the field to the study and interpretation. On the other hand, the discovery of human past implies the correct conservation and presentation for both experts and general public: the study and protection of the past we share every day prevent from any possible destruction, misuse, abuse and thus cancellation of human memory.\n“Recovering the Humankind's Past and Saving the Universal Heritage” presents to a large public Archaeology as a historical discipline: through an inter-disciplinary perspective you will follow the evolution and change of archaeology to the moment when natural sciences contributed to make the historical reconstructions scientifically sound; the aid of informatics and of virtual reconstructions gives new fascination to the already strong suggestion of Archaeology, as the discipline of discovery par excellence. Within this frame, Ebla, which is the glory of the Sapienza school of Oriental archaeology, will have an exemplary meaning in the course development as a long lasting experience on the field and an excellent example of the scientific results of combined researches and disciplines.\n\nMoreover, the course will focus on actual, innovative instruments to preserve, monitor and give value to cultural heritage through a multidisciplinary approach, based on a deep archaeological and historical knowledge but also on ICT technologies. The wide adoption of ICT technologies in our daily life is also impacting in the way in which we interact with our cultural heritage in particular in terms of preservation and dissemination of cultural objects.\n\nIn this course you will  learn the basic techniques  to digitize cultural objects and obtain 3D digital copies of a physical objects such as statues, vases or archaeological sites.  We will also discuss how to structure the raw data in order to facilitate and make effective the access to digital contents. In particular, we will present the European Data Model, a framework for collecting, connecting and enriching data on cultural objects provided by a number of museum, archives, sites and libraries in Europe.\n\n                                            Syllabus\n                        COURSE INFORMATION &amp; COLLABORATIVE ACTIVITIESThe inter-disciplinary perspective of Archaeology, the Ebla discovery, the use of ICT technologies and the introduction of the Europeana Data Model as a framework for collecting, connecting and enriching data will be the focus of the course.Week 1 - The recovery of the human past and the protection of the universal heritage. We will start our enquiry by discussing how ancient societies kept memory of their own past, an aspect which, in fact, was fundamental to their identity. Shifting towards modern times, we will then reflect how the material past is preserved and how we refer to it. \nHomework available since Week 2 - The birth of archaeology and its role in the contemporary world. The study of the past of the planet marked the first serious reflections on humankind’s past, although archaeology was in fact considered the practice to collect objects. “New Archaeology” represents the first major revolution, promptly followed by the more structured and aggressive “Processual Archaeology\". The opening towards different disciplines implied the “loss of innocence” for archaeology, bringing at the same time scientific methods into the reconstructions of the past.\nHomework available since Week 3 - The birth of archaeology and its role in the contemporary world. Field archaeology entails discovery, but is a matter of fact that discovering brings a great responsibility because it is a process of destruction. Digging means observing, recording, interpreting. Archaeological excavation is an harmonious trade-off between an intellectual and a manual labor. In fact, archaeological interpretation is a path shifting between identity and alterity.\nHomework available since Week 4 - The birth of archaeology and its role in the contemporary world. Material remains of the past and their state of recovery vary according also to environments. Surface surveys lead to a more intense knowledge of territories, visualizing archaeologicallandscapes in a variety of ecological situations.  The objectives of archaeological research have been moulded in the historical development of the discipline. Historical sources have always been a sourceof inspiration for research, opening new problems. Chronology is a construct depending on dating tools, and scientific methods have been employed in determining an absolute chronology.\nHomework available since Week 5 - The birth of archaeology and its role in the contemporary world. This module focuses on scientific research and knowledge dissemination.The specificities of the past pose a problem in respect of popularization and simplification. The operational chain is made of exploration, dig, publication, conservation, dissemination, protection. However, the need for a legitimacy of the present has led also to political readings of the retrieval of the past. Present cultural identity is grounded in the retrieved past. The “past of the other” has often been refused throughout history down to modern times. Our perception of the past is made manifest in its material and virtual reconstruction starting from ruins. Further, “excessive exploitation” of the past represent a modern destruction. The archaeological excavation of Ebla (Syria) will be analyzed as case study. It is in fact an example of a research framed within historical archaeology, which, in the course of fifty years of research, turned into a global perspective.\nHomework available since Dic.: Quiz week 5Week 6 - Digitizing Cultural Objects and 3D virtual reconstruction In this module, Emanuel Demetrescu will explain us the last methodologies and techniques in the field of 3D acquisition and reconstruction of cultural heriatage. These applications improve the knowledge and preservation and have a central role in the way we can communicate cultural heritage to the society. Making digital copies from real objects now has several very fun and precise technologies that are also available to everybody at very low cost budget. Demetrescu will show us how to use these tools to make our own models and share them with others. The virtual reconstruction of no-more-exstant objects (like a lost temple) will be the argument of the last part of the module: a state of the art of the methodologies will help us to understand how to approach such a process from a scientific point of view (archaeological method).\nHomework available since 1 Jan.: Quiz week 6Week 7 - Digitizing Cultural Objects and 3D virtual reconstruction In this module, Andrea Vitaletti will show us the basic techniques to effectively manage the  unprecedented amount of digital contents on cultural objects nowadays offered by cultural heritage providers. Raw data,  need to be organized in structured information in order to effectively support advanced functionalities, such as  indexing and searching. We will  present the basic techniques to structure the data in order to facilitate the access to digital contents and we will focus on  the European Data Model, a framework for collecting, connecting and enriching data on cultural objects provided by a number of museum, archives, sites and libraries in Europe. \nHomework available since Week 8 - Digitizing Cultural Objects and 3D virtual reconstruction This module deals with some basic issues and principles. All heritages are “equal among them”. Heritages are a property of humankind and not of the single countries. Heritages need to be protected and preserved in their context. But many threats are posed to heritages: illegal digging is a serious risk, as well as actions due to hatred for the “other” and his heritage. As a consequence of what stated above, damages to heritage are a crime against all humankind. International Organizations are engaged in protecting the heritage, the future of which represents a contribution to dialogue and peace. \nHomework available since \n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "Recovering the Humankind's Past and Saving the Universal Heritage", 
    "price": 0, 
    "instructors": "Paolo Matthiae", 
    "institution_name": [
        "Sapienza University of Rome"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/preserving-cultural-heritage", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}