{
    "selfpaced": false, 
    "topic_name": [
        "Anthropology"
    ], 
    "description": "\n\n                    \n                    \n                    This free online course is based on the work of nine anthropologists who each spent 15 months in fieldsites in Brazil, Chile, industrial and rural China, England, India, Italy, Trinidad and Turkey.\n\nWhat are the consequences of social media?\nThe course offers a new definition of social media which concentrates on the content posted, not just the capabilities of platforms. It examines the increasing importance of images in communication and the reasons why people post memes, selfies and photographs.\n\nOver five weeks you will explore the impact of social media on a wide range of topics including politics, education, gender, commerce, privacy and equality. You will come to understand how the consequences of social media vary from region to region.\n\nTake a comparative and anthropological approach to social media\nThe course will be taught by the same nine anthropologists who carried out the original fieldwork and who are publishing eleven books based on this research.\n\nYou will meet many of our informants through our films, engage with our team through video discussions and lectures, and encounter our ideas through animations, infographics and text.\n\nAdopting an anthropological and comparative approach, we strive to understand not only how social media has changed the world, but how the world has changed social media.\n\nTo learn more about our research, see the Why We Post website or read our blog. If you have a question about the project, email whywepost@ucl.ac.uk.\n\nTranslations of this course can be found on UCLeXtend in the following languages: Chinese, Italian, Hindi, Portuguese, Spanish, Tamil and Turkish.\n\n\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Why We Post: the Anthropology of Social Media", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "University College London"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/anthropology-social-media?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}