{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t                This course is for anyone who has Lightroom or is interested in using Lightroom as part of their post processing work flow for their digital photos.  If you take a lot of photos then you know how important a organized work flow is.  The quicker you can finish turning good images in to great photographs the more time you can spend on other things.  </p>  <p>  \t<strong style=\"\">This course will cover:  </strong>  </p>  <ul style=\"\">  \t<li>Importing your photos into Lightroom                                                              </li>  \t<li>Narrowing your photos down to the ones that need to be worked on</li>  \t<li>Quickly processing the photos in Adobe Lightroom                                                              </li>  \t<li>Outputting the photos for delivery to family, friends, or clients</li>  </ul>  <p>  \t      Time is everything and this course covers the work flow that I developed over the years. When I was doing event photography I would often shoot 6,000+ images in a day and have to process and post them within 5 days for client purchase. Due to these requirements I developed a work flow to meet the objective of being able to quickly process and post my images.I was initially using Photoshop and then moved to Lightroom. I saw an immediate improvement in the time needed to complete my image processing. As I moved from using Lightroom version 1 to now Lightroom version 5 it has evolved in to what I am presenting in this course. I now do over 90% of my image processing in Lightroom  </p>", 
    "end_date": null, 
    "title": "Adobe Lightroom 4 & 5 post-processing work flow for everyone", 
    "price": "25.00", 
    "instructors": "John Hoeft", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338854_9e15_6.jpg", 
    "course_url": "https://www.udemy.com/adobe_lightroom_work_flow_and_post_processing/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T21:53:50Z"
}