{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t    Adobe Photoshop Lightroom es uno de eso programas revolucionarios que están llamados a convertirse un estándar en el flujo de trabajo de fotógrafos diseñadores y profesionales que utilicen un archivo fotográfico. Con Lightroom podemos trabajar directamente con nuestros archivos RAW. Es un programa de fotografía desarrollado por Adobe Systems para Mac OS X y Microsoft Windows, diseñado para ayudar a fotógrafos profesionales en el tratamiento de imágenes digitales y trabajos de post-producción.  </p>  <p>  \tEste curso es impartido por Rodrigo Erades, experto en los campos de desarrollo web y en fotografía. Maneja diferentes lenguajes y programas de desarrollo web como html5, css3, action script y programación para Adobe Flash. Freelance desde 2006 en ambos campos ha trabajado para clientes como e grupo PRISA, el país, as, cinco días, cadena SER o canal plus. En el campo de la fotografía ha trabajado para SEUR, remodelando su imagen corporativa y en otros proyectos como el de Vision Lab.  </p>  <p>  \tEn este curso cubriremos los siguientes temas:  </p>  <ul style=\"\">  \t<li>Familiarizarse con el programa</li>  \t<li>Barra de herramientas</li>  \t<li>Navegación</li>  \t<li>Revelado rápido</li>  \t<li>Filtros</li>  \t<li>Copias virtuales</li>  \t<li>Utilización de videos</li>  \t<li>Ajustes preestablecidos</li>  \t<li>Histograma</li>  \t<li>Edición básica</li>  \t<li>Curva de tonos</li>  \t<li>HSL</li>  \t<li>Color</li>  \t<li>Blanco y negro</li>  \t<li>División de tonos</li>  \t<li>Detalle</li>  \t<li>Corrección de lente</li>  \t<li>Efectos</li>  </ul>", 
    "end_date": null, 
    "title": "Adobe Lightroom 4", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177602_577a_2.jpg", 
    "course_url": "https://www.udemy.com/adobe-lightroom-4/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-06T00:40:41Z"
}