{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Mit diesem Training bekommen Sie Lightroom 5 richtig in den Griff! Lassen Sie sich Film für Film zeigen, wie Sie Lightroom richtig einsetzen. Lernen Sie nicht nur besonders anschaulich alle Werkzeuge, Menüs und Regler kennen. Profitieren Sie auch von vielen Tipps, mit denen Sie Ihre Bilder besonders gut verwalten und entwickeln. Zur Bibliothek, zur Entwicklung, zu RAW-Bildern, Metadaten und Katalogen – in diesem Video-Training finden Sie Antworten auf Ihre Fragen und Lösungen, die sofort weiterhelfen. Ganz einfach zum Zuschauen und Mitmachen!</p><p style=\"\">- Lernen Sie Lightroom einfach durch Zuschauen<br style=\"\"></p><p style=\"\">- Alle Werkzeuge verstehen und richtig anwenden<br style=\"\"></p><p style=\"\"><span style=\"\"></span>- So holen Sie alles aus Ihren Bildern heraus</p><p style=\"\">Maike Jarsetz ist ausgebildete Fotografin und arbeitet als selbstständige Trainerin, Designerin und Beraterin im Bereich Fotografie und Fotodesign. Zu ihren Kunden zählen unter anderem Firmen wie PhotoDisc, Digital Vision, Getty Images sowie Druckereien, Agenturen und Fotografenverbände. Anzutreffen ist sie auf vielen Veranstaltungen als Beraterin für Adobe, Wacom und Digital Vision. Seit 2010 initiiert sie die Hamburger Photoshop- und Lightroom-Tage. Maike Jarsetz ist Adobe Certified Expert für die Programme InDesign, Photoshop und Illustrator. Bei Galileo Press sind mehrere Bücher von ihr erschienen sowie verschiedene Video-Trainings zur Bildbearbeitung für Fotografen.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Adobe Photoshop Lightroom 5: Das umfassende Training", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446390_e6f0_2.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-lightroom-5-das-umfassende-training/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T08:20:43Z"
}