{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<span style=\"\">• &nbsp;Need help with choosing cameras?<br style=\"\">• &nbsp;Confused by technical terms used by geeky salesmen or camera reviews?</span><p style=\"\"><span style=\"\">• &nbsp;Confused by the choice of cameras available?<br style=\"\">ª &nbsp;Working to a budget and need to save money?</span></p><p style=\"\"><span style=\"\"><br style=\"\"></span></p><p style=\"\"><span style=\"\"><span style=\"\">With over two hours of authoritative, concise content, a quiz and short guide to cameras, here&#039;s just what you&#039;re looking for.</span><br style=\"\"><br style=\"\"><span style=\"\">I&#039;ve created a short and easy-to-understand&nbsp;course for anyone confused about buying cameras. You&#039;ll see pictures of different cameras, details of camera controls,&nbsp;photographic examples, and more!<br style=\"\"><br style=\"\">Remember: there’s no such thing as a perfect camera. But there’s probably a camera that’s perfect for you. In this course I aim to equip you so you can make your own, confident decisions.&nbsp;</span></span></p><p style=\"\"><span style=\"\"><span style=\"\">I give you the information, hints and tips to help you find the camera that’s just right for you.</span><br style=\"\"><br style=\"\"><span style=\"\">In the process, you also learn a bit of photography! There are lots of tips and hints on photo-technique.&nbsp;<br style=\"\"><br style=\"\">I explain everything in everyday language with lots of illustrations. I’ve created this with the absolute beginner in mind - so you don’t need to have any knowledge of photography. &nbsp;<br style=\"\"><br style=\"\">I won’t be check out or reviewing individual camera models this time, but I will describe the main types of cameras so you understand their pros and cons. That’s the best way to narrow your search.<br style=\"\"><br style=\"\">There’s a lot to cover, so let’s get to it! <br style=\"\"><br style=\"\">The lectures start with some introductory material, starting with four key terms in Lecture 2. Even if you know some&nbsp;photography, I suggest you take Lecture 3: A few key truths. Then we work our way up from basic&nbsp;point-and-shoot cameras to SLRs. Then we look in more detail at key camera features. Round up is some advice on how to buy, finishing off with three of my top tips in the final lesson.<br style=\"\"></span><br style=\"\"><span style=\"\">1&nbsp; &nbsp;Introduction<br style=\"\">2&nbsp; &nbsp;A few key words<br style=\"\">3&nbsp; &nbsp;A few key truths<br style=\"\">4&nbsp; &nbsp;Cameras for the beginner and casual shooter<br style=\"\">5 &nbsp; Camera for the experienced&nbsp;photographer&nbsp;<br style=\"\">6&nbsp; &nbsp;Cameras for the enthusiast&nbsp;<br style=\"\">7 &nbsp; SLR cameras&nbsp;<br style=\"\">8 &nbsp; Camera features for beginners<br style=\"\">9 &nbsp; Features for experienced&nbsp;photographers<br style=\"\">10 How to buy with confidence<br style=\"\">11 Until next time ...</span></span></p><p style=\"\"><span style=\"\">Remember you can contact me direct from here by posting questions on the right-hand panel. Else write to me at info@tomang.com.&nbsp;</span></p><p style=\"\"><span style=\"\">Also you will find my blogs on photography and details of my books on my website&nbsp;<a href=\"http://www.tomang.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">www.tomang.com</a>&nbsp;<br style=\"\"></span><br style=\"\">  </p>  ", 
    "end_date": null, 
    "title": "Ang’s Guide to Buying Cameras with Confidence", 
    "price": "20.00", 
    "instructors": "Tom Ang", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/31279_694d_8.jpg", 
    "course_url": "https://www.udemy.com/tomang_guide-to-buying-cameras-with-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-04T09:11:22Z"
}