{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<table>  <tbody>  <tr>  \t<td>  \t\t<strong>Master lighting   techniques with Bob Davis on your own terms with this one-of-a-kind video   training course.  </strong><br>  \t\t<p>  \t\t\t<span>Digital photography expert Bob Davis shares his professional   lighting techniques and the various types of light he uses in his shoots in   this video training offering. Through these hands-on tutorials,   Davis teaches you the differences between the quality of light and the   quantity of light and shows how to enhance light sources for optimal   results.  Davis provides expert,   straight-forward, user-friendly training to help you tackle new topics the   way you want to learn. </span>  \t\t</p>  \t\t<p>  \t\t\t<span>Master basic skills, boost your creativity, and   challenge yourself in bold new directions. </span><span>Includes visual demonstrations to show how Bob uses different types of   light, such as natural or mixed, and also lighting tools, such as the camera   and its settings, camera gels and speed light, reflectors and strobes, and   light meter explains how to apply   these lighting techniques to your own on-location shoots.  </span>  \t\t</p>  \t\t<p>  \t\t\t<span>Covers each piece of the professional   equipment Davis uses for lighting and how to get the best results with   them  Includes over 5 hours of Bob   Davis professional lighting techniques video training  If you&#039;re looking for real-world lighting   technique instruction from a true professional, you&#039;ll find it here.  </span>  \t\t</p>  \t</td>  </tr>  </tbody>  </table>", 
    "end_date": null, 
    "title": "Bob Davis' Professional Photography Lighting Techniques", 
    "price": "50.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329726_a4a9_2.jpg", 
    "course_url": "https://www.udemy.com/bob-davis-professional-photography-lighting-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T18:51:34Z"
}