{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t<strong>  Course Summary</strong>  </p>  <p>  \t          This course was created to help you become knowledgeable about commonly used video making equipment at this time. Video gear is an ever changing landscape, and as a professional video producer, I'm extremely passionate about all video production tools. This course is designed for the beginner and intermediate video maker aspiring to make high quality video content.  </p>  <p>  \t<strong>Why Take this Course?</strong>  </p>  <p>  \t<em>Gain critical technical and theoretical knowledge to help you make the most informed equipment purchase decisions. </em>  </p>  <p>  \t          Whether you want to make video content in blog format, creative videos, or whether you're aspiring to be a professional video producer and filmmaker; you need to have the <em>correct</em> <em>tools</em> to help properly bring your vision to life. The information you will accumulate from this course will help you make the most informed decisions about your camera equipment purchases, so you can start accumulating the best tools for your video making needs.  </p>  <p>  \t<strong><em>This course is NOT a \"How to Make Great Videos\" Course. It's about understanding the equipment to bring your vision to life.</em></strong>  </p>  <p>  \t<strong>What You'll Learn from this Course</strong>  </p>  <ul>  \t<li>Learn about the background and context of modern video production equipment. </li>  \t<li>The most popular different types of cameras that are out now. Important technical information to consider when deciding on what kind of equipment to get. </li>  \t<li>Why certain cameras or tools are more appropriate than others for your various video making needs. </li>  \t<li>Suggestions on which pieces of equipment will enhance your videos production value.</li>  </ul>  <p>  \t<strong>Contents and Overview </strong>  </p>  <p>  \t        This course includes over 2 hours of lectures on cameras, audio equipment, and critical camera support equipment that will help enhance your shots. It's divided into four sections.  </p>  <ul>  \t<li><em>Section one</em> provides vital foundational information about cameras. </li>  \t<li><em>Section two</em> covers everything you'll need, as a beginner to create high quality videos.</li>  \t<li><em>Section three</em> dives into professional video production tools that every aspiring pro video maker should be well aware of.</li>  \t<li><em>Section four</em> covers brief but important information on post production.</li>  </ul>  <p>  \t<strong>30 Day Money Back Guarantee! </strong>  </p>  <p>  \t<em>Don't worry, if you're not satisfied with this course, you can easily get a refund. </em>  </p>  <p>  \t    However, I'm convinced that you'll find this content valuable for your video making needs. I've provided a tremendous amount of information about video production equipment, that I have gained from a decade of creating videos professionally.  </p>  <p>  \t      Thanks for your interest in this course! I look forward to your honest feedback, questions, comments and course reviews.  </p>", 
    "end_date": null, 
    "title": "Buy the Right Camera Gear to Make Pro Quality Videos", 
    "price": "20.00", 
    "instructors": "Larry Cheuk", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119458_f6ab_7.jpg", 
    "course_url": "https://www.udemy.com/make-professional-videos-with-the-right-gear/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-13T19:21:23Z"
}