{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>It probably happened to you to saw images on social media or websites (ads, banners, infographics, graphic elements, presentations, posters, covers) and think how great they look. </p><p>If you are like most bloggers and small business owners you said yourself \"<em>it looks awesome, it probably costs a fortune to pay a professional graphic designer to have something like this and I don't know graphic design to create them ..</em>.\"</p><p>This is true... and not quite.</p><p>You are right if you think that paying a designer to create professional images for websites, for Instagram, Twitter or Facebook could cost you some money. Because<strong> a professional graphic designer costs ... a lot.</strong></p><p>But it is not true you cannot<strong> do them by yourself.</strong></p><p>Since covers, ads, banners or social media post images are some of the most important type of images you can use on social media, on your website, your blog or online, having them look eye catching usually helps a lot in positioning your products, your services in your niche (asumming you have good products).</p><p>This course is <strong>a beginner course on how to create eye catching, professional looking graphic design elements </strong>for websites by using Canva's free tool. It is intended for bloggers and small business owners who want to promote their (or someone else's) products and services and want the visitors of his website click on those ads, not just admire how nice they look... (like ...\"<em>cool banner, I wonder what is this about..</em>\" &amp; click)</p><p>And to also <strong>capture attention </strong>on websites.</p><p>You <strong>don't need any graphic design experience</strong>, just start from zero and create amazing images that <strong>look like made by a pro</strong>.</p><p>You will learn</p><ul><li>how to create your Canva account,</li><li>how to use the design dashboard,</li><li>how to add images,</li><li>how to format the text areas,</li><li>how to find out already prepared text blocks that look professional,</li><li>how to export your images from Canva to your blogs, your websites or Facebook</li></ul><p>By taking it, you will be able to understand and master the art of creating eye catching images in the step by step demonstrations.</p><p>In your own pace.</p><p>My name is Florin Rosoga, I managed hundreds of social media and websites campaigns for myself or my clients in the last years.</p><p>Since social media and websites is a visual place, <strong>an engaging image</strong> will improve your website &amp; social media campaign conversion.</p><p><u></u></p><p>In this course you will get step by step video explanations to help you understand in a comfortable way all about <strong>graphic design like a professional</strong>, without buying an expensive and complicated software and <strong>without any previous graphic experience.</strong><br></p><p>The entire course can be downloaded as a video training to watch or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next... <u>click the Take this Course button</u> top right and you'll be taken to our secure payment page.</p><p>Just <em><u>Enter Your Regular Details</u></em> and complete your investment to have immediate access.<br></p><p><strong>Stop struggling with boring graphic design</strong> you do in the old Paint (and by the way that image really look boring and is ignored by everyone) and <strong>start mastering graphic design in minutes, just like a pro!</strong></p>", 
    "end_date": null, 
    "title": "Canva Graphic Design Essentials", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650932_ada3_4.jpg", 
    "course_url": "https://www.udemy.com/master-graphic-design-like-a-professional-with-canva-graphic-design/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T05:05:36Z"
}