{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Das Praxis-Training zu Capture One Pro 9 für Foto-Enthusiasten! Der bekannte Fotograf und Fototrainer Mario Dirks beherrscht Capture One seit vielen Jahren. Er zeigt Ihnen, wie Sie den RAW-Konverter bedienen und Ihre Fotos importieren, motivgerecht entwickeln und präsentieren. Erzeugen Sie eigene Bildlooks, setzen Sie eine komplette Beautyretusche um und gleichen Sie Verzerrungen aus. Film für Film lernen Sie alle Werkzeuge kennen und profitieren von erprobten Lösungen zu allen Anwendungsfällen bei RAW-Entwicklung und Fotofinish. Inkl. Praxistipps für Lightroom- und Aperture-Umsteiger.</p><ul><li>Capture One Pro 9 von A bis Z – Alle Werkzeuge im Praxiseinsatz</li><li>Die Schulung mit dem Profifotografen Mario Dirks – live per Video</li><li>Workflows, RAW-Entwicklung und Profitechniken für alle Fotogenres</li><li>Umfangreiches Bildmaterial zum Üben und Mitmachen</li></ul><span></span><p><span></span></p><p><span></span></p><p><span></span></p><p>Mario Dirks ist Profifotograf, Autor und Trainer. Capture One Pro gehört seit vielen Jahren zu seinem Foto-Alltag dazu. Regelmäßig finden bei ihm Foto-Workshops und Seminare statt, zu denen er auch namhafte Fotografen aus ganz Deutschland als Gastdozenten einlädt. Für den bekannten Objektiv- und Kamerahersteller SIGMA war Mario Dirks im Rahmen der »Our World«-Tour mit der Kamera auf der ganzen Welt unterwegs.</p>", 
    "end_date": null, 
    "title": "Capture One Pro 9 –  Das Praxis-Training für Fotografen", 
    "price": "50.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794926_bdb1.jpg", 
    "course_url": "https://www.udemy.com/capture-one-pro-9-das-praxis-training-fuer-fotografen/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T17:34:52Z"
}