{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Eine Geschichte, sechs Bilder! Erleben Sie die Schöne und das Biest in einem fotografischen Streifzug der Extraklasse. Matthias Schwaighofer zeigt, wie er den zeitlosen Märchenstoff in sechs Bildcomposings verarbeitet. Und Sie sind live dabei, von der Konzeption über das Foto-Shooting bis zum finalen Photoshop-Composing. Freuen Sie sich auf herausfordernde Licht-Setups, Requisiten der Marke Eigenbau, Kostüm- und Make-up-Ideen, Composing-Tricks und ganz viel Photoshop-Magie!</p><ul><li><strong>Faszinierende Bildideen entwickeln und effektvoll umsetzen</strong></li><li><strong>Sechs Komplettworkshops vom Foto-Shooting bis zum Photoshop-Composing</strong></li><li><strong>Alle Originalbilder zum Mitmachen im Übungsmaterial</strong></li></ul><p><strong></strong></p><p><strong></strong></p><strong></strong><strong></strong>Matthias Schwaighofer ist Meisterfotograf, Restaurateur und Photoshop-Künstler. In seine Arbeiten fließt neben höchster Professionaliät auch immer eine gute Portion Humor ein. Er schreibt Artikel für Fachzeitschriften zum Thema Photoshop und digitale Bildbearbeitung und hat einen Beitrag für das zweite Fotocommunity-Buch geschrieben. Sein Faible gilt vor allem hochwertigen Porträtfotos, aufwändigen Composings und humorvollen Collagen, in denen er sich gerne selbst stilisiert.", 
    "end_date": null, 
    "title": "Die Schöne und das Biest. Photoshop-Artworks & Fotoshootings", 
    "price": "50.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587758_8eea.jpg", 
    "course_url": "https://www.udemy.com/die-schoene-und-das-biest/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T20:12:08Z"
}