{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t      If you are looking to edit your photos and you don&#039;t have the funds to purchase expensive software like Photoshop or Aperture then this free course is just for you! In this course I will teach you how to edit your photos using free iOS apps and get the Photoshop level of quality that the professionals are able to achieve. You will learn all this in less than one hour! (I will always be updating this course with new content as I come across other free applications that can be used on the <strong style=\"\">PC and Android Devices</strong> as well!)  </p>  <p style=\"\">  \t                  At the end of the course you will be able to:  </p>  <p style=\"\">  \t                  - Do facial make over and add make up! Contour your face, <strong style=\"\">whiten teeth</strong>, sculpt brows, <strong style=\"\">banish blemishes</strong>, smooth your complexion and more!  </p>  <p style=\"\">  \t                  - <strong style=\"\">Auto Correct</strong> - Automatically analyzes your photos and adjusts color and exposure to perfection.  </p>  <p style=\"\">  \t                  - <strong style=\"\">Selective Adjust</strong> - Make precise selections and enhancements to specific area in your photos. If you want that grass greener or you want the sky blue there is a free app that can do that and I will show you how to use it.  </p>  <p style=\"\">  \t                  - Use <strong style=\"\">Ambiance </strong>to create depth and vibrancy that uniquely adapts to colors and textures.  </p>  <p style=\"\">  \t                  Adjust White Balance, Saturation, Contrast,  </p>  <p style=\"\">  \t                  - <strong style=\"\">Crop </strong>- Easily crop images to remove distracting parts of your photo with standard aspect ratios, or a free crop.  </p>  <p style=\"\">  \t                  - <strong style=\"\">Vintage Films </strong>(The most one app can produce!)- Make any photo look like a vintage color film photo from the 50’s, 60’s or 70’s.  </p>  <p style=\"\">  \t                  - <strong style=\"\">Drama </strong>- Add style with a custom effect specifically tailored to your photos, ranging from subtle textures to wildly artistic effects.  </p>  <p style=\"\">  \t                  - <strong style=\"\">Grunge </strong>- Give your photos a totally unique, hip, and dingy look.  </p>  <p style=\"\">  \t                  - <strong style=\"\">Tilt-Shift </strong>- Create a narrow in-focus area designed to simulate depth of field, common in a Miniature Scene look.  </p>  <p style=\"\">  \t                  - <strong style=\"\">Sharpen </strong>- Enhance details with traditional sharpening so you make that photo look High definition!  </p>  <p style=\"\">  \t                  - <strong style=\"\">Center Focus</strong> - Draw attention to the subject of your photo by blurring and adjusting the brightness of the surrounding background.  </p>  <p style=\"\">  \t                  * <strong style=\"\">Retrolux </strong>- Make your photos look truly retro with light leaks, scratches, film styles, and more.  </p>  <p style=\"\">  \t                  - <strong style=\"\">Special effects in your photos</strong>. Magic particles, glows, fires, sparks, auras, glows, lighting, lens flare that would make Michael Bay drool on his paints! (Photoshop is even difficult sometimes doing lens flares!), rays,vintage, manga effects for your comics, anime... more than 70 effects special effects!!!!  </p>  <p style=\"\">  \t<strong style=\"\">This course will not be free for long! Once I release Section 6 this course will be a $19.99. </strong>In this section I will teach you how to do the following super powers using free iPhone applications.  </p>  <ol style=\"\">  \t<li style=\"\">Telekinesis</li>  \t<li style=\"\">Super Strength</li>  \t<li style=\"\">Pyrokinesis</li>  \t<li style=\"\">Water bending</li>  \t<li style=\"\">Flight</li>  \t<li style=\"\">Astral Projections or Spirit Effects</li>  \t<li style=\"\">Cloning (Done the right way!)</li>  \t<li style=\"\">and much more....</li>  </ol>  <p style=\"\">  \t                  After this training you will be able to make your normal camera phone photos look amazing and professional with in minutes. All you need is an iOS device and you will be ready to jump into this course with ease. I made this course because I professionally use this apps for editing photos for my clients when I&#039;m away from my main computer which has Photoshop installed on it. I found that <strong style=\"\">I was able to do 20 photo edits in 10 mins or least</strong> and the quality was just as good as if I did the photo edits in Photoshop. I was so amazed and your client would never know because the apps are that powerful!!! You will notice as with all my course they are very short and compacted with useful information. Each section will have a text document and a video that you can follow along with. And I will be adding new stuff as time progress, because I am trying to find better apps out there that will make my photo editing easier while I&#039;m on the road. So make sure to check your notification after you have signed up and completed this course. <strong style=\"\">Enroll in this course now</strong> and become a professional photographer editor using just an iOS device.  </p>", 
    "end_date": null, 
    "title": "Edit photos like a professional photographer using iOS apps", 
    "price": 0, 
    "instructors": "Malachi Staples", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/264582_264b_3.jpg", 
    "course_url": "https://www.udemy.com/photo-editing-with-free-softwares/", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-19T12:52:40Z"
}