{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>For many landscape and field photographers, mastery of long exposure photography, particularly in daytime conditions, is an essential skill. For all photographers, mastery of composition and design is what distinguishes the good from the great. In this course, you will learn the same tools and techniques used by the pros to take jaw-dropping long exposure images in the field and then polish them even further using industry standard software. You will be able to use simple, powerful compositional devices and design principles that famous photographers and artists have been employing successfully for decades.</p><p><strong>Master Long Exposure Photography, Composition and Post-production Techniques in Order to Take Your Skills to the Next Level</strong></p><ul><li>Finding and using the right cameras, lenses, tripods and filters for long exposure photography</li><li>Master exposure and depth of field through the three pillars of light and the exposure triangle</li><li>Learn the principles of art and design, so that you can use them effectively to create stunning  photographic composition</li><li>Understand the elements of art and employ them as powerful allies in the image-making process</li><li>Begin the photographic journey out in the field and then go into the studio to learn first-hand the magic of post-production techniques using industry standard software such as Photoshop and Lightroom</li></ul><p><strong>Master Key Skills That Pros Use to Create Award-winning Landscape Photographs </strong></p><p>If you’ve ever wondered how professional landscape photographers consistently create those knock-your-socks-off gorgeous images that get into magazines and hung on gallery walls, then this course is for you. If you love long exposure photography, but have struggled with it during daylight conditions, then this course is here to help.<br> <br> The benefits of knowing how both the principles and elements of art can aid you in crafting truly amazing photographic composition cannot be underestimated. You don’t have to spend several years and countless thousands of dollars studying to get a design degree in order to learn and use these as a photographer. This course has distilled the most important concepts I have used over the years teaching design and packaged them into easy lessons you can apply immediately in the field. Many of the most famous artists and photographers of all time have used these same principles and techniques. Now you can too.</p><p><strong>Contents and Overview</strong><br></p><p>We’ll begin by comparing long exposure photography during both low and full daylight conditions to see how they each affect the image making process. I’ll use plenty of my own work as examples along the way, so that you can understand my thinking and process more effectively.</p><p>Then we’ll cover photographic gear essentials and what you’ll need to create long exposure photos anytime, but especially during the more challenging daylight hours. I’ll give you suggestions for a range of budgets and specs, so that you can find the right combination of gear for your own unique situation. You will learn about filters and the most powerful tool in my arsenal for making photos with extended shutter speeds. I make it all easy and fun.</p><p>Using the Three Pillars of Light and the Exposure Triangle, I’ll explain how to manipulate your camera settings for correct exposure, depth of field and image sharpness under virtually any condition.</p><p>The section on Composition will take you through a step-by-step mini-course on the Principles and Elements of Design, so that you can begin using them right away in your photography. You will progress far beyond the basic Rule of Thirds to become a master of compositional design. In a stand-alone section, we’ll deconstruct many of my own photographs to see what worked, what didn’t and why.</p><p>Finally, we’ll go out together for three case studies that will take us from the field to the studio for some post-processing magic. You’ll learn how to make good photos great and great photos exceptional with an easy to follow workflow in Adobe Lightroom and/or Photoshop. I will share with you my techniques for painting light, color, saturation, clarity and contrast back into your images. By the end you’ll be a master of the histogram, able to fix crooked horizons, replace skies and remove unwanted elements from your images.</p><p>You’ll also receive bonus material that will help you choose the right gear for your budget and needs. You’ll get suggestions and links for plug-ins that can save you time and make the post-production process more efficient.</p><p><strong>Requirements</strong></p><p>A DSLR, Mirrorless or other camera with the ability to change lenses and manually control shutter speed, aperture and ISO</p><p>Access to, basic skills with Photoshop, Photoshop Elements, Lightroom, GIMP, or similar would be very beneficial, but not strictly necessary</p><p><strong>What Am I Going to Get From this Course?</strong></p><ul><li>Over 36 lectures and more than 3 hours of video content</li><li>Learn to take long exposure photos in challenging conditions such as full daylight</li><li>Advanced composition and design principles the pros use to create stunning landscape and other types of photographs</li><li>Suitable for photographers of all levels</li><li>Visual training method that includes examples, animations, illustrations and assignments for easy, fun to use learning and skills retention. </li><li>Applied case studies where we begin in the field and then progress all the way to post-production image finishing in the studio using various software tools and techniques</li></ul>", 
    "end_date": null, 
    "title": "FIELD PHOTOGRAPHY MAGIC - Long Exposure & Composition", 
    "price": "25.00", 
    "instructors": "Dale Cody", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737490_bbbe_2.jpg", 
    "course_url": "https://www.udemy.com/field-photography-magic-long-exposure-composition/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T03:38:42Z"
}