{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t Las cámaras digitales de gama alta son capaces de producir fotografías en un formato de alta calidad llamado RAW. Adobe Camera Raw es el plug-in oficial de Adobe para procesar estos archivos. Este plug-in cuenta con soporte para prácticamente la totalidad de las cámaras que utilizan formato RAW y nos permitirá realizar numerosos ajustes de color, exposición , contraste, forma, etc  a nuestras fotografías gracias a su potente motor.  Y lo mejor de todo, de forma no destructiva, manteniendo siempre el archivo original.  </p>  <p>  \tAdobe Photoshop es el nombre o marca comercial oficial que recibe uno de los programas más populares de la casa, Adobe Systems, junto con sus programas hermanos Adobe Illustrator y Adobe Flash, y que se trata esencialmente de una aplicación informática en forma de taller de pintura y fotografía que trabaja sobre un &quot;lienzo&quot; y que está destinado para la edición, retoque fotográfico y pintura a base de imágenes de mapa de bits.  </p>  <p>  \tEste curso es impartido por Rodrigo Erades, experto en los campos de desarrollo web y en fotografía. Maneja diferentes lenguajes y programas de desarrollo web como html5, css3, action script y programación para Adobe Flash. Freelance desde 2006 en ambos campos ha trabajado para clientes como e grupo PRISA, el país, as, cinco días, cadena SER o canal plus. En el campo de la fotografía ha trabajado para SEUR, remodelando su imagen corporativa y en otros proyectos como el de Vision Lab.  </p>  <p>  \tEn este curso vamos a cubrir los siguientes temas:  </p>  <ul>  \t<li>Comparación formato RAW y JPG</li>  \t<li>Balance de blancos</li>  \t<li>Contraste y esposición</li>  \t<li>Claridad</li>  \t<li>intensidad y saturación</li>  \t<li>Curva de tonos</li>  \t<li>Corrección de lente</li>  \t<li>Efectos</li>  \t<li>Calibración de cámara</li>  \t<li>Ajustes preestablecidos</li>  \t<li>Recorte y rotación</li>  \t<li>Pincel corrector</li>  \t<li>Eliminación ojos rojos</li>  \t<li>El pincel</li>  </ul>", 
    "end_date": null, 
    "title": "Fotografía: Camera RAW", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177594_466f.jpg", 
    "course_url": "https://www.udemy.com/fotografia-camera-raw/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-06T00:28:22Z"
}