{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Machen Sie mehr aus Ihren Bildern – mit den Profiwerkzeugen der Google Nik Collection und den Techniken in diesem Video-Training. Maike Jarsetz zeigt Ihnen Film für Film, wie Sie Lightroom und Photoshop mit der Google Nik Collection erweitern, und stellt Ihnen alle Plug-ins im Praxiseinsatz vor. An eindrucksvollen Bildbeispielen erfahren Sie, wie Sie die Farben in Ihren Fotos zum Strahlen bringen, edle Schwarzweiß-Looks erzeugen, Ihre Bilder auf den Punkt schärfen und Bildlooks gestalten. Ein unverzichtbarer Praxiskurs für Fotoenthusiasten!</p>\n\n\n\n<ul><li><strong>Alle Plug-ins der Nik Collection im Praxiseinsatz erklärt\n</strong></li><li><strong>Professionelle Bildlooks, Effekte, Farbkorrektur und Schärfe\n</strong></li><li><strong>Für alle Anwender von Lightroom und Photoshop (ab CS6)</strong><br>\n</li></ul>\n\n<p><br>Maike Jarsetz ist ausgebildete Fotografin und Adobe Certifed Expert. Sie arbeitet als selbstständige Trainerin, Designerin und Beraterin im Bereich Fotografie und Fotodesign. Zu ihren Kunden zählen Firmen wie PhotoDisc, Digital Vision, Getty Images sowie Druckereien, Agenturen und Fotografenverbände. Sie gehört zu den führenden Lightroom- und Photoshop-Experten und gibt viele Workshops und Seminare. In ihren Video-Trainings gibt sie die Antworten und viele Tipps, die sich in der Praxis bewährt haben.</p>", 
    "end_date": null, 
    "title": "Google Nik Collection – Bildlooks für Fotoenthusiasten", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/878006_87c9.jpg", 
    "course_url": "https://www.udemy.com/google-nik-collection/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-14T16:21:45Z"
}