{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t  Si crees que una vez que has terminado capturar imágenes o vídeos con tu cámara GoPro ya tienes el trabajo hecho, estás muy equivocado, el trabajo no ha hecho más que empezar.<br>  \t  Aunque hayas capturado la imagen de tu vida por lo general necesitarás aplicar a tu vídeo un toque de personalidad, ya sea añadiéndole simplemente un título, música, corrección del color, filtros, transiciones, etc..</p><p>  \t  Este curso te enseñará, desde lo más <strong class=\"redactor-inline-converted\">básico</strong>, como puede ser instalar el software necesario en tu equipo a cómo importar tus imágenes y vídeos a <strong class=\"redactor-inline-converted\">GoPro Studio</strong>.</p><p>Al concluir el curso habrás aprendido a editar rápidamente tus creaciones con GoPro Studio, la herramienta gratuita que hará tú vida más fácil. Y sino es así podrás devolver el curso en un plazo de <strong class=\"redactor-inline-converted\">30 días</strong> y recuperar la totalidad de tu dinero. Pero estoy tan pero tan segura que el curso te será de muchísima utilidad que no querrás devolverlo, además si te inscribes y tienes alguna duda podrás preguntarme e intentaré resolver <strong class=\"redactor-inline-converted\">TODAS tus dudas </strong>en un plazo aceptable de tiempo :)</p><p>  \t<br>  \t  Además, te imaginas la cara que se les quedará a tus familiares y amigos al compartir tus películas con ellos y decirles que lo has hecho tú. Se asombrarán ante la profesionalidad y calidad de tus vídeos.<br>  \t<br>  \t  Aprenderás a <strong class=\"redactor-inline-converted\">recortar trozos de clips</strong> no deseados, eliminar el <strong class=\"redactor-inline-converted\">efecto ojo de pez</strong>, a <strong>mejorar el color y el contraste de tus vídeos, aplicar transiciones entre clips, efectos de slow y fast motion</strong>...<br>  \t<br>  \t  Cuando hayas terminado al 100% este curso podrás exportar películas e imágenes, compartir en las redes sociales, con amigos, familiares, sin miedo a que se rían de ti... porque para entonces ya serás un profesional en la edición de vídeo con GoPro Studio. </p>", 
    "end_date": null, 
    "title": "GoPro Studio Edición de vídeo para principiantes", 
    "price": "20.00", 
    "instructors": "Roxana Falasco", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292132_1341_3.jpg", 
    "course_url": "https://www.udemy.com/gopro-edicion-video/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-02T04:45:09Z"
}