{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t     Have you ever had those Kodak moments or funny home videos that you were so excited to immortalize? Most of us figure saving these precious moments on our computers will keep them with us forever. Nobody ever thinks that one day that hard drive could crash. This is a surprisingly common occurrence.  </p>  <p>  \t<strong style=\"\">Did you know 20% of hard drives fail in the first 4 years</strong>, and that this percentage steadily increases every year? All hard drives fail at some point, usually with little or no warning. In an instant, you can lose years of memories that you can never share with the next generation.  </p>    <p>  \tYou know you&#039;re supposed to backup your hard drive, and you&#039;ve heard about the unlimited storage space available on the cloud, but where do you start?  </p>  <p>  \tWith this beginner&#039;s course, <strong style=\"\">saving all your priceless memories on the cloud</strong> couldn&#039;t be more easy. This course helps you to backup all of your photos and videos to the cloud in a few easy steps, so that no matter what happens to your computer or even your home, your memories will be <strong style=\"\">safe and easily accessible</strong>.  </p>  <p>  \tI have been in the computer industry for over 10 years. I have seen people lose thousands of photos and videos needlessly. You don&#039;t have to be one of those unfortunate souls. Sign up for this beginner&#039;s course and <strong style=\"\">learn the quick steps</strong> you can take to save the memories that are dear to you. Backing up videos and photos is as easy as A-B-C. Take this course and let me show you how to save a ton of money by doing this yourself.  </p>  <p>  \tThe course is packed with detailed steps on how to use Google+ Auto Backup, and <strong style=\"\">how to automatically backup your photos and videos</strong>. It is a course that will have value for generations. Google will give you <strong style=\"\">free, secure cloud backup</strong> and <strong style=\"\">unlimited storage</strong> for your photos and videos.  </p>  <p>  \tSo, why bother paying for this course, when the program you use is free? Well, not everyone is techno-savvy, and that&#039;s OK. With this beginner&#039;s course you can save the time and frustration of trying to pin down kids who don&#039;t have the time or patience to teach you. Your videos and photos are priceless, <strong style=\"\">why depend on someone else to back them up for you? </strong>  </p>  <p>  \tPlus, the problem solving skills you learn can be applied to other computer issues.  </p>  <p>  \tWith this course you will:  </p>  <ul style=\"\">  \t<li>Get the answer to the most daunting of questions: “What is The Cloud?&quot;</li>  \t<li>Learn how to backup your photos and videos online.</li>  \t<li>Learn how to restore your photos and videos back onto your computer after a crash.</li>  \t<li>Learn the process for both Mac and Windows PCs.</li>  \t<li>Set up your photos to be backed-up once, and forget it is even there!</li>  </ul>  <p>  \tThis course comes with a <strong style=\"\">50 page eTextbook</strong> in PDF format that covers all the steps in detail. This eTextbook also explains the jargon and answers frequently asked questions.  </p>  <p>  \tAdditionally, you have <strong style=\"\">100% money back guarantee for 30 days</strong> after you buy this course, which I&#039;m confident you won&#039;t need. An added bonus is you&#039;ll be done with this course in an hour.  </p>  <p>  \t<em style=\"\">Please Note: This is a course for beginners. While everyone can benefit from it, it is designed for beginning and intermediate level computer users.</em>  </p>", 
    "end_date": null, 
    "title": "How to Automatically Backup Your Photos Online for Beginners", 
    "price": "20.00", 
    "instructors": "Andrew Morgan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343454_da9a_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-automatically-backup-your-photos-online/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T18:16:32Z"
}