{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t      Do you get overwhelmed while using your DLSR? Do you want to take great pictures of your family and friends but just don&#039;t know what all those buttons do? Then this class is for you! I will teach you how to not be afraid of your camera and how to capture a beautiful image.  </p>  <p style=\"\">  \t    In plain English, I will explain what all those buttons on your camera do, how to use them and when. You will also learn that photography uses both the right side and the left side of your brain and that in addition to learning about your camera and all of the technical things that go along with it, you&#039;ll need to understand how to be creative, what is good composition and how to use proper lighting. This class is all about putting those two aspects together to take beautiful images of your loved ones that you will cherish forever.  </p>  <p style=\"\">  \t    Here are just some things you&#039;ll learn in this class:  </p>  <ul style=\"\">  \t<li style=\"\">How to shoot in manual mode and why you want to.</li>  \t<li style=\"\">About aperture and shutter speed and how they affect your images.</li>  \t<li style=\"\">About ISO and White balance. </li>  \t<li style=\"\">How to make your images look amazing with composition and lighting. </li>  \t<li style=\"\">The basics of photo editing to make your images look professional.</li>  </ul>  <p style=\"\">  \t      This class has six different lessons and each lesson comes with an assignment, helping you improve your skills. From these assignments, you&#039;ll actually learn by doing instead of just watching.  </p>  <p style=\"\">  \t    The course is designed to take 6 weeks long, but you may go as fast or slow as you&#039;d like.  </p>  <p style=\"\">  \t    As a bonus, I&#039;ve included in this course an article about the different lenses, what they&#039;re used for and the benefits and drawbacks of each. I&#039;ve also included an &quot;On the Go Cheat Sheet&quot; you can download, print and use while you are shooting for easy reference.  </p>  <p style=\"\">  \t    By the end of this course, you&#039;ll no longer be afraid of all of those intimidating buttons on your camera and be able to confidently take beautiful photographs.  </p>", 
    "end_date": null, 
    "title": "How to Shoot Your Friends and Family and Get Away with it. ", 
    "price": "20.00", 
    "instructors": "Wendi Lee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/115830_009f_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-shoot-your-friends-and-family/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-06T01:32:53Z"
}