{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Lightroom CC + 6 mastery course.  A complete guide to Lightroom 6 &amp; CC. Everything you need to know to use Lightroom cc + 6. From organizing and editing your images to sharing via printing, slideshows and more. </p><p>You'll learn how to use all 7 modules; Library, Develop, Map, Book, Slideshow, Print and Web.  <em>Course updated with all new videos and audio as of March, 2016</em><em>.</em></p><p><strong>RAVE REVIEW!  This testimonial sums up all the courses I provide...</strong></p><p>\"<em>The content of the course is perfectly structured and expertly delivered. The flow of the content builds knowledge and skills in a logical fashion. Chris has a really good presentation style. Of key importance, when students ask questions, Chris answers them in a thorough and comprehensive manner. Highly recommended. Regards.</em>\" ~ Mick<br></p><p>Includes photos you can use to follow along and additional free resources (presets and templates).  I've been using Lightroom since version 1 and use it daily for my photography business.<br></p><p>I'll share my personal insight, techniques and recommendations for properly using Lightroom.  Join me, with other students, in the Udemy discussion area for additional questions and assistance on Lightroom CC + 6.  It's like having your own personal Lightroom coach.</p><p>Adobe Photoshop Lightroom 6 + CC is designed for photographers.  It provides you the ability to organize, edit and manage your photos like no other software.  The Lightroom 6 tutorials start off explaining what Lightroom is, what catalogs are and how many you should consider having.  Then we'll dissect the interface and learn how to customize for our own personal preference.  From there, you can follow along as we import photos, organize and do advanced searches.  Once your organized, we'll explore all the options for creating works of art by editing in the Develop module.  Use the provided photos, to follow along as we create basic and advanced edits.  Once you've completed your edits, we'll move onto sharing your photos with the world.  Learn how to create slideshows and web galleries.  Plus, we'll learn how to properly take your photos out of Lightroom and export for prints!</p><p>Once you've completed the Lightroom video tutorials you'll have a full understanding of how to use Lightroom properly and productively.</p><p><br></p><p>At some point, the Udemy system will ask you for a review about this course. Please understand that it is Udemy asking and not me (Chris Parker, your instructor). I do not agree with asking for a review so early (it's out of my control) in the course and ask that if you're not ready to give a review, please do so only when you're ready. I appreciate all feedback and use it to improve my courses.</p><p>I Hope your enjoying the course thus far. Please contact me anytime for additional questions/support. I'm here to help you achieve your learning goals and looking forward to your success.</p><p>Yes, I really do care AND answer ALL questions. :)</p>", 
    "end_date": null, 
    "title": "Lightroom CC + 6 Master Adobe Lightroom & Be More Productive", 
    "price": "50.00", 
    "instructors": "Chris Parker", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557194_faae.jpg", 
    "course_url": "https://www.udemy.com/master-adobe-lightroom-6-in-1-day/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T13:46:16Z"
}