{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Lightroom 5.  A complete guide to Lightroom 5. Everything you need to know to use Lightroom 5. From organizing and editing your images to sharing via printing, slideshows and more.</p><p>Includes photos you can use to follow along and additional free resources (presets and templates). I've been using Lightroom since version 1 and use it daily for my photography business.<br></p><p>I'll share my personal insight, techniques and recommendations for properly using Lightroom. Join me, with other students, in the Udemy discussion area for additional questions and assistance on Lightroom 5. It's like having your own personal Lightroom coach.</p><p>Adobe Photoshop Lightroom 5 is designed for photographers. It provides you the ability to organize, edit and manage your photos like no other software. The Lightroom 5 tutorials start off explaining what Lightroom is, what catalogs are and how many you should consider having. Then we'll dissect the interface and learn how to customize for our own personal preference. From there, you can follow along as we import photos, organize and do advanced searches. </p><p>Once your organized, we'll explore all the options for creating works of art by editing in the Develop module. Use the provided photos, to follow along as we create basic and advanced edits. </p><p>Once you've completed the Lightroom video tutorials you'll have a full understanding of how to use Lightroom properly and productively.</p>", 
    "end_date": null, 
    "title": "Lightroom 5, Master Adobe Lightroom 5 & Be More Productive", 
    "price": "20.00", 
    "instructors": "Chris Parker", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592884_3ad3_2.jpg", 
    "course_url": "https://www.udemy.com/master-adobe-lightroom-5-be-more-productive/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T12:59:15Z"
}