{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong><em>Everything you need to turn ordinary photos into impressive masterpieces</em></strong>\n\n  </p>\n\n<ul><li>Whopping 15 Hours of Expert Instruction\n\n</li><li>More than 120 Individual Video Tutorials\n\n</li><li>Course starts right at the very beginning\n\n</li><li>Everything is explained in clear detail\n\n</li><li>Full coverage of basic functions in Photoshop Elements 14\n\n</li><li>How to use Photoshop Organizer efficiently\n\n</li><li>Where to get great content\n\n</li><li>Printing your photos so they look professional\n\n</li><li>Working miracles with the Editor\n\n</li><li>Speeding your projects with Quick Mode\n\n</li><li>Practical retouching and enhancing techniques</li><li>Includes exercise files to practice what you’ve learned</li></ul>\n\n<p>\n\n</p>\n\n<p><strong>Adobe Photoshop Elements 14 For Beginners</strong>\n\n  </p>\n\n<p>We've all seen amazing photos of models, natural scenes, and events that look absolutely perfect. Somebody will say \"<em><strong>It's been Photoshopped!</strong></em>\" Now you can have the advanced skills required to use Photoshop Elements 14 like a pro. This big 15 hour course starts right at the very beginning showing you how to download the software and get it going. Then we carefully walk you through each and every step toward becoming a true Photoshop power user. Use these skills for your job, your hobby, or even start a new business.\n\n  </p>\n\n\n\n<p>Many Photoshop courses are designed for people who have some experience using the application. While this course will be very useful to students with experience, it was designed for the person who has never worked with Photoshop before and knows nothing about it.\n\n  </p>\n\n\n\n\n\n<p><strong>Contents and Overview</strong>\n\n  </p>\n\n\n\n\n\n<p>This course starts right at the very beginning with how to get PSE14 and install it. We review what is different in Elements 14 so those who have worked with the previous version can fast forward to the new functions they need to understand. In Chapter 2 you learn start up, the all important keyboard shortcuts that will greatly speed your work, and how to get answers using Help. We also set up your preferences so you can customize PSE 14 for your use.\n\n  </p>\n\n\n\n\n\n<p>Next you learn how to use Quick Start. That is the perfect way for the beginner to see impressive results. This includes an exercise where you create a slide show worthy of a professional presentation. Next we learn the many functions of The Organizer including catalogs, media browser, timelines, instant fix, image properties and much more.\n\n  </p>\n\n\n\n\n\n<p>We cover Acquiring Content and Printing before getting to the heart of PSE 14: The Editor. This is where you learn how to create a workspace and manipulate your content for desired results. Later we look at editing in Expert Mode. Along the way we study the often used Quick Mode where you can instantly remove red eyes, add effects, textures, frames, and auto smart tone.\n\n  </p>\n\n\n\n\n\n<p>As you progress we study Guided Editing where you resize photos and perform guided edits on image properties. Later we work on filters, lighting, adding text, text effects, color effects and much more as we advance through the massive 15 hours of instruction that take you through every detail of Photoshop Elements 14.\n\n  </p>\n\n\n\n<p> \n\n <br></p>", 
    "end_date": null, 
    "title": "Master Adobe Photoshop Elements 14 For Beginners", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/845854_34e8_2.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-elements-14-training-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-11T08:49:38Z"
}