{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t Gracias a la revolución digital ahora se están experimentado nuevas formas de creación en el ámbito de la fotografía. Entre estas nuevas técnicas destacan las fotografías panorámicas que se basa en la unión de 2 o más fotografías para generar una única foto.  </p>  <p>  \tEn este curso aprenderemos a realizar estas fotografías de la forma más exitosa y además veremos los elementos necesarios para la realización de las mismas.  </p>  <p>  \tAdobe Photoshop es el nombre o marca comercial oficial que recibe uno de los programas más populares de la casa, Adobe Systems, junto con sus programas hermanos Adobe Illustrator y Adobe Flash, y que se trata esencialmente de una aplicación informática en forma de taller de pintura y fotografía que trabaja sobre un &quot;lienzo&quot; y que está destinado para la edición, retoque fotográfico y pintura a base de imágenes de mapa de bits.  </p>  <p>  \tEste curso es impartido por Rodrigo Erades, experto en los campos de desarrollo web y en fotografía. Maneja diferentes lenguajes y programas de desarrollo web como html5, css3, action script y programación para Adobe Flash. Freelance desde 2006 en ambos campos ha trabajado para clientes como e grupo PRISA, el país, as, cinco días, cadena SER o canal plus. En el campo de la fotografía ha trabajado para SEUR, remodelando su imagen corporativa y en otros proyectos como el de Vision Lab.  </p>", 
    "end_date": null, 
    "title": "Panorámicas con Photoshop", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177586_e44d.jpg", 
    "course_url": "https://www.udemy.com/panoramicas-con-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-06T00:11:01Z"
}