{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Dozentin ist Maike Jarsetz: Sie arbeitet als Trainerin für Unternehmen wie Adobe und Wacom und zählt zu den führenden Experten für Lightroom.</strong><br></p><p>Lassen Sie sich in über 100 Videos zeigen, wie Sie Lightroom richtig einsetzen. Lernen Sie nicht nur besonders anschaulich alle Werkzeuge, Menüs und Regler kennen. Profitieren Sie auch von vielen Tipps, mit denen Sie Ihre Bilder besonders gut verwalten und entwickeln. Zur Bibliothek, zur Entwicklung, zu RAW-Bildern, Metadaten und Katalogen – in diesem Video-Training finden Sie Antworten auf Ihre Fragen und Lösungen, die sofort weiterhelfen. Ganz einfach zum Zuschauen und Mitmachen!<br></p>\n\n<p><strong class=\"redactor-inline-converted\">- Lernen Sie Lightroom einfach durch Zuschauen</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">- Alle Werkzeuge verstehen und richtig anwenden</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">- So holen Sie alles aus Ihren Bildern heraus</strong></p>\n\n\n\n<p>Maike Jarsetz ist ausgebildete Fotografin und Adobe Certifed Expert. Sie arbeitet als selbstständige Trainerin, Designerin und Beraterin im Bereich Fotografie und Fotodesign. Zu ihren Kunden zählen Firmen wie PhotoDisc, Digital Vision, Getty Images sowie Druckereien, Agenturen und Fotografenverbände. Sie selbst veranstaltet die Hamburger Photoshop- und Lightroom-Tage. Maike Jarsetz gehört zu den führenden Lightroom-Expertinnen und gibt viele Workshops und Seminare. Aus ihren Schulungen kennt sie die Fragen vieler Anwender. In ihren Video-Trainings gibt sie die Antworten und viele Tipps, die sich in der Praxis bewährt haben.<br></p>", 
    "end_date": null, 
    "title": "Photoshop Lightroom 6 und CC: Lerne alles zur neuen Version", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/488772_8e6e.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-lightroom-6-und-cc-das-umfassende-training/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-28T18:19:40Z"
}