{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong></strong></p>\n\n<p><strong>Photoshop for Beginners: Easy Double Exposure Effect<br></strong></p>\n\n<p>I have designed this course to teach you how to use Photoshop to create your own unique digital artwork. <strong>If you want to learn how to create digital illustrations that you can sell with great profit on image stocks like Shutterstock, Istock or Alamy - take this course!</strong><br></p>\n\n<p><br></p>\n\n<p>I will show you most effective Photoshop tricks to achieve great results in a short time.</p>\n\n<p>By the end of the course you will learn great non-destructive Photoshop techniques: you will be able to remove your subject from the background, artisticly combine multiple layers in one image and apply layer adjustments. </p>\n\n<p>I strongly encourage you to experiment with your own ideas and to modify techniques that you are going to learn to create workflow that suits best your artistic needs.</p>\n\n<p><br></p>\n\n<p>Enrollment in this course includes access to follow-along lectures where you will learn the most effective way: in practice.<br></p>\n\n<p><strong>Joining for the course also includes</strong><br></p>\n\n<ul><li>Access to the discussion forums</li><li>Access to all future lectures that will be added to this course (that may be a result of questions from the discussions forums) or new techniques related to portrait photography</li><li>Discount coupons for other new courses that I launch</li></ul>\n\n<p><strong>See my bio on this page for more of my educational and professional background. </strong>Links to my portfolio are available in the last Lecture of the course.</p>\n\n<p><strong>What else?</strong><br></p>\n\n<p>Except the knowledge, You are going to get the lifetime access to all the high quality <strong>Supplementary Materials </strong>used in the Course.</p>\n\n<p><br></p>\n\n<p>Go Create!</p>\n\n<p>Kasia Zmokla</p>", 
    "end_date": null, 
    "title": "Photoshop for Beginners: Easy Double Exposure Effect", 
    "price": "20.00", 
    "instructors": "Kasia Zmokla", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/745044_ccae_2.jpg", 
    "course_url": "https://www.udemy.com/photoshop-cc-double-exposure-photo-manipulation-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-28T18:20:51Z"
}