{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Photoshop CC: Digital Art Pro Techniques - Become an Artist!</strong></p><p>I have designed this course to teach you how to use Photoshop to create your own unique digital artwork. <strong>If you want to learn how to create digital illustrations that you can sell with great profit on image stocks like Shutterstock, Istock or Alamy - take this course!</strong><br></p><p>I strongly encourage you to experiment with your own ideas and to modify techniques that you are going to learn to create workflow that suits best your artistic needs. </p><p>In <strong>Sections <strong>3-7</strong></strong> of the course I will walk you through all basic Photoshop tools that are useful while working on a digital artwork - you will have clear understanding of layers, layers blending modes, masks and adjustments. </p><p>By the end of the 7th section you will feel confident with image manipulation in Photoshop using various creative techniques. You will be able to enhance the desired artistic effect by using the Adjustment Layers in flexible way.</p><p>In the <strong>Section 8</strong> I will show you full creative process, clearly explaining step by step all the applied techniques. You will have lifetime access to complete set of high quality assets used to create the digital artwork. The tutorial is meant to give you a comprehensive introduction to creative digital photo manipulation while following along with my process.<br></p><p>In this course I am going to share with you the techniques and tips I am using to create my artistic prints. During the few hours of my workflow you will get the skills that allow you to fully express your creativity.</p><p>Enrollment in this course includes access to hours of follow-along lectures where you will learn the most effective way: in practice.</p><p><strong>Joining for the course also includes</strong><br></p><ul><li>Access to the discussion forums</li><li>Access to all future lectures that are added to this course (that may be a result of questions from the discussions forums) or new techniques related to portrait photography</li><li>Discount coupons for other new courses that I launch</li><li>Besides over 3,5 hours of lectures, I also include quizzes to assess your learning, and some helpful handouts on Photoshop Keyboard Shortcuts, RGB Color Mode and Layer Blend Modes.</li></ul><p><strong>See my bio on this page for more of my educational and professional background. </strong>Links to my portfolio are available in the last Lecture of the course.</p><p><strong>What else?</strong><br></p><p>Except the knowledge, You are going to get the lifetime access to all the high quality <strong>Supplementary Materials </strong>used in Sections 3-7.</p><p>Enjoy the Course!<br></p><p>Kasia Zmokla</p><p><br></p>", 
    "end_date": null, 
    "title": "Photoshop CC: Digital Art Pro Techniques - Become an Artist!", 
    "price": "35.00", 
    "instructors": "Kasia Zmokla", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/701608_5c03_3.jpg", 
    "course_url": "https://www.udemy.com/photoshop-learn-digital-art-pro-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-19T17:12:59Z"
}