{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Start editing your own photos with one of the best PC and Mac photo editing software out there, PhotoDirector!</strong></p><p>If you're looking for a easy photo editing application that will allow you to edit professional quality photos, Cyberlink's PhotoDirector is a great tool. This course will teach you everything you need to know to get started editing.</p><p><strong>Make photos look the way you envision - better! </strong>If you want to crop, white balance, adjust contrast, add effects, and share better photos than ever, this is the course for you.<br></p><p><strong>Here are the main topics in this course:</strong><br></p><ul><li>Easily import and organize photos in PhotoDirector</li><li>Crop and rotate your photos</li><li>Apply one-click presets</li><li>Correct white balance</li><li>Adjust tone, add HDR effects, change contrast</li><li>Apply edits to only certain parts of your photos</li><li>'Beautify' people with teeth whitening, eye brightening, wrinkle removing, and body shaping</li><li>Remove unwanted objects in your photos</li><li>Merge photos, create panoramas, and face swap to get the best smile</li><li>Add custom watermarks to your photos</li><li>Create slideshows out of your photos</li><li>Publish photos easily to Facebook and Flickr</li><li>Export high quality files for sharing and printing</li></ul><p><strong>Why is this the course that will make you successful?</strong><br></p><p>Taking online courses isn't easy. It takes work and action. This course will help you succeed with concrete practice lessons. We'll walk you through each exercise. By the end of the course, you'll have a fully edited video montage that you can share with the world.</p><p><strong>Who teaches this course?</strong><br></p><p>Phil Ebiner is a professional photographer and video creator who has edited thousands of photos. His photos have won international contests, sold in art galleries, and captured stories around the world. Phil strives to teach students not only the technical skills of a photo editor with this course, but also the philosophy of photo editing. You'll love learning from Phil like thousands of other Udemy students.</p><p><em><strong>Are you ready to be successful?</strong></em><br></p><p><em><strong>Are you ready to edit professional-looking photos?</strong></em></p><p>Enroll now!</p>", 
    "end_date": null, 
    "title": "Professional Photo Editing with Cyberlink PhotoDirector", 
    "price": "50.00", 
    "instructors": "CyberLink Software, Phil Ebiner", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750256_d9fc.jpg", 
    "course_url": "https://www.udemy.com/professional-photo-editing-with-cyberlink-photodirector/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T16:32:16Z"
}