{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t  Retoque de retratos con Photoshop  y la filosofía de la mejora de la imagen con la fotografía digital. Mejorando la imagen capturada.  </p>  <p>  \t   Adobe Photoshop es el nombre o marca comercial oficial que recibe uno de los programas más populares de la casa, Adobe Systems, junto con sus programas hermanos Adobe Illustrator y Adobe Flash, y que se trata esencialmente de una aplicación informática en forma de taller de pintura y fotografía que trabaja sobre un &quot;lienzo&quot; y que está destinado para la edición, retoque fotográfico y pintura a base de imágenes de mapa de bits.  </p>  <p>  \t  Curso impartido por Roberto Desiré. Fotógrafo experto en postprodución digital y decente tanto de fotografía analógica como digital. Utiliza Camera Raw, Photoshop y Phocus de Hazel indistintamente para fotografía, after effects y final cut para video y Cinema 4D y posser para imagen de sísntesis. Lleva más de 20 años dedicado al mundo de la fotografía profesional en diferentes campos, desde el industrial hasta editorial pasando por la publicidad.  </p>  <p>  \t  En este curso cubriremos los siguientes temas:  </p>  <ul>  \t<li>Estrategias a la hora de afrontar retoques digitales de retratos</li>  \t<li>Ajustes primarios y tonales de Camera Raw</li>  \t<li>Balance de blancos</li>  \t<li>Trabajo por lotes y retoque en camera raw</li>  \t<li>Tono y saturación</li>  \t<li>Aclarado de sombras</li>  \t<li>Pincel corrector puntual</li>  \t<li>Blanqueado de dientes</li>  \t<li>Alisado de la piel</li>  \t<li>Filtros para modificaciones morfológicas</li>  \t<li>Modificaciones estructurales y morfológicas</li>  \t<li>Ampliación de la gama tonal o falso HDR</li>  \t<li>Ajustes con curvas</li>  \t<li>Contrastes con la capa de ajustes de blanco y negro</li>  \t<li>Técnicas de enfoque</li>  </ul>", 
    "end_date": null, 
    "title": "Retoque de retrato (Ps)", 
    "price": "35.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177408_e2f5.jpg", 
    "course_url": "https://www.udemy.com/retoque-de-retrato-ps/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-05T17:50:23Z"
}