{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>The leading drone / aerial videography course on Udemy.  Check it out to see why.....</strong></p>\n\n<p><strong>WHAT? - This course's focus is on how to make stunning aerial productions both from filming with a drone initially and then from impactful editing afterwards.</strong></p>\n\n<p>  \t<strong>WHO IS IT FOR? - For</strong> <strong>videographers</strong>, <strong>photographers</strong>, <strong>hobbyists</strong> <strong>and</strong> <strong>professionals</strong> <strong>alike that want to learn how to make amazing aerial videos and photos.</strong>  </p>\n\n<p>  \t                                \"<strong>Packed with Detailed Instruction</strong>  </p>\n\n<p>  \t<em>Bruce is an exceptional aerial filmmaker and an exceptional teacher. The level of detail in this course is outstanding. If you are serious about using drones to tell better stories in your productions, this course is for you! Bruce will teach about how to use the tool of a multirotor to move the camera in ways that may not be obvious but can have a big impact on your productions. This is a premium quality filmmaking course for the age aerial photography and videography.</em>\" ★★★★★ <strong>Mark Richardson</strong>  </p>\n\n<p>  \t<strong>-------------------------------------------------------------</strong>  </p>\n\n<p>  \t                Have you seen stunning aerial videos and photos and wondered how is that done? Perhaps you have a drone already and want to take your aerial productions to the next level for your hobby or business? This extensive course will take you on a journey all the way through from discussing<strong>; the merits of different drone types for aerial production;</strong> <strong>some</strong> <strong>basic flying skills for aerial imagery</strong>, to <strong>THE MAIN FOCUS OF THE CONTENT;</strong> a unique, <strong>structured</strong> <strong>way of thinking</strong> about, <strong>planning </strong>for<strong>, filming</strong> and then <strong>editing</strong> your <strong>standout aerial production</strong>. It will become a <strong>resource</strong> for you as well as a <strong>course</strong>.  </p>\n\n<p>  \t<strong>Stunning Aerial Productions Using Both a Drone and Editing Techniques</strong>  </p>\n\n<ul>  \t<li><strong> Basics</strong> - Legal, Safety, Planning &amp; Some Core Flying Skills For Producing Aerial Imagery</li>  \t<li>A <strong>Unique, Structured Method</strong> To Guide Your <strong>Filming</strong> and <strong>Flying</strong> For Getting Impactful Footage</li>  \t<li><strong>25 Design Principles</strong> For Creating Captivating Productions</li>  \t<li><strong>8 Step Editing Workflow</strong> for Developing Your Final Product</li>  </ul>\n\n<p>  \t<strong>The Time To Make Stunning Aerial Imagery Is Now</strong>  </p>\n\n<p>  \t                                                                                                                                                                                        The ability to video and photograph the world from a unique, breathtaking, aerial perspective, using a drone is now available to all. The opportunities this presents for videographers, photographers, hobbyists and professionals alike is extraordinary.  </p>\n\n<p>  \t                                                                                                                                                                                        There is a need to learn how to make <strong>standout</strong> aerial productions, to make imagery that will <strong>go beyond what will become the ordinary</strong>. <strong>Mastering</strong> these new tools <strong>now</strong>, to produce <strong>highly impactful results</strong>, will get you <strong>ahead of the game professionally</strong> and give you <strong>endless hours of enjoyment personally</strong>.  </p>\n\n<p>  \t<strong>Content and Overview</strong>  </p>\n\n<p>  \t                                                                                                                                                                                    This course covers basics from selecting your drone, editing software and aerial camera. It has some guidance on initial flying skills and exercises for producing good aerial productions.  </p>\n\n<p>  \t                                                                                                                                                                                    The course then goes beyond the basics and introduces, with extensive aerial footage to illustrate the points, a unique framework to guide all your flying and filming missions. This focusses on the extraordinary outcomes you should be aiming for in your aerial imagery and the flying you should be doing to get those outcomes.  </p>\n\n<p>  \t                                                                                                                                                                                    You are then taught how to plan your flying and filming missions using this framework. You are taken through a range of unique in-course and online tools &amp; resources to aid you in this planning. You will learn through a real example to show you how to apply the framework and tools to plan a successful flight.  </p>\n\n<p>  \t                                                                                                                                                                                You will then learn how to take the aerial footage and turn it into a stunning video production. You will be introduced to 25 design principles to follow and a software-generic 8 step editing workflow. This will be demonstrated by using Final Cut Pro X, but much of the demonstration will concentrate on how to apply the design principles and framework to guide the creation of the aerial video.  </p>\n\n<p>  \t<strong>What is this course NOT for</strong>? Though the course touches on some things to look into from a <strong>legal</strong> and <strong>safety</strong> perspective the course is not designed to be a guide on your local drone laws or how to fly &amp; film safely. These are areas that you must know already or that you must go and master before considering implementing any of the techniques in the course. Also - the course is not hardware specific and is not designed to teach you about how to set up any of your own <strong>drone hardware</strong> or specific handling skills for that hardware.  </p>\n\n<p>  \t<strong>Music Credit:</strong> to Promo Video - Peace by Redman, licensed under the CC BY licence - see tinyurl.c om/RedmanPeace  </p>", 
    "end_date": null, 
    "title": "Stunning Aerial Videography and Photography Using Drones", 
    "price": "30.00", 
    "instructors": "Dr Bruce Geddes", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/335544_a63c_3.jpg", 
    "course_url": "https://www.udemy.com/drones-aerial-videography-and-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-04T10:08:36Z"
}