{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t  Are you new to Photoshop Elements?  Do you need to learn what’s new in one of the latest software versions? Do you want to improve your images so they look spectacular? Now you can. <strong>You no longer need to take “</strong><em><strong>the perfect shot</strong></em><strong>” to get incredible results</strong> when you use Photoshop Elements.  </p>\n\n<p>  \t                      In our Ultimate Photoshop Elements Bundle, you’ll discover how to turn your photos into masterpieces. We combined <strong><em>5 popular Adobe Photoshop Elements courses</em></strong> into one comprehensive bundle consisting of <strong>over 65 hours</strong> of training.  </p>\n\n\n\n<p>  \t                      Watch as your professional trainer shows you how to navigate the Adobe Photoshop Elements interface and introduces you to its enhanced features. Learn basic techniques for photo correction in addition to more advanced topics. Discover practical tips and tricks for retouching and enhancing images such as correcting skin blemishes and teeth color, clearing red eyes, using filters, fixing lighting exposure, and much more.  </p>\n\n\n\n<p>  \t                      Get ready to make your photos look amazing!  </p>\n\n\n\n<p>  \t<em><strong>\"People thought my Photoshop purchase was a joke—that is, until they saw my photos!\"</strong></em>  </p>\n\n\n\n<p>  \t<strong>Courses Included with this Bundle:</strong>  </p>\n\n\n\n<ul>  \t<li><strong><em>Master Adobe Photoshop Elements 14 </em>– 15 hours of video tutorials</strong></li><li><strong><em>Learn Adobe Photoshop Elements 13 </em>– 15 hours of video tutorials</strong></li>  \t<li><strong><em>Learn Adobe Photoshop Elements 12</em> – 14 hours </strong><strong>of video tutorials</strong></li>  \t<li><strong></strong><strong><em>Learn Adobe Photoshop Elements 11</em> – 12 hours </strong><strong>of video tutorials</strong></li>  \t<li><strong></strong><strong><em>Learn Adobe Photoshop Elements 10</em> – 12 hours </strong><strong>of video tutorials</strong></li>  </ul>\n\n\n\n<p>  \t<strong></strong>  </p>\n\n\n\n<p>  \t                      Where else can you find so many hours of Photoshop Elements training? We truly take the mystery out of digital photo enhancement! You will gain tremendous peace of mind knowing your training needs will be covered for a very long time.  </p>\n\n\n\n<p>  \t                      Sign up and start learning today!  </p>\n\n\n\n<p>  \t<strong>What people are saying:</strong>  </p>\n\n\n\n<p>  \t<em>“Fantastic introduction to PSE12. I was a complete novice to Photoshop, and having struggled trying to understand it i decided to try an on line course. A few free Udemy courses assumed you knew about the principles already, so i wasn't getting a proper grounding. This course answered all my needs!! The lecturer worked at 'my pace' and taught in a way that made it easy to understand and learn. Thanks for a Great Course.”- </em> <strong>Peter Tripp</strong>  </p>\n\n\n\n<p>  \t<em>“I have always wanted to learn PSE! I enthusiastically bought the program and a book to teach myself with no problem, but learning it on my own just didn't work. The program is just too overwhelming for a solo mission. The instructor has a pleasant voice and speaks clearly. Menu items and screens are explained in an orderly fashion that you can actually remember. I'm still taking the class and really like that I can go back and review something if I forget how to do it. Another thing I appreciate is the professionalism of the instructor. He is fast paced but then again very easy to follow along.”</em>-<strong> Penny Owings</strong>  </p>\n\n\n\n<p>  \t<em>“Clear, beautifully spoken and right to the point. I love PSE but find it a challenge to keep up with all with the changes to the bells and whistles during upgrades. Simon Sez IT makes it so much easier” </em>- <strong>John De Coque</strong>  </p>\n\n\n\n<p>  \t<em>“This course does just what I said in the title, provides a solid foundation for using Elements 10. I've been using Photoshop but I would always seem to run into problems performing some of the tasks i was interested in. This course has provided me the most useful instructions i have come across. Laid out with thorough, well-illustrated and easily understood lessons. This is the first course that I have ever used from Simon Sez, but I will certainly consider trying others. Thanks! </em><strong>- D.C. Davis</strong></p>\n\n<p><strong>* This course was updated May 2016 with the PSE 14 course added to the bundle.</strong><br><strong></strong>  </p>", 
    "end_date": null, 
    "title": "The Ultimate Photoshop Elements Training Bundle - 65 Hours", 
    "price": "50.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "71 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288992_5c9d_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-photoshop-elements-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-27T15:11:06Z"
}