{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Why can we spot a great photo but find it difficult to capture one? </strong></p><p>Why do we over complicate a process that can be summed up with a push of button? The key to taking a good photo isn't the subject matter, it's not in the type of equipment you use or the location setup for the shot. The key to taking a good photo is the <strong>discovering your personal point of view</strong> and identifying <strong>the 'thing' that hides in plain sight</strong>; this is the 'artist eye'. A Room for Improvement will teach you how to <strong>see like an artist</strong> and further your exploration into the art form of photography.</p><p>To shoot a world-class photo, your eyes must be familiar with the elements that make a photo world-class. Great musicians can hear the rhythm in everyday life. Great writers know that everyone has a story to tell. <strong>Great photos are happening all around you, and you're missing them because you haven't trained your eye.</strong> </p><p>I've spent the last 20 years working in photography, painting, sculpting and architecture - having a multidisciplinary approach allows for better photo taking. The more curious you are, the more things you learn and experience, the better the eye becomes. You have experiences that will aid you in your artistic journey with this program. </p><p>Using my work as reference we will discuss vision, approach, tools and techniques of photography.  I will teach you how to take great pictures with any camera, from your cell phone to your Leica. Armed with a camera, a pen, a pad, and your desire to improve – <strong>I will transform your photography by changing the way you see the world around you.</strong></p>  <p>  \t<strong>COURSE STRUCTURE</strong>  </p>  <ul>  \t<li>This course is divided into 5 Lectures that are a <strong>Master Class</strong> in <strong>Learning to See like an Artist</strong>.</li><li>Lecture 1:  How we see. Understanding how artists see differently.</li><li>Lecture 2:  Borrow success from famous artists.</li><li>Lecture 3:  Three techniques for spotting flaws. </li><li>Lecture 4:  A critical technique for finding light. </li><li>Lecture 5:  Why pictures succeed or fail and the assignment.</li>  \t<li>The lectures are designed to be watched in order, but you are free to skip around.</li>  \t<li>Each course is made up of a set of lectures (about 45min long), with downloadable images from the lecture, and an final assignment designed to highlight the tools from each lecture.</li></ul>  <p>  \t<strong>EXPECT RESULTS</strong>  </p>  <p>  \t         By the end of this program, you will understand why photographers always say that \"the equipment doesn't matter.\"  Learning to see like an artist is one of the single most fulfilling steps on the way to becoming a better photographer.  In addition to improving your own work, you will be able to walk into any gallery or museum in the world and know, with full certainty, whether you are looking at a great piece of art or not.</p>", 
    "end_date": null, 
    "title": "The Art of Seeing Photography training for the Artist in you", 
    "price": "20.00", 
    "instructors": "Adam Marelli", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/185280_3c07_3.jpg", 
    "course_url": "https://www.udemy.com/a-room-for-improvement/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-19T16:50:42Z"
}