{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Master the ins and outs of Sony's latest hybrid camera, the a6000. With over 3 hours of lessons intuitively organized into 120 individual bite-sized lectures, you will learn everything you need to know about the camera, giving you the confidence you need to use the camera with ease in any situation.</p><p>We will cover the following topics in this course:</p><ul><li><strong>Crash course in basic photography theory</strong> focusing on using aperture, shutter speed, and ISO to obtain proper exposure.</li><li><strong>Camera body and button functions</strong> including the mode dial, pinwheel, and hidden record button.</li><li><strong>Camera settings</strong> including high ISO noise reduction, dynamic range optimization, and the soft skin effect.</li><li><strong>Custom settings</strong> including Pre-auto focus, e-front curtain shutter, and superior automatic image extraction.</li><li><strong>Wireless settings </strong>best practices</li><li><strong>Applications</strong></li><li><strong>Playback </strong>considerations</li><li><strong>Setup procedures</strong> including cleaning mode, USB LUN setting, and recovering image from the database.</li><li><strong>Field tips</strong> including filmmakers' setup, how to read a histogram, and making the transition from photo to video.</li></ul><p>A knowledge of basic photography principals is great to have, but not absolutely necessary to taking this course. It is important to note that this class is specific to the Sony a6000 camera.</p><p>For a limited time, use the coupon code \"20off\" to receive a $20 discount!</p>", 
    "end_date": null, 
    "title": "The Unofficial Guide to Sony's a6000", 
    "price": "50.00", 
    "instructors": "Forge Productions", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711320_eee0_2.jpg", 
    "course_url": "https://www.udemy.com/the-unofficial-guide-to-the-sony-a6000/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T23:32:29Z"
}