{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>NOTE: this class is given freely to all photographers who want  to know how to use their light meter in digital photography... it is simply  produced and is more informational than glossy. It will be continuously updated  when new materials become available.</p>    <p>This course is designed for those photographers who have just  begun using a <strong>hand held light meter</strong> or who may not know what to do with their  meters. or why they are important and useful tools for making images.</p>    <p>The light meter is a device that measures the intensity of  light, whether that light is being reflected from a subject (reflected light)  or falling upon the subject (ambient or \"incident\" light). The light  meter is a tool that helps a photographer create more accuracy in exposures.</p>    <p>We take a very close look at all the ways a light meter can help  a photographer develop a stronger understanding of the light, as well as  learning how the different tonalities are expressed through a light meter.</p>    <p>Real world examples and some simple and fun exercises will help  the beginning light meter user develop good habits, and stronger lighting.</p>    <p>From reflected light readings to \"placing the  exposure\" for maximum artistic presentation to using the ambient dome for  flash in studio, this course is a simple to follow discussion of meters.</p>    <p>NOTE: We do not discuss the operation of any specific (Brand)  kind of meters. You will still be required to read your manual to find out how  to set your specific meter up, and the specific ways it works. But all meters  DO the basic same things, and that is what we discuss on this course.</p>    <p>We use video and a few PDF's to show how to use a light meter in  both reflective and ambient modes. There are three exercises to be done by the  student that will help them learn their specific meter.</p>    <p>The course should be done in order, and there is over 2 hours of  video content as well as PDF documents for your files.</p>    <p>If you are ready to learn to use a meter, to take control of  your exposure this course is for you. Many photographers will tell you that  'chimping' is all you need to do. I disagree... there are far more reasons to  use a light meter than merely exposure... and we will discuss them in this  class.</p>    <p>The class is free... enjoy and keep shooting.</p>    <p>Thank you,</p>    <p>Don Giannatti</p>    ", 
    "end_date": null, 
    "title": "Using a Photographic Light Meter", 
    "price": 0, 
    "instructors": "Don Giannatti", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36152_dd48_7.jpg", 
    "course_url": "https://www.udemy.com/using-a-photographic-light-meter/", 
    "subject_name": [
        "Photography Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-14T21:56:23Z"
}