{"selfpaced": false, "topic_name": ["Music"], "description": "\n\n                    \n                    \n                    Aprende un proceso eficiente y efectivo para escribir canciones que expresen tus ideas y emociones, incluyendo una gama de herramientas que giren alrededor del concepto de prosodia; la adecuación de letra y música para apoyar tu mensaje subyacente.\n\n                                            Syllabus\n                        Bienvenido a Composición de CancionesAl acabar esta lección, sabrás como desarrollar tus ideas de canciones para así crear un trayecto interesante de inicio a fin. Entenderás tus opciones para desarrollar el punto de vista de tu canción y será presentada a los seis mejores amigos de un autor.El viaje de una canciónHacia el final de esta lección, sabrás como desarrollar tus ideas de canciones para que estas contengan un interesante viaje de principio a fin. Entenderás tus alternativas para desarrollar el punto de vista de tus canciones y te presentaremos a los 6 mejores amigos de la Composición de Canciones.Parar y arrancarAl final de esta lección, entenderás el concepto de prosodia y como se relaciona al número de líneas/frases musicales en una sección y la longitud de línea/frases musicales. Crearás grupos de líneas/musicales estables e inestables, utilizando un número par o impar de líneas y frases musicales. Utilizando estas herramientas, escribirás un verso y un coro.GPS Sónico - Mapeando tu canción con rimaAl final de esta lección, entenderás la relación entre los esquemas de rima y la prosodia. Crearás secciones estables e inestables, utilizando diversos esquemas de rima para mostrarle a tu oído el camino a casa. Al utilizar estas herramientas, escribirás un nuevo verso y coro.Agregando movimiento Al final de esta lección entenderás los ritmos del lenguaje, es decir la diferencia entre sílabas acentuadas frente y sílabas sin acentuar, y cómo poner ritmo en tus líneas, preparándolas para unirse a la danza del ritmo musical. Usando estas herramientas, agregarás música al verso y al coro de la semana pasada.Escribir la canción (\"Hobo Wind\")En esta lección, seleccionarás un nuevo título de canción y crearás una hoja de trabajo para ayudar al desarrollo de tus ideas. Escribirás tu letra y le pondrás música, haciendo coincidir los ritmos de letra y ritmos melódicos. Crearás una melodía, usando tonos estables e inestables para apoyar tus ideas. Agregando los toques finalesAl final de esta lección, entenderás el papel del fraseo para crear el lenguaje corporal de tu canción, utilizando la relación de tus frases con los tiempos musicales para crear estabilidad o inestabilidad. Luego le darás los toques finales a tu canción de la lección 5.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Composición de canciones", "price": 0, "instructors": "Pat Pattison", "institution_name": ["Berklee College of Music"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/composicion-canciones", "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}