{"selfpaced": false, "topic_name": ["Music"], "description": "\n\n                    \n                    \n                    En este curso, «Producción musical y su efecto en la composición», exploraremos cómo el proceso de producir un proyecto musical interactúa con los elementos de la composición de la música que se está produciendo. Enrique Gonzalez Müller, profesor de Berklee College of Music, reconocido productor e ingeniero de sonido y ganador del Latin Grammy®, facilitará esta exploración, guiándonos a través de la producción de un tema musical en todas sus etapas, desde el demo hasta la versión final. Con esta experiencia, se demostrará la importancia de capturar las emociones que genera la música y plasmarlas en la grabación, maximizando los elementos originales que brinda una composición. Estudiantes de Berklee College of Music y la banda ganadora del Latin Grammy® Los Amigos Invisibles darán vida al proceso y ejemplificarán los conceptos de esta interesante exploración.\n\nTu profesor asistente será Sergio Torres-Letelier. Sergio es un compositor de cine, arreglista y productor musical, nacido en Chile y radicado en Los Angeles, USA. Tras obtener el título de Intérprete Instrumental (Batería) otorgado por el Instituto Profesional Escuela Moderna de Música de Santiago de Chile, Sergio fue aceptado en Berklee College of Music, en donde obtuvo un Bachelor Degree en Film Scoring, con un Minor en Conducción para Cine y Televisión.\n\n                                            Syllabus\n                        Bienvenida e introducción al cursoBienvenido(a) a «Producción musical y su efecto en la composición». Esta semana compartiremos información que te será útil para aprovechar al máximo este curso. A lo largo del curso podrás retornar a esta sección de referencia cada vez que necesites ayuda. Esta sección también te servirá de orientación para realizar indagaciones adicionales acerca de temas relacionados con el curso.Lección 1: Por qué hacemos música y consideraciones importantes de la producciónEn esta lección, analizaremos el concepto y las implicancias del rol del productor, sus responsabilidades y funciones y su impacto en el producto musical. Del mismo modo, hablaremos de la importancia para el músico de pensar y escuchar como productor y viceversa. La definición del objetivo emocional será fundamental no solo en esta lección, sino a lo largo de todo el proceso de producir una canción. El balance entre lo posible (sueño) y lo factible (realidad de nuestro contexto) será también analizado de forma práctica. Discutiremos algunas consideraciones para lograr una colaboración exitosa entre músicos y productor.Lección 2: Instinto musical y un flujo de trabajo eficazPara esta lección, recalcaremos la importancia de tener una metodología para abordar nuestra producción. Seguidamente, iniciaremos el proceso de capturar las impresiones e instintos iniciales para convertirlos en el objetivo emocional que regirá la senda que atravesará nuestra producción. Prepararemos nuestro DAW (Digital Audio Workstation) para este propósito, y trabajaremos con la tonalidad y el tempo de nuestra canción.Lección 3: Cómo construir un viaje irresistible para el oyenteEn esta lección, definiremos y analizaremos la estructura de nuestra canción, determinando la duración de cada segmento de la misma. Sopesaremos los pros y los contras de la estructura de la canción, tomando en cuenta la posibilidad de añadir o quitar secciones, según lo requiera nuestra situación particular. También discutiremos la instrumentación y los arreglos que podría llevar nuestro tema, teniendo presente el «norte» estético que estamos buscando para él.Lección 4: Cómo maximizar el contenido musical (Parte 1)Ha llegado el momento de incursionar en la manipulación de los elementos rítmicos de la canción. Evaluaremos el contraste entre usar ritmos estables versus ritmos inestables. Asimismo, analizaremos las posibilidades ofrecidas por la subdivisión dentro de estos ritmos y la densidad que resulta como producto de ella. Incidiremos en el impacto emocional producido por la manipulación de las dinámicas. La armonía y su abanico de opciones serán también discutidos aquí. Los Amigos Invisibles nos visitarán hacia el final de esta excursión.Lección 5: Cómo maximizar el contenido musical (Parte 2)Para esta lección, nos detendremos y buscaremos ser objetivos, tratando de analizar nuestra producción para determinar si podemos maximizar de alguna forma su impacto emocional. La voz y su rol protagónico tendrán la atención que se merecen; el rango melódico y el enfoque emocional de la voz serán discutidos, tratando de buscar la configuración ideal de ambos para optimizar los resultados emocionales de la producción.Lección 6: Consejos para el futuro y cierre del cursoAl término de este curso, compararemos el inicio y el final de nuestro proceso, a forma de evaluación, de tal manera que podamos ponderar los resultados y la eficacia de nuestra metodología. Compartiremos algunos consejos para poder continuar trabajando en nuestra estrategia después de este curso. Los Amigos Invisibles cerrarán esta fructífera jornada.\n                                    ", "end_date": "2016-08-01T00:00:00Z", "title": "Producción Musical y su Efecto en la Composición", "price": 0, "instructors": "Enrique Gonzalez Müller", "institution_name": ["Berklee College of Music"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/produccionycomposicion", "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}