{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong>Avec de nombreux guides et support de formation</strong></p><p style=\"\">Mise à jour du 15-09-2015 -&gt; Description détaillée</p><p style=\"\">Cette formation, ouverte pour toutes les personnes qui le désirent,  mais en particulier pour ceux qui connaissent l'échec, ceux qui veulent gagner plus et même en dehors du Kindle, ceux qui veulent comprendre comment améliorer leur productivité, ceux qui veulent se lancer sérieusement dans la création des ebooks... enseigne au moins 7 secrets que tout auteur de livre numérique devrait savoir.</p><p style=\"\">La connaissance et l'exploitation de ces informations \"boosteront\" votre manière de travailler, de fonctionner ou d'entrevoir le marché des livres numériques.</p><p style=\"\">Beaucoup sans ces informations demeurent dans l'amateurisme, dans le hobby ou peinent sérieusement à percer.... Recevant quelques modiques euros de royalties alors qu'ils pourront avoir plus... Vraiment plus!</p><p style=\"\">Ne soyez pas comme ces personnes qui, avant même de se lancer dans la création de livre, se positionnent déjà pour échouer dans leur entreprise.</p><p style=\"\">Voici des informations rafraichissantes, enrichissantes et des conseils remplis d'éléments de motivation. La création des ebooks ne sera plus la même après avoir suivi cette formation.</p>", 
    "end_date": null, 
    "title": "7 astuces pour le kindle qui boosteront votre productivité", 
    "price": 0, 
    "instructors": "Pierre Benoît TASSE", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553154_52c8_2.jpg", 
    "course_url": "https://www.udemy.com/7-secrets-pour-le-kindle-ebook-et-manuels-inclus/", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-13T08:47:49Z"
}