{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The course <strong style=\"\">97 Ways To Market Your Accountancy Business</strong> is about how to use various marketing techniques to bring in new customers and attract more attention to your business.</p><p>Many accountants and bookkeeper are technically competent, yet aren&#039;t very good at &#039;marketing&#039; and why should they be? They went to school to learn how to do the accounts... they aren&#039;t &#039;sales people&#039; ... yet if you are a self employed accountant, and you are responsible for running your own accountancy business... then SOMEONE within your firm had better be good at this stuff... otherwise you may go broke just sitting there waiting for the phone to ring!</p><p>This course outlines 97 different ways in which you can market and promote your accountancy business. You don&#039;t have to do every single technique, but you may want to implement 7-8 of them, as in combination, you will see the result in your business.</p><p>Your course tutor began her own bookkeeping business in 2004 with £150, and had to develop a range of marketing skills in order to grow that business and keep it alive. This isn&#039;t theoretical, or wishful thinking - this is practical, real, simple techniques that you can implement with minimal skill needed. </p><p>Every technique is explained with the advantages and disadvantages, and a rating for cost (low to expensive), and a rating for effectiveness from 1 out of 5, to 5 out of 5. You can choose the low cost, highly effective techniques - and this course will more than pay for itself.</p><p>Included, is the book 97 Ways to Market Your Accountancy Business. All methods are written - its down to you to choose your favorite five, and implement them daily. If you do nothing else, but 5 pieces of marketing every day... your business will grow. It&#039;s when you take no action, that you are in danger of a competitor surpassing you and for you to go out of business. There is more than enough work to go around for everyone. Its your choice, whether you want to be proactive - and apply some techniques, or reactive - and just wait for things to happen and hope that they get better/</p><p>The course will take approx 2-3 hours to complete. We take 8 techniques per lecture and go into them - looking at the advantages and disadvantages. </p><p>This course is for those who are serious about growing their accountancy business.</p>", 
    "end_date": null, 
    "title": "97 Ways To Market Your Accountancy Business", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359916_c704_4.jpg", 
    "course_url": "https://www.udemy.com/97-ways-to-market-your-accountancy-business/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T18:55:56Z"
}