{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>A Guide to Professional Consulting Part Two Course Summary</strong></p><p>Part Two of my A Guide to Professional Consulting lecture series is focused on all the things that are taking place prior to the actual commencement of a contracted for project.  The tips and template verbiage I include in this course have served me well over a 35+ year career as a professional consultant and they can help you too.  This course contains a series of lectures on the following core topics:</p><ul><li>How and where to find projects you can offer your services for</li><li>How to use Bulletin Boards, work with Recruiters, and work with Consulting companies</li><li>How to professionally apply to complete projects</li><li>How to respond to Requests for Proposals</li><li>How to build Scope of Work and High Level Project Plan documentation</li><li>How to complete proposals</li><li>How to negotiate terms for engagements</li><li>How to finalize Letters of Engagement with clients selecting you to provide consulting services</li><li>How to protect yourself financially when undertaking projects</li><li>Using an NDA/Confidentiality Agreement</li><li>Template resource documents are provided for some of the above topics as well.</li></ul><p>If you are at all interested or serious about becoming a professional consultant, this course will be a very valuable resource to you.  It not only will help you find and secure engagements for your services, but the tips and verbiage you should put into your client contact and proposal documents provided within this lecture series will help to protect you as you strive to sell yourself on and complete projects for clients.  </p><p>This course will take you close to two hours to complete.  May you get a lot of value from it.</p><p>Best wishes,<br> Dan Grijzenhout – Course Creator</p>", 
    "end_date": null, 
    "title": "A Guide to Professional Consulting - Part Two", 
    "price": "50.00", 
    "instructors": "Dan Grijzenhout", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/719030_9bde.jpg", 
    "course_url": "https://www.udemy.com/a-guide-to-professional-consulting-part-two/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-07T01:38:28Z"
}