{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course provides the student with several lectures that collectively when finished, provides them with a thorough introduction to the world of professional consulting.  This course is designed to help the person who is considering undertaking a consulting career. It covers the following topics:</p>  <ul><li>What the consulting lifestyle looks like – and the pros and cons to being a consultant</li><li>What combination of skills and experience are required to be successful at consulting</li><li>What are the most common areas of service (disciplines) that consultants can profitably market</li><li>How much on average a consultant can charge for his or her services by consulting discipline</li><li>When should a consultant operate as a sole proprietorship and when should incorporation be considered</li><li>What is required to be able to consult internationally</li><li>What is required to consult in the USA if you are resident in Canada</li><li>How do you obtain international “Trade NAFTA” status to consult throughout North America</li></ul><p>At the end of this course, the student will have gained greater insights into the world of professional consulting.  This knowledge gained should help the student to both better decide if a consulting future is appropriate for them and also help them get started as a consultant if they choose to move ahead in this career direction.</p>", 
    "end_date": null, 
    "title": "A Guide to Professional Consulting - Part One", 
    "price": "20.00", 
    "instructors": "Dan Grijzenhout", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705770_5772_2.jpg", 
    "course_url": "https://www.udemy.com/a-guide-to-professional-consulting-part-one/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T13:48:45Z"
}