{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t           One view of Advanced Negotiation involves three basic elements: process,  behavior and substance. The process refers to how the parties negotiate: the context of the negotiations, the parties to the negotiations, the tactics used by the parties, and the sequence and stages in which all of these play out.  </p>  <p style=\"\">  \t<strong style=\"\"><u style=\"\"> What You Will Learn</u></strong>  </p>  <li style=\"\"> Culture is based on a set of shared beliefs, values, behaviors.</li>  <li style=\"\"> There are many different ways people may act or react</li>  <li style=\"\"> Learn as much about the other party as you can.</li>  <li style=\"\"> Listen. Be patient. Build apport. Stay focused but be adaptable</li>   Consider Your Own Experiences  <li style=\"\"> What do you enjoy about your interactions with people from other cultures?</li>  <li style=\"\"> What frustrates you? How do you deal with this?</li>      As a result of studying these subjects, you will be able to resolve conflicts more quickly and fairly, and negotiate better, win win agreements that help you and your organization be more successful by building more sustainable relationships.  <p style=\"\">  \t    Short video lectures, reinforcement quizzes, eGuides, an interactive &#039;Ask the Prof&#039; feature and Case Animations help you rapidly improve your abilities to resolve conflicts and negotiate good agreements:  </p>  <p style=\"\">  \t Get yourself enrolled in this course and enjoy a creative online study with best course material.  </p>", 
    "end_date": null, 
    "title": "Advance Negotiation", 
    "price": "40.00", 
    "instructors": "DLP India", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/203740_444d_4.jpg", 
    "course_url": "https://www.udemy.com/advance-negotiation/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-23T08:17:37Z"
}