{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>There are number of ways to get started with Home Based Business and affiliate marketing is one of the best among them</p>\n\n<p>When it comes to affiliate marketing, Amazon Affiliate Marketing is the best.</p>\n\n<p>Well, how do i say that? I have been an Amazon Affiliate Marketer for over 3+ years and it generates a consistent income for me.</p>\n\n<p>This course is all about sharing my complete blueprint and tips on my experience of Amazon Affiliate Marketing in clear simple steps.</p>\n\n<p><strong>What You Will Learn From This Course:</strong></p>\n\n<p>1. How to bring in a passive income from Amazon Affiliate Marketing.<br>2. How to get approved from Amazon Affiliate Marketing very easily.<br>3. How to build quick Amazon Affiliate Site.<br>4. The Importance Of Social Media Traffic<br>5. How to find laser targeted traffic from social media.</p>\n\n<p>You are also going to get my Ama Social Suite Software (Worth $67) completely FREE with the course.</p>\n\n<p>This software can find targeted audience on social media sites and promote your website in autopilot. It can also find you top quality amazon affiliate products that you can promote instantly.</p>\n\n<p>There are tons of more added features with the software and this is what we are going to cover in the course.</p>\n\n<p>Enroll to the course today and start with your Amazon Affiliate Marketing journey.</p>", 
    "end_date": null, 
    "title": "Amazon Affiliate Marketing Strategy For Beginners", 
    "price": "20.00", 
    "instructors": "Hema Chandiran", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/811952_6285_3.jpg", 
    "course_url": "https://www.udemy.com/amazon-affiliate-website-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-04T02:40:06Z"
}