{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>What is this course about?</strong>\n\n  </p>\n\n<p>This course was created as beginners guide for people who are seeking to outsource their home business. It was designed to be basic and not contain difficult terminology that some new comers may find daunting when first starting to outsource for their home business.\n\n  </p>\n\n<p>This course was not designed with a particular home business in mind, but people should be able to use what they learn from the material in the course for just about any home business.\n\n  </p>\n\n<p>This course was designed for people who either want more free time, cannot complete a certain task due to lack of skills, or want to save money by hiring people on a “as needed basis”.\n\n  </p>\n\n<p><strong>What terminology would students expect to use to find this course?</strong>\n\n  </p>\n\n<p>This course was designed for students who are searching business tips that will save them time and money. Students looking for this course most likely have money to spend, but do not contain any outsourcing experience.\n\n  </p>\n\n<p><strong>What kind of materials is included?</strong>\n\n  </p>\n\n<p>Students will find video footage that contains audio and sort of walks them through the process of finding freelancer for their outsourcing needs. Students are also given a resource cheat sheet that they can use to get started with managing their outsourcing task, as well as where to find freelancers to outsource to.\n\n  </p>\n\n<p><strong>How long will the course take to complete?</strong>\n\n  </p>\n\n<p>The course altogether is a little bit over fifty minutes. Students should be able to finish it all in just one sitting.\n\n  </p>\n\n<p><strong>How is this course structured?</strong>\n\n  </p>\n\n<p>The course first begins with an introduction then leads to the student developing a certain mindset before they begin outsourcing task to various freelancers or companies, soon after students will be introduced to various tools that can be used to help them with outsourcing task (trackers, project management).\n\n  </p>\n\n<p><strong>Why should students take this course?</strong>\n\n  </p>\n\n<p>Students should take this course if they looking to start outsourcing task for their home business. Outsourcing tasks can be a huge time saver, as well as a money saver in the long run. Students who have an interest in starting home businesses but not necessarily running them (doing all the work themselves) may find outsourcing very appealing.</p>", 
    "end_date": null, 
    "title": "Beginners Guide to Outsourcing a Home Business", 
    "price": 0, 
    "instructors": "Tico Smith", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833492_2908.jpg", 
    "course_url": "https://www.udemy.com/beginners-guide-to-outsourcing-a-home-business/", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T14:22:04Z"
}