{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Birth Your Biz takes you from feeling stuck and confused on where to begin to knowing how to start your new business with clarity and confidence.  You dream of having your own business, of being free to do your own thing yet you don’t know where to start putting it all together, in Birth Your Biz you will discover that knowing.  You lack clarity and direction, yet you know that now is your time to take a leap in the direction of your heart’s desire and Birth Your Biz will point your leap in the right direction for you.</p>    <p>Birth Your Biz answers the five big questions you need crystal clear answers to so you can start your business with clarity and confidence:   </p>  <ul><li>Why?  What will your business look like?</li><li>How?  How will they know?</li><li>Who?  Who will your business serve?</li><li>Why you?  What makes you different to your competitors?</li><li>What?  What will you say?</li></ul>            <p>Birth Your Biz contains over 1.5 hours of video full of information and teaching.  Following each lesson you will spend time working through following the worksheets provided and answering the questions for each lesson prior to moving forward to the next lesson.</p>    <p>You will:</p>  <ul><li>Learn how to start your new business with clarity and confidence</li><li>Discover how to create compelling offers</li><li>Discover how to establish your ultimate business vision</li><li>Learn how to be magnetically attractive to clients</li><li>Discover how to build a lead generating machine</li><li>Learn how and where to find customers</li></ul>              <p>Why would you take this course?  That’s an easy question to answer.  After doing the work in this course you will be free of uncertainty and confusion about how to take control of your life and your income.  Birth Your Biz will show you how to move forward with clarity and confidence as you take the leap to entrepreneurial freedom.  </p>", 
    "end_date": null, 
    "title": "Birth Your Biz - How to start your new business with clarity", 
    "price": "50.00", 
    "instructors": "Daphne Wells", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/663374_8e27_3.jpg", 
    "course_url": "https://www.udemy.com/birth-your-biz-how-to-start-your-new-business-with-clarity/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T23:38:21Z"
}