{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t          If you’re reading this, you’ve probably passed the point of setting up your e-commerce site, and now you’re looking to improve your sales.  </p>  <p style=\"\">  \t<strong style=\"\">&quot;I&#039;m a team of one -- These strategies won&#039;t work for just me...&quot;</strong>  </p>  <p style=\"\">  \t          When Facebook came to see the entire online marketing team that I was running at Vail Resorts, they were shocked to see that all of the team was just me. I&#039;m familiar with the marketing team of one. These tactics and strategies can be used in an individual and team environment.  </p>  <p style=\"\">  \t          Chances are you’ve made a few sales, but you want to take it to the next level -- I&#039;m talking big sales numbers...$1 million + sales numbers. Want to get your store to that level?  </p>  <p style=\"\">  \t<strong style=\"\">&quot;But I don&#039;t have money to invest in my business!&quot;</strong>  </p>  <p style=\"\">  \t          I had the same theory of thought. Then I found a coach and applied what I learned and it paid off within the first 30 days. You don&#039;t need to raise money. 90% of the business I run and consult started with less than $1000 to grow their business.  </p>  <p style=\"\">  \t          This course is not going to give you a bunch of theory and ideas. It’s filled with actionable e-commerce marketing strategies supported by case studies. Many of the strategies are followed by an action item to help you implement the steps we’ve talked about.  </p>  <p style=\"\">  \t<strong style=\"\">&quot;This won&#039;t work for my ecommerce store!&quot;</strong>  </p>  <p style=\"\">  \t          My partners and I have 6 different ecommerce stores we use every single one of these strategies on every month. They range from beauty products, to outdoor gear to digital products to health products. These are not niche specific strategies. They work for all niches (digital and physical products).  </p>  <hr style=\"\">  <p style=\"\">  \t<strong style=\"\">In this course I’m going to cover: </strong>  </p>  <ul style=\"\">  \t<li style=\"\">How just tweaking a few on-site elements can increase your profitability by 14% </li>  \t<li style=\"\">How to attract the right people to your site instead of just plain non-converting visitors</li>  \t<li style=\"\">How to spy your competition have them to give you their customers</li>  \t<li style=\"\">How to maintain a killer customer service plan that keeps your business thriving</li>  \t<li style=\"\">How to optimize your site from top to bottom to gain hidden sales</li>  </ul>  <hr style=\"\">  <p style=\"\">  \t          This course is split into 3 key areas:  </p>  <p style=\"\">  \t          The <strong style=\"\">1st section discusses how to increase targeted traffic to your site</strong> using marketing, advertising, and social media strategies. Some of the topics include:  </p>  <ul style=\"\">  \t<li style=\"\">How To Use Your Blog To Build Authority and Leads</li>  \t<li style=\"\"> Facebook &amp; The E-Commerce Marketing Funnel </li>  \t<li style=\"\">How to Set Up a Profitable Google AdWords Campaign </li>  \t<li style=\"\">Spy On Your Competitors To Get A Competitive Edge</li>  \t<li style=\"\"> What Metrics Should You Track?</li>  </ul>  <p style=\"\">  \t          The <strong style=\"\">2nd section covers ways to improve your visitors’ experience once they’re on your website</strong>. It discusses conversion optimization, how and what to test on your site, product listings, website navigation, and much more. Some of the killer content we&#039;re going to discuss include:  </p>  <ul style=\"\">  \t<li style=\"\">What’s Your Homepage Value Proposition</li>  \t<li style=\"\"> Do Your Visitors Trust You? How To Increase Confidence with Trust Elements </li>  \t<li style=\"\">Navigation Layout (Under and Over 50 Products) </li>  \t<li style=\"\">Test Your Website Non-Stop to get Non-Stop Results </li>  \t<li style=\"\">Focus on Your Bestsellers FIRST Product </li>  </ul>  <p style=\"\">  \t          The <strong style=\"\">3rd section talks about what happens after the customer purchases</strong>, including customer support, email marketing, shipping, and retargeting. You&#039;ll learn some of the following techniques that made our companies millions including:  </p>  <ul style=\"\">  \t<li style=\"\">Retargeting to Convert the People Who Didn&#039;t Buy</li>  \t<li style=\"\"> Use Email Remarketing to Convert Interested Potential Customers Into Buyers </li>  \t<li style=\"\">Create the Best Customer Service Plan </li>  \t<li style=\"\">Ship Products Quick &amp; Gain Customers Attention </li>  \t<li style=\"\">Let Your Customers Sell For You With Product Reviews</li>  </ul>  <p style=\"\">  \t          ******  </p>  <p style=\"\">  \t<strong style=\"\">        DISCOVER: How To Maximize Your E-commerce Store’s Profitability  </strong>  </p>  <p style=\"\">  \t  The most profitable e-commerce stores are doing something different. They have a strategy. Several strategies actually. And they know how to implement them and maximize their marketing ROI at every stage.  </p>  <p style=\"\">  \t  Want to boost your e-commerce store sales but not sure how? If you’ve recently started your e-commerce store or maybe just hit a wall, this course is your guide. Learn what it takes to make your store the next &#039;BIG THING&#039; on the web.  </p>  <p style=\"\">  \t          Our goal is for you to succeed! You can get these strategies for thousands of dollars with consultants but our goal isn’t to get rich.  </p>  <p style=\"\">  \t          Our goal is to make this information accessible to anyone with an e-commerce store.  Why? Because we know that if just ONE strategy works, it will have been the cheapest investment you’ve ever made with the BIGGEST return.  </p>", 
    "end_date": null, 
    "title": "Build a Multi-Million Dollar Ecommerce Business", 
    "price": "20.00", 
    "instructors": "John Price", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369904_8f24_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-multi-million-dollar-ecommerce-business/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-14T03:36:41Z"
}