{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is designed to help you define, identify, and develop a cross organizational - high performance digital business strategy and transformation team. It provides a powerful framework and tools that help you focus your company on the right team development issues, organize your efforts, define and develop your team, and hold your first planning meeting.</p><p><strong>Build a High Performance Team That Can Transform Your Company Into a Digital Leader.</strong></p><ul><li>Define team roles and responsibilities</li><li>Identify and qualify the best possible candidates</li><li>Assess and develop team skills</li><li>Define and lead a powerful initial planning meeting</li></ul><p><strong>Gain the insight and tools you need to quickly define, organize, launch, and manage a digital team that can successfully establish your company as a digital leader.</strong></p><p>This course takes you step by step through creating a digital strategy and transformation team. It guides you in selecting, managing, developing and supporting that team. And provides detailed guidance on how to define and manage your initial planning meeting.</p><p>It includes 9 lessons, a 90 page interactive workbook and a 390 slide presentation deck to facilitate stakeholder and team definition and planning meetings.</p><p><strong>Course lessons include:</strong></p><ul><li>Introduction to Building a Digital Dream Team</li><li>Defining Team Roles and Responsibilities</li><li>Assigning Team Leader Specific Responsibilities</li><li>Establishing a Successful Team Management Methodology</li><li>Assess, Training and Developing Team Skills</li><li>Preparing for Your Initial Planning Meeting</li><li>Facilitating Your Team Planning Meeting</li><li>Establishing Strategic, Transformation, and Discovery Priorities</li></ul><p>This course is part of the “Competing for the Digital Future\" a comprehensive 8 part, executive level program on digital leadership. The program is based on years of helping build successful high tech teams that can translate emerging technology into business momentum. I look forward to helping you build an amazing team and successful digital future for your company.</p>", 
    "end_date": null, 
    "title": "Build a Digital Transformation Dream Team", 
    "price": "20.00", 
    "instructors": "Mike Connor", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440602_9bc7_4.jpg", 
    "course_url": "https://www.udemy.com/building-a-digital-transformation-dream-team/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-06T19:07:29Z"
}