{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will help you quickly establish a company wide vision and framework for developing and implementing a winning digital business strategy.</p><p><strong>Align Your Company on Developing a Successful Digital Business Strategy</strong> </p><li> Learn what an integrated digital business strategy is</li><li> Learn why an integrated strategy is critical and how to communicate it</li><li> Align your company on the process required to create a winning strategy</li><p><strong>This course helps you understand, communicate and build the consensus required for your company to develop and execute a successful digital business strategy.</strong></p><p>It is designed to provide you the insight you need to help your company understand and support the development of integrated digital strategies for products, marketing, operations and develop the competencies required to sustain digital leadership.</p><p>It includes 19 lectures, discussion guides and work books that help you organize and execute quickly and effectively.</p><p><strong>This is Part One of a Two-Part course titled “Kick Start Your Digital Strategy and Transformation Program\".</strong></p><p><strong></strong><strong>Part One includes:</strong></p><li> Market drivers and digital disruption</li><li> Transformational opportunities and threats</li><li> Working with visionary customers and partners</li><li> Development of transformational digital product, marketing, and operational systems strategies.</li><li> Capabilities and competencies required to build and sustain your company's role as a digital leader including:</li><li> “Always-On\" Customer and Technology Insight</li><li> Leading Edge Data / Analytics</li><li> Continual Innovation</li><li> Development of a Digital Culture</li><li> And, and overview of the key phases of digital transformation</li><span></span><p><strong>Part Two titled “Defining a Digital Transformation Roadmap\"</strong>, provides an in-depth guide to developing a phased digital transformation program. Part Two is available for purchase separately. Part One &amp; Two may be purchased together for a discount under the title “Kick Start Your Digital Strategy and Transformation Program\".</p><strong>These courses are part of the “Competing for the Digital Future Leadership Program for Digital Strategy and Transformation\". </strong>The program passes on lessons based on years of experience working within Silicon Valley for companies like Apple and Adobe as well as startups, helping them and their customers transform emerging technologies into business momentum<p><strong>The Competing for the Digital Future Leadership Program will save you and your company months of precious time by helping you organize and align the efforts required to set your company on a path to digital leadership and avoid the pitfalls that lead to digital disruption.</strong></p>", 
    "end_date": null, 
    "title": "Building a Digital Business Strategy", 
    "price": "20.00", 
    "instructors": "Mike Connor", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/509344_ca23_3.jpg", 
    "course_url": "https://www.udemy.com/building-a-digital-business-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-23T01:30:59Z"
}