{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>******** Over 5800 ********</strong></em></p>\n\n<p><em><strong>******* Over 78% 4&amp;5 Start Student Review *******</strong></em></p>\n\n\n\n<p><em><strong>******* Regularly Updated Course *******</strong></em></p>\n\n\n\n<p><strong><em>Review: Expert Guidance on Writing a Great Business Plan:</em></strong><strong><em> </em></strong></p>\n\n\n\n<p><em></em><em>This course is great in explaining to entrepreneurs how to write a great business plan. The structure of the course has been well planned - each lesson is presented with great clarity in a concise, right to the point manner.</em><em> </em><em>This medium-sized course is about as comprehensive as it should be without overwhelming me with too much information.</em></p>\n\n\n\n<p><em>Boomy (the instructor) covers each topic engagingly with amazing attention to detail in a lively tone. Also, supplementary resources are generously provided whenever applicable. What impresses me most are the insights he shares based on his own experience - the practical tips that would save me a lot of time from having to figure it out myself.</em></p>\n\n\n\n<p><em>In a nutshell, if you're looking to learn how to write a great business plan, this course will help you get the job done with minimal fuss.<strong> - Michael (student)</strong></em></p>\n\n\n\n<p><strong>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p>\n\n\n\n<p><strong>Do you want to write a business plan you can use to raise money or run your business with? </strong></p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>Are you looking for a simple step by step course that can help you achieve this goal? </strong></p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>Are you looking for a course that clearly outlines exactly what to do in plain English, jargon free content that everyone can use? </strong></p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>Then you are in the right place!</strong></p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>Join over 5600 Students of successful students who have decided to write their own business plan using this 100% hands-on course!</strong></p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>Review: Excellent for the Entrepreneur</strong></p>\n\n\n\n<p><em>I had formal education in entrepreneurship at one of the top 10 entrepreneurship programs in the US. I was a little rusty and saw this course had become extremely popular, so I thought I would pick it up. What a great decision! Boomy has broken down every essential aspect of the business plan from marketing to cash flow analysis, and done it well. This immediately jogged my memory and got me back on track for following through and even making changes to my old business plan! LATEST: Course Updated For 2015 - Added Business Plan Template!</em><strong> - </strong><em>John Wilmont (Student)</em><strong></strong></p>\n\n\n\n<p><strong>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p>\n\n\n\n<ul><li><strong>Over 5800 satisfied students are enrolled in my Business Plan course</strong></li><li><strong>Last 3 month, over 500 students have joined my Business Plan courses</strong></li><li><strong>The average rating is 4.4 !</strong></li></ul>\n\n\n\n<p><strong>Review: I wanna recommend this course for everyone</strong></p>\n\n\n\n<p><em>Hi, it is my first course that I finish to the end and Boomy is very good teacher. He give us instruction and template, and if you are planning to start small business, you need to check this course. Thanks Boomy! – <strong>Video Producer</strong></em></p>\n\n\n\n<p><strong>========================================================================</strong></p>\n\n\n\n<p>Whenever the word <strong>“Business Plan\"</strong><strong> </strong>is mentioned most people freeze! What follows are the words “I don't know how to write one\". In reality it needs not be this way.</p>\n\n\n\n<p>That is why I have taken the lid off and delivered these videos in plain English what needs to be considered and included within a business plan. This course has been designed to help those who are writing plans for the first time or for those who write business plans infrequently (Even seasoned business plan writers will learn one or two things, I promise!) . I want you to know that the information contained in this course has been used to help many start-up and growing businesses and I am confident will be of tremendous value to you. <strong>In this course you will watch over my shoulders as I create a 12 Month Cashflow Forecast from scratch!</strong></p>\n\n\n\n<p><strong>========================================================================</strong></p>\n\n\n\n<p><strong>Downloadable Templates.</strong></p>\n\n\n\n<ul><li><strong></strong><strong>Cashflow Forecast Template </strong></li><li><strong></strong><strong>Profit &amp; loss and Balance Sheet calculations Template</strong></li><li><strong></strong><strong>Powerpoint Business Plan Template</strong></li><li><strong></strong><strong>All the slides for the course!</strong></li><li><strong></strong><strong>5 Ways to make your business plan standout!</strong></li><li><strong></strong><strong>The start-up Founders dilemma </strong></li><li><strong></strong><strong>5 Ways to impress any investor</strong></li></ul>\n\n\n\n<p><strong>========================================================================</strong></p>\n\n\n\n<p><strong>Updates </strong></p>\n\n\n\n<ul><li><strong>5 Ways to make your business plan standout!</strong></li><li><strong>The start-up Founders dilemma</strong></li><li><strong>5 Ways to impress any investor</strong></li></ul>\n\n\n\n<p><strong>========================================================================</strong></p>\n\n\n\n<p><strong>In this Course You Will Learn How To Put Together: </strong></p>\n\n\n\n<p><strong>The Comprehensive Business Plan Template</strong>The Five Parts of a Business Plan <strong>Part 1: Marketing Plan: “What I Want To Do\"</strong> -Industry overview -Sector overview -Competitors -Product/Service -Place -Price -Total Cost plus profit -Competitors Price -Ability for customers to pay -Standard &amp; Average Price -Marketing/Promotions -Customers -Business Name</p>\n\n\n\n<p><strong>Part 2: Operations Plan: “How I Am Going To Do It\"</strong>-Management -Business Structure -Sole Trader/Self Employed -Partnerships (Unlimited Liability) -Limited Company (Limited by Liabilities) -Company Limited by Guarantee -Staff -Insurances -Training Requirements -Exhibitions</p>\n\n\n\n<p><strong>Part 3: The Financial Plan: “What It Will Cost To Do It\"</strong>-What does a Cash flow Forecast look like? -Columns -Rows -Profit and loss account</p>\n\n\n\n<p><strong>Part 4: Appendices: “Additional Supportive Information\"</strong>-Letters of intent -Letters of recommendation -CV -Other Literature</p>\n\n\n\n<p><strong>Part 5: Executive Summary</strong>-Background -Market -Business Challenges and how I plan to overcome them -Profitability -How much do you need?</p>\n\n\n\n<p><strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p>\n\n\n\n<p><strong>Important information before you enroll:</strong></p>\n\n\n\n<ul><li><strong>In case you find the course useless you are covered by a 30 day money back guarantee, full refund, no questions asked!</strong></li><li><strong>Once enrolled, you have unlimited, lifetime access to the course!</strong></li><li><strong>You will have instant and free access to any updates I'll add to the course.</strong></li><li><strong>I will give you my full support regarding any issues or suggestions related to the course.</strong></li></ul>\n\n\n\n<p><strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p>\n\n\n\n<p>This course will help you put together a Comprehensive Business Plan that can be used to run your new startup and also raise funding if needed. There are 2 PDF Documents you should use to follow the lectures. (Please download them before you start)</p>\n\n\n\n<p>95% of the content is video based so that you can follow the process as easy as possible. You have over 6 hours worth of content so I assure that much of what you will need is already included!</p>\n\n\n\n<p>I have set up the course so that you can follow a logical sequence used to write the business plan.</p>\n\n\n\n<p>I am confident of a useful outcome for you!</p>\n\n\n\n<p><strong>So what are you waiting for?</strong></p>\n\n\n\n<p><strong>Every delay is a barrier stopping you from starting and running a successful business. Sign Up Now!</strong></p>\n\n\n\n<p><strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p>\n\n\n\n<p><em><strong>5 Start Student Review</strong></em></p>\n\n\n\n<p><em><strong>Thought it was hard - ITS NOT!:</strong></em><strong><em> </em></strong><em><strong>thanks for teaching me how to make a good business plan. Any serious startup should take a course like this in my opinion - Emil (Student)</strong></em></p>", 
    "end_date": null, 
    "title": "Business Plan Masterclass: Guide To A Comprehensive Plan!", 
    "price": "50.00", 
    "instructors": "Boomy Tokan", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/220646_061f_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-your-first-business-plan-with-cashflow-forecast/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-16T14:04:20Z"
}