{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em>LATEST: </em><em>Course Updated Again September 2015 </em>  </p>  <ul>  \t<li><em>How to create a balance sheet</em></li><li><em>Updated almost all lectures to improve audio and video quality</em></li><li><em>Now most lectures have downloadable notes in addition to the lecture</em></li></ul>    <p>  \t<em>* OVER 8,000 DELIGHTED STUDENTS HAVE TAKEN THIS COURSE</em>  </p>    <p>  \t                      Are you tired of being confused about how to write your business plan? Are you stuck on writing it? I understand how it feels. <strong>I've helped hundreds of people create a business plan, and I will help you too</strong>.  </p>  <p>  \t          You will complete this course in about two hours. And after such a short time you will be able to write a good business plan the very same day. And the sooner you plan the sooner you will start your business, and ultimately reach all your goals for your business.  </p>  <p>  \t                  When you finish this course you will be able to write a fantastic business plan that gets the attention of investors. Your business plan will help you get moving in the direction of obtaining the wealth and success you have been dreaming of for yourself and your family. Try the course now and get on the path to achieving these goals.  </p>  <p>  \t                                                                                This course teaches you to write a business plan by going through each section of a business plan one by one, explaining what to write in each section of the business plan.  </p>  <p>  \t<strong>Who The Course Is For</strong>  </p>  <ul>  \t<li>People just starting a business</li>  \t<li>People stuck on writing a business plan</li>  \t<li>People who want to create a great strategy before starting their business</li>  \t<li>People who need a business plan to help them raise money</li>  </ul>  <p>  \t<strong>How The Course Is Structured</strong>  </p>  <p>  \t                                                          The course is almost all video. You get 23 lectures in over 2 hours of lessons. I also continuously update the course, and you will have access to all the future lectures. When you are done with the course, you should be able to comfortably plan your business, and be able to easily think through various business strategies.  </p>  <p>  \t<strong>Personal Touch</strong>  </p>  <p>  \t                                                      In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with private questions. I answer 99% of questions within 24 hours. I love helping students who take my courses and I look forward to helping you.  </p>  <p>  \t                      If you have questions about whether the course will be helpful to your particular situation, message me with questions about this course.  </p>  <p>  \t<strong>                                                    This Course Is Based On People Just Like You</strong>  </p>  <p>  \t                                                                              Let me explain a little bit about why I created this course. I originally created the Problemio business planning apps on Android and iPhone that now have 500,000+ cumulative downloads. On the apps I saw thousands of people making common business planning mistakes. Over time, I started a business coaching practice where I help people write their business plans in a 1-on-1 setting. This course is a much more affordable option than buying a 1-on-1 coaching, but you get all the strategies I teach people when I coach them 1-on-1.  </p>  <p>  \t<strong>Beyond Planning</strong>  </p>  <p>  \t                  Each section of the business plan gives you actionable advice for how you can handle that part of your business during the execution phase once you get started.  </p>  <p>  \t                                                                              I wish you much luck, success, and enjoyment in your business. I sincerely hope that this course helps you, and look forward to hearing about your future success! Sign up now, and start moving your business forward today.  </p>  <p>  \t<strong>Still Wondering If The Course Will Be Right For You?</strong>  </p>  <p>  \t          Personally, I am always skeptical before I buy anything for the first time. It is just impossible to predict whether the course will be useful before you actually take it. Luckily, Udemy offers a 30-day money back guarantee so there is no risk for you to try the course. So buy the course now and see for yourself how easy and even fun it can be to write a business plan and create a great business strategy.  </p>  <p>  \t          +++++++++++++++++++++++++++++  </p>  <p>  \t                  NO RISK: MONEY BACK GUARANTEE  </p>  <p>  \t<em>The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em>  </p>", 
    "end_date": null, 
    "title": "Business plan today! Business planning made simple", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/179174_fe95_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-a-business-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-08T23:27:33Z"
}