{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em style=\"\">&#039;Management expertise has become the creation and control of constants, uniformity, and efficiency, while the need has become the understanding and coordination of variability, complexity, and effectiveness&#039;</em> - Dee Hock, Birth of the Chaordic Age  </p>  <p>  \tHow can you plan and strategize for the future, when you don&#039;t know what it holds? The complexity and unpredictability of the modern world means that traditional &#039;business planning&#039; is of limited value. Rather, leaders are realizing that they must learn how to make smart decisions in the face of complexity, and to focus on becoming antifragile rather than fragile. The study of chaos and chaordic systems has revealed powerful insights into how to &#039;win&#039; from unpredictable environments, whilst behavioural economics is revealing how we can best make decisions under stress. In summary, this course will teach you how to develop and employ a business strategy that will &#039;win&#039;, whatever the future holds.  </p>  <p>  \t    The course is divided into two sections; the first explains core concepts and distinctions (&#039;chaos&#039;; &#039;chaordic systems&#039;; &#039;antifragility&#039;, &#039;emergence&#039;, etc). The second section is practical, applying principles in depth to organizational strategy. The course includes video lectures and written materials and will take between 1 week (full-time) and 7 weeks (part-time) to complete.  </p>  <p>  \tThis course is highly recommended for entrepreneurs, company directors, strategists, MBA students, and other organizational leaders. The material contained in this course is a synthesis of organizational leadership and management theory; chaos and chaordic systems theory; non-linear strategy; and behavioural economics.  </p>  <p>  \t<strong style=\"\"><em style=\"\">You will receive a certificate upon completion of this course.</em></strong>  </p>", 
    "end_date": null, 
    "title": "Business strategy: how to win in an unpredictable world", 
    "price": "50.00", 
    "instructors": "Best Thought Ltd.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/111802_2de5_6.jpg", 
    "course_url": "https://www.udemy.com/antifragile-business/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-28T15:45:59Z"
}