{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The OODA loop strategy is what you have been looking for.  Do you want to take your business to the next level but aren't sure how? The OODA loop holds the key.<br></p><p>Are competitors in your business constantly giving you problems and you wish you had some sort of edge to help your business win?  They might be using the OODA loop on you.  </p><p>Do you ever feel like your business keeps making mistakes, but you don't understand why it keeps happening? The OODA loop can show you why and how to get it right.<br></p><p>Is your business doing well, but somehow it has become stagnant and you want to increase growth? An OODA loop strategy can get you there.<br></p><p> If you answered yes to any of these questions, then this course is for you.</p><p>The Observe - Orient - Decide - Act, or OODA loop, is a theory that describes how human beings interact with the world around them.  And since businesses are groups of human beings, businesses exhibit the same type of interaction in their market space environments.  By learning how the OODA loop works, a business can become self aware of how it interacts with its customers, competitors, and collaborators, allowing it to identify ways to improve.  The OODA loop theory also serves to help businesses identify their competitors strengths and weaknesses, giving the opportunity to know which areas are ripe for growth in the market place.</p><p>The course will give you a fantastic understanding of the OODA loop, putting the ultimate strategic capability in your hands.  This capability gives you actionable steps on how to improve your business, and also how to defeat your competitors.</p><p>Learn how to leverage the power of the OODA loop in your business today by enrolling in this course right now.<br></p>", 
    "end_date": null, 
    "title": "Business Strategy - Explode Performance With The OODA Loop", 
    "price": "20.00", 
    "instructors": "Empowered Owl, LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660224_83bc.jpg", 
    "course_url": "https://www.udemy.com/business-ooda/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T17:59:28Z"
}