{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Este curso é destinado para aqueles que querem aprender Business Intelligence de forma prática.</p><p>O investimento corresponde a menos de 3% do valor que hoje que encontramos no mercado.</p><p>Estamos em um mercado que trabalhou em 2011, com 16 bilhões de dólares, de acordo com o Gartner.&nbsp;<a href=\"http://www.epmchannel.com/2012/12/07/three-trends-impacting-the-bi-market-in-2013/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">E de acordo com a IDC, este ano a 33 bilhões no mercado</a>&nbsp;.</p><p>A tendência é de forte crescimento e com mais smartphones crescerão as soluções de BI para esses dispositivos.</p><p>A escolha do tema veio de um desafio que eu fiz. Ou seja, para criar uma estrutura de fácil assimilação e longe do que os encontrados nos cursos, eu pensei de uma base estatística e lógica.<br>O exemplo prático são os resultados de loterias dos EUA e Europa.<br>Powerball, Megamillions e Euromilhões.</p><p>Aprender facilmente BI, resumo o curso desta forma:</p><p>- Pequenos vídeos para ir direto para ao ponto.<br>- Animações para reforçar cada tópico<br>- Resolução de 16:9 e áudio de alta qualidade<br>- Poderosos recursos discriminados passo a passo<br>- Exemplo prático do mundo real<br>- Aprenda a usar o Microsoft Business Intelligence Development Studio com potência e estilo<br>- Ao decorrer do curso vou deixando testemunhos técnicos das experiências com BI<br>- E no final, um workshop aberto para dúvidas pessoais e troca de experiências</p><p>Aproveite agora o mercado!</p><p>Os dados estão em Inglês, mas a voz está em Português. Informações claras de forma objetiva</p><p>Em constante atualização. Pelos temas propostos pelos participantes, vou adicionar ao &nbsp; treinamento novidades.</p>\r\n", 
    "end_date": null, 
    "title": "Business Intelligence para todos", 
    "price": "20.00", 
    "instructors": "Marcelo Kochenborger Krug", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49211_7908_6.jpg", 
    "course_url": "https://www.udemy.com/business-intelligence-para-todos/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-10T08:13:02Z"
}