{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong> </strong>Let me guess what brings you here: you have an idea, and you need an investment for a startup company. Or you work for a large company and want to get budget for your new project. Or you want to start a small business and you need a small business loan from the bank. You are here because you are afraid to fail when you present your business plan. Most people do.</p><p>Am I close?</p><p>If so--you came to the right place.</p><p>I founded several startup companies, wrote many business plans that raised tens of millions of dollars in investments, and got projects funded in large companies. I sold a company, and even bought a company. I wrote books about it, and taught this in universities.</p><p>But more important, <strong>I am an investor</strong>, and was part of several angel investor networks from Silicon Valley to Texas and Israel, where I made personal investments in startups. I also evaluated business plans for the State of Texas, and the State of Israel, and made project funding decisions in large and public companies.</p><p>As such, I only have a few minutes to snap-judge a business plan that comes across my desk. I will share with you what makes me (and other investors) stop, and decide whether to invest in a new business or not.</p><p>In this course you will learn the <strong>four rules of a successful business plan</strong>:</p><ol><li>Create something fundamentally different,</li><li>Find the unique value to a specific market segment,</li><li>Establish and maintain competitive advantage, and-</li><li>Calculate the return on investment for your customer, your company, and your investor.</li></ol><p>I will teach you how to <strong>assess your business</strong>, <strong>create the business plan</strong>, and <strong>present it to investors</strong>. I will do that with:</p><ul><li>33 lectures (over 4 hours);</li><li>22 worksheets that will allow you to build your own business plan, step by step;</li><li>6 quizzes that will help you internalize the content;</li><li>Personal examples; and-</li><li>An Israeli accent...</li></ul><p>At the end of this course, you will have an inside track on how investors and budget managers think, what are they looking for in a business plan, and what will make them invest in you!<br></p><p>I will teach you what I know now, but wish I knew when I created and presented my first business plan.</p><p>Are you ready to learn this? Enroll in this class, or try the free preview. Now, let’s get you funded!</p>", 
    "end_date": null, 
    "title": "Business Plan through investors' eyes", 
    "price": "45.00", 
    "instructors": "Dr. Yoram Solomon", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702528_d0a7_4.jpg", 
    "course_url": "https://www.udemy.com/business-plan-through-investors-eyes/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T02:03:31Z"
}