{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">“Cloud Adoption Essentials: Learn The 8 Step Roadmap&quot;</strong></p><p>Companies are adopting the cloud, but find it hard to navigate the process. After this course you will be able to plan that process and see how the various nuts and bolts fit together. </p><p><strong style=\"\">Understand How To Get More And Quicker Benefit From Cloud Computing In Your Company And Less Risk</strong></p> <ul style=\"\"><li>Learn why cloud computing is here to stay</li> <li>Understand how cloud characteristics drive business value and risk</li> <li>Identify the important steps in any cloud adoption process</li> <li>Understand the most essential technology and cloud architecture components</li> <li>Recognize which services are more valuable and less risky</li> <li>Bring all the steps together in your plan</li> <li>Overcome resistance to cloud initiatives</li> <li>Learn how to temper overenthusiastic people</li></ul> <p><strong style=\"\">Getting to cloud benefits quickly and safely</strong></p><p>Cloud computing is the leading IT delivery revolution. Picking up speed from 2010 onwards, we can expect that it will be the dominant IT delivery model in 2020. </p><p>There is a lot of confusion around cloud, cloud models, fears around security, inflated expectations and &#039;cowboys&#039; promising the moon. This course will help separate hype from applicability.</p><p><strong style=\"\">Who is this for?</strong> </p><p>Cloud computing fundamentally reshapes the jobs of everybody working professionally with IT, whether you are an IT professional, an auditor, or a business IT user. Learn how to update your skills to work in the cloud.</p><p><strong style=\"\">Content and structure of this course</strong></p><p>Based on hundreds of examples and questions from students of my earlier cloud courses, I have distilled the essential elements for navigating the cloud journey</p><p>The course currently has 8 sections, 20+ lectures with more than 2 hours of content and is regularly being expanded.</p><p>The first section explains how the cloud came to be and how it is another disruptive innovation.</p><p>Then we give an overview of the 8-step cloud adoption roadmap.</p><p>Technology examples is another section, in which we have both architecture diagrams as well as suggestions for hands-on exercises.</p><p>Cloud is about service, and in the section on service engineering we will find out how to analyse these services for quality.</p><p>No cloud training is complete without learning to identify the important risks and how you can start handling them.</p><p>We can then revisit the 8-step cloud adoption roadmap to see where all the bits fit in.</p><p>The course also has an extensive extra resources section, dedicated to more specific situations.</p><p><strong style=\"\">What you will get out of this course</strong></p><p>This is the quickest way to get you and your team focused on the right steps in cloud adoption. The instructor is also regularly adding content on the basis of your feedback.</p>", 
    "end_date": null, 
    "title": "Cloud Adoption Essentials: learn the 8 step roadmap", 
    "price": "25.00", 
    "instructors": "Peter HJ van Eijk", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420552_bfe9_4.jpg", 
    "course_url": "https://www.udemy.com/cloud-business-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T20:46:45Z"
}