{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Por qué tomar este curso?</strong>  </p>  <p>  \t  Todos tenemos conocimientos comerciales de algún tipo, o de alguna forma. Internet hoy provee todo tipo de información sobre todos los temas en forma gratuita. Pero no contamos con la ayuda de expertos que nos expliquen como en realidad funcionan las cosas no solo en la teoría, sino en la práctica. Un experto te explica desde un enfoque practico cada uno de los temas de una forma simple, con clases cortas y sus explicaciones en vídeo, para que vayas comprendiendo aspectos de la realidad en las operaciones.  </p>  <p>  \t<strong style=\"\">Es para mi la información que esta en este curso?</strong>  </p>  <p>  \t          Si! Este Curso de &quot;Comercio Exterior y Logística Internacional&quot; es <em style=\"\">para todos</em>. Así es, todos deberíamos poder saber sobre este apasionante, complejo y extenso tema sobre el cual el mundo está ayudando a sentar bases para lograr globalizar el intercambio comercial, y de la que en buena parte, depende el intercambio de las mercancias en muchas partes del mundo.  </p>  <p>  \t<strong style=\"\">Que aprenderé con la toma de las clases?</strong>  </p>  <p>  \t          Con este curso, <strong style=\"\">te estaremos preparando o reforzando, </strong><strong style=\"\">para comerciar con el extranjero con explicaciones simples</strong>. Aprenderás de una diversidad de temas que te permitirán básicamente lograr conocimientos sobre:  </p>  <p>  \t <strong style=\"\">1.Hacer compra/ventas con el exterior</strong>  </p>  <p>  \t <strong style=\"\">2.Como contratar servicios de logística</strong>  </p>  <p>  \t <strong style=\"\">3.Como importar y exportar productos<br style=\"\">  \t</strong>  </p>  <p>  \t          Detrás de estos hay una serie de conocimientos, de detalles, de dinámicas y de procesos que debes conocer para poder realizarlas como una <strong style=\"\">visión profesional, y no solo con conocimientos básicos generales.</strong>  </p>  <p>  \t          Así como todos tienen conocimientos básicos sobre como comerciar, quizás buena parte de ellos deberían poder tenerlos también, pero con un alcance internacional. Esto es parte de ese nuevo mundo interconectado, donde el Comercio Exterior empieza a ser una herramienta común de trabajo entre las personas y las empresas, y no solo una herramienta solo para algunos cuando &quot;coquetean&quot; con esta área.  </p>  <p>  \t <strong style=\"\">Puedo convertirme en un experto una vez finalice este curso?</strong><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t  Por Supuesto que si!<strong style=\"\"> </strong><em style=\"\">Muchos saben de comercio exterior, pocos poseen la experiencia y los conocimientos para hacerlo mas exitosamente. </em>Ciertamente se requiere mucho más que un curso para ser un experto, pero si te entregaremos lo necesario para que puedas empezar a serlo, <strong style=\"\">alcanzar los resultados para hacer experiencia esta a la vuelta!</strong>  </p>  <p>  \t <strong style=\"\">Se bienvenido al mundo del Comercio Exterior</strong>. Con solo un click, comienza ahora!  </p>", 
    "end_date": null, 
    "title": "Comercio Exterior y Logística Internacional", 
    "price": "20.00", 
    "instructors": "Alessandro D. F.", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/130480_bd3b_36.jpg", 
    "course_url": "https://www.udemy.com/log1s-curso1/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-07T16:20:40Z"
}