{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em style=\"\">    Experienced seller since 2008 this is the only course you need to take on this topic</em></p><p><strong style=\"\">Craigslist profits master buying and selling comprehensive guide to unlimited profits</strong></p><p>In this course you will learn how to make amazing amount of money by selling on Craigslist. This method will teach you all you need to know how to get started right away and make money today. We will learn how to deal with buyers and sellers on Craigslist and how you can money in the process. </p><p>Course will cover arbitrage and how you can profits from buying something low on Craigslist and making more either on ebay or reselling it back on Craigslist. We will explore other profitable ways to make money, where to look for bargains and how to find free stuff to sell so you never run out of things to sell ever! </p><p>Teaches you EVERYTHING you need to know to be successful. We skip all the boring and time-wasting stuff you are getting short quality lectures each one you will learn something awesome and new. Published in May of 2015 you are getting the most up to date course you wont find old ancient lectures here or only boring slide shows. </p><p><em style=\"\">This course also features...</em></p><p><strong style=\"\">What to avoid selling </strong><strong style=\"\"></strong></p><p><strong style=\"\">How to stay safe on Craigslist</strong></p><p><strong style=\"\">Where to find free stuff to sell</strong><strong style=\"\"></strong></p><p><strong style=\"\">Bumping up your listings</strong><em style=\"\"></em></p><p></p>", 
    "end_date": null, 
    "title": "Craigslist Buying and Selling Strategies for All Levels", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483576_2d5d_10.jpg", 
    "course_url": "https://www.udemy.com/craigslist/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T19:00:38Z"
}