{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t     If there is one thing that an entrepreneur brings to the table that no one else brings, it&#039;s vision.  Without a clear sense of where one is going, and an understanding of how to organize people, resources, and money to get a business off the ground, nothing happens.  Nothing.  </p>  <p style=\"\">  \t<strong style=\"\">Vision is important.  But vision isn’t enough</strong>.  It’s the entrepreneur’s responsibility to establish and execute business strategy with energy.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Creating Your Business Strategy – Failure to Plan Means You Plan to Fail </em></strong>will equip students with the skills they need to create a business plan for a business of their choosing.  Lessons from the previous three modules will be integrated into this “Capstone” session.  You will learn how to take what you have learned in previous modules and apply it to creating a business strategy for a company you wish to start.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Creating Your Business Strategy – Failure to Plan Means You Plan to Fail </em></strong> will help you to identify your <em style=\"\"><u style=\"\">Unique Value Proposition</u></em>, understand your own <em style=\"\"><u style=\"\">Competitive Competency</u></em>, and master the <em style=\"\"><u style=\"\">Four Keys of a Business Strategy</u></em>.  </p>  <p style=\"\">  \t    This course is divided into eight sessions.  The first session, <strong style=\"\">Introduction</strong>, is designed to explain who can benefit by taking this course, and how you can use the material to enhance sales in your business  </p>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">Lesson 1</u></strong><strong style=\"\">:  Introduction to Creating Your Business Strategy</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">Lesson 2</u></strong><strong style=\"\">:  Course Outline and Syllabus</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t    The second session, <strong style=\"\">Failure to Plan Means You Plan to Fail,</strong>takes the various skills you’ve been developing by examining the book publishing industry and applies them to the business you want to start.  We’ll start to put the pieces together as we talk about the various types of business models you might consider, the impact of the Internet on business marketing, and the importance of completing a business plan.  We’ll also discuss how to identify trends affecting your business, and the importance of industry market research.  </p>  <p style=\"\">  \t    In the third session, <strong style=\"\">Building a Plan for your Business</strong> helps you develop a sense of perspective.  Look at the business you hope to launch.  What are the market conditions facing it?  What does it take to succeed in that market? Why do businesses fail?  You must understand the answers to these questions, because only then can you develop a vision for your business that is sound, has a firm foundation, and sees things as they really are, not as you hope they might be.  </p>  <p style=\"\">  \t    The fourth session, <strong style=\"\">Identifying a Strategy for Your Business</strong>, builds on the previous sessions and turns the focus outward toward the marketplace in you compete.  We’ll focus on the four keys to creating a successful business strategy.  And, we’ll examine how you can answer the Three Customer Questions:  HOW you’ll market your product, to WHOM you will market your product, and WHERE your customers will look when they want to find your product.  </p>  <p style=\"\">  \t    In the fifth session, <strong style=\"\">Evaluating the Strengths and Weaknesses of Your Business</strong>, examines the steps needed in going to “the other side of the hill.” A key element in developing strategy is that one must be realistic.  We must not only understand what we’re good at, but what we’re NOT good at.  In this lesson, we will examine ways to evaluate our business strengths and weaknesses to better understand how to create a strategy that gets us to where we want to go; metaphorically, to go to “The Other Side of the Hill.”  </p>  <p style=\"\">  \t    In the sixth session, <strong style=\"\">Implementing Your Strategic Plan</strong>, we’ll examine why knowing what is happening in YOUR industry, what trends should you pay attention to, and the threats that exist that could impact your business is critically important.  In this lesson, we’ll show you how to assess the competitive forces that affect your industry and your company.  We’ll help you learn how to research industry trends.  </p>  <p style=\"\">  \t    In the seventh session, <strong style=\"\">Developing a Consumer-Centric Marketing Strategy</strong>, we’ll examine the traditional marketing focuses on the Four Ps, which can be summarized as follows:  Putting the right <strong style=\"\">product</strong> in the right <strong style=\"\">place</strong>, at the right <strong style=\"\">price</strong>, at just the right time to <strong style=\"\">promote</strong> it.  Based on what you know of the external environment and the industry in which you operate, what are some of the elements of the Four Ps you would employ in marketing your service one on one?  In a physical store/office?  Online?  Via radio, print, TV or youtube?  </p>  <p style=\"\">  \t    The eighth session, <strong style=\"\">Next Steps,</strong> we summarize what has been learned in this course, and preview additional courses in the series available from Generation Self Employed.  </p>", 
    "end_date": null, 
    "title": "Creating Your Business Strategy", 
    "price": "25.00", 
    "instructors": "David Lantz", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121450_292f_6.jpg", 
    "course_url": "https://www.udemy.com/creating-your-business-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-18T02:59:42Z"
}