{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Today, unfortunately so many potential sales are lost or existing customers abandon their providers, simply because the first impression they have – be it content, a meeting, or a presentation etc. does not resonate with them or provide them with the experience they need. They simply do not feel connected to the product, service offering, brand, or people.</p>  <p>The traditional marketing mix has clearly changed. The linear approach has transformed into a web of multiple channels to be navigated from awareness through to purchase in a multitude of manners. The digital and physical worlds have collided and their interaction is very important in helping you to craft experiences that matter.</p>  <p>In customer-facing roles, <strong>acquiring the right information and understanding of your customer, and then utilizing this knowledge to connect with them on a personalized, experiential level, is core to success</strong>. The experience you provide them with is the key to competitive advantage and will ensure that your customers want to do business with you, continue doing business with you and that will refer you to others who will then do business with you.</p>  <p>Gaining a meaningful understanding of your customer includes not just knowing the needs and wants that they have communicated, but also understanding their unspoken desires, problems, use cases, working environments, behaviors, mental models, value compass and how to accurately respond to their needs.</p>  <p>Using this course, you will be equipped with the thought-process, knowledge, and mechanisms you will need to enable you to transform your message and construct your content in a way that will truly reach and engage your customers.</p>  <p><strong>The principals are based in Experience Design thinking and use the understanding of emotions to connect your solution directly to your customers needs and pain points – leaving them wanting to use your products/services</strong>. The process provided is also easily scalable, to ensure that the knowledge gained can be applied practically to your role or organization.</p>  <p>Upon completion participants will have the comprehension and tools required to attract and retain their customers, by providing engaging and relatable content and experiences.</p>  <p>Every student that takes this course will receive a Certificate of Completion.</p>", 
    "end_date": null, 
    "title": "Create Compelling Content for Customer Experiences that Sell", 
    "price": "50.00", 
    "instructors": "EffectUX :", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665276_629e_3.jpg", 
    "course_url": "https://www.udemy.com/create-compelling-content-for-customer-experiences-that-sell/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T23:13:53Z"
}