{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Why this course?</strong>  </p>  <ul>  \t<li><strong>More than 30,000 Students taking my courses</strong></li>  \t<li><strong>4 to 5 Stars rating</strong></li>  \t<li><strong>The model has been used successfully to develop ideas, create strategic plan and raise funds</strong></li><li><strong>I just reduced the price from $199 to $78 to make it affordable to all</strong></li>  </ul>  <p>  \t       A great workshop with step by step explanations and templates for you to create, develop and write a great business plan.  </p>  <p>  \t<strong>\"How to create a Damn Good Business Plan?!\"</strong> is a complete course that includes 2 parts:  </p>  <ul>  \t<li>Part 1: Visual and Simple Business Analysis</li>  \t<li>Part 2: Think, Develop and Write your Business Plan</li>  </ul>  <p>  \t       The course provides a framework for you to analyze the external environment of your business (existing or in creation) and develop a state of the art Business Plan.  </p>  <p>  \t       The course includes short videos for each section and a set of templates that you can print and use, as well as excel templates.  </p>  <p>  \t       It is VISUAL and SIMPLE. No complex graphs, math... Just a tool for reflection. You will be using templates and post-it for you to record you thinking process.  </p>  <p>  \t       It's much more than a course  because you are creating an output (your analysis and your plan). Therefore it looks more like a workshop than a lecture. You won't just sit back and wait as you are asked to actively create your output.  </p>  <p>  \t       You don't need any business background to take this course. Although, we advise you to get the help of an accountant for the financial part if you never learn accounting.  </p>  <p>  \t<strong>Optional: </strong>  </p>  <p>  \t       If you need an extra help:  </p>  <ul>  \t<li>You can get for extra coaching</li>  \t<li>You can ask for a business plan review and get feedback</li>  \t<li>If you ask for a review and you successfully meet our criteria (at least 60%), you will earn a <strong>\"Certificate in Business Planning For SME\"  </strong></li>  \t<li>We also offer writing services based on what you send us</li>  </ul>  <p>  \t       Find our price list at the end of the course curriculum.  </p>", 
    "end_date": null, 
    "title": "Create a Damn Good Business Plan !?", 
    "price": "45.00", 
    "instructors": "Timmermans Laurent", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37061_9363_16.jpg", 
    "course_url": "https://www.udemy.com/create-a-damn-good-business-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-20T05:08:19Z"
}