{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course is for people giving serious thought to improving their leadership style and especially their crisis leadership. Only you will know how crisis affects you and where change is required. We use a new technique called Symbolic Modelling, devised by James Lawley and Penny Tompkins, to help you model the mind of the greatest exemplar of crisis leadership - Sir Winston Churchill. </p><p style=\"\">Specific scenarios from Churchill&#039;s life are illustrated with public domain footage from the period, his speeches and quotes from his books. You are asked to consider your emotional reactions to the events and to reflect upon them at the symbolic or metaphorical level. A key question in this exercise is &quot;And all that&#039;s like what?&quot;</p><p style=\"\">A fundamental principle of Symbolic Modelling is that you already possess all the inner resources you need to self correct your thinking and behaviour. All you need is to have your attention drawn to aspects of your thought landscape and to muse relectively on the dynamics of your mind.</p><p style=\"\">Once you are comfortable with your symbolic relationship with crisis leadership, we help you to spot repeating patterns and think about improved outcomes by asking &quot;What would you like to have happen?&quot;The course demands a lot of deep contemplation. Once the process starts change will take place at a subtle level and in unpredictable ways. Be ready to capture any of the effects of change. We are always on hand to provide support. The course content lasts over an hour but the impact and our interest supporting you does not end with the course but lasts for the duration until you can sense recognisable improvement to the point of transformation.</p>", 
    "end_date": null, 
    "title": "Crisis Leadership - Winston Churchill", 
    "price": "20.00", 
    "instructors": "Peter Urey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506918_fd1b.jpg", 
    "course_url": "https://www.udemy.com/leadership-inside-the-mind-of-winston-churchill/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T08:24:37Z"
}