{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      ***********3500 Plus Students.... Join this Growing Community***************  </p>  <p>  \t      -------------------------------------------------------------------------------------------------------  </p>  <p>  \t          It is no secret that Walt Disney has been one of the most successful innovator, entrepreneur in the world.  He was able to dominate the entertainment industry for many years, to the point  where the name Disney has become a brand of its own.  The name has become an icon in the family entertainment world.  </p>  <p>  \t          Walt Disney did not become successful by mere luck.  He always followed a system, methodology, a formula that predicts business and personal success.  It works so well that if it is followed it will pretty much guarantee a change in your business and personal life.  </p>  <p>  \t          This course was developed by using Disney's formula.  It is not rocket science or difficult to follow, instead it is a very simple but thorough method and process.  If you follow the formula not only will your business soar but it will give you the tools needed to gain personal success.  The formula will give you the confidence of knowing exactly what is needed to succeed in your personal business.  </p>  <p>  \t          The lesson is not just comprised of theory, but it takes you through action steps and items that will help you take action as soon as possible to generate business results.  If you follow the action items and apply yourself to the process, your business will be much more successful.  </p>  <p>  \t          By the end  you will have a clear understanding of:  </p>  <ul>  \t<p>  \t\t          路Your Business  \t</p>  \t<p>  \t\t          路Your Ideal customer  \t</p>  \t<p>  \t\t          路How to keep your customers coming  \t</p>  \t<p>  \t\t          路How to get quality referrals  \t</p>  </ul>  <p>  \t<strong>Plus</strong> there is a BONUS lesson that will equip you with the 3 stages in any successful endeavor.  </p>  <p>  \t          Don't hesitate, <strong>take action now and take the course</strong>, it will change your personal and business live.  </p>  <p>  \t        ---  </p>  <p>  \t<em>You really have nothing to lose, the course has a 30 day money-back guarantee (backed by Udemy).  If for any reason whatsoever you do not like the course or did not get what you expected you can request a no hassle money back refund.  </em>  </p>  <p>  \t<em>Again don't hesitate... <strong>Enroll</strong> in the course now....</em>  </p>", 
    "end_date": null, 
    "title": "Customers For Life -Disney's Formula to Get More Raving Fans", 
    "price": "20.00", 
    "instructors": "Julio A Lara", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313008_e98e_2.jpg", 
    "course_url": "https://www.udemy.com/how-can-walt-disney-help-you-achieve-success/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-03T18:25:02Z"
}