{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Taking the <strong>Decision-Making for Business</strong> course will help you improve your decision-making habits at work. The course gives you models and techniques that you can use in real-life professional, but also, personal situations. It's all about providing a practical framework for improvement and for creating positive habits in decision-making.</p><p>The content is already included in my extended Problem-Solving and Decision-Making course, and aims to respond to the needs of the students who demand a more general and less focused on specific methods course on decision-making.</p><p>In <strong>not much more than 2 hours</strong> of will learn to use a methodical approach to reach the best decisions by:</p><ul><li>establishing a context for success</li><li>framing the issue properly</li><li>generating alternatives</li><li>evaluating these alternatives and</li><li>choosing the best option.</li></ul><p>The video lectures include extensive examples and exercises to facilitate your learning and skills development. At the end you are strongly encouraged to apply and I will be here to develop individual course projects at your demand.</p><p>This course is for everyone, no special requirements. Just come with an open mind and focus on improving your decision-making. And, go ahead, have a preview of the course before hitting that Take the Course button.</p>", 
    "end_date": null, 
    "title": "Decision-Making for Business", 
    "price": "20.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557894_40b5_3.jpg", 
    "course_url": "https://www.udemy.com/decision-making-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-18T10:06:37Z"
}