{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course will help you quickly establish a company wide understanding and framework for defining a successful digital transformation program.</p><p style=\"\"><strong style=\"\">Define a Phased Digital Transformation Program That Will Establish Your Company as a Digital Leader</strong></p><li style=\"\"> Learn what successful digital transformation requires</li><li style=\"\"> Learn to avoid pitfalls that cause 70% of transformation efforts to fail and</li><li style=\"\"> Learn how to define a phased program that aligns your company for success</li><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">This course helps you understand, communicate and build the consensus required to implement a successful digital transformation program.</strong></p><p style=\"\">It is designed to provide you the insight you need to help your company understand and support the development of an integrated and phased approach to digital transformation. It provides a framework that helps you continually build the competencies, capabilities and momentum required to establish and sustain your company as a digital leader.</p><p style=\"\">The course includes 12 lectures, discussion guides and work books that help you organize and execute quickly and effectively.</p><p style=\"\"><strong style=\"\">This is Part Two of a Two-Part course titled “Kick Start Your Digital Strategy and Transformation Program&quot;.</strong></p><p style=\"\"><strong style=\"\">Part Two includes:</strong></p><li style=\"\"> An Overview of Successful Digital Transformation </li><li style=\"\"> Phase One – Introduction</li><li style=\"\"> Phase Two - Team Development</li><li style=\"\"> Phase Three – Discovery</li><li style=\"\"> Phase Four - Vision and Strategy</li><li style=\"\"> Phase Five – Identification of key initiatives and priorities</li><li style=\"\"> Phase Six – Engagement with customers, employees, and partners</li><li style=\"\"> Phase Seven – Development of product, marketing and operational initiatives</li><li style=\"\"> Phase Eight - Transformation – Defining and implementing the programs required to establish the competencies of digital culture and leadership throughout your organization.</li><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Part One titled “Building a Digital Business Strategy&quot;, </strong>provides an in-depth guide to developing an integrated digital business strategy. If you don&#039;t have experience or training in developing an integrated digital business strategy taking part one before taking this course is strongly recommended. Part One is available for purchase separately. Part One &amp; Two may be purchased together for a discount under the title “Kick Start Your Digital Strategy and Transformation Program&quot;.</p><p style=\"\"><strong style=\"\">These are all part of the “Competing for the Digital Future Leadership Program for Digital Strategy and Transformation&quot;. </strong>The program passes on lessons based on years of experience working within Silicon Valley for companies like Apple and Adobe as well as startups, helping them and their customers transform emerging technologies into business momentum</p><p style=\"\">The Competing for the Digital Future Leadership Program will save you and your company months of precious time by helping you organize and align the efforts required to set your company on a path to digital leadership and avoid the pitfalls that lead to digital disruption.</p><p style=\"\"><strong style=\"\">This course will help you quickly establish a company wide vision and framework for developing and implementing a winning digital transformation program that establishes your company as a digital leader.</strong></p>", 
    "end_date": null, 
    "title": "Defining a Digital Transformation Roadmap", 
    "price": "20.00", 
    "instructors": "Mike Connor", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510548_8892_2.jpg", 
    "course_url": "https://www.udemy.com/defining-a-digital-transformation-roadmap/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-25T01:04:40Z"
}