{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>Design thinking</strong></em> may be a relatively new concept, but it has actually been around for a very long time. Everything around you has been designed. The chair you're sitting on. The device you're looking at. The grocery store around the corner, the car that's parked out front, everything has been designed. Everything has been designed in an attempt to delight you. Often, that translates to higher pricing power and higher profits.</p><p><strong>You do want higher profits, right?</strong></p><p>If so, you need to check out this course. This course teaches you how to think like a designer, and how to design an experience that will delight your consumers.</p><p><strong>This course is not intended for designers.</strong> They already know how to think like a designer - they're making a career out of it. <strong>This course is designed for business people.</strong> This course doesn't start at the design process - this course has a strong emphasis on what happens before you start designing. As business people, we know that we do not have the luxury to have someone else tell us what needs designing, what needs to be re-imagined. We have to come up with the business problem all on our own! This course aims to help you do exactly that.</p><p>This course also is not intended to replace designers. While this course will teach you the design process, there are professionals out there who specialize in design. No man is an island. Adding talent to your team is always a good idea (budget permitting).</p><p>What this course will do is to get your creative juices flowing! Besides teaching you the process, this course is also filled with real-world case studies to serve as inspirations and examples. And perhaps you'll discover that you're not just a business person, but there is an inner-designer within you! And you may find a whole new market that creates new opportunities for your business. Or you may come up with the next can't-do-without product that would significantly add to your bottom line.</p><p><strong>Are you up for the challenge? Are you ready to bring out the creative genius in you?</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Design Thinking: Innovation Strategy for Business People", 
    "price": "35.00", 
    "instructors": "Jeannie Chan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462452_a7cc_3.jpg", 
    "course_url": "https://www.udemy.com/design-thinking-innovation-strategy-for-business-people-jeannie-chan/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-29T22:51:01Z"
}