{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course, you will be learning a powerful complex problem solving framework known as Design Thinking and a new approach to Business Innovation based on insights and understanding of human needs. </p><p>The concept of Design Thinking has been around for decades, but in the past ten years, IDEO, a design consultancy firm, has championed the process as an alternative to a purely analytical approach to problem-solving. </p>\n\n<p>A complex business problem is a multi-dimensional and difficult problem to solve because of incomplete, contradictory, and changing requirements that are often hard to recognize. More over, complex problems often cut across social, cultural, political and environmental issues affecting diverse groups of people and has no clear boundaries or solution template to follow. </p>\n\n<p>Design Thinking offers a new approach to tackle complex problem and create innovative solutions:</p><ul><li>It's dynamic, adaptive and human centered</li><li>Empowering people with team-based, co-creation of solutions </li><li>New approach to problem finding, solution refinement and values creation </li><li>Integrative, practical, and effective for business innovation </li></ul>\n\n<p>You will learn the principles, process and methods of Design Thinking and new ways of looking at problems and finding solutions.  This new design approach to Innovation will enrich your organization with greater knowledge and skills for the future. </p>", 
    "end_date": null, 
    "title": "Design Thinking for Business Innovation", 
    "price": "20.00", 
    "instructors": "Abel Choy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/862872_fb2d_3.jpg", 
    "course_url": "https://www.udemy.com/design-thinking-for-business-innovation/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-29T13:46:22Z"
}