{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t        The Intermediate level of the Professional Development pathway has been divided into two sections: It covers the following practical chapters and is filled with all the kinds of detail that will help you achieve success in obtaining the job you want.  </p>  <p style=\"\">  \t        - The essential elements to develop yourself, e.g., Decision-Making and Assertiveness, Time Management, Dealing with Change and Conflict resolution. <br style=\"\">  \t<br style=\"\">  \t        - Essential employability factors e.g. Health and Safety, Information Security and Risk Management.<br style=\"\">  </p>  <p style=\"\">  \t        This program is a great start for those in transition as it covers all of the in-demand elements - the personal time out to understand who you are and what your talents are to how to successfully interact in the workplace.  </p>  <p style=\"\">  \t       This online course provides the keys to help you get noticed hunting for your next job.<br style=\"\">  \t <br style=\"\">  \t       The course is filled with useful advice that any business professional can apply as well, even if you are currently employed. You will take the tips provided in the book to review resumes and candidates when hiring..... In the competitive job market of the world today, those seeking employment WILL benefit from the titbits and advice provided in every chapter. You will be continually amazed at this book&#039;s ability to point out the small details that will make one stand out from the crowd and make a huge difference for jobs seekers.<br style=\"\">  \t <br style=\"\">  \t       In this time of high unemployment this is a very timely course. There are a multitude of people that are out of work looking for jobs and <strong style=\"\"><em style=\"\">this course will provide you the extra edge that they need to land the job of their dreams in the midst of record unemployment</em></strong>. Even in tough times there are jobs being filled every day....If you study, underline, highlight this advice you will land that job.<br style=\"\">  \t <br style=\"\">  \t       The real meat of this course is just what it says on the book-cover: Developing and Improving your value! It really makes you think and gives you a whole new perspective on the subject.  </p>", 
    "end_date": null, 
    "title": "Developing and Improving your Value", 
    "price": "50.00", 
    "instructors": "The Art Of Service", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101264_1cd3_6.jpg", 
    "course_url": "https://www.udemy.com/developing-and-improving-your-value/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-04T02:16:19Z"
}