{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                    ► More than 30 minutes of FREE PREVIEWS below to see if this course is for you!  </p>\n\n<p>  \t<strong>JOIN OVER 1,400 (wow!) SUCCESSFUL STUDENTS ALREADY TAKING THIS COURSE!</strong>  </p>\n\n<p>  \t<em>** Updated June 2016 **</em>  </p>\n\n<p>  \t                    You just created a survey for your customers, members, employees, or students - that's great! Now comes the hard part: trying to get a lot of people to fill it out and give meaningful comments so you have valid and useful results. But since most people ignore surveys and those that bother filling them out often skip over important instructions, make rating errors, and write vague and unhelpful comments, what meaningful decisions can you really make from these misleading results?  </p>\n\n<p>  \t                            Where do you go for answers? If you have a LOT of <strong>time</strong> or a LOT of <strong>money</strong>, you can do what most people do:  </p>\n\n<p>  \t                            1. Search the Internet. Spend hours and days reading what works for other people - which leads to conflicting opinions and misleading answers.  </p>\n\n<p>  \t                            2. Ask your colleagues. Everyone has an opinion, right? Ask enough people and you'll end up with many situation-specific answers that don't work for you and a lengthy survey that few people will fill out.  </p>\n\n<p>  \t                            3.  Call in the experts. Pay someone else to improve your survey - which costs $ and eats up your time. Frustrating because you know you could have done it yourself!  </p>\n\n<p>  \t                          ► Let me offer a far better alternative: <strong>Enroll</strong> in this course to get <strong>expert</strong> advice you can <strong>quickly</strong> apply <strong>yourself</strong>.  </p>\n\n<p>  \t                          The Survey Doctor is here to give your survey a quick tune-up! Get out the survey you are working on and let me share <strong>research-tested solutions</strong> and <strong>insights</strong> that you can <strong>immediately</strong> apply to your survey items, scales, and instructions that will yield <strong>interpretable</strong> results to take correct action. In fact, these are the same tactics that I have used to improve surveys and evaluation forms created at 650 colleges, training organizations and Fortune 500 companies. But once you join the Udemy community you won't have to pay my fees or travel expenses! :)  </p>\n\n<p>  \t<strong>Within a couple hours you will be able to:</strong>  </p>\n\n<ul>  \t<li>Ask the RIGHT questions in the RIGHT way to get interpretable results</li>  \t<li>Dramatically boost response rates (without paying anyone!)</li>  \t<li>Get relevant and actionable written comments from respondents you can use</li>  \t<li>Engage people to WANT to fill out your survey</li>  \t<li>Eliminate costly incentives and \"survey      fatigue\"</li>  \t<li>Smile with confidence and satisfaction knowing that      all the efforts you put into creating your survey will now yield huge returns and valid      results</li>  </ul>", 
    "end_date": null, 
    "title": "Don't (survey)monkey around: Learn to make your surveys work", 
    "price": "50.00", 
    "instructors": "Matthew Champagne", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/377098_5614_2.jpg", 
    "course_url": "https://www.udemy.com/secrets-that-make-surveys-work/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-24T16:44:08Z"
}