{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong> eBay digital Master resale rights MMR: How to make money online complete manual</strong></em></p><p> ******************************************************************************************************</p><p><strong>INCLUDES: Bonus eBooks to get you started right away value over $20 of content</strong></p><p><em> The most easiest and lowest investment upfront way to make money on the internet is here!</em></p><p><em><strong>Course includes top ten places to get quality digital resale rights MRR eBooks</strong></em></p><p> Complete system how to make money with digital Master resale rights MRR selling digital  products online and on eBay. We will take you from where you get those eBooks how to set  up an eBay listing and how to make the listing comply with eBay listing requirements then  teach you how to correctly ship the finished product to its destination or deliver it digitally.</p><p> Very low investment upfront needed to get started, you then able to sell this product  unlimited amount of times. Why this course is for you? As a newbie to eBay if you are  looking for best way to make money fast this is the course for you. It will show you how to  pick winning products, how to list them so you comply with eBay listing requirements and  explore other places where you can get more eBooks to buy and resale online. <br></p><p> Escape the 9-5 rat race with this course... as always I highly recommend that no single  method is used to make money online the more knowledge you learn the more methods you  try out the more likely you will find a niche where you start to make money. It takes work to  be successful! eBay is only one place to sell this product you can also sell it just  about  anywhere. Taking any of my courses ensures you are one step closer to success</p><p><em><strong> Course covers... </strong></em><br></p><p> How to start you own master resale rights business</p><p>Make 100% profit selling simple digital products<br></p><p> Where to find more eBooks to buy and sell</p><p> Correct way to list &amp; deliver MRR on eBay <br></p><p> Best sites to get more MMR to buy</p><p> Best places to sell eBooks online</p><p><br></p>", 
    "end_date": null, 
    "title": "eBay: Digital Master Resale Rights eBooks complete guide", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691629_9b72_5.jpg", 
    "course_url": "https://www.udemy.com/ebaydigitalproducts/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T01:34:30Z"
}