{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The Newest course from Steve Rosenbaum, creator of multiple top ranking courses that have received 96% Perfect 5 Star Ratings.</p><p>Do you currently have, or ever wanted to have an ecommerce business?</p><p>Wouldn't it be neat to know the secret formula that successful ecommerce businesses are utilizing to explode their sales and maximize \"Revenue Per Customer\"?</p><p>In \"<em><strong>Ecommerce Marketing Strategy: Repeat Sales Email Sequence</strong></em><em><strong></strong></em>\", you will learn the exact email marketing series that was responsible for one established business to double his sales in less than two years.</p><p><em>What I Guarantee You Will Learn In \"Ecommerce Marketing Strategy: Repeat Sales Email Sequence\"</em></p><p>Learn the <em>\"Active Customer Campaign\"</em>, one of the core components of my proven Advanced Business Marketing Blueprint that is responsible for maximizing <em>\"Revenue Per Customer\"</em> in any ecommerce or offline business. Specifically, in this course you will learn:</p><ul><li>What Changes A 15 Year Old Small Business Made To Double His Sales In Just 2 Years</li><li>The 3 Essential Steps To Grow Your Business (and WHY you must do it in the right order).</li><li>5 Strategies To Increase Customer Order Frequency</li><li>The “Magic 8” Emails That Exploded His Most Active Customers by 15X</li><li>What Messages To Send And When To Send Them</li><li>How To Incorporate Your Active Customer Campaign Into Your Total Marketing Strategy</li><li>The Importance of Maximizing Revenue Per Customer</li></ul><p><em>\"Ecommerce Marketing Strategy: Repeat Sales Email Sequence</em>\" is an Expert Level Marketing course and picks up where other Beginner Level courses leave off. If you are in business for yourself, or plan to be in business for yourself in the future, then chances are this course is for you.</p><p><em></em></p><p>Here are just some of the people that will benefit from this course:</p><ul><li>Business People</li><li>Entrepreneurs</li><li>Authors</li><li>Speakers</li><li>Consultants</li><li>Salespeople</li><li>Job Seekers</li><li>People in Their Second Act</li><li>Udemy Teachers</li><li>Authors</li><li>Bloggers</li><li>Website Owners</li><li><em>Many, Many, Many, More...</em></li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Ecommerce Marketing Strategy: Repeat Sales Email Sequence", 
    "price": "40.00", 
    "instructors": "Steve Rosenbaum", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562694_426b_3.jpg", 
    "course_url": "https://www.udemy.com/ecommerce-marketing-strategy-repeat-sales-email-sequence/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T14:48:38Z"
}