{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<strong style=\"\">I will give you a FREE 20 minutes interview through a Webinar during the course, to solve you doubts or give u real contacts and advices in these countries. </strong><br style=\"\"><br style=\"\">I have been making Business with latin people since 1999, when I was studying an <strong style=\"\">MBA</strong> in <a href=\"http://www.ie.edu\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">IE Business School</a>  in Madrid. I realized that each country has his own idiosyncrasy, culture and different ways to make the same. So you should adapt to each situation if you want to get success.<br style=\"\"><br style=\"\">Now everybody knows that there&#039;s a HUGE opportunity to make business in LATAM; 200 million Internet users, growh of 30% per year, and much more positive indicators in the same direction. But Latins have their own way to make Business, to close agreements, to make the PPRR &amp; Social Media activities... and they act diferent than people form te States. We must learn a lot about them.<br style=\"\"><br style=\"\">So In this course you will learn:     <br style=\"\"><ul style=\"\"><li>How to <strong style=\"\">priorize</strong> the entering to different countries depending on your goals.&nbsp;</li></ul><ul style=\"\"><li>What are the <strong style=\"\">most interesting countries</strong> for your products or services.&nbsp;</li></ul><ul style=\"\"><li>How to catch the <strong style=\"\">attention</strong> of first users and media contacts.&nbsp;</li></ul><ul style=\"\"><li>How to priorize SEO an <strong style=\"\">Social Media tactics</strong> depending on the region. <br style=\"\"></li></ul><ul style=\"\"><li>How to priorize <strong style=\"\">activities</strong> to get you goals in a minimun cost.</li></ul><ul style=\"\"><li><strong style=\"\">Growth Hacking</strong> tactics that run in LATAM countries.</li></ul><ul style=\"\"></ul><br style=\"\">DON&#039;T SUBESTIME THE SUBCULTURES AND LATIN STYLE; IF YOU TRY TO DO THE SAME THAN IN THE STATES, BE SURE YOU&#039;LL FAIL.    <br style=\"\"><br style=\"\"><strong style=\"\">Take this course and learn to think like a Latin</strong>. You&#039;ll understand more about the way they make business, and your strategy will be more successful both in LATAM and the US, because you&#039;ll know much more your [new] users and they will perveive you as a &#039;better comany&#039; to work with.<br style=\"\"><br style=\"\">  ", 
    "end_date": null, 
    "title": "Enter your Business successfully in LATIN countries!", 
    "price": "25.00", 
    "instructors": "Miguel Caballero", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25875_97c9_8.jpg", 
    "course_url": "https://www.udemy.com/enter-your-business-successfully-in-latin-countries/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-03T11:11:08Z"
}