{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you an entrepreneur or freelancer looking to launch a new business idea? Do you have an existing business that isn’t working so well? Want to learn the correct way <strong>without spending a dime</strong>?</p>\n\n\n\n\n\n<p>If so, this course was designed for you. </p>\n\n<p>This course was designed specifically for people who want a <strong>quick, effective, </strong>and<strong> economical way to build a profitable business model</strong>. And guess what? <strong>You don’t need an MBA</strong> to get it right! <br></p>\n\n\n\n\n\n\n\n<p>It’s ideal for those who want a plug-and-play method to take an idea from conception to final product. You also don’t need to create an elaborate business plan (hint: this is an outdated method). </p>\n\n\n\n\n\n\n\n\n\n<p>Before you launch your idea, <strong>you need to start here</strong>.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn how to:</strong></p>\n\n\n\n\n\n<ul>\n<li>Design a business model that <strong class=\"redactor-inline-converted\">GUARANTEES customer demand</strong></li>\n<li>Create an “evergreen” process that <strong class=\"redactor-inline-converted\">helps your business evolve</strong> with change</li>\n<li>Uncover what drives value for your customers, putting <strong class=\"redactor-inline-converted\">more money in your pocket</strong></li>\n<li><strong class=\"redactor-inline-converted\">Ensure your business model is profitable</strong> BEFORE investing resources</li>\n<li><strong class=\"redactor-inline-converted\">Lower risk</strong> &amp; shorten your learning curve</li>\n</ul>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Important:</strong></p>\n\n\n\n\n\n<ul>\n<li>You <strong>DO NOT</strong> need to have a deep understanding of business. Literally, anyone can master this process using the framework from this course. </li>\n<li>You can create your own business model — from <strong>start to finish — in </strong><strong>ONE</strong><strong> sitting.</strong></li>\n<li><strong>Case Study included</strong> —follow along with practical examples.</li></ul>\n\n<p><br></p>\n\n<p>The system used in this course is based on the international bestseller, <em>Business Model Generation</em> by Alex Osterwalder and Yves Pigneur. It covers the key elements to designing the perfect business model—one that not only works, but also helps you maximize value AND profits in your business. </p>\n\n\n\n\n\n\n\n<p>At the end of this course, you will walk away with a powerful foundation that allows you to get your business up and running as quickly, effectively, and inexpensively as possible. I will show you how you how new age entrepreneurs are testing their market assumptions using quick, iterative, and lean business principles to launch multi-million dollar businesses. </p>\n\n\n\n\n\n<p><strong>Why you should take this course:</strong></p>\n\n\n\n\n\n\n\n<p>I want you to make the investment in yourself and your business by developing the <strong>CORRECT framework needed</strong> to build a profitable business from scratch (or improve upon an existing one). </p>\n\n\n\n\n\n\n\n\n\n<p>In just 1 1/2 hours you can walk away with the necessary skills to <strong>create your own successful business model</strong> — quickly, effectively, and with little-to-no cost. The modules are designed for you to follow along with me. By the end of the course, <strong>you will have a first draft of your business model already finished</strong>!</p>\n\n\n\n\n\n\n\n\n\n<p>And remember, <strong>you don’t need a business degree for this framework to be effective</strong>. In fact, this course sums up the best elements of an MBA program in less time than it takes to watch your favorite movie. </p>\n\n\n\n\n\n\n\n\n\n<p>Click the “<strong>Take This Course</strong>” button above and <strong>join the 4,300+ students</strong> who are mastering the art of Business Model Design!</p>\n\n\n\n\n\n\n\n\n\n<p>P.S. I’ve made myself personally available to students within the course (<strong>for free</strong>) — something I generally charge my clients lots of money for. This alone is <strong>worth </strong><strong>100x </strong><strong>the price of the course</strong>.</p>\n\n\n\n\n\n\n\n\n\n<p>Some of the material in this presentation was used under a under a Creative Commons Attribution-ShareAlike 3.0 Unported License. It is attributed to Business Model Generation, and the original work can be found at <em>Strategyzer[dot]com</em>.</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Entrepreneurs: Building a profitable business begins here...", 
    "price": "20.00", 
    "instructors": "Brice Holmes", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393614_ea0d_3.jpg", 
    "course_url": "https://www.udemy.com/business-model-design/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T03:57:44Z"
}