{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you hold countless fundraising activities, trying to bring in more dollars for your nonprofit organization? <br></p>\n\n<p>Do you feel like you're on a hamster wheel of special events and direct mail campaigns? </p>\n\n\n\n<p>Want to get off the hamster wheel? </p>\n\n\n\n<p>A well-constructed development plan is your ticket!</p>\n\n\n\n<p><strong>Create a Development Plan So You Can Raise More Money.</strong></p>\n\n\n\n<p>Start by determining where you are. Then decide where you want to go. Finally set a map for getting there.</p>\n\n\n\n<p>This course will walk you step by step through the techniques necessary to create a development plan that will get the staff and volunteers around you working toward <strong>well-crafted financial and strategic fundraising goals</strong>.\nMany nonprofits launch into fundraising by creating a special event and before they've recovered from that event, they launch into another one. If this sounds like your organization, we've got a better way to do things.</p>\n\n\n\n<p>This course provides you with <strong>tools and resources to use again and again</strong> when creating your fundraising plan. Whether you are approaching the beginning of your fiscal year or already in the middle of it, this course teaches you to create a <strong>comprehensive plan to complete the fundraising cycle</strong>: identify, cultivate, solicit and steward donors.</p>\n\n\n\n<p>Brand new fundraisers and experienced professionals will benefit from the comfortable discussion style with over <strong>2.5 hours of video lectures</strong>, Sara Leonard, CFRE, MBA, and Louanne Saraga Walters. You’ll become part of the discussion as you determine what to keep, what to add and what to eliminate from your nonprofit’s development plan. </p>\n\n<p>Full participation in Fundraising Success: The Complete Development Plan is applicable for 3.0 points in Category 1.B – Education of the CFRE International application for initial certification and/or recertification.<br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Fundraising Success: The Complete Development Plan", 
    "price": "50.00", 
    "instructors": "Louanne Saraga Walters, Sara Leonard, MBA, CFRE", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722050_4a63_6.jpg", 
    "course_url": "https://www.udemy.com/fundraising-success-1-development-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-09T18:25:09Z"
}