{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<strong class=\"redactor-inline-converted\">F</strong>undraising isn't easy.\n\n<p>What makes it more difficult is the trap people often fall into - the Shotgun Approach to fundraising. The Shotgun Approach is basically the \"let's try everything and see what sticks\" method of fundraising; it means saying yes to and implementing every well-meaning idea for a new event.</p>\n\n<p><em>*A December 2015 article in the Stanford Social Innovation Review by Heather Yandow reports on research that shows that the <strong class=\"redactor-inline-converted\">clearest predictor of a nonprofit's success in raising money from individuals is having a formal fundraising plan.</strong></em><br></p>\n\n<p>But how do you, as a Development Professional, nonprofit CEO, or board member explain to your boss and/or your Board of Directors the need for a systematic approach to raising money, a plan, and solid delivery on the plan?</p>\n\n<p>In this class, you will learn what a Development Plan is and how it is used, who the stakeholders are in the Development Plan process, and explore how to approach conversations about the need to create, implement, and stick to a solid Development Plan.<br></p>\n\n<p>*Attendees will receive two downloadable sample Development Plan templates!<br></p>\n\n<p><strong class=\"redactor-inline-converted\">Who should take this training class:</strong><br></p>\n\n\n\n<p>-Fundraisers</p><p>-Nonprofit executives</p><p>-Members of Boards of Directors<br></p><p><strong class=\"redactor-inline-converted\">*<em>Full participation in Fundraising with a PLAN is applicable<br> for 1.0 point in Category 1.B – Education of the CFRE International <br>application for initial certification and/or recertification. </em></strong></p><br>", 
    "end_date": null, 
    "title": "Fundraising With a PLAN- Learn to Create a Development Plan", 
    "price": "30.00", 
    "instructors": "Tracy Vanderneck, MSM, CTL, CFRE", 
    "commitment": "23 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648020_0336_2.jpg", 
    "course_url": "https://www.udemy.com/fundraisingwithaplan/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T17:20:06Z"
}