{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Getting clients is where most coaches and consultants get stuck.<br></p>  <p>  \t                                <strong>Unfortunately, many coaches and consultants are spending their time and money on the wrong things when they start out in business</strong>… things that don’t directly bring them clients. But things they think they NEED to do.  </p>  <p>  \t                              Many even invest hundreds or thousands of dollars in coaching, and setting up their business, but still find themselves months, or even years later, without clients.  </p>  <p>  \t                                They may have a really cool website, a beautiful logo, brochure, business cards, and maybe even a Facebook Page… in fact, they have all the marketing bells and whistles, but what they don’t have are clients.  </p><p>There are lots of things you can keep yourself busy with when you have your own business. But if your primary goal is to fill your coaching or consulting business with clients, then <strong>the 6 steps I teach in this course are the action items you need to focus on. </strong>Everything else can wait.</p><p><strong>Don't expect this course to teach you some obscure or complicated marketing or sales tactics to help you get clients. </strong></p><p>After being in business on my own for 17 years, creating three 6-figure coaching/consulting businesses, and mentoring thousands of coaches and consultants, I've learned it's actually pretty simple to get clients. But what's simple is not always easy, or comfortable, or what we think we need to be doing.</p><p><strong>This course focuses on teaching you the 6 Basic Steps every coach or consultant needs to take if they want to get clients.</strong></p><p>In my experience, most coaches and consultants who are struggling to fill their business with clients are actually <em>avoiding</em> these steps! <br></p><p><em>So whether you’re just starting out or you’ve been in business for years, if you need clients and you're ready to let go of what you're doing now and learn the down and dirty, basic steps you really need to take to get clients, this course is for you.</em></p><p><strong>In this course I teach you 6 steps you can take to start getting clients immediately.</strong></p><p>I promise if you take them, you will get clients.</p>  <p>  \t<strong>What this course covers:</strong>  </p>  <ol>  \t<li><strong>What most new, or struggling, coaches and consultants spend their time doing</strong> <em>and why you shouldn’t be doing this.</em></li>  \t<li><strong>What you should spending your time on</strong> if you want or need clients quickly.</li>  \t<li><strong>What most coaches and consultants think they need to do</strong> before they can get clients <em>and why it’s absolutely NOT necessary.</em></li>  \t<li><strong>How the way most coaches and consultants start out in business</strong> actually delays them from getting paying clients</li>  \t<li><strong>Why getting clients should be your #1 priority.</strong></li>  \t<li><strong>The only things you need to do</strong> before you get your first client <em>(it’s probably a lot less than you think).</em></li>  \t<li><strong>3 simple things you can do this week</strong> (actually in a little as 3 days) so you can start getting clients next week.</li>  \t<li><strong>3 simple things to do next week</strong> to get you clients immediately <em>(it’s not hard but most people don’t do this… if you do you will get clients).</em></li>  \t<li><strong>How working with free, practice clients can actually hurt</strong> your ability to get paying clients.</li>  \t<li><strong>A checklist to help you determine whether or not you should start with free</strong>, practice clients <em>(in some cases it does make sense, but you have to be careful).</em></li>  </ol>  <p><strong><br></strong></p><p>  \t<strong>This course includes:</strong>  </p>  <ul>  \t<li><strong></strong>Short, instructional video lessons </li>  \t<li>Handouts, worksheets, and checklists to help you apply what you're learning in your business</li>  \t<li>Quizzes to make sure you understand the most important points </li>  </ul>  <p><br></p>", 
    "end_date": null, 
    "title": "Get Clients: How To Get Coaching Or Consulting Clients", 
    "price": "50.00", 
    "instructors": "Debbie LaChusa", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311834_2537_5.jpg", 
    "course_url": "https://www.udemy.com/get-clients-how-to-get-coaching-or-consulting-clients/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T22:41:37Z"
}