{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Dieser Kurs unterscheidet sich von anderen Online-Kursen zur Suchmaschinenoptimierung: Die ist Ihr <strong style=\"\">Praxisleitfaden </strong>für ein Ranking auf den vordersten Plätzen von Google.<strong style=\"\"> </strong>Einfach erklärt, am Beispiel einer <strong style=\"\">eigens dafür geschaffenen Internetseite mit starker Konkurrenz: </strong>Wir zeigen wie man <strong style=\"\">wirklich </strong>bei Google ganz nach vorne kommt. </p><p style=\"\">Kein verklausuliertes Pseudo-Know-How, sondern <strong style=\"\">simple Techniken</strong>, die <strong style=\"\">effektiv </strong>zum Ziel führen und <strong style=\"\">dauerhafte Erfolge </strong>sichern. Etablieren Sie Ihre Webpräsenz ganz vorne vor dem Wettbewerb!</p><p style=\"\">Der Kurs umfasst in <strong style=\"\">mehr als 80 Minuten </strong>alle wesentlichen Aspekte, um auch den Rang Ihrer Domain bei den Suchergebnissen von Google zu verbessern. Insbesondere:</p><ul style=\"\"><li style=\"\">Die Suche nach dem richtigen Keyword</li><li style=\"\">Die richtige Domain</li><li style=\"\">Der richtige Server</li><li style=\"\">Der richtige Hoster</li><li style=\"\">Die optimale Seitenstruktur</li><li style=\"\">Anforderungen an den HTML-Code</li><li style=\"\">On-Site-Optimierungen</li><li style=\"\">Off-Site-Optimierungen</li><li style=\"\">Technische Tricks</li><li style=\"\">Googles aktuelle Änderungen im Suchalgorithmus</li><li style=\"\">Social-Media Optimierung</li><li style=\"\">Seiöser und dauerhafter Backlink-Aufbau</li><li style=\"\">Vorzüge von RSS-Feeds</li><li style=\"\"> und vieles mehr ...</li></ul><p style=\"\"></p><p style=\"\">Dieser Kurs richtet sich vor allem an <strong style=\"\">Anfänger</strong>, die auch ohne vertiefte Kenntnisse in HTML, CSS usw. herausragende Ergebnisse erzielen können. In diesem Kurs vermitteln wir nur erprobte und <strong style=\"\">leicht anzuwendende Techniken</strong>, die sich im Einsatz <strong style=\"\">bewährt </strong>haben und die von Jedem ohne tiefgreifendes Verständnis von Programmiersprachen kurzfristig und <strong style=\"\">erfolgreich </strong>umgesetzt werden können. </p><p style=\"\">Für diesen Kurs benötigen Sie <strong style=\"\">keine teure Spezial-Software</strong>! Wir arbeiten mit frei verfügbaren Ressourcen und werden beweisen, dass man ohne Bezahldienste auch in einem umkämpften Markt fantastische Erfolge bei den Suchergebnissen erzielen kann. Wir werden <strong style=\"\">völlig ohne AdWords-Kampagnen oder ähnliches </strong>arbeiten und uns der Tools von Google bedienen, um den Anforderungen von Google zu entsprechen.</p><p style=\"\">Unterrichtsmaterialien umfassen:</p><ul style=\"\"><li style=\"\"> Videos</li><li style=\"\"> Screencasts</li><li style=\"\"> Präsentationen</li></ul><p style=\"\"></p><p style=\"\">Am Ende des Kurses werden Sie Maßnahmen ergreifen können, die Ihre Webseite innerhalb kürzester Zeit wesentlich nach vorne bringen. </p><p style=\"\">Dieser Kurst ist bewusst <strong style=\"\">kompakt </strong>und <strong style=\"\">leicht verständlich </strong>gehalten. Er wird in den kommenden Wochen <strong style=\"\">weiter ausgebaut werden</strong>. Schon jetzt umfasst er bereits in komprimierter Form alles, um in wenigen Wochen spürbare Erfolge zu sehen. Die hier aufgezeigten Techniken werden mit steigendem Know-How und Kursfortschritt weiter verfeinert werden, um Ihr Verständnis von der Arbeitsweise von Google weiter zu schulen und Ihre guten Rankings nachhaltig zu schützen. </p><p style=\"\">Erwarten Sie von diesem Kurs <strong style=\"\">keine kritischen Techniken</strong>: <strong style=\"\">Wir werden nichts behandeln, was eine Abstrafung Ihrer Seite durch Google erwarten lässt.</strong> Im Gegenteil werden Sie anhand unserer Beispielseite sehen, wie man ohne viel Aufwand und <strong style=\"\">völlig legal </strong>seine Nische findet, ausbaut und einen kontinuierlichen Strom von wirklich interessierten und nutzbringenden Besuchern auf Ihre Internetpräsenz leitet.</p>", 
    "end_date": null, 
    "title": "Google SEO 2015 - Top-Rankings, trotz Panda-/ Penguin-Update", 
    "price": "20.00", 
    "instructors": "Thorsten Scherff", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516022_37e6_2.jpg", 
    "course_url": "https://www.udemy.com/google-seo-2015-top-ranking-trotz-panda-penguin-update/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-31T12:30:02Z"
}