{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course <strong style=\"\"><em style=\"\">Growing Your Business</em></strong>, we look at the stages of growth that a business goes through and the corresponding challenges during each stage. A growing business represents its own unique challenges that many people often don&#039;t think about. Many small businesses dream of growth – increased sales turnover, increased customers etc., but unless the company is geared to handle that growth – the company may find the whole operation could be at risk because they simple &#039;can&#039;t handle&#039; it. This situation is called &#039;over trading&#039;.</p><p> We look at where you are now, and how <strong style=\"\"><em style=\"\">the growth framework</em></strong> (which is a method whereby your business could grow exponentially) works and we look at ways and ideas in which the business could grow. A few simple changes – could result in huge increases. Simple, measureable changes.</p><p>We discuss the ways to manage the process because a growing business requires more resources and expertise to manage it. We look at 10 key issues when growth is present and how these issues can be resolved. There&#039;s different stakeholders within an organization who are all impacted when growth occurs.</p><p>We explore various sources of finance – how to fund this growing business – whether it&#039;s through other peoples time or other peoples money.</p><p>A work booklet is included for you to fill in. The course will take about 1 - 2 hours to complete. You watch the module and then fill in the workbook to apply to your own business situation.</p><p>If you are studying business at college, or if you are an owner/ manager of a growing business or if you have an interest in business growth – then you&#039;ll enjoy this course. We mix some textbook theory with some very practical examples. </p><p>You&#039;ll have very strong ideas to take away which will help you to grow your own organization.</p>", 
    "end_date": null, 
    "title": "Growing Your Business", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302792_9a0e_5.jpg", 
    "course_url": "https://www.udemy.com/growing-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-18T08:18:18Z"
}