{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated on December 2015:</strong></p><p><strong>Enroll on this Course right now</strong>. You can be making more money next week that you are doing today.</p><p>__________________________________________</p><p>***** <strong>Top 50 Udemy Authors in the Business Finance Industry</strong> - <em>eSkillsToday Award</em> *****</p><p>***** <strong>Ricardo is one of the best Instructors and my favorite when we are talking about Passive Income and Business Development. Hands down.</strong> - <em>Mike Robinson</em> *****</p><p>***** <strong>Over 1100 students enrolled!</strong> *****</p><p>__________________________________________</p><p><strong>Who is this course for and why you should take it (in 1 minute):</strong></p><p>Hello and welcome to the Course, where I’ll take you through the entire process of creating Passive Income sources, from scratch.  My name is Ricardo Ribeiro and I’m an awarding winning Instructor in the Business Finance Industry, with more than 15 years experience, owner of several successful businesses, with thousands of dollars made on Passive Income, and an enthusiast of Personal &amp; Business Development.</p><p>This certified course is for you that seeks to improve your overall making money online skills and build profitable passive income sources. Throughout the course we will cover techniques used by professionals, and walk you through a step-by-step process for creating profitable passive income sources on your own, that you will successfully benefit from for many years to come by not doing nothing more, and… I’ll even include a few “secrets of the pros.”</p><p>--------</p><p><strong>By taking this course, you will get as a BONUS; 5 lessons of one of my top selling courses “Think Like a Millionaire: Learn How Achieve Wealth &amp; Goals\", as a complement to this course.</strong><br></p><p>Imagine how amazing would be if you could leverage your time, not worrying about work or money, spend more time with your family and do all the things you really love. Well, it is possible, <strong>let me introduce you to a wonderful thing called Passive Income</strong>.</p><p>If you want to automate your income every month without exchanging work for money, be in charge of your time, live a wealthier life and if you want to improve your life in general, <strong>this is the course for you.</strong></p><p>Any money you will ever make, besides winning the lottery - and I wouldn't be waiting for that if I were you - will fall into one of these income categories; Passive Income or Active Income.</p><p><strong>Passive income: is the money you profit continuously from assets you have created or purchased. </strong>Here's an example; if you buy a house and rent it out for more money than it costs you to pay your mortgage and other expenses every month, that profit you make is considered passive income. Other example is writing a book, you only have to write it once and put it on the market for sale, after that, your only job is marketing that book to increase sales, <strong>giving you a steady influx of profit</strong>.</p><p><strong>Active income: is any income that is generated by your work. This is the most common way for making money, but its obvious downside is that once you stop working, you stop making money. </strong>Therefore, if you ever intend to be rich, this is definitely not the way to go. It's major downside is that you are exchanging time for money and that is limiting you to grow and earn more money. Imagine if you were a Shiatsu therapist, even if you had 1.000.000 people waiting to make an appointment with you, that wouldn't be possible, and therefore you would never receive that money from them, even with the high demand of your exhausted body… <strong>The only advantage is the immediate gratification, a misleading trap in my opinion</strong>.</p><p>Now that you know the difference maybe you can understand they're importance. Remember, you aren't getting younger, and things happen. <strong>Relying on active income is a risky business wrapped on a warming blanket.</strong> </p><p>Start thinking on your future, <strong>start putting money to work for you</strong>. There are many ways you can create passive income these days, and on this Course you will represented the Top 8 of them. <strong>The most profitable, easy to implement and with the lowest maintenance</strong>.</p><p>Here's another benefits of earning passive income, <strong>allowing you to leverage your time</strong>. Let's pretend you could pay all your bills using your passive income only, having to spend only a few hours a week working. You could for instance:</p><ul><li>Spend more time with your family</li><li>Earn money while laying back at the beach</li><li>Spend time writing that book you always wanted and that could help thousands of people</li><li>Spend time starting a business you truly love</li></ul><p>Imagine how amazing that would be if you could be experiencing this right now. <strong>Well, the truth is you can! You just need to get started</strong>… so let's begin.</p><p>I'm here to help you and I'm available to answer your questions and advice you along the way. Together we can make sure you have great success in your life.</p><p>NOTE: This course was created as an Introduction to Passive Income, and I believe is one of the best on Udemy. If you have some expertise on this subject it won't meet your high expectations, so don't leave bad reviews because of what you think it should be and not because of what it is. Thanks!<br></p><p>Thanks for your interest in this course. I put my hearth and soul on everything I do so you have my personal guarantee that you will absolutely love it as the happy students already enrolled, or <strong>you have 30 days money back guaranteed with no questions asked</strong>, so… you have nothing to lose. </p><p>I hope you’re as excited as I am!  If you’re ready to learn more and sign up for the course, <strong>go ahead and hit that Enroll button</strong>, or take a test drive by using the Free Preview feature. See you in the course!</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Guide to Online Business Opportunities for All Levels", 
    "price": "20.00", 
    "instructors": "Income Mastering Ricardo Ribeiro", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501602_e8ee_2.jpg", 
    "course_url": "https://www.udemy.com/guide-to-online-business-opportunities-for-all-levels/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T03:14:06Z"
}