{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is for coaches, consultants and other service providers who own their own business. You should take this course if you provide a valuable service and want to increase your business profit by adopting the best practices used by successful coaches. </p><p>Learn powerful business principles, strategies and tools that you need to use to turn your practice into a sustainable high-earning business. This is how the pros do it.</p><p><strong>Launch Your Business to the Next Level with the Business Strategy that Works Wonders</strong></p><ul><li>Create High Value Programs</li><li>Enroll More Clients at Premium Rates</li><li>Keep Clients Much Longer</li><li>Get Paid Automatically Indefinitely </li></ul><p><strong>How Top Coaches Earn More Money in Less Time </strong></p><p>Learning the simple practices that make top coaches successful empowers you to recreate your business model to earn your target income. This course is unique because you get real tools (worksheets, spreadsheets etc.) that help you design your business to produce your desired income in your desired time.</p><p>Achieve clarity on how you will earn your desired income through your business. No longer worry where the next client is coming from. Become confident in your business model by creating a system that works!</p><p><strong>Content and Overview</strong></p><p>Suitable for newer and experienced coaches and consultants, through this course of 11 lectures and two hours of content, you will learn the key business practices that top coaches use to keep their practice full of high-paying clients.</p><p>Starting with an examination into the thought processes that have prospective clients say “yes” to your services, this course will teach you WHY you want to offer programs (vs. hourly rates), HOW to design those programs, WHAT to charge and HOW to present your programs so that your prospects are eager to enroll with you.</p><p>Through the application of provided tools and step-by-step instructions, you will learn how to dramatically increase the average revenue you receive from your clients, and you will be set-up to receive residual income from them without invoicing.</p><p>Working alongside me, you will receive direct support and feedback to ensure you successfully integrate these practices to achieve exponentially greater business results. You will walk away with a proven system you can immediately implement that will keep your business running like a fine-tuned machine! </p>", 
    "end_date": null, 
    "title": "How Top Coaches Provide More Value In Less Time", 
    "price": "50.00", 
    "instructors": "Corey Stanford", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/638616_742a_2.jpg", 
    "course_url": "https://www.udemy.com/how-top-coaches-provide-more-value-in-less-time/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-12T21:26:07Z"
}