{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">  Over 1000 students have joined to become Networking Rockstars!  </strong>  </p>  <p>  \t                +++++++++++++++++++++++++++++++++++++++++++++++++++  </p>  <p>  \t                  You’ve likely heard the phrase...  </p>  <p>  \t<em style=\"\"><strong style=\"\">“It’s not what you know, but WHO you know”</strong></em>  </p>  <p>  \t                  It really is true.  </p>  <p>  \t                  What if you had an army of raving fans referring business to you, telling others about how great you are and being your trusted advisers when you need help with something in your business?  </p>  <p>  \t                  Having those resources available would almost guarantee your success in business.  </p>  <p>  \t                  The most successful people in the world created their success with the help of the people they are connected to... <strong style=\"\">Their network</strong>.  </p>  <p>  \t                  Networking is the most effective way to get in front of not just prospects but joint venture partners, potential affiliates, vendors and even mentors to help shortcut your learning curve.  </p>  <p>  \t        The people you know are the people who will help you get where you want in life. They are the people who will refer you, help you with the resources you need and of course, buy your products &amp; services.<br style=\"\">  \t<br style=\"\">  \t        Networking is the single growth tool you can implement in your business immediately starting with no money and get results almost immediately.<br style=\"\">  \t<br style=\"\">  \t        No matter how long you’ve been in business or what type of business you have, the more people you know, the more likely you will find the right people to lift you to the next level.  </p>  <p>  \t                  This course gives you the exact step-by-step plan to become a networking rockstar and create your own army of raving fans.  </p>  <p>  \t<strong style=\"\">About this course:</strong>  </p>  <ul style=\"\">  \t<li>You’ll learn where to network and get the most ROI for your time</li>  \t<li>How to find ready places your target customer already hang out</li>  \t<li>How to work a room without being “that salesy guy”</li>  \t<li>What it takes to make people remember you as the coolest person in the room</li>  \t<li>Where most people go wrong with their networking and why it doesn’t work for them</li>  \t<li>The single most important question in the world that will literally MAKE people want to do business with you</li>  </ul>  <p>  \t                  The steps I share with you in this course helped me take my first business from a total of 2 clients working out of my dining room (hoping not to have to get another job) to opening up an office with 5 employees and <em style=\"\">closing between 3-5 contracts a week</em> for a small web &amp; graphic design agency.  </p>  <p>  \t<strong style=\"\">All without ANY expensive advertising or hiring a marketing company.</strong>  </p>  <p>  \t                  Networking was the single tool I used to build that business to several hundred clients in a very short amount of time.  </p>  <p>  \t                  ALL within about a 20 mile radius of my house AND before we had the amazing tools we have today, like social media.  </p>  <p>  \t<strong style=\"\">See how I:</strong>  </p>  <ul style=\"\">  \t<li>Find great places to connect with the right people</li>  \t<li>What I do BEFORE the event to get a MASSIVE increase in success</li>  \t<li>How even an Introvert can become a hero in the room</li>  \t<li>What to do AFTER the event that so many people get wrong so you don’t do the same</li>  </ul>  <p>  \t<strong style=\"\">New to networking? </strong>  </p>  <p>  \t                  This course is great place to start and see results in the next 7 days!  </p>  <p>  \t<strong style=\"\">Already using networking?</strong>  </p>  <p>  \t                  Just applying one of the several strategies in this course could easily 10X your results!  </p>  <p>  \t<strong style=\"\">Just imagine if you got just one new client from the skills you learn from this course...</strong>  </p>  <p>  \t                  How much is a single client worth to you?  </p>  <p>  \t                  How much if you got only one new client per month from using these skills?  </p>  <p>  \t                  How much does that add up to in the next year?  </p>  <p>  \t                  How about for the entire lifetime of your career?  </p>  <ul style=\"\">  \t<li>I used these skills to triple my business in under 6 months.</li>  \t<li>One client of mine used one of these tools to bring in over 20 new leads to her business in under a month... selling a $10-20,000 product. (And that was just the first month.)</li>  </ul>  <p>  \t<strong style=\"\">As part of this Udemy course you get:</strong>  </p>  <ul style=\"\">  \t<li>You get free lifetime access</li>  \t<li>Exclusive “Student Only” live Q &amp; A sessions</li>  \t<li>All future extra lectures and upgrades are always free</li>  \t<li>Unconditional Udemy 30 day money-back guarantee and that&#039;s my personal promise to your success!</li>  </ul>  <p>  \t<strong style=\"\">Click the &quot;take this course&quot; button, top right, now and I look forward to helping you become a Networking rockstar!</strong>  </p>", 
    "end_date": null, 
    "title": "How I Used Networking To Triple My Business In 6 Months", 
    "price": "50.00", 
    "instructors": "Ely Delaney", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320488_0906_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-networking-rockstar-to-grow-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-15T22:20:51Z"
}