{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t       You've probably had many dreams of where you would like to take your small business...  </p>  <p style=\"\">  \t              It could be that you want to make a 6 or 7 figure income...  </p>  <p style=\"\">  \t     Or, it could be that you want to expand your business and succeed greatly...  </p>  <p style=\"\">  \t     Or maybe you just want to get more customers for your business...  </p>  <p style=\"\">  \t              Whatever your goals and visions are for your business, the one thing you will need to get there is a great plan.  </p>  <p style=\"\">  \t              Think about it for a minute...  </p>  <p style=\"\">  \t              Have ever wanted to get somewhere, and you didn't have the directions to get there?  How frustrating was that?  </p>  <p style=\"\">  \t   Didn't it save you so much time and frustration, when you could easily use your GPS to help you get to your location?  </p>  <p style=\"\">  \t <strong style=\"\">           A strategic plan is the GPS for your business</strong>.  A strategic plan is the roadmap that will:  </p>  <ul style=\"\">  \t<li style=\"\">Tell you what to do, step-by-step, in your business until you reach all your goals.</li>  \t<li style=\"\">Help you identify the most important things you should be doing so that you don't waste your valuable time and money.</li>  \t<li style=\"\">Help you break up your key actions steps into small chunks, so that you can do a little at a time, until you eventually reach all of your business goals.</li>  </ul>  <p style=\"text-align: center;\">  \t<strong style=\"\">Do I Need a 20 Page Business Plan?  No Way! </strong>  </p>  <p style=\"text-align: center;\">  \t<strong style=\"\"></strong> <strong style=\"\"></strong><strong style=\"\">Use this 1 Page Strategic Plan Instead...</strong>  </p>  <p style=\"\">  \t              Many people believe that you need pages and pages of complex information in order to build a successful business.  </p>  <p style=\"\">  \t              But that is <strong style=\"\">just not true</strong>...  </p>  <p style=\"\">  \t   Think about it... Do you read the 50 page manual that comes with all your electronic products? Or do you simply just follow the <strong style=\"\">1 page basic instructions</strong> that comes with the box?  </p>  <p style=\"\">  \t   They are both helpful, but the 1 page instructions get you started much quicker, and helps you to enjoy your product much faster.  </p>  <p style=\"\">  \t              In the same way, this 1 Page Strategic Business Plan will give you everything you need to reach all of your business goals.  </p>  <p style=\"\">  \t              Also, because it's so simple, it makes it easier to do everything you are supposed to do to succeed in your business.  </p>  <p style=\"text-align: center;\">  \t<strong style=\"\">Why is This Strategic Business Plan Just 1 Page?</strong>  </p>  <p style=\"\">  \t              Since 20% of the things we do bring 80% of the results, we've created a 1 Page Strategic Plan that focuses only on the <strong style=\"\">Top 20% that bring the biggest results.</strong>  </p>  <p style=\"\">  \t              Most business plans are full of a lot of unnecessary information, and they make you do a lot of steps that just waste your valuable time.  </p>  <p style=\"\">  \t              This 1 Page Strategic Plan only describes the <strong style=\"\">most important and powerful steps</strong> you should take to help you <strong style=\"\">achieve your 6 - 7 figure goals</strong>, or help you achieve all of your other goals.  </p>  <p style=\"text-align: center;\">  \t<strong style=\"\">Does this 1 Page Strategic Business Plan Really Work?</strong>  </p>  <p style=\"\">  \t              Absolutely!  </p>  <p style=\"\">  \t              This 1 Page strategic plan has helped many business owners take their business to the next level in their business by helping them:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Increase revenue by 30 - 50%.</strong></li>  \t<li style=\"\"><strong style=\"\">Operate more efficiently</strong></li>  \t<li style=\"\"><strong style=\"\">Get more customers</strong></li>  \t<li style=\"\"><strong style=\"\">Increasing profits</strong> by helping them use their money more wisely,</li>  \t<li style=\"\">And much more...</li>  </ul>  <p style=\"text-align: center;\">  \t<strong style=\"\">Will It Work for Me?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">If you're a small business owner or entrepreneur, and you have important goals that you want to achieve -  then <strong style=\"\">this 1 Page Strategic Plan will help you succeed.</strong></li>  \t<li style=\"\">If you're a person that wants to start a new business, but you want a <strong style=\"\">roadmap to help guarantee your success</strong>, then this 1 Page Strategic Plan will help create that roadmap for you.</li>  \t<li style=\"\">If you want to get yourself and your business to a <strong style=\"\">new level of success</strong>, this 1 Page Strategic Business Plan, will lay out a <strong style=\"\">step-by-step plan</strong> to show you everything you need to do.</li>  </ul>  <p style=\"\">  \t     There are 2 types of business plans:  </p>  <ul style=\"\">  \t<li style=\"\">Business plans to get you business funding and</li>  \t<li style=\"\">A Strategic plan to help you succeed in your business.</li>  </ul>  <p style=\"\">  \t <strong style=\"\"><strong style=\"\"> The \"How to Write the Ultimate Strategic Plan\" course will show you how to guarantee the success of your business, so that you can see all of your business goals, visions and dreams become a reality.</strong></strong>  </p>", 
    "end_date": null, 
    "title": "How to Write the Ultimate 1 Page Strategic Business Plan", 
    "price": 0, 
    "instructors": "William U. Peña, MBA", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/170840_3e57_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-the-ultimate-strategic-business-plan/", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-22T07:42:28Z"
}