{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is recommended for business owners or product/service designers who may have experienced failure with their products or services, so that they can re-design and find the right formula as quickly and as accurately for their products and services as possible - to ensure their competitiveness and success in the market place, or for launching new products or services from scratch. </p><p>Ensuring the right design for your product or service will increase the customer acceptance rate (acceptance rate == ratio of how many times customers choose to accept your product or service after considering it vs. how many times they choose to reject your product or service), and as a result will help you grow sales, revenue and market share. </p><p><em>If you're following the Lean Startup model (by Eric Ries), part of the \"fail fast\" process is to pivot from time to time to find a better direction or approach for your product or service. <br>This course is intended to help with figuring out <strong>'where and how to pivot' </strong>.</em></p><p><em></em><em><em>In order to decide about where and how to pivot, one would have to come up with some options, ideally options that are likely to make your product or your service successful and competitive in as a few iterations as possible, as opposed to trying to pivot in 'random' directions over and over again until the right formula can be found.</em></em></p><p><em>After taking this course, instead of 'randomly shooting in the dark' you will be able to find the best formulas to use for pivoting that are optimized by design to address the most important and most urgent customer values. </em></p>This course introduces a common language with specific terms and concepts, which can simplify collaboration across multiple people and streamline the communication within the organization to better achieve and maintain a shared understanding about what the target customers value and why (customer values) as well as background for the design decisions being made. The training materials <em>include a step-by-step guidance on how to apply incremental and iterative, highly agile process, </em><em></em> to<ol><li>identify <u>the most important (and often, most urgent) customer needs and values </u>that your products or services can target</li><li>ensure that your product or service provides <u>more benefit, more value in comparison with the investment </u>the customers would need to make (By investment we mean the price the customer would need to pay, or amount of energy, effort or time they will need to spend, or any change the customers would need to agree to make in their condition or their situation to take advantage of your product or service).</li><li>ensure that your product or service provides <u>more benefit and value in comparison with other alternatives</u> the customers may consider.</li></ol><p>Addressing these 3 key requirements will help ensure high customer acceptance of your product or service, as well as their competitiveness.</p><p><strong><u>One important point.</u></strong> After completing the Course Overview section, as you start with the second Section called 'Key Concepts &amp; Techniques', we recommend that you start applying the offered approach for your products and services while taking the course, one lecture, one step at a time. <br></p><p>We recommend that you do NOT move to the next lecture until you have a chance to internalize and apply the introduced concepts in each of the lectures to your business area, to your product or service first, and complete at least one cycle, one iteration, or one increment of the proposed process (using the offered templates and formats for each of the target documents). <br></p><p><strong><u>So, what will be required from you to complete this course:</u></strong><br><strong><u>1) Time</u></strong> - Allocate 2 hours to study the course content, and 3-5 days (with your team if applicable) to practice applying the methodology taught in this course to make design decisions about your product or services to prepare for the next pivot.<br><strong><u>2) Money</u></strong> - Pay for the course fee (currently it’s $299)</p><p>If your business is already maxed out, and is highly successful and no help is needed, you may choose not to go for it right now. </p><p>But if you have some room to grow, or if your products or services do not yet generate high enough acceptance rate, you may need to pivot, to adjust the design of your products or services. </p><p><u>This would require an investment of time and money.</u> Investing $299 to pay for the course (as it’s currently priced) and a week of your time should be doable, even if your company is only making currently $100K/year, or, especially, if you’re just starting out.</p><p>Our methodology will <em>help you increase the customer acceptance rate by design, which will increase your revenue and marketing as soon as the design decisions are implemented, typically within one year</em>, and <em>help avoid <strong><u>many</u></strong> person*months of your or your teams’ time </em>shooting in the dark, trying to find the sweet spot by guessing or by making a leap of faith that the approach you'currently pursuing will work. </p>  <p>If you do find it difficult to apply the taught approach for your company products and services, please contact us directly and we will be happy to offer a personalized, custom-tailored service for your needs.</p><p>So why wait, start now and give it a try. We offer 30-day money back guarantee!</p><p>Please note that this course does NOT get into<br></p><ul><li>assessment of the market opportunity (e.g. to ensure that there is enough demand),</li><li>development of the go-to-market strategy (it will be addressed in another course).</li></ul><p><br>The methodology taught in this course was originally developed for and applied primarily in high-tech industry, however it may be applicable to other industries, government services, public sector organizations as well as non profits, or for in-house internal initiatives within a company.<br></p><p><em><strong></strong></em></p>", 
    "end_date": null, 
    "title": "How to pivot? Find best formula for your product or service!", 
    "price": "50.00", 
    "instructors": "Entrespace LLC", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/547242_ddaa_7.jpg", 
    "course_url": "https://www.udemy.com/how2pivot/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T22:05:17Z"
}