{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The target audience for this course are business studies students who have to look at creating a strategy for new product and service development. It's also handy for those in business who have new products and services to develop and who are perhaps experiencing issues and/or challenges in this area of their business.</p><p>Are your business challenges / problems getting solved? Is there a strategy in place in your organisation to do this? Are you in an increasingly changing environment that needs to stay ahead of the game? </p><p>The course will take just over 1/2 hour to complete. Its structured around a series of videos. There are no course materials. It is to give the user some food for thought when looking at their business and when developing new products and services and resolving issues.</p><p>We look at how to identify problems. Sometimes just verbalising the problem sufficiently, is the key to resolving it. We look at problem definition, problem solving and then issues when resolving problems. We look at how to successfully implement new ideas - getting it from conception to implementation and how to get around issues that may be standing in the way.</p><p>This course isn't just for 'managers' but for those who work with people and have experienced or are experiencing any of the above situations / scenarios.</p>", 
    "end_date": null, 
    "title": "How to Successfully Implement a New Idea ", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372454_179b_3.jpg", 
    "course_url": "https://www.udemy.com/overcoming-barriers-to-product-and-service-development/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T15:51:15Z"
}