{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">In these <span style=\"\">8 lectures </span><strong style=\"\">you will learn</strong>;</p><ul style=\"\"><li style=\"\"><strong style=\"\">How to write proposals that</strong> will have your prospects begging to <strong style=\"\">give you money</strong><br style=\"\"></li><li style=\"\">The mindset you need to<strong style=\"\"> transform </strong>your dull proposal into a <strong style=\"\">money generating machine</strong><br style=\"\"></li><li style=\"\">The pitch sequence we use to <strong style=\"\">turn a cold prospect into a cash deposit</strong> into your account<br style=\"\"><br style=\"\"></li><li style=\"\">How to <strong style=\"\">turn one time investors into repeat investors</strong> (<span style=\"\">on average an investor funds at least 3 projects after the initial successful one</span>)<br style=\"\"></li><li style=\"\">How to get convince even the prospects that don&#039;t want to invest into <strong style=\"\">connecting you to a fellow investor that will be interested</strong>.<br style=\"\"><br style=\"\"></li></ul><p style=\"\">I know you <strong style=\"\">don&#039;t want to your proposal to keep collecting dus</strong>t, just waiting for your next little tweak. <span style=\"\">You need to <strong style=\"\">take it to the next level</strong>, you want to be able to boldly go into any office and hand them your proposal with <strong style=\"\">100% certainty that it will blow their socks off</strong></span>. </p><p style=\"\"><strong style=\"\">Only you can save your dream</strong>, nobody else will come and help you create the life that you deserve.</p><p style=\"\"><span style=\"\">By changing your mindset and learning How to Write a Business Plan Like a Venture Capitalist, <strong style=\"\">you will be securing your future</strong> business and you will be there to help your friends and family when they need it most.</span></p><p style=\"\"><strong style=\"\">*</strong>If within the first 30 days of taking this course you are not satisfied, you will be able to get a <strong style=\"\">full refund*</strong></p><p>  \t<strong style=\"\">You are only one click away from securing your first round of venture capital!A few years ago I was in the position that you might be in right now</strong>. </p><p><strong style=\"\">About Us</strong></p><p>I left my comfortable job as an accounts manger and decided to pursue a great business idea that I had. 3 months down the line and my unfinished business plan was collecting dust in a corner of my home office. I kept telling myself that it wasn&#039;t ready yet and that I would find an investor once it was perfect. <br style=\"\"></p><p>  \t<br style=\"\">  \t  But the actual fact was I was afraid. Like you I was not sure that my business plan was good enough, <strong style=\"\">I was afraid that if I showed it to an investor that they would just laugh in my face and never reply to my emails again.</strong> I would look online for any templates for drag and drop solution that I could find to help improve my proposal but despite all the little changes I made it never felt like it was quite there. <strong style=\"\">As entrepreneurs we want to have a business proposal that fills us with pride and confidence not doubt and shame</strong>. So as the weeks turned into months my initial burning fire for my project turned into a dim candlelight flickering in the wind.  </p>  <p>  \t  That was until I met my current business partner Peter Davy and he shared with me <strong style=\"\">the mind set and techniques</strong> that he used to raise funding for mines in DRC, a housing project for the United Nations and the lessons he learnt while he was the CEO of FTSE a listed company. Fast forward to today where we are currently working on a copper mine in Zambia, for which <strong style=\"\">we raised more than $250,000</strong>.  </p>  <p>  \t  What changed is that I learnt how to tailor my proposals for each individual prospect and I have also learnt how to pick and attract the right kind of investor for my projects.  </p>  <p>  \t  <strong style=\"\">We will be teaching you these skills on this course and as a bonus, Peter and I will personally answer any questions that you have to help build your dream business proposal.</strong>  </p>  <p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "How to Write a Business Plan Like a Venture Capitalist", 
    "price": "20.00", 
    "instructors": "Hugues Bugilimfura, Peter Davy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409894_654d_2.jpg", 
    "course_url": "https://www.udemy.com/venture_capital/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T13:32:47Z"
}