{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">This is an early launch price. Price will increase to $97 on January 31st 2015.</em>  </p>  <p style=\"\">  \t<strong style=\"\">    Learn how to get clients right away with this amazing strategy if you're starting out as a photographer with no experience.  </strong>  </p>  <p style=\"\">  \t      Utilize this strategy to get photography clients without requiring to show your experience and portfolio.  </p>  <ul style=\"\">  \t<li style=\"\">Learn the awesome foot-in-door offer so that you never get rejected by businesses ever again when you pitch them</li>  \t<li style=\"\">Learn how to make money even if a business doesn't like your photos</li>  \t<li style=\"\">Learn how to make even more money on existing clients</li>  </ul>  <p style=\"\">  \t<strong style=\"\">A Brilliant Marketing Strategy Any Photographer Can Use</strong>  </p>  <p style=\"\">  \t      Most photographers start their freelancing career by giving away free photoshoots. I wondered if it's possible to make money even without muh experience or a solid portfolio. And that's how this strategy was born.  </p>  <p style=\"\">  \t      Learn how to give businesses an amazing offer that they can't refuse so that you can build experience, expand your portfolio, and at the same time, pocket some profits as well.  </p>  <p style=\"\">  \t      If anyone comes to me asking how they can get started as a photographer, this would be the strategy I recommend them. Because it's simple and brilliant.  </p>  <p style=\"\">  \t      You will first get the high level overview of how this strategy works. You will then be taught how to approach businesses. You will also learn 1 amazing technique that can increase the chances of someone turning into your client. It involves using a certain social media. It is like painting the picture for your potential client, making them want your photos. A template of this technique is included in the course so you can use it right away without spending any extra effort.  </p>  <p style=\"\">  \t      Scripts are included as PDF files here, so you won't need to worry about not knowing what to say when approaching businesses. You will be guided every step of the way until you get paid.  </p>  <p style=\"\">  \t      At the end of this course, you will have a good strategy that you can rinse and repeat to get as many clients as you want.  </p>", 
    "end_date": null, 
    "title": "How to Attract and Retain Clients as a New Photographer", 
    "price": "45.00", 
    "instructors": "Tyler Foo", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382844_8800.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-200day-as-a-new-photographer/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T08:33:20Z"
}