{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong>~30 days Money Back Guarantee~</strong></p><p>You know that feeling when you feel like you are digging a never-ending hole with no end in sight and really struggling to get your first book published by a 'real' publisher?</p><p>It's not tough once you learn the hacks of successful celebrity authors like Karan who grabbed a <strong>$80,000 deal from Penguin</strong> for his Debut novel in the US.</p><p>In this course, we (Karan and Harsh) teach self-published authors and wannabe authors on how to get a book published by a traditional publisher. I ask Karan, some of the toughest questions you could ever ask to a celebrity author.. </p><p><strong>This course is an actionable approach to get your book finally published by a publisher.</strong><br></p><p>✔ Create a blueprint for your outreach campaign</p><p>✔ Understand, how to approach a Publisher<br></p><p>✔ Clarify all the doubts about publishing a book<br></p><p>✔ Learn the craziest publishing shortcuts</p><p>✔ Even better than a thousand dollar course</p><p>✔ Avoid the mistakes and hack your way to success</p><p>✔ Proven techniques and results</p><p>✔ Actionable tips that you can implement today</p><p>✔ Very easy to understand and implement</p><p>✔ Get 1-on-1 help from instructors</p><p><strong>How is this course structured?</strong></p><p>I have taken a whole new approach to making this course more interactive. You will find <em>Video Lectures, Audio Lectures, Visual Workbooks, Quizzes to Weekly Q&amp;A sessions.</em></p><p>It's really exciting once you get started with this course. I am waiting to see you on the inside....<br><br><strong>About Karan Bajaj:</strong> Karan Bajaj is an Indian American author of three contemporary Indian novels, <em>Keep Off the Grass</em> (2008), <em>Johnny Gone Down</em> (2010) and <em>The Seeker</em> (2015). Bajaj's first novel, <em>Keep Off the Grass</em>, which became a bestseller with more than 70,000 copies sold in the year of release, was a semi-finalist for the Amazon Breakthrough Novel Award and was longlisted for the Indiaplaza Golden Quill Award. Together his novels have sold more than 200,000 copies in India.<br><br><br></p>", 
    "end_date": null, 
    "title": "How to Get a Book Published by a Traditional Publisher?", 
    "price": 0, 
    "instructors": "Harshajyoti Das", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649494_ea09_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-book-published/", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-24T11:01:31Z"
}