{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Have You Ever Been Frustrated When A Pirate Stole Your Content?</strong><br></p>\n\n<p>Have you ever lost sleep because pirates and black hats are sharing your content on their websites?</p><p>Are people unlawfully sharing and downloading your content right now?</p><p>If that's the case, I know what you're going through.</p>\n\n<p>See, I've been publishing content for years. I still remember the first time my content was stolen by a pirate.</p><p><strong>I Nearly Had A Heart Attack!</strong></p><p><strong></strong>Things have changed drastically since then. Because now, I create my content so that even if it's pirated, I still benefit hand over fist.</p>\n\n\n\n<p>So, if you'd like to benefit tremendously no matter who watches your content, then you're going to love this course.</p>\n\n\n\n<p>So ask yourself how that would feel? How would it feel if instead of stressing out, and losing focus because of piracy problems, that you turn the tables?</p><p>Imagine if the next time you saw a black hat or pirate stealing your content, you couldn't help but crack a<strong><em> <u>big fat smile?</u></em></strong></p><p><strong><em><u></u></em></strong>You might even <strong><em><u>burst out laughing,</u></em></strong> because they'll be falling right into your master strategy that you learn in this course.</p><p>If that would feel good, then you're going to love this course.</p>\n\n\n\n<p><strong><em>Enroll Now So You Can Finally Have Revenge Against The Shady Black Hats And Pirates! And So You Can Take The Power Of Your Own Creations Back!</em></strong></p>", 
    "end_date": null, 
    "title": "How To Benefit Tremendously When Pirates Steal Your Content", 
    "price": "20.00", 
    "instructors": "Mike DeVincent", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/752984_7382_3.jpg", 
    "course_url": "https://www.udemy.com/piracy-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T00:58:46Z"
}