{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    *************6000 Plus Students... Join this Growing Community********************  </p>  <p>  \t    -----------------------------------------------------------------------------------------------------------  </p>  <p>  \t        Qualify and get a prospect's interest within a minute, is a course designed to help small business owners, entrepreneurs and marketers in developing a statement that would differentiate you from the competition.  </p>  <p>  \t        As small business owners it is becoming more and more difficult to stand out out of the crowd.  But differentiation is key for us to  </p>  <p>  \t         grab the market share necessary to survive.  This course concentrates on formulating an answer to the common but very important question <strong>WHAT DO YOU DO?</strong>  </p>  <p>  \t        The question what do you do? is one of the most common question that you will face in network circles and in day to day interaction.  Formulating an answer to that question that would <strong>attract and qualify your prospects, will set you apart from the rest of the businesses.</strong>  </p>  <p>  \t        The course is composed of a series of videos that will guide you through why you need to have a good <strong>captivating</strong> answer the that question as well as help you formulate it.  There are <strong>action steps</strong> that will help you understand your customer as well as your business further.  </p>  <p>  \t        By the end of the course you should have a good grasp of your ability to solve your customers problems and be able to articulate it to them in a quick, concise answer to the question <strong>What Do You Do?</strong>  </p>", 
    "end_date": null, 
    "title": "How to Qualify And Get a Prospect's Interest...", 
    "price": 0, 
    "instructors": "Julio A Lara", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301644_4834_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-qualify-and-get-a-prospects/", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-16T22:58:16Z"
}