{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Innovation! </strong>is a set of easy to use tools and practices, clearly explained step-by-step, to help you generate 100s of new product and service ideas in just a few hours. These product innovation tools have been used by leading companies to generate hundreds of innovation ideas for any product or service. This course will teach you this systematic innovation methodology, and provide you with templates and instructions that can be applied to any product, service or industry.  </p>\n\n<p>  \t        The innovation methods explained in the course have been developed by examining hundreds of thousands of innovations in products and services. Using this methodology, I have facilitated product and service innovation workshops and processes at companies such as Motorola, Teva Pharmaceuticals, Intel, Nestle, Max Brenner, YES Satellite Television and in a variety of other companies from the Food, Construction, Retail, Software, High tech, Finance, Education, Textile, Travel and other industry and service sectors.  </p>\n\n\n\n\n\n<p>  \t        Using the product innovation tools in this course you will be able to:<strong>:</strong>  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>Easily create hundreds of product and service innovation ideas for any product or service</li>  \t<li>Quickly choose the best ideas with internal and external innovation screening techniques</li>  \t<li>Grab the attention of your clients with Creative Advertising Templates</li>  \t<li>Download and use resources and templates for innovation for you and your team</li></ul>\n\n\n\n<p>  \t        --------------------------------------------------------------------------------------------------------------------Here's what students say about this course:  </p>\n\n\n\n\n\n<p>  \t<strong><em>\"</em><em>Great value for money!</em></strong>  </p>\n\n\n\n\n\n<p>  \t<em>Amir - you have done a wonderful job, introducing us to a structured process, that brings the elusive concept of innovation from 10,000 feet down to earth. Many thanks.\"</em>  </p>\n\n\n\n\n\n<p>  \t<strong>Lior Haber, Experienced VP at High-Tech firms</strong>  </p>\n\n\n\n\n\n<p><em>\"<strong>Jam-packed with tools and templates</strong></em><br></p>\n\n\n\n\n\n<p><em>This course exceeded my expectations. I bought it hoping to scan through to get an idea or two... I watched every minute and will re-watch several lessons as I move forward with my own business development process.</em></p>\n\n\n\n\n\n<p><em>Amir is engaging, his slides are visually interesting and easy to follow, his downloadable templates are excellent. I've paid for university continuing studies courses that did not deliver as much value as this course did -- and, at a much lower cost.</em></p>\n\n\n\n\n\n<p><em>At a meta level, Amir's course in product and service innovation is also a course in best practices for teaching a Udemy course! I wish they were all this good.\"</em></p>\n\n\n\n\n\n<p><strong>Donna Barker, Chief MemWow! Creator</strong></p>\n\n\n\n<p>  \t              --------------------------------------------------------------------------------------------------------------------  </p>\n\n\n\n\n\n<p>  \t<strong>So what will you learn by taking part in this workshop?</strong>  </p>\n\n\n\n\n\n<ol>  \t<li>The important fundamentals of a Systematic Innovation approach and process</li>  \t<li>The most critical insights and tips for making product and service innovation work for you</li>  \t<li>Powerful tools to generate innovation ideas quickly and repeatedly</li>  \t<li>Clear examples from a variety of product and service innovation to learn from</li>  \t<li>Reusable templates for you and your team to download and apply for your own innovation</li>  \t<li>Bonus tools! - Creative Advertising Techniques</li>  </ol>\n\n\n\n\n\n<p>  \t        ---------------------------------------------------------------------------------------------------------------------</p>\n\n\n\n<p>Join me in the Practical Innovation Workshop now!</p>", 
    "end_date": null, 
    "title": "Innovation Mastery: How to Create Product Innovation Ideas", 
    "price": "30.00", 
    "instructors": "Amir Elion", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313194_d453_5.jpg", 
    "course_url": "https://www.udemy.com/innovate-a-practical-product-service-innovation-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-04T05:01:25Z"
}