{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t How can your company benefit from the global marketplace?  </p>  <p style=\"\">  \t International  markets present huge opportunities...but only to those companies with  clear goals, in-depth strategies and visibility to measure performance.   I&#039;m sure you&#039;ve heard people say things like, &quot;There are 1.2 billion  people in China and if I can only capture 1% of that market, my revenue  and profitability will skyrocket.&quot; or &quot;With Brazil&#039;s current  growth rate, how can we not succeed by offering our product for sale in  that market?&quot;  </p>  <p style=\"\">  \t When companies struggle, it is often because they:  </p>  <ul style=\"\">  \t<li style=\"\">Enter markets without properly understanding the intricacies of their target markets</li>  \t<li style=\"\">Lack a cohesive go to market strategy for each particular country</li>  \t<li style=\"\">Are inflexible in their positioning or product features</li>  \t<li style=\"\">Don&#039;t understand the total costs of doing business in their target markets</li>  \t<li style=\"\">Refuse to invest the proper resources needed for success</li>  </ul>  <p style=\"\">  \t While  there are many large population centers throughout the world, how can  that translate into a successful business?  Not all markets are created  equal, and when you take into account disposable income, unique  regulations, competition, distribution channels and operating costs, you  may be surprised at which countries you should be targeting.  </p>  <p style=\"\">  \t This  course will help you make intelligent decisions as you expand your  business internationally.  It provides a blueprint for researching  markets, setting clear and realistic goals, evaluating various market  entry options, modeling your international business and growing your  global business long term.  </p>  <p style=\"\">  \t As an executive and entrepreneur whose companies have consistently generated more than 50% of revenue and profitability outside of the United States, I have successfully setup sales offices, distributorships, licensing partnerships, R&amp;D centers, joint ventures and mergers with overseas companies in Asia, Europe and Latin America.  My course captures my years of learning into a concise, detailed plan to help you succeed in your international expansion.  As part of this course, I also discuss many of the pitfalls to avoid when expanding internationally, because mistakes in foreign markets can be quite costly.  </p>  <p style=\"\">  \t Since every company has its own unique circumstances, I make myself available via e-mail and phone to assist you in planning your global expansion.  If global expansion is done right, your ROI can be incredible!  </p>", 
    "end_date": null, 
    "title": "International Expansion: A Blueprint for Success", 
    "price": "45.00", 
    "instructors": "Anthony Gioeli", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/67740_ce84_7.jpg", 
    "course_url": "https://www.udemy.com/international-expansion/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-21T22:08:08Z"
}