{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>What if you could sit down with a group of small business owners who have operated their businesses for decades and learn from their mistakes? What if you had the chance to have your questions answered by those that have already been there, already done that, already made it work, or already learned what not to do? Well now you have that chance.&nbsp;</p><p>The first module in &quot;Lessons Learned&quot; is geared specifically towards 8 critical lessons learned in entrepreneurship. What works in business today to achieve so-so results, and what works to help you crush it! We will also cover several things that you should steer away from.&nbsp;</p><p>Next we cover the reason why you need to find a business that you are passionate about. Let&#039;s face it without enough passion to get you out of bed every day, you won&#039;t be successful in your business. The cool thing that we also discuss about being passionate in your business, is how to balance your passion and enthusiasm with reality and facts.&nbsp;</p><p>We then move into 8 Smart Ways to Launch or Expand Your Business. These are eight areas in business that we don&#039;t usually spend a lot of time on, but as you will see, you will be asking yourself &quot;Why didn&#039;t I think about, or spend more time on these things earlier?&quot;</p><p>We wrap up this course with some critical discussions about Jumpstarting Your Business. Tools, resources, strategies and ideas that will be a refreshing overview of not only putting the fun back into your business, but how to stir up a success formula that will help your business to grow...even explode with new business.&nbsp;</p><p>There are over 3.5 hours of training in this course and it was a lot of fun putting it together. When you wrap up this course in The Entrepreneur&#039;s Playbook series you will be armed with the tools, ideas, and new found resources that will propel your business to the next level of success. And, will get you prepared to rock in the next course &quot;Success by Systems&quot;&nbsp;</p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Jumpstart Your Business!", 
    "price": "40.00", 
    "instructors": "Brian Hazelgren", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37562_73bc_9.jpg", 
    "course_url": "https://www.udemy.com/lessons-learned/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-22T21:44:04Z"
}