{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    This course will help you quickly establish a company wide vision and framework for developing and implementing a winning digital strategy and transformation program.  </p>  <p>  \t<strong>Establish And Lead A Successful Digital Strategy And Transformation Program.</strong>  </p>  <ul>  \t<li><strong></strong>Learn how to define a successful and comprehensive digital strategy</li>  \t<li>Establish a vision and plan and build company wide support</li>  \t<li>Define and layout an integrated transformation roadmap</li>  </ul>  <p>  \t<strong>This course helps you understand, communicate and build the consensus required for your company to develop and execute a successful digital strategy and transformation program.</strong>  </p>  <p>  \t  It is designed to provide you the insight and skills you you need to transform your company into a digital leader capable of thriving in a market driven by continual digital innovation. It includes 28 lectures, as well as discussion guides and work books that help you organize and execute quickly and effectively.  </p>  <p>  \t<strong>Topics covered in this course include:</strong>  </p>  <ul>  \t<li>Market drivers and digital disruption</li>  \t<li>Transformational opportunities and threats</li>  \t<li>Working with visionary customers and partners</li>  \t<li>Development of transformational digital product, marketing, and operational systems strategies.</li>  \t<li>Capabilities and competencies required to build and sustain your company's role as a digital leader including:</li>  \t<li>“Always-On\" Customer and Technology Insight</li>  \t<li>Leading Edge Data / Analytics</li>  \t<li>Continual Innovation</li>  \t<li>Development of a Digital Culture</li>  \t<li>And, the key phases of digital transformation and the requirements for their success.</li>  </ul>  <p>  \t<strong>This course is part of the “Competing for the Digital Future Leadership Program for Digital Strategy and Transformation\". </strong>It passes on lessons to you based on years of experience working within Silicon Valley for companies like Apple and Adobe as well as startups, helping them and their customers transform emerging technologies into business momentum  </p>  <p>  \t<strong>It will save you and your company months of precious time </strong>by helping you organize and align the efforts required to set your company on a path to digital leadership and avoid the pitfalls that lead to digital disruption.  </p>", 
    "end_date": null, 
    "title": "Kick Start Your Digital Strategy and Transformation Program", 
    "price": "25.00", 
    "instructors": "Mike Connor", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362522_ee04_4.jpg", 
    "course_url": "https://www.udemy.com/intro-to-digital-strategy-and-transformation/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T20:28:16Z"
}