{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      Target groups for this course on Knowledge Management (KM) tools for SMEs are students, practitioners from SMEs and SME support institutions, trainers, consultants, coaches and all other people interested in innovative SME management.  </p>  <p>  \t      Various KM tools exist to manage knowledge effectively within a company. By bringing together all the information available in a systematic manner, knowledge is capable, when managed and utilized as an important organizational asset, to significantly augment people's output and efficiency.  </p>  <p>  \t      The course on KM tools for SMEs will consist of eight sections and 24 lectures. The first section will serve as an introduction to the course including a short presentation concerning the course layout and the course objectives. Moreover, the first section shall give a general overview on the area of KM and various KM toolsets. After the lectures of the first section, a quiz has to be taken to test the basic concepts on KM toolkits.  </p>  <p>  \t      Subsequent lectures will present each week one of the KM tools: Competence Matrix, International Communication, Lessons Learned, Idea Competitions, Business Intelligence and finally Knowledge Market.  </p>  <p>  \t      The sections covering the KM tools each consist of one video, a written documentation on how to implement the respective tool. Subsequently, a case study is presented at the end, in which students see how this tool can be applied in practice. External resources or downloadable material for further reading will be provided. Quizzes will test the participants know how.  </p>  <p>  \t      KM is particularly of great importance for SMEs as they are stronger influenced by increasing global competition, fast shifts in technology, economic uncertainties, times of instability and market turbulences than bigger enterprises.  </p>  <p>  \t      In this respect, offering valuable information about KM tools can help SMEs to understand, evaluate and apply these tools into their daily routine and in particular during turbulent times.  </p>", 
    "end_date": null, 
    "title": "Knowledge Management Tools for SMEs", 
    "price": 0, 
    "instructors": "Dynamic SME, Prof. Dr.  Klaus North", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276894_0f9c_6.jpg", 
    "course_url": "https://www.udemy.com/knowledge-management-tools-for-smes/", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-07T22:01:19Z"
}