{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will help you define, plan and lead a successful <strong>digital business </strong>strategy and transformation planning effort for your company. This is not a course in digital marketing planning.</p><p><strong>It will help you organize and facilitate an in-depth team planning meeting that aligns and focuses your company on a common digital business strategy and transformation plan.</strong></p> <ul> <li>Learn what information you need to gather prior to the meeting</li> <li>Learn how and facilitate the meeting to build consensus and momentum </li> <li>Learn how use meeting results to establish priorities and next steps </li> </ul> <p><strong>This course helps you define, and build the consensus needed to establish and support a high performance digital strategy and transformation plan </strong></p><p>The course content focuses heavily on planning tools and discussion guides for the key topics you and your team will need to address.</p><p>It is designed to help you lead your company in objectively assessing their current state of readiness, and developing and aligning them on an integrated cross company vision, strategy, and transformation plan. It will help you lead the team identifying gaps in insight and knowledge, and in developing a prioritized plan to address those gaps while moving your strategy ad implementation effort forward. It provides a framework for identify your requirements, gathering needed information and insight, and facilitating a powerful planning session.</p><p>The course includes lessons, discussion guides and in-depth templates for gathering the needed information. It also includes a detailed meeting agenda as well as specific facilitation guides for each planning area. It will save you a tremendous amount of terms of organize and holding a highly effective and integrated digital business strategy and transformation planning meeting quickly and effectively.</p><p><strong>This is Part Two of a Two-Part course titled “Building a Digital Strategy and Transformation Dream Team\".</strong></p><p><strong>Part Two lessons include:</strong></p><p><strong>Information on strategy, readiness, and requirements from the following areas to support the planning meeting </strong></p> <ul><li>Product</li> <li>Marketing and Customer Journey</li> <li>Operational Systems</li> <li>Customer Insight</li> <li>Technology Insight</li> <li>Data and Analytics</li> <li>Continual Learning and Innovation</li> <li>Digital Culture</li> <li>Departmental strategy, readiness, and requirements</li> </ul><p><strong>Meeting agenda and facilitation</strong></p><ul> <li>Customer Segmentation and Profiles</li> <li>Emerging Technology and Ecosystems</li> <li>Digital Influencers and Trends</li> <li>Competitive Environment</li> <li>Current Strategy</li> <li>Future Vision and Strategy</li> <li>Impact Analysis</li></ul> <p><strong>Setting next step priorities for discovery in the following areas</strong></p> <ul><li>Customer Segment / Profiles / Personas</li> <li>High Value Outcomes / Experiences</li> <li>Emerging Technology</li> <li>Digital Ecosystems</li> <li>Digital Culture / Influencers</li> <li>Industry Value Chain Profiles</li> <li>Visionary Partners</li> <li>Competitive Landscape</li> <li>Always-On Innovation Zones</li> <li>Departmental Insight</li></ul> <p><strong>Part One, titled “Identifying and Building Digital Leadership Talent\",</strong> provides an in-depth guide to identifying, developing and supporting a high performance digital leadership team. The course helps define, structure, identify and manage an exceptional team of people capable of establishing your company as digital leader. Part One is available for purchase separately. Part One &amp; Two may be purchased together for a discount under the title “Building a Digital Strategy and Transformation Dream Team\".<strong></strong></p><p><strong>These are all part of the “Competing for the Digital Future Leadership Program for Digital Strategy and Transformation\". </strong>The program passes on lessons based on years of experience working within Silicon Valley for companies like Apple and Adobe as well as startups, helping them and their customers transform emerging technologies into business momentum</p><p><strong>The Competing for the Digital Future Leadership Program will save you and your company months of precious time </strong>by helping you organize and align the efforts required to set your company on a path to digital leadership and avoid the pitfalls that lead to digital disruption.</p>", 
    "end_date": null, 
    "title": "Leading Team Planning for Digital Transformation", 
    "price": "20.00", 
    "instructors": "Mike Connor", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512372_9786_2.jpg", 
    "course_url": "https://www.udemy.com/leading-team-planning-for-digital-transformation/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T01:04:26Z"
}