{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The class talks about how to<strong> </strong>build your personal brand in the digital world and focuses primarily on your Linkedin profile as the centerpiece of your career. A vast portion of the class is a social media training class and covers the mechanics of how to better position yourself within the Linkedin ecosystem and how to use your profile to further your business interests.</p><p>The objective of the class is to position you as an authority in your field. In order to do so we will go over 38 tips that will allow you to rank No.1 for your profession on Linkedin.  We will learn basic SEO (Search Engine Optimization) concepts, Linkedin marketing and how to track &amp; manage your online reputation.</p><p>The people that most benefit from this class are those who would like to keep growing professionally and aspire to have an optimized business profile on LInkedin, one that is SEO friendly and shows up on recruiter searches.</p><p>The 3 steps to a better career are: </p><p>Identify your competitive advantage</p><p>Create your digital CV (personal website, business Linkedin profile, google search results for your name and your social media persona)</p><p>Get a better job</p><p><br></p><p>Tags:</p><p>Linkedin marketing, linkedin for business, linkedin profile, linkedin job search, linkedin advertising, digital reputation, personal brand, SEO optimization, Linkedin essentials, Linkedin 2016 tips, Linkedin workshop, Linkedin profiles for online marketers<br></p>", 
    "end_date": null, 
    "title": "Linkedin for executives: 40 proven tips to ranking No.1", 
    "price": "20.00", 
    "instructors": "Valeria Dominguez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498180_28a3_6.jpg", 
    "course_url": "https://www.udemy.com/linkedin-to-win-38-tips-to-ranking-no1/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-10T12:05:59Z"
}