{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                      \"In 1995 I had 7 bucks in my pocket and knew two things, I was broke as hell and 1 day I won't be\" - Dwayne \"The Rock\" Johnson  </p>  <p>  \t                                  The Forex market is the largest worldwide market with over 5<em> trillion dollars </em>traded each day, that is more than enough reasons why you should, <em>take this course</em>.  </p>  <p>  \t              ******Limited time offer <em>t</em><em>ake this course at</em> $99, before the price is back at  $200******  </p>  <ul>  \t<li><strong>Be your own boss, this course is for anyone who is interested in <em>making money</em> online whether from home or from work.</strong></li>  \t<li><strong>If your tired of getting up to work for someone else, then <em>take this course</em></strong></li>  \t<li><strong>Learn a method of reading the market that less than 1% of traders know</strong></li>  \t<li><strong>5 Star rated, a community of over 1000 students </strong></li><li><strong>When you buy this course you will also get access to 4 Step System ebook one of the best selling Forex ebooks on Amazon valued at $13.49 completely free!</strong></li>  </ul>  <p>  \t<strong></strong>This course is made up of 10 video lectures and 5 pdf lectures divided over 3 sections. In section 1 you will learn about the Forex market and terminologies, you will learn about support and resistance, candlesticks and RSI divergence. In section 2 you will learn what is supply and demand how to recognized signs of supply/demand on charts and you will learn different market entry techniques. You will also learn where to place stops and when to take profit.  </p>  <p>  \t                            In section 3 you will learn the 4 step confirmation technique and how to use this technique to make money. You will see examples of trades I have taken in the past , you will see my entry, my take profit and you will see how much money I make on each trade; you will see proof that its possible to make $3000 or more in a day trading Forex. This course is not a get rich quick course, however this is a course that will equip you with the knowledge to make a comfortable living online trading Forex.  </p>  <p>  \t                              This course can be completed in 1 or 2 days  </p>", 
    "end_date": null, 
    "title": "Making A Living Online Trading Forex ", 
    "price": "30.00", 
    "instructors": "Luciano Kelly", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/236812_8527_6.jpg", 
    "course_url": "https://www.udemy.com/4-steps-to-making-a-living-online-trading-forex/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-04T00:30:13Z"
}