{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">We all want more customers. It does not matter who you are—a lawyer, a physician, or perhaps a realtor. More customers may bring you more income, but the question becomes: Where are those customers?</span>  </p>  <p style=\"\">  \t       Anthony Robbins says, “If you do what you have always done, you will get what you have always gotten.” Accordingly, you need to modify your dreams or magnify your skills to be more successful in your business. That’s why I am going to share with you some Golden Steps that may help you get more customers and become more profitable.  </p>  <p style=\"\">  \t        Come join us for this very informative course, on how to get more customers for your business and learn:<br style=\"\">  \t<br style=\"\">  \t        •New trends and challenges of marketing <br style=\"\">  \t        •Great techniques to know your current situation <br style=\"\">  \t        •How to set goals and make plans<br style=\"\">  \t        •How to implement your marketing plans<br style=\"\">  \t        •Practical tips to improve your business marketing  </p>  <ul style=\"\">  \t<li style=\"\">How to make your website more attractive to visitors</li>  \t<li style=\"\">Great techniques to improve your website ranking</li>  \t<li style=\"\">Golden tips to use social networks more effectivelly </li>  \t<li style=\"\">How to design effective brochures and business cards</li>  \t<li style=\"\"> How to use video marketing and Youtube to get more customers</li>  </ul>", 
    "end_date": null, 
    "title": "Marketing Mastery ( The Complete Guide to Get Customers )", 
    "price": "20.00", 
    "instructors": "Ali Asadi", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61591_8f5d_6.jpg", 
    "course_url": "https://www.udemy.com/a-complete-guide-to-get-more-customers-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-23T19:13:54Z"
}