{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is for those who are studying Marketing - specifically Marketing Research or who want to learn more about Marketing Research - practical techniques which can be used in business on a strategic level. The course is ideal for those who have a business in mind, as the tasks are very practical and it'll be useful to you to undertake research which you can then take and apply in real life.</p><p>The course is all about market research, market segmentation, the marketing mix and marketing planning. We'll briefly cover the fundamentals of marketing (the Marketing Concept) and how Market Research can be structured, applied and conducted.</p><p>Market Research is essential in any business - whether the business has already commenced or is in the start-up phase. One of the key principles of Marketing Fundamentals is to 'find out what the customer wants' and 'give it to them' - and in essence, this is what Market Research is all about. There is different techniques to carry out the research - all have their pro's and cons and this course covers this.</p><p>A workbook is included for the student to fill in, so that they can keep their notes in one place. It is useful to have a business or business idea in mind, so that as we go through the course, you can apply the content to something real. </p><p>The course will take approx 2-3 hours to complete, excluding any actual research that you might do for yourself. There is a series of lectures. The way the course is structured - watch the lecture, and then fill in the workbook. Complete the task and then move onto the next lecture. </p><p>This course should be taken by those who want to understand Market Research and Marketing strategy. It's ideal for marketing students, or those in business who want to improve their business performance. Note that market research can be conducted on customers - but it can also be used internally, on staff - to gauge happiness levels, it can be used on suppliers and it can be used for competitor analysis. This is why its a strategic tool.</p><p><br></p>", 
    "end_date": null, 
    "title": "Marketing Research & Strategy", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371814_7aaf_2.jpg", 
    "course_url": "https://www.udemy.com/marketing-research-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T22:11:26Z"
}