{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Making money is an exact science.  Do things a certain way and get a specific result - every time.  The challenge is most people don't know what to do; don't know the certain way; and can't figure out how to achieve a specific result.  To further complicate matters, most people don't understand what money is, what business is all about, or even what they are after in the end.  <strong><em>MONEY, The Fundamentals </em></strong>explains all that.  Learn what money is, what business is all about, and what people are really after.  It's likely not what you think.  Then discover the scientific process for making money.  It's all very simple really - not necessarily easy, but simple.  </p>\n\n<p><strong><em>MONEY, The Fundamentals </em></strong>takes the complexity out of money and markets by drilling down to the fundamentals - the fundamentals few people understand.  Since most people are confused about the fundamentals, most people prefer to believe making money is hard.  Stop telling yourself that.  Making money is not complicated; it's not difficult.  It doesn't take money to make money.  It just takes a little vision, drive and determination; oh, and you must do things a certain way.</p>\n\n\n\n<p>Everyone has the ability to make money - lots of money.  It's a matter of knowing what to do.  Sometimes all it takes to finally figure something out is to look at things from a new perspective.  <strong><em>MONEY, The Fundamentals </em></strong>offers exactly that - a new perspective.</p>\n\n\n\n<p>This course includes a .PDF version of the book:  <strong><em>MONEY, The New Science of Making It</em></strong>.</p>\n\n\n\n<p>The course is organized in four sections totaling 18 lectures (each approximately seven minutes long) including an Introduction and Summary Conclusion.  Each section includes <strong><em>Concept Review Questions </em></strong>and a <strong><em>Self Development Exercise </em></strong>to assist you with changing your perspective regarding money and focusing you on the essential elements of making money.</p>\n\n\n\n<p>If you have \"tried it all\" maybe it's time to start at the beginning and ground yourself in the fundamentals.  Mastery of anything is really mastery of the fundamentals.  Learn the fundamentals of <strong><em>MONEY</em></strong> right here.</p>", 
    "end_date": null, 
    "title": "MONEY, The Fundamentals", 
    "price": "20.00", 
    "instructors": "Scott F. Paradis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/716292_2e87_5.jpg", 
    "course_url": "https://www.udemy.com/money-the-new-science-of-making-it/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T23:46:11Z"
}