{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Stating it concisely, the Online Business Strategy Mastery/30-15-90 Millionaire Coaching Program is a professional training series by a life long leader, trainer, coach, author... that&#039;s me, Wayne Sharer.</p><p style=\"\">I&#039;m not someone that was successful once and then called myself a coach, instructor or mentor. In fact, I <strong style=\"\">wrote the book on mentoring</strong>.</p><p style=\"\">The Online Business Strategy Mastery/30-15-90 is definitely for you if any of this is true for you because it is <strong style=\"\">the proven path every major marketer</strong> and successful online business has used to end the failures, stop the horrible feelings of desperation and to grow massive <em style=\"\">financial success and independence</em> including:</p>  <ul style=\"\"> <li style=\"\">Selling Information Products</li> <li style=\"\">Affiliate Marketing </li> <li style=\"\">Coaching</li> <li style=\"\">Multilevel Marketing </li> <li style=\"\">eBay Selling</li> <li style=\"\">Drop Shipping</li> <li style=\"\">Retail Sales Online</li> <li style=\"\">Professional Services<strong style=\"\"></strong> </li> </ul> <p style=\"\">You can use the coaching to decide if it is right for you to be trying a business online, and to seriously <strong style=\"\">get profitable, fast</strong>. </p><p style=\"\">This is the proven path of 30 days of coaching, to be on the path to 15k per month in the next 90 days - 30-15-90. You cannot and will not fail if you follow the guides and steps inside the 5 training modules that <strong style=\"\">walk through</strong> your exact online sales strategy and sales tactics.</p><p style=\"\">This is the closest thing to a guarantee there is that any action taker who follows instructions and doesn&#039;t skip things and quit after little setbacks <strong style=\"\"><em style=\"\">WILL build a list and make sales</em></strong>. You cannot fail.</p><p style=\"\">You get 5 video training modules that start by introducing you to the success strategy and then shows how and why it works, one piece at a time.  You&#039;ll also be getting two tactics to start you earning and putting the strategy to work.</p><p style=\"\">The bottom line is, you are being spoon feed exactly how the top online sellers and companies make there sales online, and why not using this is like voting to stay on the path to failure.</p><p style=\"\">Don&#039;t rely on one hit, un-trained coaches and instructors for your business future. Get started today by clicking the <strong style=\"\">&quot;Take This Course&quot;</strong> button below while it&#039;s handy! </p>", 
    "end_date": null, 
    "title": "Online Business Strategy Mastery", 
    "price": "20.00", 
    "instructors": "Wayne Sharer", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570456_f82c_2.jpg", 
    "course_url": "https://www.udemy.com/online-business-strategy-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T20:42:40Z"
}