{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>*** Course Updated Wednesday, December 23, 2015 ***</p><p>As a local business owner, manager or professional, you may have already faced the unpleasant feeling when a customer or client leaves a bad review for you on Yelp, Google, CitySearch or on another website.</p><p>It feels like an attack and your emotions vary from anger to embarrassment and, perhaps, even depression. </p><p><span></span>Don't worry.</p><p>Negative reviews are going to happen.</p><p>A customer might be having a bad day. Maybe, a staff member said the wrong thing. Perhaps, a mistake caused an order delay. </p><p>One negative review isn't going to shut down your business. But the way you handle negative reviews will set the stage in moving forward and improving your company's customer service and online reputation. </p><p>In this course, we'll cover:<br></p><ul><li>How online review websites work.</li><li>How to react to a negative review.</li><li>How to get the review removed (or turned into a positive review).</li><li>What is Online Reputation?</li><li>How to protect your business, staff and yourself online with Online Reputation Management.</li><li>How to monitor reviews and other online media.</li></ul>This course is designed for local business owners - large and small - as well as professionals (lawyers, dentists, chiropractors, etc.) and service industries (plumbers, furnace repairs, roofers, etc.).<p><br>Negative reviews aren't fun, but this course tells you how you'll be able to avoid bad reviews; earn and increase positive reviews; build an online reputation management strategy, which will all help to increase sales and gain more happy customers.</p><p>Downloads include cheat sheets and guides to help you confirm and claim your online business profiles in review listing and mapping websites as well as other step-by-step directions for creating social media accounts for your company. </p><p><strong>About the Instructor, Steve Phillips</strong></p><p>With over 15 years of search engine optimization (SEO) and Online Reputation Management (ORM) experience, Steve Phillips has created this course based on customer experiences in receiving and handling negative reviews on Yelp and other review websites. </p><p>Clients he counseled across a wide variety of businesses include heating and cooling; law firms; accountants; dentists manufacturing; florists; photographers; mental health service providers, and many others. </p><p>Online Reputation Management (also known as \"ORM\") is vital for all businesses and professional services in developing and maintaining a positive appearance for companies; business owners; professionals; staff; products and services. A business owner or their marketing staff must consistently be on top of their ORM before a PR crisis occurs.</p>", 
    "end_date": null, 
    "title": "Online Reputation Management: Negative Business Reviews", 
    "price": "20.00", 
    "instructors": "Steve Phillips", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553346_6742_4.jpg", 
    "course_url": "https://www.udemy.com/online-reputation-management-negative-business-reviews/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-13T14:24:30Z"
}