{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Quick Question - Do *You* Feel like your <strong style=\"\">BUSINESS IS RUNNING YOU?</strong>  </p>  <p>  \t  The feeling that no matter what you do your To-Do list continues to grow BIGGER every day.  </p>  <p>  \t  It’s like you got into business for the freedom but now you are more stressed out than ever.  </p>  <p>  \t  Don’t worry I used to feel this way too….  and now I have some AMAZING news for you!  </p>  <p>  \t  THERE IS A SOLUTION...and it is called <strong style=\"\">OUTSOURCING. You are going to learn how to hire highly </strong>qualified<strong style=\"\"> people around the world for unbelievably low rates.</strong>  </p>  <p>  \t  This Outsourcing course is teaching people all over the world how to: Get their life back, make more money, have more freedom, be less stressed, and focus on the things that are truly important.  </p>  <p>  \t  This means you get to pursue your passions, dreams, and hobbies while other highly qualified people help run your business 24/7/365!  </p>  <p>  \t  This also means you can be working anywhere from Paris to Bangladesh and your business will be running streamlined and smoothly.  </p>  <p>  \t  Skeptical?  </p>  <p>  \t  These same methods you are about to learn have taken my business from barely breathing to making six figures a year while juggling being a new Dad and traveling the world.  </p>  <p>  \t  After this Course you are going to learn why Outsourcing is the most POWERFUL and EFFECTIVE tool to not only running your business but growing it as well.  </p>  <p>  \t<strong style=\"\">Here is a Sneak Peak of what you will learn</strong>  </p>  <p>  \t  - 22 Video modules that explain everything you need to know about outsourcing  </p>  <p>  \t  - Strategies for hiring and managing your virtual dream team  </p>  <p>  \t  - How to get top quality talent on a shoe-string budget  </p>  <p>  \t  - Mastering the Interview process  </p>  <p>  \t  - Finding hidden talents and diamonds in the rough  </p>  <p>  \t  - Much, Much, more!  </p>  <p>  \t  So if you want to make more money, live your dreams, be less stressed, and start running your business instead of your business running you then check this out:  </p>  <p>  \t<strong style=\"\">THIS———IS———THE——- COURSE——  YOU———NEED</strong>  </p>  <p>  \t  You are going to learn the underground ninja tactics that have taken me years to perfect.  </p>  <p>  \t  22 Videos may sound like a lot…but you can jump around and pick and choose the ones that you need to learn the most!  </p>  <p>  \t<strong style=\"\">Sounds like a pretty good deal right?</strong>  </p>  <p>  \t  Then here’s what you need to do to start taking this Outsourcing 101 course right now:  </p>  <ol style=\"\">  \t<li>Scroll back up to the top and click the “Take This Course\" Button</li>  \t<li>If you’re already a member of Udemy, this will take you to the payment page - IF YOU’RE NOT, you will be prompted to sign up for Udemy (it’s really good and will never spam you so YOU SHOULD SIGN UP)</li>  \t<li>Enter in your credit card or Paypal details and press “Complete Purchase” (then do a little dance because you just made a great decision)</li>  \t<li>Udemy will confirm your purchase for $27.00</li>  \t<li>You will immediately get access to the course and subsequently learn how to become an Outsourcing BOSS!</li>  \t<li>You’ll have to figure out what to do with all the free time you have as you have delegated all your annoying, tedious, and busy tasks.</li>  </ol>  <p>  \t  Don’t worry - I will be here along the way and personally respond to any questions you may have  </p>  <p>  \t  Don’t miss out on to completely free up your life and start kicking butt in your business  </p>  <p>  \t  Sincerely,  </p>  <p>  \t  Jason Bracht - Outsourcing Guru  </p>  <p>  \t  P.S. The $27 price is an initial offering to build the students and positive reviews. <strong style=\"\">I firmly believe that learning these valuable tools will help change your life and make you much happier and less stressed.</strong> Jump on this initial offer for before the price shoots back up.  </p>", 
    "end_date": null, 
    "title": "Outsourcing Basics: Grow a Business with Virtual Freelancers", 
    "price": "20.00", 
    "instructors": "Jason Bracht", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/252362_acfa_8.jpg", 
    "course_url": "https://www.udemy.com/outsourcing-basics-grow-a-business-with-virtual-freelancers/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-29T05:02:14Z"
}