{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t           This course is a guide to successfully planning an event.  </p>  <p>  \t           You should enrol in this course if:  </p>  <ul>  \t<li>you have the daunting tasks of organising an event (small or large) but are inexperienced or overwhelmed by what needs to get done.</li>  \t<li>you like organising events, you have some experience but you really want to improve.</li>  \t<li>you are responsible for organising an event for a friend or family and you want to make to make it memorable and fun without all the hassle and stress.</li>  \t<li>you want to organise an event, you have a good idea, but you don’t know how to get started or put your plan into action.</li>  </ul>  <p>  \t           The course is designed to help you <strong>plan your event while taking the course</strong>. You will be provided with lectures, and an Event Planner Guide.  </p>  <p>  \t<strong>Incentives:</strong>  </p>  <ul>  \t<li><strong></strong>Receive Instructor and peer feedback on your plan. If you need help, I&#039;m happy to chat with you via Skype or Facebook.</li>  \t<li>Gain access to a budget, To Do List and contingency plan worksheet. </li>  \t<li>Receive discounts to future courses: Event Management, Volunteer Management and Event Design.</li>  </ul>  <p>  \t<strong>The course is free for the first week! After November 7, the course will be $9.99.</strong>  </p>", 
    "end_date": null, 
    "title": "Plan a Successful Event - Right now!", 
    "price": "20.00", 
    "instructors": "Monica Gragg", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234974_355e_8.jpg", 
    "course_url": "https://www.udemy.com/plan-a-successful-event-will-taking-the-course/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-01T11:26:34Z"
}