{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h4 style=\"\"><strong style=\"\">What makes your product different and more valuable than your competitor’s?</strong></h4>  <p style=\"\">  \t      If you don’t know, or if you can’t tell me quickly and clearly, then your product is probably in trouble. Equally important is aligning everyone in your engineering, product management, marketing and sales team so they, too, know these answers. To win market share and wide-spread adoption, they must embrace your core product positioning. They must be able to know it, understand it, repeat it, and leverage it in all of their product development and customer communications activities. That’s how you grow revenue and win in today’s overcrowded marketplace. To do this, you need a “positioning statement.”  </p>  <h4 style=\"\"><strong style=\"\">Want to beat those odds?</strong></h4>  <h4 style=\"\"><strong style=\"\"></strong><br style=\"\">  <strong style=\"\">Want to learn the secrets for creating the best “positioning statement” possible?</strong></h4>  <h4 style=\"\"><strong style=\"\"></strong><br style=\"\">  <strong style=\"\">Then this course is for you!</strong></h4>  <p style=\"\">  \t      But positioning is not what you do to a product. Positioning is what you do to the mind of the prospect. So, how do we influence that, exactly? This course teaches you the thought-provoking approach called <em style=\"\">positioning</em>. It starts with developing a <strong style=\"\"><em style=\"\">positioning statement</em></strong> that identifies, prioritizes, and then clarifies the unique value you offer a specific target market. Equally important to having a best positioning statement tool is knowing how to use it. Because, success requires you not only be a master of marketing; you need to be savvy at organizational politics.  </p>  <p style=\"\">  \t      The on-line, on-demand course contains 6 power-packed lessons listed below with 70 minutes of fast-paced video lectures accompanied by quizzes, examples and exercises. Each video lecture can be completed in less than 15 minutes, enabling you to pace out your training over the approximately three hours it will take to complete the entire course.  </p>", 
    "end_date": null, 
    "title": "Product Management & Marketing: Positioning", 
    "price": "35.00", 
    "instructors": "Mike Gospe", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/161476_b194_3.jpg", 
    "course_url": "https://www.udemy.com/mastering-product-positioning/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-10T23:41:01Z"
}