{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul style=\"\">  \t<li>Do you wish you could increase your PRODUCTIVITY DRAMATICALLY? </li>  \t<li>Do you wish to have more time and to be more productive and do the things you love?</li>  \t<li>Are you curious to find out, why some people are far more productive then others? </li>  </ul>  <p style=\"\">  \t    If your answer to this questions, are positive:  </p>  <p style=\"\">  \t    Take this course.  </p>  <p style=\"\">  \t    I used to work very hard, sometimes 18 hours a day. I was frustrated because it seemed like there are people who created much more in less time. So I started to learn the secrets of being more productive.  </p>  <p style=\"\">  \t    Through countless studies of books and self optimations I found out that the secrets of productivity are the same, in business and also in your free time. I optimised the output and made it possible to create in half the time, double the work. That means being much more productive then anybody else.  </p>  <p style=\"\">  \t  You ask yourself: how will that help me? Some benefits:  </p>  <ul style=\"\">  \t<li>you have more free time for your beloved ones and yourself</li>  \t<li>you can dramatically increase your salary</li>  \t<li>you have finally the time to take your vacation and next travel</li>  \t<li>you have time doing things that YOU LOVE</li>  </ul>  <p style=\"\">  \t<strong style=\"\">  What would you do if you have much more time?  </strong>  </p>  <p style=\"\">  \t    What others say about Nemanja Adamovic:  </p>  <p style=\"\">  \t    Customer Reference:  </p>  <p style=\"\">  \t<em style=\"\">&quot;We started to work with Nemanja Adamovic to increase our revenue and sales,</em> <em style=\"\">during that time our business had some critical issues. He helped to double </em><em style=\"\">our revenue in a short timeframe through his course. As he worked with Fortune 500, Midsize and Small business owner, he is a treasure of knowledge, you don’t get information like get a Facebook page, because this is not enough. He first showed us the system and we could identify were we lack in knowledge and then improve. </em><em style=\"\">If you ask me, I would recommend every Business Owner to take his program.&quot;</em>  </p>  <p style=\"\">  \t    -Turco, Italy. Small business owner in the area of food industry.  </p>  <p style=\"\">  \t    I took all of the information and feedback from previous (real life) classes and expanded upon it to deliver this premium class:  </p>  <ul style=\"\">  \t<li>How to achieve a productivity boost in your business</li>  \t<li>Step by step procedure how to increase productivity </li>  \t<li>The most important thing on productivity </li>  \t<li>The best ways to establish productivity </li>  \t<li>An overview that will help you to exactly know what kind of steps you need to do </li>  \t<li>Detailed hands on how you can do it (FOR FREE)</li>  </ul>  <p style=\"\">  \t    The class is delivered in easy to follow video modules so you can go at your own speed if you prefer.  </p>  <p style=\"\">  \t    New Content will be uploaded every month, so that you are always up-to-date. This is for FREE.  </p>  <p style=\"\">  \t    Don&#039;t worry. You will not be alone. The bonus with this course it, that you have free access to our great community where you can ask questions and learn from others, share opinions and enjoy your success.  </p>  <p style=\"\">  \t    I will personally respond to any questions you may have as you go through the material so there&#039;s no worry if you&#039;re not sure how to take all of the information and apply it to your business. Take this course, now!  </p>  <p style=\"\">  \t    Let&#039;s get started.  </p>  <p style=\"\">  \t    Nemanja Adamovic  </p>  <p style=\"\">  \t    By the way: you have a 30 day full money back guarantee. No questions asked - Just try it out, you have nothing to lose.  </p>", 
    "end_date": null, 
    "title": "Productivity mastery hacks booster to over 400% per day!", 
    "price": "20.00", 
    "instructors": "Nemanja Adamovic", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431330_e57b_2.jpg", 
    "course_url": "https://www.udemy.com/increase-productivity-for-your-business-course-training-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T20:44:11Z"
}