{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>UPDATED Nov 10th, 2015!</strong><br><strong></strong></p><p><strong>Productivity Management Formula</strong> - <em>Do you need to answer Yes to any of these questions?</em></p>    <p><strong>Do you want to take the next step in your career? Yes?</strong></p>  <p><strong> </strong></p>  <p><strong>Do you have a goal you’ve wanted to achieve for a long time, and now you finally want to do it? Yes?</strong></p>  <p><strong> </strong></p>  <p><strong>Do you need your full concentration to accomplish a difficult or larger task which will occupy a longer span of time? Yes?</strong></p>  <p><strong> </strong></p>  <p><strong>Do you have to complete a large project now but you’re short of time? Yes?</strong></p>  <p><strong> </strong></p>  <p>When I was working on large projects in the banking area I had the same problem. I struggled like you but I did find a formula that works!</p>    <p><em>When you take this course, you will discover how to:</em></p>    <ul><li>Manage yourself to complete important tasks effectively, </li><li>Stay motivated</li><li>Successfully reach long-term goals. </li><li>Raise your productivity to a new level!</li></ul>          <p><em>The benefits for you of taking this course are:</em></p>    <ul><li>Developing a powerful mindset, </li><li>Being able to set up productivity enhancing strategies </li><li>Using simple but effective working techniques</li><li>Avoiding typical mistakes and coping with problems and difficulties</li><li>All worksheets and checklists are downloadable</li></ul>            <p>You will discover how easy this is to understand because it is presented in straight forward simple steps which are easy to follow. </p>    <p><em>Let me share some of these steps with you:</em></p>    <p><strong>Motivate</strong> yourself for important tasks and goals</p>  <p><strong>Develop</strong> a vision and derive goals from your vision</p>  <p><strong>Formulate</strong> a plan with a simple system</p>  <p><strong>Implement</strong> your action plan</p>  <p><strong>Organize</strong> a productive day and finish all your tasks</p>  <p><strong>Deal</strong> with distractions, plan deviations and difficulties</p>  <p><strong>Measure</strong> and celebrate your success ☺</p>    <p>This course takes you on a journey to superior self-management and productivity. You can apply the techniques and competences you learn here to other areas of your life.</p>    <p><strong>Just stop and think. </strong></p>  <p><strong> </strong></p>  <p><strong>What is the cost for you and your business if you don’t address these issues today? You will fall further behind. Your colleagues and competitors will outperform you with adverse consequences for your career and your future. Can you afford to let this happen?</strong></p>    <p>So you need to do something about this today! </p>    <p>Enroll in this course NOW and start discovering how my Productivity Management Formula can revolutionize the way you work.</p>    <p>What are you waiting for? Take some action: ENROLL TODAY</p>", 
    "end_date": null, 
    "title": "Productivity Management Formula", 
    "price": "20.00", 
    "instructors": "Jürgen Wulff", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/605498_558b_3.jpg", 
    "course_url": "https://www.udemy.com/productivityformula/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T04:02:14Z"
}