{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course is for the self employed / small business owner who has been operating for 1 - 3 years, and is looking for ways to grow their business and increase their profitability beyond what they are currently achieving.</p><p style=\"\">In this course, we look at 10 strategies which you can implement to grow your profits. If you&#039;ve hit a ceiling, or at a loss as to what you can do to improve the situation then this course is for you. Your tutor, has been in her own business for over a decade, and knows what its like to &#039;hit a ceiling&#039; and not seem to move forward further. At this point, coaching can help, or a course like this can give you the ideas you need to keep on growing.</p><p style=\"\">The course booklet (about 10 pages) has been designed so that you don&#039;t get bogged down with the detail, but so that you can follow along with the course, and fill it out with ideas that are relevant to you in your business. We cover 10 practical strategies that you can go away and implement by yourself.</p><p style=\"\">The course will take about 2 hours to complete. Each strategy is explained in its own module, and you can apply this to your business. Its aimed at the busy owner / manager who just wants solutions and not theory or waffle. Time is short. No doubt you have a lot on your plate and you want to improve your business. You don&#039;t need to spend days in a seminar, or hours reading lots of books... these 10 practical steps will give you the boost you need. </p><p style=\"\">Business isn&#039;t complicated. If we do a series of things in the right way, then we will see results. You don&#039;t need to write pages and pages in a business plan or spend thousands of pounds on consultancy. Just do things in the right way. Have a strategy in place and your profits WILL increase. Review it regularly.</p>", 
    "end_date": null, 
    "title": "Profitability Strategies For Small Established Businesses", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533402_369f.jpg", 
    "course_url": "https://www.udemy.com/profitability-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-21T10:27:58Z"
}