{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This course is a self-help guide to become successful in today's world. it is based on my Best-selling book:</strong></p><p><strong>The Modern Mughal Mentality-</strong>New Strategies to Succeed in India and the Global Marketplace\n\n  </p>\n\n<p><strong><em>This course  which is called  “Recipe for Success-Learn Jugaad”   </em></strong>transforms hardships and difficulties into success stories by introducing the<em> Jugaad</em> Management Principle Business Model, which can be applied to any business, anywhere. \n\n  </p>\n\n<p>For the purpose of this course , the term <em>Jugaad </em>will be defined as “obtaining your objectives by maximizing resources through thinking out of the box.”  \n\n  </p>\n\n<p>Following this new business model will inspire all types of companies around the world, no matter how big or small, to create innovative mentalities, products, and strategies. <strong><em>Recipe</em><em> for Success-Learn Jugaad </em></strong><em> </em>reveals ways in which companies everywhere can benefit from this new business model.  \n\n  </p>\n\n<p>It also reveals ways in which western companies can learn to be successful in India.  Executives of multi-national corporations, government officials, and even American and global small business owners who have no plans to do business in India will benefit from the innovative and revolutionary approach to maximizing resources that this course delivers.\n\n  </p>\n\n<p>Multi-sector success stories illustrate the various components of the<em> Jugaad </em>Management Principle Business Model. Specific questions in the “Modern Mughal Mentality Exercises” at the end will guide the reader through putting the <em>Jugaad</em> Management Principle Business Model to work for their business. \n\n  </p>\n\n<p>Implementing the model can lead to increased profit, maximized resources, and a more efficient way of dealing with today’s turbulent economy.<strong><em> Recipe</em><em> for Success-Learn Jugaad </em></strong> also<strong> </strong>identifies international opportunities in various industries – providing practical solutions to take the guesswork out of the equation.\n\n  </p>\n\n<p><strong><em>Recipe</em></strong><strong><em> for Success-Learn Jugaad </em></strong><strong><em>various  modules  </em></strong>reveal how the same mentality, which has enabled India to enjoy economic success in today’s turbulent times can radically transform any business. The <em>Jugaad</em> Management Principle Business Model can be used to maximize resources and increase profitability in many sectors.  Success stories, important lessons to remember, and opportunities for growth in both India and around the world are given. The “Modern Mughal Mentality Exercises” at the end leads the reader to think creatively and use <strong><em>Recipe</em><em> for Success-Learn Jugaad  </em></strong>to create innovative and cost-effective solutions to problems on their own. Regardless of where the reader lives, or what type of business they run, they will be able to improve their bottom line by implementing these changes. \n\n  </p>\n\n", 
    "end_date": null, 
    "title": "Recipe for Success-Learn Jugaad", 
    "price": "50.00", 
    "instructors": "Dr. Afshan Hashmi", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/867324_e821_5.jpg", 
    "course_url": "https://www.udemy.com/recipe-for-success-learn-jugaad/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-03T00:22:18Z"
}