{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Course Overview</strong></p><p style=\"\">This course will help you explore the connection between your work and God&#039;s work from the beginning of time through today. It will lay a foundation for discovering your work as worship, your career as a calling, and your business as ministry. You will feel good about your work as you get the connection between your labor and God&#039;s work. Barriers between the so-called &quot;secular&quot; and &quot;sacred&quot; will begin to crumble.</p><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong></p><ul style=\"\"><li style=\"\">Over 15 lectures and and approximately an hours worth of content!</li><li style=\"\">A fresh perspective of Business as Ministry</li><li style=\"\">Exposure to thought provoking and challenging questions</li><li style=\"\">The breaking down of  false dichotomies between the &quot;secular&quot; and &quot;sacred&quot;</li><li style=\"\">New and fresh motivation at work as you begin to see it as a form of worship</li><li style=\"\">The opportunity to further explore this topic of Business and Missions in greater detail</li></ul><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">What is the target audience?</strong></p><ul style=\"\"><li style=\"\">Anyone who works</li><li style=\"\">Those struggling to find motivation, purpose and meaning at work</li><li style=\"\">Christians who are wrestling with how to integrate their faith with their work in meaningful and practical ways.</li><li style=\"\">Anyone who wants to know more about Marketplace ministry or Business as Missions.</li></ul>", 
    "end_date": null, 
    "title": "Repurposing Business Foundations", 
    "price": "40.00", 
    "instructors": "Brett Johnson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540620_ff53.jpg", 
    "course_url": "https://www.udemy.com/repurposing-business-foundations/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T20:42:37Z"
}