{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Learn the basic concepts, tools and functions you will need to re-purpose your old &quot;risk avoidance at the expense of profit&quot; Credit Department into a dynamic Sales Partner.  </p>  <p>  \t<strong style=\"\">Build a strong, new B2B Credit Sales paradigm based on the Profit Imperative with this tutorial for commercial business executives and owners.</strong>  </p>  <p>  \t    Explore the Major Components in a Profit Driven Credit Function<br style=\"\">  \t    Learn to Implement New Sales Friendly Goals<br style=\"\">  \t    Find Out the Most Effective Performance Measurements for this Revitalized Area  </p>  <p>  \t<strong style=\"\">A Powerful New Competitive Advantage Awaits Your New Credit/Sales Function</strong>  </p>  <p>  \t    With six high quality, content rich lectures, a self evaluation to determine your starting point and suggestions that you can immediately implement in your business, you will be on your way to that new competitive advantage.  </p>  <p>  \t    Learning the basics for creating a profit driven credit department that know how to maximize sales and minimize risk, measure for the right goals, keep customers current and buying, spot opportunities for improvement, stay on task in real time takes sound administration of this vital asset.  </p>  <p>  \t    Your company is not going to make money from their credit function unless there is someone who understands the administration and maintenance of what may be your company&#039;s largest asset...and that someone is you!  </p>  <p>  \t    .  </p>", 
    "end_date": null, 
    "title": "Sales War...Ending the Conflict Between Sales and Credit", 
    "price": 0, 
    "instructors": "Abe WalkingBear Sanchez", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/293496_d71c_2.jpg", 
    "course_url": "https://www.udemy.com/sales-war-ending-the-conflict-between-sales-and-credit/", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-03T21:48:32Z"
}