{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">The<strong style=\"\"><em style=\"\"> Business Basic: Learn Sales and Business Case Development </em></strong>course<em style=\"\"> </em>is already online in the form of two smaller but connected courses: Introduction to Sales and 12 Steps Business Case Development.</p><p style=\"\">The <strong style=\"\">Introduction to Sales </strong>section builds on the important role that the sales function plays and describes how marketing and sales relate to each other.</p><p style=\"\">It outlines the roles and responsibilities of a sales department, what makes for effective sales, and the trends affecting sales today.</p><p style=\"\">The course also provides insight into the importance of the sales cycle and how it affects sales planning and business development.</p><p style=\"\">Target audience for this course are all who want to gain knowledge in basic sales techniques and anyone who wants to develop or refine their existing sales knowledge and skills.</p><p style=\"\">After completing this section, you will be able to:</p><ul style=\"\"><li style=\"\">distinguish between the roles of marketing and sales,</li><li style=\"\">match the key competencies to how they contribute to success in sales, and</li><li style=\"\">recognize the effects recent sales trends have had on the buyer-seller relationship.</li></ul><p style=\"\">You will also be able to:</p><ul style=\"\"><li style=\"\">recognize the differences between organizational and consumer buying,</li><li style=\"\">recognize the benefits of understanding consumer buying behavior, and</li><li style=\"\">use the stages of the sales cycle.</li></ul><p style=\"\">You will have video lectures, exercises, quizzes, practice and a small optional project if you want to put your skills to work and do more with the knowledge you will receive.</p><p style=\"\">Understanding what is a <strong style=\"\">good business case</strong> will be followed by a description of the functions and elements of a business case. You will learn how to research and what to research in order to prepare yourself and how to align business case with organizational strategy.</p><p style=\"\">Finding the best angle and making an effort to polish your business case will increase your chances. So, you will learn about the principles of business case design to respond to your identified decision makers.</p><p style=\"\">A <strong style=\"\">12 Steps approach</strong> will guide your learning and practice:</p><ol style=\"\"><li style=\"\">Choose your business idea,</li><li style=\"\">Define your business objective,</li><li style=\"\">Determine the functions of your business case,</li><li style=\"\">Prepare a generic structure of a business case (marketing components included),</li><li style=\"\">Research your business idea by needed topics and using appropriate research methods,</li><li style=\"\">Analyze and compile results of research,</li><li style=\"\">Align business idea, strategy and processes,</li><li style=\"\">Determine the best angle to sell your business case,</li><li style=\"\">Write your business case content,</li><li style=\"\">Adapt your business case to various decision makers, </li><li style=\"\">Emphasize high impact elements, and</li><li style=\"\">Prepare to 'sell' your business case.</li></ol><p style=\"\">So, if you want to learn how to develop a business case, for work or in your personal projects this course is for you. It's simple, compact and guides you step by step.</p><p style=\"\">If you are interested, go ahead, and hit that apply button! Thank you and see you in the course!</p>", 
    "end_date": null, 
    "title": "Sales and Business Case Development", 
    "price": "40.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613786_c991_6.jpg", 
    "course_url": "https://www.udemy.com/business-basic-learn-sales-and-business-case-development/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T14:58:52Z"
}