{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">Wollen Sie neben dem Beruf studieren, um Ihre Karriere nach vorne zu bringen?</strong></p><p><strong style=\"\">Haben Sie ein lang gehegtes Ziel, das endlich umgesetzt werden soll?</strong></p><p><strong style=\"\">Benötigen Sie Ihre volle Konzentration für eine schwierige längerfristige Aufgabe?</strong></p><p><strong style=\"\">Müssen Sie ein größeres Projekt trotz wenig Zeit erfolgreich zum Abschluss bringen?</strong></p><p>Dann sind Sie in diesem Kurs richtig. In diesem Kurs lernen Sie, wie Sie sich selbst erfolgreich managen, damit Sie wichtige Aufgaben motiviert und effektiv beenden und langfristige Ziele erfolgreich erreichen. Bringen Sie Ihre Produktivität auf ein neues Niveau!</p><p>Im Kurs betrachten wir die Bereiche <strong style=\"\">Mindset, Strategie und Arbeitstechniken</strong> mit den Themen Motivation, Vision, Ziele setzen, Planung, Organisation, Erfolgskontrolle sowie Umgang mit Problemen und Schwierigkeiten. Wenige, leicht nachvollziehbare Schritte, damit der Erfolg nicht länger auf sich warten lässt.</p><p>Am Ende des Kurses werden Sie wissen, wie Sie</p><ul style=\"\"><li>sich für wichtige Aufgaben und Ziele erfolgreich motivieren</li><li>Visionen entwickeln und daraus Ziele ableiten</li><li>mit einem einfachen System eine konkrete Planung erstellen</li><li>sich und ihr Leben organisieren müssen, um die Planung in die Praxis umzusetzen</li><li>Ihren Tag produktiv gestalten und die anstehenden Aufgaben erledigen</li><li>mit Ablenkungen, Abweichungen und Schwierigkeiten umgehen</li><li>Ihre Erfolge kontrollieren und auch feiern können :-)</li></ul>Der Kurs begleitet Sie auf Ihrem Weg zum exzellenten Selbstmanagement. Die erlernten Techniken und Kompetenzen können Sie auch in anderen Lebensbereichen einsetzen.<p>Alle Arbeitsblätter und Checklisten können Sie herunterladen.</p>", 
    "end_date": null, 
    "title": "Selbstmanagement für wichtige Aufgaben und Ziele", 
    "price": "20.00", 
    "instructors": "Jürgen Wulff", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530940_e64f_4.jpg", 
    "course_url": "https://www.udemy.com/selbstmanagement/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T05:49:15Z"
}