{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">&nbsp;The course covers the basics of how to select the correct franchise that will fit your work requirements and lifestyle.&nbsp; This course will also help people decide if they want a Franchise business instead of attempting to start it on their own.</p><p style=\"\">I wrote a book on Franchising called, &quot;Buying a Franchise: 24 Items to Beware of Before Signing&quot;.&nbsp; I will distribute this to all participants in the course.</p><p style=\"\">There are five 16-18 minute sessions recorded.&nbsp; It could be from one week to four weeks depending on the students pace.</p><p style=\"\">The course is structured according to a series of questions that I would ask an individual to find a custom Franchise for their needs.&nbsp; I continue from one session to the next with further questioning on different topics.&nbsp; I also describe different Franchise topics as we proceed.&nbsp; I tell the participants that they can email me and I will respond to their questions in 24 to 48 hours.&nbsp; At the end of the course, they can also sign up at my website for a free Franchise Consultation; if that is something they desire. <br style=\"\"></p><p style=\"\">Participants should take this course if they were laid-off from their job or they want a work life change and would now like to work for themselves. Some individuals would like to start a Franchise as an investment and keep their present position, because there are semi-absentee and absentee Franchises that give you this opportunity.&nbsp;</p>", 
    "end_date": null, 
    "title": "Selecting the Correct Franchise", 
    "price": 0, 
    "instructors": "Frank Caperino", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47051_4c3b_7.jpg", 
    "course_url": "https://www.udemy.com/selecting-the-correct-franchise/", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-23T04:54:52Z"
}