{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>In 75 minutes learn what service design is and how to implement its first phase into your organization. Learn how to use the appropriate tools and briefly explore a sample case study.<br></strong></p><p>Service design is an innovative approach that helps redesign existing services or create completely new ones.</p><p>This course will introduce you to the general principles of service design methodology. You will learn the role of services in the economy, how they can influence your business and how they can be used in competitive markets.</p><p>This course focuses on the first phase of the design process called ‘Business Perspective’.</p><p>We will provide you with custom tools and their explanation, which you can use to redesign your already existing service or create a new one. We have prepared a couple of canvases for you, so you can easily check how they may help your organization. You will learn how to use tools such as: Pyramid of Vision, Stakeholders Map, Cover Story and Business Hypothesis Map. We will explore a sample case study, where we will present how to use these tools in practice.</p>    <p><strong>What's included in the course?</strong></p>    <p>Our course is comprised of the follow:</p><ul><li>First part where we present you with a brief introduction to the ‘Service Design Process’</li><li>Second part where we focus on ‘Business Perspective’ – the first part of the design process, whose aim is to systematise your knowledge of your organisation and define a vision for your business</li><li>Last but not least we have provided for you a sample case study that will help to understand how the particular tools work in practice</li></ul>", 
    "end_date": null, 
    "title": "Service Design fundamentals: business perspective", 
    "price": 0, 
    "instructors": "Andy Woynarowski", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700804_74fb_4.jpg", 
    "course_url": "https://www.udemy.com/service-design-fundamentals-business-perspective/", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-18T15:30:25Z"
}