{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\">Freelancers, Outsourcers and Outside Contractors</strong>, these workers go by many names. But, savvy business men and women simply call them their GO-TO workforce - whenever they want <em style=\"\">projects completed on-time and under-budget. <br style=\"\">  \t</em><br style=\"\">  \t<strong style=\"\">You can get in the business! </strong>  </p>  <p>  \t      If you are looking for a viable, easy to enter business, one that you can start on a shoestring budget  you&#039;ll want to understand how profitable and simple it is to <em style=\"\">solve expensive problems for other local businesses, with globally outsourced workers!</em><strong style=\"\"> </strong>  </p>  <p>  \t      Watch over my shoulder as I step-by-step march you to success. <br style=\"\">  \t<br style=\"\">  \t      You&#039;ll learn the ropes from how to get started, to client and worker retention tactics that make it easy for your business to grow!<br style=\"\">  \t<br style=\"\">  \t <strong style=\"\">NOTE:</strong> This is one of the few business plans that you can still start on a shoestring budget, with little time to invest, and yet scale to meet your needs and dreams over time!  </p>  <p>  \t <em style=\"\">&quot;The amount that local business are willing to pay for work, vs the amount of money people in some countries will be delighted to do the work  - makes a career helping both sides profitable and satisfying! </em>&quot;  </p>  <p>  \t <em style=\"\">These systems that I&#039;ve set up for success are so easy that many I call it &quot;The Simple Smart System&quot;!</em>  </p>  <p>  \t<em style=\"\"> See If You Agree - Check Out The Course Content and Goals =&gt; =&gt;</em><strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p>  \t <br style=\"\">  \t <strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Simple Smart Business System", 
    "price": "25.00", 
    "instructors": "Simon Hodgkinson, Jeremy Gislason", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/103338_337c_7.jpg", 
    "course_url": "https://www.udemy.com/simple-business-start-up-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-08T23:08:07Z"
}