{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">NOTE! Due to a price change, budgeting tool is <em>no longer available</em> on this course for free. You are able to purchase the tool by sending e-mail to me anna(dot)juusela(at)yanca(dot)fi. Price of the tool for Udemy students is 59€ (normal price 99€).</strong></p>\n\n<p>  \t <strong class=\"redactor-inline-converted\">Budgeting purchases of merchandise for retail sales in the fashion industry with a tool</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t <em>Imagine buying items for your clothing store, and selling out so that you don't get stuck with merchandise that you dump with a 75% discount...to make way for products that sells.</em>  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t <em>If you purchase for a shop owner, imagine how thrilled your boss will be with you when your purchasing decisions skyrocket profits.</em>  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t     But purchasing and budgeting might be complicated, complex and stressful. You can spend hours obsessing over the right decision to make and it all comes down to the budget.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t     But, you can learn \"Purchasing Shortcuts for Small Shops\" and solve the problems!  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t     This course is a step by step guide for budgeting purchases for a SME retail store. This course takes you by the hand and guides you, step by step, so that you save money and time on retail store purchases. As part of the course you will learn how to use a budgeting tool for your purchases. Due to a major discounting by Udemy the tool is no longer available free. This tool is a customised spreadsheet that will help you to manage your inventory, plan your expenses, and calculate your planned purchases. If you wish to purchase the tool contact Anna Juusela. Price of the tool for Udemy students is 59€ (normal price 99€).</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t     The course focuses on solving retail shop owners buying strategies.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t     After completing this course, you will:  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p> </p>\n\n\n\n\n\n\n\n\n\n<li> Budget in professional and money-saving way</li> <li> Streamline purchasing decisions with the budgeting tool</li> <li> Manage stock turnover and plan stock levels</li> <li> Build a stock reduction plan</li> <li> Set up a Purchase Budget based on retail and cost prices</li> <li> Get open-to-buy money (monthly)</li> <li> Complete a Seasonal Merchandising Plan</li> In the course you will learn how to use the tool to follow how you spend your money and keep track of your cash-flow. \n\n<p>  \t     This essential budgeting tool does not come free with the course due to a major Udemy price change. <strong class=\"redactor-inline-converted\">Contact Anna Juusela, if you would like to purchase the tool</strong>. The budgeting tool will save you a lot of time, helping you to avoid the hassle of either doing the calculations manually or working out how to use complicated formulas on a spreadsheet. It is all there!  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t     The tool will help you save money and put your money to use more effectively. Using the tool you will be able to plan your stock levels and turnover more precisely and keep an eye on your expenses. The tool will also help you to reduce the risks of over or under purchasing stock. The Tool is for you to streamline your decision-making! The spreadsheet tool makes your budget decisions productive from day one. You enter your numbers and impress people that are important to your business: your customers, suppliers, investors, bosses, partners…<br>  </p>\n\n<p><strong>Price of the tool for Udemy students is 59€ (normal price 99€).</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t     The course includes additional bonus resources, a PDF sheet for note taking and a PDF cheat sheet that gives you a handy outline of how to use the tool. These bonus items are downloadable free with the course.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t     The course consists of short sections where each sheet of the tool is explained step-by-step. The course is built so that you work thoroughly through the content, and you are encouraged to get lots of practice in using the tool, so you can put it to best use in your business. Some of the steps include a handy quiz to help you learn.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t     The course itself involves around one hour of videos. On top of this you should give some time for trying out and practising with the tool to make sure it works best for you and your business. I recommend you reserve around half an hour for each step of the course. This will save you time immensely in the long run, as the tool will become an invaluable part of your business.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Step by step guide: Budgeting Purchases for Retail Shops", 
    "price": "50.00", 
    "instructors": "Entrepreneur Anna Juusela", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/197906_3e80_8.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-guide-budgeting-purchases-for-retail-shops/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-12T10:56:31Z"
}