{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Do you suffer procrastination and become easily distracted in your business?</strong>  </p>  <p>  \t<strong style=\"\">Want to learn a simple technique that clears the mind so you can make more money?</strong>  </p>  <p>  \t    If you&#039;re one of the millions of people who procrastinate on a daily basis and sabotage your income and future success, this course will come as a huge relief.  </p>  <p>  \t    Say goodbye to sitting around being bored, passing time on social media sites and feeling frustrated that you can&#039;t get going and take action to expand your business and ultimately, your income potential.  </p>  <p>  \t    In this exciting course you will learn a simple technique called EFT Tapping that works with the acupuncture system of the body and releases the emotional causes of procrastination and stress. It&#039;s like acupuncture but without the needles!  </p>  <p>  \t    The course features 6 instruction videos that demonstrate how to use EFT Tapping to overcome boredom, frustration, fear of failure/success, fear of change and the resentment of financial responsibility.  </p>  <p>  \t    With daily practice of the videos in this course, you&#039;ll soon become less stressed and more productive every day. Inspiration and ideas will then flow as you get back on track fast.  </p>  <p>  \tPlease note that this video course does NOT cover business skills and processes.  </p>  <p>  \tIt covers changing your mental attitude, refocusing and taking action to make it happen.  </p>  <p>  \t    Bottom line... do the work, practice the videos and you&#039;ll get the results. You get out what you put in so trust yourself and together we can help you move forwards.  </p>  <p>  \t    Also remember I provide a full money back guarantee on all my courses so you have nothing to lose and everything to gain.  </p>  <p>  \t<strong style=\"\">Take the first step and enrol today, you&#039;ll be glad you did!</strong>  </p>", 
    "end_date": null, 
    "title": "Stop Procrastinating & Learn How Take Action To Succeed", 
    "price": "20.00", 
    "instructors": "David Childerley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337770_bdd4_4.jpg", 
    "course_url": "https://www.udemy.com/stop-procrastinating-build-a-better-business-get-wealthy/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-06T19:05:08Z"
}