{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Hang on tight! Strategy Unplugged is an extensive, yet accessible course that will give you a new perspective on strategy. With 24 video lectures, you have nearly 3 hours of focused content presented by Sid Peimer with his entertaining dry sense of humour and more than 20 years experience in strategy - from start-up to blue chip.  </p>  <p>  \t    Lecture 1 : Expectations  </p>  <p>  \t    Everyone agrees that strategy is important, but no one agrees on what it is. Here Sid sets the stage for your journey. The veil begins to be is lifted off the mystique of strategy, and you begin your journey with a practical definition of the word &#039;service&#039;. In 200 BC Archimedes proclaimed: “Give me a lever long enough and a fulcrum on which to place it and I shall move the world”. Strategy Unplugged is both the lever and a stable platform to allow you to move the world.  </p>  <p>  \t    Lecture 2 : Occam&#039;s razor  </p>  <p>  \t    We encounter just a hint of basic mathematics to learn the concept of Occam&#039;s Razor. This concept, or rather principle, was proposed as early as the 1300’s by a Franciscan friar who lived in the English county of Surrey in a village called Ockham. His name was William of Ockham, and as a logician he proposed the following: “Pluralitas non est ponenda sine necessitate”. The spelling has changed somewhat over the years, but the maxim has survived - for very good reason.  </p>  <p>  \t    Lecture 3 : What qualities a strategist?  </p>  <p>  \t    Sid tells a fascinating story about the moon landing, and that Neil Armstrong actually did not say &quot;one small step for man, one giant leap for mankind&quot;. To become a strategist requires no formal education - all it takes is a change of perspective, because when people ask for a strategy, all they are asking for is your perspective.  </p>  <p>  \t    Lecture 4 : Military heritage  </p>  <p>  \t    Although there are a substantial number of military strategists (as there have been a substantial number of conflicts), we begin with Sun Tzu, also looking at the contributions of Frontinus, Guibert, Von Clausewitz, Liddel Hart and General Forrest.  </p>  <p>  \t    Lecture 5 : Strategy enters our lexicon  </p>  <p>  \t    In the previous lecture we investigated the roots of military strategy from the ancient to the modern. Strategic thought obviously did not stop there, and neither did strategic folly. Wherever there is conflict there is strategy, and it will always be documented. But for our purposes, a branch emerges into the business world, and that is the one we take here. We look at the contributions of Andrews, Chandler, Ansof and the Boston Consulting Group.  </p>  <p>  \t    Lecture 6 : Modern strategic thought  </p>  <p>  \t    In this lecture we cover the contributions of Michael Porter, looking not only at the 5 forces model, but also his concept of generic competitive strategies as well as the value chain. There are certain constraints to the 5 forces model, and to compensate for these we have the resource based view of the firm which is also covered in this lecture.  </p>  <p>  \t    Lecture 7 : Contemporary theories  </p>  <p>  \t    Our primary focus here is on the work by Henry Mintzberg where we learn about deliberate and emergent strategies. Modern Strategy has become a smorgasbord of opportunity for modern authors, consultants and academics. If you come up with a hot concept, you get yourself a great book deal with the chance of getting onto the bestseller list, not to mention the lucrative speaker circuit. However we isolate one exemplary example which is Blue Ocean Strategy by Kim and Mauborgne.  </p>  <p>  \t    Lecture 8 : Towards a definition  </p>  <p>  \t    Here we begin our journey towards a definition of strategy that meets the requirements of Occam&#039;s Razor. We encounter Plans, Goals, Visions, Missions, Objectives and Tactics - and put them into perspective relative to strategy. Defining strategy is not a straightforward process, and here we encounter the first stage in the process of arriving at a practical definition.  </p>  <p>  \t    Lecture 9 : The 55/5 rule  </p>  <p>  \t    In our previous lectures we built up 2 stages of the definition of strategy. The first:strategy is what you need to do to win; the second: strategy is what you need to do to meet your objectives. We also dropped the term ‘goals’ from our strategic statements, and we would be replacing it with something absolutely crucial which we cover in this lecture based on the 55/5 rule (which has been ascribed to Einstein): &quot;If i had one hour to save the world, i would spend 55 minutes thinking about the problem, and 5 minutes thinking about solutions&quot;.  </p>  <p>  \t    Lecture 10 : A definition at last  </p>  <p>  \t    This is a brief lecture where we consolidate what we have covered to arrive at a definition of strategy that satisfies Occam&#039;s Razor.  </p>  <p>  \t    Lecture 11 : Supply and demand  </p>  <p>  \t    The main reason that strategies fail is that people did not do what we expected them to do. here we are not referring to staff and implementation, but to the market that we are trying to influence. Although the market does respond in a logical way at times following the dictates of a standard demand curve - and why retailers have sales, it is irrational to think that people make rational decisions in their best interests all the time. That brings Behavioural Economics to the fore.  </p>  <p>  \t    Lecture 12 : The balance sheet in the brain  </p>  <p>  \t    This lecture introduces the role of the autonomic nervous system and mental accounting that makes us behave in ways that are unexpected - although if you know the biology and psychology behind it, the market&#039;s behaviour is not that surprising. We review research by Donald Dutton, Arthur Aron, Richard Thaler, and Daniel Kahneman and the late Amos Tversky&#039;s Prospect Theory.  </p>  <p>  \t    Lecture 13 : Decisions  </p>  <p>  \t    Here we delve a little deeper into the consumer&#039;s mind, and then take a journey towards insights. We encounter System 1 and System 2 thinking as well as Gerald Zaltman&#039;s model of the limbic pathway. By then end of this lecture you will have a clearer idea of the interplay between emotion and reason, and how that affects our decisions.  </p>  <p>  \t    Lecture 14 : Defining insights  </p>  <p>  \t    Having insight into how people will behave is obviously an immense asset, and why organisations spend substantial resources doing market research. We&#039;ve seen that the economic man model is extremely limited and that we really need to get inside the minds of those whose response may determine the success or failure of our strategy. This is a short lecture that focuses on defining the word &#039;insight&#039;.  </p>  <p>  \t    Lecture 15 : Insights revealed  </p>  <p>  \t    We look at two well-documented case studies. Firstly the initial failure, and then success of Febreze by Proctor and Gamble. The second case study is as different as you can get, taking us deep into the Colombian jungles to change behaviour based on an insight.  </p>  <p>  \t    Lecture 16 : Positioning  </p>  <p>  \t    Someone who really understands the concept of positioning is Victoria Beckham. In her autobiography, Learning to Fly, she states “Right from the beginning I said that I wanted to be more famous than Persil Automatic.” She certainly knows the basic tenet of positioning: and that is the fact that positioning is relative. In other words the most important phrase in that sentence is ‘more important than’. We flesh out the definition to satisfy Occam&#039;s Razor, and also look at positioning on more than one dimension. Here we look at the fascinating introduction (and subsequent demise) of Zima beer.  </p>  <p>  \t    Lecture 17 : Segmentation  </p>  <p>  \t    We begin this lecture with a quote from Leo Burnett: “I can’t give you the formula for success, but I can give you the recipe for failure: be all things to all people.” So if not being all things to all people is a predictor of failure or success, segmentation is an important aspect of any strategy. We look at the fascinating case of Target getting too close to its customers.  </p>  <p>  \t    Lecture 18 : Numbers and fumbles  </p>  <p>  \t    This lecture brings to the fore things that you don&#039;t think about when looking at data. Such as the emotional aspect of numbers. We cover the New Coke debacle, false causality in the Hebrides, coconut oil in cinema popcorn, a bit of teven Covey and some interesting stats on brand polarisation from the Harvard Business Review and Ronald Regan&#039;s mastery of strategy in his debate against Jimmy Carter.  </p>  <p>  \t    Lecture 19 : Strategic Intent  </p>  <p>  \t    Strategic Intent is not a new concept, but was formalised in an HBR article of that title in May of 1989 by Gary Hamel and CK Prahalad. Strategic intent has not entered the everyday lexicon of strategic planning. The reason I think is that it lies outside all the formal methodologies and processes of planning. We are more familiar with a planning process that focuses on what we can do, resulting in a feasibility sieve through which all plans go, to arrive at something that suits us 100%. The problem is what suits us 100% may not be suitable for strategies that will give us global leadership or some other stretched goal. And I use the term goal in the sense of a 5-year time horizon. Strategic intent is like a marathon – or a 5-year plan – but the big difference is that it is run in 400 m sprints.  </p>  <p>  \t    Lecture 20 : The innovation blind spot  </p>  <p>  \t    This lecture looks at ecosystems which failed new product launches. An innovation blind spot cost Philips Electronics US$2.5 bn in the form of write-offs. They brought out the magnificent HDTV in 1980; unfortunately they were 20 years too early. The hi-definition cameras and transmission standard - which were needed to make HD deliver - failed to arrive in time. However, this was somewhat less painful than Pfizer&#039;s $2.8 bn write-off from Exubera - a &#039;sure winner&#039;. Michelin tyres also hit an innovation blind spot with the introduction of their run-flat – with which Sid shares his personal experiences.  </p>  <p>  \t    Lecture 21 : Lessons from Hollywood - storytelling for strategists  </p>  <p>  \t    As strategic planners, we tell stories all the time. We tell people about markets, what people in those markets are experiencing, what they like, what they don&#039;t like, what they&#039;re buying into or not, or why the presentation is two weeks late :). Nearly everything we communicate is in the form of a story, so it is prudent to get to know the three-act structure intimately, as all presentations have, or should have, a beginning, a middle and an end.  </p>  <p>  \t    Lecture 22 : Selling your strategy  </p>  <p>  \t    Constructing an elegant strategy, only to fall down at the last hurdle is the epitome of frustration. Contrary to popular opinion, strategies seldom sell themselves, no matter how exceptional that may be. This lecture, to put it succinctly, is about getting your message across.  </p>  <p>  \t    Lecture 23 : Thriving on strategy  </p>  <p>  \t    This is about you as an individual. We look at the concept of &#039;hardiness&#039; and the myth of talent. Because strategy is essentially about the future, one cannot claim to be &#039;correct&#039; at its construction. The factors that have proven to reduce the stress involved are covered, and taken together with the ability to change and give perspective, as well as plenty practice and a good mentor makes for a more enjoyable and valuable process.  </p>  <p>  \t    Lecture 24 : A brief farewell courtesy of William of Occam  </p>  <p>  \t    This is, as the title suggests, a very short lecture that just revisits the 55/5 rule and reminds you of the definition of strategy that was built up in the course.  </p>", 
    "end_date": null, 
    "title": "Strategy Unplugged", 
    "price": "20.00", 
    "instructors": "Sid Peimer", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/204650_c09e_5.jpg", 
    "course_url": "https://www.udemy.com/strategy-unplugged/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-24T18:04:03Z"
}