{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Strategy execution is a hot topic in management today. The Conference Board's recent Survey of CEOs revealed that chief executives are so concerned about strategy execution that they rated it as both their number one and number two most challenging issue.</p><p>Why does strategy execution so often fail? Because most strategic plans are little more than a series of vertically integrated objectives. But, the problem is not objectives and it is not vertical. It is the \"whole-system\" and its ability to adapt and align, internally and externally in fast cycles. In other words, to be agile. The problem is the culture and capabilities of the organization and a process to design and deploy those capabilities. This course provides that process and is based on forty years of experience improving the performance of organizations.</p><p>The problem is developing new capabilities and a new culture that will enable the organization to achieve its goals. The term <em><strong>\"Agile\"</strong></em> implies and iterative process of experimentation, learning, adaptation to the changing environment, and alignment with other business units and support groups. This course is about creating that agility, adaptation and alignment.</p><p>Every organization has capabilities that are embedded in the culture. This course will take the leader through a process of assessing the current culture, its assets and liabilities, sensing the changing landscape that presents threats and opportunities, and then engaging the organization in the design of those processes and systems that will represent competitive advantage.<br></p>  <p>  \tThe author of this course is the author of ten books on leadership, lean management and change process. This course includes the text and material from three of his books. </p>", 
    "end_date": null, 
    "title": "Strategy Execution - The Agile/Lean Way", 
    "price": "50.00", 
    "instructors": "Lawrence M. Miller", 
    "commitment": "18 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240450_3b78_6.jpg", 
    "course_url": "https://www.udemy.com/agile-strategy-execution/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-10T02:04:45Z"
}