{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">You have a business idea, but you don&#039;t know what are the different pieces you need to put in place to make it a viable business...</strong></p><p style=\"\">This is where the Business Model Canvas comes in.  The Canvas models out the different pieces of your business and shows you how the pieces fit with each other.  Essentially, it is a one-page business plan.  </p><p style=\"\"><strong style=\"\">So instead of spending hours and days writing out a 100-page business plan, you will spend minutes. </strong> This approach allows you to more quickly identify if there are any gaps in your business plan that you ma need to address.  It also allows you to get your business off the ground faster, so you can test out your assumptions.  </p><p style=\"\">This course is for:</p><ul style=\"\"><li style=\"\">Entrepreneurs who are looking to start a business</li><li style=\"\">Small business owners who are looking to grow their business by bringing to market new products</li><li style=\"\">Business owners who are looking for a systematic method to diagnose their business and better understand the fundamental pieces that make their business possible</li></ul><p style=\"\"><strong style=\"\">Want to get started with your business?  Want a method that helps you identify what it may take to turn your business from idea to reality?</strong></p><p style=\"\">This course is for you!  Enroll and get started today! </p><p style=\"\"></p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Strategy Tool: Business Model Canvas, a 1-page business plan", 
    "price": "35.00", 
    "instructors": "Jeannie Chan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/584798_794c.jpg", 
    "course_url": "https://www.udemy.com/strategy-tool-business-model-canvas-business-plan-jeannie-chan/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-16T19:52:08Z"
}