{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<!--[if gte mso 9]><xml><w:WordDocument><w:View>Normal</w:View><w:Zoom>0</w:Zoom><w:DoNotOptimizeForBrowser></w:DoNotOptimizeForBrowser></w:WordDocument> </xml><![endif]-->  </p>  <h5 style=\" text-align:center;\">Enjoy the Ultimate Freedom: Run Your Business From the Road, the Mountains or the Beach </h5>  <p class=\"MsoNormal\">  \t                      Is extensive travel one of your unfulfilled dreams?  </p>  <p class=\"MsoNormal\">  \t                      For years, my husband and I had talked about taking a grand tour of the US and Canada, visiting well-known cities and viewing glorious landscapes. One March 1st, we left in our car to do just that.  Three months later, we returned home having racked up 20,000 miles, having experienced countless adventures and having earned the same as when working at home.  </p>  <p class=\"MsoNormal\">  \t                       You can do it, too!  My course, <strong style=\"\">Take Your Business on the Road, </strong>gets you inspired and prepared to take an extended holiday or move your home base from place to place, while keeping your business running smoothly and revenue still flowing in.  If you&rsquo;re based in the US, you even learn ways to make your travel legitimately tax-deductible, as our three-month trip was.  </p>  <p class=\"MsoNormal\">  \t <strong style=\"\">This is for you if...</strong>  </p>  <p class=\"MsoNormal\">  \t                      * You currently generate your own income or hope to, soon  </p>  <p class=\"MsoNormal\">  \t                      * You are single, married, divorced, widowed or partnered, with or without kids  </p>  <p class=\"MsoNormal\">  \t                      * A short annual vacation doesn&rsquo;t satisfy your wanderlust - or you would like to be able to work from an alternate location for part of the year  </p>  <p class=\"MsoNormal\">  \t                      * You live in North America, would like to travel there or have more exotic places in mind to visit  </p>  <p class=\"MsoNormal\">  \t                      * You&rsquo;re interested in learning convenient ways to save money on travel, even if you may splurge from time to time  </p>  <p class=\"MsoNormal\">  \t                      * Hearing the experiences and tips of someone who&rsquo;s done it would motivate you to get moving on your travel plans  </p>  <p class=\"MsoNormal\">  \t <em style=\"\">Note: If you are hearing-impaired, speak English as a second (or fourth) language or just like to review content quickly, you&rsquo;ll be glad to know that this course includes the <strong style=\"\">written transcript </strong>of each video lesson.  Each lesson ends with a short exercise that takes you closer to implementing your travel dream.</em>  </p>  <p class=\"MsoNormal\">  </p>  <p class=\"MsoNormal\">  \t<strong style=\"\">You learn all this and more in the course:</strong>  </p>  <p class=\"MsoNormal\">  \t                       * Vital preparations before leaving home  </p>  <p class=\"MsoNormal\">  \t                      * Keys to staying connected for business while away  </p>  <p class=\"MsoNormal\">  \t                      * On-the-road income streams to consider  </p>  <p class=\"MsoNormal\">  \t                      * Factors that may make your entire trip tax-deductible  </p>  <p class=\"MsoNormal\">  \t         * Little-known ways to save on lodgings  </p>  <p class=\"MsoNormal\">  \t                      * How to keep your home safe while you&rsquo;re gone  </p>  <p class=\"MsoNormal\">  \t                      * Secrets to staying healthy on the road  </p>  <p class=\"MsoNormal\">  \t                      * Tips for managing time and finances during your trip  </p>  <p class=\"MsoNormal\">  </p>  <p class=\"MsoNormal\">  \t                      Most of what&#039;s out there on managing business travel assumes you stay at big-city hotels and head out equipped with the latest technology.  We visited some densely populated areas, but mostly drove on back roads to remote destinations.  For staying in touch, on our longest trip we relied on an ordinary cell phone and a five-year-old laptop.  No apps!  </p>  <p class=\"MsoNormal\">  </p>  <p class=\"MsoNormal\">  \t                      I now use a smartphone and a wifi-equipped netbook computer, but these aren&#039;t necessary.  And without depriving ourselves in any way whatsoever, we managed very well on a per-diem budget you probably won&#039;t believe.  </p>  <p class=\"MsoNormal\">  </p>  <p class=\"MsoNormal\">  \t                      Here is what a few of my marketing colleagues said about a previous version of <strong style=\"\">Take Your Business on the Road:</strong>  </p>  <p class=\"MsoNormal\">  </p>  <table border=\"1\" cellpadding=\"0\" cellspacing=\"0\" width=\"492\" style=\"\">  <tbody style=\"\">  <tr style=\"\">  \t<td style=\"\">  \t\t<p class=\"MsoNormal\">  \t\t\t<strong style=\"\">Gets You Ready to Live the Dream Life, Profitably!</strong><br style=\"\">  \t\t\t                     &quot;There&#039;s nothing better than hitting the road, traveling anywhere you   like and letting your business run itself. Well, there are some important   &#039;nitty-gritty&#039; answers you need when working away from home. Marcia Yudkin   covers it all.&quot; - Yanik Silver, Author, &quot;Instant Internet   Profits&quot;  \t\t</p>  \t</td>  </tr>  <tr style=\"\">  \t<td style=\"\">  \t\t<p class=\"MsoNormal\">  \t\t\t<strong style=\"\">Fantastic, Inspiring! My Obstacles Melted Away as I   Read </strong><br style=\"\">  \t\t\t                     &quot;Save yourself the grief of naive planning. It&rsquo;s like sitting down with   Marcia and going over all the fine details of her trip, uncovering the hidden   pitfalls of extended business travel - and then getting a &quot;to do&quot;   list to help you plan your own trip. An obstacle I have struggled with for   years is now gone, and I am already planning a trip for this spring.    Get <strong style=\"\">Take Your Business on the Road</strong> today. And then plan your extended   business trip with confidence!&quot; - Dianne Dawson, Business Development   Consultant, PrivatePracticeMarketingRoundtable.com  \t\t</p>  \t</td>  </tr>  <tr style=\"\">  \t<td style=\"\">  \t\t<p class=\"MsoNormal\">  \t\t\t<strong style=\"\">Helped Me Turn My Wanderlust into a Wonderful New   Life </strong><br style=\"\">  \t\t\t                     &quot;For the last three years, I&#039;ve been living full-time on the road in an   RV, and Marcia, your information is largely what gave me the courage to make   the plunge and start living my dream. Thanks for helping me realize I could   live my dream and still keep working.&quot; - Marty Marsh, Soul Proprietor,   SoulProprietorCoach.com  \t\t</p>  \t</td>  </tr>  <tr style=\"\">  \t<td style=\"\">  \t\t<p class=\"MsoNormal\">  \t\t\t<strong style=\"\">An Incredible Resource:  Our Wish Really is   Possible!</strong><br style=\"\">  \t\t\t                     &quot;My partner and I have been fantasying for some time about taking our   business on the road, but have hesitated because we didn&#039;t believe it was   possible while still making money. Marcia showed me how to see the world   while running my business, plus she outlined activities I could do along the   way that would earn me even more!  The intimate details and checklists   she shares are invaluable.  It&#039;s amazing how many traveling pitfalls I can now avoid,   since I&#039;ll know not to repeat some of Marcia&#039;s mistakes that she so   graciously shares. Thanks, Marcia, for paving the way!&quot;  - Sharron   Senter, marketing consultant, cofounder of VisitingGeeks.com  \t\t</p>  \t</td>  </tr>  </tbody>  </table>  <p>  \t             Get inspired and become equipped for your dream trip, with detailed advice you won&#039;t find anywhere else.  </p>  <p>  \t<strong style=\"\">By taking this course, you&#039;ll save money, avoid business and travel dangers, know how to efficiently combine fun and work on the road and most importantly, get excited about turning your unique travel dream into reality.</strong>  </p>  <p>  \t      Sign up today - and the sooner you&#039;ll be joyfully hitting the road!  </p>", 
    "end_date": null, 
    "title": "Take Your Business on the Road", 
    "price": "30.00", 
    "instructors": "Marcia Yudkin", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/125666_bf12_6.jpg", 
    "course_url": "https://www.udemy.com/take-your-business-on-the-road/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-26T15:52:33Z"
}