{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t              This course is an exploration of the technology and philosophy that will shape the next 20 to 30 years. We&#039;ll develop our big picture understanding of where the world is going and when. The course will also challenge us to ask some of the deepest questions that we&#039;ll be faced with in the near future; who are we? what do we want? and how can we create what we want?  </p>  <p style=\"\">  \t <em style=\"\"> Here&#039;s a breakdown of the course&#039;s sections:</em>  </p>  <p style=\"\">  \t<strong style=\"\">Section 1: Getting Started</strong>  </p>  <p style=\"\">  \t        In the first section we start by gaining a fundamental understanding of what technology and philosophy are and why it&#039;s important that we bring them together.  </p>  <p style=\"\">  \t<strong style=\"\">Section 2: 6 D&#039;s of Exponential Growth</strong>  </p>  <p style=\"\">  \t        This section covers the pace and qualities of technology growth. People often say that you can&#039;t predict the future, which is somewhat true, but we can definitely build a framework for understanding our direction more accurately.  </p>  <p style=\"\">  \t<strong style=\"\">Section 3: Technologies &amp; Trends</strong>  </p>  <p style=\"\">  \t       In the last section we cover the technologies and trends that will likely have the biggest impacts in the next 20 to 30 years. By getting a feel for these and how they come together, we&#039;ll build more clear vision for the future.  </p>  <p style=\"\">  \t <em style=\"\">Here are some of the topics included:</em>  </p>  <p style=\"\">  \t <strong style=\"\">Nanotechnology</strong> - How will the shrinking of our technology change our tools and our world?  </p>  <p style=\"\">  \t <strong style=\"\">Artificial Intelligence</strong> - A.I. will completely reshape our relationship with computers, our cities, and our daily lives. What will this look like and when?  </p>  <p style=\"\">  \t <strong style=\"\">Immortality &amp; Aging</strong> - For the first time in history, we have the chance to reprogram our biology away from aging and disease. What questions will this pose for us? What are the steps to defeating death?  </p>  <p style=\"\">  \t <strong style=\"\">Internet of Things</strong> - What happens when the physical world comes online and becomes intelligent?  </p>  <p style=\"\">  \t <strong style=\"\">Augmented &amp; Virtual Realities</strong> - Our technology isn&#039;t something that only exists in the physical reality we&#039;re used to. With virtual and augmented reality, we&#039;re enhancing the real world and creating entirely new worlds.  </p>", 
    "end_date": null, 
    "title": "Technology Trends", 
    "price": "30.00", 
    "instructors": "Thomas O'Brien", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/144154_7a84_13.jpg", 
    "course_url": "https://www.udemy.com/techcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-08T19:31:34Z"
}