{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">This is not your typical business management course.</strong>  </p>  <p>  \t  The 8 Factors is a <strong style=\"\">focused, easy-to-follow business management</strong> framework containing <strong style=\"\">real-world solutions to small business problems</strong>.  </p>  <p>  \tThe 8 Factors course distills the best content from business books, MBA theory, and the personal experience of over 400 successful Entrepreneurs into a practical and powerfully simple approach.  </p>  <p>  \t  The course is <strong style=\"\">most suited</strong> for the self employed solo-preneur or established small business owner looking for an <strong style=\"\">uncensored</strong> approach to <strong style=\"\">improving their business, while they run it</strong>.  </p>  <p>  \t  Because we’re fully aware that two of the biggest challenges small business owners face when growing a business is &quot;<strong style=\"\">clarity &amp; cash</strong>,” we’ve kept each video simple, direct, truthful, and <strong style=\"\">concentrated on what actually works</strong>.  </p>  <p>  \t  Whether you’re starting a business or trying to grow several, there’s a factor impacting your ability to succeed right now.  </p>  <p>  \t  These focused video lessons, step-by-step downloadable worksheets, assessments and tools, will support you in increasing business and creating a growth plan specific to your small business. <strong style=\"\">Your business, and your ability to lead it, will improve immediately!</strong>  </p>  <p>  \t  In this course you will discover exactly how to:  </p>  <ol style=\"\">  \t<li>Learn how to start, better manage, and grow your business</li>  \t<li>Go from “Cash Poor” to “Cash Rich”</li>  \t<li>Get “Strategy” right the first time</li>  \t<li>Attract a great team, lead and develop your people.</li>  \t<li>Develop a company culture that drives personal &amp; professional impact</li>  \t<li>Improve efficiency and Get Rid of Waste</li>  \t<li>Optimize Your Business &amp; Team Structure</li>  \t<li>Elevate Your Leadership</li>  </ol>  <p>  \t  C&#039;mon and give yourself a &quot;kick in the business&quot; that you can take all the way to the bank.  </p>  <p>  \t<strong style=\"\">Testimonials from real business owners:</strong>  </p>  <p>  \t<em style=\"\">&quot;When I first took the 8 Factors class 2 years ago, we had only about 5 employees and contractors. Today we have almost 20 people, and at the same time, our revenues have grown by 300 percent thanks to the 8 Factors framework.&quot; </em>  </p>  <p>  \t  -Nona Lim, Cook! SF  </p>  <p>  \t<em style=\"\">&quot;We almost sold our brand to a big chain until we used the 8 Factors Course to remind us that our mission—to provide unique, healthy products like Artisan Nut Butters and to grow jobs— is stronger than our need to sell out. We&#039;re on target for $8 million in sales!&quot; </em>  </p>  <p>  \t  -Santi Cuenca-Romero, Premier Organics  </p>  <p>  \t<em style=\"\">&quot;We&#039;ve grown from 35 to 78 employees in one year thanks to the 8 Factors Course. This year, we&#039;re tackling an unforeseen financial challenge by planning for best and worst case scenarios. But 8 Factors is helping us turn negative circumstances into positive opportunities.&quot;</em>  </p>  <p>  \t  -Tanya Scott, Ed Support Services  </p>  <p>  \t<em style=\"\">“The 8 Factors is powerfully simple and powerfully practical. It’s hard to argue with 8 million dollars in sales.”</em>  </p>  <p>  \t  -Rolando Brown, Made To Grow  </p>", 
    "end_date": null, 
    "title": "THE 8 FACTORS: Gain Clarity, Get Cash & Grow Your Business ", 
    "price": "50.00", 
    "instructors": "Michael C. Bush", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/80938_4fd4_9.jpg", 
    "course_url": "https://www.udemy.com/the8factors/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-19T23:02:57Z"
}