{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Most of us can think of really good reasons to get our work done faster. Maybe we want to finish quickly so we have time to do more tasks and earn more money, or maybe we want to finish quickly so we can have more free time. Either way, if you would like to improve your productivity by streamlining your work day, this course is for you!</p><p>Packed with useful tips and strategies for maximizing your time and minimizing your effort, this course is a must-have for anyone who wants to increase productivity and get through their work faster.</p><p>The content for this course comes from trainings I've taken on time management (in the legal field, where time is literally money since attorneys bill by the hour) in addition to strategies I've discovered for myself along the way to maximize my production while minimizing my efforts. Together, this course is a concise powerhouse of useful tips to help you strategize your work day and your working life for optimal productivity. The tips are simple and easy to employ, and strategies are provided to help you incorporate the ones that may be more difficult for you such as putting an end to procrastination! The course is short because it doesn't need to be any longer than it is. I'm interested in saving your time and mine, and in creating such a short, concise course I'm working smarter, not harder, and allowing you to also work smarter, not harder, by not wasting your time drawing it out any longer than it needs to be. In just 30 minutes, you'll discover a range of tips and strategies that will help optimize your productivity, freeing you up for more earning capacity or more play time, or both! </p><p>I've been able to develop extremely productive strategies that have enabled me to both take on more work and increase my earnings, as well as increase my free time. When you are super productive with your time and energies, you truly can have it all! This course provides you with the insights that will help you maximize your productivity by showing you how to use your time wisely and well.</p><p>The small investment in time and money you will make in this course will pay off for you for years to come. You'll be able to take on more tasks than your colleagues, which will impress the bosses, and you'll be able to have more free time to enjoy. In short, you have nothing to lose from this course! But, so much to gain.</p><p>So join me now! Let me share with you the strategies, tips and techniques that I've been using for many years to streamline my own life, and let me help you, too, work smarter, not harder.</p>", 
    "end_date": null, 
    "title": "Work Smarter Not Harder: Productive Time Management", 
    "price": "20.00", 
    "instructors": "Dr. Michele Poff, PhD", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/789686_d302_3.jpg", 
    "course_url": "https://www.udemy.com/work-smarter-not-harder/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T14:26:50Z"
}