{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t     Would you like to start using social media to connect with your customers, but don’t know which tools to use or what to say? Have you begun using social media, but aren’t seeing the response you were hoping for? Or do you need guidance on how to expand your use of social media?  </p>  <p style=\"\">  \t     If you’re on a tight budget, but need to understand how to create your own tailored strategy and develop a clear, prioritised action plan, then this course is for you. Presented by Suw Charman-Anderson, one of the UK’s social media pioneers, this course will teach you how to build a robust social media strategy to support your business goals, and give you the tools and understanding you need to assess your progress and to review your strategy.  </p>  <p style=\"\">  \t     Suw has ten years of experience developing social media strategies with small businesses and non-profits, and is very familiar with the particular challenges that small businesses face. Small organisations can benefit significantly from social media, but often have to work with limited resources, time and budget. Carefully choosing which social networks to invest in and having a clear strategy will ensure that you get the best return on your social media investment.  </p>  <p style=\"\">  \t     This course itself is based on a very successful workshop that Suw has developed specifically for small organisations. It includes video tutorials explaining the key principles and frameworks that underpin a successful social media strategy, and how to apply them to your own business. Each section includes exercises to complete, on your own or with colleagues, that will guide you through applying the concepts you have learnt to your own business.  </p>", 
    "end_date": null, 
    "title": "Write Your Own Social Media Strategy", 
    "price": "20.00", 
    "instructors": "Suw Charman-Anderson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/187864_5906_4.jpg", 
    "course_url": "https://www.udemy.com/write-your-own-social-media-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-24T15:37:55Z"
}