{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>For every one digital product success story, there are more than a dozen that have failed. Why? Launching a smart, connected product requires a completely different approach than launching a traditional product. Smart, connected products create a fundamental shift in how we do business, altering the landscape of how we design products and deliver value to our customers. \n\n  </p>\n\n<p>In this course, you will learn how to successfully make the transition to smart, connected product strategy or digital product strategy. Digital product strategy is the new way of doing business, where technology helps us pack more information value into our products.  Having access to more information helps us better understand how customers are using our product and how these products are performing in the field.  The result is a data-rich approach to optimizing customer satisfaction through adapting and improving our digital product solutions on an ongoing basis.\n\n  </p>\n\n<p>The course leverages a range of real-world problems showing you how to redesign your products and business model to better meet user needs and for increased competitive advantage. Each of the course’s activities embodies a ‘learning by doing’ approach, applying module concepts to develop and refine your own smart product concepts and digital business models.  </p>", 
    "end_date": null, 
    "title": "Your Complete Guide to Smart, Connected Product Strategy", 
    "price": "50.00", 
    "instructors": "Dr. Todd Hostager", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802942_0a7f.jpg", 
    "course_url": "https://www.udemy.com/smart-connected-product-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T15:27:00Z"
}