{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>この講座では、事業承継を円滑にする方法についてご紹介いたします。</p><p>事業承継というのは、経営者が高齢になったり、死亡した、という場合に後継者に引き継ぐ（承継する）といったものです。</p><p>事業承継は、親から子供へ相続する、といった親族内事業承継や、企業内の他の役員や従業員が承継する企業内承継、あるいは、外部の取引先や金融機関から経営者を招く、M&amp;Aなどで行われる事があります。<br><br>最近では、M&amp;Aなども多いですが、やはり親族内承継の数が多いので、この講座では、相続の基礎知識も踏まえながら、親族内での事業承継について、円滑にすすめるための方法について、ご紹介致します。</p><p>円滑に事業承継をすすめるためのコツは、<br>経営者の所有する株式や事業資産（不動産、現金、預金など）を後継者に対して、円滑に、かつ、集中して承継する事です。</p><p>この事を行うためには、資金の準備、時間の確保、節税との関係が重要です。<br>この講座を受講頂きますと、これらの準備をどのようにすすめるか、について理解できるようになり、円滑な事業承継に繋がります。<br><br><strong>【講師プロフィール】</strong></p><p>つまこい法律事務所<br>佐久間 大輔</p><p>1970年生まれ、1993年中央大学法学部卒業、1997年東京弁護士会にて弁護士登録、2013年つまこい法律事務所開設。 <br>労災・過労死事件を中心に、労働事件、一般民事事件を扱う。 日本労働法学会所属。</p><p>過労死や労災、労働問題について執筆。以下、単行本を紹介。</p><p>・労働法実務解説7　安全衛生・労働災害（旬報社、2016年）<br>・シリーズ働く人を守る 精神疾患・過労死 第2版（中央経済社、2012年）<br>・過労死時代に求められる信頼構築型の企業経営と健康な働き方（労働開発研究会、2014年） <br>・労災・過労死の裁判（日本評論社、2010年）<br> <br>労災・過労死、安全衛生・メンタルヘルスなどについて講演をした一例。 <br>・労働問題に精通した弁護士が繰り広げるモギ法廷～ストレスチェックに関連する想定事例を素材として（日本産業衛生学会近畿地方会産業医部会）</p><p>・弁護士が説くメンタルヘルス対策のポイント（産業保健法学研究会）</p><p>・労災をめぐる最新判例動向解説－最近の過労死裁判例と企業の補償・予防義務（労働開発研究会）</p><p>・安全衛生・労働災害をめぐる法律問題、過労死・メンタルヘルスをめぐる法律問題（東京都労働相談情報センター）</p><p>・最近の過労死裁判例と企業の補償・予防義務（メンタルリスク・マネジメント・セミナー）</p><p>・労災・過労死事案の損害賠償訴訟の実務（東京三弁護士会）</p><p>・労災－安全配慮義務違反に基づく損害賠償請求、過労自殺と労働者のメンタルヘルスをめぐる諸問題（東京弁護士会）</p><p>・労災・職業病の法律実務（日本弁護士連合会）</p><p>・医師の働き方を考える（日本産業衛生学会）</p><p>・過労死・過労自殺（静岡県社会保険労務士会）</p><p>・労災・職業病をめぐる法律問題（埼玉弁護士会）</p><p>・産業カウンセリングに関わる労働法令、産業カウンセラーのための生きた労働法知識－過労死・過労自殺（日本産業カウンセラー協会）</p><p><br><br><br></p>", 
    "end_date": null, 
    "title": "事業承継を円滑にする方法（知らないと損する法律講座）", 
    "price": "20.00", 
    "instructors": "株式会社 キバンインターナショナル", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736724_bce2.jpg", 
    "course_url": "https://www.udemy.com/ylvefzfl/", 
    "currency": "USD", 
    "subject_name": [
        "Strategy"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T12:17:46Z"
}