{"selfpaced": true, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                    \n                    Advanced Competitive Strategy will introduce new topics and modules with even more real world examples and opportunities for student interaction than in the previous course Competitive Strategy (https://www.coursera.org/learn/competitivestrategy).\n \nIn Advanced Competitive Strategy, we will look at how companies can build up and maintain their customer base by increasing switching costs and facilitating strategic customer lock-ins. We will find out how firms can increase their profits by pursuing suitable price discrimination and product differentiation strategies.\n \nWe will look at examples of what is acceptable behavior under the premises of EU competition and US antitrust policies and discover exciting ways of how companies can increase their returns by strategically making use of network effects and economies of size. We will further intensify our newly acquired knowledge about network effects and discuss strategies that are explicitly tailored to network markets.\n \nWe will analyze the workings of mergers and acquisitions and, moreover, support you in considering alternative strategies that can help companies grow organically.\n\n                                            Syllabus\n                        Maintaining your Customer BaseIn this module we will look at strategies that can help us maintain our customer base. For this, we will take an analytical approach that helps us understand the point at which our customers will switch to a competitors and the amount of money a competitor is willing to spend to acquire our customers. Based on this understanding, we will derive applicable strategies that can help us lock in our customers strategically. We will do this by keeping in mind that also customers may apply their own strategies to avoid lock in and further, that our competitors will seek to apply strategies in the pursuit of making our customers theirs.Determine your Prices WiselyWe will look at the benefits of price discrimination as a strategic tool that can help us to skim off our customer’s willingness to pay and increase our utility accordingly. We are then going to learn the different ways of aligning a price discrimination strategy with successful product design and the three different ways in which a price discrimination strategy can be formulated.Keep Your Business CleanIn this module we will demonstrate that if you want to operate a business you have to keep in mind that there are some powerful external entities, so-called competition authorities, that highly value and safeguard competition. While this supports and opens up opportunities for your business if it is new or relatively small and would otherwise simply be crushed by larger incumbent firms – it can also put you in danger if you have already achieved a certain size, have acquired more market power are already in a rather powerful position.Increase your ReturnsIn this module, we are going to discover two very important new concepts with which you can increase your business’s returns:  Network effects and boundaries of the firm. We will find that considering these two concepts in formulating our business strategy can help us improve our strategy’s effectiveness and eventually increase our returns.Strategies in Network MarketsWe will build upon our knowledge from module 4 and look into competition in network markets, adoption rates and the advantage of critical mass. Following from this, we will learn why this is essential for reaching the point of critical mass. We will moreover discuss ways in which companies can raise the attention of potential consumers and reduce their perceived risk.Achieve Growth with the Help of PartnersWe will look at the trends, goals and processes of mergers and acquisitions, differentiate the two terms and examine external and internal factors that can hinder the process. We will also find out about the striking advantages that can make a successful merger or an acquisition worthwhile if you have identified the right match for your company and we will eventually learn about the process that is involved in real world M&amp;A activities.Grow OrganicallyIn this special bonus module, we will discuss the relationship between profitability and growth on the one hand and the limitations that are faced by small companies on the other. We will learn what organic growth is and that it can be achieved by either protecting and building up our existing customer base and product lines, or by developing new products or markets – or, in turn, by diversifying our products portfolio. We will acknowledge and address external and internal limitations to growth and – as a final consideration – will look into the possibilities of international strategies for growth.Final Exam\n                                    ", "end_date": "2014-08-15T00:00:00Z", "title": "Advanced Competitive Strategy", "price": 0, "instructors": "Tobias Kretschmer", "institution_name": ["Ludwig-Maximilians-Universität München"], "commitment": "2-4 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/advanced-competitive-strategy", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-06-20T00:00:00Z"}