{"selfpaced": false, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                    \n                    In this course you will learn how organizations create, capture, and maintain value, and how it is fundamental for sustainable competitive advantage. You will be able to better understand value creation and capture, and learn the tools to analyze both competition and cooperation from a variety of perspectives, including the industry level (e.g., five forces analysis), and the firm level (e.g., business models and strategic positioning). \n\n•\tUnderstand how managers coordinate different functional areas, resources, and systems inside a company and align them with the external environment to enhance overall performance\n•\tKnowledge of strategic management tools and frameworks, and apply them to real business contexts Process diverse business and industry information to diagnose strategic issues, evaluate strategic alternatives, and formulate a coherent and actionable strategic plan\n•\tHow to think like a CEO, entrepreneur, or general manager.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\n                                            Syllabus\n                        Course OrientationYou will become familiar with the course, your classmates, and our learning environment. The orientation will also help you obtain the technical skills required for the course.Module 1: Leading StrategicallyThe Leading Strategically module will lay the foundation of business strategy course. You will learn about mission, vision and values and their role in overall strategy landscape. You will learn about the VARS framework for analyzing business models and SWOT framework for understanding the fit and coherence of business strategy. Module 2: External AnalysisThe Environmental Analysis module will focus on a key aspect of business strategy – analyzing and understanding the external environment of a firm. You will learn about the macro-environment of firms and the PESTEL framework for macro-environmental analysis. You will also learn about firms’ industry environment and understand how to predict industry profitability by using the 5-forces framework.Module 3: Internal Analysis and Competitive AdvantageThe module on Internal Analysis and Competitive Advantage will provide an in-depth understanding of the origins of unique company strengths and how they can produce a competitive advantage. You will learn about the origins and consequences of fundamental internal differences among firms using the analytical viewpoints of activities, resources, and capabilities. You will be introduced to the strategic tools of value chains, value networks, and the V-R-I framework to help you analyze the implications of these within-firm differences for (sustained) competitive advantage.Module 4: Strategic Positioning and Strategic RenewalThe Strategic Positioning and Strategic Renewal module brings together the internal and external aspects of strategic analysis to formulate an overall strategy for the firm. You will learn about the two main “generic strategies” that businesses can pursue, which can be complemented by broad or narrow scope to yield four key types of strategic positioning. You will also learn about “dual” strategies and why and how a firm's strategy must be adapted to strategically renew its positioning.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Business Strategy", "price": 0, "instructors": "Deepak Somaya", "institution_name": ["University of Illinois at Urbana-Champaign"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/strategy-business", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}