{"selfpaced": false, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                    \n                    Learn to analyze and improve business processes in services or in manufacturing by learning how to increase productivity and deliver higher quality standards. Key concepts include process analysis, bottlenecks, flows rates, and inventory levels, and more. After successfully completing this course, you can apply these skills to a real-world business challenge as part of the Wharton Business Foundations Specialization.\n\n                                            Syllabus\n                        IntroductionThis short module was designed to introduce you to the course, and to give you an overview of what you can expect from the course and the instructor!Process AnalysisIn this module, you'll learn how to identify key elements of process analysis: flow rates, and flow times, how to uncover bottlenecks, how to optimize labor and inventory, and how to handle the complexities of multiple flow units. At the end of this module, you'll be able to break down operations into processes which can then be improved to maximize profits and efficiency.ProductivityYou'll learn the key components of productivity in this module. Beginning with the academic definitions of productivity, you'll move on to the common blockers, measurements, indicators of effectiveness, improvement techniques and financial values. By the end of this module, you'll be able to identify, describe and measure the relationship between inputs and outputs and also be able to develop strategies for decreasing inputs while increasing outputs, thereby boosting productivity wherever you see the need to.QualityQuality is not only a cornerstone of operations management, but also a critical component of an organization's long-term viability and success. This module covers all the major aspects of quality in operations, from examining the common reasons for defects to the most widely used implementation techniques for addressing problems of quality and ensuring reliability and standards. At the end of this module, you'll be able to anticipate where defects may occur and recommend a sound strategy for maintaining quality and stability.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Introduction to Operations Management", "price": 0, "instructors": "Christian Terwiesch", "institution_name": ["Wharton School of the University of Pennsylvania", "University of Pennsylvania"], "commitment": "5-7 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/wharton-operations", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}