{"selfpaced": false, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                    \n                    If you’re running a cash-strapped enterprise, it's easy to see impact measurement as a “nice to have” rather than a critical need. But, there is a fundamental alignment between measuring impact and creating value for customers.\r\nImpact starts and ends with data. Data allows us to see how we performed, test assumptions, contrast performance, align incentives and hold ourselves accountable. Yet data gathering in the social sector often seems like a costly, time-consuming and daunting challenge. At Acumen we think that data collection can be made significantly more efficient through 3 interconnected components we call the Lean Data Cycle: new mobile technology;innovative survey questionnaires; and integration with existing company-customer touch points.\r\nIn this 4 hour course, you’ll learn more about the Lean Data mindset and how to scope your own lean data initiative. The course will be interspersed with real case studies from social enterprises in Acumen’s portfolio so that you understand on-the-ground challenges and rewards associated with implementing a Lean Data approach.\r\n\r\n \r\nKey Learning Outcomes:\r\nBy the end of this course, you will:\r\n\r\nUnderstand the Lean Data mindset and the 3 connected components of the Lean Data Cycle\r\nPitch the value of a Lean Data approach to the enterprises, organizations or stakeholders you work with in ways that align with their business priorities\r\nVisualize the current information flow within your organization and identify places where data could be collected in the least disruptive way\r\nBegin to scope a lean data initiative for your organization that identifies the timeline, personnel, costs, and technology associated with implementation\r\n\r\nThis Course Is For You If:\r\n\r\nYou are a social entrepreneur looking to align your impact priorities with your business priorities and collect data in the least disruptive way possible\r\nYou are a social sector organization looking to shift from a monitoring and evaluation approach to an impact measurement approach\r\nYou are anyone in the impact investing space looking to learn more about how to measure impact\r\nYou took +Acumen’s longer course on “Measuring Social Impact” and are looking to learn more about one approach to data collection\r\n\r\n\n\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Lean Data Approaches to Measure Social Impact", "price": 0, "instructors": "", "institution_name": ["+Acumen"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://novoed.com/lean-data-2016-1", "duration": null, "language_name": ["English"], "provider_name": ["NovoEd"], "start_date": "2016-05-10T00:00:00Z"}