{"selfpaced": false, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                    \n                    The foundation for this course lies with unique synergies between pioneering research, teaching, and social initiatives through the Subsistence Marketplaces Initiative. Unique to this approach is a bottom-up understanding of the intersection of poverty and the marketplace.\n\nThe goals of this course are to help you develop an understanding of marketplace activity in the radically different context of subsistence where much of humanity resides and survives, and for you to design solutions that can be implemented by individuals, businesses, and social enterprises through economically, ecologically, and socially sustainable products for subsistence marketplaces.\n\n                                            Syllabus\n                        Course OrientationYou will become familiar with the course, your classmates, and our learning environment. The orientation will also help you obtain the technical skills required for the course.Introduction to Subsistence Marketplaces ApproachIn this module you will learn about the bottom-up approach to the study of subsistence marketplaces. The module will also discuss cognitive predilections engendered by low-income and low-literacy in subsistence marketplaces.   \nConsumers and Entrepreneurs in Subsistence MarketplacesIn this module you will learn about emotions and coping behaviors in subsistence marketplaces. The module will also expose you to the life circumstances of consumers and entrepreneurs in subsistence marketplaces.  \nExchanges and Needs in Subsistence MarketplacesIn this module you will learn about unique aspects that characterize marketplace interactions between buyers and sellers in subsistence marketplaces. You will also learn about understanding needs and markets in subsistence marketplaces.\nGaining Marketplaces InsightsIn this module you will learn about gaining marketplace insights in subsistence marketplaces. You will also learn about environmental issues in subsistence marketplaces. \nIdentifying Needs and Generating IdeasIn this module you will learn about understanding needs in subsistence contexts. You will also learn about a structured approach to generating ideas for addressing the needs in subsistence marketplaces.\nEvaluating Ideas and Designing SolutionsIn this module you will learn about evaluating ideas and designing various aspects of the chosen solution.\nCrafting an Enterprise PlanIn this module you will learn about how to craft a detailed enterprise plan for sustainably delivering a solution in subsistence marketplace.  \nCourse Summary and ConclusionIn this module we will recapitulate some key concepts we have learned in the course and offer concluding thoughts.   \n\n                                    ", "end_date": "2016-08-01T00:00:00Z", "title": "Subsistence Marketplaces", "price": 0, "instructors": "Madhu Viswanathan", "institution_name": ["University of Illinois at Urbana-Champaign"], "commitment": "4-6 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/subsistence-marketplaces", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}