{"selfpaced": false, "topic_name": ["Psychology"], "description": "\n\n                    \n                    \n                    Language learning can be put under three broad perspectives. Some believe language is pairing of lexicon and syntax i.e. of words and the set of rules that defines how we can combine those words most fundamental of these rules are innate i.e. they are already there in the human mind before it is exposed to society. This means there is perhaps an innate Language Faculty. Still others believe that General Cognitive Abilities that account for other kinds of learning can also account for language. There are many others who strongly believe that language is essentially socially embedded and that all learning takes place through social interactions. This course will briefly account for the most convincing position and will argue for it from generative perspective and biological foundations of language. Throughout the course we will try to be familiar with relationship between language and human mind; to understand language as a special purpose cognitive ability; and to understand underlying mental computation for natural language processing.\n\n                                            Syllabus\n                        Week One- On Language  What is Language?What is scientific about language?How is language constitutive of being human?Distinction between human and non-human languageOrigin of languageWhat is the relationship between language and mind?How do children acquire language?Nature of learning languageGenerative foundation of language acquisitionBiological foundation of LanguageLanguage acquisition deviceUniversal grammarWeek Two- Language in MindAcquisition and/or learningI-language and InnatenessPatterns – Universal GrammarHuman BrainLanguage deficit/ lossWeek Three- Patterns in sounds and wordsSoundsVowels/ConsonantsPlaces and manners of articulationFeatures of soundsWeek Four- Words and sentencesWordsConstraints of patterns in wordsCluster as constraintsSyllablesWeek Five- GrammarParts of sentencesSubjects/ PredicatesLexical categoriesFunctional categoriesNature of verbsWeek Six- Advanced GrammarComplement/ adjunctRestrictionsSemantic relationsCaseMovementWeek Seven- Levels of representation and principles of grammarMovement/displacementMotivation for the movementComplementizer phraseCase assignmentPassive morphology and NP movementD structureBinding theoryIndices and antecedentsCo-indexingConstraintsWeek Eight- On language and mindCompound verb NegationLanguage and Cognition Goal of cognitive sciencesComputational linguistics- goals, breakthroughs and challengesLanguage and mind\n                                    ", "end_date": "2016-03-14T00:00:00Z", "title": "Language and Mind", "price": 0, "instructors": "Rajesh Kumar", "institution_name": ["IIT ( Indian Institute of Technology Madras)"], "commitment": "2-3 hours", "subject_name": ["Social Sciences"], "course_url": "https://onlinecourses.nptel.ac.in/noc16_hs02", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["NPTEL"], "start_date": "2016-01-18T00:00:00Z"}