{"selfpaced": false, "topic_name": ["Literature"], "description": "\n\n                    \n                    \n                    הקורס מציע מיפוי של השירה העברית החדשה למן תנועת ההשכלה דרך תקופת \"התחייה\" והמודרניזם שבא בעקבותיה, ועד לימינו. הקורס מציג באופן חי ונושם את המפנים הפואטיים ואת ההתפתחויות הסגנוניות והתמטיות בתחום השירה העברית, מראשיתה, באמצעות קריאות קרובות של טקסטים מן התקופות השונות, ומעמיד מאגר גדול ושופע של ידע תיאורטי, ספרותי  והיסטורי, לצד פרשנויות עמוקות, מאתגרות ומפתיעות.\n\n                                            Syllabus\n                        Week 1 - Introduction to the Hebrew Renaissanceמבוא לשירת \"התחייה\" - יהודה לייב גורדון ושירת \"חיבת ציון\"Week 2 - The Renaissanceשאול טשרניחובסקיWeek 3 - Bialik 1 - Sentimental Educationחיים נחמן ביאליק - חלק א'Week 4 - Bialik 2 - Light, Shade and Wrathחיים נחמן ביאליק - חלק ב'Week 5 - Bialik's Generation - Belle Époque and Urbanismדור ביאליקWeek 6 - Pioneers of Modernismראשית המודרניזם - יעקב פיכמן, אברהם בן יצחק, דוד פוגלWeek 7 - On The Verge of Expressionismראשית המודרניזם העברי - דוד פוגל, דוד שמעונוביץ ויוסף צבי רימוןWeek 8 - Modernism and Symbolismמודרניזם וסימבוליזם - אורי צבי גרינברג ואברהם שלונסקיWeek 9 - The Women Pioneers of Poetryנשים חלוצות בשירה העברית המודרנית - אסתר ראב ורחל בלובשטייןWeek 10 - The Poetry of Altermanנתן אלתרמןWeek 11 - Goldberg and Lenskiלאה גולדברג וחיים לנסקיWeek 12 - The Generation of 1948שירת דור תש\"חWeek 13 - The Generation of the Stateשירת דור המדינהWeek 14 - Israeli Poetry and the Spoken Hebrewהשירה הישראלית והעברית המדוברת\n                                    ", "end_date": "2016-09-05T00:00:00Z", "title": "Modern Hebrew Poetry   שירה עברית מודרנית  ", "price": 0, "instructors": "Ariel  Hirschfeld", "institution_name": ["Hebrew University of Jerusalem"], "commitment": "2-3 hours", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/hebrew-poetry", "duration": "14 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}