{"selfpaced": false, "topic_name": ["Literature"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Humanities\n                                                                                                    &gt; Literature\n                                                            \n                            \n                                                \n                    \n                    \n                    William Shakespeare is one of the most famous authors of all time. 2016 marks the 400th anniversary of his death, with his words have inspired and moved people from around the globe for centuries.\n\nHow much do we know about Shakespeare’s cultural background and influences and why his works have endured? To get a real sense of how the Bard’s world would have actually looked and felt, renowned Shakespearean academic Professor Jonathan Bate will be exploring the acclaimed collections of the Shakespeare Birthplace Trust. Professor Bate is also the Lead Educator, with Dr Paula Byrne, on the new Literature and Mental Health: Reading for Wellbeing FutureLearn course from Warwick.\n\nEach week, Professor Bate will examine a particular play and a cultural theme alongside a selection of treasures from the Trust’s archives in Stratford-upon-Avon. Weekly learning material will be broken down into six video segments, each examining a variety of artefacts and play extracts. The course will open with an introduction to Shakespeare and his living and working environment, moving onto broader cultural themes and issues examined in his plays and ending with an exploration of his legacy.\n\nThis course is the result of an exciting new collaboration between the University of Warwick and the Shakespeare Birthplace Trust, the world’s leading charity in promoting the works, life and times of William Shakespeare. The course will provide unprecedented access to the Trust’s fascinating historical collections of museum, library and archive items. You will have the chance to look inside the Shakespeare Birthplace Trust vaults where thousands of artefacts are kept. The course will also take you into some of the key locations associated with Shakespeare which are looked after by the Trust, including the house where he was born and grew up.\n\nThis is a great opportunity to engage with a topic that has captivated people for centuries, learn from a world expert in the field and enjoy exclusive access to behind-the-scenes historical material.\n\n\n\nSuccess and Feedback from the course\nOver 40,000 learners from across the world have previously joined Jonathan Bate and the teams from the University of Warwick and the Shakespeare Birthplace Trust to explore Shakespeare, his plays, and the world in which he lived. Below are some examples of the impact the course had:\n\n\n  “This has been an enlightening and thoroughly enjoyable course. Thanks to everyone involved in bringing it to new learners, and special thanks to Jonathan for bringing alive the course materials - your passion and knowledge of your subject was infectious. I’d like to do it all over again.” Natalie Gillett\n\n\n\n  “Thank you, thank you, thank you! I loved this course because not only did I learn so much about Shakespeare, but also because I enjoyed learning, reading, investigating and getting to know so much people around the world with the same interest, with so much knowledge and passion about the Bard. I admire each of the people who make this course possible, I thank them to make it possible for people around the globe. It was a wonderful experience. THANK YOU!” Paula Mascheroni\n\n\n\n  “This has been a marvellous course, I am so sorry that it has to end. I have learned an enormous amount and can look at Shakespeare’s plays with a much more inquiring mind than before. It is not enough just to read theme, you need to research the background too. Thank you Professor Bate and Jennifer for making the course so alive and interesting.” Caroline Graham\n\n\n\n                                    ", "end_date": "2016-06-27T00:00:00Z", "title": "Shakespeare and his World", "price": 0, "instructors": "Jonathan Bate", "institution_name": ["The University of Warwick"], "commitment": "5 hours", "subject_name": ["Humanities"], "course_url": "http://www.futurelearn.com/courses/shakespeare-and-his-world?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-04-18T00:00:00Z"}