{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Learn how to take ideas, validate them, and prototype them all in one day, without learning how to code!</em></p>\n\n<p><strong>Become a better entrepreneur, product manager, marketer, manager, or small business owner</strong>. Learn how experienced entrepreneurs come up with killer ideas and launch them with minimum time investment with<em> $0 upfront.</em></p>\n\n<p>Are you ready to take the plunge and finally pursue the business idea of your dreams?</p>\n\n<p>Are you sure you have the skills and the time to be successful? </p>\n\n<p>Have you heard of the Lean Startup, the product framework that is revolutionizing startups all over the world?</p>\n\n<p>Learn the skills that are essential to being a successful Entrepreneur in 2016 +.</p>\n\n<p><strong>About the instructor:</strong></p>\n\n<p>Top rated Udemy Instructor with over 630+ 5 star reviews.</p>\n\n<p>Teaches 10 different courses on Entrepreneurship through Udemy, Skillshare, &amp; One Month.</p>\n\n<p>All courses by the instructor have 100% positive reviews with an average of 5 stars.</p>\n\n<p>Startup founder for 5 years, raised 3 rounds of capital worth several millions of dollars</p>\n\n<p>Worked as a VC and was in charge of deal flow in Silicon Valley. Oversaw investments in large companies like Facebook, LinkedIn, &amp; Tesla. </p>\n\n<p>Currently owns and runs Sprintkick, a web agency, that builds web and mobile apps for 20+ Fortune 500 companies. Created and launched over 100+ apps in the last 4 years.</p>", 
    "end_date": null, 
    "title": "1 day MVP 2.0 | Go from idea to MVP in just 1 day", 
    "price": "20.00", 
    "instructors": "Evan Kimbrell", 
    "commitment": "23.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472704_b65f_3.jpg", 
    "course_url": "https://www.udemy.com/1-day-mvp-find-the-right-idea-and-build-a-demo-in-1-day/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T11:20:20Z"
}