{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong></p>\n\n<p><strong>** Chris is the author of the #1 best selling business course on Udemy called \"An Entire MBA in 1 Course.\" ** </strong></p>\n\n\n\n<p><strong>** ACCORDING TO BUSINESS INSIDER: \"<em>Haroun is one of the highest rated professors on Udemy, so you can expect to be in good hands through the course of your education</em>.\" **</strong></p>\n\n<p><strong>This is the video version of the book that Forbes magazine calls \"<em>1 of 6 books that all entrepreneurs must read right now</em>\" (along with <strong>\" The 7 Habits of Highly Effective People\" by Stephen Covey, \"The Lean Start-up\" by Eric Ries,</strong> Peter Thiel's book \"From Zero to One\", and The Self Made Billionaire Effect.\"). </strong></p>\n\n\n\n<p><strong>I am humbled to say that the feedback on this course has been amazing!</strong> In this course you will learn how to get a meeting with anyone. You will learn how to take your career to the next level. You will learn how to reinvent yourself in ways that you never thought was possible! Chris Haroun has had the opportunity in his career to meet with the top CEOs, entrepreneurs and investors in the world, including Warren Buffett, Bill Gates, Marc Benioff and the CEOs of most large technology companies. This book is an amalgamation of business advice that Chris has compiled from his many meetings with successful business people over the past two decades as well as observations of why brilliant entrepreneurs like Steve Jobs or Mark Zuckerberg have become incredibly successful. Business schools do a good job of providing students with theoretical and practical frameworks that can be applicable to real world problems but often miss teaching students some of the most crucial business lessons like how to network, how to find customers or how to get a job!<br></p>\n\n\n\n<p>Chris Haroun is an award winning business school professor, venture capitalist and author. He is currently a venture capitalist at a prominent San Francisco Bay Area venture capital firm and has previous work experience at Goldman Sachs, hedge fund giant Citadel, Accenture and several firms that he has founded. He has raised and has managed over $1 billion in his career. <br><br>Chris teaches many courses online at Udemy. He has an MBA in Finance from Columbia University and a Bachelor of Commerce Degree with a major in Management Information Systems and International Business from McGill University. Chris is also a frequent guest lecturer at several Bay Area business schools including Berkeley and Stanford. He is a McGill University Dobson Fellow. He has written numerous articles/been interviewed in Forbes, VentureBeat, Entrepreneur Magazine, Wired Magazine, AlleyWatch and Radio Television Hong Kong (RTHK: Hong Kong's oldest and sole public service broadcaster). He serves on the boards of several Bay Area technology companies and charities. Chris Haroun is originally from Canada and currently lives in Hillsborough, California and enjoys playing baseball with his wife and three sons.<br></p>", 
    "end_date": null, 
    "title": "101 Crucial Lessons They Don't Teach You In Business School", 
    "price": "20.00", 
    "instructors": "Prof. Chris Haroun", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/637932_22ad_18.jpg", 
    "course_url": "https://www.udemy.com/101-crucial-lessons-they-dont-teach-you-in-business-mba-school/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-12T06:41:07Z"
}