{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This content packed course that is just over 3 hours will teach you 14 ways of making money with mobile apps. It is projected that by 2018 there will be 2 billion plus smartphones in the world. This presents a tremendous opportunity for you to position yourself to make money from mobile apps. There are over a million mobile apps in the app stores and so for your app to be discovered may take time. This means that it will take you time to make money from the app. </p><p>This course will discuss 14 areas that you can make money from in your app business. For each, the pros, cons and how to succeed with it will be discussed. This course is for both technical and non-technical people and is presented using simple English. No technical jargon is used. Where necessary live demos are used to clarify concepts and show live examples. </p><p><strong>WHY TAKE THIS COURSE</strong></p><p>(1) You are a newbie who wants to position yourself to make money with mobile apps. There are over one million apps so you have to create additional streams of income.</p><p>(2) You are frustrated with apps that do not make you money. I know this feeling since I have a few of my own apps that do not make me money. As you wait for your apps to be discovered you can be making money on the side to continue promoting them as well as sustain yourself.</p><p><strong>MATERIALS PROVIDED</strong></p><p>Marketing pointers document to help you with marketing your apps so that they are discovered and downloaded. </p>", 
    "end_date": null, 
    "title": "14 Ways to DIY: Mobile App Builders", 
    "price": "20.00", 
    "instructors": "Jack Kogera", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/712400_d980.jpg", 
    "course_url": "https://www.udemy.com/diy-mobile-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-01T12:39:46Z"
}