{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to the overview of the '28 Days to Change Your Life' Programme.  This course has been developed to help people within Network Marketing develop the right MINDSET to move their businesses forward to the level they desire.</p>\n\n<p>More than in any other business, the Independent Business Owners within the profession of Network Marketing need to have the right, positive Mindset in order to achieve the success on offer - Mindset really is everything.</p>\n\n\n\n<p>With the right Mindset you will do the income-generating activities you need to, when you need to, in order to build your business; consistency, focus and determination will be at your core.</p>\n\n\n\n<p>This business is very adept at highlighting your negative Mindset; it's all too easy to put activity off, to think you're not worth it, that you can't achieve it, that you're not good enough, that people are ridiculing you, that others will think negatively about you and not be interested in what you are saying.  This is not the place to build a business from.</p>\n\n\n\n<p>And the FANTASTIC news is that this is NOT TRUE.  It's NOT REAL.  These thoughts are merely a trace of your past thinking, a result of your past experiences.  You CAN develop a new way of thinking.  A BETTER WAY for GOOD.</p>\n\n\n\n<p>In this Programme Will Perry will introduce you to fun and very accessible ways that YOU can train yourself to think more positively, for GOOD.  To SEE positive outcomes, HEAR empowering dialogue in your mind that drives you into action and FEEL energised, determined, focussed and MOTIVATED to achieve your GOALS.</p>\n\n\n\n<p>Will explains each stage of the process in 5 key sections, showing exerts of live demonstrations to help illustrate the different approaches we can have.</p>\n\n\n\n<p>This Programme is for you if you are relatively NEW to your business and want to progress QUICKLY or if you are STUCK, feeling lost, slowing down and could benefit from a new set of tools and techniques to benefit you POSITIVE MINDSET.</p>\n\n\n\n<p>There are LOTS of new approaches to benefit from with support on offer through our secret FaceBook group and, similar to a buffet, not consume all of it, yet there are enough tools to help you create the DIFFERENCE to make THE DIFFERENCE.</p>\n\n\n\n<p>Should you choose to enrol now, I look forward to working with you and seeing your progress for good via our FaceBook group.</p>\n\n\n\n<p> <br></p>", 
    "end_date": null, 
    "title": "28 Days to Change Your Life - in Network Marketing", 
    "price": "50.00", 
    "instructors": "Will Perry", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/748720_6c2e_3.jpg", 
    "course_url": "https://www.udemy.com/28-days-to-change-your-life-in-network-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T10:18:56Z"
}