{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you tired of just getting by? Living month to month? Have you ever told yourself after a close call financially \"I'm never going to let that happen again\"? Do you dream of having a few months worth of income in the bank, not having to worry about expenses that pop up out of the blue? Take this course to spark ideas for how to make extra money without selling your soul.</p>\n\n<p><strong>---</strong></p>\n\n\n\n<p>This course is a labour of love for me. I've been in that place where I didn't want to wait two weeks to be paid, where I checked my bank account every day, where I wondered why our food bill seemed so expensive.</p>\n\n\n\n<p>I needed a buffer, a way to reduce the risk that things like car troubles or medical expenses would push me into debt.</p>\n\n\n\n<p>That lead me to studying financial planning and writing thousands of financial plans for financial advisers. I also read, listened and watched as much as I could to find out what I was doing wrong and what I could be doing better.</p>\n\n\n\n<p>I'll leave the personal finance tips for another course but I want to give you enough ideas and inspiration in this course that you go out there and give your own money-making idea some legs. Take a risk. Fail. Get up and try again. Flounder. Ask for help. Make your first $100 extra per month. Learn. Reduce some risks. Be bolder. Be more generous. Build more of the skills that your market needs and let your passion come along for the ride.</p>\n\n\n\n<p><em>A ship in harbor is safe, but that is not what ships are built for. - John A. Shedd</em></p>\n\n\n\n<p><strong>---</strong></p>\n\n\n\n<p>Through this course, I'm hoping you go on the following journey. I give you an idea and explain how it works. You get inspired and think of a way you could slightly tweak the idea to suit your local market based on what they tell you they need. Lastly, I give you access to a free community for inspiration &amp; support during any hard times. Because it is hard. If you're not willing to stick it out or you're someone who will put things off then put them off again, this course will only frustrate you. I can give you the push-off but you're the one pedalling....</p>\n\n\n\n<p><strong>---</strong></p>\n\n\n\n<p>If you do decide to sign up to this course, I send a genuine thank you. Really, thanks. I hope my hard work pays dividends in your life giving you more peace, less stress and more freedom.</p>\n\n\n\n<p>By signing up, you'll gain lifetime access to these lectures, lecture updates, new money-making ideas &amp; a supportive group of students.</p>\n\n\n\n<p><strong><em>---</em></strong></p>\n\n\n\n<p><strong><em>We have two types of lectures within this course.</em></strong></p>\n\n\n\n<p><strong>+ The Standard lectures</strong> (majority) outline:</p>\n\n\n\n<ul><li>the idea</li><li>how it works</li><li>steps to getting started</li><li>how to assess the idea across four important criteria</li></ul>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>+ The Detailed lectures</strong> outline:</p>\n\n\n\n<ul><li>the idea</li><li>how it works</li><li>how you would make money with the idea</li><li>estimated profit potential</li><li>estimated costs</li><li>estimated time costs</li><li>estimated competition</li><li>four ways to use this idea</li><li>three key tips for making this idea succeed</li><li>five step action steps</li></ul>\n\n\n\n<p>These standard lectures also include the best articles on each idea and low-cost/free software to help you get started.</p>\n\n\n\n<p><strong>---</strong></p>\n\n\n\n<p>Recent student reviews from my other courses:</p>\n\n\n\n<p><em>\"Addresses my business needs by providing a detailed, structured system for ensuring my staff can work efficiently.\"</em></p>\n\n\n\n<p><em>\"Covers the topic well and spurred me on to change some things around to try and get better results in my company.\"</em></p>\n\n\n\n<p><em>\"It is a very good vehicle to support charities, in a way one never expected--ability give at a very high level. I loved it and definitely plan to work the plan! Thanks very much.\"</em></p>\n\n\n\n<p><em>\"This course was a definite plus in my efforts to create multiple streams of passive income! It was clear, concise, and filled with great information. I highly recommend this course to anyone who are looking to get started online!\"</em></p>\n\n\n\n<p><em>\"Thanks that was a brilliant short course, really easy and helpful instructions, perfect for busy people! :)\"</em></p>\n\n\n\n<p><em>\"Wanted to learn email marketing, and I was recommended this course. It takes some time to practice the things which they told in this video, thank you for your video tutorials. :)\"</em></p>\n\n\n\n<p><em>\"This course makes it easy to know how to get going with a bookshop website. I like the step by step process the most.\"</em></p>\n\n\n\n<p><em>\"Big thumbs to you... thanks for the lecture\"</em></p>\n\n\n\n<p><strong>---</strong></p>\n\n\n\n<p><em></em>Try the course out for 30 days (Udemy has an excellent 30 day, 100% money back guarantee) and let me know in the course discussion section what you're working on. I'll be happy to help you as much as I can.</p>", 
    "end_date": null, 
    "title": "40+ Proven Business Ideas & Access To 1,500 Startup Ideas", 
    "price": "20.00", 
    "instructors": "Rich Peterson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525760_d941_13.jpg", 
    "course_url": "https://www.udemy.com/100-plus-great-ideas-to-make-extra-money-and-build-passive-income/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T06:32:54Z"
}