{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Lack of ideas won't be anymore your problem if you think about living your 9 to 5 job &amp; earning 3000+ dollars a month!</p>  <p>  \t         If you search for a course that will unlock your entrepreneur potential, by life example show you the basics of running business and inspire to start your own company this course is exactly for you. Just look what people say about it:  </p>  <p>  \t<em>\"I was always thinking of burn the bridges and start my own thing. </em><em>Always hesitated to do so because I wasn't sure where to start. This course therefore gave me an important support on how to develop my ideas further in a meaningful and business-like way\"</em><strong> </strong><strong><em>Christoph von Euw</em></strong>  </p>  <p>  \t            I especially dedicate it to people who want to change their lives and free themselves from 9 to 5 jobs as well as those, who are just starting their professional career and search for inspirations.  </p>  <p>  \t            I have entrepreneurship in my blood and it's there for generations. My grandfather was running a seed shop in communist Poland in times, when almost none private commercial activity was possible. My father continued his path and now he runs hotels &amp; bars. For me entrepreneurship is a way to fulfill my passion  - teaching people. I highly encourage you to check, what it can be for you!  </p>  <p>  \t<strong>In \"6 ideas for low cost business\"</strong> I have prepared for you 3 main parts:  </p>  <p>  \t<strong>1. \"Introduction part\"</strong> - where you can learn about me as a trainer and about the course structure. This is useful to catch the flow of remaining part.  </p>  <p>  \t<strong>2. \"How to generate ideas?\"</strong> part where I show useful techniques and habits, that you should apply in your life to have plenty of business ideas of your own.  </p>  <p>  \t<strong>3. \"Business ideas\" part </strong>where I present 6 totally different business ideas, show what consumer need they answer, how you can develop them and last but not least how you can earn decent money on them without investing huge amount of money.  </p>  <p>  \t            Beside of standard videos describing business concept in this course you can also find spreadsheets with basic financials regarding each idea. Most of general costs and sources of income is mentioned there.  </p>  <p>  \t            If you start an idea from this course you can count on my support in the beginning stage. My office hours will be soon disclosed in notification.  </p>  <p>  \t          Kind regards,  </p>  <p>  \t          Michał Towalski  </p>", 
    "end_date": null, 
    "title": "6 easy ideas for 3000 USD+ a month startup", 
    "price": "20.00", 
    "instructors": "Michał Towalski", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386050_fcaa_4.jpg", 
    "course_url": "https://www.udemy.com/6-ideas-for-low-cost-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T21:26:14Z"
}