{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you ever wanted to change the world and design your own career path? Social entrepreneurship harnesses the power and potential of business, startups and entrepreneurship with the mission and soul of social impact.</p><p>But, what is and isn’t social entrepreneurship? What are examples? And how can you create social impact through your career, startup, and purchasing decisions</p><p>These are just a few of the questions we answer in this introductory course, “8 Things Everyone Should Know About Social Entrepreneurship”.  Join Neetal Parekh, Founder and CEO of Innov8social and Author of “51 Questions on Social Entrepreneurship” as she shares her story in the space and what she has learned through her years of blogging, researching, interviewing thought leaders, and being part of multiple social impact-driven Silicon Valley startup companies.</p><p>By the end of the class you will be able to:</p><ul><li>Articulate what social entrepreneurship is and isn’t</li><li>Speak to some of the urgent global problems that make social entrepreneurship matter </li><li>Take steps within your career and role to engage in social impact</li><li>Speak to unique business models and legal structures for social enterprise startups</li><li>Find and apply to social innovation fellowship programs related to your interest in the space</li><li>See that social entrepreneurship is emerging and evolving differently around the globe</li><li>Learn about dynamic resources to further and deepen your engagement in the social impact space.</li><li>Get in the know, so you can #goanddo!</li></ul>", 
    "end_date": null, 
    "title": "8 Things Everyone Should Know About Social Entrepreneurship", 
    "price": "35.00", 
    "instructors": "Neetal Parekh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672550_db0d_6.jpg", 
    "course_url": "https://www.udemy.com/8-things-everyone-should-know-about-social-entrepreneurship/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-17T19:26:38Z"
}