{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>**Course Last Updated : Janyuary 2016</strong></p>  <p>  \t<strong>**Join Over 500+ Students in the New Year and Learn How Easy it is to Hire a VA**</strong>  </p>  <p>**<strong>Receive a Valuable Script To Boost VA Job Responses**</strong></p><p><strong>**Learn Where I Find **SUPERSTAR** Virtual Assistants that cost less than $5/hr**</strong></p>  <p>  \t              Is your full time job <strong>stopping you </strong>from spending too much time on your <strong>growing business?</strong>  </p>  <p>  \t                  Ever wondered how you can <strong>hire someone </strong>to do small tasks for you <strong>without over paying !!</strong>  </p>  <p>  \t<strong>Join over 500+ entrepreneurs and DISCOVER how I outsource tedious tasks to professionals that can do it in a few hours, while you sleep at night !</strong>  </p>  <p>  \t                  You'll learn everything you need to <strong>take action</strong> and actually have a person <strong>work for you within 1 week</strong> of finishing this course!!  </p>  <p>  \t                  Part 1 : The Benefits of Having a Virtual Assistant  </p>  <p>  \t                  Here I'll discuss what a virtual assistant is . What they can do for you and the <strong>benefits of having one</strong>.  </p>  <p>  \t                  Part 2: Where and How to hire a Rockstar Virtual Assistant  </p>  <p>  \t                  This section we'll talk about o'desk and elance and why these places are average, I'll discuss why I was hesitant about these sites. I'll talk about my secret resource of where I find <strong>Rockstar Assistants </strong>at the most <strong>lowest cost!!</strong>  </p>  <p>  \t                  Part 3: The Job Description - Using a Pre-made Template that gets Results  </p>  <p>  \t                  Here I'll give you access to my <strong>pre-made template</strong> for <strong>hiring Rockstars</strong>. I'll discuss the benefits of using my template and how to edit it to suite your needs!  </p>  <p>  \t                  Part 4: So many applicants but how do I choose a Rockstar?  </p>  <p>  \t                  So you had a <strong>90% success rate</strong>, but who do you choose? I'll talk about how I filter the best ones by having them do a small test before you've hired them !  </p>  <p>  \t                  Part 5: Setting Tasks For your Rockstar Virtual Assistant  </p>  <p>  \t                  Here I'll dive deep on how to manage your rockstar assistant and how to keep them happy so they stick around. How certain software helps and what to do if they don't understand you.  </p>  <p>  \t<strong>Enrol Now !! Job Template Script Valued at over $1000 !! </strong>  </p>  <p>  \t                  Part 6: Paying your Rockstar Virtual Assistant  </p>  <p>  \t                  I'll talk about why it is important to pay and<strong> pay on time </strong>as you have promised.  </p>  <p>  \t                  Part 7: Upscaling your team and why you should do it  </p>  <p>  \t                  Why you need to upscale and when to do it!  </p>  <p>  \t                  This is the basic outline of my course, there is a <strong>tonne of value</strong> that I will show you ! Most of the Udemy courses don't provide valuable assets such as <strong>scripts, actual examples and much much more !</strong>  </p>  <p>  \t<strong>Join over 500+ People and Discover the Ease of Outsourcing!!! This course has a limited time introductory price. </strong>  </p>  <p><strong>What are you waiting for Be One Of These 500+ People That Get Things Done!!!  \t</strong></p>", 
    "end_date": null, 
    "title": "A Beginners Guide to Hiring an Effective Virtual Assistant", 
    "price": "20.00", 
    "instructors": "Marco Baatjes", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369364_561f_3.jpg", 
    "course_url": "https://www.udemy.com/outsourcing-an-over-producing-high-quality-virtual-assistant/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-13T12:49:41Z"
}