{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>What makes this course unique and invaluable?</p>  <p>The answer is its unique perspective on entrepreneurship.</p>  <p>Many hundreds of excellent Udemy courses examine how entrepreneurs <em>act </em>– the nitty-gritty of how they write business plans, attract investors and sell their ideas.</p>  <p>But this course navigates deeper waters.</p>  <p>This course is based on the fundamental principle that THOUGHT PRECEDES ACTION.</p>  <p>FIRST YOU MUST THINK … AND ONLY THEN CAN YOU ACT WISELY.</p>  <p>So, this course explores <em>entrepreneurial ways of thinking</em>.  </p>  <p><em>Thinking is where it starts</em>.  First you have to ‘get your head together’, then you can act with effective results.</p>  <p>This course sharpens your MIND in preparation for action.  It is based on my 35 years of research into the thinking patterns of entrepreneurs.</p>  <p>It is delivered in simple and clearly-pronounced English without jargon or ‘filler’.</p>  <p>First, every key word we use is precisely defined.  That way we are certain we are ‘on the same page’ - that we perfectly understand each other.</p>  <p>Then, we identify whether there is anything unique in the heredity, environment or skills-sets of entrepreneurs which makes them special people as compared to ‘average’ human beings.  </p>  <p>Third, we identify, dissect and destroy the five major fears that discourage people from venturing into entrepreneurship.</p>  <p>And only then are we finally ready for the concluding message of awakening that this course delivers:  specific details on how to seize control of your thinking – how to discipline your mind – to think like an entrepreneur thinks.  Because once you THINK like an entrepreneur, you will be empowered to ACT like an entrepreneur.</p>  <p>Included with this course at no extra charge is my book which serves as its foundation.  The book is available as a downloadable .pdf, and as a streaming audiobook for students who are dyslexic or experience other challenges reading the printed word.</p>  <p>Students who seriously study this unique course will emerge with new power over their minds, a new discipline over their patterns of thinking, and a vivid understanding of the topics of thought on which they must focus to succeed as entrepreneurs.</p>", 
    "end_date": null, 
    "title": "A Mind for Business:  Chapter 1:  The Entrepreneur", 
    "price": "25.00", 
    "instructors": "Dr. George M Alexander", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692896_7cd3_4.jpg", 
    "course_url": "https://www.udemy.com/a-mind-for-business-the-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T11:38:16Z"
}