{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>We collect business tools from all over the world</strong></p><p>… SO THAT YOU CAN <strong>FAST-FORWARD YOUR BUSINESS TO SUCCESS</strong></p><p>Our latest online course “Female-Financially-Free-Finally™” is designed for the woman who has left her job for entrepreneurship.</p><p><strong>FAST FORWARD YOUR BUSINESS TO SUCCESS BY LEARNING FROM TWO AWARD WINNING ENTREPRENEURS</strong></p><li>\tConsulted to <em>many</em> amazing business women from all over the world</li><li>\tListen and understand the REAL challenges that female entrepreneurs face today</li><li>\tShare <em>many</em> success stories as a result of our business strategies &amp; tools</li> <br><strong>If you tick one or more of these, this course will fast-forward you to success!</strong><li>Struggling to pay your bills at the end of each month ✔</li><li>\tWorking longer hours with zero results ✔</li><li>\tConstantly dealing with demanding clients ✔</li><li>\tCannot stand the idea of selling to people ✔</li><li>\tRunning out of creative ideas or inspiration ✔</li><li>\tSick of courses and books that repeat the same advice ✔</li><li>\tHaving to do all the work by yourself ✔</li><li>\tHaven’t taken a holiday since the business started ✔</li><li>\tNo work-life balance ✔</li><span></span><br><span></span><p>SOUND FAMILIAR?<br></p><p>Then it’s time to fast-forward your business to success like so many female entrepreneurs all over the world!<br></p><p>OUR TAILOR-MADE COURSE FOR WOMEN WHO HAVE THEIR OWN BUSINESS WILL ENABLE YOU TO:</p><li>\t<strong>Apply proven and practical strategies that will assist you in making more money</strong> with your business this year. <em><em>We’ve grown some of our businesses with over 300% in less than 4 years</em></em></li><em></em><br><li>\t<strong>Attract more quality people</strong>, clients and partners into your business. <em>We’ve trained Mom’s, Gold Medalists, Travellers, Millionaires – you name it</em></li><em></em><br><li>\t<strong>Make more informed choices about work-life balance and lifestyle entrepreneurship</strong>, i.e. work on your own terms. <em>We’ve traveled to over 26 countries this year alone - find out how</em></li> <p><br></p>\n<p>We are very proud to be associated with thousands of successful women all over the world. We see women go from HOPELESS TO SUCCESS all the time.</p><p>You can be one of them!</p><p><strong>WE PROMISE YOU LOADS OF VALUE IN EACH LECTURE. YOU ALSO GET:</strong></p><li>\t<strong>A Full 30 day Money-Back Guarantee</strong>, no questions asked . <em>Although we are confident that you will get tons of REAL value</em></li><em></em><br><li>\t<strong>An activity book filled with quality questions. </strong><em>You may be stuck because you’ve never learned how to ask great questions</em></li><em></em><br><li>\t <strong>Direct access to Landi Jac on the Udemy discussion forum.<em> </em></strong><em>No expensive consulting fees required, just post your question on Udemy</em></li><em></em><br><li>\t<strong>A Bonus webinar with our formula to work where and when you want. </strong><em>Which may be on your couch at home or in Dracula’s Castle – you choose :D </em></li><em></em><p><br></p><p>Fast-forward your business to success and become a financially free female.</p><p>FINALLY.</p><p>Enroll now.</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "A Woman's Guide To Learning New Business Strategies", 
    "price": "50.00", 
    "instructors": "Landi Jac, Mike Handcock", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641958_39db_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-be-a-financially-free-female-by-40-finally/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T01:24:23Z"
}