{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are you unhappy with your job? Have you ever dreamed of becoming your own Boss? </strong></p><p>Do you come home every day wishing there was more to life than just working a 9-5 job?</p><p>In this course I walk you through the mindset changes you will need to make to become an entrepreneur. </p><p>I then show you what you can do outside of your job to start living like an entrepreneur.  </p><p><strong>How I structured this course</strong></p><ul><li>First I walk you through my own personal story for becoming an entrepreneur</li><li>Next you are shown how to stop thinking like most people who work normal 9-5 jobs</li><li>I provide several ideas on how you can start building a business outside of your 9-5 job such as blogging, affiliate marketing, teaching with courses, podcasting, freelancing and more. </li><li>I share with you my productivity tools and how I use them daily</li><li>I go in-depth into why you need to make sacrifices and have self discipline to succeed with entrepreneurship</li><li>Finally I provide several recommendations for books that will get you motivated to do more with your life and stop living like most people do.</li></ul><p><strong>Why you should take this course</strong></p><p>If you have been unhappy with your life, your job, or even your financial situation this is the course for you.</p><p>You will learn a lot about the mindset changes you need to make in order to see positive change in your lifestyle with this course. </p>", 
    "end_date": null, 
    "title": "Abandon The 9-5 Mindset: Become An Entrepreneur", 
    "price": "20.00", 
    "instructors": "John Shea", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608598_bf4e_3.jpg", 
    "course_url": "https://www.udemy.com/abandon-the-9-5-mindset-become-an-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T00:24:48Z"
}