{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In one hour, you can have a clear strategy for taking an idea, validating its potential and bringing it to life in an effective manner.<br></p>\n\n<p>In my opinion, there is no need for endless acquisition of new knowledge. Focus in both your actions and acquisition of knowledge is key!! So get the basics and start going. you will get the rest \"on the fly\".<br></p>\n\n<p>With a clear understanding of what needs to be done and when, you will be able to put all those distracting \"what to do next?\" thoughts aside and focus, step by step on building a great startup. <br></p>\n\n\n\n<p><strong>Building a strong framework for bringing your ideas to life</strong><br></p>\n\n\n\n\n\n<ul><li>Stay focused and clear-headed despite uncertainty.</li><li>Avoid the classic trap of building something nobody wants.</li><li>learn methods to create financial and time-line projections while containing the possibility of major changes in the plan.</li><li>Learn to identify possible time points for raising funds.</li><li>A repeatable approach for your current venture or any future one.</li></ul>\n\n\n\n\n\n<p><u><br></u></p>\n\n\n\n\n\n<p><strong>Gain a powerful skill for being a practical dreamer - bring your voice to the world without loosing touch</strong></p>\n\n\n\n\n\n<p>This course is for anyone who wants to create something that other people will use.<br></p>\n\n\n\n\n\n<p>It presents a step by step, 7 phase process for taking a product or service idea, establishing it's potential and making progress towards a viable and scalable business.</p>\n\n\n\n\n\n<p>The key is minimizing the risk from two major threats to innovation - lack of focus and building something nobody wants.</p>\n\n\n\n\n\n<p>Working together with customers to understand their perspective, launching your first version, learning and developing in small cycles to keep your efforts as effective as possible while giving your customers the most precise version of what they need.</p>\n\n\n\n\n\n<p>it is a work method that balances the need for a clear plan with the un-certainty that is an integral part of entrepreneurship.</p>\n\n\n\n\n\n<p>But most importantly, understanding that the main challenge is not any specific idea but rather becoming a person that can get things done, this roadmap serves as a framework for becoming a professional entrepreneur.</p>\n\n\n\n\n\n<p><strong>What to expect?</strong></p>\n\n\n\n\n\n<p>Adopting a \"less is more\", practical approach, this course starts at 60 min and will be elaborated only if needed.</p>\n\n\n\n\n\n<p>I believe that overwhelming you with knowledge can be distractive and cause you to loose focus.</p>\n\n\n\n\n\n<p>Too little knowledge and \"just doing it\" may cause you to doubt every step you take and learn very little from your experience.</p>\n\n\n\n\n\n<p>This course is designed to be as close as possible to a \"to do\" checklist for entrepreneurs, to give you just enough knowledge for moving forward while becoming a professional entrepreneur.</p>", 
    "end_date": null, 
    "title": "ABCD roadmap for entrepreneurs", 
    "price": 0, 
    "instructors": "Amit Barzilai", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617244_a8bb_4.jpg", 
    "course_url": "https://www.udemy.com/abcd-roadmap-for-entrepreneurs/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T14:06:05Z"
}