{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Big Update:</strong> <em><strong>Thanks to everyone for joining in the course launch. In the first month alone, over 630 students enrolled, and laid down nine 5-star reviews!</strong></em></p><p>Sign up now during our October-only-sale - only $49 for 2 hours of content that will increase your Airbnb profits, and decrease your weekly time commitment.<em><strong><strong><em></em></strong></strong></em></p><p> ————————————————————</p><p><strong>Recent reviews</strong><em><strong>:</strong></em> </p><p>\"A very detailed, thorough and quality guide for anyone looking into the field of Airbnb.\"</p><p>-Ian M.</p><p>“More than I expected: very smart and useful, not only on the management of Airbnb program, but also on many aspects on marketing and advanced management! I really appreciate it!\"</p><p>-Chia-Yun H </p><p>“I'm impressed by this course and the techniques I have learned in a few hours. It has amazing value. I'm long term user of Airbnb and with the help of Jeff I'm sure that I will start earning good money. Thank you and recommended.\"</p><p>-Bojan Savic </p><p>“This is an amazing course. Every section is well explained step by step and wonderful for beginners. I recommend everyone to take this course.\"</p><p>-Zrelli M.</p><p>“The lessons in this course go way beyond pure information. Jeff (the instructor) knows his stuff inside out, and more significantly, he knows how to pass his knowledge clearly so that I can take action on it right away.\"</p><p>- Michael C.</p><p>--------------------------------------------------------------</p><p><strong>What's Covered:</strong></p><p>First I'll show you my Airbnb earnings, that I made in just a few hours a week, to give you an idea of what is possible.</p><p>Then you'll learn several clever techniques that open the door to airbnb data specific to your market, that will help you optimize your listing, and outperform your competition. These methods will allow you to attract more guests, or charge higher prices; resulting in more booking, and more profit.</p><p>Then you'll hear about 3 critical messages to send your guests, and the importance of exactly when to send them; that will result in raving reviews, which will also bring you more bookings.</p><p>Then you'll learn how to use an array of powerful efficiency and automation tools and concepts will have you savings 10s of hours per week, which means more profit in less time – in other words, a significant hourly pay raise for you!</p><p><strong>Course Style:</strong> </p><p>The course consists almost entirely of screen casts and animated power points with engaging audio walk-throughs. I cut out all the fluff, and all the beginner-level tutorials you can find elsewhere. The  lectures are clear and to the point – just like I want to save time in my own business, I also want to save your time, and give you the highest impact, practical, insightful content, in the shortest amount of time.</p><p><strong>Time Commitment, and Practicality of Content:</strong></p><p>You can complete this course in just a few hours, and immediately apply your learning, to boost your bookings, and reduce your work load. </p><p><strong>Additional Materials:</strong></p><p><strong><strong></strong></strong>In addition to the core lectures, I've also supplied plug-and-play templates that you can use to optimize your Airbnb operations.<strong></strong></p><p><strong>My Guarantee:</strong></p><p>I'm so confident that you're going to love this course and find a tremendous amount of value in it, that I guarantee that if you're not 100% satisfied, that I'll give you a full refund within 30 days of your purchase. </p><p><strong>The Next Step:</strong></p><p>Start making more money in less time by, and sign up for this course now. If you use even one concept from within, you will have paid for the course many times over. In fact, Every day you don't take this course, you are losing time and money!</p>", 
    "end_date": null, 
    "title": "Airbnb Ninja: Advanced Methods for the Part Time Airbnb Host", 
    "price": "45.00", 
    "instructors": "Jeff C", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/522412_43a6_8.jpg", 
    "course_url": "https://www.udemy.com/airbnb-ninja-advanced-methods-for-the-part-time-airbnb-host/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-07T09:09:44Z"
}