{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>COURSE UPDATED: June 2016</strong> - Learn the <strong>newest </strong><strong>secrets </strong>to importing Alibaba products now!  <em><strong>100% Satisfaction Guaranteed or Full Refund</strong></em></p>\n\n<p>Join the <strong>original and best-selling Alibaba course</strong>. </p>\n\n\n\n\n\n\n\n<p>  \t    Alibaba is the biggest online global trade marketplace, and is a goldmine for making money importing products factory direct and reselling. This course will teach you how to safely and effectively import products from overseas using Alibaba so <strong>YOU </strong>can make 80/90/100% margins on hot-selling products. The content is designed for <em>a beginner with no experience</em> in <strong>product manufacturing</strong> or <strong>importation</strong>. I will lay out and explain both the basics and advanced tactics in excruciating detail. This course will teach you how to buy products factory direct so that you can make the most money.  </p>\n\n\n\n\n\n\n\n<p>  \t        If you are an entrepreneur with a new product idea, or an existing product that you want to save money on manufacturing overseas, then this is the course for you. The world of importation is vast and unforgiving, do not dive in alone! There is <strong>TONS of money to be made </strong>importing products cheaply from overseas then reselling online or in your store. For a beginner, the process can be daunting and overwhelming. Don't go it alone!  </p>\n\n\n\n\n\n\n\n<p>  \t        My explanation style is <strong>swift </strong>but <strong>detailed. </strong>I will lay out every single minor point that you need to know to take your product from conception to actualization, or from single prototype to a large order arriving at your door.  </p>\n\n\n\n\n\n\n\n<p>  \t        You will learn about<strong> </strong>necessary cultural differences. You will receive <strong>effective email templates</strong> for negotiating politely about quality and price, and learn their ways of doing business to ensure successful transactions. I will teach you how to find the<em> highest quality products</em> at the<em> best prices</em>.  </p>\n\n\n\n\n\n\n\n<p>  \t        You will learn the red flags to spot for picking reputable and reliable manufacturers, and how to negotiate samples to ensure quality before ordering large amounts. You will become an expert at spotting quality just by looking at their Alibaba listing using a precise checklist.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>Overall, you will have a complete understanding of the entire Alibaba importation process</strong> from factory search and selection, to negotiations, to OEM packaging if needed, to finally freight and shipping. And along the way, you will get let in on the <strong>secret tips and tricks</strong> for maximizing success.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>  Don't stall any longer! Enroll today and start your future as a global trade expert.  </strong>  </p>", 
    "end_date": null, 
    "title": "Alibaba - How To Make Huge Margins Importing Products", 
    "price": "25.00", 
    "instructors": "Larry VanDenHandel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365516_6c7e.jpg", 
    "course_url": "https://www.udemy.com/import-from-alibaba/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T03:03:38Z"
}