{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Last course update: May 2016</strong> | <em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">100% Satisfaction Guaranteed or your money back </strong></em></p>\n\n<p>It's time for something better. It's time for a course that refuses to rely on boring screen casts for every single lesson. Let's add some spice. </p>\n\n\n\n<p>I have added the spark of engaging animated videos that bring my information to life. <strong class=\"redactor-inline-converted\">Join my course today for the most direct path to financial success.</strong> I can help you make millions. You just have to take the first step and enroll. </p>\n\n\n\n<p><em class=\"redactor-inline-converted\">This course is not like the others. It actually gives you specific examples and a behind-the-scenes view of how to be successful on Alibaba. If I can do it, so can you.</em></p>\n\n\n\n\n\n\n\n<p>My name is Colton Shuell and I have been selling on Amazon and Ebay for 18 years. <strong class=\"redactor-inline-converted\">Not to brag, but I make millions in profit every year.</strong> It didn't happen overnight, I had to work very hard over the years refining my products and modernizing with all the changes that have occurred on these eCommerce platforms. I love selling products online because it allows me to live a carefree life.  </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">To tell you the truth, life wasn't always this easy for me. After college, my wife and I were living paycheck to paycheck on a pull-out couch in a small studio apartment. Talk about stress! I knew it was time for a change, so I started selling products online.</strong></p>\n\n\n\n\n\n\n\n<p>Over the years, I have learned <strong class=\"redactor-inline-converted\">exactly </strong>what it takes to be successful and have mentored hundreds of ambitious entrepreneurs like yourselves. I created this course because I know it is possible and I want to help others reach their financial goals in life. </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I want to give you all the recipe behind my success. It all comes down to Alibaba. </strong></p>\n\n\n\n\n\n\n\n<p>Did you know Alibaba is the fastest growing GOLDMINE for importing products and making you tons of money? It has been the go-to site for millions of online entrepreneurs interested in selling products on sites like Amazon and Ebay. </p>\n\n\n\n<p>If you sign up for my course, I will teach you everything you need to know. I will also personally respond to any questions you may have and be your online guide through this process. I've been there, I know what to do, let me help you succeed.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">How my course works:</strong></p>\n\n\n\n<ul><li>I don't waste your time with unnecessary details</li><li>I am direct and concise</li><li>I won't bore you with horrible screen casts for every single lesson</li><li>I will be there to help you along the way</li><li>I will refund you your money if you find absolutely no value in my course</li></ul><p><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What you will learn in the course:</strong></p>\n\n\n\n\n\n\n\n<ul><li>How to find a PROFITABLE product to sell</li><li>How to find the BEST Alibaba suppliers</li><li>How to negotiate for the lowest price</li><li>What forms you need to get your products across the border</li><li>3 specific examples of products that could make you money TODAY</li><li>The best methods of shipping your product to your country</li><li>How to outsource for a logo</li><li>The importance of private labeling</li><li>and SO MUCH MORE... (I can't tell you everything here!)</li></ul>\n\n\n\n\n\n\n\n\n\n<p>[[[Note: I will also be teaching you about some of the most RECENT scams on Alibaba and how to spot them before you send a bad supplier your hard-earned money. There are many indications that a supplier is no good; I want to explain these to you in detail. But don't worry, it doesn't happen very often... I just want to prepare you for everything you may run across.]]]</p>\n\n<p><strong>I will prepare you to navigate the exciting world of importation. </strong><br></p>\n\n<p><strong><em class=\"redactor-inline-converted\">I will prepare you for success. </em></strong></p>\n\n<p><strong>Are you ready to make a ton?</strong></p>\n\n<p><strong><em>Enroll now. </em></strong></p>", 
    "end_date": null, 
    "title": "Alibaba - Your Gateway to Importing & Making Huge Profits", 
    "price": 0, 
    "instructors": "Colton Shuell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/844128_422b_3.jpg", 
    "course_url": "https://www.udemy.com/make-millions-using-alibaba/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-09T19:14:50Z"
}