{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Let’s face it – at some point in time, you have pondered on having your own business and becoming your own boss. That business most likely is selling goods, and with companies like eBay, Amazon, and Shopify offering ways and services on how to easily sell stuff online, you won’t even need a physical store to sell goods. You can do business right from the comfort of your own home, at the click of a mouse and a few keystrokes.</p><p><br>Sounds really nice, right?</p><p><br>The problem is, you don’t know where you can get a supply of the stuff that you’re going to sell. Or if you do, most likely the supplier’s prices isn’t low enough that you can make a good profit from it once you sell it. So why go ahead and be an online entrepreneur when you won’t be able to get big profits from sales? That is if you even manage to get a steady supply of goods to sell to begin with?</p><p><br>Then there’s Alibaba. I guess you’ve heard about this site already.<br>If not, then let me tell you – there is a lot of stuff being sold at incredibly low prices at Alibaba, and there are a lot of sellers to choose from. Now you have a solution to your earlier dilemmas. With Alibaba, it’s possible to have a steady stream of goods at low prices.</p><p><br>Before you get all excited and go to Alibaba’s website, let me tell you that most of the products from Alibaba are from China, and most of the sellers are Asians.<br>I guess the question in your mind now is – where do you start with Alibaba?<br>How does one deal with Asian suppliers? How about the language barrier?<br>Sounds like there’s a lot of hard work to be done and you’re not even sure if you’ll be successful in the end. If only there’s a way or something to guide you on successfully using Alibaba and dealing with Asian suppliers.</p><p><br>Luckily for you, the answer is YES.</p><p>The Alibaba Profit System</p>", 
    "end_date": null, 
    "title": "Alibaba Profit System: Alibaba Success Guide", 
    "price": "20.00", 
    "instructors": "Nick Stanson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/850328_a1ac.jpg", 
    "course_url": "https://www.udemy.com/alibaba-profit-system-alibaba-success-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T04:16:50Z"
}