{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn How You Can Private Label Products And Build A Successful E-Commerce Business!</p><p>Let me asking you something... how long have you wanted to be your own boss? Can you just...</p>  <ul>  <li><strong>Imagine</strong> the freedom and      excitement of waking up every day, and discover that you made money... in      your sleep!<br>       </li>  <li><strong>Imagine</strong> going to lunch      with your friends (who still work their day jobs) and casually telling      them about your success, and inspiring them to go for their own dreams!<br>       </li>  <li><strong>Imagine</strong> the respect and      admiration you'll gain from your peers when you tell them that <strong>you      don't</strong><strong> </strong><strong><em><u>bother</u></em></strong><strong> </strong><strong>with      having a boss anymore</strong>(while they are still complaining about theirs)!</li> </ul>  <p><br></p><p>Not only is this possible with Importing Products... but people just like you are truly striking it rich sourcing products from the Alibaba wholesale platform and reselling online. <strong></strong></p>  <p>Alibaba is the biggest online global trade marketplace, and is a goldmine for making money importing products factory direct and reselling. This course will teach you how to safely and effectively import products from overseas using the Alibaba wholesale platform. Whether you want to import private label cosmetics or sporting goods, you can order them directly from Alibaba. We'll also go through the process of how Alibaba reviews it's manufacturers to maintain quality control. We will also go through the Alibaba express wholesale area of the platform. The content is designed for <em>a beginner and those with some experience</em>. I will explain both the basics and advanced tactics in detail. This course will teach you how to buy products factory direct so that you can make the most money.</p>  <p>If you're an Entrepreneur with a new product idea or have an existing product that you want to reduce manufacturing costs, then this is the course for you. The world of importing is enormous and unforgiving, do not dive in alone! There is <strong>TONS of money to be made</strong><strong> </strong>importing products from China then reselling online or in your store. For a beginner, the process can be daunting and overwhelming. Don't go it alone!</p>  <p>You will learn about the cultural differences and receive<strong> effective email templates</strong> for negotiating quality and price, and learn their ways of doing business to ensure successful transactions. I will teach you how to find the<em> </em><em>highest quality products</em> at the<em> </em><em>best prices</em>.</p>  <p>You will learn the red flags to spot for picking reputable and reliable manufacturers, and how to negotiate samples to ensure quality before ordering large amounts. You will become an expert at spotting quality just by looking at their Alibaba listing using a precise checklist.</p>  <p><strong>Overall, you will have a complete understanding of the entire Alibaba import process </strong>from searching for manufacturers and selection, to negotiations, to Private Label and OEM packaging if needed, to finally freight and shipping. And along the way, you will get let in on the <strong>secret tips and tricks</strong> for maximizing success.</p>", 
    "end_date": null, 
    "title": "Alibaba Import Business Blueprint: Build Your Import Empire", 
    "price": "20.00", 
    "instructors": "Juan Galvan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654998_293e_2.jpg", 
    "course_url": "https://www.udemy.com/alibaba-import-business-blueprint-build-your-import-empire/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T21:59:15Z"
}