{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Whether you are looking to import products to re-sell, outsource production or save money by improving you importing practices you are in the right place.<br></p><p><em>No matter what your motivation may be I guarantee you'll find value in this course. </em></p><p>The skills you will learn in <em>Alibaba – Import secrets to making huge margins </em>are applicable to more than just Alibaba, and can help you <strong>improve product designs</strong>, <strong>enhance your product selection process</strong> as well as <strong>lower your shipping costs</strong>.</p><p>How does this work?</p><p>You'll be given <em>immediate</em> access to all the lectures and content for this course. Mostly composed of video lectures, that were designed to be <strong><em>engaging</em></strong> and <strong><em>fast paced</em></strong>. Nothing is worse than poor quality, hard to understand audio, with mind numbing, boring slides that drag on and on. This course was design to be <strong><em>painless</em></strong>, something you'll <strong><em>enjoy</em></strong>, and something you'll actually <strong><em>finish</em></strong>.</p><p>The course is split into 5 main chapters that will walk you through the process in easy-to-follow steps. </p><p>Starting with the basics, I'll show you exactly how to <strong>navigate Alibaba</strong>, <strong>use their services</strong>, <strong>understand certifications</strong>, and <strong>verify supplier credibility</strong>.</p>Once you are fluent in site navigation and terminology as well as confident in your ability to access a supplier, I'll show you how to:<ul><li><strong>Negotiate terms</strong></li><li><strong>Send payments</strong></li><li><strong>I</strong><strong>nsure your investment</strong></li><li><strong>Organize shipping</strong> </li><li><em><strong>Along side tips and tricks from over 8 years experience.</strong></em></li></ul><p>As a <strong><em>bonus,</em></strong> I will teach you how to find <strong>trending and profitable products</strong> to re-sell while explaining the common types of <strong>manufacturing equipment</strong>, and <strong>their requirements to start productions</strong>. On top of it all I will be giving <strong><em>responsive feedback and answering questions throughout the course.</em></strong></p><p>Are you ready to transform your life and become a confident importer? Empower yourself with the ability and knowledge to create a sustainable business? Being your exciting new adventure today!</p>", 
    "end_date": null, 
    "title": "Alibaba ✈ Import Guide To Making Huge Margins!", 
    "price": "25.00", 
    "instructors": "Kurt Bihelek", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527626_7336_2.jpg", 
    "course_url": "https://www.udemy.com/alibaba-import-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T20:05:25Z"
}