{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Do you want to discover how to be a huge success selling online in 2015?  </strong>  </p>  <p>  \t          If your answer to this simple question is <strong style=\"\">YES</strong>, then don&#039;t delay and act today and register for this <strong style=\"\"><em style=\"\">unique</em> </strong>course offering, where I will be providing you with <strong style=\"\">regular</strong> <strong style=\"\">LIVE</strong> access to me <strong style=\"\">WEEKLY</strong>!  I will host <em style=\"\">at least</em> one webinar per week, but often I will host more than one session/webinar per week so that I can answer any and all of your questions.  </p><p>Starting in May 2015, I will start hosting 90 minute long webinars, due to great demand from all of you students, so I can spend more time answering all of your burning questions on Private Label Product selling, wholesaling, and much more!  </p>  <p>  \t          That is right!  I am going to host weekly webinar sessions, where I will be teaching my lectures from my main course live to you!  Also, I will open the floor to any and all questions that you may have in each session.  And beyond just the topics from my main course about selling online, I am going to keep current on all the current events in online retailing, and host lectures on anything relevant to helping you sell better online!  </p>  <p>  \tAnother great addition to this course is that I will be having guest lecturers join me in the webinar sessions as well, having other Udemy instructors and also other experts from the online retail world teach you how to sell better online!  </p>  <p>  \tThat is right, I am going to get some of the top Amazon sellers to show you how they have made millions selling on Amazon and beyond!  I will also be taking your ideas and turning them into lectures -- so it is a true interactive learning experience!  </p>  <p>There is no set schedule to my webinars, so you must check the course discussion page in order to see when each one will be held, or join my Facebook group and see when I make a posting in there.  Sometimes I will even send out an email to my full Udemy list, and/or to my email marketing list letting everyone know about the webinars!</p>  <p>Don&#039;t worry if you ever miss a session as <strong style=\"\">EVERY </strong>session will be <strong style=\"\">recorded</strong>, edited and posted to the course for all to view. (**Please note, sometimes it takes me a few days to get past webinars to post, however moving forward I have begun to use a new recording program to manage each of the webinar sessions to ensure the best quality recordings for each of you who cannot attend live!**)</p><p></p>  <p>  \t<strong style=\"\">What topics will be covered in this Webinar Series?</strong>  </p>  <ul style=\"\">  \t<li>Private-Labeling/White-Labeling Products</li><li>Dropshipping</li>  \t<li>Fulfillment by Amazon Program</li>  \t<li>Product Sourcing</li>  \t<li>Working with Wholesalers</li>  \t<li>Pricing Your Products for Success</li>  \t<li>Establishing Your Business Entity (from overseas in the United States, or within the United States already as a citizen)</li>  \t<li>Social Media and How You Can Use It To Generate Sales</li>  \t<li>Discovering New Marketplaces to Sell On Beyond Amazon and eBay (i.e. Overstock, Sears, Rakuten, Shop, BestBuy, NewEgg, 11Main, and Many More).</li>  \t<li>Email Marketing</li>  \t<li>Customer Service and Maintaining Perfect Feedback Scores</li>  \t<li>Understanding How to Win the Coveted Amazon &quot;Buy Box&quot;</li>  \t<li>Creating the Best Content for Your Product Listings</li>  \t<li>Discover How to Sell on Your Own Website</li>  \t<li>And Much Much More!</li>  </ul>  <p>  \t          As I said before, beyond just learning about the topics mentioned above, you will also have access to ME, where you&#039;ll be able to ask me <strong style=\"\">ANYTHING </strong>about selling online, helping you sell better and achieve great success!  </p>  <p>If you have any questions about this course, feel free to contact me.  I look forward to working with you!</p>", 
    "end_date": null, 
    "title": "Amazon FBA: Discover How to Sell Online via Live Webinars", 
    "price": "20.00", 
    "instructors": "Anthony Monfet", 
    "commitment": "26.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369452_f6eb_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-sell-online-via-live-webinars/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-13T08:59:38Z"
}