{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course teaches you how to setup your own Amazon Trading Business and earn $20-25k per month of passive income.</p><p>The course is structured in an easy to follow, modular step-by-step style, and the course follows a proven methodology that the instructor has used for success many times in setting up Amazon businesses, it consists of a series of 50 video lectures you can view, divided into five clear modules. There are also downloadable content on specialist topics.</p><p>The key advantage of this course is that it helps you identify and exploit profitable niches, so that you can avoid the heavy competition that new traders can encounter on Amazon. It reduces the risk for you and it makes the process so much easier, avoiding all the potential pitfalls and headaches, that many other courses do not cover and makes the learning process so much easier.</p><p>The course will teach you everything you need to know to run a successful Amazon trading business using Amazon FBA (Fulfilment By Amazon). It takes between 7-16 hours to complete, however you are encouraged to take it at your own pace.</p><p>You should be familiar with the internet and the Amazon website and have a reliable internet connection that you can use on a daily basis, except for that no prior knowledge is required. Get your Amazon knowledge to the highest level and get started earning money today!</p>", 
    "end_date": null, 
    "title": "Amazon FBA: How to Start Your Business from Scratch", 
    "price": "20.00", 
    "instructors": "Mark Ritchie", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/713212_5848_2.jpg", 
    "course_url": "https://www.udemy.com/zero-to-hero-amazon-product-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-02T12:18:39Z"
}