{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course covers the in's and out's of launching a successful AIM Hatchfund crowdfunding campaign.</p>  <p>All instruction is taught via screen share, video, and assessments. We are Hatchfund, and we want to help artists like you achieve your dreams. </p>  <p>The course takes about one day to complete from start to finish, however, we suggest going at your own pace.</p>  <p>Here are the three main objectives of the course. </p>  <p>1. Research and development </p><p>2. Building content and creating social streams </p><p>3. Managing your campaign for success. </p>  <p>Hatchfund has an unmatched success rate of 75% because we provide educational services like this as well as one-on-one support to every artist. You should consider Hatchfund when comparing your funding options. Not only will we give you access to this course when you become an approved artist, but we will also help you raise the awareness of your campaign and receive more money. We've helped artists like you raise over $8.9 million dollars.</p><p>You should take this course if you don't want to waste time trying to figure out what works. Not-for-profit crowdfunding has special perks in itself. Combining tax deductibility with Hatchfund's unique one-on-one coaching makes Hatchfund's platform the best opportunity for you and your supporters. </p>WHAT'S IN THE COURSE?<ol><li>24 lectures and assessments along the way</li><li>Learn how to leverage new crowdfunding platforms to drive traffic to your work</li><li>Learn how to craft your messaging for success</li><li>Leverage your local network</li><li>Develop a campaign that generates outside backers</li><li>Run your campaign efficiently and effectively</li></ol>", 
    "end_date": null, 
    "title": "An Introduction to Tax Deductible Crowdfunding", 
    "price": "40.00", 
    "instructors": "Dillon Nicholson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/487762_3be9_6.jpg", 
    "course_url": "https://www.udemy.com/an-introduction-to-tax-deductible-crowdfunding/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-27T18:06:46Z"
}