{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">How would you like the insider secrets to finding, pitching and obtaining an angel investment...</strong></p><p><strong style=\"\">...from a Silicon Valley venture capitalist who has actually invested in or advised 250 startups?</strong></p><p>That&#039;s exactly what you&#039;ll get inside this course...</p><p>If you have a great business (or idea for a business) and need angel funding to help fund your startup, this is the course for you.</p><p>You&#039;ll discover insider secrets to obtaining angel financing as you walk through this course and learn:</p><ul style=\"\"><li>Who are the angel investors and how much will they typically invest in a company?</li><li>What are the SIX most important criteria for angel investors?</li><li>What key traits are angel investors looking for in an entrepreneur?</li><li>What are the typical reasons you may be rejected for an angel investment?</li><li>The 8 additional benefits you can receive by working with an angel investor.</li><li>A variety of ways to find and contact angel investors</li><li>How to properly prepare for the pitch meeting with the angel investor</li><li>Questions an angel investor might ask - which questions to anticipate so you&#039;re fully prepared</li><li>Questions an angel investor might ask about marketing and customer acquisition</li><li>Common questions to anticipate about management and the founder team</li><li>10 critical mistakes to avoid when meeting with the angel investor</li><li>The 10 commandments for obtaining angel funding</li><li>The key factors in setting the valuation and the terms for financing</li><li>Questions the CEO should ask of the angel investor</li><li>The correct legal documents an angel investor will ask you for when an angel reviews your company</li><li>How to get the angel investor&#039;s attention and admiration (From interviews with 12 angel investor / venture capitalists)</li></ul><p>Bottom line, this is the perfect introduction to the world of angel investors and will give you the tools, strategies and insider knowledge you need to navigate the world of startup financing for your business.</p><p>If you&#039;ve ever seen the hit TV show, Shark Tank, you know it can be a brutal process to obtain funding from an angel investor. </p><p>But when you&#039;re equipped with the strategies inside this course, you&#039;ll be able to walk in with confidence, knowing what to expect and knowing how to easily answer the angel&#039;s questions so that you walk out with a deal and the funding you need!</p><p>And, with your enrollment today, you automatically receive our 30-day, no-questions-asked, money-back guarantee, so you have no risk in enrolling.</p><p>Imagine discovering the secrets to getting angel funding, from an actual venture capitalist who has participated in 250 deals? </p><p>This is the unprecedented, exciting opportunity you have in front of you, right now...</p><p>Enroll today and you can begin finding and pitching angel investors immediately after taking this course. </p>", 
    "end_date": null, 
    "title": "Angel Financing: Find Investors & Funding for Your Startup", 
    "price": "25.00", 
    "instructors": "All Business", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524506_74c4_3.jpg", 
    "course_url": "https://www.udemy.com/angel-financing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-09T20:20:47Z"
}