{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Pour vous faire découvrir comment définir et atteindre vos objectifs commerciaux, vous trouverez :</p>  <ul><li>en guise de définissons ce qu’est l’objectif commercial, puis vous passerez à pourquoi il est nécessaire et important de définir vos objectifs commerciaux.</li><li>puis vous aborderez la méthode relation client pour fixer vos objectifs efficacement. À cette étape, un exercice pratique vous permettra de formuler votre objectif commercial,</li><li>une fois que votre objectif est fixé, vous aborderez les conditions nécessaires pour atteindre vos objectifs commerciaux,</li><li>à quel moment les fixer vos objectifs commerciaux.</li><li>comment fixer vos objectifs commerciaux étape par étape ?</li></ul>          <p>Enfin, puisque définir l’objectif n’est pas une fin en soi, il vous reste encore trois étapes : la validation de votre objectif, l’appropriation de cet objectif et le passage à l’action.</p><p>En suivant cette formation, en une heure, vous serez capable de définir votre objectif commercial. </p><p>Cette formation vous fait gagner du temps et de l'argent. En effet, en définissant vos objectifs commerciaux, vous verrez que vous accélérerez vos ventes, tout en réduisant le cycle de vente de vos produits ou services.<br></p>", 
    "end_date": null, 
    "title": "Apprendre à définir et atteindre vos objectifs commerciaux", 
    "price": "50.00", 
    "instructors": "Marketing et relation client Adolphine da-Silva", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690496_dba9_2.jpg", 
    "course_url": "https://www.udemy.com/apprendre-a-definir-et-atteindre-vos-objectifs-commerciaux/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T19:13:16Z"
}