{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Hey dear student, you must have entered the courses page because you were curious to know who offers a 10 dollar course, and teaches how to change your life by making real money in the applications world. So, nice to meet you, my name is Tolik, and I am going to change your life!</strong>  </p>  <p style=\"\">  \t  At this course I will be teaching you, step by step, how to enter the App World, and staying alive.  </p>  <p style=\"\">  \t  (It’s exactly what it is)  </p>  <p style=\"\">  \t<strong style=\"\">Let’s start!</strong>  </p>  <p style=\"\">  \t<em style=\"\">Welcome to the first on-line course ever made from the reskinners community. </em>  </p>  <p style=\"\">  \t  You’ve surely seen before courses that promise you, that you will make money off of apps, for hundreds or even thousands of dollars.  </p>  <p style=\"\">  \t  Well, there are alot of these courses, some good, some less… Our courses main advantage is:  </p>  <p style=\"\">  \t  First, this is a LIVE course. Meaning, every other week, there will be a new lecture added to the course, answering your on-going questions on e-mail. You can ask me ANYTHING related to the reskinning and applications world.  </p>  <p style=\"\">  \t  The second advantage is that we open this course for anybody willing to learn, weonly take 10$ per person, which is a payment that should screen out the people that aren’t serious.  </p>  <p style=\"\">  \t<strong style=\"\">If you’ve decided that you are willing to change your life, and start running your own succesful on-line business, which will earn your money for you, while you relax and live life, You are in the right place. So come join our journey to the wonderful App World.</strong>  </p>", 
    "end_date": null, 
    "title": "Apps Reskin for Beginners - Grow Your Own Gaming Empire", 
    "price": "20.00", 
    "instructors": "Yaniv Golan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327758_567c_2.jpg", 
    "course_url": "https://www.udemy.com/app-reskins-for-beginners-grow-your-own-gaming-empire/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-26T23:16:46Z"
}