{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t            In this comprehensive class we will learn the ins and outs of selling <em style=\"\">your</em> art, craft, design, or specialty online with maximum profits to you.  </p>  <ul style=\"\">  \t<li style=\"\">We will explore a variety of sales platforms and see how we can use them for our work. Each system has a series of benefits and drawbacks (most importantly, price.) Our way will ensure we get the most money possible into our account.</li>  \t<li style=\"\">We will utilize some free (open source) software for putting together our complete e-commerce system in an intuitive, non-technically focused way.</li>  \t<li style=\"\">We will walk through how to figure out your shipping costs, taxes, commission fees, and many other factors. </li>  \t<li style=\"\">We will walk through the process of setting up downloadable items (digital products), like images, audio, and PDF files.</li>  \t<li style=\"\">We will spend a good deal of time reviewing pricing. We will walk through how some people calculate the cost of their work, and I'll show you my formula for figuring out what I charge quickly and easily.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">BONUS: <br style=\"\">  \t            Also included in this class is a huge 70% discount on my full Wordpress class. </strong>  </p>  <p style=\"\">  \t<strong style=\"\">BONUS BONUS: </strong>  </p>  <p style=\"\">  \t<strong style=\"\">Included completely inside this class is my complete \"Setting up an E-Commerce Site\" class! </strong>  </p>  <p style=\"\">  \t<strong style=\"\">Essentially TWO complete courses for nearly free!</strong>  </p>  <ul style=\"\">  \t<em style=\"\"><em style=\"\"><em style=\"\"></em></em></em>  </ul>", 
    "end_date": null, 
    "title": "Artist’s Guide to Promoting & Selling Your Art Online", 
    "price": "20.00", 
    "instructors": "Jason Allen", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394300_af1b.jpg", 
    "course_url": "https://www.udemy.com/selling-your-art-online/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T20:33:22Z"
}