{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ol>\n\nDescubre cómo dar visibilidad a tus apps para obtener\ndescargas gratis en las tiendas de Google Play y App Store de Apple.<br></ol><p>Sin duda, <strong>el márketing de tus apps</strong> es lo que te va a dar el salto cualitativo que esperas.  <strong>Es lo que le va a dar visibilidad a tu aplicación y además las conversiones que deseas</strong>.</p>  <p>Se trata de un curso que va al grano. No se trata de teorías de márketing, son <strong>tácticas y estrategias</strong> que aplico a mis apps para <strong>obtener el mejor resultado en el menor tiempo posible.</strong></p>  <p>Vas a descubrir cómo dar la máxima visibilidad a tus apps con herramientas de inteligencia competitiva específicas de apps. </p>  <p>Existen millones de apps “zombies” en Google Play y App Store de Apple, son aquellas que no tienen descargas. Pero no quiere decir que no sean buenas, solamente que <strong>una cosa es que las apps sean buenas y otra que tenga visibilidad para llegar a tu público objetivo</strong>.</p>  <p>Descubrirás :</p>  <ul><li>Cómo buscan las apps los usuarios.</li><li>Cómo y por qué los factores de visibilidad no son iguales en Google Play y App Store de Apple.</li><li>Cómo utilizar de forma adecuada las herramientas de inteligencia competitiva para apps.</li><li>Cómo escoger las palabras clave de tu público objetivo.</li><li>Cómo modificar los factores a tu favor para tener mayor visibilidad en las tiendas de apps.</li><li>Cómo inspirarse en lo que funciona de la competencia para aplicarlo en tus apps.</li><li>Cómo llegar a tu público objetivo para poder ofrecerles tu valor añadido.</li></ul>              <p>Se trata de un curso de 140 minutos, de conocimientos condensados sobre lo que funciona para tener visibilidad y ventas.</p><p><strong>Algunas de mis apps han sido destacadas en las tiendas de apps</strong>, te aseguro que no es casualidad. Puedes ver en el primer vídeo cómo Apple, ya desde la publicación de la app, la pone dentro de las primeras 10 posiciones en muchos paises y en diferentes categorías.</p><p>He publicado más de 90 apps y tengo más de 3 años de experiencia en el márketing de aplicaciones para móvil.<br></p><ol><br></ol>", 
    "end_date": null, 
    "title": "ASO para Aumentar tus Descargas de apps un 500%", 
    "price": "50.00", 
    "instructors": "Jordi Martin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678278_9ef1_3.jpg", 
    "course_url": "https://www.udemy.com/aso-para-aumentar-tus-descargas-de-apps-un-500/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T14:37:46Z"
}