{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Con este curso resolverás todas las dudas que se te presentan como emprendedor o emprendedora para crear tu empresa, hacerte autónomo o asociarte a una cooperativa.</p><p>Aprenderás tanto qué es ser autónomo y las características y ventajas de este régimen como todo lo relativo a las diferentes formas jurídicas que existen para constituir una sociedad. Analizaremos de cada una de estas formas societarias qué son, cual es el número mínimo de socios, cual es el capital mínimo, la tributación, la responsabilidad patrimonial asumida, las formas de administración de la sociedad, la transmisión de acciones, etc. Todo aquello que es necesario que sepas antes de tomar la decisión sobre qué forma jurídica elegir.</p><p>Adicionalmente, veremos paso a paso cuales son los trámites que deberías seguir para hacerte autónomo o para constituir cada una de las formas societarias, viendo los aspectos más relevantes de cada uno de los trámites a realizar en el proceso, la documentación a llevar, etc. </p><p>Además analizaremos qué criterios debes tener en cuenta a la hora de tomar la decisión de cual de las formas jurídicas presentadas es la más adecuada tanto a tu proyecto de negocio como a tus circunstancias personales (dinero disponible, riesgos y responsabilidad a asumir, etc.).</p><p>Por último, mediante casos prácticos resueltos, veremos como poner en práctica todo lo aprendido y planteando un tipo de negocio analizaremos qué forma societaria es la más recomendada para el mismo y por qué, descartando una a una las demás opciones hasta tomar la decisión.</p>", 
    "end_date": null, 
    "title": "Aspectos legales para emprender: aprende a crear tu empresa", 
    "price": "25.00", 
    "instructors": "Luis Miguel Larriba", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551904_061b.jpg", 
    "course_url": "https://www.udemy.com/aspectos-legales-para-emprender-aprende-a-crear-tu-empresa/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-11T16:56:23Z"
}