{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This comprehensive course teaches you practical strategies that you can apply to your business... <em class=\"redactor-inline-converted\">tomorrow</em>. The co-founders of Barefoot Wines and New York Times bestselling authors, Michael Houlihan and Bonnie Harvey, teach everything from how to get the word out for your startup without paid advertising to making your suppliers your bankers in this 49 lecture course with worksheets, templates, and case studies.  </p>\n\n<p>Michael and Bonnie are entrepreneurs, best-selling authors, and keynote speakers who know what it takes to succeed in business. They bootstrapped Barefoot Wines, grew the business into an international brand, and it was acquired by the world's largest wine company. Though renowned for Barefoot Wines, Michael and Bonnie are consultants to Fortune 500 companies and high growth startups. One of their clients made the Inc. 500 list of fastest growing companies and the Inc. 5000 list the third year in a row. Their New York Times bestselling book, The Barefoot Spirit, is recommended by the CEO Library in CEO Forum and now is used in more than 40 schools of entrepreneurship worldwide. This entrepreneurial track record is what makes them the ideal mentors for those who wish to launch their own companies.   </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Many courses claim to teach the same thing but this course is backed by over 50 years of collective experiences starting a business, growing into an international brand, and getting acquired. They know what they’re talking about and you’ll want to learn from them.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course covers the three following big strategies.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Worthy Cause Marketing</strong>. How to partner with non-profit organizations to get your message out to your target market without being dependent on expensive advertising. Reduce employee turnover at the same time!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Making Your Supply Chain Your Asset</strong>. How to build trust with your suppliers so they offer better credit terms, work with your schedule, and deliver on time. How to look for strategic allies all along the supply chain, even in unexpected places.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Outsourcing</strong>. How to outsource your service needs effectively without compromising quality and reduce your need for employees.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The goal of this class is to make the most out of every penny that you put into your business. These three strategies, well understood and applied, can significantly reduce your costs and improve your profitability!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll also understand business tactics with in depth answers to common obstacles facing business owners around the nation. You can hear about real world challenges and the advice that Michael and Bonnie gave to overcome them. The course contains the tools for your success!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">“If you are a motivated entrepreneur looking to turn a dream into reality, there is no better resource to learn proven business practices taught by the founders of a #1 internationally selling brand. This course will not make you an overnight millionaire (at least until you reach acquisition), however it will provide the necessary mindset for success and the required basis of information to build from. I highly recommend the Entrepreneur’s GPS</em><em class=\"redactor-inline-converted\"> to ANYONE who is serious about their success.”</em> - Zachary Little, SourceClub Commerce Group</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">“There you have it! An MBA in an hour!”</em> - Vegar Wiik, Executive Director, FAU College of Business</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"They inspired the delegates with the story of the little winery that broke all the rules and left footprints across an industry.\"</em> - Khairul Dannish, Secretary General, International Council for SME &amp; Entrepreneurship, Malaysia</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Informative, inspiring, and entertaining.\"</em> -Nolan Bushnell, Founder of Atari</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"It was a pleasure to hear you both speak at Cornell this afternoon. The Barefoot Spirit has played an integral role for me when making decisions for my new business. Young entrepreneurs like myself are fortunate to have people like you as a resource to help guide and coach us through our exciting careers.\"</em> - Chris Kirby, Owner, The Ithaca Hummus Co., and student of entrepreneurship</p><p><em>\"I loved how the course wasn't scripted and throughout the course personal examples were given of how to utilize the information that was being given to me. Facts were not watered down. They were to the point and simple to comprehend. Overall worth the investment if you’re truly serious about starting and growing a business.\"  - </em>Roberto Gotay, Udemy Course Student</p>", 
    "end_date": null, 
    "title": "Barefoot Wines Co-founders: 3 Ways to Cut Costs in Business", 
    "price": "50.00", 
    "instructors": "Michael Houlihan and Bonnie Harvey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/767100_b217_2.jpg", 
    "course_url": "https://www.udemy.com/barefoot-wines-co-founders/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-19T00:13:23Z"
}