{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>LATEST: Course Updated in February 2016</em></p>\n\n<p><strong>Have you ever wondered, that how could you raise from Ordinary Businessman to Extraordinary Level?</strong></p>\n\n<p><strong>What is Recipe of Success, When it Comes to Entrepreneurship?</strong></p>\n\n<p>Success is Very Simple, if you really start to Understand...</p>\n\n<p>And now they are all revealed in this easy to follow course!<br></p>\n\n<p>If you're looking to improve your lifestyle, if you want to improve your business, if you want to make a better life for your family, <strong><em>this course is definitely for you.</em></strong></p>\n\n<p>Simply Learn all These Rules and You can (AT LEAST) 10X Your business, If Applied all the Strategies and Mindset In your business Correctly...</p>\n\n<p><strong>There are No shortcuts, no \"get rich quick\" schems, no nonsense.</strong><br></p>\n\n<p>Just simple and Advanced, proven steps to wealth and success, easily, quickly and simply.</p>\n\n<hr>\n\n<p><em>Head Towards Dawn of Advanced Strategies and Give yourself a fresh start by enrolling in this life-changing course now.</em></p>\n\n<p><em>Every moment you delay, you lose out. Simple as that.</em></p>\n\n<p>All the ongoing updates to this course are free, always, for ever.</p>\n\n<p><strong><em>And there's a 30 day absolutely no questions asked full money back guarantee - my personal promise of your happiness and satisfaction! You really cannot lose!</em></strong></p>", 
    "end_date": null, 
    "title": "Basic Mindsets of Starting an Online/Offline Business", 
    "price": 0, 
    "instructors": "Kaivalya Deshpande", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/735290_b4d2_10.jpg", 
    "course_url": "https://www.udemy.com/business-fundamentals/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-20T10:44:11Z"
}