{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">In Late 2011, I realized that if I stayed at my dead end restaurant job one more day, I was probably going to hang myself from the charming, antique oak rafters of the God-forsaken steakhouse.</p><p style=\"\">Not to be grim — but that's simply how I felt.</p><p style=\"\">All viable options at one point...</p><p style=\"\">I wasn't in any serious danger of hurting myself (you don't need to email me...really). But I was EXTREMELY fed up.</p><p style=\"\">I was so TIRED with being limited to a meager paycheck when everything I wanted to do with my life required two things I didn't have:</p><ul style=\"\"><li style=\"\">More free time</li><li style=\"\">A lot more money</li></ul><p style=\"\">Now remember, this was 2011 and I'd just seen The Social Network. I was pretty juiced up, imagining that if I just had \"the perfect idea\"...or could somehow re-do everything and go to Harvard...I could be the next Zuckerberg and finally create something I loved that actually made money.</p><p style=\"\">So I did a lot of meditating. And deep thinking. And agonizing. I was looking for that million-dollar idea. I prayed to a few different gods.</p><p style=\"\">I even went to a psychic to help pull it out of me.</p><p style=\"\">(Serious. Like...not a joke. I was looking for a screenshot of the receipt to show you, but my bank account won't go back that far.)</p><p style=\"\">3 months later, I was still at the restaurant begrudgingly scooping butter balls into plastic ramekins for pre-diabetics who shouldn't have been eating that food anyway...when it hit me....</p><blockquote style=\"\">\"I don't need to come up with a new idea. I can just do something I'm ALREADY good at.\"</blockquote><p style=\"\">It sounds like a shallow, obvious realization...but at the time, it was like it was like Harry Potter walked into my brain and turned the mother f***ing switch on.</p><p style=\"\">LUMOS!</p><p style=\"\">If you don't get the reference, you're lamer than I am for making it </p><p style=\"\">Fast forward to one year later and I'd started not one...but TWO profitable freelance businesses — a college admissions prep firm (offline) and a web design company (online).</p><p style=\"\">Each generated THOUSANDS of dollars every month, while allowing me the freedom to schedule my life how I wanted. The restaurant was a distant memory.</p><p style=\"\">Make Your First $1,000 Freelancing will teach you how to come up with a profitable idea, find high-paying clients and make steady, predictable income — even if you've never started a business before. You can use the in-depth strategies in this course to stack up money on the side...or even quit your job.</p>", 
    "end_date": null, 
    "title": "Be Your Own Boss: Launch a Fulfilling Freelancing Business", 
    "price": "50.00", 
    "instructors": "Daniel DiPiazza", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469416_faf7_7.jpg", 
    "course_url": "https://www.udemy.com/be-your-own-boss-launch-a-fulfilling-freelancing-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T23:21:54Z"
}