{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Running Successful Workshops</em></strong></p><p><strong>Would you like to pass on your expertise and be confident teaching group workshops as a side income? This course will teach you how in quick and easy steps.</strong><br></p><p>This Running Successful Workshops course will help you choose your topic, find free locations that'll help you advertise, get control of costings and profits, and fill your class with excited students. You'll learn practical tips and tricks for being confident in yourself and hosting a smooth and successful workshop.</p><p>Jennifer has studied personal development in America, and now runs workshops all over the world. Now she's excited to share everything she's learnt through education and experience with you, so that you can start feeling excited about running workshops and energized to pass on your knowledge!</p><p>This comprehensive programme covering the entire spectrum of topics, from preparing your topics, making handouts, setting the tone on the day, handling crises, and marketing - all by simply focusing on a step by step process.<br></p><p>Let go of the idea that you don't have enough funds, experience, or knowledge to teach, and start sharing your knowledge and changing people's lives.</p><p><strong>You deserve a life that lights you up and teaching part time or full time can give you that. So take this course now!</strong></p><p><strong><em>Topics include:</em></strong></p><ul><li>Choose a great topic</li><li>Preparing a compelling and logic agenda</li><li>Choosing a venue</li><li>Sourcing materials</li><li>Designing activities</li><li>Budgeting for costs and profits</li><li>Marketing your course</li><li>Running the event on the day</li><li>Handling difficult situations</li><li>And much much more</li></ul>", 
    "end_date": null, 
    "title": "Become a Workshop Leader", 
    "price": "20.00", 
    "instructors": "Jennifer Liff, Louise Croft", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695462_4729.jpg", 
    "course_url": "https://www.udemy.com/successful-workshops/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T08:22:06Z"
}