{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course is one of a kind. Anyone who wishes to get into the unlocking side of cell phones either for themselves, friends, family, or to create an additional revenue stream must take this course. We start with the basics of what unlocking is, what can be done once a phone is unlocked and the typical scenarios for unlocking a cell phone. There are many benefits to unlocking a gsm phone and many things to be careful of before you unlock a gsm phone. We cover terminology like gsm, cdma, sim, imei and much more. Once completed students will be able to identify the major carriers who use the varying networks and what phones are allowed to be interchanged on those networks. We cover how the North American gsm market differs from the international gsm markets and which phones can be used on those different markets. </p><p style=\"\">We give a step by step tutorial from start to finish with both the iPhone unlock process and the android unlock process. We talk about how to safeguard against buying or unlocking phones that can potentially come back as bad or negative in the imei system, preventing potential problems for you down the line. We cover the website we personally use to unlock phones and navigate through all the menus. We start by creating an account, adding credits, navigating the site, checking the status of the unlocks and much more. We cover the troubleshooting website should any problems arise giving you greater ability in solving all potential unlocking issues. We cover how to change and enable the internet and mms settings for the major gsm carriers. This is extremely important as an unlock typically enables only the talk and text. </p><p style=\"\">This course is no more than a few hours to complete and upon completion, all the tools are gained to start unlocking phones. We even cover how to make money from unlocking cell phones. We have been unlocking phones for years and have made over one hundred thousand dollars from unlocking phones. We take the mystery and confusion out of cell phone unlocking and give anyone with the desire or interest the ability to unlock a gsm cell phone. Follow along as we show you what you need to know to get into the business of unlocking cell phones.</p>", 
    "end_date": null, 
    "title": "Become A Pro In the Phone Unlocking Industry in 2 Hours!", 
    "price": "45.00", 
    "instructors": "Phone Fix 411", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/445964_b2d9_6.jpg", 
    "course_url": "https://www.udemy.com/gsm-phone-unlocking-start-to-finish-everything-in-between/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-12T18:04:17Z"
}