{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated July 2015 - </strong><strong>Over 700 students.</strong></p><p>This course is designed for those of you who are ready to:</p><ul><li><strong>Make thousands by booking more speaking gigs </strong>without leaving your home.<strong></strong><strong></strong></li><li><strong>Save thousands by reducing your speaker budget, </strong>no travel and expense hotel bills.<strong></strong></li></ul><p>You recognize that:</p><ul><li>There are limitless <strong>opportunities to collaborate </strong>with others</li><li>There are <strong>new ways of reaching your audience</strong> that are more cost-effective</li><li>You can grow your list of <strong>high-value buyers supper fast and at no cost</strong></li><li>You can<strong> make a passive income</strong> from being part of a Professional Virtual Summit</li><li>You need to <strong>update your Professional Speaking skills</strong></li></ul><p>Hi I'm Wendy Kier,</p><p>I've spent years interviewing expert speakers on telesummits, webinars and interview series, I can tell you there is a massive difference between an average speaker and the ones that are <strong>truly successful and get the results.</strong></p><p>The course provides you with the professional to learn new skills and how to turn your <strong>listeners into paying customers.</strong></p><p>Here's Just A Taste Of What You'll Learn…</p><ul><li>What a Virtual Summit is and how it can benefit your business moving forward.</li><li>How to ensure that you collect the details of hundreds of the best high-value leads</li><li>What is expected of you as a professional Virtual Summit Speaker</li><li>How to turn your high-value leads into becoming a customer</li><li>6 Ways to re-purpose your interview at attract more high-value leads</li><li>How to find the very best Virtual Summits to Speak on</li><li>What needs to be in your Virtual Summit Speakers contact</li><li>Use the swipe files to secure Virtual Summit Speaking opportunities</li><li>A solid foundation in professional Virtual Summit Speaking</li></ul>Here's hoping you get as much out of the course as I did making it.<p>Wendy Kier</p><p>Virtual Summit Expert</p><p>P.S. I am here online to support you, so make sure you ask all the questions you need.</p><p>Be a Champion for Professional Virtual Summit Speaking</p>", 
    "end_date": null, 
    "title": "Become a Profitable Virtual Online Summit Speaker Today", 
    "price": "45.00", 
    "instructors": "Wendy Kier", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542312_7c80.jpg", 
    "course_url": "https://www.udemy.com/profitable-virtual-summit-speakers-step-by-step-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T16:00:33Z"
}