{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">The Founder Institute presents &quot;Become a Startup Founder&quot; - the first online program designed to teach you everything you need to know to launch your startup.</strong>  </p>  <p>  \tBecome a Startup Founder is a comprehensive step-by-step program to help Founders launch a meaningful and enduring technology company at their own pace.  </p>  <p>  \tThe curriculum and the assignments are based on the intensive four-month <a href=\"http://fi.co/r/udemy\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">Founder Institute</a> program, an entrepreneur training and startup launch program that has helped launch hundreds of successful companies across the globe, like Udemy. The <strong style=\"\">more than 55 videos</strong> organized in this offering represent the most inspirational, most informative and best-rated talks by leading CEOs at Founder Institute sessions worldwide. Everything has been curated to assist in your success.  </p>  <p>  \t<strong style=\"\">Your instructors for this course include legendary entrepreneurs, investors, and startup gurus, such as:</strong>  </p>  <h5>Aaron Patzer</h5>  <p>  \tAaron Patzer is both the visionary and technical mind behind <a class=\"external-link\" href=\"http://mint.com\" target=\"_blank\" rel=\"nofollow\" style=\"\">Mint.com</a>, now the leading free, online money management tool in the U.S., and purchased by Intuit for $187mm in 2009. In 2008 he was named one of CNN Money&#039;s &quot;Money Heroes&quot;, and a World Economic Forum Tech Pioneer. In 2009, he was named to Inc Magazine&#039;s Top 30 Entrepreneurs Under 30, and Fortune&#039;s Top 40 Business Leaders Under 40.  </p>  <h5>Adeo Ressi</h5>  <p>  \tAdeo is the Founder of the <a class=\"external-link\" href=\"http://thefunded.com\" target=\"_blank\" rel=\"nofollow\" style=\"\">TheFunded.com</a>, an online community of entrepreneurs, and the <a class=\"external-link\" href=\"http://founderinstitute.com/r/sdu\" target=\"_blank\" rel=\"nofollow\" style=\"\">Founder Institute</a>, a pre-seed startup incubator launching hundreds of technology companies per year across four continents. The Institute is the eighth startup that he has founded or built - four of which were acquired and three of which are still in operation. Adeo also sits on the board of the X PRIZE Foundation, a non-profit organization solving the world&#039;s greatest challenges through prize competitions.  </p>  <h5>Dan Shapiro</h5>  <p>  \tDan Shapiro is the founder and CEO of Sparkbuy Inc, a comparison shopping website recently acquired by Google. Previously, Shapiro was founder and CEO of Ontela, a pioneering mobile imaging company, where he was named CEO of the Year by MobileBeat. Ontela was frequently recognized including the Dow Jones Top 10 in Wireless list, receiving the CTIA award for Best Social Networking Application, and being named Breakthrough Startup of the Year by the WTIA. Ontela merged with Photobucket in December of 2009 where Shapiro now holds a seat on the Board of Directors.  </p>  <h5>Russell Fradin</h5>  <p>  \tRussell Fradin is the Founder and CEO of Dynamic Signal, a new startup in the Social Media Marketing and Monitoring space. Prior to founding Dynamic Signal, Russ was the co-founder and CEO of Adify, acquired by Cox for $300M in the Spring of 2008. Prior to starting Adify, Russ was the SVP of Business Development for Wine.com, EVP of Corporate Development for comScore Networks, and VP of Business Development at Flycast/Engage. Russ is the Chairman of Social Shield and is also a Board Director for Outside.in, Udemy and Red Aril.  </p>  <h5>Phil Libin</h5>  <p>  \tPhil Libin is the CEO of <a href=\"http://evernote.com\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">Evernote</a>, a web service designed to allow users to easily capture and store information, memories, and content in any environment. Phil was a founder of two other successful tech startups, is an investor and advisor in several startups, is the inventor of several issued and pending technology patents, and holds a top-secret security clearance from the Department of Defense.  </p>  <h5>Jonathan Abrams</h5>  <p>  \tJonathan Abrams is the founder and CEO of Nuzzel, and Co-Founder and Managing Partner of the <a href=\"http://www.foundersden.com/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">Founders Den</a>. Previously Jonathan was the Founder and CEO of Socializr, Friendster, and HotLinks. Jonathan was hailed as &quot;The Social Pioneer&quot; by Vanity Fair in June 2008 for creating the pioneering social networking service Friendster, and was also honored as one of the world&#039;s top young innovators by the MIT Technology Review.  </p>  <h5>Mike Stemple</h5>  <p>  \tMike currently is CEO/Founder of Mosoro, which builds a developer platform that enables real-world objects to communicate with smartphone apps. Prior to Mosoro, Mike served as Founder and CEO of Odojo, which allowed parents to monitor their child&#039;s Social Networks for inappropriate content &amp; the Internet for leaks of their personal information. Previous to Odojo Mike served as Founder and President of Mike&#039;s background also includes serving as Founder, Chairman and CEO of nReach Inc. which was purchased by SmartServ, Inc., and TRIPDA/Nomad Labs Inc. Mike is a Colorado native, a graduate of Metropolitan State College, a governor appointee to The Colorado Governors Council for Physical Fitness, and a proud veteran of the US Army.  </p>  <h5>Sebastien De Halleux</h5>  <p>  \tSebastien de Halleux co-founded and was COO of Playfish, one of the largest and fastest growing social game companies, which was acquired by EA for $400m in November 2009 where he was appointed Vice President of Business Development for EA Interactive. Prior to Playfish, Sebastien was part of the founding team at Macrospace, a European mobile games startup which merged with US-based Sorrent to form Glu Mobile and grew to a $337m IPO in March 2007. Sebastien also helped incubate Nokia Ad Service, an entrepreneurial new business unit at Nokia aiming to monetize traffic across 850 million Nokia handsets. Sebastien holds a Master&#039;s in Civil Engineering with honours from Imperial College, London.  </p>  <h5>Fred Joyal</h5>  <p>  \tFred is CEO and co-Founder of Futuredontics, better known to the public as 1-800-DENTIST. Fred&#039;s mission in building the 1-800-DENTIST brand was to provide a consistent flow of screened patients to member dentists and, equally important, to encourage millions of consumers to visit the dentist on a regular basis. Fred has written, produced and appeared in more than 100 of the company&#039;s television and radio commercials, which air more than 5,000 times each month on major networks nationwide. The company also has evolved to the point where 50% of their referrals come through the Internet. Fred recently published a book, &quot;Everything Is Marketing: the Ultimate Strategy for Dental Practice Growth&quot;, written for dentists and dental office managers, which is already in its third printing.  </p>  <h5>Joe Bezdek</h5>  <p>  \tJoe Bezdek is a co-founder of DivX, Inc., the creator of the popular DivX video format and technology. While there, he filled a variety of roles in product management, marketing, and brand management, most recently as brand director. He has a BS and MS degrees in mechanical engineering from Texas A&amp;M and The University of Texas - Austin, respectively. He also serves on the board of trustees of the Rady Children&#039;s Hospital Foundation in San Diego.  </p>  <h5>Gabriel Yoran</h5>  <p>  \tGabriel Yoran is co-founder of consumer privacy software company Steganos and Europe&#039;s leading location-based social network, aka-aki. He is an expert in product design and consumer marketing with more than 10 years of professional experience. Products designed by Gabriel have earned numerous awards, including two Webby Awards and numerous Best Buy and Product of the Year awards in magazines like PC WORLD. Gabriel is a regular speaker at IT and mobile industry events such as Wireless Communication and Information (WCI), World Usability Day, Web 2.0 Expo, Mobile 2.0 Summit. He also gives Master Lectures on Entrepreneurship and Product Design.  </p>  <h5>David Weekly</h5>  <p>  \tDavid has been programming since he was five and has coded for MIT, Harvard, Stanford, There.com, atWeb, and Legato. David wrote the first layman&#039;s description of MP3 in early 1997 and graduated in 2000 with a BS in Computer Science from Stanford, where he was a President Scholar and a finalist in the ACM International Programming Competition. David started the company that became PBworks in 2003. He likes to throw hacker parties (he co-founded SuperHappyDevHouse in 2005 and Hacker Dojo in 2009), connect people, fly helicopters, and build useful things. David won Best Mentor in the SF Summer 2010 Session and Most Supportive Mentor across the whole global FI program in 2011.  </p>  <h5>Eric Ries</h5>  <p>  \tEric co-founded IMVU in April 2004 and served as Chief Technology Officer from its inception to August 2008. Eric is the co-author of several books including The Black Art of Java Game Programming (Waite Group Press, 1996). While an undergraduate at Yale University, Eric co-founded Catalyst Recruiting. Although Catalyst folded with the dot-com crash, Eric continued his entrepreneurial career as a Senior Software Engineer at There.com, leading efforts in agile software development and user-generated content. In 2007, BusinessWeek.com named Eric one of the Tech&#039;s Best Young Entrepreneurs. Eric earned a B.S. in Computer Science from Yale University.  </p>  <h5>Heather Harde</h5>  <p>  \tHeather Harde is the CEO of TechCrunch. She spent the last ten years working within News Corporation. She held a variety of corporate development, strategy and operating roles both in Los Angeles and New York. Most recently, she was part of the founding team at Fox Interactive Media and their SVP Mergers &amp; Acquisitions. Her team spent over $1.3 billion on eight acquisitions and two equity deals during her tenure. Their acquisitions spanned pre-launch start-ups all the way through public-company and pre-IPO buyouts.  </p>  <h5>Craig Kanarick</h5>  <p>  \tCraig is a seasoned executive with over 15 years of experience at the nexus of business, technology and design and was the co-founder, Chairman and Chief Strategic Officer of Razorfish. He has also held positions as SVP at Blockbuster Digital Technologies, Chief Creative Officer at Broome Crosby Limited, and Studio Leader at Rockwell Group. He received bachelor&#039;s degrees in philosophy and computer science from the University of Pennsylvania and a master&#039;s degree in visual studies from the MIT Media Lab.  </p>  <h5>Jeffrey Dachis</h5>  <p>  \tJeff is the CEO of Dachis Group, the worlds leading Social Business transformational services and software company. Jeff&#039;s leadership and vision helped establish the digital services industry more than a decade ago when he co-founded Razorfish, Inc. out of a one-bedroom New York City apartment, which grew to$250 Million in revenue and 2,200 employees. Dachis is also a Senior Partner at Manhattan-based Bond Art + Science, which specializes in information architecture and user experience design for digital media and information services. He serves as an advisor to companies including Bazaarvoice and Waterfall Mobile. Jeff has also served as Co-Chairman of the Producer&#039;s Guild of America New Media Council East, and a frequently appeared as a lecturer and speaker, and in publications such as the New York Times, the Wall Street Journal, Business Week, and Wired Magazine and in television appearances including CNBC, CNN, 20/20 and 60 Minutes. His honors include Ernst&amp;Young&#039;s Entrepreneur of the Year in 2000, among others.  </p>  <h5>Naval Ravikant</h5>  <p>  \tNaval is an entrepreneur, angel investor, and a co-author of Venture Hacks. He is also the co-founder of AngelList. Previously, Naval was a co-founder at Genoa Corp (acquired by Finisar), Epinions.com (IPO via Shopping.com), Hive7, Inc., and Vast.com (now one of the largest auto shopping networks online). Naval has also advised Bix.com, iPivot, and XFire, among others, and invested in many companies, including Twitter, Social Media, Jambool, SnapLogic, and Disqus.  </p>  <h5>Jason Calacanis</h5>  <p>  \tJason Calacanis is the CEO of Mahalo.com, a human powered search engine and founder and CEO of LAUNCH and ThisWeekIn.. He was previously the co-founder of Weblogs, Inc. with Brian Alvey, and the GM of Netscape.  </p>  <h5>Philip Kaplan</h5>  <p>  \tPhilip Kaplan is a serial entrepreneur and co-founder of Blippy. Formerly he was founder and CEO of AdBrite, and creator of F-edcompany.com. Philip is the best-selling author of F&#039;d Companies (Simon &amp; Schuster). Blippy is backed by Charles River Ventures and Sequoia Capital. AdBrite is backed by Sequoia Capital and is the largest privately-held ad network.  </p>  <h5>Shervin Pishevar</h5>  <p>  \tShervin is a visionary technology entrepreneur, published researcher, and technology incubation expert who raised nearly $40M in venture funding for his start ups. He is a managing director at Menlo Ventures, and is the founder and executive chairman of SGN, one of the leading social and mobile gaming companies with 17 million unique downloads of their games since 2008. Shervin was founding president and COO of Webs, and is an active angel investor or advisor in such companies as Aardvark, Thread.com, Gowalla and Kissmetrics. Shervin was a member of the Technology, Media and Telecommunications (TMT) policy working group that helped create the Obama Technology and Innovation Plan. His achievements have been highlighted by the Wall Street Journal, Financial Times, New York Times, LA Times, CNN and CNBC.  </p>", 
    "end_date": null, 
    "title": "Become a Startup Founder (Complete Course)", 
    "price": "45.00", 
    "instructors": "Founder Institute", 
    "commitment": "30 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/10021_9715_4.jpg", 
    "course_url": "https://www.udemy.com/startup-mba/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-09-30T22:35:47Z"
}