{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you looking to build<strong> </strong>HUGE WEALTH from an online <strong>online</strong>?</p><em>You might like to <strong>have more fun </strong>and<strong> less frustration in your life.</strong></em>  <p><em><br>You might want <strong>experience the freedom and flexibility </strong>that comes with<strong> being your own boss.</strong></em></p>  <p><em>You might seek to <strong>maximize your personal profit </strong>and <strong>create a richer</strong>, <strong>more rewarding lifestyle</strong> for you and your family.</em></p>  <p><em>You might have <strong>great product ideas you’re passionate about</strong>. But lack the systems and tools to <strong>market and sell them almost effortlessly</strong>, to people who are going to <strong>really benefit </strong>from them.</em></p>  <p>Then Become A Freelancer, is for you ...</p>In a matter of minutes you’re going to be on the <strong>quick</strong> and <strong>easy</strong> path to generating magnetic high value business. Without the time, stress and hassle that most others put up with.  <p>You’re going to develop one of the <strong>highest earning skills</strong> on the planet: - More valuable and highly sought after than an MBA. Simply put ... \"<strong>The ability to put down words that get people to give you their money</strong>\".</p>  <p>This course is <strong>specifically designed</strong> to..</p>  <ul><li><strong>Raise your personal revenue</strong></li><li>Help you to c<strong>arve out your credibility </strong>with new clients</li><li><strong>Accumulate authority</strong> in the marketplace</li></ul>        <p><em>Get skills for becoming a <strong>better</strong>, <strong>faster</strong> and <strong>higher earning</strong> freelancer. And be equipped to TRANSFORM your business and other peoples businesses to be more <strong>profitable</strong> and <strong>valuable than ever before.</strong></em><br> <br>Click the <strong>\"take this course\"</strong> button (see top right) ... <em>every moment delayed your missed earnings. </em></p>    <p><em>By investing in the course, you can virtually <strong>bypass decades </strong>of<strong> frustration, stress </strong>and<strong> hassle</strong> and get golden<strong> nuggets of marketing knowledge</strong> and <strong>get those insightful 'ah-ha' moments that can change your life forever</strong>.</em></p>  <p>As a <strong>bonus</strong> you can:</p>  <ul><li><strong>Be your own boss. Work as much as you want.</strong></li><li>Live a less stressful and more fun life.</li><li><strong>Experience freedom to do what you want without needing anyone else's permission.</strong></li></ul>      <ul><li>Differentiate from your competitors</li><li><strong>Gain financial security for true freedom and independence</strong></li><li>Get explosive growth in your key markets</li></ul>", 
    "end_date": null, 
    "title": "Become A Freelancer", 
    "price": 0, 
    "instructors": "Nibras Hijazi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640712_5a1a_8.jpg", 
    "course_url": "https://www.udemy.com/becomeafreelancer/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T19:38:16Z"
}