{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course offers you the support and knowledge to become a Social Entrepreneur. With over an hour of lectures we look at identifying aims and values, what great leaders know and do and what it takes to get started in thinking strategically.</p><p>We take you through a learning pathway, examining and analysing your options and planning your launch and business model. We share some of the most powerful strategic thinking tools and support you in moving on to think strategically.</p><p>Platform One Virtual Services staff have extensive experience in supplying training to aspiring social entrepreneurs, we understand the doubt and difficulties in getting started. Lynda our presenter has many years experience in providing one to one coaching to entrepreneurs at the start of their journey and knows the questions they have.</p><p>We consider all available legal structures and models and view, including the good and bad globally.</p><p> Social Entrepreneurs tap into social value and their motivation to achieve, our course offers you an action planning approach to getting your own start up launched.</p><p>With over an hour of lectures as well as useful tools to download you  will soon start feeling confident in your ability to think strategically. </p><p>If you are tempted to provide a service or product that achieves social good,improves communities and supports the most vulnerable in Society or you are moved to consider our environment, our wildlife and others we share a planet with this course provides an insight into how to get started.</p><p>Becoming a Social Entrepreneur is mostly a value based decision, if you are considering changing career pathways, looking for new opportunities or have a really great commercial business idea that could be used to generate income to improve the world then this course will challenge and provoke you into making that first step.</p><p>We look forward to working with you!</p>", 
    "end_date": null, 
    "title": "Become a social entrepreneur", 
    "price": "30.00", 
    "instructors": "Platform One Virtual Services", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618504_27e2_7.jpg", 
    "course_url": "https://www.udemy.com/become-a-social-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T21:13:05Z"
}