{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is created with the purpose of getting you started with online business and international network marketing. In this course, you will learn about how to start a web hosting business that guarantee lifetime passive income. I will show you in great details how to set up the recommended business initiative. The technique I use will work for beginners who know nothing about internet business. Most of the business ideas are in chronological order. It is therefore very important that you go through each session without skipping any as some businesses might require transferable skills for subsequent ideas. This is done to ensure you have first class knowledge and holistic understanding of how to set up an online business that will make you money.</p>  <p>It is a no-brainer approach guide, meaning you really do not need prior understanding of how to do things. I will teach you how to set up everything you need to get started. If you follow all the courses accordingly, you will be able to create a simple business model that will generate money from any location in the world. By the end of this course, you will have the necessary tools needed to begin advanced online business model. If you are patient, determined and very hard working, after this course, I can assure you that you are very much on the right path to becoming a successful web entrepreneur.</p><p><strong>Updated: As a student of this course, you will be entitled for a free web hosting server to get your started with the practical session.</strong><strong></strong><br></p>", 
    "end_date": null, 
    "title": "Beginner Level Tutorial: Starting a Web Hosting Business", 
    "price": "20.00", 
    "instructors": "Manifest Company", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633260_e379_5.jpg", 
    "course_url": "https://www.udemy.com/start-a-web-hosting-business-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T06:44:34Z"
}