{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you spinning your wheels when it comes to online marketing? How does it all fit together? Blogging, social media, e-mail marketing, web traffic... The thing that ties it all together is Content Marketing!<br></p><p>Through this course, <strong>you will understand content like never before AND you will create your own content marketing plan</strong> specific to your business and your online goals. You will:</p><p>1. Break content down into two major categories, both of which are important in a successful strategy, as well as the many forms it can take and which ones you want to use.</p><p>2. Put all the pieces together so you see clearly how content marketing really works - no more confusion. (I promise!)</p><p>3. Use the interactive worksheet to integrate what you learn and make your own content marketing plan. All the strategy in the world only helps if you can put it to use! And I'll walk through it.</p><p>The course has a lot of content packed into a short amount of time, as well as summary sheets to print and save, since I know you don't want to waste time on fluff. Yet, the information in here can truly transform your business.<br></p><p><strong>Who is it for?</strong></p><p><strong>This course is ideal for </strong><strong>entrepreneurs and small businesses</strong> who what to attract people online. Especially those who...</p><ul><li>have a passion for their product or service</li><li>have a website, but would like to get more engagement from it</li><li>want to build their list of prospective customers</li><li>are committed to success over the long run</li></ul><p>Content marketing is the best way to succeed online, but it's not for the faint of heart. I am committed to teaching people how to build their business and their following through persistent self-expression and effective strategies. </p><p>The only requirement is a desire to share your business and your message with the world. Let's get started!</p><p>-Sarah Schwab, Content Creation Coach</p><ul><li><span></span></li></ul>", 
    "end_date": null, 
    "title": "Beyond Blogging: Entrepreneur's Guide to Content Marketing", 
    "price": "40.00", 
    "instructors": "Sarah Schwab", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560614_5ef6_2.jpg", 
    "course_url": "https://www.udemy.com/beyond-blogging-entrepreneurs-guide-to-content-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T16:16:43Z"
}