{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>JOIN 9,900+ STUDENTS LEARNING HOW TO CREATE A $60K+ ONLINE BUSINESS FROM BLOGGING! SEE HOW TO BLOG YOUR WAY FREE FROM THE CUBICLE CHAINS FOR GOOD!</strong></p>\n\n<p><em>LATEST: Course Fully Updated For June 2016</em><strong></strong>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t    In this course, I'll be teaching you the exact methods that I  used to   create my blog, Create My Independence from nothing to over 2,000    subscribers and close to a million page views, enabling me to  build   relationships with hundreds of people and create an independent  online business of my own.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>What is my experience on the topic?</strong>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t        I've been blogging for over three years. I'm almost completely  self  taught  (hundreds of hours of trial and error). I've exchanged  hundreds  of  emails with my readers. I've written over 200 posts to date  and  have  built relationships with hundreds of bloggers and influencers  in  my niche. From my blog, I've built my own independent online business  from scratch (from $0 to over $60,000 in revenue).  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>Who is this course for?</strong>  \t                     The cubiclepreneur (entrepreneur at heart, but currently stuck in a  day-job) who wants to build an online platform as the foundation for an  eventual business venture that will bring them the freedom, options and  independence they're looking to create in their life.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>What problems does this course for solve for cubiclepreneurs?</strong>  \t                     It saves you hundreds of hours of trial and error in creating your own  online platform. It gives you the exact blueprint (and I mean EXACT) for  choosing a topic and name, choosing a blog platform, setting up your  site, customizing it, making it awesome and connecting with other  like-minded people in your niche.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>Who is this course NOT for?</strong>  \t                     The person looking to create a blog just to make a few bucks on the  side, in the short term. Someone not willing to follow through and stick  with this for the long haul.  </p>", 
    "end_date": null, 
    "title": "Blogging to Freedom: Create Your Independence with Blogging", 
    "price": "45.00", 
    "instructors": "Kraig Mathias", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/376015_9a1d_8.jpg", 
    "course_url": "https://www.udemy.com/create-my-independence-with-blogging/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-23T02:13:32Z"
}