{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Does your business have a story to tell? <strong>It should!</strong> Every new product can be unique in its industry. Does yours stand out from the crowd? <br><br>After a life of exploring the way people exchange value in over 35 countries, Diehl teaches business owners how to have conversations about brand strategy. In Brand Identity Breakthrough, you will learn how to develop a strong business identity by combining your personality and values with the functionality of your products to become irreplaceable to your audience. <br><br>Whether you lead a growing company, or are just starting a business, Brand Identity Breakthrough will give you a smarter way to think about new product development and business model generation. With undeniable, well-organized logic, it will show you how anyone can sell more, and at higher prices, so long as they give customers exactly what they want. <br><br></p><p><strong>Module 1: Why Identity Matters</strong></p><p>The purpose of this course is to help you learn to see your own value, the value of your business, and the value of your products or services from the perspective of your customers. Only then can you begin to fashion your identity appropriately. If you can train yourself to think like your customers, you can get a much better idea of what value you should be focused on creating. \n\n  </p>\n\n<p>Think about a product or a service that you feel connected to in some way. The quality offered is paramount, or you wouldn’t have purchased it in the first place. But of all the many purchases you make, there are some businesses that you undoubtedly feel more loyal to than others. The strongest source of this heightened sense of loyalty is the feeling that a company has gone out of their way to create a special type of value specifically for you.\n\n  </p>\n\n<p>Think of your favorite coffee shop that goes a little bit further in service, personality, and menu offerings. While they are competing with much larger companies that have a lot of money to spend on advertising, you still prefer them because they add specific value to the product and the service they offer. They stand out in your mind better than others, and you forge a real relationship with their brand. This results in them being able to stay afloat in a highly competitive environment and, whether they are conscious of it or not, they are improving the lives of the people they encounter in their own unique way.\n\n  </p>\n\n<p>This value is not another “add-on” or “bonus” on top of the basic service. It is something much less tangible which permeates their entire existence. </p>", 
    "end_date": null, 
    "title": "Brand Identity Breakthrough: Why Identity Matters", 
    "price": "20.00", 
    "instructors": "Gregory Diehl", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/868676_aa06_6.jpg", 
    "course_url": "https://www.udemy.com/brand-identity-breakthrough-module-1/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-04T14:18:21Z"
}