{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Communication is happening in every shared moment, and in ways that are not always obvious. It happens in the way your hair falls on a given day. It happens in how straight you are standing, or the way you walk into a room. The clothing you wear tells a significant story about who you are. There are so many other things we take for granted about the messages we send out to the world.</p>\n\n<p>Many people don’t want to spend money on a product or a service they can’t identify with. They want to feel a connection of trust based on a sound relationship. The problem with marketing in today’s rapid digital climate is that you only have a few seconds to establish this connection.\n\n  </p>\n\n<p>Sales is about learning to direct the information you put out towards a specific outcome: getting others to think the way you want them to think about your business. When they agree with you about the value you are offering, they will be ready take the actions you want them to take. This can be done unethically (by tricking someone into a sale with false premises and incomplete information) or ethically (through education and emotional support).\n\n  </p>\n\n<p>To be an effective communicator is to be absolutely clear in your core message. If your goal is to romantically attract members of the opposite sex, there is a combination of factors which will aid you most in that mission. However, these factors may not be compatible with other goals you have, such as appearing intelligent, intimidating, easygoing, unconventional, or something else entirely. Since you can’t be all things to all people all the time, you have to pick what is important to you and stay consistent with it. \n\n  </p>\n\n<p>For your brand identity to be effective, it is imperative that you understand the intended outcome of all the subtle information it sends out into the world. In this section of the book, we will focus on turning the core components of your brand identity into a presentation that deserves the attention of your target audience. \n\n  </p>\n\n<p>Lazy entrepreneurs limit their communication with consumers to traditional impression-based marketing techniques. They rely on taglines, catchy names, and other superficial branding schemes to create vague associations with their company. Small businesses should instead be educating the world about previously unknown or unavailable opportunities for personal happiness.\n\n  </p>\n\n<p>By learning how to be a better communicator, you will gain access to a wide new world of opportunities which are only available if you know how to talk in a way that makes others want to listen. Knowledge and ability can only take you so far. It is our relationships with others that make it possible for our individual actions to have greater meaning - but only if you master the art of influence. \n\n  </p>\n\n<p>Whatever the base of what you are trying to get across, it will only be amplified when you apply the fundamentals of good communication.</p>", 
    "end_date": null, 
    "title": "Brand Identity Breakthrough: Telling Your Story to the World", 
    "price": "20.00", 
    "instructors": "Gregory Diehl", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/864974_81e0_6.jpg", 
    "course_url": "https://www.udemy.com/brand-identity-breakthrough-module-3/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-31T18:56:39Z"
}