{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">My company is Harlem's Fashion Row (HFR). I started it from an idea in 2007. You can check out the NY Time Article in the Proof Section of the Course that will give you more information on Harlem's Fashion Row. </p><p style=\"\">*The price of this course will be $49 until July 12th. After this date, the cost will go up to $149.00. </p><p style=\"\">Just like you, I had little information on how to get sponsors for my events. However, the school of hard knocks has taught me many lessons and I'm sharing them ALL with you! My sponsors have included Verizon, Prudential, Target, Pandora Jewelry, Design Essentials, Marriott International, and Smartwater as sponsors for our events.</p>  <p style=\"\">  \t        Everything you need to secure sponsorships is here. It's what I use personally. I DONT HOLD BACK anything. I even share things that most people NEVER TELL. If I didn't include something, I will count on you to let me know. If possible, i will add it to the course or send it to you directly. I'm here and I get back to all students within 48 hours (however I try my best to get back to you in 24). </p>  <p style=\"\">  \t        I've done so many things wrong and made so many mistakes over the years. So, guess what? You can use my mistakes to your benefit because now I have an amazing sponsorship process that I use that makes my sponsors happy and keeps my events funded! Win/Win! Score!  </p>  <p style=\"\">  \t        Not only do I share everything I know with you, I show you my REAL sponsorship deck that resulted in over $100,000 in sponsorship. I also share a lot of other cool tip, scripts, and examples that you can put into use right away.</p><p style=\"\">  \t        All of my resources are shared with you. The attorney I use, my graphic artists, my PR company, and more are all given to you.  </p>  <p style=\"\">  \t    This course will be updated often as I receive feedback from you and what you need. I look forward to working with you! Sign up for this course now! The price will be $49 until July 12th. After this date, the cost will go up to $149.00. Others are selling this type of information for over a $1,000.00. Stop thinking of how sponsors can pay for your event and get started on the process now! Sign up and I look forward to interacting with you!</p>", 
    "end_date": null, 
    "title": "Brand Sponsorship: Step By Step Guide To Securing Sponsors", 
    "price": "20.00", 
    "instructors": "Brandice Daniel (formerly Henderson)", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380248_5d1f_3.jpg", 
    "course_url": "https://www.udemy.com/brand-sponsorship-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T19:25:54Z"
}