{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Buying and selling domain names</strong> is an exciting adventure that for some seems to conjure up images of finding hidden pirate treasure or guessing the winning combination on the next Powerball. Stories abound of domains that were purchased for $8 dollars 15 years ago being sold today for millions. Of course, that leads the more adventurous of us to wonder, “How can I do that?”</p><p>Well, the ocean is big. Your likelihood of cashing in on the motherlode is low, and you’re liable to waste a lot of time and money chasing after the wrong ships. You need a map or some other advantage to guide you toward that elusive booty.</p><p>Here are some tips to get you pointed in the right direction when trying to buy or sell a domain name for profit.</p><p>NARROW YOUR FOCUS</p><p>There are millions of domains already registered by someone and endless combinations of available domains to register, you should start by narrowing your focus.</p><p>What do you know about already that can make this easier? Do you know about pets, are you in car or home sales? Do you know about education or healthcare? Think about some of the spaces you are most familiar with and start there.</p><p>There is always a learning curve in buying domains with the purpose of reselling them. Don’t hesitate to ask a lot of questions to those who went before you, participate in forums.<br></p><p>What kind of materials are included?</p><p>14 Lecture's of video and audio</p><p>Will be updated every week to make it useful </p><p>How long will the course take to complete?</p><p>Just a one hour</p><p>Why take this course ?</p><p>Buying and selling domain is a huge dollar business </p><p>No one in this industry is going to give these Working secret's</p>", 
    "end_date": null, 
    "title": "Build a Business by Purchasing & Flipping Domain Names", 
    "price": "50.00", 
    "instructors": "Azar Udeen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/745114_c616_8.jpg", 
    "course_url": "https://www.udemy.com/build-a-business-by-purchasing-and-flipping-domain-names/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-28T19:43:35Z"
}