{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hey guys! Thanks so much for taking a look at my course. It really means the world to me :) </p><p>For those that don't know me, in my earlier days as a budding businessman and entrepreneur, I took my passion for wine and turned that into one of the biggest shows and channels on YouTube. That show landed me appearances on The Conan O'Brien Show, Ellen, CNN, etc. while amassing a social following of millions and establishing me as a \"guru\" (I'm not a guru) of sorts in the Social Media, Marketing, and Personal Branding worlds. From there, I became an early investor in platforms like Twitter, Tumblr, and Facebook and co-founded VaynerMedia, which is now a 600 person digital agency that represents the social presence of brands like Pepsi-Co, General Electric, and Anheuser-Busch InBev.</p><p>The biggest takeaway from my background is that I was able to take my passion and turn it into an actual career and I'd like to help you do the same. </p><p>My goal for this course is to help you define your passions and strengths and to provide you with the blueprint for what will be needed in order for you to establish yourself as a brand and thought leader in your respective interests.</p><p>This course will start with probably the most important anecdote, which is defining your strengths and understanding what you're best at. By knowing what you're good at and putting aside the rest, you'll be able to take whatever it is you want to develop a brand around and execute against it. </p><p>We're living in a very interesting time where anybody with the right balance of talent and ambition can make a name for themselves in any which way they please. But it's not for everyone and it's not going to be easy. The course is here to provide you with the framework and motivation to help you realize that with the right amount of passion, grit, and ambition, you can make a name for yourself around the things you care most about. </p><p>Thank you so, so much for taking this journey with me and for spending your time (our most precious asset) in participating in this course. </p><p>I hope you get everything you expect, and more, from it.</p><p>- Gary </p><p><br></p>", 
    "end_date": null, 
    "title": "Building a Personal Brand by Gary Vaynerchuk", 
    "price": "50.00", 
    "instructors": "Gary Vaynerchuk", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631678_f7b7.jpg", 
    "course_url": "https://www.udemy.com/building-a-personal-brand-by-gary-vaynerchuk/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T20:06:06Z"
}