{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t <strong>Content</strong>\r\n</p>\r\n<p>\r\n\t     The Building a Winning Start-Up course is a comprehensive and easy to follow guide to successfully launching and growing your business. The course is divided into 4 modules.\r\n</p>\r\n<p>\r\n\t     Module 1: Building a Strong Foundation\r\n</p>\r\n<p>\r\n\t <em>In this module you’ll have the opportunity to define your business idea, develop an identity and shape the internal structures and processes required to create a strong foundation for your business</em>\r\n</p>\r\n<p>\r\n\t     Module 2: Understanding Your Environment\r\n</p>\r\n<p>\r\n\t <em>This module will guide you through the process of supplementing the internal structures you developed in Module 1, with an understanding of your industry and target customers through market research and industry analysis</em>\r\n</p>\r\n<p>\r\n\t     Module 3: Number Crunching\r\n</p>\r\n<p>\r\n\t <em>Compiling and analyzing the right financial data is often a challenge for entrepreneurs. This module will create an opportunity to take the stress out of financial management by providing an opportunity to learn about profitability, forecasting and performance assessment</em>\r\n</p>\r\n<p>\r\n\t     Module 4: Communicating Your Value\r\n</p>\r\n<p>\r\n\t <em>Once you’ve invested time in building a strong foundation, understanding your environment and conducting financial analysis, you need to spend time sharing your ideas with those around you</em>\r\n</p>\r\n<p>\r\n\t     Each module includes assessments to test knowledge and templates to make it easy to apply the lessons learned to your own business.\r\n</p>\r\n<p>\r\n\t     The course takes approximately 1.5 hours to complete (includes time to complete quiz and knowledge checks).\r\n</p>", 
    "end_date": null, 
    "title": "Building a Winning Start-Up ", 
    "price": "50.00", 
    "instructors": "Juliana Taylor", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/114420_3d86_3.jpg", 
    "course_url": "https://www.udemy.com/building-a-winning-start-up/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-02T20:28:16Z"
}