{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Many of us chose to start a business to create a lifestyle of freedom and passion. Too often we realize too late that somehow we ended up trading one job for another.<br style=\"\"></p><p style=\"\">If you&#039;re still trading your time for dollars - if you don&#039;t have systems in place - if you ARE the business, then you&#039;re really not building a business. You&#039;re creating a job that no one is going to want.</p><p style=\"\">And that&#039;s a problem. </p><p style=\"\">You see, I&#039;ve worked with owners who got sick. Or others who needed to move to a new area. Or some who just decided they needed to change careers. </p><p style=\"\">But they had little options.</p><p style=\"\">It&#039;s said in the business brokering industry (these are folks who buy / sell businesses every day) that 4 out of 5 businesses don&#039;t sell.</p><p style=\"\">In reality it&#039;s been my own personal experience that the numbers are more like 9 out of 10. And worst of all it typically takes 6 to 8 months to sell a business - that&#039;s one that DOES sell.</p><p style=\"\">We&#039;re going to cover -</p><ul style=\"\"><li>What is the one site you do NOT want to advertise your business for sale</li><li>Make sure you have this document signed or you may just lose your business</li><li>How can you make that you get the most value for your hard work<br style=\"\">and much more!<br style=\"\"></li></ul><p style=\"\">Since 2006, I&#039;ve been helping business owners with their planning and strategy. Over the years I&#039;ve learned that these hard working folks really do support our economy. But unfortunately it also means that they often don&#039;t benefit from their hard work because they are missing just a few key pieces of the puzzle.</p><p style=\"\">Now it&#039;s my job to help entrepreneurs and small business owners to see how their business isn&#039;t just a way to serve their customers. But it can also serve as a vehicle to reach the success and freedom that they&#039;ve always dreamed of.</p><p style=\"\">This course is for educational purposes <strong style=\"\"><em style=\"\">only</em></strong>. Everyone should seek legal and financial advice from professional advisers. (Photo: Ramin Hossaini)<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Build a Business That You Can Sell", 
    "price": "20.00", 
    "instructors": "John Chang", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/445254_9e2d_5.jpg", 
    "course_url": "https://www.udemy.com/build-a-business-that-you-can-sell/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T22:13:28Z"
}