{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>(NEW COURSE JUNE 2015! Includes 1 year FREE for a custom domain e-commerce site! Over $100+ extra value!) </strong></em></p><p><em><strong></strong></em><em><strong>Build a monetized website, blog, e-commerce store (worldwide), and social media following in just 2 hours - all for under $20 per year.</strong></em></p><p><em><strong></strong></em>A comprehensive guide to building a brand and making money online, my course is for the <strong>casual blogger to the serious entrepreneur</strong> who wants to make a name for themselves. Learn how to apply my formula - combining strategic advertising, social media tricks, e-commerce, and branding - to create a personal empire that brings you passive income and makes you a boss of the internet. </p><p><strong>D</strong><strong>iscover how quick and easy it is to build a business or a personal brand with great SEO and real revenue.</strong></p><ul><li><span></span><strong>Organize</strong>: Build a searchable website, blog, social media presence, and e-commerce store for under $20/year.</li><li><strong>Monetize</strong>: Make money on your new website, blog, and e-commerce store.</li><li><strong>Give</strong>: Post incredible content and get more followers on social media.</li></ul><p>Make money just by being yourself online. There's a reason why this course is called \"<strong>Empire In A Box</strong>.\" You'll understand how branding, advertising, design, and e-commerce come together to make you internet royalty - <em>and</em> best of all, I walk you through the process step-by-step!</p><p><strong>Contents &amp; Overview</strong></p><p>This course teaches you exactly what you need to <strong>start making money online</strong>, and shows you how to get the things you need. It's a powerful step towards establishing your <em><strong>authority</strong></em> and <em><strong>fame</strong></em> on the internet. In a few short hours, you'll master tried &amp; true methods to monetizing<em> and</em> branding. You'll make your blog posts and social media profiles more popular, because looking good is feeling good.</p><p>By the end of this course, you'll be using <strong>internet advertising, productivity apps, and e-commerce</strong> to make a passive, supplementary income online. You'll have a <strong>shiny new website, blog, online store</strong> (I help you find a product to sell), and <strong>popular social media profiles</strong>.</p><p>Whether you're an entrepreneur or artist, whether you dream of fresh laundry or world domination, this is a <strong>fun</strong> course that will teach you the essentials of making money online, so you can finally take your long-awaited submarine voyage, or provide a bigger home for your 23 rescue cats. In other words, so you can finally spend more time on the things you love.</p><span></span><strong></strong>", 
    "end_date": null, 
    "title": "Build a Popular & Powerful Business or Personal Brand Online", 
    "price": "50.00", 
    "instructors": "Justine Ariel", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499450_3923_5.jpg", 
    "course_url": "https://www.udemy.com/empire-in-a-box-build-a-brand/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T23:07:01Z"
}