{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you're starting, running or growing a company, two of the most important success factors are your <strong>people</strong> and your <strong>company culture</strong>. They can be your greatest assets, or your biggest liabilities. <strong>So why do so many companies pay little to no attention to it?</strong></p><p>Company culture is a hot topic today, but much of the information out there is either fragmented, lacks context, or is filled with  truisms like \"<em>Company culture is really important!\" </em> That's inspirational, but not really helpful.</p><p>In this comprehensive, hands-on, and highly visual course, I teach you EVERYTHING there is to know about company culture, and getting it work for you:</p><ul><li><strong>WHO's</strong> getting it right, who got it oh so wrong, and what can we learn from them</li><li><strong>WHAT</strong> culture really is, what contributes to it, and what's killing your culture right now</li><li><strong>WHY</strong> it's so important, and why so many companies succeed or fail because of it </li><li>and most importantly, <strong>HOW</strong> you can begin building a kick-ass culture of your own – or start fixing an already broken one – starting right now!</li></ul><p>It's no coincidence that great companies also have kick-ass cultures, and they enjoy substantial benefits over those who don't! Benefits like:</p><ul><li><strong>Over 35% less frequent turnover </strong>(you spend a lot of time, money and effort on your superstar employees, can you afford to lose them that easily?)</li><li><strong>Happy, motivated and productive employees </strong>(yes, they DO exist, and with a kick-ass culture they'll find YOU)</li><li><strong>Less headaches, distractions and legal issues </strong>(are your employees forming cliques? Do you have time to constantly deal with complaints and conflicts, or tell people to just get along? I didn't think so</li></ul><p>My goal isn't to just <em>inform</em> you, but to <em>educate</em> you. So in addition to the lectures, I've also included useful tips, step by step guides, and worksheets as part of an exclusive <strong>10 Week Action Plan</strong> to walk you through the building process. These are some of the same tools I use in my successful consulting practice, helping entrepreneurs across North America &amp; Europe to build their own kick-ass company cultures.</p><p>Each day you work without a great culture is another day removed from building the company of your dreams. So what are you waiting for?</p><p>I'm so confident that this course will give you what you need to build a kick-ass culture intentionally – and not accidentally – that I'm offering a <strong>30 day, no questions asked, money back guarantee</strong>, so you have nothing to lose. Nothing except a a mediocre culture, that is!</p><p>So don't delay, ENROL NOW!</p>", 
    "end_date": null, 
    "title": "Build Your Dream Company with a Kick-Ass Culture!", 
    "price": "25.00", 
    "instructors": "Glenn Nishimura", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402388_ef4f_7.jpg", 
    "course_url": "https://www.udemy.com/build-your-dream-company-with-a-kick-ass-culture/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-23T18:01:59Z"
}