{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em style=\"\">Learn how to grow your bottom line by following a proven step-by-step, results oriented, sales generating system that won’t break your bank or blow up your budget.</em>  </p>  <li> Do you find that you’re struggling with increased competition?</li>  <li> Not generating as many leads as you&#039;d like?</li>  <li> Have your costs skyrocketed over the past few years?</li>  <li> Are you finding it more and more expensive to reach less and less customers?</li>  <br style=\"\">  <p>  \t                          If you answered yes to any of those questions, you’re not alone. The good news though, is <strong style=\"\">it doesn’t have to be this way</strong>.  </p>  <p>  \t<img style=\" margin:5px; margin-right:0px; max-width:100%;\" alt=\"\" src=\"http://archeratlas.com/img/bundle.png\" width=\"325\" height=\"214\" align=\"right\">  </p>  <p>  \t                            In this course, leading business growth expert and best-selling author Archer Atlas shares a business development, sales growth, and marketing system designed to help you achieve specific and positive results in five major areas: positioning &amp; differentiation, lead generation, conversion, transaction value, and purchase frequency.  </p>  <p>  \t                            You’ll find time tested and true, results oriented tactics and strategies that can truly help you grow your sales and bottom line, all without breaking the bank or ballooning your budget.  </p>  <p>  \t<strong style=\"\">INSIDE YOU WILL DISCOVER:</strong>  </p>  <li> The REAL reasons you’re not generating as many leads as you can.</li>  <li> How to get your marketplace to “raise their hands” and pay attention.</li>  <li> How virtually any business can increase their bottom line profits at least 14% with three small and painless tweaks.</li>  <li> Why it seems most buyers aren’t buying from you, and what you can do to change that.</li>  <li> How to completely subvert your competition and win over their customers and clients.</li>  <li> The way to really make your business stand out in a cluttered, “me too” marketplace.</li>  <li> How to reduce the amount of money you’re wasting on marketing and advertising, while still increasing your bottom line.</li>  <li> Why right now—in the midst of hard economic times—you have a golden opportunity, and how you can take advantage of it.</li>  <li> How to get a seemingly never ending stream of prospects and qualified leads to come to you… and plead for you to take their money.</li>  <li> The best way to retain your current customers and have them come back over and over.</li>  <li> And much more.</li>  <br style=\"\">  <p>  \t                        The solutions you’ll discover inside <strong style=\"\"><em style=\"\">&quot;Building Your Business Without Breaking the Bank&quot;</em></strong> might just be the key you’ve been missing to help grow your business significantly.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">What kind of materials are included?</strong>  </p>  <p>  \t                            17 detailed, yet concise lectures spanning 9 sections and over 3.5 hours.  </p>  <p>  \t                            PDF presentations slides for all lectures.  </p>  <p>  \t                            A workbook that condenses the main points of each section and contains thought-proving questions to better help you actually use the material of the course in your business.  </p>  <p>  \t<strong style=\"\">How long will this course take to complete?</strong>  </p>  <p>  \t                            The lectures themselves run a little over 3.5 hours in length, yet the evergreen material within can be used now, later, or for the rest of your life to serve you in growing your business, getting more customers &amp; clients, more sales, and more bottom line profits.  </p>  <p>  \t<strong style=\"\">How is this course structured?</strong>  </p>  <p>  \t                            There are 17 lectures, each with a PDF containing its presentation slides. There&#039;s also a workbook with thought-provoking questions to help you apply the material to help grow your business, in real life.  </p>  <p>  \t<strong style=\"\">Why take this course?</strong>  </p>  <p>  \t                            Simply, because your time has come. Your time to start really growing your business and getting more customers, more clients, higher sales and revenue, more bottom line profits and cash injected into your business and bank account has come. Isn&#039;t time you really start growing your business and enjoying all that comes with it? The path to truly enjoying the fruits of your labor is just a click away. That&#039;s why you should absolutely take this course.  </p>", 
    "end_date": null, 
    "title": "Build Your Business Without Breaking the Bank", 
    "price": "20.00", 
    "instructors": "Archer Atlas", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/155996_168d_13.jpg", 
    "course_url": "https://www.udemy.com/build-your-business-without-breaking-the-bank/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-31T15:47:56Z"
}