{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Last Updated December 2015: </p><p>As a Best Selling Author, Artist &amp; Entrepreneur I've sold over 300,000 albums worldwide over 1,000,000 singles and toured over 19 different countries. </p><p>Building an email list has been the catalyst to growing my info product business online as well as my music business.</p><p>I've spent countless hours building a platforms on social media sites only to have the carpet pulled from underneath me because I don't OWN that website.</p><p>With an email list you have direct access to your subscribers and potential customers that no one else can take away from you.</p><p>In this course you will learn how to use an email service provider and start building your email list from scratch.</p><p>I will also cover some of the latest techniques for sending emails as well as getting people to subscribe to your list without emptying your wallet in the process.</p><p>I have put this course together for you - to which you have full lifetime access, including all the updates, for free. </p><p>I \"take you step by step through my system of acquiring email subscribers, sending them emails and using your list to make money.  Everything is in simple detail with videos and written support lectures plus you get access in the discussion form to ask any questions. </p><p>See how easy it really is to start building an email list. </p><ul><li>Learn How To Setup An Account With Mail Chimp</li><li>Send and schedule emails including Autoresponders</li><li>Setting up Optin Pages On Your Site</li><li></li><li>... and my help and assistance to Udemy students is legendary</li></ul><p>+++++++++++++++++++++++++++++</p>", 
    "end_date": null, 
    "title": "Build An Email List & Build Your Business", 
    "price": "20.00", 
    "instructors": "Christopher Greenwood", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687950_f9a9_3.jpg", 
    "course_url": "https://www.udemy.com/smartemailmarketing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T13:53:23Z"
}