{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>I have an Executive MBA with a focus on Leading Innovation.  I have attended a Masterclass with the author of both Business Model Generation and Value Proposition Design.  During this class, I was also fortunate to meet the father of Lean Startup and Customer Development -- Steve Blank!  I am now taking what I learned in my career and am creating courses to help others innovate their business models and succeed in the ever changing markets of today!</strong></p><p><em>LATEST: Course Updated for December 2015</em></p><p>Enrol today and learn tools and techniques used by <em>Fortune 500</em> companies and leading <em>Silicon Valley Startups</em> to create products and business models that succeed.  <em><strong>Anyone</strong></em> can learn these techniques -- even if you are young and starting your first company or a seasoned Executive.</p><p>You will learn about the <em>Business Model Canvas</em> and go beyond with in-depth instruction on <em>Customer Development</em> and the <em>Value Proposition Canvas</em> -- key topics to create <em>successful</em> <strong>Product Market Fit</strong><strong>!</strong></p><p>I have worked with Venture Capitalists, Executives, and Startup founders with the same tools and techniques taught in this course.  I will teach the theory and also show you <strong>practical examples </strong>of how to use the tools.</p><p>I also want to make sure you succeed and will respond to all messages in the discussion forums.  Where possible we will use the students questions as added practical examples to the course material -- and<strong> you will have lifetime access to all this new content!</strong></p><p>As with all courses on Udemy, you have 30 days to ask for a refund -- <em>no questions asked</em> -- if you do not see the value in this course.  But, I know if you are dedicated to stick to all the lectures and complete the homework, <strong>you will be amazed at how awesome these tools are.</strong></p><p><strong>About the Course:</strong></p><ul><li>Over 30 high-quality lectures taught by a seasoned MBA professional </li><li>Learn three tools used by both successful Fortune 500 and Silicon Valley startup companies</li><li>The step-by-step teaching method will ensure you fully understand all of the concepts</li><li>These easy-to-use tools will improve your business model development, new product development, and creation of services in your business</li><li>The course uses simple examples and builds to examples of companies you know well</li><li>All of the materials in the course are free to use and everything you need is provided</li><li>Lectures and Resources will be added to this course on a continuous basis -- so you really get a lifetime value from this course</li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Build a Winning Business: Idea to Profit with 3 Simple Tools", 
    "price": "50.00", 
    "instructors": "Aaron Alsop", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650798_bb55_3.jpg", 
    "course_url": "https://www.udemy.com/succeed-just-as-fortune-500-and-silicon-valley-startups-do/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T01:32:09Z"
}