{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">In this course, you will learn how to organize, articulate and implement business ideas using the business model canvas which was created by Alex Osterwalder and Yves Pigneur in their top seller book &quot; Business Model Generation &quot;. This tool is considered the world&#039;s leading tool in creating and analyzing business models. Instead of starting with a complex business plan, you will learn how to easily sketch out your ideas visually and articulate them in a language anybody can understand.</p><p style=\"\">Business Model Canvas 101 will:</p><ul style=\"\"><li style=\"\">Explain clearly how to use the business model canvas tool</li><li style=\"\">Explain how to apply the tool and start your very own business model today </li><li style=\"\">Engage you with colorful visual content instead of bullet points</li><li style=\"\">Deepen your knowledge using real examples like Airbnb, Flicker and other </li><li style=\"\">Test your knowledge with short fun quizzes and challenges</li><li style=\"\">Answer your questions using the active discussion board </li><li style=\"\">Gain access to all the downloadable resources &amp; instructions you need</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\"> At the end of the course you will be a business model pro, with the knowledge of creating and analyzing business modes, and the confidence to articulate them to anyone!</p> <p style=\"\">Business Model Canvas 101 has 30 days money back grantee. You are risk free so why not give it a try today?</p>", 
    "end_date": null, 
    "title": "Business Model Canvas 101 - Masterclass 2016", 
    "price": "20.00", 
    "instructors": "Emad Saif", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505804_2d5b_8.jpg", 
    "course_url": "https://www.udemy.com/innovate-your-business-model-in-just-1-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T04:58:00Z"
}