{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In about two and a half hours of content over 40 concise video lectures and worksheets you will learn how to implement easy practical actionable tactics and concepts you can use to grow your business by expanding your relationships. Face-to-face networking is ideal for new or established local service providers and entrepreneurs who want to create inexpensive powerful word-of-mouth advertising that will take you From Business Card to Business Success.</p>  <p>Including :</p>  <p>The Fundamentals of Relationship Building </p><p>Importance of Business Cards as a Contact Tool<br></p>  <p>Finding Formal and Informal Networking Opportunities Everywhere</p>  <p>How to Share Information About You and Your Company, Product or Service</p>  <p>How to Identify Your Ideal Client or Customer</p>  <p>Understand and Communicate What a Good Lead Is for You</p>  <p>Build and Project Your Brand Image</p>  <p>How to Enter and Leave a Conversation</p>  <p>Multiply Your Efforts by Establishing Business Allies and Working With a “Wing Man”</p>  <p>Special Information for Local Service Providers, Introverts and Employees</p>  <p>Shameless Self Promotion</p>  <p>Following Up With Contacts</p>  <p>Creating a Plan</p>  <p>You won't want to miss this chance to find out how to easily increase your business opportunities and make more money, presented by experienced networking group coordinator Reno Lovison, author of “Turn Your Business Card Into Business” sharing over 25 years of successful entrepreneurial experience. </p>", 
    "end_date": null, 
    "title": "Business Networking / Face-to-Face Relationship Building", 
    "price": "40.00", 
    "instructors": "Reno Lovison", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374700_720e_2.jpg", 
    "course_url": "https://www.udemy.com/business-networking/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T22:49:38Z"
}