{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">UPDATE: Now more than 1000+  students enrolled in this course!</strong></p><p><strong style=\"\">__________________________________________________________________________</strong></p><p>  \t<strong style=\"\">            Have you been dreaming of your own business?  </strong>  </p>  <p>  \t              Have you caught yourself on self doubt and asking questions like  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">how do I start my business?</strong></li>  \t<li style=\"\">do I need to quit my job?</li>  \t<li style=\"\">how to plan my business?</li>  \t<li style=\"\">should I do this alone?</li>  </ul>  <p>  \t              You can get these questions and more answered in this course.  </p>  <p>  \t<strong style=\"\">This course will help you get off the ground with your first business adventure.</strong>  </p>  <p>  \t              At the end of this course you will know:  </p>  <ul style=\"\">  \t<li style=\"\">How to shift your mind from employee to entrepreneur</li>  \t<li style=\"\">How your background influences you</li>  \t<li style=\"\">How to create business ideas</li>  \t<li style=\"\">How to turn ideas into business models</li>  \t<li style=\"\">How to plan your business</li>  \t<li style=\"\">What to focus on at the start of your business</li>  \t<li style=\"\">How to select business partners</li>  </ul>  <p>  \t<strong style=\"\">This course is will help you successfully start your business.</strong>  </p>  <p>  \t              There are other courses out there about growing a business but this one focuses on getting off the ground.  </p>  <p>  \t              You will lean some essentials on digging business ideas, turning ideas into business models, planning a business, carefully selecting partners and more.  </p>  <p>  \t<strong style=\"\">  This course in a form of hacks - simple applicable tactics to raise your chances in success in your first business adventure.  </strong>  </p>  <p>  \t              Every hack in this course was <em style=\"\">extracted from a life experience </em>either mine or a close friend&#039;s. Every hack is the meaning of what happened. And they can be applied to any business. So either you are planning or doing some business online or offline it will be benefitial to you. The course includes real life stories.  </p>  <p>  \t              In addition you will get actionable items in form of spreadsheets and links to resources I found helpful.  </p>  <p>  \t              If after taking the course you won&#039;t find this material useful to you, you have <strong style=\"\">a full 30 day money back guarantee</strong>.  </p>  <p>  \t              You are also getting a lifetime access to all the lectures in this course and future updates and bonuses.  </p>  <p>  \t<strong style=\"\">I will be happy to answer your questions on starting your business! </strong>  </p>  <p>  \t              It might come in form of questions, not answers -  I prefer coaching than instructing.  </p>  <p>  \t<strong style=\"\">Join me on this course!</strong>  </p>  <p>  \t              Best,  </p>  <p>  \t              Kornel  </p>  <p>  \t              PS: The <strong style=\"\">$19</strong> price is an <strong style=\"\">initial</strong> offer to build students and reviews.I believe this course can bring you much more in savings and profits in your business adventure.I plan on raising the price in the near future, as more content will be added soon.  </p>  <p>  \t              If you want to take advantage of the initial price, <strong style=\"\">sign up now</strong>!  </p>", 
    "end_date": null, 
    "title": "Business Hacks: Learn how to succeed in your first startup", 
    "price": "20.00", 
    "instructors": "Kornel Kulisiewicz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386848_9378_2.jpg", 
    "course_url": "https://www.udemy.com/hacks-to-start-your-own-business-and-succeed/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T17:21:15Z"
}