{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t  There is a reason and a formula for why people attract clients, retain clients and receive referrals.   Only a small portion of those reasons and that formula have anything to do with the &quot;numbers&quot; game of sales and outreach.   The information in this course is something you will not hear in sales training course.    In this program you will learn the real secrets to attracting, retaining and getting client referrals .  It is an energy game, and everything about who you are in the business development process and in the world.   In this course you will learn how to magnetize clients into your business.  You will understand why clients stay, and why they refer others to you.  You will learn how to master that magnetism.   You will learn all the secrets that those who are successful in Business Development already know and use.\r\n</p>\r\n<p>\r\n\t  Additionally In this course you will learn tried and true strategies that cultivate success business development.  You will develop a perspective and a process that inspires people to want to work with you.  You will learn how strong your aptitude is for this type of role, and how to make adjustments for your vulnerable areas.   You will learn how to create balance so that your business will empower you to be not only the best in your business but the best you in your life.\r\n</p>\r\n<p>\r\n\t       You will learn the &quot;W&#039;s&quot; of business development, mind, body spirit integration, and how that translates to a great income and a great life.\r\n</p>\r\n<p>\r\n\t  This is the last course you will ever need to expand your business and your income.   If you consume the principles in this course, you will be a star in your own life and in your business.\r\n</p>", 
    "end_date": null, 
    "title": "Business Development for Entrepreneurs and Creative Thinkers", 
    "price": "40.00", 
    "instructors": "Phyllis King", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49264_c60f_10.jpg", 
    "course_url": "https://www.udemy.com/business-development-for-entrepenuers-and-creative-thinkers/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-10T18:10:08Z"
}