{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>You <strong>want FREEDOM.</strong><em><strong></strong></em></p><p>You <strong>have SKILLS.</strong><span></span></p><p>You want to <strong>be your own BOSS.</strong></p><p><strong>Business Bootcamp is your place to start, grow or scale a business of your own.</strong></p><p><em>Are you tired of your day job? </em><br></p><p><em>Do you hate having a boss breath down your neck?</em></p><p><em>Do you want to make more money and charge what you're truly worth?</em></p><p><em>Do you want more freedom to take time off, go on longer vacations, and enjoy life?</em></p><p>If you answered <strong>yes</strong> to any of these questions, <strong>you're in the right place.</strong></p><p><strong>I've been where you are right now. </strong>I know how hard it is to wake up each morning to go to a job you hate. I know how it is to be drowning in debt, working a job that doesn't pay me what I'm worth. I know how it is to start a freelance business without a following or website.</p><p><strong>But...</strong><br></p><p>After many years of research, experimenting, failures, and success, I am now running my own 6-figure per year business doing what I love each and every day. <strong>And I want to show you exactly how I do it.</strong></p><p>This course walks you through the entire process of creating your own business from scratch. We start by defining your craft and choosing a skill of yours that will be the best for your business. We'll follow it up with market research to find your target audience and competition. We'll then build a website (learning from scratch) and capture leads with a foolproof sales funnel system. We'll learn how to find your first clients (and your next ones). Then we'll take it to the next level and learn how to properly run a business and grow it to 6-figures per year.</p><p><strong>Guides, samples, and templates included! </strong>This course includes downloadable resources that will help you with contracts, proposals invoicing and more.<br></p><p>After 7 weeks, will you be making $100,000 per year? <strong>Probably not.</strong></p><p>After 7 weeks, will you know <em>how to make $100,000 </em><em>per year?</em> <strong>Yes.</strong></p><p>After 7 weeks, will you be on the path to making $100,000 per year? <strong>Yes, if you put in the work.</strong></p><p><strong>ARE YOU READY TO TAKE ACTION?</strong></p><p>Enroll now, and we'll dive right in.</p><p>Phil</p><p><span></span></p>", 
    "end_date": null, 
    "title": "Business Bootcamp: 7 Weeks to Start Your Own Business", 
    "price": "20.00", 
    "instructors": "Phil Ebiner", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792598_132f_5.jpg", 
    "course_url": "https://www.udemy.com/business-bootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T17:07:18Z"
}