{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">LATEST: Course Updated August 2015</strong>  </p>  <p style=\"\"><strong style=\"\"><em style=\"\">I really like the course. I worked on my business plan while listening to the lessons, step by step. It is very clear, and it has several examples so it helps a lot! - Coralie (Student)</em></strong></p><p style=\"\"><strong style=\"\">Join Over 5,400 Students Already!</strong></p><p style=\"\"><em style=\"\"><strong style=\"\">Business Pitch Template: To Supercharge Your Business Idea!</strong></em></p><p style=\"\">Are you interested in creating a viable business pitch presentation in a matter of minutes? Do you want to pass your message to investors in a succinct and interesting way? Or maybe you want to create a business pitch for the purpose of raising funding? Do you have 1 hours to learn?</p>  <p style=\"\">  \t                                                    Whatever your motivation, I am happy to offer you a front row seat on my premier online course<em style=\"\"><strong style=\"\"> &quot;Business Pitch Template: To Supercharge Your Business Idea!&quot;</strong></em>. My course will get you there quickly and efficiently.  </p>  <p style=\"\">  \t<strong style=\"\">                  This course comes with a 30-Day Guarantee!  </strong>  </p>  <p style=\"\">  \t                                                    Warning! If you are looking for a path to quick riches, a road paved with get rich quick fixes and powered by a desire for easy wealth, well, this is not the course for you. In fact do not attempt to register for this course if your goal is to become the next billionaire in the next two hours. Please do not waste your time here. Please run along because this course is not the answer to your get-rich-quick- pursuit.  </p>  <p style=\"\">  \t                                                  On the other hand, if you are looking to create a business pitch that will provide lasting benefits, then come along, I designed this course for you.  </p>  <p style=\"\">  \t                                                    This course requires someone to study, research and follow through with hard-work. Your success will depend on your tenacity and your will to succeed. The good news is that if you follow the simple instructions laid out in this course you will create a winning business pitch!  </p>  <p style=\"\">  \t<strong style=\"\">                This PowerPoint Business Pitch Template is:  </strong>  </p>  <ol style=\"\">  \t<li style=\"\">Quick &amp; easy to write</li>  \t<li style=\"\">Useful to generate start-up/growth capital</li>  \t<li style=\"\">Able to stimulate investors interests</li>  \t<li style=\"\">Able to help you create a template for running your business</li>  \t<li style=\"\">An effective tool to qualify your idea</li>  \t<li style=\"\">Able to help you sharpen your presentation skills</li>  \t<li style=\"\">A first step towards a comprehensive plan</li>  </ol>  <p style=\"\">  \t                  I will walk you through the entire process you need to create a viable business pitch that can work for a variety of needs.  </p>  <p style=\"\">  \t<strong style=\"\">In this course I will show you the following</strong>  </p>  <ol style=\"\">  \t<li style=\"\">How to create a solid business background format</li>  \t<li style=\"\">How to calculate how much you need for the business</li>  \t<li style=\"\">How to present your failures in a positive fashion</li>  \t<li style=\"\">Understanding your niche and opportunities</li>  \t<li style=\"\">How to structure your business idea</li>  </ol>  <p style=\"\">  \t                                          They say a fool learns from their own mistakes, and the wise learn from the mistakes of others, I say get it right the first time, and the question of mistakes will not arise. I have eliminated all the fool-stops in the way to help you create a solid but simple business pitch.  </p>  <p style=\"\">  \t                                          What are you waiting for?  </p>  <p style=\"\">  \t<strong style=\"\">Enroll Now</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Every Second You Delay Is Actually COSTING YOU from Supercharging Your Idea!</strong>  </p>", 
    "end_date": null, 
    "title": "Business Pitch Template: To Super Charge Your Business Idea!", 
    "price": "40.00", 
    "instructors": "Boomy Tokan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363164_a5d4_3.jpg", 
    "course_url": "https://www.udemy.com/supercharge-your-idea-use-a-simple-business-plan-template/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T16:55:31Z"
}