{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Learn the Business magic techniques used for success over the past 50,000 years and still used today by the world&#039;s leading organisations. Apply this knowledge and you will succeed in business. These skills and techniques have been protected throughout the ages and here for the first time we reveal them to you. </p><p style=\"\">The course consists of 10 lectures delivered in a logical video format over 1 hour that will equip you  with the tools and knowledge to succeed in business.</p><p style=\"\"><strong style=\"\">If you are a busy entrepreneur with limited time and are serious about changing your life and being a success $100 is nothing to invest in your future.</strong></p><p style=\"\"><strong style=\"\">ABOUT THE INSTRUCTOR</strong></p><p style=\"\">Merlin Theofrigll is Anthony Stone&#039;s mentor and has successfully run many companies over the past 30 years and has consulted for over 1200 clients since 1989. Merlin set up Xpress travel 1993-1995 which was Airtours&#039; largest independent travel agent employing 46 people. Xpress travel turned over £15m a week. Merlin ran a chain of 75 restaurants and opened 55 and ran 4 hotels. Merlin&#039;s mentor John Chiswell ran the advertising and marketing company that made McDonalds the success it is today and the recipe for success has been passed down.</p><p style=\"\"><strong style=\"\">ABOUT THE COURSE</strong></p><p style=\"\">The course consists of 10 video presentations structured in a fun informative way that equips you with the necessary knowledge and mindset to succeed in business and in life.</p><p style=\"\">By the end of the course you will understand how to;</p><p style=\"\">a. Follow the rules of success</p><p style=\"\">b. Reprogram yourself to have  a positive mindset</p><p style=\"\">c. Understand why business fails</p><p style=\"\">d. Raise funds and start up capital to your business success</p><p style=\"\">e. Discover the magic secret in business what no one will tell you </p><p style=\"\">f. 3 days to programme yourself to positive thinking</p><p style=\"\">g. Change your viewpoint leading to a winning strategy</p><p style=\"\">h. Psychology of business giving you a competitive advantage</p><p style=\"\">i. Visualisation leading to obtaining your goals</p><p style=\"\">The 10 lectures have a total duration of 1 hour including the supplementary information of a further 2 hours and are designed in a logic way to prepare you to start your journey as a successful entrepreneur.</p><p style=\"\"><strong style=\"\">STUDENT REVIEWS</strong></p><p style=\"\">&quot; I really enjoyed this course. It&#039;s short but filled with nuggets of invaluable information. The course is like goldust for anyone starting a business and the lessons are amazing especially the &quot;Mindset&quot; and &quot;Psychology&quot; of business lectures. Recommended.&quot;  Kevin Davis - London UK</p>", 
    "end_date": null, 
    "title": "Business Magic For Funding Development and Success", 
    "price": "20.00", 
    "instructors": "Anthony Stone", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475764_5d01_6.jpg", 
    "course_url": "https://www.udemy.com/business-magic-for-funding-development-and-success/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T07:41:44Z"
}