{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\">Solopreneur Business Success - Level 1</strong> is the essential course for anyone who wants to build a successful business either as a coach, and information product developer or a creative consultant.</p><p style=\"\"><em style=\"\"><strong style=\"\">If you can&#039;t get traction in your business</strong></em> - this course will help you pinpoint the problem and solve it.</p><p style=\"\"><strong style=\"\"><em style=\"\">If you find yourself constantly distracted (shiny object syndrome) </em></strong>- this business course will help you diagnose the source of your problem and teach you how to develop blinders so that you are no longer distracted.</p><p style=\"\"><strong style=\"\"><em style=\"\">If “brain fog&quot; is your number one problem</em></strong>, not only with Solopreneur Business Success Level 1 give you clarity it will light a fire under you so that you no longer lose your way.</p><p style=\"\">I have taught this course live as a bootcamp in the past and students have been blown away by the eye-opening insights of the course. <em style=\"\"><strong style=\"\">You owe it to your business to get clarity and start moving forward with purpose.</strong></em></p><p style=\"\">I truly believe this course will give you the direction you need to grow a successful business. </p><p style=\"\"><strong style=\"\"><em style=\"\">Imagine knowing each day exactly what you need to do to grow your business and being excited to hit your goals.</em></strong></p><p style=\"\"><br style=\"\"><strong style=\"\"><em style=\"\">Here&#039;s the Secret: You need to create a &#039;map&#039; for your business. </em></strong></p><p style=\"\"> This map will tell you who you are serving and how to best serve them in a way that is rewarding for you and welcomed by your customers. You want raving fans? This course will help you create a business that your customers love!</p><p style=\"\"><strong style=\"\">Curriculum Overview:</strong></p><p style=\"\">Step 1 - Understand the role your business plays in your life</p><p style=\"\">Step 2 - Define your personal business rules</p><p style=\"\">Step 3 - Get the inside track with your customers by really getting to know them</p><p style=\"\">Step 4 - Create a massive action plan that will boost your business like no other plan has before</p><p style=\"\">Step 5 - Develop a tracking system so you know exactly what is working and what is throwing you off track</p><p style=\"\">Each section has Action Exercises and worksheets to help you develop your own personal plan.</p><p style=\"\">BONUS - You will get complimentary access to my book Niche Marketing Explained. This book will show you exactly how to dive into your niche and understand how to get your audience to read your messages and take part in your specials.</p><br style=\"\"><strong style=\"\">Click Enroll Now and get started today.</strong>", 
    "end_date": null, 
    "title": "Business Success - Business Planning is Not Rocket Science", 
    "price": "20.00", 
    "instructors": "Julie Ann Price", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609038_d571_5.jpg", 
    "course_url": "https://www.udemy.com/business-success-planning-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T12:02:28Z"
}