{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h4><strong style=\"\">  Business Plan - Learn why a business plan is the key to business success</strong></h4>  <p>  \t<strong style=\"\">Do you operate haphazardly or do you have a business plan?</strong>  </p>  <p>  \t<strong style=\"\">Learn why a business plan is the key to business success</strong>  </p>  <p>  \t       Unfortunately most small and medium-sized enterprises (MSME) operate  in a haphazard manner. The only situation when they actually work on a  business plan is when trying to obtain financing from the bank. After  that, the business plan mostly ends up in a drawer somewhere.  </p>  <p>  \t       However, a business plan is in fact a guarantee for your business’ success.  </p>  <p>  \t       But unfortunately a lot of small businesses still work without a  plan, which is also the reason why there are so many bankruptcies.  </p>  <p>  \t       The more you’ll engage yourself with the training, the more successfull you’ll become.  </p>  <p>  \t<strong style=\"\">With a business plan you will be able to follow certain strategies to successfully reach your goals.</strong>  </p>  <p>  \t       Is your business successfull yet? Are you operating with a plan? Or do you work haphazardly?  </p>  <p>  \t       Create your own business plan now and start to work systematically and structured in order to achieve the success you deserve.  </p>  <h4>It´s high time to think again</h4>", 
    "end_date": null, 
    "title": "Business Plan - Learn why a business plan is the key", 
    "price": "20.00", 
    "instructors": "Henning Glaser", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419334_ecb8_2.jpg", 
    "course_url": "https://www.udemy.com/business-plan-create/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T15:23:58Z"
}