{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Having a Passionate Idea is a Good Start, But Turning that Passion into a Successful Business Venture is Where the Fun Really Begins</strong>  </p>  <p style=\"\">  \t    - Do you want to build a successful start-up business?  </p>  <p style=\"\">  \t- Are you wondering how the other entrepreneurs did it?  </p>  <p style=\"\">  \t    - Have an idea, innovation or just a passion for a particular business concept?  </p>  <p style=\"\">  \t    - Are you struggling to move to the next level with your business plan?  </p>  <p style=\"\">  \t    - Need a business modeling tool to boost your potential or chances of becoming more organized, strategic and profitable?<br style=\"\">  </p>  <p style=\"\">  \t    Did you answer yes to any of the above? Then this is certainly the course for you and you probably don&#039;t have to read any further but instead only need to enroll now!  </p>  <p style=\"\">  \t        I&#039;ve heard and known many entrepreneurs who wished they had all the necessary resources and know-how to take their idea to the next level, but for some reason or the other they didn&#039;t. Becoming an entrepreneur or creating a successful start-up isn&#039;t the dramatic stressful process some deem it to be. In fact, in many countries small and medium sized businesses stimulate economic activity by providing jobs, wages, local production and revenues to owners. In order to accomplish this, there involves a process that requires having access to the right tools along with being dedicated and committed.  </p>  <p style=\"\">  \t        This business modelling course will provide several lectures that will guide an aspiring  entrepreneur through the steps to completing a business model canvas. The canvas represents one of the first and most important steps in developing your ideas. By utilizing this tool you would have  greatly increased your chance  for successfully creating a start-up from its initial idea stage.  The  course is designed with you in mind and really examines all the necessary faucets for you to be able to successfully complete a business model canvas for your new idea or for improving an exiting process or business model.  </p>  <p style=\"\">  \t        This &quot;Bringing your Ideas to Life&quot; course is packed with over 20 lectures and a number of practical exercises to stimulate you during the learning process. The lectures are also complemented with other videos, links and notes to ensure that each student gets the most out of the experience. You can go at your own pace to maximize the learning experience and a<strong style=\"\">bsolutely anyone who is interesting in business modelling, planning and proposal writing can participate in this course.</strong> It provides important elements related to...  </p>  <ul style=\"\">  \t<li style=\"\">the importance of completing a canvas for your business idea</li>  \t<li style=\"\">what exactly is the business model canvas</li>  \t<li style=\"\">how to complete the building blocks of the canvas to expound on ideas or improve the chances of successfully preparing a plan</li>  \t<li style=\"\">canvas examples for well-known businesses such as VISA and Foursquare and also links to other canvases </li>  </ul>  <p style=\"\">  \t<strong style=\"\">These lecture series are one of a kind. There are no other courses so specific in this important topic.</strong>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Take this ultimate Business Model Canvas Course now and learn how  you can transform your ideas into a successful money making opportunity.</strong></em>  </p>", 
    "end_date": null, 
    "title": "Business Model Canvas: Turn Ideas into Successful Startups", 
    "price": "20.00", 
    "instructors": "Omar Alcock", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319108_add5_5.jpg", 
    "course_url": "https://www.udemy.com/business-model-canvas-bring-your-ideas-to-life-make-money/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-13T20:53:26Z"
}