{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>I add multiple videos to this course every week based on my new findings and student requests. </strong>At some point (soon) I will make this a paid course. </p>\n\n<p><br></p>\n\n\n\n\n\n<p>Welcome everyone!</p>\n\n\n\n\n\n\n\n<p>Take you mind out of the idea that this is a course that will teach you a business to profit from. It's more than that. This is more of a community rather than a course where you will learn to leverage the power of the internet as a whole, not just in one specific business. This is a group where I will teach you how to set up businesses, have the right mindset, stay on track, keep up to date with the trends of internet marketing, and lead you on to businesses with high potential. </p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>Understanding the organization of this course is important, so I'll lay it out for you:</p>\n\n\n\n\n\n\n\n<ul><li>there are many sections where I teach a step by step process of setting up a business</li><li>there are sections for more abstract thinking and understanding of internet marketing in general</li><li>I have posts where students can vote/suggest what videos or sections they want added</li><li>I take time and effort to answer as many questions as I can and in the most detail possible</li><li><em class=\"redactor-inline-converted\">I add videos to this course every week based on my new findings and student requests</em></li><li>I strive to set up a helpful community in this course where everyone can learn have success</li><li>When I find a valuable one, I buy the rights to other people's courses and upload it into this course</li></ul>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n<p><br></p><p>If you are curious as to the topics covered inside, please check the curriculum below. Each section is titled with the name of the business covered</p><p><br></p>\n\n\n\n<p>Enroll in this course to join this free internet marketing community where you can put yourself on the path to success. </p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>***The main point in making this course is to create a community where people can join for free and learn how to make money online in a way that is tailored to their needs. Also, I find it very valuable that people can converse with others inside of the course through discussions. </p>", 
    "end_date": null, 
    "title": "Business Community To Help You Set Up An Online Store", 
    "price": 0, 
    "instructors": "Andrew Burich", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823758_2170_2.jpg", 
    "course_url": "https://www.udemy.com/business-community-to-help-you-set-up-an-online-store/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-16T16:12:43Z"
}