{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The Canadian Small Business Blueprint to help Canadians looking to start a small business hit the ground running – in far less time than it takes anyone starting from scratch. The mission is to help you get what you need and answer all those questions. Not in weeks, or days or months from now as you’re waiting to hear back from accountants and lawyers … but <em>NOW</em>. </p><p>To do this, you will get my years of experience, knowledge and passion to help get your Canadian start-up or venture up and running as quickly, profitably and effectively as possible. </p><p>To accelerate the growth of your business and to have the respect and rewards of being an entrepreneur - you need the Canadian <em>Small Business Blueprint.</em></p><p><strong>You will </strong><em><strong>SEE</strong></em><strong> the exactly how it’s done - </strong>not just hear about what to do, but get a clear, PRACTICAL, rubber-meets-the-road guide map that walks you through each step of the process.</p><p>You will get TO <em>LEARN</em> from an experienced Business Builder and Professional Accountant with over 20 years of experience in public practice covering finance, tax and business strategy.</p><p><strong>Y</strong>ou will be able to <em>BRAINSTORM and </em>personally pick the brain of a CPA and get honest, easy-to-understand answers to the challenges you’re facing.</p><p>This course was developed to give you the<strong> </strong><em>right</em> preparation and the answers to key questions that you might not be asking yourself. It will save you time, money and frustration down the road. </p><p><strong>You will Get Everything You Need To Start Smart… </strong><strong>And Cut Through The Red Tape!</strong></p><p>Here’s just a taste of what it contains …</p><p><strong>“START RIGHT” STRATEGIES - </strong><strong>We’ll dissect the 3 ways to organize your business – and take a close look at the advantages, disadvantages, considerations and consequences of EACH one: </strong>Perhaps the deepest, most comprehensive information about forming a business available. When you’re finished, you’ll be crystal clear about the type of business you want  </p><p><strong>INCORPORATING</strong><strong> </strong><strong>- </strong><strong> </strong><strong>Should you incorporate now, later or not at all? </strong>You’ll gain a thorough understanding of incorporating in your province and in Canada, including how to protect your assets, what you’d be liable for, eligible deductions and deferrals, as well as the costs. </p><p><strong>APPLICATIONS &amp; REGISTRATION – CRA </strong><strong>Business Numbers (BN) Provincial Sale Tax (PST) numbers, GST/HST.  </strong>You will know with 100% certainty which application to fill out ... if registration or tax numbers are needed ... AND, the precise steps to take.<strong> </strong><strong> </strong></p><p><strong>FORM PREPARATION - </strong><strong>Forms may be boring, but they’re an important part of starting a business. </strong>Mistakes can delay the launch of your business by weeks if not months. You’ll look over our shoulders as we fill in the forms together. You’ll prepare them correctly, submit them on time, and avoid frustration and unforeseen delays.<strong></strong></p><p><strong></strong></p><p><strong>THE BEST WAY TO PAY YOURSELF - What’s best for you? </strong>A salary, dividends or a mix of both?  You’ll know how to implement both strategies ... be clear on what paperwork to file (when and how) and understand the tax implications of each choice. <strong></strong></p><p><strong>DEDUCTIONS and EXPENSES - </strong><strong>Pay the least amount of tax by maximizing write-offs and deducting what you’re entitled to. </strong>We’ll examine deductible expenses (vehicle, home office, travel and much more!) You’ll know what you can claim, what you can’t, and how to “audit proof” yourself from the prying eyes of the Canada Revenue Agency (CRA)<br></p><p><strong></strong></p><p><strong>RECORD &amp; BOOKKEEPING</strong><strong> </strong><strong>-</strong><strong> </strong><strong>Managing records and creating a paper trail can keep your business out of hot water.</strong><strong> </strong><strong>We’ll show you an</strong><strong> </strong>astonishingly effective, easy-to-use system that will satisfy the toughest auditors. </p><p><strong>TAX PLANNING STRATEGIES: </strong><strong>Business is not only about what you make, but how much you keep. T</strong>he right tax planning strategies can save you and your family thousands each year. We’ll show you how to properly implement a wide variety of tax saving strategies ... keep more money in your pocket ... and stay off<strong> </strong>the CRA’s radar screen.<strong></strong></p><p><strong> </strong></p><p>This is a <strong>PRACTICAL</strong>, hands-on blueprint for start-ups that doesn’t just tell you what to do, but will actually SHOW YOU how it’s done. </p>", 
    "end_date": null, 
    "title": "Canadian Small Business Blueprint", 
    "price": "50.00", 
    "instructors": "Ian DiNovo, CPA, CGA", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/87872_3461_7.jpg", 
    "course_url": "https://www.udemy.com/small-business-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-04T01:59:30Z"
}