{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Did you know that interviewing on camera is one of the easiest and most powerful ways to rapidly create quality content that will boost your business in multiple ways?<br></p>\n\n<p>  \t<strong>JOIN OVER 2000 SUCCESSFUL STUDENTS ALREADY TAKING THIS COURSE!</strong></p>\n\n<p><em></em><strong>Be taught by a proven expert</strong></p>\n\n<p>  \t                    Start doing fantastic video interviews, with no outlay and no experience whatsoever.</p>\n\n<p>  \t            Become an accomplished video interviewer rapidly and easily by following this course. </p><p>When you know how, it's a massively powerful way to generate fresh and original content that can punch through the multitude of dross out there, and be a key tool for you to boost your brand, reputation and business!<br></p>\n\n<p>  \t<em>If you're looking for great video interviews without some study and effort, please don't take this course. You'll need to study the course, step-by-step and implement its teaching to enjoy success. </em><strong><em>All you need to get started is the time to follow the course, a pen and paper and willingness to learn</em></strong><em>.</em></p>\n\n<p>  \t<em>NOW includes step-by-step slides to help you progress rapidly!</em>  </p>\n\n<p>  \t                    ++++++++++++++++++++++++++++++++++++++++++++++  </p>\n\n<p>  \t                    About this course:  </p>\n\n<ul>  \t<li><em>Over 2000 happy students - exclusively five-star reviews!</em></li>  \t<li><em>No previous experience, equipment or anything else is required</em></li>  \t<li><em>Full, free lifetime access</em></li>  \t<li><em>All future extra lectures and upgrades are always included for free</em></li>  \t<li><em>Unconditional Udemy 30 day money back guarantee-that's a personal promise from me to you of your success!</em></li></ul><ul>  \t<li><em>Now includes full set of slides to help you quickly follow the lectures</em></li></ul>\n\n<p><br></p><p>SEE HOW I GET:<br></p>\n\n<ul>  \t<li>Outstanding interviews every time that help build my brand, reputation and income</li>  \t<li>Video interviews that attract audiences and positive reviews around the world</li>  \t<li>Excellent relationships and interviews with leading personalities in politics, business and the online world</li></ul><p><br></p><p>You won't need any prior experience or specialist equipment to get started with this. I show you how to approach, plan, conduct, edit and distribute video interviews of whatever length. I go step-by-step, and hold nothing back.<br></p>\n\n<p>I give concrete examples of how to plan and conduct great video interviews. You are not only getting a course in this essential skill, you're getting valuable insights into how a professional film director thinks, plans and executes his work.  </p>\n\n<p>  \t                    Whether you have experience in filmmaking and video interviewing already, or not, this course will help you hugely to advance your skills to immediately start creating outstanding content for your blogs, social media, videos and films and elsewhere.</p>\n\n<p>  \t                    You'll learn:  </p>\n\n<ol>  \t<li>What is a great video interview</li>  \t<li>Why do great video interviews</li>  \t<li>How to use video interviews</li>  \t<li>How to plan the interviews</li>  \t<li>How to think about the three key choices with video interviews</li>  \t<li>How to choose the interviewee</li>  \t<li>How to choose locations</li>  \t<li>An insider technique called “magic hour\"</li>  \t<li>Why time planning matters</li>  \t<li>The “art\" of video interviewing</li>  \t<li>How to structure and plan an interview</li>  \t<li>Why “emotional intelligence\" is crucial for success</li>  \t<li>What kinds of questions to ask and why</li>  \t<li>How to get the gold in video interviewing</li>  \t<li>How to achieve technical perfection with your video interviews</li>  \t<li>How to save time and money when editing video interviews</li>  \t<li>How to become a star interviewer and use this to enhance your reputation and  brand</li>  </ol>\n\n<p>  \t                    … And much more!</p>", 
    "end_date": null, 
    "title": "Capturing Passion: Video Interviewing to Engage Any Audience", 
    "price": "25.00", 
    "instructors": "Paul Jenkins", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/105136_8c1b_12.jpg", 
    "course_url": "https://www.udemy.com/how-to-do-great-video-interviews-for-reputation-and-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-12T22:35:15Z"
}