{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Would you like to be able to step in front of a camera or webcam at any moment and deliver a <strong>confident and engaging presentation</strong>?<strong></strong></p>\n\n<p>Do you feel in your bones that putting yourself forward would help your brand, whatever that might be, but you're just too embarrassed to try it?</p>\n\n<p>This course tackles something that ought to be simple - that can turn out to be quite complex -  but which is an essential skill in today's communications and marketing world:<br></p>\n\n<p>Presenting.</p>\n\n<p>The ability to reach out and touch audiences through personal presentation skills, especially on camera, is pretty much the most powerful thing you can do <em>regardless</em> of your field of activity.<br></p>\n\n<p>Therefore, whether you be a filmmaker, marketer, sales person, press officer, advocacy practitioner, online course maker or one of a zillion other profiles that can employ video to great effect - this course is going to be of huge benefit to you.</p>\n\n<p>Many courses about presenting either take a die-cut approach - for something which is anything but this - or are too fluffy and hard to action. </p>\n\n<p><em>Captivate Your Audience</em> takes a step by step approach, but it's not didactic. </p><p>The whole point is to harness <em>your</em> energy and inherent skills, and transpose them through to <em>your</em> audience in the most powerful way possible.</p>\n\n<p>Step inside this course, and learn a skill that without doubt will serve you for many years to come. </p><p>You'll see its benefits almost immediately as you become a skilled, confident and powerful communicator and presenter.</p>", 
    "end_date": null, 
    "title": "Captivate Your Audience: Be Powerful and Natural On Camera", 
    "price": "25.00", 
    "instructors": "Paul Jenkins", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479690_578b_4.jpg", 
    "course_url": "https://www.udemy.com/captivate-your-audience-be-a-great-and-authentic-presenter/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T12:16:17Z"
}