{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  This course is designed for <strong style=\"\">consultants, coaches, mentors, educators and accountants</strong> who want to use StratPad Cloud with their clients. It provides an in-depth review of StratPad Cloud and its material. The course is comprised of a series of short videos, most of which are followed by a quiz. There is also a 10-question final quiz.  </p>  <p>  \tThe course helps strategy and business planning professionals <strong style=\"\">increase their service offerings</strong> by creating high quality strategic plans and business plans with full financial projections. <span>By taking this course:</span>  </p>  <ul style=\"\">  \t<li><span>You will offer your clients additional high-value services.<br style=\"\">  \t</span></li>  \t<li><span>You will markedly differentiate yourself and your firm from competitors.<br style=\"\">  \t</span></li>  \t<li><span>You will gain two unique marketing approaches that will generate new business for you and your firm.<br style=\"\">  \t</span></li>  \t<li><span>You will learn how to generate additional annual revenues in the thousands or tens of thousands of $.<br style=\"\">  \t</span></li>  \t<li><span>Our tools and workshops naturally support your highest-value services and promote on-going client engagements.<br style=\"\">  \t</span></li>  \t<li><span>You’ll be recognized by StratPad as a partner with whom to pursue other initiatives.</span></li>  </ul>  <p>  \t<span>Successfully completing this course is a requirement of Level 1 of the Certified StratPad Coach program.</span>  </p>", 
    "end_date": null, 
    "title": "Certified StratPad Coach - Level 1: Business Plan Expert", 
    "price": "50.00", 
    "instructors": "Alex Glassey", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404832_dd69_5.jpg", 
    "course_url": "https://www.udemy.com/certified-stratpad-coach-level-1-business-plan-expert-course/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T23:27:09Z"
}