{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Certified Network Marketer (CNM) is a professional certificate for network marketers and direct sellers. Offered by International Direct Selling Educational Institute (IDSEI) in the US, CNM is the first specialized certification program for aspiring and successful entrepreneurs who are already active in direct selling (aka network marketing, multilevel marketing, or MLM), as well as enthusiasts who seek new ways to generate residual income.</p><p>The CNM course offers a wealth of material condensed into 4 hours of video and divided into 12 lectures. Taking you through the ins and outs of the profession, this course unveils the secrets to becoming a successful network marketer. It is recommended that you watch all the videos in the order of appearance to maximize the learning outcomes.</p><p>By the end of this course you will be prepared to kick start or boost your direct selling business. You can also sit through the official Certified Network Marketer certification exam, offered by the IDSEI. Successful candidates will receive:</p> <ul><li>the prestigious Certified Network Marketer certificate (electronic or print version)</li> <li>IDSEI professional membership card, and</li> <li>one year of access to a wealth of resources created by world-class professionals, best-selling authors, coaches, and mentors.</li></ul> <p>Our vision is to embed trust into the direct selling profession by empowering the minds of the professionals who genuinely seek prosperity and strive for excellence.</p><p><strong>Special Offer for Teams: </strong>We highly recommend you and your team to join the program, get the formal education, and all get certified. This will help your team to:</p> <ul><li>speak the same language and support each other better</li> <li>save hours in ad-hoc training sessions, and</li> <li>become professionally recognized.</li></ul> <p>That's why we offer team discounts to successful teams. Please contact sales@certifiednetworkmarketer.com today and ask about CNM team packages. </p>", 
    "end_date": null, 
    "title": "Certified Network Marketer Training Course (by IDSEI)", 
    "price": "25.00", 
    "instructors": "IDSEI International Direct Selling Educational Institute", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410738_92a4_2.jpg", 
    "course_url": "https://www.udemy.com/multi-level-network-marketing-by-professional-instructors/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T10:29:30Z"
}