{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>UPDATED  TO SDK v.4.4.1</strong>  </p>  <p>  \t<strong>--- Are you a student or a non-profit organization? Just message me for a considerable discount. ---</strong>  </p>  <p>  \t <strong></strong><strong>Are you wondering how to make money with apps?</strong>  </p>  <p>  \t<strong>Do you have an iPhone game that doesn&#039;t sell as much as you&#039;d expected?</strong>  </p>  <p>  \t<strong>Are you trying to figure out the FREE TO PLAY system?</strong>  </p>  <p>  \t<strong>Do you have loads of users, but no one buys your In-App Purchases?</strong>  </p>  <p>  \t<strong>Then you need ads to make money with your apps!</strong>  </p>  <p>  \t<a href=\"https://www.chartboost.com/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">Chartboost</a> delivers ads that sell. These full screen interstitials and their animation rule! I just tap them all the time...  </p>  <p>  \t    Now, I don&#039;t want to convince you how great they are, just google around some and you&#039;ll find out.  </p>  <p>  \t    What I am trying to tell you is that you should NOT waste your time and money reading documentation or watching Youtube videos about integrating Chartboost into your iOS game. (Yes! Chartboost is for GAMES ONLY)  </p>  <p>  \t<strong>I will teach you how to earn money with apps by integrating</strong><strong> Chartboost into your game!</strong>  </p>  <p>  \t    If you&#039;re trying to integrate Chartboost fast and easy, look no further! This course will lead you step by step through the process. Integration looks simple but it isn&#039;t (I have figured it out IN A WEEK or so with try and error + written documentation).  </p>  <p>  \t    I have made these HD video lessons on how to make money with apps monetized with Chartboost so that anyone can easily follow along the sample project and learn all the ins and outs.  </p>  <p>  \t<strong>You will learn:</strong>  </p>  <ul>  \t<li>How to sign up for Chartboost</li>  \t<li>What are apps / campaigns / publishers / interstitials etc. in the Chartboost dashboard</li>  \t<li>How to set up your project</li>  \t<li>All the code to show interstitials and <strong>pro tips</strong></li>  \t<li>How the More Apps page works</li>  \t<li>Stuff to be made in your iTunes Connect Account and more</li>  \t<li>Getting paid</li>  \t<li>... just take a look at the curriculum below for more <strong>(THE FIRST FOUR LECTURES ARE FREE)</strong></li>  </ul>  <p>  \t<strong>Important: This course cuts through the BS and teaches you everything you need to know about </strong><strong>how to make money with apps, </strong><strong>Chartboost for publishers in less than an hour!</strong>  </p>  <p>  \t    If you want to monetize your iOS game with Chartboost, want to eliminate the &quot;try &amp; error&quot; and save time (thus money) than TAKE THIS COURSE NOW!  </p>  <p>  \t<strong>Have fun!</strong>  </p>", 
    "end_date": null, 
    "title": "Chartboost - Learn how to monetize your iPhone game with ads", 
    "price": "20.00", 
    "instructors": "Sandor Nagy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47108_5dd0_7.jpg", 
    "course_url": "https://www.udemy.com/chartboost-learn-how-to-monetize-your-iphone-game-with-ads/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-23T18:40:03Z"
}