{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"></strong><strong style=\"\">Warning! Don’t even think of starting your own business until you have reduced risk and aligned it to your personal goals.</strong>  </p>  <p>  \t<strong style=\"\">----------------------------------------------------------------------------------------</strong>  </p>  <p style=\"\">  \t<strong style=\"\">SPECIAL LAUNCH 85% OFF PRICE - FULL PRICE $119</strong>  </p>  <p style=\"\">  \t    Offer ends on the 7th March.  </p>  <p>  \t<strong style=\"\">----------------------------------------------------------------------------------------</strong>  </p>  <p style=\"\">  \t            Since 2010, every month over 500,000 new businesses are created in the US alone. But over 60% of businesses fail after a few years. Seeing the business idea you believed in come to an end, together with all the efforts and resources put in, is a terrible experience. Some degree of uncertainty is innate into business, but all too often entrepreneurs dive into execution, without spending enough time on planning and testing the idea beforehand. This means not giving your business the chances it deserves to succeed.  </p>  <p style=\"\">  \t            This is exactly where I found myself when I started my first business armed with bags of motivation and an idea.  </p>  <p style=\"\">  \t            Over the past three years I have learnt tough lessons from successful and unsuccessful business ventures, and I was able to share my experience speaking to the Top 40 European and North American Universities, as well as advising startups from Ireland, the UK and China on their business setup.  </p>  <p style=\"\">  \t<em style=\"\">&gt;&gt;&gt;In this course, you will find loads of tough lessons and even common sense that is so often overlooked, together with SPREADSHEETS and DOCUMENTS to help you evaluate your business prospects and create rock solid personal plan.&lt;&lt;&lt;</em>  </p>  <p style=\"\">  \t<strong style=\"\">This course will show you how to:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">minimise the risk of failure</li>  \t<li style=\"\">get to your personal goals of financial freedom and location independence as quickly as possible</li>  \t<li style=\"\">save tons of time and money and test your idea quickly and safely</li>  \t<li style=\"\">don’t give away unnecessary equity</li>  \t<li style=\"\">increase your productivity and keep a work/life balance</li>  \t<li style=\"\">share your idea with the right people</li>  </ul>  <p style=\"\">  \t<em style=\"\">&quot;A goal without a plan is just a wish&quot; – Antoine de Saint-Exupéry</em>  </p>  <p style=\"\">  \t            This course was made to be easy to follow, and give the definitions and guidance you need when starting your one business. Throughout the lectures, you will go through the main choices you will have to take in order to align your business to your dreams and make sure you do not end up trapped in a low-pay 80 hours a week job masked as a business. By planning you will make sure to get closer to your goals.  </p>  <p style=\"\">  \t          I guarantee that this course will help you become confident in the outcome of your business. <strong style=\"\">This course is backed by the Udemy 30 days money-back guarantee!</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t          BUY THE COURSE NOW AND SET YOUR BUSINESS FOR SUCCESS!  </p>  <p style=\"\">  \t<strong style=\"\">PS: Take advantage of the special LAUNCH OFFER before it expires on the 7th February. </strong>With my return policy, you have loads to gain and nothing to lose!  </p>", 
    "end_date": null, 
    "title": "Check your business idea in 4 easy steps!", 
    "price": "20.00", 
    "instructors": "Matt Sandrini", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425886_b0b6_5.jpg", 
    "course_url": "https://www.udemy.com/checkyourbusinessidea/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T12:34:33Z"
}