{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tLearn how to choose the perfect business idea for you based on your unique strengths, qualifications, and interests. Identify potential opportunities that will lead you to starting a heart-centered business with the potential for plenty of purpose, passion, and profit.</p>  <p>  \t<strong style=\"\">Learn How to Earn a Profit and Make a Positive Impact on Your Dream Clients by Leveraging Your Unique Brilliance </strong>  </p>  <ul style=\"\">  \t<p>  \t\t·Find clarity.  \t</p>  \t<p>  \t\t·Fulfill your true desire for starting a business.  \t</p>  \t<p>  \t\t·Discover your soul&#039;s unique expression.  \t</p>  \t<p>  \t\t·Make a heart-centered decision.  \t</p>  \t<p>  \t\t·Soothe your doubt and worry about whether your idea will work.  \t</p>  </ul>  <p>  \t<strong style=\"\">What business should I start?</strong>  </p>  <p>  \tAfter I wrote Soulful Entrepreneurship I asked for feedback from everyone who ordered the workbook about their experience starting and growing a values-based business. The number one comment I received was, “The information in this book would be great if I could only figure out what business to start.&quot;  </p>  <p>  \tHere&#039;s what I heard you say: You want to start a business doing what you love while helping people – and you want to make sure that you make enough money doing it. You want to know how you&#039;re supposed to know which idea will work. You have so many interests and you can&#039;t figure out how they all fit together into one business, but you know that somehow they do.  </p>  <p>  \tSound like you? Take a look at how this course can help you find clarity to move forward.  </p>  <p>  \t<strong style=\"\">Course Content and Overview</strong>  </p>  <p>  \tThis course is for you whether you have:  </p>  <ul style=\"\">  \t<p>  \t\t·Too many ideas or not enough ideas  \t</p>  \t<p>  \t\t·Started a business in the past or this is your first  \t</p>  \t<p>  \t\t·An idea of what you want to do or absolutely no clue  \t</p>  </ul>  <p>  \tWith 51 lessons and plenty of added gifts and bonuses, this course will take you from confusion and frustration to clarity and action.</p>  <p>  \tThe course walks you step-by-step through the things that you need to consider to come up with the perfect business idea for you. Extra resources, including guided meditations, are included to help you cultivate the conditions for inspiration to strike.  </p>  <p>  \tYou will take a look at your motivation for starting a business so that you can ensure that your idea will meet the goals you have envisioned for your life. You can build any business you want, but first you have to identify what it is that you really want.  </p>  <p>  \tYou will also spend a lot of time identifying your unique brilliance which is the one thing you naturally do better than anyone else. Your brilliance is like your secret ingredient – when you add it to what you do, your work takes on the quality of who you are. When you are clear about your brilliance you can leverage it in your business.  </p>  <p>  \tYou will look at the ways that your life experience and skills supports who you are and create opportunities for you to be of service through your business. When you pair those opportunities with a fertile market full of people who want what you have to offer, you find great ideas for your initial offering.  </p>  <p>  \tWith lots of good ideas comes the need to make a decision based on reason <em style=\"\">and</em> what feels right to your heart. By the end of this course you will know if your idea is sound and fits all of the criteria laid out within the course. You will have a prototype and be ready to start your new business.  </p>", 
    "end_date": null, 
    "title": "Choose Your Perfect Business Idea ", 
    "price": 0, 
    "instructors": "Stef Durham", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413642_107d_4.jpg", 
    "course_url": "https://www.udemy.com/choose-your-perfect-business-idea/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T23:47:22Z"
}