{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Clarity is critical if you want to succeed. Without a clear vision of what you want your small business idea, passion, purpose to achieve you have no destination to reach, no goal line to cross and no way to understand how to accomplish startup victory!</p><p style=\"\"><strong style=\"\">1. Personal Vision</strong></p><p style=\"\">Why do you want to start a small business - what&#039;s in it for you? Startup victory requires a lot of personal time and effort. What&#039;s your vision statement for &quot;why&quot; successful small business ownership is important to you?</p><p style=\"\"><strong style=\"\">2. Business Goals</strong></p><p style=\"\">Small business success is more than an idea sketched on a napkin over a cup of coffee. Have you written down your basic business goals with a clear plan for how you&#039;re going to accomplish them?</p><p style=\"\"><strong style=\"\">3. Lifestyle Design</strong></p><p style=\"\">We all have lifestyle, good, bad or indifferent. You can change your lifestyle if you create a design that&#039;s attractive to you. Do you have a clear understanding of how small business ownership impacts your lifestyle?</p><p style=\"\"><strong style=\"\">4. Time Management</strong></p><p style=\"\">To realize your personal vision, business goals, lifestyle design you must make the best possible use of your time. How do you schedule mandatory activities required for your small business startup victory?</p><p style=\"\"><strong style=\"\">Learn &amp; Do</strong></p><p style=\"\">Clarify Your Vision for Startup Victory is based on The Profit Puzzle. The Profit Puzzle curriculum focuses on Definition, Case Study, DataSheet, Comprehension and Write Up.</p><p style=\"\"><strong style=\"\">Let&#039;s Get Started</strong></p><p style=\"\">This course is going to be fun, worthwhile and helpful. By taking this Learn &amp; Do course you&#039;ll be able to clarify your vision for startup victory! Use the &quot;Take This Course&quot; icon on the top of the right column to get started on your path to Startup Victory!</p>", 
    "end_date": null, 
    "title": "Clarify Your Vision for Small Business Startup Victory!", 
    "price": "45.00", 
    "instructors": "Don Osborne", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444062_9329_7.jpg", 
    "course_url": "https://www.udemy.com/clarify-your-vision-for-small-business-startup-victory/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T19:25:10Z"
}