{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t        Fala-se muito em inova&ccedil;&atilde;o nos modelos de neg&oacute;cio. As teorias da Startup Enxuta e o Business Model Generation vieram para catalisar e sistematizar esse processo de diferencia&ccedil;&atilde;o em uma forma extremamente din&acirc;mica. Pelo lado do mercado consumidor, novas necessidades surgem todos os dias: novos produtos, novos servi&ccedil;os e mesmo os antigos s&atilde;o reinventados ao serem entregues ao cliente de uma forma diferente. Quando algu&eacute;m, h&aacute; 10 anos, teria pensado em um servi&ccedil;o de assinatura online de l&acirc;minas de barbear, por exemplo?\r\n</p>\r\n<p>\r\n\t      Assim como as nascidas digitais, as empresas que surgiram no meio offline est&atilde;o tendo que se adaptar a forma de comunicar, de se relacionar e de vender atrav&eacute;s de canais digitais. Alguns modelos d&atilde;o certo, mas a grande maioria n&atilde;o se sustenta. Por que ser&aacute;? Talvez porque n&atilde;o entendem que a forma como um neg&oacute;cio gera receita na internet &eacute; essencialmente a mesma de uma barraquinha de cachorro-quente.\r\n</p>\r\n<p>\r\n\t     Nesse sentido, os dados s&atilde;o indispens&aacute;veis para gerir um neg&oacute;cio online, para saber o que traz mais rentabilidade, ou at&eacute; mesmo apontar o qu&ecirc; mudar em um modelo para faz&ecirc;-lo dar certo.\r\n</p>\r\n<p>\r\n\t    Este curso discute os principais aspectos gerenciais e estrat&eacute;gicos da gest&atilde;o de um neg&oacute;cio digital. Abordamos as diferentes pr&aacute;ticas de um e-business, os efeitos da informa&ccedil;&atilde;o e da tecnologia sobre o mercado, e o caminho para conseguir mensurar todas as iniciativas da empresa, transformando dados em conhecimento para a tomada de  decis&otilde;es.\r\n</p>\r\n<p>\r\n\t <strong>  O curso est&aacute; dividido em 5 partes com mais de 2 horas de materiais em texto, &aacute;udio e v&iacute;deo.</strong>\r\n</p>\r\n<p>\r\n\t   A primeira sess&atilde;o fornece uma introdu&ccedil;&atilde;o sobre o mercado digital e as mudan&ccedil;as que ele provocou no consumo.\r\n</p>\r\n<p>\r\n\t   Na segunda sess&atilde;o passamos pelos modelos mais comuns de gera&ccedil;&atilde;o de receita de receita na internet, entendendo como transformar o processo em indicadores que ir&atilde;o medir o desempenho do neg&oacute;cio.\r\n</p>\r\n<p>\r\n\t   Na terceira parte vamos para a parte mais t&eacute;cnica, onde entendemos como ocorre a coleta de dados para a an&aacute;lise.\r\n</p>\r\n<p>\r\n\t   Na quarta sess&atilde;o abordamos a t&eacute;cnica que utilizamos para o acompanhamento desses indicadores. E por &uacute;ltimo, reunimos alguns materiais complementares caso voc&ecirc; queira se aprofundar no tema. S&atilde;o necess&aacute;rias pouco mais de 4 horas de estudo para finalizar o curso.\r\n</p>\r\n<p>\r\n\t <strong>Instrutores</strong>\r\n</p>\r\n<p>\r\n\t <strong>Matheus dos Santos</strong>\r\n</p>\r\n<p>\r\n\t Fa&ccedil;o parte do lado &ldquo;business-oriented&rdquo; da Upwell. Sou administrador de forma&ccedil;&atilde;o e estudo Web Analytics desde 2011 quando morei no Canada. O meu gosto por business/online intelligence veio desde a &eacute;poca que trabalhava como consultor na pwc e hoje isso me motiva a aprender como os neg&oacute;cios e o mercado digital evolui.\r\n</p>\r\n<p>\r\n\t <strong>Marcus Pereira</strong>\r\n</p>\r\n<p>\r\n\t Sou jornalista de forma&ccedil;&atilde;o mas meu interesse sempre esteve voltado pro mundo digital. J&aacute; tive muito interesse em arte e por isso estudei a influ&ecirc;ncia da internet no mercado da m&uacute;sica independente. Depois de um tempo atuando com o mercado da web, hoje me considero jornalit&aacute;rio - a vis&atilde;o publicit&aacute;ria sem esquecer a veia do conte&uacute;do.\r\n</p>\r\n<p>\r\n\t <strong>Mauricio Paim</strong>\r\n</p>\r\n<p>\r\n\t Me denomino um solucionador de problemas digitais. Com forma&ccedil;&atilde;o multim&iacute;dia, j&aacute; trabalhei em diversas frentes e admito que tenho uma paix&atilde;o em entender como as coisas funcionam por dentro. Atuo como designer e desenvolvedor web e aplico minha experi&ecirc;ncia t&eacute;cnica em diferentes projetos, com o objetivo de trazer uma vis&atilde;o ampla sobre os aspectos que nos rodeiam enquanto navegamos a web.\r\n</p>", 
    "end_date": null, 
    "title": "Como utilizar dados para modelos de negócio online", 
    "price": "50.00", 
    "instructors": "Upwell Web Performance", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/132312_2354_8.jpg", 
    "course_url": "https://www.udemy.com/indicadores-de-performance-para-modelos-de-negocio-online/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-11T13:38:05Z"
}