{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<span style=\"color: rgb(74, 74, 74);\"></span>  </p>  <p>  \t<strong style=\"\"><span style=\"color: rgb(74, 74, 74);\">App development</span></strong><span style=\"color: rgb(74, 74, 74);\"> is booming. This course is designed to teach anyone how to take no more than <strong style=\"\">$99</strong> and literally turn it in into an <strong style=\"\">App Building</strong> Business. I teach you how to make money in a very short period of time by offering small businesses their very own iphone/android application. You will learn the following</span>  </p>  <p>  \t<span style=\"color: rgb(74, 74, 74);\">You get <strong style=\"\">step-by-step</strong> guidelines and <strong style=\"\">easy-to-follow</strong> instructions on exactly what to do and how to do it. No stone is left unturned. Everything that you will need in order to succeed in this most profitable endeavour, is provided. I can assure that there is no one else in the world teaching this method. In less than 2 hours you will be equipped with the knowledge and know how to build a full blown, lucrative, App business, and you'll learn how to do so on a shoestring budget</span>  </p>  <p>  \t<span style=\"color: rgb(74, 74, 74);\">The course takes you gently through the intricacies of building an App business. It shows you what works and what doesn’t, and most importantly explains why things work the way they do so you can grasp key concepts and form strategies and identify App trends. </span>  </p>  <p>  \t<span style=\"color: rgb(74, 74, 74);\">All in all, this is the real deal and it provides you with everything you need to know about understanding the marketplace to build successful App ideas for profit.</span>  </p>  <p>  \t<span style=\"color: rgb(74, 74, 74);\">I have Included a Free Downloadable Source code for every student to upload in the App Store under their name the code is in the \"Register as a Developer\" lecture</span>  </p>  <p class=\"MsoNormal\">  </p>  <p class=\"MsoNormal\">  </p>  <p class=\"MsoNormal\">  </p>", 
    "end_date": null, 
    "title": "Complete Guide To Building An App Business", 
    "price": "20.00", 
    "instructors": "Val Cilic", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410400_6dc1_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-build-an-app-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T01:01:57Z"
}