{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hey guys! Thanks so much for taking a look at my course. It really means a lot! :)</p>\n\n<p>For those of you who don't know me, at 13 I started my mobile app business. At 15, I was making over <strong class=\"redactor-inline-converted\">$10,000+ a month</strong> with my app business, ultimately working less than 8 hours a week. After trial and error, I finally created a <strong class=\"redactor-inline-converted\">formula for success</strong>. No, not a get \"rich quick scheme\", but an actual system to create sucessful mobile apps. With my profits, I started outsourcing my work and hiring people all over the world to work on my apps, therefore expanding my business.</p>\n\n\n\n<p>This course goes over many topics. At the end of this course you should be an expert in the mobile app world and release your own successful apps. I've decided to cut the nitty gritty, and give you the <strong class=\"redactor-inline-converted\">MOST</strong> important parts of this business, so you can be successful. This course is for anyone with the will to create a sucessful business. The <strong class=\"redactor-inline-converted\">TRUTH</strong> is, you don't need money, you don't need to be a genius, you don't need to be technical, you don't need any of that, all you need is the will succeed. The bottom line is that the app industry is <strong class=\"redactor-inline-converted\">bigger</strong> than hollywood. There is truly no better time than <strong>NOW </strong>to jump in. </p>", 
    "end_date": null, 
    "title": "Complete Guide To Making Apps: How I Got Over 250K Downloads", 
    "price": 0, 
    "instructors": "Michael Assadi", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/878484_5622_2.jpg", 
    "course_url": "https://www.udemy.com/complete-guide-to-making-apps-how-i-got-over-250k-downloads/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-15T02:10:02Z"
}