{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated March 29, 2016</strong> - Want to leave the daily grind and <strong>start your own consulting business? </strong> Or are you currently struggling in your consulting business? Well you are in the right place!</p>\n\n<p><strong></strong><strong>Consulting Business 101: Entrepreneur Success Secrets shows you how to be successful starting a consulting business.  </strong>You learn the 7 Must-Know Building Blocks for Entrepreneurial Success, in the right order, so you can be successful in your consulting business.</p>\n\n\n\n<p> This comprehensive, yet simple to follow, entrepreneurship course gives you business coaching, business consulting plus insider business tips and tricks to be fearless. Consultants need to think like entrepreneurs to be successful in business. </p>\n\n\n\n<p><strong>What’s included in the course?</strong></p>\n\n\n\n<p>You will learn the 7 Must-Know Building Blocks for Entrepreneurial Success. This course should be required learning for anyone thinking of starting a consulting business or if you are in business right now and need a framework for business success.  </p>\n\n\n\n<ul><li>7 Must-Know Building Blocks for Entrepreneurial Success will show you how to be successful year after year in each of the key areas of business development.</li><li>You get the steps and insider insight you need to take now to ensure you build your consulting business the right way instead of making costly mistakes like so many entrepreneurs do.</li><li>You get the solutions to build and grow a consulting business that lets you live your dreams now without sacrificing what you value; freedom, time with your loved ones, your integrity, fill-in-the-blanks.</li><li>You can create an amazing consulting business and in this course you discover simple free to low-cost strategies to build your consulting <strong>business from the ground-up.</strong></li></ul>\n\n\n\n<p>*************************************************************************************************************</p>\n\n\n\n<p>This course is ideal for you if you want the <strong>Blueprint</strong>, the 10 Day Entrepreneur Plan plus the insider know-how to be an entrepreneur who is ready for ongoing success in your consulting business.</p>\n\n\n\n<p>What are you waiting for?  If you’re looking for a course to learn what it takes to be successful as a consultant, then look no further.  </p>\n\n\n\n<p>The course includes a full money back guarantee, so long as you request it within 30 days of purchase – No questions asked.</p>\n\n\n\n<p>Check out some of the FREE PREVIEWS available to learn more about the course and more about me your instructor.</p>\n\n\n\n<p>Then click on the <strong>\"Take This Course\"</strong> button and start learning instantly the 7 Building Blocks to Entrepreneurial Success so you can start your consulting business with confidence.</p>", 
    "end_date": null, 
    "title": "Consulting Business 101: Entrepreneur Success Secrets       ", 
    "price": "25.00", 
    "instructors": "Fearless Entrepreneur Academy, Louise Anne Maurice", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471016_d32d_14.jpg", 
    "course_url": "https://www.udemy.com/7-must-know-building-blocks-for-entrepreneurial-success/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T17:37:21Z"
}