{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t      Have you published one or more books? Chances are good they are in the traditional form of either a paperback or hardback that people can hold in their hot hands. Have sales been lousy these past few months? That is because more and more people  these days are reading books on their smart phones and tablets.  </p>  <p style=\"\">  \t   If you are serious about selling your book to the audience of the future, it now has to be read on smart phones and tablets. Just because a book has been converted from Word to a PDF format does not mean it will  not be read on most smart phones. Kindle is an exception to this rule.  </p>  <p style=\"\">  \t      How do you convert your existing book to an epub format (which is the form that is required for people to read your book on smart phones and most tablets)? After seeing my own book sales dwindle that was the question I asked myself. After four long weeks of frustration and angst I finally figured out how to convert my first book to an epub.  </p>  <p style=\"\">  \t   I have to confess I made every  mistake in the book and contemplated giving up on the project every day. I persisted because I want people to read my books!.  </p>  <p style=\"\">  \t    If you want people to start buying and reading your  books on their smart phones you will have to convert your book to a form that can be read on phones. The programming is different because the size of the screens on phones is small. This course provides a step by step guide which shows you precisely how to convert your existing book to an epub.  </p>  <p style=\"\">  \t      You do not need any expertise in computer programming. You will need a computer which connects to the internet. You will need to have one of your books to convert. It is recommended to have a copy of your book in Microsoft Word but it is not required.   I will show you how to convert books that were created by any word processing software, but books created by 2007 Word (.docx) are the easiest to convert because it creates the fewest errors. Believe me, I know!  </p>  <p style=\"\">  \t      This training takes you through each step of the conversion, step by step. You will convert your own book as we proceed through each of the steps. You will need to upload several free software programs to your computer along the way. .  </p>  <p style=\"\">  \t    When you finish all of the steps, you will have succeeded in converting your book to an epub within an hour (unless the conversion creates a long series of errors). This does happen with some books. The course includes detailed instructions on how to correct all types of errors. It you do not fix the errors, your books will not be posted on Google or Nook.  .  </p>  <p style=\"\">  \t    I will convert one of my own books in the training, so you will see the conversion in action. You will need to complete each step of the progress before proceeding to the next step of the conversion process. The conversion is not complicated and again, requires no programming expertise.  </p>", 
    "end_date": null, 
    "title": "Convert Your Books So People Can Read Them on Smart Phones", 
    "price": "20.00", 
    "instructors": "Robert Rodgers PhD", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/178732_52ad_3.jpg", 
    "course_url": "https://www.udemy.com/convert-your-books-so-people-can-read-them-on-smart-phones/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-07T20:38:10Z"
}