{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>**UPDATED JUNE 2016**</strong> Called <em><strong>\"the best course on Cold Emailing on Udemy\"</strong></em></p>\n\n<p>  \t Being able to start a dialogue with anyone in the world is a superpower. Period.  </p>\n\n\n\n<p>  \t           Just one cold email could be the difference <strong><em>between getting the meeting of your lifetime</em></strong> that completely changes the trajectory of your company vs. things remaining exactly how they are...  </p>\n\n\n\n<p>  \t           Most people are terrible at writing cold emails. They fire off hundreds, receive little response and wonder why they can't get the meetings they know could change their business : (  </p>\n\n\n\n<p>  \t           What if I told you there was a mindset that the most sophisticated marketers and copywriters have been using for years to get people to consent to things they didn't know they needed...and that this step by step approach and its incredible powers translated directly to cold emailing?  </p>\n\n\n\n<p>  \t <em><strong>Good news - This is the truth!</strong></em>  </p>\n\n\n\n<p>  \t           This course provides the blueprint to rewire the way you approach cold emailing so that you and your company can become an unstoppable force.  </p>\n\n\n\n<p>  \t           All of the tactics, scripts, and techniques are the product of years of in the field testing and rely heavily on principles copywriters have been using for years. Few startups, along with their business development and sales teams, have applied these principles <em>which is why they're so incredibly effective</em>. They stand out because they're different than the run of the mill garbage prospects see over and over again.  </p>\n\n\n\n<p>  \t           And guess what...all of these frameworks I teach can be applied in hundreds of situations to begin dialogues with CEO's, celebrities, thought leaders, press...you get the picture.  </p>\n\n\n\n<p>  \t <strong>*Being one click away from anyone you'd ever want access to is a powerful place to be.</strong>  </p>\n\n\n\n<p>  \t           Skeptical?  </p>\n\n\n\n<p>  \t      As of Jan 1, 2014, this course <strong>was rated 4.88 out of 5 stars</strong> by everyone who took the time to write a review.  </p>\n\n\n\n<p>  \t           The last company I did business development for did over 300 BD deals which played a large role in our $100 million dollar exit. I've been contracted for hundreds of dollars an hour by startups to teach their sales teams things you'll learn in this course like \"the bandage email framework\" and how to create internal referrals.  </p>\n\n\n\n<p>  \t           But don't just listen to me. Here's what a few other people have said:  </p>\n\n\n\n<p>  \t           \"I used some of the tips to send a cold email to the CEO of a company we were interested in working with. I got a meeting set up and it went great. We're close to working out a deal and they even introduced my boss to an investor. Your tips were invaluable\"  </p>\n\n\n\n<p>  \t           -Osman Sheikh, <em>Business Development at BusyConf</em>  </p>\n\n\n\n<p>  \t           \"I used your rapportive \"find anyone's email address\" trick along with your cold email tips to reach out to a billionaire public company CEO. He responded w/in 5 minutes\"  </p>\n\n\n\n<p>  \t           -Alex Binkley, <em>Co-Founder at FundingCommunity</em>  </p>\n\n\n\n<p>  \t           A few of the things you'll learn in this course:  </p>\n\n\n\n<ol>  \t<li>How to find the right important key stakeholders to reach out to at a company</li>  \t<li>Six proven methods to find anyone's email address</li>  \t<li>The proper \"copywriter\" mindset to take when constructing cold emails</li>  \t<li>The bandage email formula</li>  \t<li>How to follow up effectively when no one responds to your email</li>  \t<li>The proper cadence to take when reaching out cold</li>  </ol>\n\n\n\n<p>  \t           Trust me, this is just a small sample of what you'll learn and by the end of this course you'll have the ingredients to developing the superpower of being an extraordinary cold emailer.  </p>\n\n\n\n<p>  \t         No matter who you are, I guarantee you'll learn at least one thing from this class (see the testimonials above for proof).  </p>\n\n\n\n<p>  \t <strong>I will personally respond to any questions you may have</strong> as you go through the material so there's no worry if you're not sure how to take all of the information and apply it to your life. So sign up now!  </p>\n\n\n\n<p>  \t         Talk soon,  </p>\n\n\n\n<p>  \t         Scott Britton  </p>\n\n\n\n<p>  \t <strong>P.S.</strong> The $99 price is an initial offering to build the students and positive reviews.  </p>\n\n\n\n<p>  \t <em>I believe being able to start a dialogue with anyone in the world is worth way more than 30 cents a day for the next year s</em>o I plan on raising the price in the near future. If you want to take advantage of the initial price, I'd sign up sooner than later (Like now!)  </p>", 
    "end_date": null, 
    "title": "Crack Cold Emailing to Increase Sales and Grow Your Business", 
    "price": "50.00", 
    "instructors": "Scott Britton", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/122352_96fa_5.jpg", 
    "course_url": "https://www.udemy.com/cold-emailing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-20T03:21:30Z"
}