{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are You a Self Published Author Who Wants to Run a REAL Publishing Business Instead of a Hobby?</strong></p><p><strong>Do You Feel Like You're Always Flailing Around In Your Author Business Without Any Real Direction?</strong></p><p>After publishing over 70 books myself, one thing I've learned about authors is that we're \"creative types\", and we generally hate the whole idea of business planning.</p><p>But in order to have a high profitable, successful author business, you MUST plan for it! You need to know many factors such as your audience demographics, your marketing budget, your marketing schedule and your production schedule among other things.</p><p><strong>I run a six-figure author business myself, so I know what it's like to juggle a million things at once on a small budget because I've been there!</strong></p><p>This course is easy to understand and features a lot of \"real talk\" when it comes to planning out your author business. This is not a boring business planning course, but more of a boot camp specifically for authors (you know, those \"creative types\").</p><p>Join me on the inside as we revamp (or start) your business with a firm foundation of business principles. I will pose many questions along the way as you start to form your own business plan!</p><p><strong>Click TAKE THIS COURSE to get started.</strong></p>", 
    "end_date": null, 
    "title": "Creating An Author Business Plan For Self Publishers", 
    "price": "20.00", 
    "instructors": "Charity  Cason", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699348_f2be.jpg", 
    "course_url": "https://www.udemy.com/self-published-author-business-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-16T19:29:57Z"
}