{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">My name is Helene MICHEL. I am a professor in innovation management and an expert in serious gaming. My objective is to empower people to innovate using a fantastic lever: the games. </p><p style=\"\">To do this I have developed a method using Rubik&#039;s cube. It helps people to imagine new ideas, for new products or new services, and therefore develop their business. I am using this method with major companies, as well as SMEs. And I am teaching it to my Master degree students.</p><p style=\"\">You are looking for the idea in order to differenciate yourself ?  You wish to show your specificity, in your personal or professional life ?To sum up, you want to be more creative. You have probably red a lot of books. You have followed different seminars. You have practiced several methods. But have you found a fun, challenging and efficient method all at once? This is what I suggest you today. </p><p style=\"\">To follow this lecture, you don&#039;t need any previous experience with a Rubik&#039;s cube. And with this lecture you will never learn how to solve it. However, you will learn how to transform a common game – like the Rubik&#039;s cube- in a strong creativity tool. You will be able to customize this cube according to your own innovation challenge. </p><p style=\"\">Spend one hour watching the 14 videos and reading the additional material. Experiment the method with your own rubik&#039;s cube and create your first 6 disruptive ideas. </p><p style=\"\">Are you game to innovate?</p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Create Business Ideas using a Rubik's Cube", 
    "price": "25.00", 
    "instructors": "Helene Michel", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502742_bd4e_5.jpg", 
    "course_url": "https://www.udemy.com/create-business-ideas-using-a-rubiks-cube/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T09:32:55Z"
}