{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>You can do it!  You can write a book</strong>.  Unfortunately no one has told you how to do it in a way that most people can do it, so they will be successful.  Now you can. I can help you.</p><p>In this nine lesson course I will show you an incredibly simple way where you can  have a book to share with others and show the world not just what you do, but how good you are.</p><p>I teach everyone in business today <strong>that in the future starting now that your book will be your business card and your video broadcast will be your brochure</strong>.  So write your book, and I will get you started and then if you wish help you finish.</p><p>You will learn to get past all the of the myths, fables, and so-called rules and reviews about what it means to \"write and publish\" a book.</p><p>You will find out how you must do the \"state of mind\" work that will keep you emotionally high, and ready to do the work to start and <strong>then perform your book</strong> so it can then be put into audio or into print.</p><p><strong>ThenI I will show you how the most powerful tool in your writing toolbox is in your pocket, in your iPhone or smartphone.</strong></p><p>Then finally I will show you the way to get the friends and resources to turn your emotional idea into a message and then into the reality of the book that you share with others.</p><p>I remember the day when my daughter sent me a copy of her first book with a little note attached that said, \"Dear Mom and Dad <strong>...     I wrote a book!\"</strong></p><p><strong>Now you can say that too!</strong></p>", 
    "end_date": null, 
    "title": "Create Your First Kindle Book in 30 Days. iPhone it in!", 
    "price": "20.00", 
    "instructors": "Stan Hustad", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631662_e4e2_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-writing-your-first-book-by-using-your-iphone/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T19:54:02Z"
}