{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">People are busier than ever and form <strong style=\"\">fast first impressions</strong> about the people they meet.</p><p style=\"\">After the “<strong style=\"\">Enticing Elevator Speeches: Increase Your Income 30 Seconds At A Time</strong>&quot; course, you will be better able to create a succinct, clear message about you and your business that will help you stand out from the crowd, leave a favorable first impression on the people you meet, and reach your career goals.</p><p style=\"\">This <strong style=\"\">online course</strong> will help you develop a natural-sounding elevator speech that draws people in and helps you form meaningful connections. <strong style=\"\">You will learn</strong>:</p><ul style=\"\"><li>the basics of elevator speeches<ul style=\"\"><li>what they really are</li><li>why you need an enticing one</li><li>when to give yours</li></ul></li><li>the 5 components of a SuperStar elevator speech</li><li>how to deliver both a long and short version of your “verbal commercial&quot;</li><li>the importance of treating the elevator speech as part of a conversation</li></ul><p style=\"\">As a <strong style=\"\">BONUS</strong>, you will have access to our <strong style=\"\">audio library</strong> of elevator speeches, so you will be able to</p><ul style=\"\"><li>hear what a <u style=\"\">good</u> one sounds like</li><li>hear what a <u style=\"\">bad</u> one sounds like</li></ul><p style=\"\">You can also get inspired by the <strong style=\"\">16 Enticing Elevator Speech Examples</strong> – and use them to refine YOUR elevator speech.</p><p style=\"\">You will also receive access to these additional BONUSES:</p><ul style=\"\"><li><strong style=\"\">The “Stop-Giving-Me-So-Much-Work-To-Do!&quot; elevator speech</strong> <em style=\"\">(For those who already have WAY too much to do, but have a hard time saying “no&quot; when people ask them to take on even more.)</em></li><li><strong style=\"\">The “Change Your Reputation&quot; elevator speech</strong> <em style=\"\">(This is for people who find that their reputation always precedes them, but that reputation no longer serves them.)</em></li><li><strong style=\"\">The “Yikes-I&#039;m-Nervous-What-Do-I-Do-Now?!&quot;</strong> technique <em style=\"\">(This is for when you are feeling stressed and anxious and afraid that you&#039;re going to screw up and say or do something to embarrass yourself.)</em></li></ul><p style=\"\">You&#039;ll have an opportunity to refine your elevator speech to stand out from the crowd, and use your Personalized Action Plan to become even more successful.</p><strong style=\"\">Time Investment</strong><p style=\"\">This course will take between 45-90 minutes to complete, depending on the time you spend in the course videos, on refining your elevator speech and crafting your action plan.</p>", 
    "end_date": null, 
    "title": "Create an Elevator Speech: Get Noticed Remembered & Rewarded", 
    "price": "50.00", 
    "instructors": "Michelle Braun", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/478562_7cbf_2.jpg", 
    "course_url": "https://www.udemy.com/hook-30-seconds-to-get-noticed-remembered-and-rewarded/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-17T00:41:43Z"
}