{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will teach you how to create and sell online courses from your own WordPress website. Your courses will be <strong class=\"redactor-inline-converted\">fully integrated into your existing website</strong>. And if you don't already have a site, the course will cover what you need to know to get one up and running easily.</p>\n\n<p>This course is ideal for you if...</p>\n\n<ul><li>You are someone who just wants to learn how to create and sell online courses from your own WordPress website.</li><li>A Udemy instructor who wants the freedom to sell courses at ANY price you want to sell them for, market them the way you want, discount them as much as you want, and build your own email list</li><li>You want something that is part of your existing site, and not bolted on as a sub-domain</li><li>You just don't like paying monthly fees</li></ul>\n\n<p><em class=\"redactor-inline-converted\"><br></em></p>\n\n<p>In this course you'll be shown the different ways in which you can easily create a system in WordPress at minimal cost in which you can structure your lectures into a course, stream your video content, and package those courses up securely so that you can market them, sell them, and manage your paying students.<br></p>\n\n<p><em class=\"redactor-inline-converted\">This course is not based on theory, it's based on the instructor's experience of building sites just like this, and you will be taken through his own website to see exactly how he has implemented his own solution.</em><br></p>\n\n<p><strong class=\"redactor-inline-converted\">So how much will it cost to build your own courses on your own site?</strong></p>\n\n<p>Well, unlike the alternatives, with their high monthly fees, the cost of doing it yourself, and ending up with something that is fully integrated into your site, can be as little as $0 if you already own a domain name and have some hosting. Yes, that's right, you can set up a very professional system which includes a learning management system, something to handle the membership side of things for your students, and take payments securely - <strong class=\"redactor-inline-converted\">and it needn't cost you a penny!</strong>    </p>\n\n<p><em class=\"redactor-inline-converted\">But you aren't going to be shown just one way of doing this...</em></p>\n\n<p>You are going to be show three different ways in which you can setup your website to build courses and sell them. <strong class=\"redactor-inline-converted\">There is something for everyone, however simple or complex you want to make things, and however much or little you want to spend on your site</strong>.</p>\n\n<p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">FAQ</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Q. Will the course teach me how to use Powerpoint, Camtasia, and/or video editing? </strong><br><em class=\"redactor-inline-converted\">A. No - It's assumed that you either have a course already built that you want to publish, or you know the basics of how to create lectures and put a course together.</em></p>\n\n<p><strong class=\"redactor-inline-converted\">Q. Do I need to already have a domain name, hosting or website to take this course?</strong><br><em class=\"redactor-inline-converted\">A. No - I take you through the basics about getting a domain name, hosting, and installing WordPress.</em></p>\n\n<p><strong class=\"redactor-inline-converted\">Q. Do I need to know WordPress to do this course?</strong><br><em class=\"redactor-inline-converted\">A. While the course goes through setting things up in detail, it is not a course about teaching you WordPress itself. WordPress is very straightforward and easy to learn and there are plenty of free courses on Udemy that will help you pick it up if you are brand new to it.</em></p>\n\n<p><strong class=\"redactor-inline-converted\">Q. How much will it cost me to build my site?</strong><br><em class=\"redactor-inline-converted\">A. Assuming you already have a domain name and hosting (and they can be picked up very cheaply if you haven't) then the solutions covered in the course range from free, up to in the region of a couple of hundred dollars. It's entirely up to you how much or how little you spend on it. I aimed to make everything as low cost as possible. The free solutions work VERY well.</em></p>\n\n<p><strong>Q. What if I run into problems?</strong><br><em class=\"redactor-inline-converted\">A. It's unlikely as I've made everything as straightforward as possible, but in the unlikely event that you do then I'll be there in the discussion area, ready to give you help, should you need it.</em></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Create & Sell Courses on Your Own Website - No Monthly Fees", 
    "price": "35.00", 
    "instructors": "Chris O'Connor", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802028_66cc_2.jpg", 
    "course_url": "https://www.udemy.com/onlinecourses/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T16:14:17Z"
}