{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This in-depth and actionable course is <em class=\"redactor-inline-converted\">FREE</em> for a limited time! This course is valued over $300 and won't stay free for a long time.</strong></p>\n\n<p>----</p>\n\n<p>Create An Ebook That Crushes It will show you, from start to finish, <em>how to create an ebook, generate buzz and launch an ebook successfully</em>.</p>\n\n<p>When most people think about writing and selling their own ebook, they often look at Amazon Publishing.</p>\n\n\n\n\n\n<p>The problem with this, is you don't own your customer, you don't control your marketing, and you compete on the same real estate as other similar ebooks.</p>\n\n\n\n<p>If you want to build for the long-term and create a platform you can make money on for years and years, you'll want to look into self-hosted self-publishing.</p>\n\n\n\n<p>This is what I did when I launched Fiverr Success years ago.</p>\n\n\n\n<p>This little ebook was sold on my site. No Amazon self-publishing.</p>\n\n\n\n\n\n<p>Yes, I did have to market my own ebook and build a site for it. However, when I sent traffic to my site, they only saw my ebook. No distractions, no recommendations of competitor ebooks on my product listing.</p>\n\n\n\n\n\n<p>Not only that, when someone purchased my ebook, that customer was mine. I could continue building a relationship with that customer through email.</p>\n\n\n\n<p>Why's this important?</p>\n\n\n\n<p>As I built my platform, I began to create more products, such as ebooks and courses, which past customers of my first ebook purchased.</p>\n\n\n\n<p>Because I had built a relationship with past customers on my own platform, it gave me the power to sell more useful products to these customers.</p>\n\n\n\n\n\n<p>Do you need to be an expert to sell your own self-hosted ebook?</p>\n\n\n\n\n\n<p>No. I wasn't the most successful Fiverr seller when I wrote my ebook. Far from it. However, I knew enough that I could create something that not only helped a lot of people, but made me money.</p>\n\n\n\n<p>In Create An Ebook That Crushes It, I show you how to <strong class=\"redactor-inline-converted\">build a powerful platform</strong>, like the one I built, from scratch that allows you to continue to earn money without needing to be an expert in your industry or a professional writer.</p>\n\n\n\n<p>What I teach is how to create, launch and sell an information product. The different is you're not wasting your reader's time with fluff and stories. You're providing them information that gets them from A to B.</p>\n\n\n\n<p>Great golf player? Teach someone how to improve their drive by 100 yards in 30 days.<br>Great graphic designer? Teach someone the basics of Photoshop.</p>\n\n\n\n<p>Know more on a subject than most, where there's a lot of beginners looking to learn? You're in an excellent position to create and earn a lot of money with an ebook.</p>\n\n\n\n<p>This course will <strong class=\"redactor-inline-converted\">break everything down, step-by-step</strong>, when it comes to deciding on the niche and topic for your ebook, writing your ebook (without needing to be a writer), to launching your ebook successfully and marketing your ebook for the long-term.</p>\n\n\n\n<p>The best part is that this doesn't require a massive investment. Information products are a great business model because there's no huge upfront or recurring costs, along with zero inventory and little maintenance.</p>\n\n\n\n<p>All that's required is that you're willing to put in the work and time upfront to create something that will create a platform and business model for you, for the long-term.</p>", 
    "end_date": null, 
    "title": "Create an Ebook That Crushes It (Without Relying on Amazon)", 
    "price": 0, 
    "instructors": "Corey Ferreira", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/885278_cee0_2.jpg", 
    "course_url": "https://www.udemy.com/create-an-ebook-that-crushes-it-without-relying-on-amazon/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-22T13:44:07Z"
}