{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you have what it takes to be a successful Internet entrepreneur? Take the Entrepreneur Test and find out..How do you create a successful online presence be it a website or blog? You can create a website that works for you, that will draw new clients, new members and new visitors that will want your service and/or products and I can show you how. There are a lot of web sites out there, millions on the Internet. That is a huge number of websites for people to sift through to find yours! Most people searching on the Internet will look at the top ten to twenty listings rarely farther then that unless what they are seeking is not in the top ten results from a search engine. If the home page of your web site does not capture their attention in the first few seconds, they will move on. If your web site does not have a professional look, they will move on. If your web site is not easy to navigate they will move on.</p>\n\n<p>This course includes all you need to know to take an idea and create a successful Internet presence, from conception to success!  Through video lectures, assignments and checklists you are given all the tools you will need to get off to a successful start and to build on that success..</p>\n\n<p>I cover where to go to find a domain name and then register it. What is the best hosting company for your web presence?  Do you want to use a site builder, wordpress or on your own to create your online presence?  What about your web presence design?  How can you make your online presence interactive?  How can you get online and offline leads?  All of this and more....I leave no stone unturned to provide you will all you need to create a successful online presence.  Take a look at the course goals and sign up now!</p><p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Creating a Successful Online Presence", 
    "price": "25.00", 
    "instructors": "Rev. Donna Kopitsky", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/798476_d90f_3.jpg", 
    "course_url": "https://www.udemy.com/creating-a-successful-online-presence/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-20T01:48:20Z"
}