{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>****UPDATED 2016: AUDIO ISSUES AND REVERB  ON LECTURE 24 FIXED****</strong><br></p><p>Learn how to crowdfund without spending 1000s of dollars upfront.  You can successfully crowdfund an innovative private label product with this step-by-step guide.</p><p><strong>The goal of this course is to give you a promotional strategy and planning guide so that you can successfully crowdfund a PRIVATE LABEL PRODUCT  to sell through Amazon, your own dropship store, or through a chain retail store. </strong></p><p>This course is for you if:</p><ul><li>you want to crowdfund a physical product (no apps or software)</li><li>you tried to crowdfund before and failed</li><li>you have trouble promoting or pre-launching a product</li><li>you don't know where to start when designing your campaign page</li></ul><p><br></p><p> This course does not parrot the same articles and resources on crowdfunding.  I called this course \"The Mythbuster Course\" because you will find following my strategy you do not need what many publications call for.  You will find that you <strong>DO NOT NEED</strong>:</p><p><br></p><ul><li>To spend 1000s on your campaign video</li><li>Spend money on Pay-per-click ads (No Facebook or Google ads)</li><li>To spend months trying to get media coverage</li></ul><p><br>  </p><p>This course covers topics not covered in <strong>ANYWHERE ELSE</strong> like...</p><ul><li>How to create a video without spending 1000s on a videographer</li><li>How to properly curate a social media campaign without needing 1000s of followers</li><li>Innovative ways to build your audience</li></ul><p><br></p><p>In addition you'll learn:</p><ul><li>How to properly set up your campaign page and make it look professional</li><li>A hack to get Indiegogo or your chosen Crowdfunding platform to promote your product for you</li><li>How to streamline your Crowdfunding campaign and lower stress during your campaign</li></ul><p><br></p><p><strong>30 Day Money Back Guarantee if you feel this course is not for you.</strong></p><p>If you are currently thinking of crowdfunding a product, even your own inventiion, this course will increase your confidence and give you a more control over your campaign outcome.</p><p>Take the guesswork out of how to structure your campaign</p><p><br></p><p><strong>See you inside!</strong></p>", 
    "end_date": null, 
    "title": "Crowdfunding for Private Label Products- Textbook Included", 
    "price": "20.00", 
    "instructors": "Jon Bowser", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658410_a145.jpg", 
    "course_url": "https://www.udemy.com/crowdfundingmythbuster/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T01:44:44Z"
}