{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Full Disclosure: This course is covered - in its entirety - in the more advanced course, \"Crowdfunding: The Nitty Gritty - from Great Idea to Launch.\"</strong></p><p>Are you curious whether YOUR IDEA is right for Crowdfunding? In this Introduction to Crowdfunding course, Rob McCallum takes you over first critical hurdle for any potential campaign - whether your idea is worthy and right for crowdfunding.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Rob McCallum, the \"King of Kickstarter,\" has raised more than $140,000 across multiple campaigns.</strong> He brings his unique take to the concept of crowd funding  and lays out the essentials tips and assets you’ll need in place to see success. </p>\n\n<p>In 2015, about $5 BILLION was pledged in Crowdfunding campaigns, changing how ideas are financed!</p><p>Maybe, you've already made the decision to Crowdfund your first Idea. For you, this course is a critical checklist to make sure you've made ALL of the appropriate considerations.</p>\n\n\n\n\n\n<p>Rob breaks down this complex subject matter and delivers it through casual conversation. </p>\n\n\n\n\n\n<p>Presented by Dr. YouTube, Robert Scot, the course is professionally produced and logically laid out, and easy to follow. If you already have taken a course presented by Dr. YouTube, you know his courses are aimed at trying to help entrepreneurial students earn more money.</p>\n\n\n\n\n\n<p>So, you've already decided to kick off your first Crowdfunding campaign? Woah .. Slow down and go through this course. Rob gets into details that you may not have considered - there's nothing like a calm, experienced hand to help navigate through unfamiliar waters! </p>\n\n\n\n\n\n<p>The course includes a great discussion on how to use your existing background and expertise to further promote your campaign.<br></p>\n\n\n\n\n\n<p>\"Rob McCallum is super sharp and does an amazing job of getting under the hood of the whole crowd funding phenomenon,\" said Dr. YouTube. \"He provides details through anecdotes related to his Nintendo Quest video crowd funding campaign that you really can't get any where else.\"</p>\n\n\n\n\n\n<p>Learn about the kind of key art you’ll need and the magic formula for the perfect campaign video. By the end of the discussion, you’ll know whether your idea is perfect for crowdfunding, or how to alter it in the perfect way to set yourself up for unimaginable success.<br></p>", 
    "end_date": null, 
    "title": "Crowdfunding 101: Use Kickstarter To Raise Capital", 
    "price": "20.00", 
    "instructors": "Robert Scot, Rob McCallum, Josh Schmidt", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776422_6c8f_4.jpg", 
    "course_url": "https://www.udemy.com/crowdfunding-101-how-to-succeed-on-kickstarter/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T23:03:44Z"
}