{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  During its first campaign, the \"Coolest\" cooler never reached its funding goal. After the founder retooled his approach and launched a second campaign, the \"Coolest\" went on to become the most-funded crowdfunding project of all time.  </p>  <p>  \t  Many hardware entrepreneurs make the mistake of assuming that a killer product will essentially sell itself. The truth is, without the proper preparation and optimization crowdfunding campaigns may never get off the ground, no matter how awesome the product is.  </p>  <p>  \t    This course takes a look at what makes a successful hardware crowdfunding campaign and how to accomplish the same. Through exclusive interviews with multiple hardware entrepreneurs who have each raised more than $500K through crowdfunding, you will learn how these founders exceeded their goals by an order of magnitude.  </p>  <p>  \t    The course is taught through a mix of interviews, instructional videos and slide decks. There are no assessments during the course and you are not required to use any outside materials or programs. You will benefit from over 7 hours of course content.  </p>  <p>  \t    There is nothing more exciting than watching all of your hard work come to fruition as your crowdfunding campaign rockets past your goal within a few days, hours, or even minutes. Be one of those entrepreneurs who gets everything right on their first try: learn how to Hack the Crowd.  </p>", 
    "end_date": null, 
    "title": "Crowdfunding for Novices: Prepare & Run Your First Campaign", 
    "price": "50.00", 
    "instructors": "Alexis Houssou, Hardware Club, Barbara Belvisi", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/405276_8013_21.jpg", 
    "course_url": "https://www.udemy.com/crowfunding-for-novices-prepare-and-run-your-first-campaign/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-27T14:02:28Z"
}