{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tHow would you like to…..<br><strong>* Get all your clients from referrals.<br></strong><strong>* Have your friends eagerly send referrals to you.<br></strong><strong>* Have business acquaintances send clients your way.<br></strong><strong>* Meet people and have them call you the next day.</strong></p>  <p style=\"\">  \tThis can all be done through referral marketing.  Referral marketing is <em>an easier and faster way to get clients</em> that requires no cold-calling or blind networking.    \t  \tYou'll learn proven referral-marketing strategies:  </p>  <ul>  \t<li><strong>A method to connect with 500 new people without lifting a finger.</strong></li>  \t<li><strong>A strategy to get referrals on a large scale from networking.</strong></li>  \t<li><strong>A technique to use at meetings that will have people coming up to YOU.</strong></li>  </ul>  <p style=\"\">  \tThese methods require NO cold-calling. NO cold-networking. NO expensive advertising. NO sales-pitches, and NO contrived 30-second message.  \t  \tHere's what you'll get when you use the marketing strategies in this course:  </p>  <p><strong>1. Immediate referral customers from friends and clients.<br></strong><strong>2. More referrals from your networking groups.<br></strong><strong>3. More referrals from people you've just met.<br></strong><strong>4. More loyal customers, which means – repeat business.<br></strong><strong>5. Less stress, and no feeling like a pushy salesperson.</strong></p>  <p style=\"\">  \tYou'll also get spreadsheets, templates, scripts, and an implementation plan; all designed to get you started right away.  </p>  <p style=\"\">  \tThis comes with Udemy's 30-day money-back guarantee, so there's no risk.  In addition, you'll have lifetime access to the course, so when I add new strategies, techniques, and templates, you'll get them free of charge.  \t  \tSo sign up for this course right away. <br><br>You can apply these techniques the moment you've finished taking the course. <em>Every day you wait is another day you'll be missing out on having prospects call YOU.</em> So take this course and get started right away.  </p>", 
    "end_date": null, 
    "title": "Customers by Referral Only", 
    "price": "50.00", 
    "instructors": "Gordon Parlova", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361568_5c72_3.jpg", 
    "course_url": "https://www.udemy.com/clients-by-referral-only/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-02T16:58:26Z"
}