{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Dirigido a emprendedores o startups que quieren aprender las BASES para hacer CRECER un negocio. Los FUNDAMENTOS son los que te permitirán crecer de una forma sostenida en el tiempo (y no cumplir las estadísticas que dicen que el 90% de las empresas mueren antes del octavo año). </p>\n\n<p>Según Pareto, el 20% de las acciones traen el 80% de los resultados. Pues si aplicamos la ley de Pareto otra vez, el 4% (20% del 20%) trae el 64% (80% del 80%) de los resultados. Y este curso trata de este 4% que solamente las mejores empresas hacen (y el 96% han olvidado y sufren sus consecuencias).</p>\n\n\n\n\n\n<p>Comparto un taller de unas 2,5h de duración que he realizado a startups que formaban parte de un programa de aceleración de la Generalitat de Catalunya (Start Up Catalonia). Se trata de 54 vídeo-lecciones simples y prácticas que muchas veces los emprenedores pasan por alto. </p>\n\n\n\n<p>Para sacar el máximo provecho te recomiendo que tengas lápiz y papel para apuntar como mínimo 10 acciones que pondrás en marcha una vez finalizado el taller. </p>\n\n\n\n<p>Y qué puedes esperar aprender de este taller?</p>\n\n\n\n\n\n\n\n<p>El taller se divide en las 6 fases de crecimiento de una empresa y hace más énfasis en las primeras 3 fases que son: </p>\n\n\n\n\n\n\n\n<p>1) Principios Básicos (y no tan obvios) a tener en cuenta ANTES de montar cualquier negocio</p>\n\n\n\n\n\n\n\n<p>2) Conseguir Tracción mediante una metodología científica</p>\n\n\n\n\n\n\n\n<p>3) Aprender a Vender y hacer Marketing</p>\n\n\n\n\n\n\n\n<p>4) Sistematizar todo aquello que es rutinario</p>\n\n\n\n\n\n\n\n<p>5) Aspectos básicos para formar el mejor Equipo</p>\n\n\n\n\n\n\n\n<p>6) Cómo Replicar los 5 puntos anteriores \"n\" veces más</p>\n\n\n\n\n\n\n\n<p>Si de verdad quieres hacer CRECER tu negocio debes prestar atención a las BASES sobre las que estás levantando tu futuro. Según los participantes en dicho taller, es una de las \"mejores inversiones de su tiempo desde hace muchos años\".<br></p>", 
    "end_date": null, 
    "title": "Cómo acelerar el crecimiento de tu negocio", 
    "price": "45.00", 
    "instructors": "Sergi Mora", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854068_7150_4.jpg", 
    "course_url": "https://www.udemy.com/businessbasics/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-19T14:49:50Z"
}