{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"></p><ul style=\"\"><li style=\"\"><strong style=\"\">4 Módulos de Contenido para que lo dividas en 4 semanas</strong>. Después de probar este sistema con otros emprendedores hemos comprobado que al dividir el Entrenamiento en semanas se alcanzan hasta un 160% más de resultados.</li></ul><ul style=\"\"><li style=\"\">Tendrás acceso a más de<strong style=\"\">&nbsp;4 horas de vídeo</strong>, y ¿por qué vídeo? hemos elegido este formato porque nuestro cerebro retiene 4 veces más información que si lo leemos y 2 veces más que si lo escuchamos, y esto es la pieza básica del&nbsp;<strong style=\"\">sistema del Pro Aprendizaje&nbsp;</strong>&nbsp;que usaremos para que aprendas en 30 días lo que otros tardan años en aprender. Además podrás ver los vídeos todas las veces que quieras, para siempre.</li></ul><ul style=\"\"><li style=\"\">También he preparado una&nbsp;<strong style=\"\">Guía de Acción</strong>&nbsp;de cada módulo para que después de ver el vídeo realices durante la semana los pasos detallados en el plan de acción y así ir conquistando la cima…tu sueño. Y aún más importante estas guías de acción son para ti de manera permanente, es como tener la solución de un juego antes de empezarlo y a partir de ahora siempre que lo empieces lo ganarás.</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">1 plan estratégico de proyecto</strong>, No sólo vas a pasar a la acción y vas a poner a andar, o más bien a correr, tu proyecto, sino que además tendrás un<strong style=\"\">&nbsp;detallado Plan de Proyecto</strong>&nbsp;que he diseñado para que tu éxito sea inevitable. Irás asegurando tus pasos, con la confianza de saber que estás en el camino correcto. Esta plantilla es fruto de horas y horas de investigación y de prueba y error y ahora está disponible para ti con este curso.</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">1 Guía de regalo sobre el diseño de Mapas Mentales,</strong> una herramienta eficaz para la organización y la creación de ideas poderosas.&nbsp;</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">Bono De Regalo </strong>de una&nbsp;MasterClass de Marketing: <strong style=\"\">8 Pasos Para Poner Tu Negocio en Piloto Automático,&nbsp;</strong>impartida por Nacho Muñoz, un crack del Marketing Online y el VideoMarketing (www.marketingaldesnudo.com)<span style=\"\">&nbsp;</span><strong style=\"\">¿Y qué aprendes en esa MasterClass?</strong>&nbsp;La verdad es que te llevas cosas en dos horas que otros tardan años en recibir. Soy una de las pruebas vivientes de Nacho.&nbsp;</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">Aprenderás lo que es el&nbsp;<em style=\"\">Funnel Marketing</em></strong>&nbsp;y ya siempre podrás diseñar tus propias estrategias&nbsp;online.</li></ul><div style=\"\"><p style=\"\"></p><ul style=\"\"><li style=\"\"><strong style=\"\">Sabrás exactamente cuál es el público al que has de dirigirte.</strong></li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">Conocerás recursos para investigar y estudiar el mercado.</strong></li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">Aprenderás cómo hacerte tus planes de acción</strong>&nbsp;<strong style=\"\">de Marketing Online&nbsp;</strong>para que no se te escape nada.</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">Sabrás cómo hacer tu Propuesta Única de Ventas.</strong></li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">Conocerás maneras de mover y promocionar tus productos en la red,</strong>&nbsp;cómo atraer a tu público y hacer que tus listas de correo se llenen de personas interesadas en tus productos.</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">Aprenderás a crear productos diferentes&nbsp;y saber cómo hacer ofertas irresistibles</strong>&nbsp;para tus clientes.</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">Sabrás como eliminar las objeciones y cómo redactar textos vendedores&nbsp;</strong></li></ul><div style=\"\">Y todo esto, por una inversión mínima que recuperarás en cuanto tengas tu primer cliente. ¿A qué esperas? Pon en marcha tu proyecto en 4 semanas y en piloto automático.&nbsp;<span style=\"\"><br style=\"\"></span></div><p style=\"\"></p></div><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Cómo Superar Tus Miedos y Emprender con Éxito en 31 días", 
    "price": "20.00", 
    "instructors": "Sara Duarte", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/53015_ae7d_8.jpg", 
    "course_url": "https://www.udemy.com/clavesyherramientasparaemprenderconexitoen4semanas/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-09T02:20:53Z"
}