{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In less than an hour you will understand the causes of writer's block, what creativity really is and some simple tricks to use your mind more effectively to overcome writer's block and increase your creativity.</p><p><strong style=\"\">Learn The Secret Techniques That Geniuses Like Beethoven, Einstein And Edison Used To Take Their Creativity To A Higher Level So You Can Eliminate Writer's Block When It Happens.</strong></p><p>Learn the source of writer's block, Coordinate your conscious, subconscious and superconscious minds to solve problems, Understand what creativity really is, Change your level of consciousness to increase your creativity</p><p><strong style=\"\">Discover The Secret Resource You Don't Even Know You Have</strong></p><p>If you are a novelist struggling to overcome writer's block this course is exactly what you have been looking for. In less than an hour you will learn the simple, but secret, tricks to use your mind more effectively and eliminate the frustration that is often associated with writing. This is not information you will find in your typical writing course. Here you will learn how to focus your thinking to solve problems quickly and easily. You will also learn about your three different minds, your two types of imagination and how your brain communicates at different frequencies so you can easily change your level of consciousness and overcome your problems. </p><p><strong style=\"\">Course Overview</strong></p><p>This course is designed for writers of any level who suffer from writer's block and want to overcome it once and for all. We will start by understanding exactly what writer's block is because until you know who the enemy is you don't know who to fight. From there we will move to understanding just what creativity is and how it works.</p><p>Once we cover those fundamental topics we will discuss the various components of the human mind and exactly how they work. You will learn the difference between your conscious, subconscious and super conscious minds and how they work in coordination with each other.</p><p>You will also learn what “learned helplessness\" is, how it relates to writer's block and some simple techniques to focus your thoughts and overcome it. And finally, you will learn how to change your level of consciousness and effectively daydream your way out of writer's block.</p><p>Besides over coming writer's block by the end of this course you will have access to a website where you will find a wide variety of articles writing, publishing and marketing your book online. Here you will be able to join a community of like minded writers where you will be able to receive critiques of your work, request reviews for your books and join in conversation with writers from around the world who are facing the same issues as you are.</p>", 
    "end_date": null, 
    "title": "Daydream Writer's Block Away And Sell More Books", 
    "price": "30.00", 
    "instructors": "Jim Conway", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565328_8e73_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-daydream-your-way-out-of-writers-block/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T17:53:13Z"
}