{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Lerne, deinen ersten eigenen Udemy-Online-Kurs zu veröffentlichen!</p><p>Möchtest du ...</p><ul><li>anderen etwas beibringen?</li><li>mehr Geld verdienen, und zwar ohne Zeit gegen Geld zu tauschen?</li><li>einen Expertenstatus zu einem Thema aufbauen?</li></ul><p>Dann solltest du einen Online-Kurs veröffentlichen!</p><p>ABER...</p><ul><li>du weißt nicht worüber?</li><li>du weißt nicht, wo du anfangen sollst?</li><li>du hast Angst vor der Technik?</li><li>du denkst, du hast nicht genug Zeit?</li></ul><p>Dann ist dieser Kurs das richtige für dich!</p><p>Du lernst, deinen ersten Udemy-Kurs zu erstellen - Schritt für Schritt, schnell und einfach. Wir behandeln alles, was du wissen musst: Udemy-Grundlagen, Ideenfindung, Kursstruktur, Präsentation, Videoaufnahme und Veröffentlichung.</p><p>Am Ende des Kurses wirst du in der Lage sein, ...</p><ul><li>eine für dich optimale Kursidee zu entwickeln</li><li>diese in eine solide Kursstruktur zu überführen</li><li>passende Inhalte und Präsentationen für deinen Kurs zu erstellen</li><li>diese als Screencast aufzunehmen, um Kursvideos zu erstellen</li><li>die Videos schnell und effektiv nachzubearbeiten und zu exportieren</li><li>den ersten Kurs anzulegen und zu veröffentlichen</li></ul><p>Je nach deinem Tempo dauert das mindestens ein paar Tage - aber mit dieser Schritt für Schritt Struktur geht es viel schnell als du wahrscheinlich dachtest! </p><p>Lass es mich dir zeigen! Wir sehen uns im Kurs!</p>", 
    "end_date": null, 
    "title": "Dein erster Udemy-Online-Kurs: einfach und schnell erstellen", 
    "price": "50.00", 
    "instructors": "Dr. Johannes Metzler", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/788388_f506.jpg", 
    "course_url": "https://www.udemy.com/erster-online-kurs-einfach-schnell-erstellen/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T12:34:02Z"
}