{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">&quot;Schritt für Schritt konkurrenzfähige und kostendeckende Angebote erstellen.&quot;</strong>  </p>  <p style=\"\">  \t Die  Entwürfe sind auf Pappe geklebt, der Text ist geschrieben, das Fotoshooting war ein Erfolg – Momente, die dem Kreativen das  erhebende Gefühl vermitteln, einen der schönsten Berufe der Welt  auszuüben. Am Monatsende wird die Euphorie gedämpft: der Blick auf das  Konto! Wo soll zwischen den Zeilen der Gewinn versteckt sein? Das ist  doch nicht möglich! Man hat doch rund um die Uhr geschuftet.  </p>  <p style=\"\">  \t Es  bleibt nur eine Schlussfolgerung: Die eigene Arbeit wird nicht  ausreichend vergütet.  </p>  <ul style=\"\">  \t<li style=\"\">Aber was heißt genau ›ausreichend‹? </li>  \t<li style=\"\">Wie berechne  ich eine ›vernünftige‹ Vergütung? </li>  \t<li style=\"\">Was sollte, darf oder muss sogar ein  Signet, eine Visitenkarte, ein Text, eine Fotoarbeit, eine Beratung oder  Website kosten? </li>  \t<li style=\"\">Mit welchen Angeboten verdiene ich gutes Geld?</li>  \t<li style=\"\">Was sind Nutzungsrechte und wie berechne ich diese?</li>  \t<li style=\"\">Und wann  verschrecke ich meinen Kunden?</li>  </ul>  <p style=\"\">  \t Ziel dieses Workshops ist es, dass ihr  euren eigenen Stundensatz berechnen – und auf dieser Grundlage  realistische Angebote erstellen könnt. Dabei kann (und wird) das  Ergebnis durchaus von den Empfehlungen der Berufsverbände abweichen.  Aber wichtiger als das Streben nach fiktiven Zahlen ist die kaufmännisch  ordentliche Kalkulation der Leistung.  </p>", 
    "end_date": null, 
    "title": "Design kalkulieren - Professionelle Angebote erstellen", 
    "price": "30.00", 
    "instructors": "Marco Linke", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/194554_3dea_2.jpg", 
    "course_url": "https://www.udemy.com/design-kalkulieren-professionelle-angebot-erstellen/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-06T10:06:20Z"
}