{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Ever wanted to create your own custom eBay template but don't have the technical means and just want to add some simple ZAZZ to your business then this is the course for you!</strong><br><br>Increase sales by at least 50% and create brand awareness with your custom eBay listing template no need to use Photoshop or any paid service as we get to use GIMP a simple free design software and use a HTML editor and create this listing.</p><p><br>Not only do you learn some simple HTML and image editing you also learn the function of a FTP server and register a domain name for your business and as a added bonus FREE HOSTING!<br><br>You can upload your images to a site and call your images from there to bypass the first portion of the lessons however i would not recommend it.<br></p><p>eBay is a huge market place and one way to stand out apart from the price is your listing design and that is exactly what we will be doing!</p><p><strong>If you want to increase your earning potential but are not technological in any form then this is course for you! It's simple, easy to grasp and easy to learn and implement just copy everything from the course and add your own twist your imagination is the ultimate tool here.</strong><br><br>So don't delay take this course today!<br><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Design a custom eBay Listing Template with gimp", 
    "price": "20.00", 
    "instructors": "Pixelated Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619202_9dd3.jpg", 
    "course_url": "https://www.udemy.com/design-a-custom-ebay-listing-template-with-gimp/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T13:02:52Z"
}