{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Encourage even MORE sales on eBay &amp; stand out from the crowd by learning how to create your own Professional eBay Listing Template using just Adobe Photoshop!</strong></p><p>As you know eBay is an extremely large marketplace. It can be very hard to separate yourself &amp; stand out from from the crowd &amp; other clutter on there. </p><p>One great way to stand out is to list your items for sale with a great looking <strong><em>professional </em></strong><strong><em>eBay listing template design</em></strong> - with which you can list your items for sale. This screams professionalism and instantly sets you apart from the competition!</p><p><em><strong>Over 2500 students have already jumped straight into this course &amp; are reaping it's benefits!</strong></em></p><p>-------------------------------</p><p>Did you know that if you have and use Adobe Photoshop then you already have everything that you need to stand out from the crowd and set yourself apart from the the rest. If you can take the time to design your own listing template rather than using the bog-standard ones that eBay provide (and that everyone else can use), then you are bound to increase sales &amp; stand out in visotors minds.</p><p><strong>So why take this course?</strong></p><ul><li>It's been proven that having a professional image on eBay increases sales. Think about it, who are you more likely to buy the same product from - a seller that looks like a professional company, or someone who looks like a one-man-band running the business from his bedroom?</li><li>A professional listing template increases customer confidence in you, your brand &amp; your business</li><li>You won't have to settle for the boring &amp; quite frankly rubbish templates that eBay try to get you to use. You know the tacky looking ones with flower &amp; vase icons on!</li></ul>", 
    "end_date": null, 
    "title": "Design Your Own Pro eBay Listing Template with Photoshop", 
    "price": "20.00", 
    "instructors": "LearnCadia - Learning Unlimited!", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/487770_8885.jpg", 
    "course_url": "https://www.udemy.com/how-to-design-an-ebay-listing-template-with-adobe-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-27T18:13:39Z"
}