{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\">Want to double your money?</em></strong></p><p>If you buy a bottle of water for $1 in a store and sell it for $2 on the beach you can double your money. </p><p><em style=\"\"><strong style=\"\">Everybody understands this concept! </strong></em></p><p>But why are you not doing it?</p><p>Because you need a sales license, transportation, cooling, time - and of course <strong style=\"\">a beach</strong> to do it.  And if the cost is higher than the profit, it doesn&#039;t pay off. </p><p>With digital assets you will not need to ask the city council for a sales permission, the transportation is done online for free, you don&#039;t need cooling and you will never run out of stock, because digital assets can be cloned easily.</p><p>But the very best thing is that you can create your digital real estate wherever you want - no beach requiered, select your own!</p><p>We are doing it in front of the biggest online store and we will help people on Google street who are already in buy mode to spend their money inside - and give us a tip.</p><p><strong style=\"\">Why should you buy this course?</strong></p><p>Everybody can buy a bottle of water for $2 in a store and sell it for $2 on the beach - <strong style=\"\"><em style=\"\">and that is</em></strong> what most people do! The art is to focus on the things that matter and find a way to justify the initial invest that is required for each profit. </p><p>MC D. doesn&#039;t sell the best hamburgers. People <strong style=\"\"><em style=\"\">may be able to produce a better hamburger</em></strong>, but <strong style=\"\"><em style=\"\">they don&#039;t do it in a way that creates a cashflow positive return of invest</em></strong>.</p><p>That&#039;s the focus in this course. I do as I say and I prove it inside, step by step, with examples. It will save you time and money and it will help you to avoid costly mistakes that might take you weeks or months. And - by the way - if you have read all the text in this description - if you are interested and want to buy it - that is the best proof that digital assets work! </p><p></p>", 
    "end_date": null, 
    "title": "Digital Real Estate - How to invest in profitable assets", 
    "price": "20.00", 
    "instructors": "Raimund Bauer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576572_d722.jpg", 
    "course_url": "https://www.udemy.com/digital-real-estate-how-to-invest-in-profitable-assets/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T13:58:13Z"
}