{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tThe fast-paced global market is always changing and in order for your business idea to succeed you must plan for shifts, or pivots, that can offer new opportunities for diversification and “spin-offs.\" In this course you will develop a plan for how to stay ahead of the shifts in the market and anticipate new opportunities for your business. </p><p>Ask the owners of any sandwich franchise or garbage business if their dream as a child was to grow up making hoagies and taking out the trash.  Business builders find success by being open minded and pursuing new opportunities when they arise as long as it makes sense.  Though you may not become a garbage man or sandwich maker, every business increases their odds for success by knowing if and when to make the right changes to their products or services.</p><p>The topics we will cover in this course are as follows:</p><ul><li>Planning for Pivots and Diversification</li><li>Making Critical Pivots</li><li>Adding Products or Services</li><li>Ongoing Diversification</li><li>Pursuing New Opportunities</li></ul>We will also share the stories and strategies of successful business builders from across America so you can learn from their past experience.  We have include some exercises as well for you to implement these strategies into your own existing business or idea. By doing so, you will be prepared for the changes every entrepreneur inevitably faces during the course of launching and growing your business.", 
    "end_date": null, 
    "title": "Diversifying Your Products or Services", 
    "price": "50.00", 
    "instructors": "The Main Street Entrepreneur", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/411376_ac5b_5.jpg", 
    "course_url": "https://www.udemy.com/diversifying-your-products-or-services/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T20:19:55Z"
}