{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>[last update: 1st March 2016]</p><p>Early feedback for \"Domain Name Essentials\"....</p><p>\"Having leased domains <strong>since 1995</strong> I have <strong>consulted hundreds of clients on domain name selection</strong>. Instructor Shearing did <strong>an exceptional job</strong> in covering the subject matter. His explanations were clear, concise, and accurate. I found his presentation style engaging as well.\"   <em>Barbara Tomlin</em><span></span></p><p>--------------------</p><p>In this course you'll learn <strong>how to choose the perfect domain name</strong> for your circumstances. </p><p>I've registered some great domain names, and some duds, since my first one in 1997 so hopefully I can pass on some tips! The main bulk of the course is section two where I cover many different tips, tricks, ideas, suggestions and tools for brainstorming the best domain name. I've tried to be thorough and not leave anything out, so this course is<strong> ideal for beginners</strong> but more experienced people may also find value in it.</p><p>In section three we look at some more advanced concepts such as checking whether or not a website previously existed at a domain name and whether it had backlinks. I show you how to check the website content and backlinks to see whether or not they may have attracted a search engine ranking penalty because that could negatively affect your ability to rank new content at the domain name.</p><p>I've tried to make \"Domain Name Essentials\" short, concise and yet comprehensive and valuable. I welcome all feedback and suggestions.</p><p>After taking this course you will have learned all about how domain names work and how to choose the best one for you.</p><p>Join over 3,000 students who've signed up for this course, and start learning about choosing the perfect domain name today! :)</p>", 
    "end_date": null, 
    "title": "Domain Name Essentials", 
    "price": "20.00", 
    "instructors": "Neil and Linda Shearing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646684_00a0_11.jpg", 
    "course_url": "https://www.udemy.com/domain-name-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T11:42:26Z"
}