{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This is a course for grownups and those who want to know more about business success.</strong>  it is not an endorsement or a promotion or any kind of advocacy for Donald Trump; his politics, his positions, his persona, his personality, his ethics, or even his character.</p><p>It is given as a teacher, broadcaster, reporter, and long time business performance coach.<br></p><p><strong>it is based on a long standing belief and principle that You can always learn something of value and something useful from every event, every person, every phenomenon, every thing that happens to you, and comes into your life,</strong></p><p>This is about the business and popular <strong>phenomenon</strong> of Donald Trump, much more than it is about him as person and personality.</p><p>This man could be one of the most powerful men in the world in 2016 and if so, he got there through business success and his media presence... so if you are smart you can learn something about that whether you like him or not.</p><p>This will be10 selected things about life and business success, and understanding what is going on in the world, that can be very valuable and useful, and profitable to you.</p><p>In this short, but powerful course for busy leaders you will learn what those ten things are.  You will be challenged to make your own and good choices about what to do with your life and business this year and in the future.</p><p>Stan Hustad</p>", 
    "end_date": null, 
    "title": "Donald Trump & His Deals Teaches You About Business Success", 
    "price": "20.00", 
    "instructors": "Stan Hustad", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741396_a8cf_3.jpg", 
    "course_url": "https://www.udemy.com/donald-trump-his-deal-can-teach-you-about-business-success/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T20:04:01Z"
}