{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>There's no question that drop shipping is an extremely profitable way to make money reselling products. In my opinion, having your own website is even better, and here's why...</p><p><br></p><p>Benefits to having your own site:</p><ul><li>no profit sharing - sites like eBay take 10%, so you need to have a large profit margin/mark up to make money, but not with your own site. </li><li>all the traffic is yours - every purchase on your site goes to you, no one else as all the products are yours</li><li>flexibility in pricing - no one to undercut as buyers don't see other comparable items at the same time. </li><li>ability to make a niche store - contrary to eBay (well you can a little bit) you can conquer one niche and increase profits.... ex: gardening tools website</li><li>sell your website - if at any point you feel you want to stop or it isn't working out, a solid drop shipping website will sell for at least 2 thousands dollars... if you're smart there's a whole other business there!</li><li>no restrictions - It is your site. You do what you want. </li><li>lower cost - Wait, what? Yes, setting up a site costs money, but paying 13% (eBay and PayPal) on just <em>two </em>sales that are around $100 is $26, which is more than the cost of a website. </li></ul><p><br></p><p>If you take the course and decide having your own website isn't for you, then you can get a no questions asked, 30 day refund!</p><p><br></p><p>Look forward to seeing you in my course!</p><p>-Andrew Burich<br></p>", 
    "end_date": null, 
    "title": "Dropshipping: New Way to Make the Most Money Drop Shipping.", 
    "price": "20.00", 
    "instructors": "Andrew Burich", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/847534_2a7a_2.jpg", 
    "course_url": "https://www.udemy.com/drop-shipping-make-money-drop-shipping-on-your-own-websit/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-12T20:52:55Z"
}