{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Want to join the lucrative world of consultants? Sure you do. </p>\n\n<p>This course will give you all tools and tricks of the trade to set up your successful consulting business. The business environment is changing and more and more businesses are looking for 'outside perspective'. This course enables you to be the person with that much desired outside perspective.</p>\n\n<p>This is what existing students have to say!<br></p>\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">'Great lecturer and an excellent course. It has provided great insights into the field of consultancy.'</strong></em></p>\n\n\n\n<p><strong><em>'It is a very clear course with outstanding information. Qaiser is a great tutor and I already feel passionate about launching my new consultancy business.'</em></strong></p>\n\n<p>As an entrepreneur, you should have an ambition to start your own consultancy but you need practical knowledge to launch and make your business successful. This course does just do that for you. In over 40 lectures you are set to learn everything you need including</p>\n\n\n\n<ul><li>finding your niche</li><li>Marketing</li><li>Completing and delivering cases</li><li>Much much more</li></ul>\n\n\n\n<p>Although this course is mostly aimed at the aspiring consultants, the established consultants can also pick a thing or two.</p>\n\n\n\n<p>Enrol today and be fully equipped to launch a successful new career in the lucrative world of consultants.</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Earn over $5000 per month - become a feelance consultant.", 
    "price": "20.00", 
    "instructors": "Qaiser Raja", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702438_d4cb.jpg", 
    "course_url": "https://www.udemy.com/become-a-consultant-and-earn-from-your-knowledge/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T23:22:08Z"
}