{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>What is this course about?</strong></p><p>Many small business owners and entrepreneurs come to a point in their business where they realize they need help to continue business growth. As a business owner, you may not be at the point where you can hire an actual employee. So, hiring a Virtual Assistant is the next best step. However, finding a Virtual Assistant can feel like a daunting task. This course provides an easy to follow, step by step process on hiring a Virtual Assistant. But not just any Virtual Assistant. This course teaches you how to find a Virtual Assistant that is the right fit for you and your business.</p><p><strong>How is this course structured?</strong></p><p><strong></strong>This course includes a live action video introduction and screen capture video modules. This course is meant to be followed in sequential order. Starting with the first video and moving to the last. Each video will build on the other.</p><p><strong>Why should you take this course?</strong><br></p><p>This course if for a small business owner or entrepreneur, such as yourself, that needs an assistant in their business. You should take this course if you are either ready to hire a Virtual Assistant or if you are just thinking about hiring a Virtual Assistant. This course is also helpful for business owners who have not had a successful experience with Virtual Assistants in the past.</p><p><strong>What are the requirements?</strong></p><ul><li>You should already have a business up and running.</li><li>You should have some idea of how much your business brings in on a monthly basis.</li></ul><p><strong></strong></p><p><strong>What am I going to get from this course?</strong><strong></strong></p><ul><li>Over 10 lectures and 1 hour of content!</li><li>A list of qualities you want a Virtual Assistant to have for your specific business.</li><li>A step by step process on how to go about finding a Virtual Assistant.</li><li>Resources</li></ul><p><strong>Who is the target audience?</strong><strong></strong></p><ul><li>Small business owners or entrepreneurs who are ready to hire an assistant to help in their business.</li></ul>", 
    "end_date": null, 
    "title": "Easy Steps: How To Hire A Virtual Assistant (VA) ", 
    "price": "20.00", 
    "instructors": "Daniel Hall, Luanna Rodham", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747094_81ba_3.jpg", 
    "course_url": "https://www.udemy.com/easy-steps-how-to-hire-a-virtual-assistant/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T18:28:13Z"
}