{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>You are going to learn how to build a real business using Google Adsense as the only means to monetize it. This is not theory. It is based on an actual site that makes over $270k per year profit from Adsense alone. </p><p><strong><span style=\"color: #0000ff;\">UPDATED January 2016</span></strong><br></p><p>You are going to learn everything from finding the right domain to which WordPress theme to use, where to get content, how and where to get images, booster plugins, social media strategy, Facebook advertising, Bing Advertising, Ad placement and types of ads.</p><p>Adsense is a program provided by Google and it allows web site owners the selling of advertisements on their website without having to worry about contacting customers - it's all taken care of by Google. Google finds the advertisers and places the ads on your website. This makes Adsense the perfect candidate for building a website that generates passive income</p><p>Once you have build such a website that makes consistent money from Adsense  you can either enjoy a nice passive income from your Adsense earnings or you can sell the site for a large amount of money.</p><p>Once such a site is build there is very little to do so it's a fairly passive income.</p><p>And I am going to show you in detail how everything is done. Once you have such a site up and running you can surely add other income streams aside from Adsense to it as well.<br></p><p><strong>Requirements:</strong></p><p>In order to build such a business you need to have the time to go through the course at least two times and you need at least 5 hours per week to work on building your business. </p><p>Building this business is dependent on paid advertising. That means you need a budget so that you can fund the initial advertising. You can start small with a few dollars per day.</p><p>You will also have to purchase a domain name, hosting, a theme. You will also need content which you can create yourself or outsource.<br></p><p>As I said earlier this is a course that teaches how to build a real business as opposed to \"hoping to get free traffic\". While you can start this on a shoe string it is highly recommended to have some money available to invest in advertising.</p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Easy Passive System - Creating a Business based on Adsense", 
    "price": "25.00", 
    "instructors": "Dipl.-Ing. Hans Peter Jeschke", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647042_5399_2.jpg", 
    "course_url": "https://www.udemy.com/easy-passive-system-building-a-real-online-business-using-only-adsense/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T17:49:41Z"
}