{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Learn how I make $4,000 a month selling on eBay! </strong>  </p>  <p>  \t        In this course you will learn the basics of selling products and make a huge profit margin. This business is easy for anyone that has a decent work ethic. You may be asking &quot;what? EBay everyone knows how to sell on there.&quot; Well to be fair most people can sell on eBay however they can&#039;t make even close to a decent living. The technique I teach will be generating you a stable income that will almost triple the average sellers yearly sales total! Plus you can start your business for a few dollars, there is absolutely no need to break the bank here.  </p>  <p>  \t        In this course you will go through a comprehensive video series that will show you the exact steps I go about when finding and selling products. Each video will be in hd with a clear and crisp voice. Feel free to ask me any questions in the discussion section of the course.  </p>  <p>  \t        Please for yourself lets get started getting you that extra money you have always desired! Also by no means is this just a side gig, I mean with the right mind set you can be generating $7,000 plus a month. Its all on you to decide what you want, and if you are not a tire kicker and actually want to find success then lets get started!  </p>", 
    "end_date": null, 
    "title": "Ebay - How To Become A Power Seller On eBay And Go Fulltime!", 
    "price": "20.00", 
    "instructors": "Kyle Custis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325374_b507_4.jpg", 
    "course_url": "https://www.udemy.com/ebaymoney/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T02:59:55Z"
}