{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>        <strong>La venta online es el canal de venta con más crecimiento, y nos tiene que producir, a día de hoy, un negocio rentable.</strong> Desgraciadamente no es así en muchos casos por no haber realizado un análisis de costes de adquisición, publicidad, operación, ...</p><p><strong>¿Conoces el CPA y CLV de tu ecommerce o futuro negocio? </strong>Lo puedes calcular online sin invertir 1€, aprende cómo.</p><p><strong>¿ Sabes cuánto dinero te va a costar generar visitas a tu web ?</strong></p><p>Aprende a definir una estrategia de contenidos con palabras SEO que no sólo generan tráfico sino también ventas. Aprende de mis errores con campañas como \"la dieta de la piña\".</p><p><strong>¿Cuánto cuesta montar un WordPress, Magento, PrestaShop o Shopify para iniciar una tienda online, y con cuánto tráfico es rentable ?</strong></p><p>Si quieres montar un negocio en internet puedes ahorrar mucho tiempo y dinero en campañas de captación, desarrollo web, … con las cosas que aprenderás en este curso y que están basadas en mi experiencia montando ComeFruta.</p><p>Si aún no estás decidido a montarlo te pueden ser muy útiles las herramientas para estimar el negocio que te propongo y el caso de negocio preliminar, así sabras cuánto dinero tienes que invertir y cuánto puedes ganar. Todos los videos, ejercicios, datos de campañas y costes están basados en mi experiencia real de montar un ecommerce.</p><p>En este curso veremos <strong>herramientas y aprendizajes que he vivido montando mi negocio en internet, ComeFruta</strong>. El enfoque de las sesiones es muy <strong>práctico y con casos con datos reales de mi ecommerce</strong>, pero también las técnicas y herramientas que te pueden permitir extrapolarlo a tu idea de negocio.</p><p>Veremos como <strong>calcular las ventas que puedo tener en una web antes de iniciar el negocio</strong> y gastar dinero.  </p><p>Aportaré datos de costes, métricas y herramientas que he utilizado y medido en mi negocio te daré ejemplos sobre un caso concreto y algunas claves y consejos para que puedas aplicarlo a tu idea de negocio o producto a vender.</p><p>Utilizaremos herramientas online gratuitas que te ayudarán a estimar el mercado, competencia y costes de publicidad. Veremos cómo utilizarlas para un negocio de venta de naranjas online..</p><p>Valoraremos distintas soluciones técnicas con un coste diferente, desde vender a través de un marketplace hasta una plataforma propietaria para ecommerce pasando por soluciones intermedias, como un CMS o soluciones SAS. En función de tu idea, presupuesto y ventas, podrás ver cuál es más conveniente en tu caso.</p><p>Te facilitaré una hoja excel con datos de costes y que podrás rellenar con los datos que veremos a lo largo del curso para tu negocio concreto. En esta hoja tendrás una previsión de ingresos y costes de tu negocio para los próximos 3 años.</p><p>A diferencia de otras propuestas de consultores, herramientas, desarrolladores, ... tendrás una visión de mi experiencia montando el negocio y sin otro fin que informarte de las cosas que me han funcionado y las que no.</p><p>Responderé a tus consultas a través de foros durante el curso. </p><p><strong>Incluido en el curso libro pdf “Guía práctica para vender online\"</strong> de Jose Luis Montesino a la venta en amazon por 9,99$.</p><p><strong>PROMOCIÓN LANZAMIENTO</strong>: Además de poder realizar las consultas sobre temas técnicos o de negocio a lo largo del curso, al finalizar si quieres me puedes enviar la hoja excel que tendrás de resultados y la descripción de tu idea de negocio y te mandaré mi análisis de tu idea y sugerencias.</p><p>Cualquier duda me puedes mandarme un email a joseluis@comefruta.es<em> <em></em><em></em><em></em><em></em> </em><em> <em></em><em></em><em></em><em></em> </em> o twitter @jlmontesino</p>", 
    "end_date": null, 
    "title": "Ecommerce rentable", 
    "price": "35.00", 
    "instructors": "CEO, Profesor, CDCE Jose Luis Montesino", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441098_7165_5.jpg", 
    "course_url": "https://www.udemy.com/crear-una-tienda-online/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T08:02:28Z"
}