{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Always wanted to be an <strong style=\"\">entrepreneur</strong> or maybe an eCommerce entrepreneur? Always had the dream to start selling stuff? Maybe even thought about selling stuff online? Maybe you&#039;re even started already!  That is great stuff! I have been in that situation some years ago. But then I just did it. I bought some products, let me build a professional <strong style=\"\">online store</strong> (first mistake) and started. Now, almost 5 years later, I had over <strong style=\"\">10 eCommerce businesses</strong> in various businesses. From small too big. From a success to an absolute failure. During that time I learned a lot! Now is the time to transfer that knowledge not only to my intimate customers but also to you! Join this course now, 30 days </p><p>*** Over 1000 Students joined this course! Join them now and learn all about setting up and running an eCommerce business ***</p><p>This is what other students are saying:</p><p>-----</p><p><em style=\"\"><strong style=\"\">If You Want to be the Best, then Learn from the Best:</strong></em><em style=\"\">Patrick is a great person and a great teacher. He successful yet very kind &amp; ground to earth. It feels very motivating &amp; energetic while taking this course. Its great to see the best becoming even better and that&#039;s because he keeps improving the course by adding more content periodically</em></p>  <p><em style=\"\">-----</em></p><p><em style=\"\">28th March Update: Added 4 lectures. Advanced Tacking Stock and Dropshipment, theme your shop for a few Dollar and why i prefer WordPress.</em></p><p><em style=\"\">18th March Update:</em> Added in depth lectures about installing, configuring WordPress and WooCommerce.</p><p><em style=\"\">12th March Update: Added lectures about in depth SEO, how it works and how you should use it with WordPress</em></p><p>Some courses out there only focus on SEO and Online marketing, but this course doesn&#039;t. This course will teach you <strong style=\"\">everything </strong>that you need to know to start selling products online. It does not matter if you doesn&#039;t have any experience or you are already started. I will guide you from the beginning to the end. It is designed to provide you with<strong style=\"\"> hands-on knowledge</strong> of critical topics such as:</p>  <ul style=\"\">  \t<p>  \t\t    ·What is <strong style=\"\">eCommerce</strong>  \t</p>  \t<p>  \t\t    ·How to set-up your <strong style=\"\">eCommerce </strong>business  \t</p>  \t<p>  \t\t    ·How to determine your market  \t</p>  \t<p>  \t\t    ·Make, buy or use drop shipment  \t</p>  \t<p>  \t\t    ·Find your Customers  \t</p>  \t<p>  \t\t    ·Make customers to find you  \t</p>  \t<p>  \t\t    ·Run the <strong style=\"\">eCommerce </strong>business  \t</p>  \t<p>  \t\t    ·Customer support  \t</p>  \t<p>  \t\t    ·Manage growth  \t</p>  \t<p>  \t\t    ·The future  \t</p>  </ul>  <p>  \t    This course is easy to follow with practical tips. At the end of the course you will have a new look to <strong style=\"\">eCommerce </strong>and will run your business <strong style=\"\">better</strong>.  </p>", 
    "end_date": null, 
    "title": "eCommerce Store Guide", 
    "price": "20.00", 
    "instructors": "Patrick Gerrits", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340884_0c5e_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-an-e-commerce-guru-the-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T21:20:56Z"
}