{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The money is in the list.</p>  <p>You must have heard this statement a number of times and believe me this is absolutely correct only if you follow the methods that have already been tried and tested.</p>  <p>This course is all about setting up your own list building machine that will work for you 24-7. Each subscriber in your list will make you $1 per months. This means if you manage to build a list of 10,000 subscribers, you are setting yourself up for $10,000 per month.</p>  <p>Your email list is the most valuable asset and everything you do internet marketing must focus on adding more subscribers in your list. All top internet marketing gurus agree on this.  Owning your own email list is like printing money on demand.  When you have your own email list you can literally log in to your autoresponder account, press one button to send out a broadcast and instantly start making money.</p>  <p>This course is to the point, action filled video course.  I will take you by the hand  and reveal all of my tricks and tools that I have been using to build a massive list of subscribers and make over $10K every single month.</p>  <p>Here is what you will learn in 24-7 Listbuilding income:</p>  <ul><li>Why list building is the best strategy to start your own internet marketing business.</li><li>The perfect sales funnel wireframe to profit in list building and email marketing.</li><li>The squeeze page template proven for high opt-in rate.</li><li>The super powerful tactic to increase your conversions and revenue.</li><li>The best price points to use for your products in your sales funnel.</li><li>Secret sources that I use to develop my own products.</li><li>Secret sources that I use to buy solo ads.</li><li>The one little tactic that I use to create free offer- this will sky rocket your sales.</li><li>The exact sales funnel that I use in my business to make $10K consistently. </li><li>All the resources and tools that I have been using in my business.</li></ul>                        The videos in this course cover step by step action plan.", 
    "end_date": null, 
    "title": "Email Marketing: 24/7 List Building Income", 
    "price": "20.00", 
    "instructors": "Muhammad T Bashir", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708566_e79a_2.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-247-list-building-income/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T13:42:22Z"
}