{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Este curso possui uma base teórica em Administração de Empresas e experiências com negócios vivenciados pelo instrutor em seus mais de 25 anos de carreira. </p><p>Aqui, você aprenderá como abrir uma empresa desde o início e como se preparar para competir com outras empresas do mercado. Tivemos o cuidado de preparar lições importantes para novos empreendedores e para aqueles que estão começando. </p><p>Todo o curso possui materiais de apoios tais como: </p><ul><li>Planilhas</li><li>Roteiros</li><li>Lista de sites com outras informações na Internet</li><li>Vídeos</li><li>Material didático em PDF</li></ul><p>Este curso tem a duração de … horas e está estruturado da seguinte forma:</p><p>Se você está pensando em ter seu próprio negócio, mesmo sendo como um profissional liberal, mas ainda não criou coragem para dar um passo que pode mudar sua vida, talvez até por achar você não foi feito para ser empresário, te convido a assistir todas as aulas e repensar seus conceitos ao final do curso. Muito certamente você terá mais fundamento tomar uma decisão racional e de forma mais acertada possível, do que deixar de tomar a decisão por causa do medo, insegurança e falta de conhecimento. </p><p>Vem comigo! Faça este investimento em você mesmo e conheça as grandes oportunidades que te esperam fora das quatro paredes do escritório que você trabalha ou da sua casa.</p><p>Conhecimento sempre foi e sempre será o melhor investimento na vida de qualquer pessoa! Eu acredito nisto profundamente!</p><p><br></p><p>Um forte abraço,</p><p>Alexandre Barbosa</p>", 
    "end_date": null, 
    "title": "Empreendedorismo: Como Se Preparar Para Abrir uma Empresa", 
    "price": "20.00", 
    "instructors": "Alexandre Barbosa", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636730_7584.jpg", 
    "course_url": "https://www.udemy.com/empreendedorismo-como-se-preparar-para-abrir-uma-empresa/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-10T15:09:00Z"
}