{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Alline Jajah</strong>, da Jajah Network, aborda a importância de você saber usar bem os canais de mídia e suas redes de relacionamento para validar e escalar sua startup. <br><strong>André Belo</strong> da Dthink, mostra como aplicar a ferramenta de design thinking na criação de um novo negócio. <br>Baseado no método de Alex Ostervalder, <strong>Cassiano Farani</strong> - da 99Canvas - explica como a metodologia do canvas (quadro) pode ser aplicada para definir o modelo de negócios de uma startup. <br><strong>Edmour Saiani</strong>, da Ponto de Referência, comenta a importância de se criar uma causa que motive as equipes a construírem juntas a escalada do sucesso. <br><strong>Geraldo Neto</strong>, do Gávea Angels, apresenta as diferentes fontes de investimento para quem vai iniciar uma startup, como a figura do \"investidor anjo\".<br><strong>Gustavo Caetano</strong>, ex-presidente da ABStartups, apresenta o case Sambatech e percorre os caminhos para se criar uma startup de sucesso. <br><strong>Lindalia Reis</strong>, da Estácio, apresenta o Espaço NAVE - local onde startups inovadores participam do primeiro programa de pré-aceleração lançado por uma universidade brasileira. <br><strong>Nei Grado</strong> explica as definições dos conceitos e modelos mais usados pelos empreendedores. <br><strong>Tony Celestino</strong> mostra o modelo Up Global aplicado nos Startup Weekends - uma maratona de 54h que transforma ideias em projetos validados por especialistas. <br><strong>Tulio Severo</strong> explica o que você precisa SER, para se tornar um empreendedor de verdade.</p>", 
    "end_date": null, 
    "title": "Empreendedorismo Completo - Faça sua Startup Decolar", 
    "price": "20.00", 
    "instructors": "Universidade Estácio", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673658_18f4_4.jpg", 
    "course_url": "https://www.udemy.com/curso-empreendedorismo-estacio/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T19:41:05Z"
}