{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      Este curso es gratis y al finalizarlo puedes adquirir un certificado por parte de la Academia de Innovación para la Sostenibilidad (valor de 137 Dólares Americanos). Al adquirir el certificado podrás participar de los siguientes premios:  </p>  <ol style=\"\">  \t<li>Elegiremos a un estudiante entre dos mil estudiantes para que un participe en una conferencia internacional en algún tema sobre sostenibilidad (todo el viaje será cubierto por nosotros).</li>  \t<li>Si eres estudiante de algún centro de formación superior (técnica, tecnológica o universitaria), otorgaremos entre mil estudiantes que hayan realizado el entrenamiento y tomado la asesoría, 2 pasantías remuneradas con nosotros durante 3 meses.</li>  \t<li>Por cada quinientos estudiantes ofreceremos 2 asesorías en emprendimiento durante 3 meses.</li>  </ol>  <p>  \t      Preguntas: andres.rozo@academiasostenibilidad.com y búscanos en google como Academia de Innovación para la Sostenibilidad  </p>  <p>  \t      SOBRE EL CURSO  </p>  <p>  \t      El curso es una caja de herramientas para crear emprendimientos ambientalmente amigables, socialmente responsables y económicamente rentables.  </p>  <p>  \t      Encontrarás elementos que te permitirán crear productos y servicios que contribuyen a transformar los hábitos de consumo de las personas y que responden a retos ambientales y sociales del presente.  </p>  <p>  \t      Encontrarás 47 videos de corta duración, lecturas de organizaciones especializadas en el tema y ejercicios de creatividad y de análisis.  </p>  <p>  \t      Recomendamos realizar este curso en un plazo de 6 semanas. Encontrarás al lado de cada unidad una recomendación para hacerlo en la semana indicada así:  </p>  <p>  \t      SEMANA 1 = (S1)  </p>  <p>  \t      SEMANA 2 = (S2), y así sucesivamente.  </p>", 
    "end_date": null, 
    "title": "Emprendimiento Sostenible: Caja de Herramientas", 
    "price": "35.00", 
    "instructors": "AISO (Academia  Sostenibilidad) http://academiasostenibilidad.com/", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260294_01c1_7.jpg", 
    "course_url": "https://www.udemy.com/emprendimiento-sostenible-caja-de-herramientas/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-12T22:40:27Z"
}