{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::</p>  <p style=\"\">  \t<strong style=\"\">¡Únase y descubra por qué más de 1000 estudiantes satisfechos prefieren nuestros cursos en Udemy!</strong>  </p>  <p style=\"\">  \t                                               :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::  </p>  <p style=\"\">  \t                                               COMIENCE A RECIBIR DINERO POR HACER LO QUE LE GUSTA, BUSCANDO UNA IDEA DE NEGOCIOS Y HACIÉNDOLA REALIDAD.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">NUESTRA GARANTÍA: SI DESPUÉS DE SEGUIR TODO EL PROCEDIMIENTO NO CONSIGUE UNA SOLA IDEA DE NEGOCIOS, LE REGRESAMOS SU DINERO!!!</strong></em>  </p>  <p style=\"\">  \t                                               Imagine, es otro lunes por la mañana, usted conduce camino al trabajo o está esperando el autobús, como hace cada día. ¿Que está haciendo?¿Escuchando la radio?¿Pensando en cuanto tardará en llegar el fin de semana?  </p>  <p style=\"\">  \t                                                      En 3 meses desde ahora, será 3 meses más viejo. ¿Que estará haciendo en ese momento?  </p>  <p style=\"\">  \t<strong style=\"\">  ¿Seguirá escuchando las mismas canciones de siempre camino al trabajo?</strong>  </p>  <p style=\"\">  \t                                                      ¿O habrá decidido que es tiempo de ganar suficiente para llevar la vida que añora, dejar su viejo trabajo, invitar a sus amigos a cenar o viajar y conocer el mundo?  </p>  <p style=\"\">  \t                                                      Para los más geeks, tengo unos datos interesantes:  </p>  <p style=\"\">  \t                                                   :::::El empleado promedio dedica cerca de un<strong style=\"\"> 40%</strong> de su día a tareas relacionadas con su trabajo:::::  </p>  <p style=\"\">  \t                                                      Considerando que un 33% restante lo utilizamos para dormir y otro 15% para comer, asearnos y otras tareas de rutina, esto solo nos deja con un pequeño 12% para cualquier otra cosa.  </p>  <p style=\"\">  \t                                                      ¿Le gustaría que ese 40% de su preciado tiempo estuviese mejor invertido, o quisiera aprovechar ese valioso 12% para desarrollar un nuevo estilo de vida? Pues no es el único, con eso sueñan millones de personas cada día.  </p>  <p style=\"\">  \t                                                      ¿Cual es el problema?  </p>  <p style=\"\">  \t                                                      Perdón si lastimo sus delicados sentimientos pero soñar no sirve de <strong style=\"\">NADA, N-A-D-A.</strong> No sirve de nada si todo lo que hace es seguir soñando sin mover un dedo para convertir su sueño en realidad.  </p>  <p style=\"\">  \t                                                      Lo bueno es que puede cambiar eso y este curso tiene lo que necesita para iniciar.  </p>  <p style=\"\">  \t                                                     Si cada persona que soñara con tener su propio negocio viera su sueño hecho una realidad, probablemente <em style=\"\"><strong style=\"\">tooodos</strong></em> seríamos emprendedores. Pero esto no ocurre en la realidad.  </p>  <p style=\"\">  \t                                                      Admítalo, probablemente ha fantaseado con ser su propio jefe, con tener la libertad de escoger su propio horario, y aún así sigue atrapado en ese viejo empleo o peor aún en la casa sin nada que hacer.  </p>  <p style=\"\">  \t                                                      Pues bien, amárrese bien los pantalones y arrollese las mangas porque ha dado con la oportunidad de reivindicarse.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">--no, en serio, arróllelas, va a TENER que trabajar--</strong></em>  </p>  <p style=\"\">  \t                                                      En este curso le presentaremos el proceso exacto que tiene que seguir para pasar de no tener ninguna idea (o demasiadas) hasta la producción y validación de una idea exitosa.  </p>  <p style=\"\">  \t                                                      Al matricular nuestro curso obtendrá:  </p>  <ul style=\"\">  \t<li style=\"\"> Acceso instantáneo a más de 20 clases con texto y video explicativos</li>  \t<li style=\"\"> Cuaderno del emprendedor con indicaciones paso a paso y espacio para desarrollar los ejercicios</li>  \t<li style=\"\"> Una guía que lo llevará desde la generación de la idea hasta su primera venta</li>  \t<li style=\"\"> Repositorio de recursos del estudiante</li>  \t<li style=\"\"> Cero riesgo de inversión gracias a la garantía de reembolso total</li>  \t<li style=\"\">Actualizaciones constantes con material adicional</li>  </ul>  <p style=\"\">  \t                                                     El proceso que les comparto en el curso está probado y puedo dar fe de ello. A mi mismo me permitió pasar de no saber que hacer con mis aburridas certificaciones y títulos en manejo de proyectos, a tener hoy día un interesante trabajo propio en consultoría a entidades gubernamentales y privadas.  </p>  <p style=\"\">  \t                                                      Pero vamos al grano, después de todo no estamos acá por mi sino por usted.  </p>  <p style=\"\">  \t                                                      ¡Se imagina todo lo que podría hacer si finalmente pudiese tener su propio negocio!  </p>  <p style=\"\">  \t                                                      Pues si lo puede hacer, encontrado una idea exitosa y convirtiéndola en negocio. La inversión es baja y le garantizo que con las tácticas que aprenderá y el material práctico que se incluye, podrá iniciar una nueva y excitante etapa en su vida.  </p>  <p style=\"\">  \t                                                      Si quiere seguir esperando para actuar, adelante, espeeeere... espere 1 mes, 6 meses o 1 año...  </p>  <p style=\"\">  \t                                                   :::::<strong style=\"\">Pero sepa que mientras usted sigue escuchando la misma música camino al trabajo, muchos otros irán adelante para entonces, y habrán multiplicado exponencialmente la suma simbólica que usaron para acceder a este conocimiento</strong>:::::  </p>  <p style=\"\">  \t                                                      Así que, valientes, los espero adentro... a los demás, tal vez algún día nos volvamos a cruzar ;)  </p>", 
    "end_date": null, 
    "title": "Encuentre su Mejor Idea de Negocios y Haga Dinero con Ella", 
    "price": "30.00", 
    "instructors": "Perfil del Emprendedor", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121420_0696_9.jpg", 
    "course_url": "https://www.udemy.com/encuentre-su-mejor-idea-de-negocios/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-18T01:42:29Z"
}