{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>JOIN OVER 1600 SUCCESSFUL STUDENTS!! </em><strong><em><em><em></em></em></em></strong></strong></p>\n\n<p><strong><strong><em><em><em><strong><em><em><em>***** 5 STAR REVIEW: </em></em></em></strong></em></em></em></strong></strong><strong><strong><em>\"Awesome.</em> </strong></strong><strong><em>The content is comprehensive and informative. Tom met my expectations, and I'm satisfied with this course.\" - </em>A. Haikal Ruslan</strong></p><p><strong><strong><em><em>LIMITED TIME SPECIAL RATE!! COURSE UP-TO-DATE AS OF JUNE 2016!</em></em></strong></strong></p><strong>\n\n\n\n<p><strong><u>Learning objectives:</u> </strong>After taking this course:</p>\n\n\n\n<ul><li>You will know over 50 ways to save money in your business or startup</li><li>You will be able to set up a budget for your company using the included Excel spreadsheet</li><li>You will learn specific strategies for negotiating business and personal expenses to save $1000’s</li><li>You will know the software and accounting programs that can help you save money in business</li><li>You will know how to save money with rent hacking or house hacking</li><li>You will learn how to think like a millionaire and have the attitude to save money</li><li>You will learn how to save on credit card and Paypal merchant fees</li><li>You will learn why renting and leasing can save you money over buying</li><li>You will learn why trade and barter can save you money and make you more profit</li><li>You will learn how to get your vendors to finance your product purchases</li><li>You will learn how to save on business travel, meals and more with reward credit cards</li><li>And so much more!</li></ul>\n\n\n\n<p><strong><em>Have the millionaire mindset and an attitude of saving money!</em></strong></p>\n\n\n\n<p>Yes, you should think like a millionaire entrepreneur! Not the business people and stars you see on the news, but the real wealthy entrepreneurs next door! They have one thing in common! They love to save money!</p>\n\n\n\n<p>Saving money is just like making money. Sometimes it’s easier to cut an expense than it is to increase your income! And since most of you are sole proprietors or home based business owners, personal expenses are real important to your overall financial picture as well. So for the purpose of this course, I’ll also share my top tips on saving money personally because that translates into more cash in your pocket for business or pleasure!</p>\n\n\n\n<p>My preference is to make more money than saving money. But why not practice both? This is just the way I think, how can I save money on something? Now that doesn’t mean I always look for cheap stuff. Many times paying more for quality is the cheapest way to go! I was raised to be very frugal! So now I’m programmed that way. Plus I like to barter and negotiate, which are two skills you should master as well!</p>\n\n\n\n<p>I look at financing for your company as anything that brings you cash or saves you cash, it’s all a part of cash flowing your business. So I’m going to cover many area’s you probably haven’t thought of.</p>\n\n\n\n<p>This course is for home based business owners and freelancers too! Even when I had 2 commercial offices for my entertainment company, I still worked most of the time out of a home office! Why am I qualified to teach this course? I've owned and operated 6 small businesses selling millions of dollars in products and services. Plus my bachelor's degree is in Accounting from the University of Minnesota.</p>\n\n\n\n<p>Join the course now and let’s get started!</p>\n\n</strong><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Entrepreneurship: How To Start & Run A Lean Business", 
    "price": "20.00", 
    "instructors": "Tom Kenemore", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679788_f04b_6.jpg", 
    "course_url": "https://www.udemy.com/millionaire-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T19:23:42Z"
}