{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn how to adopt the 10 essential mindsets that will allow you to confidently make the leap from corporate to entrepreneurship. This course will prepare you for the challenges that you will inevitable face and help you overcome the obstacles so that you will have a head start on your entrepreneurial journey. </p><p><strong>Build a strong mental foundation that will empower you to take action, quit your corporate job and change your life. </strong></p><p>Ever wondered what the common denominator is of people who do the things that others perceive as impossible? It’s often not talent, experience or background. It’s their mindset. </p><p>We designed this course, for anyone who feels stuck in their corporate job, and is seeking to become an entrepreneur. By the end of the course, you’ll be able to adopt the mindset necessary to leave your current job and start your entrepreneurial journey. </p><p><strong>Some of the mindsets that you'll learn are: </strong></p><p>*Recognizing your own value </p><p>*Making the right assumptions </p><p>*Not being afraid of failure </p><p>*Defining success the right way</p><p>The course is split up into ten sections and each section teaches you one of the essential mindsets. To help you understand each mindset, we provide you with examples from our own lives, and we’ll give you practical exercises to apply them in your life.</p><p><strong>Who is this course for?</strong></p><p>The ideal student for this course, is someone who feels trapped at their current job, that wants to start their own venture, but struggles to make the jump. You’re facing fear,  “How do I give up the security of my current job?” “What if I’m not successful?” “What will other people think of me?” If you these questions sound familiar to you, then this course if for you. </p><p>Look forward to seeing you inside! </p>", 
    "end_date": null, 
    "title": "Entrepreneurship: Learn How to Quit the Rat Race Today", 
    "price": "20.00", 
    "instructors": "Jasper Ribbers, Ian Bednowitz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614810_a8b2_2.jpg", 
    "course_url": "https://www.udemy.com/mindset-for-entrepreneurs-get-ready-to-quit-the-rat-race/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T13:31:31Z"
}