{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">LEARN THE RIGHT WAY WITH A STEP-BY-STEP SYSTEM TO START A SUCCESSFUL BUSINESS</em></strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">Have you ever thought about starting your own business?</strong></li>  \t<li><strong style=\"\">Did you know 9 out of 10 startups fail?</strong></li>  \t<li><strong style=\"\">Want to learn how to startup effectively, make money, be the 1 in 10 who is successful?</strong></li>  </ul>  <p style=\"\">  \t                                If you answered <strong style=\"\">YES</strong> to any of the questions then you need to take my course to &quot;How To Launch a Successful Business&quot; go from Zero to Launch!  </p>  <p style=\"\">  \t<strong style=\"\">Why?</strong> Perhaps your scared of failure, don&#039;t know where to begin or don&#039;t have the resources. Tried with out successes or maybe its just because you have never been taught how to do it. Interested enough?  </p>  <p style=\"\">  \t                                If <strong style=\"\">YES</strong> then please <strong style=\"\">enrol now!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">90% of all new businesses still fail within their first year of operation.</strong> <br style=\"\">  \t                          With a new startup there are ONLY two outcomes, <strong style=\"\">FAILURE</strong> or <strong style=\"\">SUCCESS</strong>, and many business do fail, this course can help you succeed!  </p>  <p style=\"\">  \t                                I make no assumptions on your age or level of experience in business. This course is written and structured in such a way that is suitable for everyone.  </p>  <p style=\"\">  \t<strong style=\"\">This course aims to help you achieve the following:</strong>  </p>  <ul style=\"\">  \t<li>Save cost and reduce money</li>  \t<li>Save time and increase efficiency</li>  \t<li>Increase your chance to be successful</li>  \t<li>Create a business that you enjoy, that has value and makes money</li>  \t<li>Learn the process and formula for launching a successful business</li>  </ul>  <p style=\"\">  \t                                I am Richard Santoro a business professional and entrepreneur who has in the past setup my own businesses, and had extensive experience working in successful organisations like Microsoft, McCann Erickson and Haymarket Media Group and Dow Jones.  </p>  <p style=\"\">  \t                                I have used my 20+ years of experience learned a culmination of resources, books, and my own work experiences - to share my own process for launching a successful startup.  </p>  <p style=\"\">  \t                                Come take the journey with me and lets start building your business today!  </p>", 
    "end_date": null, 
    "title": "Entrepreneurship How To Start And Monetise Your Own Business", 
    "price": "20.00", 
    "instructors": "Richard Santoro", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313636_0666_14.jpg", 
    "course_url": "https://www.udemy.com/how-to-launch-a-successful-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-05T03:45:40Z"
}