{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hello! Thank you for checking out my course Entrepreneurship with Purpose.</p>  <p>The fact that you are taking the time to read this, is a good sign! It means that something is tugging on your heart or stimulated curiosity in your mind about leaving the rat race and starting a business of your own. It means that doing something that has significance or serves a greater purpose is important to you. If all of that resonates with you, then this course is <em>specifically</em><strong> </strong>for you. Let me explain.</p>  <p>Most people are stuck in a job building someone else’s dream at the expense of building their <em>own</em><strong> </strong>dream. What most people do not realize is that they have a natural born talent and/or unique story that they can leverage to build a business of their dreams that also benefits the world.  This course will help you discover those natural gift(s) that you didn’t realize you had and walk you through step-by-step on how you can build your brand from the ground up. You will also learn how you can take that brand and leverage it into creating other businesses and multiple streams of income.</p>  <p>If this is your first interaction with me, then you might be asking yourself why should I take a course from this guy? Well, let me briefly share my journey with you. I was able to discover that I had a gift for writing and a passion for helping others, so at the age of 22 I wrote a self-help book. I then became my own manager, publicist, and agent pitching my book and landed the opportunity to share my story on several global networks including the Oprah Winfrey Show. I found ways to utilize my status as an author to book speaking engagements, become a consultant, become a life coach, and become a ghostwriter. By the time I was 27, I had become a full-time entrepreneur. </p>  <p>Fast forwarding to today, at 31 years old, I’ve coached over 300 high-profile clients. I’m a bestselling author and an intercontinental speaker. I have a social media platform that reaches tens of millions of people a week. I also own 5 companies, from a publishing company, media company, consulting company, and even a soul food restaurant and real estate investment company. All together I have over 30 streams of income and counting. This all started from me realizing my natural gifts, staying aligned with my purpose of helping others and taking strategic action along the way.  </p>  <p>This course is my blueprint to help you also achieve success as a purpose minded entrepreneur.</p>  <p>If you are ready to stop putting off the dream and to start taking action, join me today and let’s get started!</p>  <p>Blessings,</p>  <p>Tony</p>", 
    "end_date": null, 
    "title": "Entrepreneurship with Purpose by Tony Gaskins", 
    "price": "40.00", 
    "instructors": "Tony A. Gaskins Jr", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665382_cefb.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-with-purpose-by-tony-gaskins/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-10T01:28:05Z"
}