{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The purpose of this course is to teach you how to start your own business and do it in record time! From brick and Mordor (lord of the rings, my attempt at humor) to technology and everything in between, I will provide you with real life application based tools on how to succeed in the business world today!</p><p>This course shows you how to take an idea and turn it into a revenue generating machine. There are certain principles apply to all forms of business, and those are the gems that I will be sharing. </p><p>The format of this course is simple. There is no easier way then to check off what you have to do to take the next step. I created the content in this course to be easy to follow just for you! I call it an \"application-based\" checklist because I have included the best applications, articles, and links that will help you check off the boxes to launch your venture. </p><p>The content was meticulously created with your valuable time in mind. There is no fluff and it is a checklist which is sure to deliver results every time. I have spent hundreds of hours putting my years of business into this easy to follow course and I'm sure that you will appreciate my conciseness.  </p><p>If you are someone that is looking to make a change, stop the 9 to 5 grind, and make something for yourself or even the world, then this is a course is right up your alley. We all have to make hard decisions, but this shouldn't be one of them. I urge you, if you want to be different and live the dreams that you have everyday, then this course is something that you need to hear. </p><p>This journey is not going to be an easy one, but with my help you will get through it and I can guarantee you that this is a decision that you will never regret. </p><p><br></p>", 
    "end_date": null, 
    "title": "Entrepreneurship Simplified: Your Idea to Launch Checklist!", 
    "price": "20.00", 
    "instructors": "Mr. Andrew John Diaz", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670072_27bc_2.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-simplified-your-idea-to-launch-checklist/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T03:23:52Z"
}