{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>As an entrepreneur, are you <strong>overwhelmed</strong> by your workload and <strong>demotivated</strong> by your lack of time and money and increasing stress levels?</p><p>Maybe you've tried some productivity hacks already. But how far have they really solved your productivity problems? <strong>Have you really got to the bottom of what is holding you back?</strong> (And, no, the answer is <strong>not</strong> all about positive thinking!)</p><p>So,</p><ul><li>Are you at the point of <strong>giving up on your business</strong> because you can't see the wood for the trees?</li> <li>Are you so stressed out that your <strong>health and relationships</strong> are being damaged?</li> <li><em>Can you afford <strong>NOT</strong> to tackle your productivity problems?</em></li></ul><p><strong>JOIN 1177 SATISFIED STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE. HERE'S A SAMPLE OF WHAT THEY HAVE SAID:</strong></p><p><em>“The content is great and a must-have for entrepreneurs who are setting up their venture.\"</em></p><p><em>\"</em><em>I found this course very insightful and full of ideas that can help to increase my productivity.\"</em></p><p><em>“All the best points explained for better productivity!\"</em><em></em></p><p>This 4 hour video course will show you <strong>15 factors</strong> which can make the difference between success and failure. You will learn how to challenge and change your <strong>thinking habits and lifestyle</strong> to make a real <strong>breakthrough</strong>. </p><p><strong>Contents and Overview</strong></p><p>This course contains 15 video lectures and 4 hours of content. It's designed for entrepreneurs who wish to take control of their business (rather than feeling that their business is controlling them) and to learn new habits which will <strong>save them time, money and stress.</strong></p><p><strong>What am I going to get from this course?</strong></p><p>15 lectures and 4 hours of content!</p><p>After taking this course you will be able to:</p><ul><li>Identify and overcome your <strong>mental blocks</strong> to improve your <strong>concentration, confidence, working memory and work-life balance</strong></li><li>Reduce <strong>information overload</strong> and distractions</li><li>Use <strong>Mind-Opener Questions</strong> to identify and resolve the <strong>real blocks</strong> to your productivity</li><li>Apply <strong>10 New Thinking Habits</strong> to transform your business and your work-life balance</li><li>Re-wire your thinking patterns so that you <strong>work WITH your brain, not AGAINST it</strong></li><li>Apply <strong>practical exercises</strong> in your daily business activities to <strong>boost your productivity</strong></li></ul><p><strong>Who is the course for?</strong></p><p>Anyone who runs their own business – solopreneur or business leader</p>", 
    "end_date": null, 
    "title": "Entrepreneurs: Boost Your Productivity In 15 Simple Steps", 
    "price": "50.00", 
    "instructors": "Christine Baker", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462954_575b_7.jpg", 
    "course_url": "https://www.udemy.com/from-frantic-to-flowing-15-step-productivity-booster/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T12:19:28Z"
}