{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tThe Enterprise Club course it about how to start a business, and the skills needed to make that enterprise a success. There are a series of lectures dealing with different subject areas, students are expected to make notes, and apply these principles to the business that they have either started, or who are about to start.  </p>  <p style=\"\">  \tThere are some downloadable items for you to fill in for your own reference - a business plan and a marketing plan. The course will take about 7 hours to complete. If you are thinking of starting your own business soon - join the club - the Enterprise Club, and be guided by an entrepreneur who has been running their own business for over ten years.  </p><p style=\"\">We take a different element that will impact your ability to run a business. We look at why entrepreneurship is so important today, in these times - we look at money, debt and cashflow - and its impact on us personally, and income-producing opportunities and the various business models we could adopt and their pros and cons as a vehicle for us when starting a business.</p><p style=\"\">We look at the entrepreneurs mind - how they think differently, and (being honest) do you actually have what it takes to do this? Are entrepreneurs born or made? Arguably - both. But (with anything) - its a skill! And if you want to learn how to run a business successfully - you need to develop the mindset and the skills.</p><p style=\"\">We explore sales and marketing and social media techniques. One cannot run a business without customers! There is no point being the best kept secret in the world! People have to know about your business - so we look at how that can happen.</p><p style=\"\">We look at people - the importance of teams. The African proverb says - &quot;if you want to go fast - go alone. If you want to go far,go with others&quot; - so if you want to build a successful, sustainable business - you won&#039;t be doing this in isolation. This course is the first step to get you off to the right start.</p><p style=\"\">Your course tutor is an award winning entrepreneur who started her first business in 2004 in the same month of graduating with a Masters degree in Investment Management from City University in London with £150 (£100 from her overdraft and £50 from her mum). Lisa used to run an enterprise club and has worked with various entrepreneurs and start-ups over the years, and having done it herself - knows the troubles, the highs and lows, the worries, the stress the thrills and the questions and concerns that you may or may not have - and has put together this course to get you off on the right track.</p>", 
    "end_date": null, 
    "title": "Entrepreneurship - Ready, Steady, Go!", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295803_778b_4.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurs-club/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-07T13:54:06Z"
}