{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">\t<strong>GREAT ACHIEVEMENT!</strong>  </p>  <p style=\"\">\t Almost 7,000 STUDENTS in less than 6 MONTHS! ........... AND more than 52 REVIEWS and RATINGS!</p>  <p style=\"\"><em>Important notes:</em><br></p>  <ul>\t<li>Initial price is $199, but will next increase to $299 (Jan 1st 2016)</li>\t<li>New lectures and updates</li>\t<li>Full 30 day money-back-in-full guarantee</li>\t<li>Support</li>\t<li>More than 12,000 students joined my courses and 40+ FIVE star reviews</li>  </ul>  <p style=\"\">\t Become a Global Entrepreneur</p>  <p style=\"\">\t “Hello. I have a few burning questions for you.</p>  <ul>\t<p style=\"\">\t\t 1)Have you ever wanted to start your own business? \t</p>\t<p style=\"\">\t\t 2)Have you ever wanted to help someone that has their own business? \t</p>\t<p style=\"\">\t\t 3)Have you ever wanted to work in, or learn more about a small business? \t</p>\t<p style=\"\">\t\t 4)Do you have ideas that you know can make money, but are not sure how to get them started? \t</p>  </ul>  <p style=\"\">\t My name is Christos Pittis and I am an entrepreneur and online teacher. You can find my lectures on the world's top educational marketplaces.</p>  <p style=\"\">\t If you answered yes to ANY of the above questions, then this course is the one for you. We will cover everything from the history of Entrepreneurship, who they are, what they do, where they come from, to the benefits and advantages of being an Entrepreneur.</p>  <p style=\"\">\t We will also cover how to get financing, how to start up your business, and, in a bonus lecture, some tips, tricks and ideas that will help you.</p>  <p style=\"\">\t Throughout the course, I will be challenging you with interesting questions and asking you to give honest feedback while sharing your thoughts on the discussion board.</p>  <p style=\"\">\t I look forward to having you with me as we explore the business world from the viewpoint of an Entrepreneur.\"</p>  <p style=\"\">\t Watch my course Become a Global Entrepreneur now and contact me to discuss your startup. Let me share my experience with you.</p>", 
    "end_date": null, 
    "title": "Entrepreneur: Go Global - A Young Professional's Guide", 
    "price": "20.00", 
    "instructors": "Christos Pittis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/262318_7035_15.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurs-entrepreneurship-tips-tricks-and-more/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-16T06:53:37Z"
}