{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Trademarks, patents, copyrights and other forms of intellectual property (IP) can mean the difference between life and death for any entrepreneurial exploit. This course is your survival guide. By combining real-life case studies, and quick, practical “How-To” videos, this course will give any aspiring entrepreneur the knowledge they need to ask the right questions and act with confidence.  </p>  <p>  \t  It covers six different types of IP<em><em>—</em></em><span>copyrights, patents, trademarks, and more</span><em><em>—</em></em><span>including the advantages, disadvantages, and limitations of each. All are illustrated with real-life examples, from Google’s decision to patent its pagerank algorithm, to Taco Bell’s costly “crazy chihuahua” settlement.</span>  </p>  <p>  \t  For any entrepreneur, though, time is money. This course includes straightforward, practical instruction designed to answer questions faced by every entrepreneur on the fly, like how to register a copyright, or use a lab journal to protect an invention.  </p>  <p>  \t  The course is taught by attorney and Chapman University law Professor Tom W. Bell. Professor Bell earned his J.D. from the University of Chicago, and has practiced law in both Silicon Valley and Washington, D.C. He has published papers on copyrights and Internet law, and recently authored “Intellectual Privilege: Copyright, Common Law, and the Common Good.”  </p>", 
    "end_date": null, 
    "title": "Entrepreneur's Survival Guide to Trademarks, Patents, & More", 
    "price": 0, 
    "instructors": "Prof. Tom W. Bell", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310944_0409_2.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurs-survival-guide/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T17:08:57Z"
}