{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em style=\"\"><strong style=\"\">1150+ LEADERS TAKING ON THE HIJACK - YOU CAN JOIN TOO!</strong></em>  </p>  <p>  \t<em style=\"\">Price will increase early MARCH 2015 so jump on the brain train today. </em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">_____________________________________________________________________</strong></em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">Leaders who know the &quot;why&quot; behind the &quot;what&quot; are seen as more confident and competent. </strong></em>  </p>  <p>  \t<em style=\"\">Can you explain why you look up and to the right when you think? Do you know what that is doing in your brain and how you can harness that skill to learn MORE, FASTER?</em>  </p>  <p>  \t<em style=\"\">Have you ever been nervous asking someone for something (or on a date?)? What if you had the brain-based understanding on how to handle it like a pro?</em>  </p>  <p>  \t<em style=\"\">Do you know why you are cautious when you see a snake? What if you could choke your lizard brain and redirect it&#039;s fear driven behaviors?</em>  </p>  <p>  \t                                            Understanding your brain will increase your resourcefulness and capacity to be more productive in what you do.  </p>  <p>  \t<strong style=\"\">          In this course we cover:  </strong>  </p>  <ul style=\"\">  \t<li>How your brain chooses to remember and chooses to forget &amp; how you can manage both</li>  \t<li>The Brain-Based research (Neuroscience) of learning and practical hacks to boost your connections and increase your results  </li>  \t<li>A simple overview of the process and anatomy in your brain when you learn &amp; how understanding it will help your leadership </li>  \t<li>How to control or intercept the HIJACK of your emotions in critical situations and what you can do (brain states) to increase your industriousness for the win #FTW</li>  </ul>  <p>  \t                                                  Gain instant lifetime access to 2.5+ hours of professionally made videos that will impact your life. This course will dramatically increase your understanding of Productivity and help you Get Things Done in more efficient ways - and know why!  </p>  <p>  \t<strong style=\"\">Double your Brain-Based acuity and change your results.</strong>  </p>  <p>  \t                                                  Congratulations on your commitment to learn more about &quot;why&quot; you do what you do! Take action now.  </p>", 
    "end_date": null, 
    "title": "Entrepreneur Brain: Hacks and Hijacks", 
    "price": "20.00", 
    "instructors": "Chicka Elloy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364114_88e5_4.jpg", 
    "course_url": "https://www.udemy.com/brain-hijack/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T17:53:23Z"
}