{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>JOIN 400+ STUDENTS...</strong></p><p>Statistics may vary slightly from place to place, however across the board they tend to agree on one specific reality: at least 70 to 90% of business startups fail within the first nine years of their existence.</p>    <p>That is simply alarming, considering all the programs and funding available to promote and support entrepreneurship.</p>    <p>If you go to any business school or attend a course on entrepreneurship, you will be told that the first step to turn your idea into a business venture is to: write a business plan. </p>    <p>Despite the fact that this widely spread and quasi-unanimous conventional wisdom has been challenged over and over by grim statistics, the fallacy has prevailed and is still being passed on from generation to generation.</p>    <p>Now, before you misunderstand the point, please keep in mind that planning is extremely important as a discipline in order to succeed in any undertaking.</p>    <p>However, when it comes to entrepreneurship, the key questions that have been neglected or simply omitted are:</p>  <p>Where do you start? </p>  <p>What do you plan first, in order to give yourself a fighting chance to succeed and become part of the 10 to 20% of business ventures that do make it?</p>    <p>In Entrepreneurship: The Secret to Start the Right Way, you will discover:</p>  <p>• 5 mistakes that most new entrepreneurs make, so you can avoid them;</p>  <p>• 7 things that most successful entrepreneurs know or understand, so you can learn to emulate them and ensure your own success;</p>  <p>• A street-smart 3-phase strategy to take into account in your planning process;</p>  <p>• 12 steps to consider in your entrepreneurial journey.</p>    <p>Unlike most programs out there, this course has been designed and prepared by an entrepreneur for entrepreneurs, based on real entrepreneurial life experiences of successful entrepreneurs.</p>    <p>This program is intended for entrepreneurs, aspiring entrepreneurs, solopreneurs, business owners as well as professionals, authors, coaches, experts, consultants who want either launch a new business venture or transform an existing venture into the next success story.</p>    <p><strong>A note of warning</strong>: this is not a training course about how to write better business plans, neither does it share specifics. </p>    <p>What you will get from this program is mainly proven principles that you can apply to your own specific case. </p>    <p>As such we cannot and do not guarantee the results that you will get by taking this course: that depends totally on your ability to apply what you would have learned. </p>    <p>What we can guarantee is that the principles you are going to learn in this program are proven and tested: they work when you consistently work them.</p>", 
    "end_date": null, 
    "title": "Entrepreneurship: The Secret to Start the Right Way", 
    "price": "45.00", 
    "instructors": "Kofi Sonokpon", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721306_a377_2.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-the-secret-to-start-the-right-way/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T23:23:28Z"
}