{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">The Entrepreneur and SMB Business Action Guide course is designed to use the principles of organizational development and business psychology to help students and users of this course get in the mindset of an entrepreneur and understand what it takes and what it required to build a business strategy that uses self-understanding and customer needs and market analysis. </p><p style=\"\">Materials include assessments, worksheets, templates, exercises, checklists, and guides to help you take action with each module and build a foundation for your business strategy. This course takes approximately 2 hours to complete. The course is structured so that you will go through each module and get the information and the usefulness of that information. You will then be led through an action guide for each lecture that will help you build your business strategy step by step. At the end of each module, you will go through the summary to make sure that you completed all the steps and gained valuable insights from that module. </p><p style=\"\">Entrepreneurs should take this course if they have found that their strategies are no longer working for them and they feel like there is a missing piece to their business that they are just not able to figure out. Also, students should take this course to help them better deal with the life of an entrepreneur and to gain a better understanding of themselves as entrepreneurs.</p>", 
    "end_date": null, 
    "title": "Entrepreneur and SMB Business Strategy Action Guide", 
    "price": "30.00", 
    "instructors": "Chantal Khan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/490448_dc69_4.jpg", 
    "course_url": "https://www.udemy.com/entrepreneur-and-smb-business-strategy-action-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-30T15:58:34Z"
}