{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">                        THE PRICE WILL GO TO $47 SOON</strong>  </p>  <p>  \t                        30 Day full <strong style=\"\"><em style=\"\">money back</em></strong> guarantee! No questions asked! There's <em style=\"\"><strong style=\"\">NOTHING TO LOSE!  </strong></em>  </p>  <p>  \t<strong style=\"\">ANSWER THIS ONE QUESTION FOR ME:</strong>  </p>  <p>  \t<em style=\"\">Would you like to send 2 simple emails a day that take no more than 5 minutes and make over $100,000+ per year!?</em>  </p>  <p>  \t                Well, you can! Just enroll now by hitting that big button in the top right!  </p>  <p>  \t                                      I will show you how, with very little work, make 1,000 dollars with 2 emails! It's super easy and anyone can do it! Enroll today! I can't wait to show you all how to make huge money with a few emails! Once learned, this business is extremely profitable and can be done anywhere in the world, even while laying on the beach at your favorite vacation spot! I'm very excited to pass this knowledge on because the amount of people that know how to do this is very small. You don't need any technical skills or even business skills to do it! Please enroll now to make an easy living!!!  </p>  <p>  \t                              In this course you will learn:  </p>  <ul style=\"\">  \t<li>how to easily run an online email business</li>  \t<li>find easy jobs to make money off of</li>  \t<li>learn the amazing concept of outsourcing</li>  \t<li>how to make hundreds of dollars a day with two emails</li>  \t<li>how to make your living from anywhere in the world</li>  </ul>  <p>  \t                                      PS: There are concepts in here that will help any business and you can make money off these concepts in many many ways other than what I tell you! BE CREATIVE! Do yourself a favor and enroll now!  </p>  <p>  \t                      TAKE ACTION AND GO HIT THAT BIG BLUE BUTTON IN THE TOP RIGHT!  </p>  <p>  \t                                      Thank you!  </p>  <p>  \t                                      -Andrew Burich  </p>", 
    "end_date": null, 
    "title": "Entrepreneur's Guide to Starting an Online Email Business", 
    "price": "20.00", 
    "instructors": "Andrew Burich", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/281490_fc9f_6.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurs-guide-to-starting-an-online-email-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-15T13:25:52Z"
}