{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>--- Nat's Review on May 4th, 2016: \"This is the best course on entrepreneurship that I've seen.\" --- This course is <em class=\"redactor-inline-converted\">fresh out of the oven!</em> <em>Brand new as of May of 2016!</em></p>\n\n<p><strong class=\"redactor-inline-converted\">8 Steps to Becoming a Successful Business Owner</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">There’s a lot of fluff and theory about startups</strong>, entrepreneurship, and business modeling. You won’t find any of that stuff here. That 8-step journey that we’ve built for you has been crafted through <strong class=\"redactor-inline-converted\">our founding team’s real startup journey</strong> and with research from institutions like <strong class=\"redactor-inline-converted\">MIT</strong>, <strong class=\"redactor-inline-converted\">Y Combinator</strong>, and <strong class=\"redactor-inline-converted\">Stanford</strong>. This experience is about lowering your risk, accelerating your journey forward, and inviting you to join a thriving community of like-minded people.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">See Real World Examples as You Launch Your Business</strong></p>\n\n\n\n<p>Your launch will be supported by <strong class=\"redactor-inline-converted\">real world examples</strong> of the business launch tools in this course in action. You’ll have access to multiple target market interview recordings, downloadable support resources, and an inside look at data tracking Eazl’s growth from a concept to a six-figure business in its first year. You’ll also get to <strong class=\"redactor-inline-converted\">choose from three specialization tracks</strong>:</p>\n\n\n\n<ul><li>Services and Live Experiences</li><li>Physical Products</li><li>Web Applications and Digital Technologies</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Unmatched Video Learning Experience Quality</strong></p>\n\n\n\n<p>Anyone who has the willpower to do what it takes to become the boss will <strong class=\"redactor-inline-converted\">love this course</strong>. Leveraging our experience as the leading provider of entrepreneurial business education to a community of over 50,000 learners worldwide, we’ve created an <strong class=\"redactor-inline-converted\">unparalleled video-based learning experience for you</strong>. This experience is about <strong class=\"redactor-inline-converted\">real stuff</strong> involved in entrepreneurship, the <strong class=\"redactor-inline-converted\">power of visual learning</strong>, and the thrill of <strong class=\"redactor-inline-converted\">building something</strong> <strong class=\"redactor-inline-converted\">awesome</strong>. Starting with the first phase of the course, you’ll learn how to select a launch market, collect the research you need to create an offering that people will pay for, and move down the human-centric design path. Then you’ll move to phase two where you’ll design a minimum viable product (MVP)--a very early version of your concept--that you can use to validate your idea before taking it to the public. In phase three you’ll build your first operational version of the business, craft the first iteration of your brand and business story, get your first paying customers, and set yourself up to receive growth capital using a practical method that doesn’t require you to deal with venture capitalists or lawyers. Come rock it with us!</p>\n\n\n\n\n\n<p>This course features music by Audionautix, Kevin MacLoed, and Chris Zabriskie</p>\n\n<p>Team Eazl would like to thank the following people who underwrote the development of this learning experience:</p>\n\n\n\n<p>Platinum Circle Funders: Dundee and Ian Butcher, Bieke and Brian Burwell, and Michele Chaboudy</p>\n\n\n\n<p>Gold Circle Funder: Landry Jones </p>\n\n<p>Silver Circle Funders: Christos Angelidakis, Eric Jacobson, Ricardo Pan Neves, David Valentine, Joselyn Quintero, and Mike Steely</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Entrepreneurship: 8 Step Business Launch Formula® from Eazl", 
    "price": "20.00", 
    "instructors": "Davis Jones, Team Eazl, Team Eazl", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833782_592b_4.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-the-8-step-business-launch-program-from-eazl/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T19:09:11Z"
}