{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you want to convert your <strong><em>hobby into a business</em></strong>? Are you thinking about <em><strong>quitting the 9-5 grind and one day running your own successful business?</strong></em> Do you have<em><strong> an idea for a business</strong></em> you really believe will work? Are you looking for <em><strong>simple, actionable information that will take you to the next level </strong></em>in your entrepreneurial journey?</p><p>If the answer to any of the above questions is yes, then I can confidently say you have come to the right place.</p><p>_____________________________________________________<br></p><p>In this course I have put together many of the <strong>questions people have asked me over the past 20 years about starting a business. </strong>I have answered them in a way that allows you to understand them quickly and enables you to take action!</p><p>Find the help you need! As you go through this course you will discover the solutions to many of the issues, challenges &amp; thoughts that have been holding you back from starting and running your own successful business.</p><p>_____________________________________________________</p><p>For easy referencing I have divided the information into the following sections:</p><ul><li><strong>What to avoid and what to do<br style=\"\"></strong></li><li><strong>How to check the viability of your idea<br style=\"\"></strong></li><li><strong>Business planning<br style=\"\"></strong></li><li><strong>Money issues – how much do I need, How to start a business with little money<br style=\"\"></strong></li><li><strong>Marketing issues – How to make my product go viral, How to find clients and keep them<br style=\"\"></strong></li><li><strong>Legal matters and qualifications</strong></li></ul><p>(This course will see a tremendous amount of updating)</p><p>Whatever is not answered, inbox me and I will update the content. <strong><em>I seriously want to help you get to the next level. </em></strong>So take this course and let us start the journey together. </p><p>_____________________________________________________</p><p>To remove any risks on your part this course comes with my no questions asked <strong><em>30 Day Money Back Guarantee.</em></strong></p><p><strong>So what are you waiting for click take this course right now!</strong></p>", 
    "end_date": null, 
    "title": "Entrepreneurship: How To Start Your Own Business - FAQ & A ", 
    "price": "20.00", 
    "instructors": "Boomy Tokan", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614950_d595_2.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-startup-quickly/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T16:17:45Z"
}