{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Speaking is one of the fastest ways to easily grow your business, gain lots more clients, increase your visibility as an expert in your niche and bring in lots more income and I am here to help you do just that!</p><p style=\"\"><strong style=\"\">Craft and Deliver a Signature Talk that Will Captivate your Audience and Have your Potential Clients Clambering over Themselves to Work with You!</strong></p><p style=\"\">Ever wondered how the most amazing TED speakers grab audience attention from the beginning and hold it through their talk? Or, have you ever wondered how seasoned speakers connect deeply with their audiences and leave them eager for more? Maybe you are planning to speak in the near future but don&#039;t have a clue where to start!</p><p style=\"\">You&#039;ve come to the right place!</p><p style=\"\"><strong style=\"\">This course is for you if:</strong></p><ul style=\"\"><li style=\"\">You&#039;re eager to jump start or propel your business to the next level.</li><li style=\"\">You want more clients and visibility in your niche.</li><li style=\"\">You&#039;re keen to speak but have no idea what to include in your talk.</li><li style=\"\">You&#039;re ready to launch a new program or book and want that launch to be the most successful yet.</li><li style=\"\">You want to master public speaking but you&#039;re nervous, lacking in confidence and unsure about how to behave in front of an audience.</li><li style=\"\">You want to dazzle your audience and make them think your almost mind reading!</li></ul><strong style=\"\"></strong><p style=\"\"><strong style=\"\">You&#039;ll learn:</strong></p><ul style=\"\"><li style=\"\">The body language secrets that will have you brimming with confidence and making the best connection with your audience from the word go.</li><li style=\"\">How to engage your audience from the very beginning and keep them hooked right until the end of your talk.</li><li style=\"\">The biggest mistakes when addressing an audience or group and how to avoid them.</li><li style=\"\">The tricks that I have learned over 21 years of addressing audiences and groups that will set you apart from all other speakers in your niche.</li><li style=\"\">To design your talk step by step and discover exactly what to include in your introduction, main content and conclusion for maximum success and memorability.</li></ul><strong style=\"\">Course Requirements</strong><ul style=\"\"><li style=\"\">You don&#039;t have to have any speaking experience but need an intermediate level of English language.</li></ul><span style=\"\"></span><p style=\"\"><strong style=\"\">What you&#039;ll get:</strong></p><ul style=\"\"><li style=\"\">30 lectures and 3.5 hours of content including lecture cheat sheets, quizzes and workbooks to further your understanding.</li><li style=\"\">An instructor with 21 years of speaking, teaching, coaching, class/talk/workshop design and implementation experience.</li><li style=\"\">Knowledge and experience that will help you create and give the signature talk of your life.</li><li style=\"\">Amazing branding practices to cultivate your signature talk style.</li><li style=\"\">Tried and tested secrets for confidence building and stress busting.</li><li style=\"\">The low down on the right words, statements and questions to use for maximum audience engagement.</li><li style=\"\">Knowledge and confidence of exactly what to include, what to say and how to prepare your signature talk.</li></ul><span style=\"\"></span><strong style=\"\"></strong><ul style=\"\"><li style=\"\"><span style=\"\"></span></li></ul>", 
    "end_date": null, 
    "title": "Entrepreneurial Speaking - Craft Your Signature Talk easily.", 
    "price": "50.00", 
    "instructors": "Angie Campbell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505464_5eeb_6.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurial-speaking-craft-your-signature-talk-easily/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-18T19:55:53Z"
}