{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\">Are you a health care professional who loves helping others?</strong></em></p><p style=\"\">Maybe you are a bit stressed or burned out?</p><p style=\"\">  Maybe all you are looking for is a bit more time and income.  </p><p style=\"\">This course is all about capitalizing on your unique advantages as a health care professional to take back control of your time and life.</p><p style=\"\">I feel your pain</p><p style=\"\">I&#039;m one of you</p><p style=\"\">I&#039;m here to help you solve this problem</p><p style=\"\">This course lays it all out for you in a step by step progression. You could try to figure it out on your own or hire me as a 1:1 coach, but my clients tease me that I charge lawyer rates. I think my coaching fees are more in line with what my plumber charges, but that&#039;s another story.</p><p style=\"\">I struggled for years learning this all on my own. Early mornings and late nights were consumed learning this and it took awhile to perfect a system that allowed me to essentially retire from a full time career in Emergency Medicine. </p><p style=\"\">I&#039;ll share with you the exact structure of my day and how it allows freedom and income. My days are open to do the things I want to do. My family and especially my kids have benefited from the transformation from burnt out emergency medicine doc to fully present dad. I never miss a game, play or event any more. I have time to work out, take walks with my dogs, even take a nap when I&#039;m tired or bored. </p><p style=\"\">This course is more than just a few lectures and PDF guides. If you watched video 3, you noted several different avenues that are already available to you as a healthcare professional to earn income, control your time and get your life back. I cover each in depth to help you maximize success and limit the hassle factor. I show how to get it done though screencasts, video, written guides and help you create your own <em style=\"\">prescription</em> for success.</p><p style=\"\">Like any course, you&#039;ll get out what you put into it. There are no easy push button solutions. You&#039;ll be learning how to create a viable and sustainable model. We have a lot of fun on the way and you can go at your own pace. </p><p style=\"\">What I want to share next is pretty exciting. It&#039;s my favorite part of teaching and that&#039;s interacting with my students. </p><p style=\"\">If you&#039;re ready to escape your bar-less prison (current job) and sucking it up is not a viable option but rather just tired and old rhetoric shared by those who are too afraid to make the effort and take the risk of starting something worthwhile, then you are on your way to joining the ranks of other successful health care professionals.</p><p style=\"\"><span style=\"\"></span>Can you imagine waking up and deciding at that moment what your day will look like? You get to decide based on how you feel and what is going on with your family and friends.</p><p style=\"\">There is only so much time in a day and as a member the Entrepreneurship For Health Care Professionals Course you&#039;ll avoid the headaches and frustration of lost time, wasted effort and the stumbles of going it alone. </p><p style=\"\">If you are ready to take back control of your life, then dive in and start this course today.  It will take some work and I&#039;ll be here to help you along the way.</p><p style=\"\"></p><p style=\"\">With gratitude,</p><p style=\"\">Mitchel Schwindt, M.D.</p>", 
    "end_date": null, 
    "title": "Entrepreneurship Opportunities For Health Care Professionals", 
    "price": "20.00", 
    "instructors": "Mitchel Schwindt", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399268_914b_5.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-opportunities-for-health-care-professionals/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T19:35:06Z"
}