{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    The course seeks to introduce the concepts of enterprise, innovation, small business and their interrelationships. It aims to provide a guide to<br style=\"\">  \t    the key facts, ideas, theories and thinking about enterprise and innovation, to look at their relationship to small businesses and to consider the<br style=\"\">  \t    methods that are taken to promote and finance them.  </p>  <p>  \t    The word enterprise is used in a variety of contexts with a wide range of meanings. Within this range there are narrow meanings of the word<br style=\"\">  \t    specifically related to business and there are wider meanings indicating a way of behaviour that can apply in a variety of contexts, including<br style=\"\">  \t    business. The narrower meanings are closely associated to entrepreneurship, and in turn, the concepts of enterprise and entrepreneurship<br style=\"\">  \t    embrace much that would be considered to be expressions of small business activity.  </p>  <p>  \t    Management research confirms that innovative firms - those that are able to use innovation to improve their processes or to differentiate their<br style=\"\">  \t    products and services - outperform their competitors, measured in terms of market share, profitability, growth or market capitalisation.  </p>  <p>  \t    However, the management of innovation is inherently difficult and risky: most new technologies fail to be translated into products and services, and most<br style=\"\">  \t    new products and services are not commercial successes. In short, innovation can enhance competitiveness, but it requires a different set of<br style=\"\">  \t    management knowledge and skills from those of everyday business administration.  </p>", 
    "end_date": null, 
    "title": "Entrepreneurship & Innovation", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302466_965f_8.jpg", 
    "course_url": "https://www.udemy.com/innovation-entrepreneurship/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:12:57Z"
}