{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">Why should you take this course?</strong></p><p>Did you know most people fly by your business, your logo, your website and even what you have to say like they&#039;re in a car going 65 mph on the highway as they glance at a billboard sign? How do you get your customers to listen to you and what you have to say in such a short period of time? </p><p>It all starts with three unique differentiators that the best of the best entrepreneurs are able to offer their clients: (1) the “Why?&quot; they should listen, (2) durable fulfilment (happiness, success, freedom) and (3) being genuine and wholehearted to who you and how your business is run. </p><p>World-renowned speaker, Entrepreneur, and CEO, Jason Teteak, is able to decode the magic that happens when top entrepreneurs are meeting with their clients. He then bottles up the secret sauce and presents it to you so you can easily understand how to use it in your own style and apply it to any situation.</p><p><strong style=\"\">Theoretical fluff won&#039;t get you more customers...</strong></p><p><span style=\"\"></span>You&#039;re about to learn 15 strategies to give an amazing business presentation.  Learn how to persuade, motivate, teach and inspire your clients to do what you want.</p><ul style=\"\"><li>Shine in front of your customers.</li><li>Captivate your customers within the first five minutes.</li><li>Use your face and body language with dynamic effect.</li><li>Persuade your customers with the words you choose and the way you sound.</li><li>Entertain and amuse your customers in a style that&#039;s true to you.<br style=\"\"></li><li>Move your customers to respond with enthusiasm<span class=\"redactor-invisible-space\">.<br style=\"\"></span></li></ul><p><strong style=\"\">Don&#039;t take our word for it. Listen to what others have to say:</strong><br style=\"\"></p><p>&quot;What I really liked about this program is that it&#039;s very genuine, down to earth and gives you practical, actionable things that you can use everyday, that aren&#039;t difficult. The top three things I learned is that with a little bit of knowledge Jason&#039;s given us, and a little bit of <span style=\"\"></span>practice, we can pay more attention to how we stand and how we look at our audience or the people we&#039;re talking to, and how to use our voice to get across the message that we want, and to be able to portray the value that we can provide to our customers.&quot;</p><p><strong style=\"\">- Neil </strong>- Director of Small Business Development Center<br style=\"\"></p><p>&quot;I like the program because it gave me different aspects that I never thought about as far as speaking in front of a group, and some tools that I can definitely take away and hopefully use effectively.&quot;<br style=\"\"></p><p><strong style=\"\">- Brendan </strong>- Small Business Owner<br style=\"\"></p><p>&quot;This could really help people get clients if you knew exactly how to approach them in a sincere and genuine manner, and that they would trust you and be interested in what you are selling or offering them. I think if you can follow the steps in this presentation, I think it will make you a more genuine person and customers will be more apt to use you instead of other people they cannot trust or don&#039;t feel comfortable around, and it will increase your revenue through referrals and repeat business.&quot;<br style=\"\"></p><p><strong style=\"\">- Jamie </strong>- Small Business Owner</p>", 
    "end_date": null, 
    "title": "Entrepreneur: How to Connect With Your Customers", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466998_6bc7_2.jpg", 
    "course_url": "https://www.udemy.com/entrepreneur-connect-with-your-customers/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T22:13:44Z"
}