{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>في هذة الدورة سستعرف على البرامج والتطبيقات والمواقع التى يتسخدمها الآلاف من رواد الاعمال حول العالم لتسهيل اعمالهم وتعاملاتهم مع موظفيهم او المتعاقدين معهم, الادوات المذكورة في هذه الدورة ستوفر عليك قضاء الساعات الطوال في انجاز المهام المتعبة مثل مشاركة الملفات مع الموظفين او اعطائهم المهام او اذا لم يكن لديك مصمم جرافيكي فسوف تقضي ساعات طوال في تعلم برامج من اجل تنفيذ اعمال تصميم خاصة بشركتك, ولا انسى التسويق الالكتروني وادواتة.<br></p><p>في هذة الدورة سوف تتعلم الطريق المختصر لانجاز الكثير من المهام باقل وقت ممكن, فهذة الدورة هي خلاصة ٧ سنوات قضيتها بالتعلم .بالطريق الصعب عن طرق مختصرة لانجاز الاعمال بكل فعالية</p><p>سوف تتعلم في هذة الدورة عن اشياء كثيرة منها:</p><ul><li>استخدام جوجل درايف واستخدام التطبيقات المرفقة به.</li><li>استخدام حفظ البيانات باستخدام خدمة Dropbox</li><li>استخدام خدمة one drive من مايكروسوفت</li><li>استخدام برامج مراقفة لتوقيع مستنداتك بشكل الكتروني</li><li>تعلم التسويق الالكتروني عن طريق انشاء قوائم بريدية</li><li>التعرف على وسائل الاتصال الحديثة لتواصل مع زبائنك او الموظفين الذين يعملون معك</li><li>التعلم على كيفية ادارة الوقت وايضا البقاء خارج المشتتات اليومية.</li><li>التعلم علي برامج وتطبيقات لادارة وتنظيم المهمات</li><li>التعرف على برامج وادوات التصميم لغير المصممين</li><li>التعرف على كيفية حفظ كلمات السر في مكان واحد امن</li></ul><p>وسوف تتعلم الكثير الكثير في هذة الدورة, وساقوم ان شاء الله بين الفينة والاخرى بانزال دروس ومواد تكميلية جديدة كلما استجد شي في هذا المجال الكبير, اامل ان تستمعو بالدورة.</p><p><br><br></p>", 
    "end_date": null, 
    "title": "Entrepreneurs Tools (Arabic)", 
    "price": "30.00", 
    "instructors": "Fadi Al-Aswadi", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/769668_a064_4.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurs-tools-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-21T17:23:32Z"
}