{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em><em><em>TOP RATED BUSINESS FINANCE COURSE! JOIN OVER 1600 SUCCESSFUL STUDENTS!! ***** 9 - 5 STAR REVIEWS! </em> LIMITED TIME SPECIAL RATE!! COURSE UP-TO-DATE AS OF JUNE 2016!</em></em></strong></p>\n\n<p><strong><em><em>NEW LECTURES &amp; STARTUP EXCEL BUDGET TEMPLATE! Now you can estimate your startup income and expenses by month for the first year! Helps you figure out how much financing you need! See Lectures 5 &amp; 6!</em></em></strong></p>\n\n<p><strong>5 STAR REVIEW!</strong><strong> </strong><em><strong></strong>\"Tom is an excellent instructor and a seasoned entrepreneur. He knows well what to do and where to go when it comes to getting money for your business. </em><em>I highly recommend it for anyone who has an idea but needs funding for it!\"</em> - Basim Salim</p>\n\n<p><strong>5 STAR REVIEW!</strong> <em>\"Finished going through Tom's course on financing your business. It was very informative. I got a lot of good ideas to use in my business start-ups. It met each of my expectations when signing up for the course. Easy to listen to and to follow along.\" - Keith</em></p>\n\n<p><strong>5 STAR REVIEW!<em> </em></strong><em>“Great Guide and Insights! I'm looking to raise money for an idea I have and this course hits the options bang on. Quick and to the point with realistic methods of raising capital. Will be coming back to this for reference.\" - C. Eliot</em></p>\n\n<p>Probably one of the biggest questions you have right after you've decided to start a business is <strong><em>“how do I get the money to finance this thing\"??</em></strong> Or maybe you are looking for the financing for your next step in your current business, an expansion, to launch a new product or service, or a new marketing push, etc.</p>\n\n<p><em><strong>After taking this course:</strong></em></p>\n\n<ul><li><em><strong>You will know over 30 ways to finance your business or startup including:</strong></em><em><strong><ul><li>Crowdfunding finance campaign, Kickstarter, GoFundMe, Indiegogo, online lenders, Kabbage, Paypal Working Capital, online factoring, micro credit, business incubators, business accelerators, entrepreneurship contests, Square Capital, Square Merchant Services, collaborative funding, Bluevine, Fundbox, invoice financing, Fundbox, micro lending, micro finance, a <strong>micro loan</strong>, collateral financing, Microcredit, Grameen America, Kiva, Peer to Peer Lending, P2PL, Prosper, Lending Club, NBIA, MIT $100K Pitch, Accelerate and Launch Competition, 43 North, Bank, SBA, Small Business Administration, Leasing, Angel Investor, Venture Capital, VC, Accounts receivable, Grants, Government financing, Bootstrap, customer financing, prepayment financing, personal credit line, credit cards, credit card offers, mortgage, refinance, line of credit, family, relative, co-signer, and more!</li></ul></strong></em></li> <li><em><strong>You will be able to find the financing options that fit your business needs</strong></em></li> <li><em><strong>You will learn specific strategies and secrets to getting financing from the top sources</strong></em></li> <li><em><strong>You will know the difference between traditional financing options and new financing options</strong></em></li> <li><em><strong>You will learn the top ways to get your banker or investor to say YES!</strong></em></li> <li><em><strong>You will be able to overcome previous rejections and learn new ways to find financing</strong></em></li> <li><em><strong>And more!</strong></em></li></ul>\n\n<p>A big reason people don't start their dream business is that they don't think they can get the money or financing. Well there are so many ways to get money you need! I'm going to cover over 30 of the most popular ways, from raising very little money, just a few hundred dollars all the way to over $100,000 or more!</p>\n\n<p>I know crowdfunding is all the rage right now, but you might be surprised to find out that crowdfunding only accounts for 3% of all funding sources. Crowdfunding can certainly help you get to your funding goals, but there are a lot of other ways to raise cash. So I am going to cover the top new ways to finance your business like crowdfunding all the way to more traditional ways like through your bank or financial institution. Plus I will cover unusual and creative ways to finance your business!</p>\n\n<p>You get all of my entrepreneur secrets to securing financing! Plus I'll answer that question: Is there free money or grants available to start your business? You will also get a bunch of included resources in each section plus the PDF slides for taking notes and setting goals!</p>\n\n<p>Why am I qualified to teach this course? I've personally raised over $300,000 in business funding over the years utilizing many of the strategies in this course. Plus my bachelor's degree is in Accounting from the University of Minnesota.</p>\n\n<p>After taking this course, you are no longer allowed to use this phrase: “I didn't start my dream business because I couldn't get the financing\"! So let's get started!</p>", 
    "end_date": null, 
    "title": "Entrepreneurs Guide Finance Your Business or Startup in 2016", 
    "price": "20.00", 
    "instructors": "Tom Kenemore", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524452_89b7_3.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurs-guide-to-finance-your-business-or-startup/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-09T19:39:34Z"
}