{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Being able to launch a lean startup you are truly passionate about and that helps others is a superpower. Period.</p>  <p>Learn how to <strong style=\"\">start your own business that creates a positive impact</strong> and <strong style=\"\">c</strong><strong style=\"\">ompletely changes the trajectory of your life</strong> vs. things remaining exactly how they are...</p>  <p>Most people are too scared to start their own social venture. They dream about making a difference, having control of their own future, but don&#039;t take the simple steps necessary to make it a reality. :( </p>  <p>What if I told you that starting your own business wasn&#039;t scary? Wasn&#039;t hard? And was something that you could do in the next 30 days without quitting your day job?</p>  <p><strong style=\"\">Good news - This is the truth!</strong></p>  <p>This course provides the roadmap for you to follow so that you can overcome your fears, start your own social venture and begin taking control of your future. </p>  <p>The roadmap and all of the tactics, scripts and techniques are the product of years of testing and rely heavily on principles successful entrepreneurs have been using for years. I have personally used the strategies in this course to launch 5 successful social ventures - all securing their first paying customers within 30 days. </p>  <p>But don&#039;t just listen to me. Here&#039;s what other people have said:</p>  <p>“Kevin helped me clarify the problem I was solving for my customers, test my assumptions and validate demand. I&#039;d recommend his course to anyone planning on investing time in a new venture.&quot; </p><p>- Daniel Lafferty <em style=\"\">- Principal at Yesco BC</em></p>  <p>A few of the things you&#039;ll learn in this course</p><ol style=\"\"><li>What you can do each day to increase your likelihood of success and happiness</li><li>How to brainstorm pains you are truly passionate about solving</li><li>Tactics for picking the best pains to begin solving today</li><li>Strategies for brainstorming solutions that your customers will love</li><li>Scripts to secure your first paying customers</li><li>How to continue to run a successful lean social venture</li></ol>  <p>Trust me, this is just a small sample of what you&#039;ll learn and by the end of this course you&#039;ll have the ingredients to develop the superpower of being a social entrepreneur.</p>  <p>No matter who you are, I guarantee you&#039;ll learn at least one thing from this class (see the testimonials above for proof).</p>  <p><strong style=\"\">I will personally respond to any questions you may have</strong> as you go through the material so there&#039;s no worry if you&#039;re not sure how to take all of the information and apply it to your life. So sign up now!</p>  <p>Talk soon,</p>Kevin Starke", 
    "end_date": null, 
    "title": "Entrepreneurship: How To Launch A Lean Startup You Love", 
    "price": "20.00", 
    "instructors": "Kevin Starke", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471060_013e_3.jpg", 
    "course_url": "https://www.udemy.com/social-entrepreneurship-lean-startup/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T18:25:39Z"
}