{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">Google, Apple, HP and Ben and Jerry&#039;s ice cream</em></strong> have two things in common (among many others:</p><ol style=\"\"><li style=\"\"><strong style=\"\"><em style=\"\">These businesses were built by two people working together in some form of business partnership and</em></strong></li><li style=\"\"><em style=\"\"><strong style=\"\">They are all extremely successful businesses</strong></em></li></ol> <p style=\"\">So, are you currently working with a Co-founder, Co-owner, Shareholders or friends? Are you in a Partnership business or perhaps you are a Husband and Wife team? Are you thinking of working with people in future? If the answer to any of these questions is yes then you need this course!</p><p style=\"\"><strong style=\"\"><em style=\"\">“Startup: Template For Successful Working Relationships&quot; </em></strong>is for anyone who wants to build a business with a friend or partner and are serious about securing that the relationship and the profitability of the business.</p><p style=\"\">I have covered many of the <strong style=\"\">topics that will help you:</strong></p><ol style=\"\"><li style=\"\"><strong style=\"\">Learn how to secure your business&#039; future and your relationship at the same time whilst creating an environment that will foster growth and success by completing a working agreement check list; </strong></li><li style=\"\"><strong style=\"\">Understand how to make perfect selection and streamline the choosing process plus I have also included my own personal agreement I signed with a close friend</strong> and many more.</li></ol><p style=\"\">Give yourself a brand new start and breathe new life into your business by enrolling in this life-changing course now. Why wait, increase the odds of your success and don&#039;t delay. There is a cost for every minute you delay. All the ongoing updates to this course are free, for life. </p><p style=\"\"><strong style=\"\">Plus you have my 30 day absolutely no questions asked full money back guarantee. Either way you win! </strong></p>", 
    "end_date": null, 
    "title": "Entrepreneurship: Building Successful Business Partnerships!", 
    "price": "50.00", 
    "instructors": "Boomy Tokan", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503350_9069_4.jpg", 
    "course_url": "https://www.udemy.com/startup-template-for-successful-working-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T21:34:22Z"
}