{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>COURSE DESCRIPTION</strong></p>\n\n<p><em>LATEST: Course is updated for Summer 2016.</em>-------------------------------------------------------------------------------------------------------------</p>\n\n<p>You've got a life - and no time to learn the intricacies of yet <em><strong>another</strong></em> online program! </p>\n\n<p>\"<em>Thank you Nancy for making my life more productive! Now that I know the basics of using my Evernote program along with some of the other Apps you talk about throughout the course, I can keep much more organized. I also make training videos and over the years I have become more sensitive to crappy videos &amp; you have hit a home run in my book. The quality of the audio &amp; visual segments of your course is top shelf all the way. Thank you for taking the time to make it right</em>.\" - Steve Dougherty </p>\n\n<p><strong>The secret to Evernote is using only the features you need. (Like I do)</strong><br></p><p><strong></strong>You work, play, travel, create, cook, plan, and relax - and don't have time to learn every little feature that Evernote offers. In fact, if you're like most people, you've probably downloaded a version of Evernote onto your computer or phone, checked it out and then uninstalled it because it didn't look easy enough. Who has time to learn all that stuff?  Not me.</p>\n\n<p>At the end of the course you'll be able to create your Evernote account, create notebooks and notes, and start clipping online resources in less than 2 hours.</p>\n\n<p><strong>Don't waste time learning stuff you'll never use</strong></p>\n\n<p>Everyone needs to organize <em>something:</em></p>\n\n<ul><li>vacation info </li><li>favorite recipes</li><li>project files</li><li>job requirements</li><li>research projects</li><li>school assignments</li><li>wine notes</li><li>sports photos</li><li>school scheules</li><li>websites</li></ul>\n\n<p>Yes, you can keep things to remember on scraps of paper (think: back of napkins!), bookmarks in a Web browser, or random reminders on your phone. But with Evernote - the quick and easy way - you can quickly (and I mean fast) set up folders for every part of your life, then dump notes, images, audio, video - anything you want to remember into the correct folder.  By the way, Evernote calls folders Notebooks.  Whatever.</p>\n\n<p>The cool thing is - Evernote has a lot of add-on apps (and more being created all the time) - so you can do things like have a scanned receipt sent automatically into your Receipt Notebook, snap a photo that's instantly e-mailed to you OR sent to Evernote, and set up (free) commands that save things like the photos in Facebook that tag YOU right into Evernote.</p>\n\n<p><strong>Why should you listen to me?</strong></p>\n\n<ol><li>I hate spending hours/days/weeks learning a new system.</li><li>I want to teach you only the most useful stuff</li><li>I've written close to 30 books; Evernote is a my go-do research assistant.</li><li>Evernote saved me from endless hours of \"where did I put that piece of paper?\"</li><li>I'm not going to bore you with stuff you'll probably never use</li></ol>\n\n<p><strong>What should you do next?</strong></p>\n\n<p>Click the \"take this course\" button up top because every hour you delay is killing more trees thanks to your paper notes. </p>", 
    "end_date": null, 
    "title": "Evernote - Quick & Easy ", 
    "price": "50.00", 
    "instructors": "Nancy Hendrickson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385784_5dd7_7.jpg", 
    "course_url": "https://www.udemy.com/evernote-quick-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T16:00:06Z"
}