{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">About the Course</strong></p><p>This course has two main sections: one focused on <strong class=\"redactor-inline-converted\">effective business coaching</strong>, and the second focused on developing a <strong>successful business case</strong>. Two separate courses that already have more than 2000 students registered together.</p>\n\n<p>The section on <strong class=\"redactor-inline-converted\">The Key Stages of Coaching</strong> will involve learners in the process of discovery, goal setting, action planning, and follow-up that distinguishes coaching from other development methods. </p><p>After completing the second section, you will be able to build an <strong class=\"redactor-inline-converted\">effective business case.</strong> You will understand what makes a business case, how to prepare one and how to design business cases to persuade decision makers.<br></p><p>Understanding what is a good business case will be followed by a description of the f<strong class=\"redactor-inline-converted\">unctions and elements</strong> of a business case. You will learn how to <strong class=\"redactor-inline-converted\">research</strong> and what to research in order to prepare yourself and how to align business case with organizational strategy.</p>\n\n<p>Finding the best angle and making an effort to <strong class=\"redactor-inline-converted\">polish your business case</strong> will increase your chances. So, you will learn about the principles of business case design to respond to your identified <strong class=\"redactor-inline-converted\">decision makers</strong>.</p>\n\n<p><strong class=\"redactor-inline-converted\">Course Target</strong></p>\n\n<p>This course is for anyone in an organization who has a role in improving the performance of co-workers, keeping in mind the fact that coaching is not solely a top-down activity. </p>\n\n<p>Typically, coaching involves team members, team leaders, and supervisors, including senior managers and CEOs. But, everyone can benefit.</p>\n\n<p><strong class=\"redactor-inline-converted\">The Instructor</strong></p>\n\n<p>My name is Sorin, and I will be your instructor. I have been working as a manager and trainer for the last 10 years, and I used to coach young professionals. </p>\n\n<p>And, the plan is to share with you what I have learned from my experience, and to pass on what I have learned during my training, a while ago.</p>\n\n<p><strong class=\"redactor-inline-converted\">Course Structure</strong></p>\n\n<p>There are 3 stages of coaching to learn: preparing to coach, structuring and delivering coaching sessions, and following up on the coaching session.</p><p>A <strong class=\"redactor-inline-converted\">12 Steps </strong>approach will guide your learning and practice:</p>\n\n<ol><li>Choose your business idea,</li><li>Define your business objective,</li><li>Determine the functions of your business case,</li><li>Prepare a generic structure of a business case (marketing components included),</li><li>Research your business idea by needed topics and using appropriate research methods,</li><li>Analyze and compile results of research,</li><li>Align business idea, strategy and processes,</li><li>Determine the best angle to sell your business case,</li><li>Write your business case content,</li><li>Adapt your business case to various decision makers, </li><li>Emphasize high impact elements, and</li><li>Prepare to 'sell' your business case.</li></ol>\n\n<p><strong class=\"redactor-inline-converted\">Apply now!</strong></p>\n\n<p>So, if this is of interest for you, go ahead and hit the Register button. Or, if you are not yet convinced, please try the free preview lectures first. Thank you, and see you on the inside!</p>", 
    "end_date": null, 
    "title": "Executive Coaching and Business Case Development", 
    "price": "40.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/836830_c6be_3.jpg", 
    "course_url": "https://www.udemy.com/executive-coaching-and-business-case-development/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-01T17:40:31Z"
}