{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Whether it is a national conference, a specialist training session, a public meeting, or a local fundraiser, <strong>EVENTS ARE THE PUBLIC FACE</strong> of your organisation. </p><p>This course is <em><strong>an introduction to event management training course</strong></em> offers a practical guide, where you will gain  a TOOLKIT that will help you organise future activities with CONFIDENCE and flair.</p><p>Event organising is a very sought after role, whether in its own right or within a wider job spec. </p><p><strong><em>But it's not as easy as it may first appear</em></strong> – and the secret is in being ULTRA ORGANISED! It's a skill juggling multiple tasks, co-ordinating large groups of people, marketing for maximum success, and taking care of all the little details which others would forget.</p><p><em><strong>This course will equip you with marketing ideas, advice on how to work with your team to promote your event, and with follow up techniques. </strong></em></p><p><em><strong></strong></em>This course is easy to follow and divided into simple sections so you can follow the lectures. Pause where you need to or repeat so you can re-enforce concepts.</p><p><strong>This course is valued to individuals who wants to become:</strong></p><ul><li>Charity fundraiser</li><li>New business owner</li><li>SME startup</li><li>PA</li><li>Office Manager</li><li>Community and sports club leader</li><li>PR/marketing assistant</li><li>Event Manager</li><li>Event Co-ordinator</li><li>Conference Organiser</li><li>Wedding Planner</li><li>Party Planner</li></ul><p><br></p><p>You will go from being lost and overwhelmed in terms of what to do first to having a strong idea of how to go about your marketing activities in an organized and efficient manner. Thanks to these lectures you will  be able to do lots of different exercises that will stretch your understanding of event management. </p><p><strong>JOIN US TODAY!</strong></p>", 
    "end_date": null, 
    "title": "Expand Your Business with Events", 
    "price": "20.00", 
    "instructors": "iMarketer Training", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234792_4e63_5.jpg", 
    "course_url": "https://www.udemy.com/creating-awesome-events/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-31T22:19:38Z"
}