{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you feel Overwhelmed when you think about using a Facebook business page? </p><p>Want Facebook insights on how to get started? What to post? When to post? How to get people to \"like\" your page? How to integrate other social media platforms right into Facebook itself? </p><p>Then I have you covered... this course will take you through it all in a way that you can actually walk-through the set up as you take the course. You'll learn some pretty cool online ninja tricks for learning what kind of content to post, too! If you have questions, shoot me a message or post in the discussion. My goal is to help you keep moving forward! </p><p><strong>Here's what just a few of my 2,800+ students are saying: </strong></p><p><em>\"Brilliant and caring Instructor! V</em><em>ery satisfied with the step by step videos on FB business page creation. Learnt alot and Instructor was prompt to answer my questions.\" </em> - Foster Smith</p><p><em>\"Great for Newbies and the Experienced alike! </em><em>If you are new to Facebook marketing, the step-by-step instructions on setting up your page will be invaluable. As someone who used facebook for many years, I learned quite a bit from the resources sections. Definitely glad I took this class, 100% recommend it.\"</em>  - JC Kiadii</p><p><em>\" Hidden gems! </em><em>As an avid FB user I thought I knew it all. The course highlighted a few things that I had no idea I was able to do with Facebook, ie downloading content while converting profile to business. Course was very detailed and very to the point. Would recommend and worthwhile!!!!\"</em>  - Sylvia Nasser - Wendel</p><p><strong>Summary: Create a Facebook Page for Business Growth</strong></p><p>Have your own Facebook business page up and running in less than an hour! Learn the fastest and least expensive way to build and grow your online or offline business by taking this step-by-step guided course! This isn't just a course in theory, it has action-packed tips, tricks, tools and templates that anyone can put to use right away - and will result in your own Facebook Business Page, and Facebook strategy! </p><p><strong>After Taking This Course, You Will:</strong> </p><ul><li>Have your own professional-looking Facebook business page up and running</li><li>Have a long list of FREE (as well as paid) resources to include eye-catching images on your page</li><li>Know exactly how to download your information so you never have to start from scratch again</li><li>Learn how to set your page on auto-pilot for those days you're just too busy to be on Facebook</li><li>Have exact \"how-to\" worksheets, tips and resources to keep you - and your Facebook business page - on track!</li><li>Know exactly what you are going to include on your page, when you'll include it, and the reason for including it - no more endless hours spent guessing</li><li>Understand how to create new tabs inside Facebook so that you can integrate your other social media platforms (but only if you want to)!</li></ul><p><br></p><p><strong>What is included?</strong></p><ul><li>23 lectures with nearly 2 hours of video content</li><li>Downloadable templates</li><li>Downloadable resources (both free and paid ones) </li><li>Instructions to help you get set up and running!</li></ul><p><br></p><p><strong>PLEASE NOTE:</strong> This is intended to be a beginner's course - not meant for those with intermediate or advanced Facebook knowledge (although, you may still learn a few things)!</p>", 
    "end_date": null, 
    "title": "Facebook Marketing: Creating a Facebook Business Page", 
    "price": "20.00", 
    "instructors": "JC Marzett", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493316_03ee_2.jpg", 
    "course_url": "https://www.udemy.com/social-marketing-with-facebook-for-business-growth/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-04T14:29:29Z"
}