{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you are a fiction writer, author or self-publisher this course is for you!</p><p>Learn how to format your own Word (or similar) manuscript, easily and painlessly, using FREE software, into a fully-validated and functional Kindle ebook. No HTML, CSS or other 'techie' knowledge required.</p><p><strong>Create Your Beautiful Kindle Ebook From Start To Finish With This Step By Step, Easy To Follow Tutorial For Fiction Writers</strong></p><p>You will learn how to:<br></p><ul><li>Clean up and prepare your manuscript the easy way</li><li>Format your manuscript correctly</li><li>Use the magic of style sheets</li><li>Validate your files</li><li>View and proof your ebook on various devices</li></ul><p><br><strong>These Easy To Learn Skills Will Enable You To Format Your Fiction Book With Complete Confidence</strong></p><p>If you know nothing of HTML and other geekery, don't worry, you're in the right place, because you don't need to know any of these things.</p><p>In this course am going to take you by the hand and show you, step by easy step, the painless way to format your manuscript and ebook files properly.</p><p>You're going to learn every step you need to take to get your book formatted the right way. I'll show you where to get the FREE software you need, how to download and install it, how to use it, and how to validate your files.</p><p>Included also in the course is a downloadable style sheet which you can just copy and paste into your epub files to make your book behave as it should.</p><p>Again, don't worry, I'll show you exactly where to put the styles and how to modify them if you want to. But you don't have to, they are perfectly designed to use as they are, 'straight out of the box'.</p><p>All you then have to do is upload your files direct to Kindle's publishing platform and within 24 to 48 hours your book will be published and available on Amazon worldwide.</p><p>It will work properly and look great. And you will have done it all yourself. Isn't that what self-publishing is all about? You. In control. Earning money from day one!</p><p>This course is designed to teach writers who just want to write how easy it is to do your own formatting. I don't expect you to be a tech wizard, you shouldn't have to be, you're a writer.</p><p>However, I'm pretty sure you're going to have plenty of questions as we go along, and my promise to you is that I will respond as soon as humanly possible to any and every message you send to me.</p><p>So never be shy to fire me off a question, no matter how trivial you may think it is, that's what I'm here for.</p><p>Steve</p>", 
    "end_date": null, 
    "title": "Fiction Writers: Learn How To Create A Perfect Kindle Ebook", 
    "price": "50.00", 
    "instructors": "Stephen Lean", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/451276_e81c.jpg", 
    "course_url": "https://www.udemy.com/fiction-writers-learn-how-to-create-a-perfect-kindle-ebook/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T14:50:36Z"
}