{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This video course discusses the use of the FileMaker Platform... to create a resellable vertical app... or for building internal support systems for your business.  The course was created by the award winning team at RC Consulting and 25 year veteran, Richard Carlton.  </p><p>Learn about decision making needed to determine if FileMaker is right for you and your business / Startup.  Before launching into a project, you need to understand:</p><ul><li>Planning and Documenting your ideas.</li><li>Understanding how FileMaker can be deployed to customers and users.</li><li>Understanding budgeting for development, and sustained marketing.</li><li>Bug Fixing and budgeting</li><li>Understanding the value of doing the work yourself or getting some outside assistance</li><li>How to Hire and communicate with a consultant.</li><li>Different methods for structuring a contract... fixed cost quotes, etc.</li><li>And We'll build... in less than one hour... a shared mobile solution...the works great on Desktop computers and iPhone, iPads and Android devices.<br></li></ul><div>For maximum awesomeness... this course will reference a number of third party products, a couple of books, etc.   I make NO money in these references.   During this course, we will also reference the use of FM Starting Point... to use as a free software... to anchor the development of your internal systems.  You will be required to input your personal information to get this free software.</div>", 
    "end_date": null, 
    "title": "FileMaker for Startups and Entrepreneurs ", 
    "price": "50.00", 
    "instructors": "Richard Carlton", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571078_f316_4.jpg", 
    "course_url": "https://www.udemy.com/filemaker-for-startups-and-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-01T18:59:43Z"
}