{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Want to crowd fund a million dollars fast? Learn how SMART entrepreneurs raise capital FAST using equity crowdfunding platforms.<br></p>  <p>  \t<strong>ABOUT THE INSTRUCTOR</strong>  </p>  <p>  \tLili Balfour has advised over 100 companies, who have gone on to raise over $200 million from investors around the world. She is the author of Master the Finance Game, a Wall Street Journal Guest Mentor, a contributor at Fox Business News, a blogger for The Huffington Post, a guest contributor for HuffPost Live, and a guest lecturer at UC Berkeley.  </p>  <p>  \t<strong>ABOUT THE COURSE</strong>  </p>  <p>  \t3 Steps to Raising Capital Fast breaks down the process of raising capital with equity platforms.  </p>  <p>  \tEntrepreneurs will learn how to:  </p>  <ul>  \t<li>Develop a funding roadmap to master the fundraising process</li>  \t<li>Secure the right angel investors quickly</li>  \t<li>Communicate pertinent data to close a deal</li>  \t<li>Understand term sheets, convertible notes, SAFE, valuation, valuation cap, liquidation preference, and other important terms</li>  </ul>  <p>  \t<strong>COMMUNITY</strong>  </p>  <p>  \tLili Balfour spent over 20 years in investment management and investment banking in Silicon Valley and NYC before founding Atelier Advisors in 2007. Her goal is to provide investment banking services to early-stage companies, which are typically ignored by investment banks. Over the past seven years, she has advised over 100 startups on their funding strategy. She has coached established brands (Bag, Borrow, or Steal, Visual IQ, Alpha Theory, Derivix, Erin Fetherston, and Peeled Snacks) and pre-revenue startups looking for seed capital via crowd funding.  </p>  <p>  \tOur community of entrepreneurs spans several countries and has climbed pass 5,000. We meet on the third Friday of each month for Office Hours on Spreecast and participate in weekly video lessons on YouTube.  </p>  <p>  \t<strong></strong>  </p>", 
    "end_date": null, 
    "title": "Finance for Entrepreneurs - 3 Steps to Raising Capital INTRO", 
    "price": "20.00", 
    "instructors": "Finance for Entrepreneurs, Lili Balfour", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/222234_9ee6_9.jpg", 
    "course_url": "https://www.udemy.com/3stepsintro/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-18T22:22:54Z"
}