{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tDo you have a big idea? Are you looking to make a change from employee to entrepreneur? Or, have you already taken the leap and wondering if you are the right fit for the approach you’ve taken?  </p>  <p>  \tYour Entrepreneurial Niche is a course designed to help you discover how your past experience, personality, and performance factors can help you fit align your entrepreneurship goals to your passion.  </p>  <p>  \tEntrepreneurship is a big word and we are going to use it in the broadest sense possible. First, the official definition:  </p>  <p>  \t<strong>Entrepreneurship</strong> is the act of being an <a href=\"http://en.wikipedia.org/wiki/Entrepreneur\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\">entrepreneur</a> or “<em>one who undertakes </em><a href=\"http://en.wikipedia.org/wiki/Innovations\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\"><em>innovations</em></a><em>, finance and business acumen in an effort to transform innovations into economic goods</em>“.  </p>  <p>  \t(<a href=\"http://en.wikipedia.org/wiki/Entrepreneurship%20-%20accessed%208/23/2012\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\">http://en.wikipedia.org/wiki/Entrepreneurship)</a>  </p>  <p>  \tWe include all kinds of activities under this umbrella – writing a blog or a book, creating art, running a small government contracting business, participating in a franchise or multi-level marketing (MLM) opportunity, and even intrapreneurship is included in this discussion.  </p>  <p>  \tWe know that you are hoping to learn a lot about yourself and what types of entrepreneurship opportunities there are out there. The key is to remember that we don’t all fit into a box. We each have unique talents, personalities, and life situations. Along with that, there are a never ending set of combinations of possibilities out there. It’s all up to you to combine them into what you think will work best for you. So, this will be a process of experimenting, reflecting on your past, and being aware of the possibilities.  </p>  <p>  \tWelcome to Finding Your Entrepreneurial Niche!  </p>", 
    "end_date": null, 
    "title": "Find Your Entrepreneurial Niche", 
    "price": "50.00", 
    "instructors": "Rebecca Clark", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50905_b5fa_6.jpg", 
    "course_url": "https://www.udemy.com/find-your-entrepreneurial-niche/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-23T00:15:44Z"
}