{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Event Planning</strong></p><p>Event planning is that inevitable part of life that everyone will have to face at one point or another. Whether it be a small outing for a group of friends or a large conference for your business you will have to be able to plan an event. Therefore, I have prepared for you a <strong><em>1 hour course</em> </strong>that provided you will all the skills and tools you need in order to plan a successful event.</p><p>This course is<strong> </strong><em><strong>designed with you in mind</strong></em>. Therefore there is no time wasted, all of the materials have been condensed to 1 hour, so that way you can get all the keys to event planning despite your busy schedule. In life we don’t have time to sit there writing emails from scratch and making excel charts to get your event going. So, I have provided you with <em><strong>over 8 templates and examples</strong></em> to get you off the ground from the get go. These templates and examples are <strong>taken or derived from actual events</strong>! Therefore, when you do go about planning your cocktail party or conference you know that you have the right tools for the job.</p><p><strong>How is this course structured? </strong></p><p>This course is ordered in the process in which one would organize an event. Therefore we will cover the initial planning first, then move into day of management and conclude with how to finish and event. We will all of the basic building blocks including: </p><ul><li>Designing a budget </li><li>Reaching out to sponsors </li><li>Making a press release</li><li>Sending an effective email</li><li>And more! </li></ul><p><br></p><p><br><br></p>", 
    "end_date": null, 
    "title": "First Time Event Planning | The Complete How To Guide", 
    "price": 0, 
    "instructors": "Andrew Abraham", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/713436_f62c.jpg", 
    "course_url": "https://www.udemy.com/firsttimeeventplanning/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-02T16:59:01Z"
}