{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\"<strong><em>The Best Course on Fiverr I've seen so far. This is a great course to getting your bearings if you're new but also embarking on an upward course even if you are experienced\" </em></strong>Bob Marx</p><p><strong>--------------------------------------------------------------------</strong><strong> </strong><br></p><p><strong>****** 38 fiver-star reviews 1600 students ************</strong></p><p><strong>--------------------------------------------------------------------</strong></p><ul><li><strong>Do you want to become a well paid Fiverr seller with animation?</strong></li><li><strong><strong>Do you want to earn some money on the side with animation and is every dollar welcome?</strong></strong></li><li><strong><strong>Take this course to get started and position yourself in the right way from the start for selling animation on Fiverr!</strong></strong></li></ul><p><strong><strong> </strong><br></strong></p><p>Get an insider view of six different animation software's that are suited for Fiverr Gigs: See me work in: Powtoon, VideoScribe, Explaindio, Videomaker FX and GoAnimate.</p><p>Take a look inside each animation program to compare what is good for your needs. Get to know the ease of working with each program, from my experience.</p><p><strong>What do you get in this course:</strong></p><ul><li>Get to know the best tricks from experienced Fiverr animation sellers.</li><li>Learn the big gaps in the Fiverr marketplace for real animation opportunities</li><li>Research the competition on Fiverr and use it to your advantage</li><li>Position yourself and your animation Gigs for a good start on Fiverr.</li><li>Find the best animation software for you to work in</li></ul><p><strong>-----------------------------------------------------------------------</strong> </p><p><strong>What is unique for this course?</strong></p><p>Use the knowledge of six different animation software's to use what is right for the job!</p><p>\"<em>Many courses teach you either the skill or how to sell it, but this course does both. And it includes all the tips and tricks that would take many frustrating months to find out for yourself by trial and error\"</em> Helen Lindop.</p><p><strong>Become an animation specialis</strong><strong>t </strong></p><ul><li>Amazon book trailers</li><li>Udemy teachers promo videos</li><li>Fiverr Introduction videos</li><li>Become an eCard factory</li><li>Be a course illustrator, with intro and outro animations</li><li>Make Explainer videos for affiliate products</li><li>Intro videos for bloggers</li><li>For Youtube marketing<span></span></li></ul><p><strong>-----------------------------------------------------------------------</strong></p><p>Do wat you love, be creative and earn money with your animations!</p><p><em>\" Superb class outlining steps to break through the typical overwhelm of how do I write a book.</em><em>I have had many thoughts on writing a Kindle book, read many myself, but every time I think about it I get discouraged on how little time I have outside of my day job and desire to be a dad/husband. Having taken this class however I've become super excited over how little I actually have to do and that in something like $50 max I can have my whole book ready without worrying much about the design, editing, etc... Recording myself and the having my words transcribed sounds awesome. Granted this is all in my head right now, but this class has really given me the inspiration I was looking for\" <em>Alex Ivanov</em><span></span></em></p><p><em><em><strong>-----------------------------------------------------------------------</strong><strong> </strong><br></em></em></p><p><em><em><strong>Nov 2015 :</strong> </em> added: It is now possible to ask higher prices for animation Gigs: $25, $50 and $100! This is of course awesome news. Also I have updated the new prices and reviews from our heroes.</em></p><p><em><em><br></em></em></p><p><br></p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Fiverr Animation: Sell Animation on Fiverr as Freelancer", 
    "price": "20.00", 
    "instructors": "Anneke Camstra", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498224_4cf0_12.jpg", 
    "course_url": "https://www.udemy.com/fiverr-animator/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-10T13:41:53Z"
}