{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>[last update: 1st March 2016]</p><p>---------------------------------</p><p><strong>This course is a \"MUST</strong>\"</p><p>Neil has done a great job with this course. He presented <strong>an excellent overview of wordpress</strong>. If you want to create a wordpress blog, <strong>you MUST do this course</strong>. You will gain basic and essential knowledge and this will help you to make a decision.</p><p>Sergio Casado Suarez</p><p>---------------------------------</p><p>This course<strong> compares and contrasts </strong>the differences between the free blogging service offered by Wordpress and a self-hosted blog running Wordpress scripts. </p><p>The course is suited to anyone who's interested in blogging, and has heard of Wordpress, but isn't clear whether or not they should sign up for a free account at Wordpress, or use the free scripts from Wordpress to self-host their own blog.</p><p>The course covers many differences between the two scenarios, including...</p><p>... the differences in how you can monetise your blog </p><p>... the different amount of web-space and bandwidth provided </p><p>... the different theme and plugin restrictions</p><p>... the different domain and sub-domain options</p><p>... the email differences</p><p>... and much more!<br></p><p>At the end of this course, students will be able to decide whether a free account at Wordpress or a self-hosted blog running Wordpress scripts is the right choice for them.</p><p>Please note, this course does not look at the actual process of creating blog posts and pages as this process is very similar for users of both Wordpress and self-hosted blogs.</p>", 
    "end_date": null, 
    "title": "Free Wordpress Blog Or Paid Webhost? [Wordpress .com v .org]", 
    "price": "20.00", 
    "instructors": "Neil and Linda Shearing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/536248_28d6_11.jpg", 
    "course_url": "https://www.udemy.com/wordpress-com-vs-wordpress-org-explained/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T15:39:45Z"
}