{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>FREELANCE FOR FREEDOM!!</strong></em><strong></strong></p><p>Freelancing brings you</p><ul><li>Freedom of mobility</li><li>Freedom of time</li><li>Freedom of choice</li></ul><p>Earn a great living while traveling, working when you want, and working on projects you like, for clients you want to work with!</p><p><em><strong>This course shows you how!</strong></em><strong></strong><br></p><p>I take you through all of the steps of developing and maintaining a freelancing career, from identifying and selecting your marketable skills to bidding for jobs and client relations. <em>This course has everything you need to know to start freelancing right away, and begin living a life of greater freedom!!</em></p><p>Freelancers are independent contractors. We set our own schedules, choose our own clients, and better than with most self-employed people, <em>we have the freedom to live and travel wherever we want! We are not tied to an office!</em><span></span></p><p>All kinds of people freelance today. The field is growing every day as more and more people discover this lucrative and attractive option for earning a great living while having the opportunity to enjoy your life to the fullest.</p><p>Collect stamps in your passport! Not voicemail messages you have to return and a schedule full of appointments you'd really rather not attend.</p><p>Sample the world's cuisine! Don't be stuck with your work cafeteria or worse, fast food.</p><p>Have time to pay attention to your life! Prepare involved meals, exercise, meditate, enjoy your hobbies, sleep -- do all of the things that working a regular job does not allow you time to do.</p><p>Like sleeping late? Taking naps? Going on long walks mid-morning? Exercising or meditating for hours a day? Traveling for months at a time? Working just a few days a week? <em>No problem!</em> Freelancing affords you all of these opportunities and many more. No more sleep deprivation! No more boss breathing down your neck. No more office politics. No more staff meetings. No more cafeteria food.</p><p>Spend more time at home with your loved ones, or out exploring the world! Whatever you want to do, freelancing gives you these options! <em><strong>You have utter freedom to live your life as you please as a freelancer!</strong></em><strong></strong></p><p><strong>So join me today! Give me an hour of your time and let me show you how to enter this fast-growing way to make a great living or to supplement the income you already have! Everything you need to know to get going as a successful freelancer is in this course! <em></em></strong></p><p><strong><em>SIGN UP NOW AND START FREELANCING TODAY!</em></strong></p><p>This course is set at an introductory price. <em>This great price won't last long! So sign up now to take advantage of this low price!</em></p>", 
    "end_date": null, 
    "title": "Freelancing for FREEDOM!", 
    "price": "20.00", 
    "instructors": "Dr. Michele Poff, PhD", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765390_993b.jpg", 
    "course_url": "https://www.udemy.com/freelancing-freedom/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T12:48:41Z"
}