{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>\"If you're a freelancer, as I am, or you're considering becoming one, then this is the course for you. </strong><strong>Dan covers everything from getting your first client to keeping your hopper filled so you're never scrambling around trying to find work.</strong></p><p><strong>You'll learn the right mindset to ensure success along with strategies to help you navigate some of the more treacherous waters of freelancing, namely how much to charge for your services.</strong></p><p><strong>Thanks for a great course, Dan. Keep 'em coming!\"</strong></p><p><strong>-Ray Boreham</strong></p><p>In theory freelancing should help us be, well, more free.</p><p>It's an escape from the office. </p><p>The exit from the 9-5. </p><p>Yet, many freelancers find themselves working longer hours, making less money, and not experiencing any of the freedom. </p><p>All my courses here on Udemy are based on one central theme: Helping my students have more success and freedom in their lives. </p><p>Freelancer Mastery is no different. </p><p>In this course you'll learn advanced strategies I've used in my own freelancer business to increase my rate from $30 an hour to over $100 an hour in less than 6 months. </p><p>When I started out freelancing I would waste hours chasing after \"weak leads\"...sometimes meeting for coffees two or three times just to finally get a two or three hundred dollar contract...one that worked out to be practically minimum wage. </p><p>After I learnt the strategies in this course I had clients sending me full payment for a future project without evening speaking over Skype first, let alone meeting for coffee.</p><p>During my early years I was so insecure that I couldn't imagine confronting a client about an unpaid bill, or demanding 100% payment upfront before beginning a project.</p><p>Yet over time, through advice, mentorship, and trial and error, I figured out better ways or doing things. </p><p>And soon I was focusing 80% or more of my working time was <strong>paid time</strong>, and less than 20% on acquiring new clients, admin work, or chasing down invoices. </p><p>Now I want to be clear, this course isn't a magic bullet. </p><p>You still need to do the work. You need to study your craft and deliver good work for your clients.</p><p>But with the tools and strategies in this course everything will run smoother. </p><p>You'll learn how to set up a proposal that has prospects drooling and offering to pay more than you thought possible. </p><p>You'll learn the right way to get paid so you're no longer worrying about money, chasing late invoices, or resenting clients who disappear without paying. </p><p>When you take this course you'll learn how to run your freelancing business in such an effective and efficient way that you'll be able to focus on delivering quality work for your clients and earning more money.</p><p>If you follow the lessons in this course, you'll have less stress and more free time to enjoy life and the <strong><em>Freedom</em><em></em> <strong>we freelancers are always talking about.</strong></strong></p><p>\"Good, pertinent and relevant information for any Freelancer. Covering the difficult part everyone hates: How to get paid fairly for what you do and how to build and maintain your client list.</p><p>Information can be utilized by both someone just entering into Freelancing as a business and for the more experienced.\" -Susan Reynolds</p>", 
    "end_date": null, 
    "title": "Freelancer Mastery: Stress Less, Work Less, Earn More", 
    "price": "45.00", 
    "instructors": "Dan Johnston", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/536116_31d6_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-successful-freelancer/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T11:08:03Z"
}