{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong><em><strong><strong><em><strong><em>Freelance on Freelancer</em></strong></em></strong> - in this course you will discover <em>how to use </em>the largest outsourcing portal for freelancers and freelancing all around the world.</strong></em></strong></p>\n\n<p><strong><em><strong></strong></em></strong><strong><strong><em>UPDATE: Reworked lectures coming due to Freelancer new layout and preparing new materials</em><em>.</em>  \t</strong>JOIN 1100+ satisfied students NOW to earn more money on <strong>Freelancer!</strong></strong></p>\n\n<p> <strong></strong> <br></p><p>  \t                                                                                                                                                                                          The lessons cover practically every engagement you may encounter when you bid, work and get paid by Freelancer.  </p>\n\n<p> <strong>After you complete the course, your bids will: </strong> <br></p><ul>  \t<li><strong>get much higher chance to be awarded;</strong></li>  \t<li>be posted faster (that also helps when a buyer is selecting urgently or for the best price);</li>  \t<li>help you to be more authentic, be YOU.</li>  </ul>\n\n<p>  \t                                Practically <em>everything that earned me more than $17,374 on Freelancer</em> (I do work over other outsourcing portals but Freelancer gets me the most income).  </p>\n\n<p> <strong>You'll get immediately useful information: </strong> <br></p><ol>  \t<li><strong>How, when and what amount to bid.</strong></li>  \t<li>What to say in your freelancing bid.</li>  \t<li><strong>When to emphasize your bid to stand out.</strong></li>  \t<li>How to estimate your milestones correctly.</li>  \t<li><strong>What to pay attention on when    working per hour.</strong></li>  \t<li>Ways to contact Freelancer (and when not).</li>  \t<li><strong>How to start improving your chances to be awarded a project.</strong></li>  </ol>\n\n<p>  \t                                                                                                                                                                                          All from the <em>10 years of experience</em> from a freelancer who has started on RentACoder that got renamed to vWorker and acquired by Freelancer.  </p>\n\n<p> <strong>How this course is delivered:</strong> <br></p><ul>  \t<li>videos will show you <strong>practical tips</strong><strong>;</strong></li>  \t<li><strong>document templates</strong> will help you <strong>bid quickly</strong> and</li>  \t<li><strong>resources</strong> will be your weapon to build a <strong>great profile</strong>.</li>  </ul>\n\n<p>  \t                      Join me in this course and let me help you <em>ease the process</em> of competing with others, <em>getting the projects awarded </em>and <em>focus</em> most of your time on <strong>what gets you paid</strong> - working on awarded projects. Your first bid <em>might make you more money online</em> than your investment in this course. Click the <strong>Take This Course (Buy This Course</strong> - if you are using mobile device) button to start now!  </p>\n\n<p>  \t                                                                                                                                        To your success,  </p>\n\n<p>  \t                                                                                                                                        Matt S Rinc  </p>\n\n<p>  \t                                                                                    P.S. Since student times freelancing work has helped me and now it's more important than ever. By 2020 research shows that more than 50% of people will be working remote, most of the time freelancing. Join me, ask me and you'll have <strong></strong><strong>positive return</strong> too!  </p>", 
    "end_date": null, 
    "title": "Freelance on Freelancer - How to Earn More with Freelancing", 
    "price": "25.00", 
    "instructors": "Matt S Rinc", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312502_d4f0_6.jpg", 
    "course_url": "https://www.udemy.com/freelance-on-freelancer/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-02T22:57:01Z"
}