{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tIn 2009 I started my own web design and online marketing business in Houston, TX. Since that time I have learned how to grow my business each year and double my profits.  </p>  <p>  \t<span>This is a video guide about the essentials of jump starting business as a freelancer, designer or digital creative and is based on my experience. The principles taught in this course apply to all types of business from accounting all the way to how to raise your rate and earn more each project.</span>  </p>  <p>  \t                              The video course comes with 10 videos and a full color 31-page guide available in PDF that expound upon each of the lessons.  </p>  <p>  \t                              The Course:  </p>  <ol>  \t<li>Introduction</li>  \t<li>Your Business Idea - Learn to validate your business before you go through the process or formalizing your business. </li>  \t<li>Business Structures - Learn the different business structures there are out there.</li>  \t<li>The Right Pricing - Learn how to price on value not based on what competitors are charging.</li>  \t<li>Invoicing &amp; Contracts - Learn the important aspects of what goes into an invoice or contact.</li>  \t<li>Accepting Payments - Set your business up to accept payments in different ways. </li>  \t<li>Bookkeeping &amp; Accounting - A quick look at some of the important things to remember when handling the bookkeeping for your business. </li>  \t<li>Showcasing Your Work - Learn what elements are best to emphasize when showcasing your work. </li>  \t<li>Marketing Your Business - Easy ways to market  your business.</li>  \t<li>The End Is Only The Beginning</li>  </ol>", 
    "end_date": null, 
    "title": "Freelance Jumpstart Course", 
    "price": 0, 
    "instructors": "Nathan Allotey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/278809_fd31_6.jpg", 
    "course_url": "https://www.udemy.com/freelance-jumpstart/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-11T16:25:17Z"
}