{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em style=\"\"><em style=\"\">From the producers of over one thousand business building programs and creators of entrepreneurial educational videos with organizations such as Inc. Magazine, Black Enterprise, Business Week, The SBA, NFTE, Fortune and others, introducing:</em></em></p> <p style=\"\">Part 1 of 2 of a comprehensive, in-depth, and entertaining video series that mentors young entrepreneurs to starting and growing a business. &nbsp;Our Young Entrepreneur&#039;s Guide To Starting And Growing A Business series was carefully crafted into a rich 90 minute program from over 45 hours of content. &nbsp;</p> <p style=\"\">This section of the course begins with defining the entrepreneur within yourself, finding an idea to execute, executing the idea, and concludes with drafting a business plan. &nbsp;Over 15 real world young entrepreneurs share their insight on these topics, acting as personal mentors to help you grow. &nbsp;These entrepreneurs include Tony Hsieh of Zappos.com, Eric Ryan of Method, Scott Gerber of the Young Entrepreneur Council, Catherine Hughes of Radio One, and many more. &nbsp;Featuring restaurant owners to billion dollar online retailers, this video has valuable information that any startup can learn from.</p> <p style=\"\">**Also included is a PDF-formatted 25-page guide and workbook that contains information and exercises to accompany our video program. &nbsp;We recommend you utilize our customized workbook to get the ultimate valued experience from this course.<br style=\"\" /><br style=\"\" /></p> <p style=\"\"><strong style=\"\"><em style=\"\"><span style=\"\"><span style=\"\"><strong style=\"\"><em style=\"\">&ldquo;&hellip;one of the most valuable programs I have experienced. &nbsp;It engages and provides practical information from an incredible cast of real life business owners. &rdquo;</em></strong></span></span></em></strong></p> <p style=\"\"><strong style=\"\"><em style=\"\"><span style=\"\"><span style=\"\"><strong style=\"\"><em style=\"\">- Michael Simmons, Co-Founder and CEO of Empact</em></strong></span></span></em></strong></p> <p style=\"\"><em style=\"\"><strong style=\"\">&quot;This is the most powerful video series I have experienced. &nbsp;It is a groundbreaking program that can be used by anyone interested in growing a business.&quot;</strong></em></p> <p style=\"\"><strong style=\"\"><em style=\"\">- Steve Mariotti, Founder, NFTE, Network For Teaching Entrepreneurship</em></strong></p> <p style=\"\"><strong style=\"\"><a href=\"javascript:void(0)\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Click here to view Part 2 of this series on Growing A Business!</a></strong></p> <p style=\"\"><strong style=\"\"><a href=\"javascript:void(0)\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">You can take both courses of this series for a discounted price here.</a></strong></p>", 
    "end_date": null, 
    "title": "From Startup to Millions Before 30: Part 1", 
    "price": "50.00", 
    "instructors": "TeleTime Video Productions", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/15459_c8b9_9.jpg", 
    "course_url": "https://www.udemy.com/youngentrepreneurs1/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-03-23T15:19:28Z"
}