{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have a great app idea? Now what? Wouldn’t it be awesome if you could instantly turn that app idea into <strong>a real money-making app</strong> and launch it everywhere in the world? Apple has paid out over $15 billion dollars to app creators and there are tens of thousands of people building apps right now around the world.</p><p>I designed this class specifically for people that have an idea for an app but don’t have a technical background. You’ll learn how to create an app without having to do the coding yourself. I’ll teach you how to <strong>find a technical cofounder</strong> and how to <strong>outsource your project </strong>for cheap. You’ll learn the right way to <strong>write an app product spec</strong> so you don’t have to waste thousands of dollars doing rework with your developers.<br></p><p>I’ve designed dozens of blockbuster apps for organizations like <strong>NASA, Ticketmaster, and Live Nation</strong>, and some of these apps have millions of users and bring in millions of dollars every day. I was also recruited to work for Apple where I helped them scout out high-potential apps and mentored 3rd party app teams. Because I’ve been an Apple insider, the knowledge and wisdom that I’ll share with you won’t be available anywhere else. You’ll learn the 5 key ingredients that Apple look for in a great app so you can greatly increase your chances of getting featured on the app store front page and learn the main reasons why apps get rejected so you know how to avoid those landmines. </p><p>I’ve taught dozens of workshops and courses for prestigious institutions like <strong>Stanford University, Art Center College of Design, and General Assembly</strong> and have launched a few online classes on Udemy with over 3,000 students enrolled from all over the world. And you can tell how much value I’ve given my students by the hundreds of 5 star ratings and satisfied reviews left by my students. I pour my heart and soul into every class I teach. </p><p><em></em></p><p>I also look at the discussion forums every single day and will answer whatever question you might have so I’ll be there learning with you every step of the way. </p><p>Enroll now and let’s turn your dream app idea into reality.</p>", 
    "end_date": null, 
    "title": "From Idea to App Store - A Complete Guide from an  Insider", 
    "price": "25.00", 
    "instructors": "Charles Du", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758026_8fd2_2.jpg", 
    "course_url": "https://www.udemy.com/from-idea-to-app-store-a-complete-guide-from-an-apple-insider/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T04:51:34Z"
}