{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em style=\"\">From the producers  of over one thousand business building programs and creators of entrepreneurial  educational videos with organizations such as Inc. Magazine, Black Enterprise,  Business Week, The SBA, NFTE, Fortune and others, introducing:</em></p><p style=\"\">A comprehensive,  in-depth, and entertaining video Guide to Starting a Business  that mentors young entrepreneurs to starting and growing a business. &nbsp;Our  Young Entrepreneur&#039;s Guide to Starting Your Own Business Ideas was  carefully crafted into a rich 90 minute program from over 45 hours of content.  &nbsp;</p><p style=\"\">This course begins  with defining the entrepreneur within yourself, finding an idea to execute,  executing the idea through market research, drafting a business plan,  financing, marketing, managing employees, and concludes with essential skills  and tips to get you going and growing. &nbsp;</p><p style=\"\">Over 15 real world  young entrepreneurs share their insight in this Guide to Starting a  Business on these topics, acting as personal mentors to help you grow.  &nbsp;These entrepreneurs include Tony Hsieh of Zappos.com, Eric Ryan of  Method, Scott Gerber of the Young Entrepreneur Council, Catherine Hughes of  Radio One, and many more. &nbsp;Featuring restaurant owners to billion dollar  online retailers, this video has valuable information that can help you in Starting  Your Own Business Ideas.</p><p style=\"\">**Also included is a  PDF-formatted 25-page guide and workbook that contains information and  exercises to accompany our video program. &nbsp;We recommend you utilize our  customized workbook to get the ultimate valued experience from this course.    </p><p style=\"\"><em style=\"\"><strong style=\"\">“…one  of the most valuable programs I have experienced. &nbsp;It engages and provides  practical information from an incredible cast of real life business owners. ”</strong></em></p><p style=\"\"><em style=\"\"><strong style=\"\">-  Michael Simmons, Co-Founder and CEO of Empact</strong></em></p><p style=\"\"><strong style=\"\"><em style=\"\">&quot;This  is the most powerful video series I have experienced. &nbsp;It is a  groundbreaking program that can be used by anyone interested in growing a  business.&quot;</em></strong></p><p style=\"\">                            </p><p style=\"\"><em style=\"\"><strong style=\"\">-  Steve Mariotti, Founder, NFTE, Network For Teaching Entrepreneurship</strong></em></p>  ", 
    "end_date": null, 
    "title": "From Startup to Millions Before 30", 
    "price": "35.00", 
    "instructors": "TeleTime Video Productions", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17844_fa1b_4.jpg", 
    "course_url": "https://www.udemy.com/a-young-entrepreneurs-guide-to-start-and-grow-a-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-16T13:28:09Z"
}