{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>UPDATE 8th of MAY 2016: I have now sold over 340 units within 16 days since my launch on Amazon totalling over 10,000USD in sales. See all steps on how I did it within this course!</strong></p>\n\n<p>My name is Manuel and I have been importing from China for over 18 years while actually living in China for over 11 years now. </p>\n\n\n\n<p>This course is unlike any other course that you can find anywhere online. It is T<strong class=\"redactor-inline-converted\">HE only course that actually shows you a LIVE example</strong> on how to choose a product, contact suppliers in China, verify them, calculate margins and costs, place your order to the factory and private label your item on Amazon. Look over my shoulders on how I communicate with suppliers in China, check samples, list the product on Amazon, create a packaging, inspect the goods in China, ship it to Amazon USA and launch the product. See for yourself that the process works and look at my sales numbers. Find out how to get exclusivity agreements, sign purchase order contracts and get the best out of your product. </p>\n\n\n\n\n\n<p>This is a step-by-step guide from the beginning to the end. See how I analyse suppliers feedback, test reports, which tools I use and how I make difficult decisions. </p>\n\n\n\n\n\n<p>With my experience in working for a retailer for over 18 years and purchasing from China as a Product Manager based in Hong Kong for over 11 years you will learn how to safely procure a product in China and sell it successfully on Amazon. </p>\n\n\n\n\n\n<p>Again, this is a REAL life study, investing my own money and documenting the entire case study with video, phone calls, pictures, templates and much much more. I reveal my actual product and supplier and show you the sales numbers on Amazon. No one else has ever done that. I am not afraid of competition or copycats revealing this as there are so many opportunities with other products and if I can do it so can you with this course. </p>\n\n\n\n\n\n<p>I run my own sourcing company in Hong Kong, teach people how to import from China, author several books sold on Amazon and sell my own products on Amazon. Many “gurus” out there will only give you examples and techniques that “might work” but none of them have actually worked and lived in China, importing/exporting over 200Million USD like I have. </p>\n\n\n\n\n\n<p>Follow me on this journey and become a successful importer and eCommerce Entrepreneur. </p>", 
    "end_date": null, 
    "title": "From China to Amazon - A LIVE case study and complete guide", 
    "price": "50.00", 
    "instructors": "Manuel Becvar", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/704332_07a3_2.jpg", 
    "course_url": "https://www.udemy.com/from-china-to-amazon-a-live-case-study-and-complete-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-23T02:14:09Z"
}