{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Safiyah Satterwhite is trained by Columbia University Business School as an Executive Leadership Coach. Throughout her career she has served in the roles of  Teacher, Founder, CEO, Board Member, Assistant Superintendent of Schools, Principal and Consultant.  </p>  <p>  \t  Safiyah holds a Bachelors Degree, two Masters Degrees and is a finishing doctoral student at Columbia University. Her university work comprises of crafting training to support Education Entrepreneurs in launching Educational Businesses and Schools.  </p>  <p>  \t  Safiyah has supported hundreds of schools and businesses in growing to become more effective, and has recently taken joy in working 1 on 1 with Entrepreneurs and leaders; helping them develop and launch their dreams!  </p>  <p>  \t  If you have not already started scouring the internet looking for support in designing and launching your new venture, you should know that there are many people who produce these kinds of videos for a living and charge thousands of dollars. This video will teach you the same and even better new business/ non-profit starting principles. I hold a personal belief that information for Innovators should be more accessible and quite frankly, the world needs your ideas.  </p>  <p>  \t            This course is the most comprehensive online course for beginning Entrepreneurs, Edupreneurs, Social Entrepreneurs and Teacherpreneurs! If you already have an idea and want to create something, this course you will teach you how to form your entity with little to no money, and grow it effectively in less than 2 hours!  </p>  <p>  \t            Becoming a founder is tough work; I know because I have been one over 4 times now; from building an organization generating over 3 million dollars in annual revenue to venturing into the online business space. In this video I will sell you my successes but more importantly my mistakes so that you can truly capitalize on your idea and get your new life started TODAY!  </p>  <p>  \t            Enjoy it, and please leave some feedback. Every tool introduced are ones you can start using today and most of them are completely free.  </p>", 
    "end_date": null, 
    "title": "From Cubicle To Freedom", 
    "price": "20.00", 
    "instructors": "Safiyah Satterwhite", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296776_4809_8.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurtools/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T02:21:49Z"
}