{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tThis course was created by experienced fundraiser Julia Pimsleur (CEO of Little Pim and Founder of Double Digit Academy) to help entrepreneurs raise Angel and Venture Capital (VC). The owner of one of the few women-run Venture Capital-backed companies in the U.S., Julia teaches how to effectively raise Angel and Venture Capital with her first-hand experience, moxie and enthusiasm.<br>  \t<br>  \tLearn from Julia!<br>  \t<br>  \tPart 1:<br>  \t<br>  \tStructured around three live presentations by Julia given to a room of entrepreneurs, students will learn what kinds of deck, pitch, investor language and financials will drastically increase their chances of success, as well as how and at what point to approach Angels and VCs.<br>  \t<br>  \tPart 2: Top Tier Public Speaking Coach<br>  \t<br>  \tIn addition to learning from Julia, you will get valuable pitching tips from acclaimed public speaking coach, Bill Smartt. His engaging presentation demonstrates why Bill is known in New York and San Francisco as one of the most effective communication coaches practicing today. He’s led workshops at Spotify, Facebook, Foursquare, Time Warner, American Express, Credit Suisse, and a host of Fortune 500 companies. He regularly provides customized individual coaching to business leaders in the fields of finance, advertising and technology. And he is active in the U.S. startup scene as a regular instructor at General Assembly, Brooklyn Brainery and other entrepreneurial campuses around the country.<br>  \t<br>  \tPart 3:<br>  \t<br>  \tLearn to speak VC with VC Guest Speaker Mark Peter Davis, who compellingly breaks down the nuts and bolts of the VC and entrepreneur relationship, terminology, and the often unspoken etiquette that exists. With welcome candor and clarity, he tackles frequent and often complicated questions facing entrepreneurs from the perspective of a veteran serial investor. Mark is the Founder of Interplay Ventures, a co-founder of DevSpark, Founder Shield, Nomad Financial, TwentyPine, Venwise and a Venture Partner at High Peaks Venture Partners. Mark received his BA in Economics and History from Duke University and his MBA in Venture Finance from Columbia University.<br>  \t<br>  \tHe is the author of The Fundraising Rules, an essential book included on this course&#039;s Recommend Reading List. His highly-influential blog, <a href=\"http://mpd.me/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\">mpd.me</a>, has been featured in Business Insider, which listed him as one of the 100 Most Influential Digital NYers. His blog has been syndicated or cited on Inc.com, Mashable, Business Insider, OPENForum, AlwaysOn, PEHub, ReadWriteWeb, The Wall Street Journal and others.<br>  \t<br>  \tYou will do exercises personalized to your business in this course. The first will help you identify resources you have and how to make the best use of them. The second will help you research  the fundraising landscape and the third is an Action Plan so you can get started right away on raising funds.<br>  \t<br>  \tThe majority of the documents available in the Additional Materials section are actual documents used during a high-dollar investment including: a Due Diligence List, Sample Lawyer Email, and a Term sheet.<br>  \t<br>  \tFurther. Faster. Funded. will increase your chances of successful fundraising, improve your presentation skills and save you months and months of research. Learn from experienced professionals and get further, faster, and get funded.<br>  \t<br>  \tFortes Fortuna Juvat! (Fortune Favors the Brave)<br>  \t<br>  \tAbout Julia:<br>  \t<br>  \tDynamic and high-energy, Julia is the founder and CEO of Little Pim, the leading language teaching series for young children and the Double Digit Academy, an “off line” fundraising bootcamp for women entrepreneurs in New York City. Julia&#039;s Further. Faster. Funded. can help you break through barriers, have the right language for your investors and get funded faster.<br>  \t<br>  \tA former filmmaker with no formal finance background, Julia herself faced a steep learning curve. With just $30K in seed money, she turned her idea into the Little Pim series, which has gone on to garner 25 awards and become a multi-million dollar business. Little Pim products can be found in Toys ‘R’ Us,  on iTunes, on Leapfrog tablets, and on smartphones and tablets the world over.<br>  \t<br>  \tJulia has been featured on The TODAY Show, Fox News, Business Week, and NBC Weekend Today. Julia is also a regular blogger for the Entrepreneur section of Forbes.com.  </p>", 
    "end_date": null, 
    "title": "Fundraising Bootcamp: Raise Angel and Venture Capital faster", 
    "price": "30.00", 
    "instructors": "Julia Pimsleur", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/167886_e62a_6.jpg", 
    "course_url": "https://www.udemy.com/furtherfasterfunded/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-19T20:16:14Z"
}