{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"><strong style=\"\"><em style=\"\">Are you looking for investors? It&#039;s not as easy as people make it out to be is it...</em></strong></p><p style=\"\">Do you have an opportunity that you want to pursue or the next BIG thing that just needs a handful of investors with some faith?&nbsp;</p><p style=\"\">Maybe you have a small but growing business and its time to take it to the next level?</p><p style=\"\">Have you already tried to raise money but haven’t locked in your investor yet? &nbsp;How long has it taken so far? A week, a month, a year?</p><p style=\"\">or are you standing still, scratching you head, wondering how to even start?</p><p style=\"\">Funding Academy Express will take you through the funding process - from start to finish and answer your key questions and get you moving you towards finding your ideal investor and successful funding.</p><p style=\"\">If you want to develop a plan you can start following right away to get your own ideal investor - then Funding Academy Express is the course for you. &nbsp;Sign up now.</p><p style=\"\">(NOTE: As you go through the course, follow me, ask questions and I&#039;ll be happy to get back to you and also integrate common questions into future versions. Cheers! Andrew)</p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Funding Academy Express: How to Get Your Ideal Investor", 
    "price": "50.00", 
    "instructors": "Andrew D. Ive", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37502_4b7c_8.jpg", 
    "course_url": "https://www.udemy.com/funding-academy-express-how-to-get-your-ideal-investor/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-22T16:41:49Z"
}