{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>** According to Business Insider: \"Haroun is one of the highest rated professors on Udemy, so you can expect to be in good hands through the course of your education.\" **</strong></p><p>This course willteach you <strong>everything </strong>you need to know about raising money from anyone, including venture capital firms from an award winning business school professor, venture capitalist, entrepreneur and author including:</p><ul><li>Learn the secrets of networking and how to get a meeting with almost anyone.</li><li>Learn how to pitch your business model to anyone including venture capital firms.</li><li>Learn what you should and should not include in your presentation slides.</li><li>Learn how to present your business model like Steve Jobs.</li><li>Learn how to turn \"no\" into \"yes\".</li></ul><p>...and much more.<br></p><p>Chris has over 20 years of experience in raising money, starting companies and advising companies including work experience at Goldman Sachs and founding several companies. He has raised over $1bn. He has an MBA in finance from Columbia University and he is an award winning business school professor and frequent guest lecturer at Stanford and Berkeley. He lives in the San Francisco Bay area and he is a partner at a prominent venture capital firm. Chris has written numerous articles in VentureBeat, Entrepreneur Magazine, Wired Magazine, AlleyWatch, Pulse as well as an interview on venture capital on Radio Television Hong Kong (RTHK) which is Hong Kong's oldest and sole public service broadcaster. </p><p>Thank you,<br>Chris Haroun</p><p><br></p>", 
    "end_date": null, 
    "title": "Fundraising Advice from a Successful Venture Capitalist", 
    "price": "20.00", 
    "instructors": "Prof. Chris Haroun", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628322_d9c6_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-raise-money-from-anyone-including-vcs/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T21:59:02Z"
}