{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"></p><p style=\"\">These days, entrepreneurs and small businesses are  struggling to find the capital they need to grow their business. Business  owners keep on asking how  to raise money fast. Skills aren’t the issue; there are plenty of  management teams who are experts at what they do. Experience isn’t the issue,  majority of business owners have been in the workforce for over 10 years.  Access to these investors is the issue. The reality is, most entrepreneurs and  small business owners fail within two years of incorporation because they don’t  know how to find, engage or attract investors. At INVESTyR, it is our mission  to better people’s lives by improving their access to capital. Over the last couple  years, we have developed a system for educating owners on digital media and  improving their chance of survival and growth. We’ve done this by focusing on 3  basic principles:</p>    <p style=\"\">1. Investors want to be found </p>    <p style=\"\">2. People Invest in People They Like</p>    <p style=\"\">3. The modern investor has changed</p>    <p style=\"\">Focusing on this core process helps you cut the  average amount of time to  raise money in half, and focus on growing your business. Sign up for the  INVESTyR Udemy course now to learn how to raise money fast for your business and  Invest your reputation!</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Fundraising Masters: Your Ultimate Resource", 
    "price": "25.00", 
    "instructors": "INVESTyR DealTeam", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/31392_4a2f_7.jpg", 
    "course_url": "https://www.udemy.com/used-digital-media-for-fundraising/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-05T16:18:45Z"
}