{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn the basics of funding a video or film project – whether it’s for a feature, short, documentary, commercial or any project you’re trying to get off the ground. This course will teach you the exact steps that we've taken to fundraise our own film projects.</p><p><strong>About this course:</strong></p><p>This course help you prepare a pitch packet to raise funds for your project. Raising funds is the hardest part of starting a venture but by following the simple easy steps in this course, you will be well on your way to starting your dream project. By the end of this course, you will have mapped out what you need to do and have all the materials you need to approach investors. </p><p><strong>Here is what is covered in the course that will equip you with the right ideas:</strong></p><ul><li>Identifying what type of project your doing</li><li>How to make a look book</li><li>Finding the right resources for you project</li><li>Packaging your project</li><li>Getting you connected with the right people</li><li>Being the better business individual </li><li>Putting yourself on the radar</li><li>Building a portfolio</li></ul><p><strong>Why should you enroll?</strong></p><p>It’s time for you take your project to the next level and you have no idea how to do it. You feel like you have tried everything and tried talking others to death about your project but it’s just not coming to fruition. You're frustrated and don't know where to start. These are all the right reasons for you to enroll in this course because it gets you on the right path to finding success. </p><p><strong>What's included?</strong><br></p><p>This is a high quality course that pushes you in the right direction to get the funding you need. Other bonuses that you get when you enroll in this course:</p><ul><li>Lifetime access to video lectures</li><li>One on one consultations (just message Caleb)</li><li>Exercises that will get you started with fundraising</li><li>Established checkpoints to help you keep moving forward</li></ul><p><strong>About the Instructor</strong> </p><p>Hi, I'm Caleb Negassa. I've been producing shorts, features, TV series and commercials for nearly 10 years in Los Angeles. When I started out, I had no idea what resources were available to me nor did I know what the right questions to ask where. Through trial and error and extensive time spent at trying to get projects off the ground, I’ve come full circle into what it takes to get a project off the ground. I’ve had the pleasure of raising money for shorts, narrative features and web series.</p>", 
    "end_date": null, 
    "title": "Fundraising 101: Pitch, Fund, and Kickstart a Video Project", 
    "price": "20.00", 
    "instructors": "Phil Ebiner, Caleb Negassa", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/627428_5da2.jpg", 
    "course_url": "https://www.udemy.com/how-to-raise-money-for-your-video-film-project-fundraising-course/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-30T21:26:39Z"
}