{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you a creative person, with a passion for video games, who has higher desires in life than settling into an average 9 - 5 job? </p><p>Have you ever thought about making games for a living or even starting your own business?</p><p>Then, you are in the right place! </p><p>Starting a game studio can be one of the most exciting adventures you can take in life! It can open up a completely new world of opportunities that let you <strong>do what you love</strong> and make a <strong>great living</strong> while your at it.</p><p>So many times, the hardest part of doing something is getting started, and for many beginners, starting a game studio can be wrapped in a <em>cloud of mystery</em>. It's easy to look at established players in the industry and wonder <em>\"Where in the world would I even begin?\"</em><em></em></p><p>I'm here to tell you that it's NOT that hard. If you know the right steps to take and are willing to put in all of the hard work, there's no reason your can't make major strides toward your dream studio!</p><p><strong>About the Course</strong></p><p>A game studio is a serious business, and you need a little more instruction than \"Go get some friends, make a game, and watch the millions roll in!\" </p><p>This course is designed to give you an in-depth, step-by-step process you can follow to get started today.</p><p>I'm not going to waste your time with boring filler information that you'll never be able to use. Each lesson is packed with strong concepts and quality information to give you a good foundation for the particular subject.</p><p>I use a highly visual style of teaching, including: power points, drawings, and animations, to help reinforce the concepts as I explain them.</p><p><strong>What You'll Learn</strong><br></p><p>I didn't want to make a course that just covered bits and pieces, leaving giant holes for you to fill in yourself. So, I got together the essential steps to take and the process you need to know and organized them in an easy (and hopefully entertaining) format.</p><p>This course is broken into 3 main parts: Planning, Management, and the Project Process. </p><p><strong>Planning</strong></p><p>Here you are going to learn the basic steps you need to go through to start a legitimate studio. You'll learn how to:</p><ul><li>Fund your studio</li><li>Get a team</li><li>Build a brand</li><li><span></span>Chose a studio location</li><li>Plan for the future</li><li>Build your studio around a solid purpose</li></ul><p><strong>Management</strong></p><p>Once you have a studio, you need to understand how to manage it. So I'll show you how to:</p><ul><li>Form a management structure</li><li>Chose a manager</li><li>Resolve conflicts</li><li>Manage tasks</li><li>Be productive</li></ul><p><strong>Project Process</strong></p><p>After you've learned how to put together a studio and manage it effectively, you need to know how to actually go through the game design process! So I will teach you how to:</p><ul><li>Create video game concepts</li><li>Determine if a project is a good business decision</li><li>Create a game design document</li><li>Tackle the development process</li><li>Test and validate your game</li><li>Market your game effectively</li></ul><p>All of this material should give you a great starting point to get out there and get to work! I can't teach you everything there is to know about starting a studio, but after going through this course, you should have the skills and know-how needed to learn the rest as you take your journey into this new and exciting world.</p><p><strong>Stop Dreaming. Start Doing.</strong><br></p><p>So what are you waiting for?</p><p>Take that first step, and join a course that will get you moving toward your dream. </p><p>I'm here to help you in any way I can. </p><p>I care about your success, and I want you to do greater things than you have ever imagined!</p><p>I look forward to helping you inside the course!</p>", 
    "end_date": null, 
    "title": "Game Studio 101: Make Video Games for a Living", 
    "price": "20.00", 
    "instructors": "Brandon Shepherd", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660484_2066.jpg", 
    "course_url": "https://www.udemy.com/game-studio/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T22:23:35Z"
}