{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Despertar en el lugar donde siempre quisiste estar, prepararte un café y comenzar a trabajar. Sin necesidad de acudir a la oficina, lidiar contra el tráfico o soportar a tu jefe... ¡ Qué maravilla ! Por fin tienes tiempo para dedicar a tu familia, pareja o aficiones. Ya no necesitas huir 20 días de vacaciones para olvidar todo lo que trabajaste durante un año. Tampoco necesitas pasar la semana deseando que llegue el viernes. Eres dueño de tu tiempo, lo que significa que puedes llevar tu oficina en una maleta, ponerte un traje de baño por uniforme y andar a la playa a trabajar. </p>\n\n<p><strong class=\"redactor-inline-converted\">¿Sueñas con esta vida?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Mi sueño era el mismo que el tuyo y ahora es mi realidad. Por eso déjame decirte que puedes librarte de las cadenas que te atan a un trabajo tradicional y ser LIBRE. El trabajo 3.0 pone ante nosotros una nueva realidad donde ya no existen las fronteras lo que significa que podemos trabajar para cualquier empresa y desde cualquier parte del mundo. Si aún no perteneces al trabajo digital déjame presentártelo, te aseguro que cambiará tanto tu vida que nunca más podrás volver al sistema tradicional.   <br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">ESTE CURSO ES PARA TI SI...</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>-Sueñas con escapar de la oficina.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>-Despedir a tu jefe.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>-Ser dueño de tu tiempo.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>-O convertirte en nómada digital.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">ORGANIZACIÓN DEL CURSO</strong>:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Este curso está centrado en la plataforma de trabajo freelance<strong class=\"redactor-inline-converted\"> UPWORK </strong>(Dentro del curso se explica con detalle qué es Upwork). Pero antes de comenzar, me gustaría subrayar que este curso <strong class=\"redactor-inline-converted\">NO ES UN GASTO</strong> sino una <strong class=\"redactor-inline-converted\">INVERSIÓN </strong>a tu nueva vida porque recuerda que al finalizarlo <strong class=\"redactor-inline-converted\">ENCONTRARÁS UN TRABAJO FREELANCE</strong> <strong class=\"redactor-inline-converted\"> </strong>con lo cual <strong class=\"redactor-inline-converted\">LA RENTABILIDAD ESTÁ ASEGURADA</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Estos son los resultados de algunos de mis alumnos:</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Anabel Martinez Galera:</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Después de unos días, ¡conseguido y entregado mi primer trabajo en Upwork! </em><em class=\"redactor-inline-converted\">Espero que sea el primero de mucho más. Gracias Cristina García por darnos a conocer Upwork </em><em><em><u><em class=\"redactor-inline-converted\">:)</em></u></em></em></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Estefanía Fuentes López:</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Gracias por hacerme descubrir el mundo UPWORK. He encontrado mi primer trabajo no puedo estar más feliz.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Detalles sobre el curso:</strong></p>\n\n\n\n\n\n<p>El curso está dividido en<strong class=\"redactor-inline-converted\"> 9 secciones y 25 clases </strong>en las que aprenderás cada una de las enseñanzas que necesitas antes de comenzar a trabajar desde casa: crear tu perfil en Upwork, encontrar aquel trabajo que se adapta a ti, enviar una propuesta al cliente, superar la entrevista, configurar tu pago y organizar tu vida para desenvolerte en el mundo del trabajo freelance con éxito. <br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Todo lo que necesitas saber para <strong class=\"redactor-inline-converted\">comenzar tu carrera profesional dentro de Upwork y ganar dinero 100% desde tu casa</strong> haciendo aquello que te gusta: </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Se incluyen más de 10 recursos añadidos</strong> como: plantillas para crear tu propuesta al cliente, herramientas para ser más productivo, consejos para diseñar tu propuesta así como descubrir las fortalezas que debes destacar, entre otros. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Además el curso ofrece la posibilidad de unirse a una <strong class=\"redactor-inline-converted\">comunidad creada en Facebook</strong> para todos aquellos participantes del curso. Un lugar donde compartir inquietudes, información de interés acerca del trabajo freelance y cómo no... un sitio donde podrás compartir todos tus éxitos en Upwork.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Recuerda que tienes 30 días de garantía de devolución de tu pago. Así que no pierdes nada por adquirir este curso y <strong class=\"redactor-inline-converted\">sí que estás perdiendo mucha libertad al continuar acudiendo cada día a tu oficina</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">SOBRE EL INSTRUCTOR:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>El curso está presentado por <strong class=\"redactor-inline-converted\">Cristina García</strong>: periodista, blogger y <strong class=\"redactor-inline-converted\">experta en Upwork </strong>quien ha conseguido  posicionarse como \"Top Rated\" es decir: una de las mejores de su sector dentro de esta increíble plataforma de trabajo freelance. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Si quieres saber más puedes leer qué es lo que dicen de ella sus clientes:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Una de las mejores freelancers que han pasado por aquí. Ilimitado potencial, inteligente y muy buena persona. Sin duda posee una gran personalidad. No dudaría ni un segundo en volverla a contratar.\" </em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Definitivamente recomendaría a Cristina como freelancer. Entrega sus trabajos a la hora justa y con gran resultado. Me gustaría volver a trabajar con ella.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Si tu también quieres obtener estos resultados trabajando desde tu casa <strong class=\"redactor-inline-converted\">no dudes en aprender de ella y de sus consejos para conseguir el éxito freelance.</strong></p>", 
    "end_date": null, 
    "title": "Gana un sueldo trabajando desde casa y despide a tu jefe", 
    "price": "25.00", 
    "instructors": "Cristina Garcia", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/783526_21d8_9.jpg", 
    "course_url": "https://www.udemy.com/ganar-dinero-viajar-y-trabajar-freelance/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-05T23:09:03Z"
}