{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>¿Alguna vez has visto un video en Youtube, acerca de un tema que te gusta o apasiona?, ¿sabías que las personas que producen esos videos están ganando mucho dinero por subirlos a Internet?, y la pregunta más importante es… ¿por qué estas dejando pasar esa oportunidad?</p>\n\n<p>La intención de este curso es enseñar a las personas a realizar videos con los temas que más les gustan o apasionan, para que puedan obtener un ingreso considerable en su tiempo libre, haciendo las cosas que les gusta hacer. No importa que sea lo que a ti te guste… desde la ingeniería hasta la poesía, desde la programación hasta la repostería, desde hacer gameplays, tutoriales, reseñas, hasta simplemente hablar de lo que paso en tu día, en youtube hay un lugar para todos. \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Para este curso no necesitas tener conocimiento previo, pues te mostramos desde lo básico, hasta técnicas avanzadas de crecimiento. Vamos a mostrarte paso a paso como es que una idea se puede convertir en un video, llevándote de la mano por la planificación, producción, edición, configuración y promoción de tus videos en diversas plataformas como Facebook y Youtube. \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Cualquier persona con el deseo de emprender un proyecto propio en Internet puede tomar este curso, no importa si no cuentas con un presupuesto para invertir en tus videos, te mostramos cómo puedes iniciar con una inversión nula y cómo puedes empezar a generar ingresos en diversas plataformas en muy poco tiempo. No necesitas tener miles de suscriptores para ganar dinero, es posible hacerlo desde un inicio y te mostramos cómo. \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Si alguna vez soñaste con hacer algo verdaderamente importante y obtener el reconocimiento de muchas personas, te ofrecemos las bases para cumplir tus objetivos. </p>", 
    "end_date": null, 
    "title": "Gana dinero con youtube + Marketing de contenido.", 
    "price": "20.00", 
    "instructors": "Academy Nova Era", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/835522_c065_2.jpg", 
    "course_url": "https://www.udemy.com/novaerayoutube/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-29T17:55:23Z"
}