{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\"<strong class=\"redactor-inline-converted\">What do you do?</strong>\"  You're probably asked this all the time by friends, family members, strangers at cocktail parties, and prospective clients.  </p><p>What they're <em>really</em> asking you is: \"<strong class=\"redactor-inline-converted\">What value would I derive from hiring you?</strong>\"  Do you have a unique and compelling value proposition that defines who you are as a consultant and what your practice is all about?  If not, you've come to the right place.</p>\n\n<p>In this ~1-hour course, I'll share with you best practices for discovering and unlocking your value proposition.  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">1. Market Scanning</strong>: It starts with understanding the marketplace, so I'll share with you the techniques I use to scan the market, assess the implications, and make business decisions.  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">2. From Capabilities to Value</strong>: Then, we'll use that market intelligence to answer the question: \"What value do your clients derive from your capabilities?\"</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">3. Value Drivers</strong>: From there, we'll focus on your value drivers...the unique and compelling ways in which you drive value for your clients.  Once you've defined your capabilities, value, and drivers, you've essentially written your value proposition.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">4. Operationalizing Your Value Prop</strong>: From there, it's a matter of putting your value proposition to work, incorporating it not only into your pricing system but also your sales, marketing, and operations.</p>\n\n\n\n\n\n<p>To help you get going, you'll watch not only videos and mashups involving me and my best practices but also perspectives from other consultants in the form of <strong class=\"redactor-inline-converted\">interview excerpts</strong>.  When you buy the course, you'll also be able to download a companion <strong class=\"redactor-inline-converted\">workbook </strong>containing the slides and talking points from the course.</p>\n\n\n\n\n\n<p><strong>So if you're a business consultant and don't have a unique and compelling value proposition for your consulting practice, let's make it happen.  Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "Gauging Your Value", 
    "price": "20.00", 
    "instructors": "Dr. Gus Prestera", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858092_973d_2.jpg", 
    "course_url": "https://www.udemy.com/gauging-your-value/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T00:09:16Z"
}