{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>¿Porqué este video curso y cual es el objetivo?</p><p>Bueno, yo soy Chris, tengo una linda profesión y un título académico también y trabajo actualmente en el extranjero. Cuando la gente me pregunta a que me dedico, le contesto: arquitecto e importador también! Esto da mucho sorpresa a las personas que conozco, pero mas que nada me da un buen ingreso extra a pesar de que trabajo full time y estando en un país extranjero!</p><p>Este es un videocurso de &quot;Como lo he hecho &quot; no de &quot; Cómo me han dicho como se hace &quot;. Por esta razón es práctico, no teorético.</p><p>El objetivo de este videocurso es claro: acercarte un negocio que de inmediato te pone en condiciones de generar ingresos y porqué no (?) de posibilitarte la libertad financiera</p><p>Futuro Emprendedor,</p><p>Ante todo, te quiero felicitar por haber tomado la decisión de aprender sobre este fascinante negocio que es la Importacion de bienes. Uno con el cual no sólo las grandes empresas logran lucro pero también los pequeños emprendedores como tu. A diferencia de otros negocios, en este mercado no existe un monopolio de las multinacionales. Por lo tanto, cualquier persona o empresa puede aprovechar este mercado valorado en trillones de dólares por año. Por ejemplo, se estima que las importaciones a China en el año 2012 excedieron los 2.6 trillones de dólares. Lección: ¡Hay muchísimo dinero en esta industria!</p><p>Un Hecho: ¡Importar y Exportar Es Fácil!</p><p>Este curso esta estructurado en solo 3 Capitulos en las cuales te damos un panorama de como funciona esta industria y las posibilidades que esta generando para ti. Tambien te explicamos porque es tan interesante para ti de iniciarte ahora en esta actividad.</p><p><span></span>Todo negocio tiene sus dificultades, por eso esperamos aclarar algunas de tus inquietudes dándote consejos y advertencias de antemano. Por ejemplo, te podemos decir con confianza que la parte mas difícil del negocio de exportación y importación es conseguir productos con alta demanda. Algo que reconocemos, y que te ayudaremos a resolver con mayor facilidad al proveerte una lista que contiene los productos y mercados más cotizados. Además te acercaremos una herramienta que te permitirá entrar en contacto directo con los miles de fabricantes en todo el mundo y como generar una importacion directa.</p><p>Pero lo más interesante y llamativo de este comercio es que lo puedes hacer a través del internet. Es más, puedas comenzar a importar (y exportar) en horas con los conocimientos correctos. Y es precisamente esto lo que vamos a tratar de enseñarte en este videocurso integral. Te ayudaremos a entender cómo podes comprar y revender productos por internet de manera inteligente y generar rapidamente un ingresos extras ilimitados con una inversion casi nula!</p>", 
    "end_date": null, 
    "title": "Genere Ingresos inmediatos como Importador", 
    "price": "20.00", 
    "instructors": "Carsten Krüger", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/504618_8029_2.jpg", 
    "course_url": "https://www.udemy.com/genere-ingresos-inmediatos-como-importador/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-17T19:03:14Z"
}