{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Coaches and consultants frequently struggle to get coaching clients, sometimes for years even when they are great at helping their clients get super results quickly. Most spend the time &quot;telling their prospects about coaching&quot; rather than laying something in front of the prospect that he&#039;d nearly kill to get.</p><p style=\"\">Learn how to attract prospects to you, instead of continuing to do the chasing. </p><ul style=\"\"><li>Learn how to avoid the problems that almost guarantee you WON&#039;T attract, nor land this prospect.</li> <li>Develop the killer statement that excites prospects to almost begging you to help them.</li> <li>Build 8 Different Strategies to attract prospects in groups of 10 to 100 at a time</li> <li>Learn the psychology of how to not only attract prospects, but get them so excited they will almost fight to get your rare empty timeslot.</li> <li> Get my help to tune up your first pass at attracting prospects. </li></ul><p style=\"\"><strong style=\"\">Attracting Clients When You Want -- A Skill That FEW Coaches EVER Acquire</strong></p><p style=\"\">Learning the fundamentals of attracting and exciting prospects puts a powerful tool in your hands that few coaches ever acquire. Once you have learned the mistakes that almost all coaches make then you&#039;ll be shown what it takes to attract them to you. </p><p style=\"\">Even though it may seem that there aren&#039;t many prospective clients out there. There really are a lot that are already out there looking for the right person to help them. If you haven&#039;t been getting clients then it&#039;s likely that you were either looking in the wrong place, or not laying out what attracts that person already looking, or both. You&#039;ll learn how to start attracting the right ones the right way.</p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">Suitable for any coach or consultant that&#039;s either starting out, or not getting as many clients as he either wants, or needs to make $100K or more. This course of 30+ lectures and more than 4 hours of content, plus I&#039;ll be there to help you tune up your marketing to continually get higher and higher numbers of prospect responding to you as you apply it.</p><p style=\"\">You&#039;ll start by learning the basics of attracting prospects by giving you the rules of highly effective marketing, what not to do that most coaches are doing anyway, what to do that will help you stop doing the chasing and have the prospects chasing you, and a little known secret of which prospects won&#039;t buy no matter what, and who&#039;s already out there looking for exactly what you do.</p><p style=\"\">Then you&#039;ll develop a marketing message that will become the core attraction to you. You will be able to apply that right away. So you should see an immediate change in how effective you are. And that&#039;s in the first 3rd of the course.</p><p style=\"\">After you have that killer marketing message you will learn 8 different ways to use to attract 10&#039;s to 100&#039;s at a time, and even one that can expose you to thousands at a time. </p><ul style=\"\"><li>Local workshops -- Filling the Room to Overflowing, and a killer app to you working with most of them.</li> <li>Direct Mail -- How to Get About 20+% Appointment Setting</li> <li>Effective Local Live Networking</li> <li>Chamber and Tradeshow Walkarounds That Got Me Nearly 100% Appointments</li> <li>Speaking -- Filling Someone Else&#039;s Room</li> <li>Cold Calling Can Actully Be Fun and Easy, Almost No Hangups and is Fun and Easy</li> <li>Joint Ventures -- How to Get Others to Bring You Prospects</li> <li>Highly Effective Press Releases</li> <li>How to Get Lots of VALUABLE Referrals</li></ul><p style=\"\">That&#039;s only the beginning, working on your local marketing. I have a whole string of ways to attract clients online that will be added over the next month or so.</p><p style=\"\">You will develop your own notebook with the key guidelines and templates from each section for you to continually look back on to keep you on track, and where you&#039;ll put the homework as you develop the core marketing message, the local marketing. You will have templates that you can plug in your own marketing message and your own ideal client issues that can attract them.</p><p style=\"\">This is the first of two courses. This one is on attracting as many prospects as you want or need for a target income. The next to come will be on how to close many times more and higher paying than you are now.</p>", 
    "end_date": null, 
    "title": "Get Coaching Clients -- Attract More Coaching Clients to You", 
    "price": "20.00", 
    "instructors": "Alan Boyer", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409322_233e_5.jpg", 
    "course_url": "https://www.udemy.com/get-coaching-clients-attracting-them-get-them-begging/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T20:10:39Z"
}