{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn the strategies and tools that you will need to sell your tech or internet business to a Fortune 500 company</p>\n\n\n\n\n\n\n\n<p><strong>Learn how to form strategic partnerships with major companies that will benefit your business tremendously</strong></p>\n\n\n\n\n\n\n\n\n\n<ul>\n<li>Have a leg up to all other entrepreneurs who just hope that they’ll be bought sometime</li>\n<li>Know exactly how to get to the finish line  </li>\n<li>Learn how to incorporate an exit plan in your initial business plan </li>\n<li>Get a foot into the door at Fortune 500 companies by networking effectively </li>\n<li>Sell your company for the highest price </li>\n</ul>\n\n\n\n\n\n\n\n\n\n<p><strong>Understand how you’ll be evaluated when you walk into that boardroom</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Building relationships with Fortune 500 companies early on is essential to build credibility for your business. Imagine how many doors will open when you can say that you partner with Amazon, eBay or Google. </p>\n\n\n\n\n\n\n\n\n\n<p>Learn exactly how the CEOs, heads of Mergers and Acquisitions and heads of business development companies of Fortune 500 companies evaluate companies to buy, understand what it is that they are looking for. </p>\n\n\n\n\n\n\n\n\n\n<p>This course teaches you from my experience running the M&amp;A team at eBay for five years. I met with hundreds of entrepreneurs and invested over a billion dollars of capital. You’ll learn from real life examples and I’ll share exactly what I was looking for in companies and how I evaluated teams. </p>\n\n\n\n\n\n\n\n\n\n<p>To illustrate the principles of this course, we’ll look at different type of acquisitions and different ways that entrepreneurs were successful in selling their companies. I’ll also share specific case studies of companies that failed to be bought and explain what went wrong and what the mistakes were so that you can avoid these. </p>\n\n\n\n\n\n\n\n\n\n<p>These are all going to be pragmatic case studies, I’m not going to teach you any theory, nothing academic, this is a practical course, I teach the same that I would teach someone who I’d bring on my team at eBay.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Course content</strong></p>\n\n\n\n\n\n\n\n\n\n<p>I’ll start by teaching you everything you need to know before you’ve even started a company or if you have a small startup already.</p>\n\n\n\n\n\n\n\n\n\n<p>I’ll then explain why your leadership will determine the destiny of your company by studying top entrepreneurs who have sold their companies or raised billions of dollars - Elon Musk, former CEO of Paypal, Kunal Bahl, CEO of Snapdeal, the largest eCommerce marketplace in India, and Brian Chesky, CEO of Airbnb. </p>\n\n\n\n\n\n\n\n\n\n<p>Next I’ll dive into why companies get acquired. We’ll look at why eBay bought Paypal and why Google bought Youtube. We’ll look at the synergies and how you can find these for your company. </p>\n\n\n\n\n\n\n\n\n\n<p>I’ll also teach you how WhatsApp managed to get bought by Facebook for $19B and what that can teach you about getting the most money for your company, stuff that you won’t find in any finance books. </p>\n\n\n\n\n\n\n\n\n\n<p>Finally, I’ll tell you exactly what not to do, how not to pitch your company and the most common mistakes I see entrepreneurs make.  We’ll look at why acquisitions fail, what can we learn from eBay’s unfortunate foray into telephony with Skype and eBay’s almost purchase of…well that’s a secret but I can still share the pitfalls with you.</p>", 
    "end_date": null, 
    "title": "Get Acquired: Learn From The Head Of Acquistions For eBay", 
    "price": "40.00", 
    "instructors": "Ian Bednowitz", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814068_0714_3.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-buy-and-sell-your-startup-or-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T01:56:25Z"
}