{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Save Time, Be More Productive &amp; Grow Your Business While Working Less</strong></p><ul><li>Do you have too much to do and not enough time to get it all done? </li><li>Are you stressed, burnt out, and overwhelmed by your ever-growing to-do list? </li><li>Does your business run itself, or do YOU work for your business?</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you're an entrepreneur, self-employed professional, or small business owner, then (like most people), you probably got into business for yourself to enjoy more time and freedom, only to quickly find yourself with more tasks on your plate and less time to pursue the life that matters most to you. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>If that sounds familiar, I know exactly how you feel because I was there too! But I'm here to tell you that you don't have to keep spinning your wheels because there's a solution! And it's called delegating!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is designed to help busy people who want to achieve more while working less, free up their time and energy by learning to master the skill of outsourcing and delegating to high-quality virtual assistants and skilled freelancers on just about any budget.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Discover the Power of Delegation &amp; Learn How to:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Eliminate low-value, low-priority tasks that waste your time</li><li>Tap into the brain-power of other people to get more accomplished in less time</li><li>Communicate clearly to avoid confusion and maximize efficiency</li><li>Grow your business and create new opportunities for yourself and others</li><li>Reduce stress and improve your overall experience and quality of life\n</li><li>Gain more energy to focus on what you love and what you do best</li><li>Maximize your overall freedom and happiness in life</li></ul>\n\n\n\n\n\n\n\n\n\n<p>By learning to master the skill of outsourcing and delegating to a virtual assistant, not only will you save countless, priceless hours, but you can also save tens of thousands of dollars when compared to hiring an in-house employee.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>However, if don't learn how to delegate successfully, then you'll get stuck trying to manage your life and business all by yourself, and you'll limit your own ability to grow and achieve the next level of success.</p>\n\n\n\n\n\n\n\n\n\n<p>Which is why, by the end of this course, not only will you know how to find and hire a virtual assistant, but <strong class=\"redactor-inline-converted\">you'll have all the tools, methods, and strategies you need to outsource and delegate effectively</strong>, including:</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Over 4 hours of training broken down into bite-sized lessons</li><li>58 short videos that allow you to watch in order or skip around</li><li>7 key mindsets and concepts harnessed by highly-successful delegators</li><li>Comparisons between the 3 types of virtual assistants versus in-house employees</li><li>8 of the most common time-consuming tasks to begin delegating right away</li><li>Over 50 example tasks that a virtual assistant can help you with</li><li>5 unique exercises to help you determine which tasks you need to delegate most</li><li>27 questions you can ask to help you delegate more effectively</li><li>A sample job posting template to help find your first virtual assistant</li><li>A simple yet powerful email subject line formula to use when delegating</li><li>A secure method for handling private, confidential information online</li><li>A proven method for training your assistant and sharing recurring tasks</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Your </strong><strong class=\"redactor-inline-converted\">Time Is More Valuable Than Money, Spend It Wisely!</strong></p>\n\n\n\n\n\n<p>This course is your time-saving roadmap to a more productive life to help you rewire the way you approach delegating so you can improve your life, grow your business, and have more time and energy for the things that matter most in your life!</p>\n\n\n\n\n\n<p>Whether you're just looking for help crossing items off your to-do list, or if you want to start, grow, and outsource your business to an affordable team of skilled, virtual workers then this course is for you!<br></p>\n\n\n\n\n\n<p>And you don't need a huge team to be more productive. You’ll learn how even one additional person on your team can double or even triple your productivity and profits.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Always Here to Support You Along the Way</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you ever have any questions or need any clarifications as you go through this course, feel free to reach out, and<strong class=\"redactor-inline-converted\"> I</strong><strong class=\"redactor-inline-converted\"> will personally respond to any questions you might have </strong>- I'm always happy to help!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Now, if you’re ready to start working less and earning more while growing your business, simply scroll up and click the button that says <strong class=\"redactor-inline-converted\">\"Take This Course\"</strong> to get started right now.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Sign up now and learn how to begin delegating to a virtual assistant and implement these proven tactics to help grow your business, improve your life, and save your time so you have more freedom and energy to enjoy the things that you love most in your life.</p>\n\n<p>Cheers to your success!<br><em>- Josiah Jones</em></p>", 
    "end_date": null, 
    "title": "Get Virtual Assistance: How to Delegate & Grow Your Business", 
    "price": "25.00", 
    "instructors": "Josiah Jones", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629242_9bf4_3.jpg", 
    "course_url": "https://www.udemy.com/get-virtual-assistance/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T23:23:50Z"
}