{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">NEWLY UPDATED AND NEW TO UDEMY!</strong>  </p>  <p style=\"\">  \t <strong style=\"\">BONUS: </strong>Get 60 days email support if you enroll before July 31 and receive professional feedback as you create your campaign. This 60 days email support package usually sell for $1295.... but it&#039;s your&#039;s FREE for this limited time only. Enroll now!  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\"><br style=\"\">  \t </em></strong>  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">&quot;This is something to celebrate! I learned more in this course than I did at an Ivy League Business School -  Thank you!&quot;</em></strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t      Rosaria Landona, Economist and Operations Specialist, Washington D.C.  </p>  <p style=\"\">  \t <strong style=\"\">GET YOUR CROWDFUNDING SUPERPOWERS ON</strong> - <u style=\"\">How to Create A Brilliant Crowdfunding Campaign That Gets Fully Funded.</u> This is the first, best, and only course that takes you by the hand and walks you through <strong style=\"\">everything you need to know - and do - to create a brilliant crowdfunding campaign and a brilliant campaign marketing plan too! (Did you know that crowdfunding campaigns with a day-to-day marketing plan get 180% more funding?)</strong>  </p>  <p style=\"\">  \t               Crowdfunding courses, even good ones, typically give you ideas and general information or advice for creating a campaign. Books and blogs do the same. This course is different. It sets a whole new standard.  </p>  <p style=\"\">  \t <strong style=\"\">         When you finish this course, if you do the coursework, you will be 100% ready to launch your crowdfunding campaign on whatever crowdfunding platform you decide</strong>.<strong style=\"\"> This means you&#039;ll be ready to launch your campaign and execute the campaign marketing plan you customize as a part of this course. On top of that, your entire soft-launch will already be in full swing, building an interested audience of targeted funders!</strong>  </p>  <p style=\"\">  \t               This amazing course is “linear” and it takes you step-by-step, at your pace, through every part of creating and executing a truly brilliant crowdfunding campaign. You don’t just learn what to do…you learn how to do it <strong style=\"\">AND you DO IT as you go through the course!</strong>  </p>  <p style=\"\">  \t               As you can see by the curriculum below, this is seriously comprehensive and covers every phase and activity included in creating and executing a crowdfunding campaign. This curriculum is based on the highly successful Brilliant Marketing Methodology, a step-by-step program that has helped thousands of successful companies across the globe learn how to best market their products and services...and it&#039;s been customized to help you market your idea to crowdfunders.  </p>  <p style=\"\">  \t               There are over 30 videos and  hands-on exercises, examples, and fantastic supporting materials…all relevant and focused to help you understand and develop those things that will make your campaign a stand-out, funded one!  </p>  <p style=\"\">  \t             Your instructor for this course is Kimberlee Hayward, the original author and developer of the Brilliant Marketing Methodology. She presents the information you <strong style=\"\">really </strong>need to know and does so in a way that keeps you engaged, excited, and motivated to get your campaign created, launched, and funded! The video lessons are short and sweet (well, most of them anyway); they tell you what you need to do and then send you off with hands-on exercises for creating your campaign. You&#039;ll learn the tools you need to use to find funders and those to get your campaign ready and rolling; there&#039;s also a host of templates you can use to connect with influencers and other potential funders along the way.  </p>  <p style=\"\">  \t             Kimberlee has worked in marketing and training for over 20 years, authored numerous published articles and Amazon e-books (some using a ghost name). She has trained thousands of small businesses to market successfully. She has also taught many businesses, organizations, and students how to create their own websites.  </p>  <p style=\"\">  \t        She has a B.S. in Natural Health, magna cum laude. She is certified by the Direct Marketing Association and has consulted with many Fortune 100 and 500 companies as well as with thousands of start-ups and &quot;mom and pop&quot; shops. Her &quot;one true thing&quot; is guiding others to achieve their dreams; that certainly explains her dedication to helping you get your crowdfunding campaign funded! :D  </p>  <p style=\"\">  \t              .  </p>", 
    "end_date": null, 
    "title": "Get Your Crowdfunding Superpowers On!", 
    "price": "20.00", 
    "instructors": "Kimberlee Hayward", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140620_8a1c_28.jpg", 
    "course_url": "https://www.udemy.com/exactly-how-to-create-a-brilliant-campaign-that-gets-funded/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-02T03:03:51Z"
}