{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>‘Getting Started’ – on becoming a social entrepreneur and setting up your own business</strong> is the perfect course by i-genius giving you preparative knowledge and confidence to create your business.  </p>  <p>  \t    Two modules comprising a total of six lectures will take you on a thought provoking and practical learning journey from developing ideas to business planning and setting up your enterprise, covering all the essential areas to make your business a success.  </p>  <p>  \t    The course gives you valuable and honest insight into setting up your social business and helping you turn your idea into a reality. Step-by-step, the course takes you through each stage covering strategic planning, setting up the organisation, financial affairs, selecting people, equipment, premises and goal setting plus performance indicators to ensure you are making sustained progress over a one, two, and five year period. This online course is suitable for:  </p>  <ul>  \t<li>Social entrepreneurs developing a new or existing early stage business</li>  \t<li>Businesses or NGO leaders seeking to reshape their organisation</li>  \t<li>Individuals who wish to explore a new career in social entrepreneurship</li>  \t<li>Students seeking to complement their studies</li>  </ul>  <p>  \t<br>  \t<strong></strong>  </p>  <p>  \t<strong>Module 1:</strong> <strong>Developing top-level business ideas</strong>  </p>  <p>  \t    This module covers the initial stage of getting started focusing especially on clarifying what you hope to achieve over a given time frame.  </p>  <p>  \t<strong>Lecture 1</strong> covers setting out broad aims and scoping key elements over a short to longer time frame  </p>  <p>  \t<strong>Lecture 2 </strong>assesses specific goals and determining the business model along with clarifying milestones and performance indicators followed by course work.  </p>  <p>  \t<br>  \t<strong></strong>  </p>  <p>  \t<strong>Module 2:</strong> Setting up the organisation  </p>  <p>  \t    Explores the detailed aspects of setting up a business.  </p>  <p>  \t<strong>Lecture 1</strong> perhaps the most technical part of the course, looks at the options available in establishing the legal entity, particularly the advantages and disadvantages of choosing a commercial or not-for-profit legal entity.  </p>  <p>  \t<strong>Lecture 2</strong> looks at choosing the right team, covering the wide range of people you may need to consider from types of employees, business partners, suppliers and stakeholders. The module looks at examining characteristics to consider and certain regulatory aspects.  </p>  <p>  \t<strong>Lecture 3</strong> covers the setting up of the various physical assets you will need in getting started and how to protect certain items.  </p>  <p>  \t<strong>Lecture 4</strong> examines important aspects of legal, finance and security. It covers regulatory requirements and optional considerations as well as financial management. It concludes with the course work for the module.  </p>  <p>  \t<br>  \t<strong></strong>  </p>  <p>  \t<strong>Each participant will benefit from:</strong>  </p>  <ul>  \t<li>A      solid understanding of social entrepreneurship and businesses that provide      high social or environmental impact</li>  \t<li>Participation      in a series of exercises to further enhance and shape your business idea</li>  \t<li>A Certificate      of Completion and membership of the i-genius Academy Alumni</li>  </ul>  <p>  \t <strong>About i-genius Academy</strong><br>  \t    i-genius Academy is the business school of <em>i-genius</em> (a world community of social entrepreneurs with members in over 200 countries). It provides education and training on social entrepreneurship and designs tailor-made courses and lecturers for organisations. i-genius Academy is a leading training partner for the British Council and the international strategic partner for the Business in the Community ‘arc’ Centre for social entrepreneurs.It is recommended by BBC World Challenge for global social enterprise.  </p>  <p>  \t <strong>Course fee:</strong> $60 (20% discount for i-genius members i.e. $48) includes taxes.  </p>", 
    "end_date": null, 
    "title": "Getting Started - Social Business Start Up", 
    "price": "25.00", 
    "instructors": "Tommy Hutchinson", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/166342_1ecc_2.jpg", 
    "course_url": "https://www.udemy.com/getting-started-social-business-start-up/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-18T09:13:33Z"
}