{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em style=\"\">Interact with more than 900 students in the quest to understand whether ghostwriting is your kind of dream work. </em></p><p>  \t    One of the most urgently needed online services is ghostwriting. it&#039;s a great way to carve out your own niche and offer a much needed service. Whether you want to write blogs or romance novels or technical articles or speeches or - well the list is endless, there are people who need ghostwriters all the time.<br style=\"\">  </p>  <p>  \t    Wondering where to start your ghostwriting career? Let me guide you through the basic things you should do to get started.  </p>  <p>  \t  This course starts at the very beginning with the basics you need to know before taking the big leap into ghostwriting.<br style=\"\">  </p>  <p>  \t      You will be shown the inside world of ghostwriting. For people who like to write and are interested in making a good living working from home, ghostwriting is an ideal career. The big question is - where do you find clients?  </p>  <p>  \t      The next big question is - how much should you charge?  </p>  <p>  \t          One of the most valuable lessons about ghostwriting is that you can choose your niche and become a highly sought after service provider.  </p>  <p>  \t          You will learn how to to deal with difficult clients and how to meet deadlines.  </p>", 
    "end_date": null, 
    "title": "Ghostwrite - Live the Writer's Life with a Guaranteed Income", 
    "price": "20.00", 
    "instructors": "Joanne Reid", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364836_e9ff_2.jpg", 
    "course_url": "https://www.udemy.com/ghostwrite-live-the-writers-life-with-a-guaranteed-income/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-06T21:11:02Z"
}