{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\"></strong><strong style=\"\">Live Local, Work Global.</strong></p><p>Girls Gone Global is an entrepreneurship course created by women, for women. In this course you will learn the fundamental processes of growing a global audience and identifying foreign business opportunities. We&#039;ll provide you tools, resources, and information to help you change your perspective and get you to start thinking globally, even while living locally.</p><p>A learn-at-your-own-pace format, you should be able to comfortably complete this course in four to six weeks.</p><p>Much of the content you&#039;ll find out there is a reiteration of the same - basically how to put together a business plan. That&#039;s all well and good, but we know women like you, so we constructed a course specifically for women who already have a business (we&#039;ll be creating a more introductory course, and more advanced course in the near future!), and face some common gender-specific challenges like:</p><ul style=\"\"><li>Little to no funding to start the business</li><li>Lack of capital to grow/expand</li><li>Stuck in a geography that won&#039;t allow your business to grow</li><li>Lack of human resources to facilitate growth</li><li>No formal training on how to identify global business opportunities</li><li>Doing all this while raising children</li><li>Lack of access to daycare or babysitters</li><li>...the list goes on</li></ul>Many of the women in our pilot courses came from the same place - intelligent, driven, and strong women who have the chops to pursue business, but don&#039;t have the support necessary to grow. One course can&#039;t possibly solve each of these issues for you, but Girls Gone Global will present you new ways of thinking, new models for growing your business, and encouragement to push past the barriers holding you back from success.<p>To keep you engaged and present information in the most easily digested and understood method possible, resources will be included in each of the weekly discussions via this platform that include: PowerPoint templates, videos, downloadable documents, and podcasts (coming soon!).</p><p><strong style=\"\">The Girls Gone Global women&#039;s entrepreneurship course will cover:</strong></p><ul style=\"\"><li>Vision and Mission Statements - how they differ, and how to write them effectively</li><li>Business Assessment &amp; Growth Strategies - better understand your current limitations and identify larger opportunities</li><li>Target Markets &amp; Market Research - who is your ideal customer? What/when/how are they likely to buy? Due diligence and research should always precede growth or expansion into foreign markets.</li><li>Strategy - learn how to define your playing field, and how to create a plan to win. A 30,000-foot view isn&#039;t good enough; get specific to truly make a difference.</li><li>Business Structure &amp; Finance - understand different business formations and financing/fund raising options</li><li>Brand Identity &amp; Global Markets - Your brand, products and services may represent one thing in the U.S., but does your brand messaging translate internationally? Identify common cultural, language, and pricing barriers in overseas commerce.</li><li>Online Platforms &amp; Affiliate Marketing - to truly reap the benefits of global commerce, you&#039;ll need a complete international digital marketing plan to grow and strengthen your online presence.</li><li>Pitch presentations - public speaking is one of the most common fears in the entire world. The only way to improve that is to practice it. Learn how to create a pitch deck, craft your elevator pitch, and deliver an awesome presentation to funders!</li></ul>", 
    "end_date": null, 
    "title": "Girls Gone Global™ | Take Your Business MicroGlobal™ | 1/3", 
    "price": "20.00", 
    "instructors": "Leah Goold-haws, Angela Cordell", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587894_0fe8_3.jpg", 
    "course_url": "https://www.udemy.com/girls-gone-global-course-1/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T22:25:42Z"
}