{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      This course is a<strong> HANDS-ON workshop. </strong>Starting from basic idea generation/creativity hacks, it takes you though entire journey of developing and launching products in a professional way.</p><p>You will be able to:</p><ol><li>Get more<strong> creative ideas</strong> on your online or offline ventures esp. E- Commerce</li><li><strong>Evaluate</strong> the right ideas and increase your v<strong>enture success rate</strong></li><li>Understand what your customer <strong>Really </strong>needs</li><li>Learn <strong>proven steps</strong> to convert Idea into <strong>Cool Product</strong> and sell to first 100 customers</li><li>Learn to create an integrated <strong>GO TO MARKET</strong> plan and get customer proofs for free</li><li>Make your idea/product <strong>attractive</strong> to your investors or board members</li><li><strong>100+ ways </strong>to innovate and generate creative business ideas</li></ol><p><strong>Just imagine if you can get fresh ideas on any new product or for improving existing ones in less than </strong><strong>15 minutes</strong><strong>. Not only that, imagine if you are able to shape your </strong><strong>idea into a sellable product </strong><strong>in just </strong><strong>9 simple steps</strong><strong>. Research says that more than 95% of the business or product ideas end up only on papers and never take off.</strong></p>  <p>  \t      If you are also planning to start up with single or multiple ideas but unable to decide which one to pursue, this course is for you. Just imagine, what it would cost you in terms of time, effort and money if you select a wrong idea but later uncover the feasibility challenges or business potential limitations<strong>.</strong>  </p>  <p>  \t<strong>Over </strong><strong>2000 students </strong><strong>have benefited from this course taught in classroom in various business schools and seminars</strong>  </p>  <p>  \t      This course shares my knowledge and experiential learnings with you in a simple and step wise way. You will learn an actionable framework '<strong>getSMART</strong>' to increase chances of success of your innovation exercise. Also, have designed a framework '<strong>InCUBATER</strong>' to help you evaluate any idea in a holistic and unbiased manner. This framework is work of my interactions with various entrepreneurs and product managers. I assure you that you will not need any other tool if you learn to use this framework properly.  </p>  <p>  \t      In this course, you will see how a simple service like \"Loyalty\" card for an apparel brand can be transformed into an innovative and unique product through getSMART framework.  </p>  <p>  \t      You will learn how leading companies in technology, software, fmcg etc. generate ideas through a structured methodology. Irrespective of your job whether you are Product Manager, Marketing Manager, Services Manager, R&amp;D professional, Artist or Student, you encounter situations that require ideation to create new stuff or improve the existing things.  </p>  <p>  \t      Starting with an overview on getSMART framework and brief on main source for ideas, the course takes you through <strong>9 popular and useful methods to “Generate Ideas</strong>\". A complete unit is dedicated to each unit. At the end of each unit, you will be able to take any object around you, apply this method and improve it.  </p>  <p>  \t<strong>What will you learn?</strong>  </p>  <ol><li><strong>getSMART</strong> framework to convert your idea into a sellable product</li><li>9 Types of Innovation Situations</li><li>9 Methods for Idea Generation</li><li><strong>InCUBATER</strong> framework to evaluate ideas</li><li>Idea to Product conversion steps</li><li>Idea and Product Validation Methods and Online Tools (available for free)</li><li>4D model for Idea or Product Presentation design</li><li>Online resources with more than 100 advanced ideation techniques.</li></ol>  \t                      <p>  \t      This course will serve as a <strong>reference toolkit </strong>that you can refer to at any stage of your career whenever you need to generate fresh ideas or solve problems.  </p>  <p>  \t  I am positive you will benefit from this course and learn new framework and methodologies around ideation. Go ahead, Think creatively, Get great ideas and Launch cool products.</p>", 
    "end_date": null, 
    "title": "Go from IDEA to PRODUCT in a Single Day - YES SINGLE DAY", 
    "price": "20.00", 
    "instructors": "Pragmatic Learning Solutions", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409254_67f7_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-convert-idea-to-sellable-product-in-9-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T18:54:53Z"
}