{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em>(Updated October 5 2015)</em>  </p>  <p>Make MONEY(lots of it!)  with your Tarot business online.  </p>  <p>  \t                                         Learn ALL the techniques for a <strong>PROFITABLE</strong>, <strong>PRINCIPLED</strong> and <strong>PORTABLE</strong> business.  </p>  <p>  \t                                         Do what you LOVE and love what you do everyday.  </p>  <p>  \t                                         Having a Tarot business online can be a lucrative income source while you transform lives doing what you love! This amazing course is specially created for all the aspiring and current Tarot business website owners out there who want to be a spiritual and financial success  </p>  <hr>  <p>  \t                                                                           The course is designed and taught by a Certified Professional Tarot Reader who has been in business for over 15 years online, earning a six-figure income while teaching Tarot to people across the globe and giving tarot consultations. </p>  <hr>  <p>  \t                                                              This course is normally a 1:1 course for <strong>$1497 </strong>and the regular online course price is<strong> $299.</strong> Now you will learn the tips, strategies and skills to be a spiritual business success at a fraction of the cost.  </p>  <hr>  <em>JOIN NOW</em> and start boosting your Tarot income.  <hr>  <p>  \t                                                       Now included: Free <strong>PERSONAL BRANDING</strong> session with the course creator. When you've finished 100% of the course, send an email to tarot@healinguniverse.com to schedule YOUR  PERSONAL BRANDING SESSION                   </p>", 
    "end_date": null, 
    "title": "Grow Your Tarot Business", 
    "price": "50.00", 
    "instructors": "Barrett Clemmensen Powell", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305322_4606_6.jpg", 
    "course_url": "https://www.udemy.com/grow-your-tarot-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-22T11:13:18Z"
}