{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">What If you could spend all your time with...</strong></p><p><strong style=\"\">Good Fit – High Value Clients? - The kind of clients that are easy to work with, recognize your skills and respect your opinion as an expert.</strong></p><p>What would your bottom line look like a year from now?</p><p><strong style=\"\">As entrepreneurs and small business owners, when we think about growing our business with good fit – high profit clients there are some challenges we face almost immediately…</strong></p><p><em style=\"\">Entrepreneurs are spending too much time giving your expertise away for free…</em></p><p><em style=\"\">Entrepreneurs get too many “think it over&#039;s&quot; and spend too much time chasing people.</em></p><p><em style=\"\">Entrepreneurs sometimes Struggle with getting people to take action.</em></p><p><em style=\"\">________________________________________________________________________</em></p><p><strong style=\"\">As an entrepreneur, If you&#039;re constantly faced with pressures to reduce price and not sure what to do about it…</strong></p><p><strong style=\"\">Many entrepreneurs have too many of their proposals result in wanting to “check the competition&quot; before deciding…</strong></p><p>GROW – How to Attract Good Fit – High Profit Clients, will give you the inside edge.</p><p>You can start learning the proven methods, step by step to increasing your business.</p><p>Grow your business, increase sales, and expand your network by mastering these step by step skills - specifically designed for entrepreneurs and small business owners.</p><p><strong style=\"\">Master the secret business hack that allows you to bring more value to the conversation, grow your small business and become more than just the average entrepreneur.</strong></p><p><strong style=\"\">________________________________________________________________________</strong></p><p><strong style=\"\">In this one-on-one business coaching session, dedicated to helping entrepreneurs build their business, close more sales and make more money, we will cover...</strong></p><p>Understand what it takes as entrepreneurs to be identified as the key resource.</p><p><strong style=\"\">Good fit clients all have the same 3 traits. </strong></p><p><strong style=\"\"></strong><strong style=\"\">Learning how to discover these 3 traits quickly and efficiently will be a determining factor in how quickly you can grow as entrepreneurs and ultimately how successful your small business will be.</strong></p><p>Achieve your entrepreneurship dreams with this course. If you are a lean start-up, developing a business plan, or launching your venture. this is the essential guide to finding and working with the types of clients that will make you more money... - faster!</p>", 
    "end_date": null, 
    "title": "Grow Sales ", 
    "price": "35.00", 
    "instructors": "Bob Marx", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/500336_50dc.jpg", 
    "course_url": "https://www.udemy.com/grow-entrepreneur-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T19:37:17Z"
}