{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t              Este curso es una <strong style=\"\">guía paso a paso </strong>de como <strong style=\"\">desarrollar una idea</strong> para convertirla en un producto que te <strong style=\"\">genere ingresos.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">¿Cómo es esto?</strong>  </p>  <p style=\"\">  \t              Todos tenemos el potencial y la capacidad de crear, de hacer cosas maravillosas, pero si no sabemos de marketing, de las herramientas de venta online (digital), pues se nos hace difícil emprender y generar ingresos con cualquier idea.  </p>  <p style=\"\">  \t<strong style=\"\">¿Qué haremos a través de este curso?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Crear nuestra propia idea de negocio que nos genere ingresos residualmente (ciclicamente) a través de Internet.</li>  \t<li style=\"\">Promocionar nuestra Idea convertida en producto a través de las redes sociales.</li>  \t<li style=\"\">Convertirte en un usuario profesional (de negocios) de las redes sociales, facebook, twitter, linkedin, foursquare...</li>  \t<li style=\"\">Crear una página web sin la necesidad de códigos de programación.</li>  \t<li style=\"\">Cómo hacer un Brainstorm (lluvia de ideas) exitoso, con herramientas profesionales.</li>  \t<li style=\"\">Aprender a como leer las analíticas digitales en tu página web (que crearás aquí).</li>  \t<li style=\"\">Optimizar mis visitas y convertirlos en ventas de mi producto.</li>  \t<li style=\"\">Cómo crear mails masivos y formularios de suscripción en nuestra página web.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">          Al finalizar el curso</strong> obtendrás un <strong style=\"\">certificado de Brain Marketing Online </strong>y el conocimiento para<strong style=\"\"> emprender tu idea</strong> en Internet y generar ingresos.  </p>", 
    "end_date": null, 
    "title": "Guía completa: Desarrolla tu IDEA y Genera Ingresos!", 
    "price": "45.00", 
    "instructors": "Ezequiel De la Cruz", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310298_00ee_5.jpg", 
    "course_url": "https://www.udemy.com/brainmarketingonline/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-29T20:36:27Z"
}