{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tAs you presumably already know, getting organic traffic to your mobile application is <em style=\"\">hard</em>.  </p>  <p>  \t   I know. I was the largest independent application developer on Facebook with over 200 million non-unique users.... but I still struggled initially with my mobile applications.  </p>  <p>  \t   But slowly, I learned. One of the first big lessons was the importance of the app store. Simply put, it is the biggest source of free traffic you are going to get for your mobile application.  </p>  <p>  \t   In this course, I share some of the strategies you can use to maximize the amount of app store traffic you receive. Here is a small sampling of what you can expect to learn in this class:  </p>  <ul style=\"\">  \t<li>The difference between Google Play and the iOS App Store - both stores vary <em style=\"\">dramatically</em> in the way they rank applications and I will show you how.<br style=\"\">  \t </li>  \t<li>The exact metrics you need to hit to get your application to the Top 25 Free apps on both the Google Play and iOS App Store.</li>  \t<li>My favorite hacks to get consistently high application ratings.</li>  \t<li>My favorite mobile growth hack called &quot;horizontal distribution&quot; that I successfully used in the past to get over 50k app store downloads in days. I show you how anyone including a company like Udemy can use this to dramatically increase their mobile traffic.</li>  </ul>  <p>  \t   I would hate to oversell and under deliver so if you take the class, watch all the lectures and do not feel like you have your moneys worth, I will gladly refund 100% of the price of the class. No questions asked.  </p>", 
    "end_date": null, 
    "title": "Hacking App Store Growth : Get More Mobile App Downloads", 
    "price": "35.00", 
    "instructors": "Ankur Nagpal, Conrad Wadowski", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/71822_3b95_5.jpg", 
    "course_url": "https://www.udemy.com/hacking-app-store-growth-get-more-mobile-app-downloads/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-30T21:14:47Z"
}