{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Welcome to <strong style=\"\">Helping Local Businesses Succeed: Make Money As a Consultant </strong>course which is one of our new series of <strong style=\"\">Kick-Starter Courses</strong> created to help you grow your business or help you make a great income from home.</p><p style=\"\"><strong style=\"\">Learn How To how to make money by offering services </strong><strong style=\"\">to local businesses and stand out from the crowd without having to really compete.</strong></p><p style=\"\"><em style=\"\">Who else wants to know... How To Make Money Helping Local Businesses Succeed?</em></p><p style=\"\"><em style=\"\"></em>You can make a fantastic income helping small and local businesses either offline or online and this course we are going to show you some fantastic proven strategies to help you do that. </p><p style=\"\">We are going to show you how to find clients and more importantly clients who don't take up all your time and money. We are going to show you how you can compete with the bug boys to get business and how to pinpoint opportunities. </p><p style=\"\"><strong style=\"\">You will learn how to make money offering services to local businesses either online or off.</strong></p><p style=\"\">If you're looking to improve your lifestyle, if you want to improve your business, if you want to make a better life for your family, <em style=\"\"><strong style=\"\">this course is definitely for you</strong>.</em></p><p style=\"\">Simply listen to the secrets of how ordinary people became successful in this exciting fact filled course.</p><p style=\"\">No shortcuts, no \"get rich quick\" scams, no nonsense.</p><p style=\"\">Just simple, proven steps to wealth and success, easily, quickly and simply.</p><p style=\"\"><em style=\"\">Give yourself a fresh start by enrolling in this life-changing course now.</em></p><p style=\"\"><em style=\"\">Every moment you delay, you lose out. Simple as that.</em></p><p style=\"\">We will be adding lots more new and up-to-date modules to this course as time goes by, new modules, new techniques, new strategies <strong style=\"\">AND</strong> the <strong style=\"\">good news</strong> is, all the ongoing updates to this course are <strong style=\"\">FREE</strong>, always, for ever. So whatever you pay for this course <strong style=\"\">TODAY</strong>, you won't pay a penny more for all the great value we will add over time.</p><p style=\"\"><em style=\"\"><strong style=\"\">And there's a 30 day absolutely no questions asked full money back guarantee - my personal promise of your happiness and satisfaction! You really have nothing to lose and everything to Gain!</strong></em></p><p style=\"\"><em style=\"\"><strong style=\"\">Make sure you check out our other Kick-Starter courses and special student bonuses and discounts once you get started with this course.</strong></em></p>", 
    "end_date": null, 
    "title": "Helping Local Businesses Succeed as a Consultant", 
    "price": "20.00", 
    "instructors": "The Covert Formula", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557042_5e02.jpg", 
    "course_url": "https://www.udemy.com/helping-local-businesses-succeed-work-as-a-consultant/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T09:32:19Z"
}