{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Very engaging! Easy to absorb!</strong></p><p><em><strong>Boomy is such a great teacher. Very easy to understand and lots of things seem to be much simpler that I originally thought! On my way ....taking actions! I have been a starter for so many years. Now it's time to become a finisher! </strong></em><em><strong>I hope others will feel the same too! Kudos :) - Elena (Student)</strong></em></p><p><strong><span>New Update For 2015 - Join Over 1400 Students</span></strong></p><p><strong>Teri Gault </strong>has been featured in Wall Street Journal, Good Morning America, Inside Edition, Time, Redbook and many other channels and publications. Just before the year 2000 Teri and her husband were broke and unemployed form their creative careers.</p><p>Taking on many menial jobs and not knowing where to turn she reverted to her childhood activity of cutting out coupons to feed the family. As she saved money and shared her experience with friends they began to ask her for too! Things began to snowball and she felt their might be an income opportunity and a chance to help others.</p><p>So In February 2000 she registered the <strong><em>Grocery Game (food coupon saving website) </em></strong>with all she had left - $60. Plus she had to overcome her techno-phobia and build the business' first website.. Today she is the CEO of the acclaimed website the Grocery Game that has become a multi million dollar business! </p><p><strong>What is the course about:</strong></p><p>In this course we will be <strong><em>learning profound insights</em></strong> that we can all apply to our business ideas to help us achieve our own dreams too. Plus I will be sharing practical tactics that makes what Teri has accomplished a possibility for anyone willing to take action.</p><p><strong>How long will it take to complete:</strong></p><p>The whole course is <strong><em>about 2 hours </em></strong>but rather then simply rush to completion I would like you to consider applying what you are learning to your own business!</p><p><strong>How is the course structured:</strong></p><p>In simple terms a share a <strong><em>principle/lesson from Teri with practical solutions </em></strong>which also includes my own reflections. You will be able to take action from every lecture you hear because each aspect of the material is actionable.  </p><p><strong>Why take this course:</strong></p><p>Sometimes we have the opinion that many success business owners are just born that way and that others may not have what it takes. In this course you will learn from Teri that many of the experiences she had are similar to what most people have to endure in life and that if she can make it - <strong><em>anyone can make it too.</em></strong> </p><p><strong><em>Take Action - Click Take This Course Now! Get Life Time Access plus 30 Day Money Back Guarantee!</em></strong></p>", 
    "end_date": null, 
    "title": "Home-Based Business Startup Tips for All Levels", 
    "price": "20.00", 
    "instructors": "Boomy Tokan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427638_e682_3.jpg", 
    "course_url": "https://www.udemy.com/startup-teri-gault-went-from-60-to-10m-a-year-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T12:10:25Z"
}