{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                        You are going to learn how to create a gig on Fiverr and then how to deliver the gig. Inside is a walk-through video where you can watch over my should how I am setting up a gig live on Fiverr.  </p>  <p>  \t<strong>==================================================================</strong>  </p>  <p>  \t<strong><span style=\"color: #ff0000;\"><strong><em>ON SALE TODAY. REGULAR PRICE $299 - NOW ONLY $199.</em><em> Enroll today!</em></strong></span></strong>  </p>  <p>  \t<strong>==================================================================</strong>  </p>  <p>Here is a recent 5-star review, by Edward Sweeney, 1 month ago:<span>·</span> </p><p><strong>I give this course a High Fiverr! What an amazing course!</strong></p><p>\"The instructor is very knowledgeable and professional. After 24 hours of completing this course I made my first two sales on Fiverr. Before this course I had not sold one gig on Fiverr and within a day after completed this course and using what I learned I had two gigs sold. Don't wait on making money on Fiverr. Purchase this course today and you can get through all the lectures in one day and start making money tomorrow. This is an excellent course on Fiverr.\"</p><p>==================================================================<br></p><p>  \t                                        You are also going to learn how to get images for your gigs for free.  </p>  <p>  \t                                        You are also going to learn what you can offer as a gig. Several gigs are analyzed and you learn how you can offer and deliver these gigs. No special talent is needed and not need to buy any additional tools or software.  </p>  <p>  \t                                        All you need is a computer with an internet connection.  </p>  <p>  \t<strong>=================================================</strong>  </p>  <p>  \t<strong><span style=\"color: #0000ff;\">I have a bonus lecture. The Title is: \"How to Get Free Leads Using Fiverr\".</span></strong>  </p>  <p>  \t<strong>This lecture is especially interesting if you want to sell high priced products or services.</strong>  </p>  <p>  \t<strong>Anyhow, I will give to students who take the course. Ideally you finish the course 100% but even if you get at least started and listen to a few lectures please me a PM and you'll get it. </strong>  </p>  <p>  \t<strong>=========================================</strong>  </p>  <p>  \t<strong>Here are recent 5-star reviews:</strong>  </p>  <ul>  \t<li>  \t  \t\t      by Harsh, 2 days ago  \t  \t  \t\t      Fantastic Course!!  \t  \t  \t\t      Many fiverr courses do not explain how to deliver the gigs. They just describe what to post as gigs. Highly Recommended! :) Thanks again  \t  \t</li>  \t<li>  \t  \t\t  \t  \t  \t\t      by Marty Raaymakers, 1 min ago  \t  \t  \t\t      Good, Quick Course Ideas to Get Established on Fiverr  \t  \t  \t\t      It's a good beginning course on how to get started on Fiverr. what gigs are easy to start and do, how to make it so people want to read the Fiverr Gigs that one puts up.  \t  \t</li>  \t<li>  \t  \t\t  \t  \t  \t\t      by Dr. Bette Daoust, 7 days ago  \t  \t  \t\t      Making Money is Easy with Fiverr  \t  \t  \t\t      Although I was aware of Fiverr, I had never thought it would be so easy to start making money right away. This course provides you with examples and ideas that you can use right away and bring money in at the same time. If you want to start on your journey with Fiverr then this course is where you need to start.  \t  \t</li>  </ul>  <p>  \t<strong><br>  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Home Business: How to Start Your Own Business Using Fiverr", 
    "price": "25.00", 
    "instructors": "Dipl.-Ing. Hans Peter Jeschke", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/422314_632c_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-business-and-make-money-online-using-fiverr/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-15T04:54:19Z"
}