{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Have you ever struggled to write an ebook?<br style=\"\">  \t    Do you have a hard time getting started, or finishing?<br style=\"\">  \t    If you’ve ever had the desire to write an ebook that you can sell, then you’ll want to keep reading:<br style=\"\">  \t<strong style=\"\"><br style=\"\">  \t    This course will show you:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">The real secret to content mapping - Almost everyone gets this wrong!</li>  \t<li style=\"\">My three step process for creating a plan for your content</li>  \t<li style=\"\"> How to plan out a high quality ebook in less than a day.</li>  \t<li style=\"\">How to write it in 10 days or less. </li>  \t<li style=\"\">How to easily create even more content for blogging and article marketing.</li>  \t<li style=\"\">How to also create mid and high ticket programs</li>  \t<li style=\"\">Where to find tech tools to get it done easily. </li>  \t<li style=\"\">Two methods for creating great audio home study courses</li>  </ul>  <p>  \t<br style=\"\">  \t    Would having your own line of products change your life? What would it be like if you had an entire product funnel that sells higher and higher ticket items?<br style=\"\">  \t<br style=\"\">  \t    Maybe you just want to write ebooks. That’s fine. With my system, you can write 3 ebooks in a month. How different will your life be in 3 months? 6?  </p>  <p>  \t    Look, I tried lots of methods and really struggled for a long time. I made a lot of mistakes and learned valuable lessons. Now I can share the secrets of product creation with you!  </p>  <p>  \t  What&#039;s inside:  </p>  <p>  \t  I created a video lecture series in which I walk you, step by step, through the process of picking a niche to creating an ebook that you can be proud of. I then go beyond that to show you all the options for creating more products that have even higher perceived value. <br style=\"\">  </p>  <p>  \tI’ll see you on the inside, Richard  </p>", 
    "end_date": null, 
    "title": "How To Write A Nonfiction Ebook", 
    "price": 0, 
    "instructors": "Richard Winser", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419826_a28c_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-a-100-page-nonfiction-ebook/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T02:40:37Z"
}