{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Financing the creation and/or expansion of a business is a daunting and confusing prospect for many entrepreneurs. Most of the specialised press gives such a large focus on venture capital that many entrepreneurs don't even know about alternative ways to fund their dreams, let alone which one is the most efficient for their situation. Unlike what most people think, Venture Capital is the most expensive money in the world and loans are the cheapest (cheaper than your own savings), so when to choose what and why?  </p>  <p>  \t  This course aims to help entrepreneurs explore all the possible sources of capital available and discuss which one is best for each situation.  </p>  <p>  \t<strong style=\"\">  7 Ways to raise money for your business  </strong>  </p>  <ul style=\"\">  \t<li style=\"\">Comprehensive list of all sources where you can get capital for your business</li>  \t<li style=\"\">Discussion on advantages and disadvantages of each source</li>  \t<li style=\"\">Examples of companies that used alternative sources</li>  \t<li style=\"\">Bonus method</li>  </ul>  <p>  \t<strong style=\"\">  Contents and Overview  </strong>  </p>  <p>  \t  This course contains over 10 lectures and over 30 minutes of content. It's designed for entrepreneurs and business men, regardless of experience level, who wishes to know alternative sources they can use to finance their business.  </p>  <p>  \t  By the end of this course you will be able to identify what is the best source of capital for your specific situation. With these lessons, you'll find that you're able to consider alternatives routes to your objectives and have multiple options on how to execute those objectives.  </p>", 
    "end_date": null, 
    "title": "How To Navigate And Understand Venture Capital", 
    "price": "20.00", 
    "instructors": "Pedro Santos", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/112746_06bc_7.jpg", 
    "course_url": "https://www.udemy.com/7-ways-to-raise-money-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-30T13:01:14Z"
}