{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><strong></strong><em></em></strong><em> <strong>JOIN 8,400+ STUDENTS LEARNING HOW TO MAKE A LIVING WITHOUT A JOB (NOT EVEN PART TIME).</strong><em></em></em></p>\n\n<p><em><em>LATEST: Course Fully Updated For June 2016</em></em></p>\n\n\n\n<p>I've been making a full time living without a job (not even a part time job), since I started to put in place what actually works.</p>\n\n\n\n<p>What I've done has really paid off and the things I've done that have worked are all outlined here in this course.</p>\n\n\n\n<p><strong>I now average $4,000 every month</strong> in income per month (without a job of any sort).</p>\n\n\n\n<p>And that's <strong>not just one unique month</strong>! That's <strong>every month</strong>, month after month after month. It's on autopilot now!</p>\n\n\n\n<p>In May 2014, before I started following this course, I was completely dependent on my full time job (which I was enjoying less and less). By taking the steps outlined in this course, I've fully broken my dependence on jobs and <strong>I now make a full time income without a job.</strong></p>\n\n\n\n<p>I know this system works and all my earnings are shown in the free preview below. You can see a screenshot of my PayPal transactions, showing all my income numbers.</p>\n\n\n\n<p>Every single technique which I reveal in this course is <strong>easy to put into place</strong> and I show you how in detail.</p>\n\n\n\n<p>I'm holding nothing back in this course - I reveal everything I know. I plan to continue to add things to this course as I experiment with things and learn if they work or not. This course will grow and accumulate more content as I learn more, which will all be <strong>at no extra charge to you</strong>!</p>\n\n\n\n<p>Keep in mind that you're protected by Udemy's 30 day, 100% money-back guarantee!</p>\n\n\n\n<p><strong>Every minute you wait is costing you money with your online business!</strong></p>\n\n\n\n<p><strong>Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "How I Make A Living Without A Job (Not Even Part Time)", 
    "price": "20.00", 
    "instructors": "Kraig Mathias", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541594_52b2_5.jpg", 
    "course_url": "https://www.udemy.com/how-i-make-a-living-without-a-job/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T20:21:55Z"
}