{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Welcome to the course!</strong> <em>How to Start a Security Company in Texas</em> will walk you through the entire process, from beginning to end, of starting your own security company in the state of Texas. This is the best, most detailed and easiest to follow course available.</p>    <p>This course is for:</p>  <ul><li>Security Industry professionals looking to capitalize on their experience and do something new</li><li>Professional security officers of body guards who are tired of working for other companies that care more about their bottom line than the customer or employee </li><li>Members of the armed forces, military, police or other law enforcement as well as veterans who want to apply their professional training to the civilian sector and enter the world of private security</li><li>Entrepreneurs or business minded professionals who want to capitalize on a growing industry</li></ul>          <p>This course will take the mystery and confusion out of a seemingly daunting process of starting and properly registering a security company in the state of Texas. Security companies are required by law to be registered with the state and meet numerous state-mandated requirements and regulations. </p>    <p><em>How to Start a Security Company in Texas</em> has simplified the process. The course is broken down into easy-to-follow steps that explain exactly what you need to do at “this” point in time. Each step presents a video that shows you exactly what website to go to, what to click on, and demonstrates what and how to fill out each form along the way. </p>    <p>In addition, this course includes a free, downloadable PDF of the entire course and all the supplemental information and forms you will need to successfully complete the entire process as quickly as possible! All supplemental material is free and downloadable any time.</p>    <p>Not only is this the most complete, thorough and easiest to follow course on this subject, but course instructor Mark Milas is personally available to assist you along the way should you encounter and difficulty with the process or have any questions.</p>    <p>It is our sincere hope that you will find this course to be useful and helpful to your journey of starting your own security company!</p>", 
    "end_date": null, 
    "title": "How To Start a Security Company in Texas", 
    "price": "20.00", 
    "instructors": "Mark Milas", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660568_0aad_3.jpg", 
    "course_url": "https://www.udemy.com/texassecurity/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T00:19:28Z"
}