{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t This course sets the essential foundation for those thinking of taking an idea to market as well as those with an early stage or existing product seeking for guidance on how to make it successfully adopted in market. It is geared to any type of idea, whether social impact in nature or otherwise, software, mobile app or services and consumer products. <br style=\"\">  \t <br style=\"\">  \t The course is separated into four sections:<br style=\"\">  \t <br style=\"\">  \t 1. Overview of the Process - This section provides an overview the Rapid Product Validation approach to help turn ideas into reality at a fraction of the cost, risk and loss of sanity.  </p>  <p style=\"\">  \t 2. Establishing Core Value &amp; Impact - This section allows participants to jump right in and start working on their own idea, while following a very methodical approach.<br style=\"\">  \t <br style=\"\">  \t 3. Establishing Core Capabilities - This section guides participants as they seek to define the essential and RIGHT Core Capabilities that will ensure their product or service is successfully adopted in market.  </p>  <p style=\"\">  \t <br style=\"\">  \t 4. Defining Business &amp; Adoption Models - This section guides participants as they assess current market solutions, their strengths and weaknesses, then provides a step by step approach to define the right Business &amp; Adoptions models to ensure success.<br style=\"\">  \t <br style=\"\">  \t This course is Part-One of a Two-Part series which provides a comprehensive and methodical guide for successfully turning ideas into winning products and services.  </p>", 
    "end_date": null, 
    "title": "How To Turn Your Idea Into a Winning Product or Service", 
    "price": "20.00", 
    "instructors": "Simon Brightman, Dr. Cindy Gordon, Accelerator U", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65311_6d26_15.jpg", 
    "course_url": "https://www.udemy.com/creating-a-winning-product-or-service-everytime/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-13T18:56:42Z"
}