{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><p>Ever wanted to start your own business but confused about where to\r\nstart? <strong>Are you trying to learn how to\r\nrun a successful business?</strong> Are you a small business owner who is looking to\r\ntake your business to the next level with proven marketing ideas, which cost\r\nnothing, to try out and are risk free?</p>\r\n<p><strong>Not knowing how to run a\r\nsuccessful business can hurt you. </strong>The truth is that over 90% of businesses\r\nfail in the first 5 years. They fail due to cash flow issues and they have no\r\ncash because they have too few clients and orders. The remaining 5% of\r\nbusinesses fail in the next 5 years because the owner is literally exhausted,\r\nthey either don&#039;t know how to delegate or do it the wrong way (the clue is the\r\nword &#039;systems&#039;).</p>\r\n<p>Million Dollar Company is designed for start-ups or small business\r\nowners <strong>who want to run a successful\r\nbusiness</strong> which works whether they are there or not. A business they could\r\neither sell in the future or have other people run for them. I have applied all\r\nthe principles in this course to build three companies, one of which I sold in\r\n2008 to a friend and when he bought it, the entire business was running on\r\nauto-pilot for him (and still is)!</p>\r\n<p>This course will teach you everything you need to know to grow a\r\nsuccessful business, which generates a predictable monthly income but bothers you,\r\nas little as possible.</p>\r\n<p>Have Fun.</p>\r\n<p>Paul Browning</p>&lt;/p&gt;\r\n", 
    "end_date": null, 
    "title": "How to Build a Million Dollar Company from Scratch", 
    "price": "45.00", 
    "instructors": "Paul Browning", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/11982_6a13_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-million-dollar-company-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-12-21T01:08:00Z"
}