{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t                                                            This course is <strong style=\"\">perfect for</strong> forward thinking entrepreneurs and <strong style=\"\">virtually anyone</strong> who wants to <strong style=\"\">learn and master</strong> the skills necessary to produce podcast interviews that attract and keep listeners.  </p>  <p style=\"\">  \t                          If you&#039;re an entrepreneur trying to <strong style=\"\">build your online presence</strong> or a seasoned professional looking to polish your current podcasting product, Jeff delivers.  </p>  <p style=\"\">  \t        What others say about Jeff&#039;s course:  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">&quot;Easy to follow and learn...very straight forward...</em><em style=\"\">I highly recommend this cours</em>e.&quot; -</strong> Tom Carty  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">&quot;Jeff knows his stuff.&quot; </em></strong>- Thrandur Arnthorsson  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">&quot;... fresh, remarkably concise, and a pack full of tips.&quot;</em></strong>  - April Alunsina Pagaling  </p>  <p style=\"\">  \t      It&#039;s been said that you only have one shot to make a first impression.  <strong style=\"\">If your interviews don&#039;t stand out and engage your audience</strong>, all the work you put into drawing loyal listeners found backfire.  With thousands of podcasts available if they aren&#039;t convinced yours is worth listening to, <strong style=\"\">they will tune out and never return.</strong>  Enroll now, grab your audience and crush your competition.  </p>  <p style=\"\">  \t                          The <strong style=\"\">lectures are created </strong>with the goal of passing on 30 plus years of interviewing tips, skills and shortcuts guaranteed <strong style=\"\">to set you apart from your podcasting competitors.</strong>  </p>  <p style=\"\">  \t                  When it comes to learning how to do over the top interviews, <strong style=\"\">Jeff cuts your learning curve saving you time and the embarrassment of producing a less than professional product.</strong>  </p>  <p style=\"\">  \t                                           This course is divided into 4 segments and 13 lessons to systematically take you step by step from understanding the different types of podcasts and interviews to the nuts and bolts of fine-tuning your interviewing skills.  </p>  <p style=\"\">  \t                                        Jeff has geared his material for <strong style=\"\">everyone from the beginning podcaster, to seasoned podcasters </strong>who&#039;ve yet to master interviewing skills or are looking to take their interviewing skills and techniques to a new level of excellence.  </p>  <p style=\"\">  \t                                          When you&#039;ve completed the course, you&#039;ll have learned:  </p>  <p style=\"\">  \t                                        - What questions to ask yourself before you decide on a format for your podcast.  </p>  <p style=\"\">  \t                                        - How to formulate questions that draw insightful responses from your guests.  </p>  <p style=\"\">  \t                                        - What to listen for during your interview that amateur and novice hosts seldom take advantage of.  </p>  <p style=\"\">  \t                                        - The one interviewing technique most podcasters never use that can be a game changer.  </p>  <p style=\"\">  \t                                        - Production techniques to keep an audience tuned in from start to finish and a real life example of what that sounds like.  </p>  <p style=\"\">  \t                                        - Your own personal check list to properly prepare for every interview.  </p>  <p style=\"\">  \t                                        - PLUS - The wisdom of 30 + years of interviewing skills and insider tips and techniques.  </p>  <p style=\"\">  \t                                                            Jeff has been interviewing newsmakers, celebrities and every day people from news environments to his role as host of a daily radio talk show, video story producer and live seminar facilitator.  During the course of his career Jeff has interviewed everyone from a sitting Vice President of the United States to Hollywood stars, Corporate Executives, authors and more.  </p>  <p style=\"\">  \t            Jeff&#039;s course comes with a 30 day money back guarantee.  If you&#039;re not completely satisfied, we&#039;ll return your invest.  </p>  <p style=\"\">  \t                    Don&#039;t make the mistake of putting hours of work into interviews that you won&#039;t be satisfied with.  <strong style=\"\">Make the commitment to do it right</strong> and deliver a product you can be proud of, builds your audience and drives traffic to your product, service or idea.  </p>", 
    "end_date": null, 
    "title": "How to Conduct Podcast Interviews That Crush The Competition", 
    "price": "25.00", 
    "instructors": "Jeff Whitaker", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/246502_9bc0_9.jpg", 
    "course_url": "https://www.udemy.com/podcast-interviews-that-crush-your-competition/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-19T12:32:05Z"
}