{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you ever wanted to start a business, be your own boss and become financially free? The desire is there, your motivation is huge, but something is holding you back. You simply have no money...<br><br>However, is money really necessary to start a business? <br><br>The reality is very counter intuitive.  The times when you needed a huge capital to start a company are long gone. We are blessed to live in the 21st century and the truth is that there are thousands of potential businesses that don't require you to have the cash bulging out of your pockets. The key is to adopt the right mindset, think outside the box and come up with a better strategy. This is precisely what we will teach you in this course. <br><br>“You don’t need the money, you need a better strategy”  - you will hear this phrase many times in our videos and we will share with you real business case studies that prove how true this statement is. Starting a business without money is possible. We’ve done it multiple times and so can you.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Let us take you on a journey that will totally shift your mindset. You are about to destroy the limiting beliefs that have been holding you back and learn strategies that will enable you to become your own boss.<br><br>Peter Sage is a celebrity entrepreneur, author and public speaker who has built over 20 businesses (e.g. Energy Fitness Group) and shared the stage with the likes of Richard Branson and Bill Clinton.<br></p>\n\n<p><br>Jimmy Naraine is an online entrepreneur and teacher who builds educational content for his 41,000+ students while traveling full time (50+ countries).</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>BONUS videos in June 2016!</strong> <br>The first set of BONUS videos will be about different ways to set up an online, location independent business and creating passive income streams. <br><br></p>", 
    "end_date": null, 
    "title": "How To Start a Business With No Money, Borrowing or Credit", 
    "price": "30.00", 
    "instructors": "Peter Sage, Jimmy Naraine", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/805704_3785.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-business-with-no-money-borrowing-or-credit/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-27T23:28:14Z"
}