{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Start making extra money by starting a business while working your regular day job. Sometimes we are just sitting on an idea, don’t know where to start, or may not believe we have the time for it; which is why I created this course. This course is designed to teach you the essential steps that are required to start a business.</p>\n\n<p><strong>Learn to build a business with this comprehensive beginners guide</strong> </p>\n\n<ul><li>Learn to identify market opportunities </li><li>Collect accurate and effective research </li><li>Use a 30 second pitch to speak confidently  about your business </li><li>Design a Minimum Viable Product (prototype) </li><li>Evaluate your life and skills</li><li>Determine your risk tolerance </li><li>Find a mentor </li><li>Design a sales strategy </li><li>And much more… </li></ul>\n\n<p><strong>The time to start a business is now!</strong> </p>\n\n<p>Never before has starting a business been easier. Previously starting a business was a capital intensive process that only a select few could ever dream of doing. However since the advent of the internet and the popularization of startups, starting a business is becoming more commonplace.</p>\n\n<p>In today's world there are more resources for you to rely on, more money going to small business growth, and more community support. Therefore it is time to take advantage of the favorable business creation climate to earn yourself some extra money. </p>\n\n<p><strong>Course Overview</strong> </p>\n\n<p>This course’s 27 Lectures are split into 3 distinct sections. We start off learning about how to sculpt your ideas into a real business. Learn to identify market opportunity and see who actually wants what you are offering. It is important that you learn how to ask for good feedback and be able to interpret the data well once you receive it. While we figure out who wants it, we also learn to evaluate our competition ensure that we not only create a business but a competitive one.</p>\n\n<p>We then move into a self evaluation. Some of the world's greatest entrepreneurs preach the benefits of knowing about yourself to better run your business. Therefore, you will be able to identify your skills and risk tolerance. Starting a business is a great opportunity, but you have to be able to recognize how much money, time, or other resources you can risk. </p>\n\n<p>Finally we move into the final phase of the course where you will learn how to take your MVP (prototype) and turn it into a fully functioning legal business. You will see how to ask for mentor to help you through this phase with 2 example emails. Furthermore, you will get a broad overview of how to design a sales plan and pick a business entity. </p>\n\n<p><strong><em>There is no time like the present to get started. I look forward to helping you reach your goals!</em> </strong></p>", 
    "end_date": null, 
    "title": "How to Start a Business Without Quitting Your Day Job", 
    "price": "20.00", 
    "instructors": "Andrew Abraham", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/748468_a2cf_2.jpg", 
    "course_url": "https://www.udemy.com/startabusiness/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T03:22:31Z"
}