{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Creating an online social network is not as hard as you might think. </p>\n\n<p>If you have ever used Slack in your team workplace, then you may know just how easy it is to create a social network from scratch with this tool. Slack is a great way to build a social network for your website, company, school, product, project, or any niche community. </p>\n\n\n\n\n\n\n\n\n\n<p>Slack is a team communication tool that allows teams to build their company workflow. Users can send messages, make connections with other users, create channels, integrate third party applications, and even communicate with customers.</p>\n\n\n\n\n\n\n\n\n\n<p>In this course you will learn how to to setup and configure Slack, how to manage and customize integrations, and customize the usage of your Slack group based on your product, customer service, or business.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Who is this course for?</strong></p>\n\n\n\n<p>I designed this course for marketers and startups who struggle to find new channels to promote their product. This is also for non-technical people who want to learn the ropes in building a viable community. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">How is the course structured?</strong></p>\n\n\n\n<p>The course is designed in two sections. The first section is getting your Slack community made. The second is teaching you on-boarding and marketing for your community.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What have people said about this course?</strong></p>\n\n\n\n<p>\"Nick is highly focused and is the type of person who puts in the time and effort when teaching. His attention to detail led to a great course.\" - <em class=\"redactor-inline-converted\">Chris Le, Apple Engineer</em></p>\n\n\n\n<p>\"I never knew you could Slack into a viable business. I learned how to make passive income for my existing business. Thanks Nick.\" - Andrew<em> Philips, Mobile Director at TCS</em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Next Steps</strong></p>\n\n\n\n\n\n<p>Now it's time to become a Techustler and join me in registering for the course. I can’t wait to have you on board.  </p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "How to Build a Social Network Without Coding", 
    "price": 0, 
    "instructors": "Nicholas \"Techustler\" Ivanecky", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/862888_0425_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-social-network-without-coding/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-29T14:39:11Z"
}