{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><strong></strong><em></em></strong><em> <strong>JOIN 8,000+ STUDENTS LEARNING HOW TO CREATE A $7,500 PER MONTH ONLINE STORE (WITHOUT GOOGLE OR FACEBOOK ADS)</strong><em></em></em></p>\n\n<p><em><em>LATEST: Course Fully Updated For June 2016</em></em></p>\n\n\n\n<p>I've been selling $7,500+ per month from my online store each month without Google or Facebook ads, since I started to put in place what actually works.</p>\n\n\n\n<p>What I've done has really paid off and the things I've done that have worked are all outlined here in this course.</p>\n\n\n\n<p><strong>I now average $7,500 every month</strong> in sales from my store (without paying for Google or Facebook ads).</p>\n\n\n\n<p>And that's <strong>not just one unique month</strong>! That's <strong>every month</strong>, month after month after month. It's on autopilot now!</p>\n\n\n\n<p>In May 2014, before I started following this course, I sold little to nothing online (and I was spending hundreds of dollars on Facebook ads). By taking the steps outlined in this course, that's now increased, month-by-month, to <strong>over $8,000 in March 2015</strong>.</p>\n\n\n\n<p>I know this system works and all my earnings are shown in the free preview below. You can see a screenshot of my reports page, showing all my sales numbers.</p>\n\n\n\n<p>Every single technique which I reveal in this course is <strong>easy to put into place</strong> and I show you how in detail.</p>\n\n\n\n<p>I'm holding nothing back in this course - I reveal everything I know. I plan to continue to add things to this course as I experiment with things and learn if they work or not. This course will grow and accumulate more content as I learn more, which will all be <strong>at no extra charge to you</strong>!</p>\n\n\n\n<p>Keep in mind that you're protected by Udemy's 30 day, 100% money-back guarantee!</p>\n\n\n\n<p><strong>Every minute you wait is costing you money with your online store!</strong></p>\n\n\n\n<p><strong>Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "How I Built An Online Store Without Google or Facebook Ads", 
    "price": "45.00", 
    "instructors": "Kraig Mathias", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507574_2a00_2.jpg", 
    "course_url": "https://www.udemy.com/how-i-sell-7500-month-online-without-google-or-facebook-ads/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T22:31:58Z"
}