{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>How did a small one-man business go from earning $3278 a month online to well over $<em><u>45,000 a month?</u></em></strong></p>  <p><strong><em><u></u></em></strong></p>  <p><strong>… <em>And</em>, most importantly, how can you achieve the same results in <em><u>your</u></em> business?</strong></p>  <p><strong></strong></p>  <p><strong>These are the questions you’ll find the answers to in <em>The 80/20 Entrepreneur</em>.</strong></p>  <p><strong></strong></p>  <p>If you’re an entrepreneur, there is one surefire way to boost your income:</p>    <p><em>Become more productive.</em></p>  <p><em></em></p>  <p>If you’ve noticed revenue stagnating in your online business, you might be tempted to try to boost it by…</p>    <ul><li>Working more hours.</li><li>Learning new skills (re-training).</li><li>Accepting more projects.</li></ul>        <p>The problem with these strategies is that they all involve <em>trading time for money</em> in one form or another. You might get an initial boost in income by working longer, but you can bet those results will taper off after a while. “Burning the midnight oil” can also have nasty health consequences for an entrepreneur, such as sleep deprivation and stress.</p>    <p>The <em>real</em> key to increasing your income is to <em>become more productive</em>. By boosting productivity you get the best of both worlds: you make <em>more</em> money while working <em>less </em>hours.</p>    <p>That’s what you are going to discover inside <em>The 80/20 Entrepreneur</em>. A 3-hour course consisting of 31 short lectures jam-packed with growth hacking principles from lean startups, delegation tips for Upwork &amp; Fiverr, cutting edge online marketing strategies that <em>really</em> gain leverage, and productivity hacks that go way beyond traditional time management, <em>The 80/20 Rule for Business </em>will revolutionize the way you work.</p>    <p>If you’ve <em>ever</em> thought that the only way to make money is to trade it for time…</p>    <p>If you’ve ever felt that your income has <em>capped</em> and will never grow again…</p>    <p>If you’ve ever made the mistake of sinking too much time into projects that generate little revenue…</p>    <p>… <em>The 80/20 Rule</em> can change your life. By bringing the timeless principles of economics to your workflow, you can dramatically improve your productivity, your sales, and ultimately, your net income.</p><p>=====================================================================================</p><p>Your purchase of <em>The 80/20 Entrepreneur</em> is fully backed up by Udemy's ironclad 100% money back guarantee, so you have nothing to lose. Click the \"Take This Course\" button on the top right of the screen and start learning (and earning) now! </p><p>You are free to test drive the course for up to 30 days with no strings attached. If you decide it's just not working out? No problem. Simply contact Udemy support and you'll get 100% of your money back.</p><p>This is also a personal promise to you that you'll be blown away by what you'll learn in the next 3 hours. If you don't get a massive return on your investment in this course, I don't want your money and you can return the course, no questions asked.</p><p>=====================================================================================</p>", 
    "end_date": null, 
    "title": "How to Apply the 80/20 Rule to Grow Your Online Business", 
    "price": "20.00", 
    "instructors": "Michael Battle", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647104_1bfe_7.jpg", 
    "course_url": "https://www.udemy.com/8020-business-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T18:58:35Z"
}