{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Who Else Wants to Have a Regular Passive Income Being Automatically Deposited Into Their Account Month After Month?</strong></p><p style=\"\"><strong style=\"\"></strong></p><p style=\"\">Digital Information Products Are the Best Way to Have a Passive Income Rolling In Everyday of the Month!</p><p style=\"\"></p><p style=\"\">My name is Charity Cason, and I&#039;ve been creating and selling digital info products for many years now. This course is all about finding a great topic, creating and laying out your content, finding the best delivery methods, using the best sales platforms, creating your marketing funnels and promoting your course for maximum sales.</p><p style=\"\"></p><p style=\"\">If you want to create something ONCE and watch it sell for years to come, information marketing is a great option for you!</p><p style=\"\"></p><p style=\"\">You <strong style=\"\">do not</strong> need to be an expert.</p><p style=\"\">You <strong style=\"\">do not</strong> need to know every intricate software program on the market.</p><p style=\"\">You <strong style=\"\">do not</strong> need a huge mailing list.</p><p style=\"\"></p><p style=\"\"><em style=\"\">Literally ANYONE can become an information marketer practically overnight!</em></p><p style=\"\"></p><p style=\"\">With some simple to use methods, I can help you:</p><p style=\"\"></p><p style=\"\"><strong style=\"\">+ Find the perfect topic that will sell loads of copies</strong></p><p style=\"\"><strong style=\"\">+ Figure out the hot points that your target market wants to know about</strong></p><p style=\"\"><strong style=\"\">+ Discover the best way to teach your target market</strong></p><p style=\"\"><strong style=\"\">+ The tools you need for every kind of info product imaginable</strong></p><p style=\"\"><strong style=\"\">+ The fastest way to come up with content - you&#039;re going to love this!</strong></p><p style=\"\"></p><p style=\"\">And tons more... PLUS our private discussion area where you can ask questions anytime!</p><p style=\"\"></p><p style=\"\">So, click on the JOIN THIS COURSE button and let&#039;s start building your passive income empire. :)</p><p style=\"\"></p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "How to Write and Market An Online Course", 
    "price": "20.00", 
    "instructors": "Charity  Cason", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520790_5746_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-sell-online-info-products-quickly-and-easily/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T21:51:22Z"
}