{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Getting Started in the Ice Cream Truck Business</p><p style=\"\">When I first got the idea in my head that I wanted to run an ice cream truck I had no idea what the process was. There wasn&#039;t much information online so I had to figure it all out myself. Everyone I told about my plan laughed at me or engaged me in a mock debate designed to emphasis how foolish I was.</p><p style=\"\">The fact is that you are an entrepreneur and most of your friends and family and people in general aren&#039;t so, whatever advice they give you will be colored by their natural tendency to avoid taking risks and doing anything out of the ordinary.</p><p style=\"\">I made this guide for budding entrepreneurs like yourself. This guide will save you a bunch of time and get you up and running and making money as fast as possible.</p><p style=\"\">You need to decide where to sell your ice cream</p><p style=\"\">You will need a permit for each town so you don&#039;t want to pick more than a few. I ended up getting 3 permits but only ever used one of them; the other two towns were just not as profitable and I would have wasted a lot of time traveling to them.</p><p style=\"\">There is even more paperwork involved, including registering your business with your town, getting a state peddlers license, as well as a town peddlers license. Then you need to get a health inspection and sometimes a vehicle inspection by your town police.</p><p style=\"\">You need a truck</p><p style=\"\">Or a van. Used or New. Or maybe you could rent one. You will need to insure your ice cream truck before you can register it at the DMV.</p><p style=\"\">You will need a freezer</p><p style=\"\">Will you use a cold plate freezer? Do you even know what that is? I didn&#039;t. What stickers and decals will you use? You will need to decide how you will paint your ice cream truck and give it an overall theme.</p><p style=\"\">You will need your products</p><p style=\"\">Not just ice cream, but candy, snacks, and drinks. You need napkins and spoons and hand sanitizer and towels and other cleaning supplies. You need to figure out where to get each item the cheapest and what to sell based off of the profit margin for each. And how will you price everything?</p><p style=\"\">You will need to decide on location</p><p style=\"\">Once everything is set up how do you decide where to go and when? Which places will get you the most bang for your buck? How do you expand your business, and how do you know when to? How do the best guys make so much money?</p><p style=\"\">Get started now</p>", 
    "end_date": null, 
    "title": "How to Start an Ice Cream Truck Business", 
    "price": "20.00", 
    "instructors": "Tim's Ice Cream Truck", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531714_e103_2.jpg", 
    "course_url": "https://www.udemy.com/ice-cream-truck-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T22:48:21Z"
}