{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong>If you are thinking to start your own online business I'm sure you will find this course extremely helpful.</strong></p><p>My name is Miguel Hernandez, for the last 5 years I've been making a living exclusively from the Internet.</p><p>In 2010 I started an online animation studio called Grumo Media and have been very fortunate to work with hundreds of clients world wide, including big Fortune 500 companies like Microsoft and Walmart, to even hollywood stars like Ashton Kutcher.</p><p>I also make money by selling courses online like this one through my sites and on platforms like Udemy where I have now over 15,000 students.</p><p>I've learned so much in these years by talking to other successful online business owners, by reading countless books and articles, by continuously building systems to optimize my online businesses and of course by making lots of mistakes along the way.</p><p>I really enjoy teaching online and find extremely rewarding when I hear from students that have learned valuable skills through my courses.</p><p>I have courses on animation, website development, course creation, and even online dating.</p><p>Now I've settled on creating a very comprehensive course to help people create and run a successful small businesses online.</p><p>Any business, whether online or offline is made of a large number of moving parts that need to work well together for the business to grow, be profitable and last.</p><p>For a first time business owner, even to someone with experience, learning how to build and orchestrate all these parts can be truly overwhelming.</p><p>In this course <strong>I want to help you learn about all those parts and build systems around them to simplify and in some cases even automate a lot of the tasks required to keep them all working nicely together.</strong></p><p>The good thing is that all businesses have many parts in common. All businesses need a product or service that provides value to a specific audience. They all need a way to attract customers through marketing, to convert prospects into buyers through sales, to hire talent, to keep their finances in order through accounting, and they all need systems to manage all these parts, to track metrics, traffic, leads, sales, conversions, followers, to manage communications, etc.</p><p><strong>My goal in this course is to provide you with a solid understanding of how to run your own online business by sharing all the tricks, tools, and advice I've collected over the years</strong>.</p><p>If you are already running an online business I think you will love to have an insight into the systems I've developed, get some ideas, and apply them to help your own business.</p><p>I don't intend to be one of those \"gurus\" that promise \"secrets\" to making easy money online.</p><p>It pains me to see how many people claim to be able to provide these fool-proof one-button turn key systems that for only $49 a month they will provide you with the life style of a rockstar.</p><p><strong>This course is a down to earth account of what it takes to run a small online business.</strong> Let me tell you right now, making money online in a honest way it's not easy and it takes a lot of work and patience.</p><p>It surely beats many 9-5 boring corporate jobs and if you are lucky and work hard and smart you'll be able to both quit your dreaded job and work from home or anywhere in the world (with Internet) like I've been doing for so many years.</p><p>There are many types of businesses you can create online. I'm sure anyone running any kind of online business will find parts of this course valuable. However, in this course I'm going to concentrate on the type of business I have experience with which is mainly a service type business with some products on the side.</p><p>Grumo Media is an online digital media agency. We specialize in producing promotional videos or explainer videos for companies of all sizes. Our videos cost an average of $10K and in some cases we've produced videos as costly as $50K.</p><p>I believe this course will be very useful for anyone getting started today with zero revenues to online businesses generating up to 1 million dollars a year in revenue. (I'm focusing on that revenue bracket because the structure of most businesses change quite a bit after revenues are over a million a year. A 1MM+ business needs to hire people dedicated to each department, rent a space, maybe have a legal team. It gets more complex and it stops being a life style business to become a bigger corporation with all the headaches that entails.)</p><p><strong>I've really enjoyed building a business that supports me and my family and provides me with the necessary income and free time to enjoy a balanced and happy life style. I want to give you an in depth look a what a business like that looks from the inside.</strong></p><p>This course is not for you (although you may still enjoy watching it like someone that watches Netflix for fun)</p><p>if your goal is to raise tons of money, build a startup with the goal to exit and sell the company in 5 years. This course is like a blueprint of a fun small bootstrapped life style business that will be able to support a medium size family anywhere in the world. </p><p>If that sounds like you then I'd love to have you on board for this journey.</p><p><strong>You will learn about marketing, sales, client relations, hiring, accounting, social media, business systems, contracts, and much much more.</strong></p><p><strong>If you are a freelancer, a consultant, a speaker, or even a mom stuck at home, this will be like going to business school from the comfort of your home, like getting an MBA on how to have fun and make a comfortable living online doing what you love.</strong></p><p>It won't be easy but I think you will enjoy the learning experience regardless of how successful you are.</p><p>I remember when the Internet started to become popular around 1996. Just fresh of the airplane as a new landed immigrant in Vancouver, Canada. I always wanted to be able to leverage this wonderful technology called the world wide web and be able to live on my own terms, without bosses, without commuting.</p><p>Honestly, it took a lot longer to get to where I wanted. I built my first website back in 2001. It took me another 9 years of tinkering online before I could quit my job and live 100% of my Internet income.</p><p>I know, I was slow compared to many self made Internet multimillionaires. I wanted to be Mark Zuckerberg but I was not smart enough to got to Harvard or ambitious enough to pursue building a multi billion empire.</p><p>I just wanted to enjoy life, to have time to spend travelling, going back to Spain every year, playing soccer with my friends. A simple life without huge responsibilities or liabilities.</p><p>I'm no Tim Ferris or Gary Vaynerchuck either, no Seth Godin or Paul Graham. People like them have been an inspiration and my indirect mentors. I'm just Miguel Hernandez from Bilbao, Spain and very slowly I carved my own niche in the vast new world of zeros and ones.</p><p>I've learned a lot in this time and I think now is a good time to share some of the lessons so when you build your own successful business you can speed up through the learning process.</p><p>In the end, I'm creating the course I wish it existed 10 years ago when I decided I wanted to make a living online.</p><p>Let's do it!</p>", 
    "end_date": null, 
    "title": "How to launch an awesome online lifestyle business", 
    "price": "40.00", 
    "instructors": "Miguel Hernandez", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618110_ddc9_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-an-awesome-online-lifestyle-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T13:39:24Z"
}