{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Last Updated:</strong> April 15th 2016 added new income report &amp; Promotional Announcements Strategy</p>\n\n<p>I currently make over $2500 a month selling online courses with Udemy as of April 2016. </p><p> I have 23 courses for sale that are focused on the music industry and 3 teaching entrepreneurship in business.</p>\n\n<p>Selling online courses is a billion dollar industry which makes it a huge opportunity for instructors to get in the game and start selling their knowledge.</p>\n\n<p>Within a few months of getting serious about selling online courses with Udemy I saw a huge increase in monthly revenue considering the amount of time I put in.</p>\n\n<p>Selling online courses can truly be a passive income and make you money while your sleeping. S.W.I.S.S Dollars - Sales - While - I - Sleep - Soundly</p>\n\n<p>I have a background in online marketing selling one of the toughest digital products in all industries which is music.  I've managed to sell millions of songs and make a great living with music so I am now taking my experience to teach online courses.</p><p>Selling online courses is an amazing opportunity to teach people what you know and get paid for it at the same time.</p><p>Don't wait any longer and start creating your first online course</p><p>Chris</p>", 
    "end_date": null, 
    "title": "How to Create a Fulfilling Career by Teaching Online", 
    "price": "20.00", 
    "instructors": "Christopher Greenwood", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634256_c094_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-fulfilling-career-by-teaching-online/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T01:06:56Z"
}