{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you’re a business owner, you already know how burdensome and stressful it can seem to get everything you want accomplished on many days. Many find themselves over their heads at times when it comes to getting everything they need for their business completed in a timely fashion.</p>  <p><em><strong>Let’s face it you cannot get everything done on your own.</strong></em></p>  <p>Many of them are one-person operations with no permanent staff or employees. This is where outsourcing some of the work that needs to be done comes in. It provides you with more free time to get other things done. </p>  <p>Outsourcing means that you delegate various work and tasks to other people for a set amount of pay, usually in the form of a one-time payment.</p>  <p>The need for more quality people to assist business owners with various tasks is stronger than ever. There are many significant benefits to outsourcing work.</p>  <p>This course will show you the basics of outsourcing and how to make the most of it. It shows what to look for in freelancers and how outsourcing can be a source of business growth.</p>  <p>Section one looks at the basics of outsourcing.</p>  <p>Section two examines what to look for with outsource workers and what tasks to delegate.</p>  <p>Section three looks at what you can expect from outsourcing.</p>  <p>Many business owners are reluctant to invest in outsourcing. But outsourcing is an investment in business growth and saving time. This course will show you the benefits of outsourcing and what it can do for you and your business. </p>", 
    "end_date": null, 
    "title": "How To Outsource Projects To Freelancers For Business Growth", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690616_fa21.jpg", 
    "course_url": "https://www.udemy.com/how-to-outsource-projects-to-freelancers-for-business-growth/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T22:53:46Z"
}