{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  If your a business owner or an aspiring entrepreneur and your terrible at getting clients, your about to learn, a full prof process you can use to create a great information product and get new customers in the door. Plus a little trick that is guaranteed to streamline the process.  </p>  <p>  \t    This course is designed to walk you through the steps of creating an information product. Information business are a great way to build a scalable passive income business. Having a business that generates passive income is a great way to free yourself from your 9 to 5, or just generate some extra spending money.  </p>  <p>  \t    Learn and Master the Fundamentals of Creating an information product in this Comprehensive Course. What you&#039;ll learn  </p>  <ul style=\"\">  \t<li>How to find experts </li>  \t<li>How to find your Initial Product Idea </li>  \t<li>Identify the correct format</li>  \t<li>Interview techniques </li>  \t<li>Affiliate Links</li>  \t<li>Building a continuity program </li>  \t<li>Get Professional Images for your Products </li>  \t<li>Create ebooks</li>  \t<li>Build Webinars</li>  \t<li>Get PLR products</li>  \t<li>Repurposing Your Content </li>  \t<li>Tools You Need </li>  \t<li>Information in the Public Domain</li>  \t<li>Actionable Steps to building your Info-product  </li>  </ul>  <p>  \t<strong style=\"\">How To Create Your First Information Product </strong>  </p>  <p>  \t    Information businesses are systems of information, and as you know systems are the key to business success. This content survives the test of time. This course might have taking me year to produce. but it also survives years. If someone buys this course five years from now, I will earn a small profit on a time investment i made years earlier. The content is an asset that is salable, over and over again, and with each sale. the effective time cost declines while the hourly rate of returns expands.  </p>  <p>  \t    We are living in the digital age, as a result many entrepreneurs have turned to Internet Marketing and Information Business to build passive income and build highly leveraged business. In this course you will be shown how to build the foundation to a successful information business.  </p>  <p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p>  \t    I designed this course to be easily understood by absolute beginners.  </p>", 
    "end_date": null, 
    "title": "How to a make and market a Digital product, fast.", 
    "price": "20.00", 
    "instructors": "Martin Armstrong", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426386_736e_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-a-create-an-information-product-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T22:27:54Z"
}