{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>What do Facebook, Groupon, Twitter, Pinterest, &amp; Instagram have in common - besides being ultra successful businesses?</p>\n\n<p><em>You probably won’t guess it.</em>\n</p>\n\n<p>Every single company started with an idea that was <strong>TERRIBLE.</strong></p>\n\n<p><em>Yes, that’s right</em>. Mark Zuckerberg, Jack Dorsey, Andrew Mason, Kevin Systrom all started their businesses not with immediate success, but with immediate failure, ridicule, and frustration.\n</p>\n\n<p>That’s not the story you heard, right?\n</p>\n\n<p>You probably heard that they all channeled their unlimited brilliance into crafting the perfect idea. An idea so great, so perfect that it was just a matter of time before their idea took the world by storm.\n</p>\n\n<p>That’s what most people think. And most people are <strong>100% wrong</strong>. \n</p>\n\n<ul><li>Facebook started as a way to <em>compare attractiveness between classmat</em><em>es</em>.</li><li>Pinterest started as an app that let you get notified when your <em>favorite designer goods went on sale.</em></li><li>Groupon started as a <em>website for raising funds for charity</em>.</li><li>Instagram started as <em>Burbn</em>, the 400th app to let you “check in” at your favorite businesses.</li></ul>\n\n<p><em>And yes, Twitter started as a website to list and find podcasts.</em>\n</p>\n\n<p>None of these ideas were brilliant. They weren’t clever. They certainly weren’t insightful. And they certainly weren't \"<em>ahead of their time</em>\"\n</p>\n\n<p><em>But they WERE created by people who supposedly are.</em> \n</p>\n\n<p>Business ideas are not an art. They're not things that are limited only to those with experience &amp; creative insight. </p>\n\n<p>Anyone can come up with, develop, and improve business ideas. Business ideas that can be life changing - and I guarantee a whole lot better than the first idea of most major companies.</p>\n\n<p>Stop being intimidated by the process of coming up wjth business ideas. Learn it, master it, and conquer it.</p>\n\n<p>Learn the <strong>science</strong> behind creating great business ideas.</p>\n\n<p>-------------------------------------------------------------------</p>\n\n<p><strong>Why you should enroll:</strong></p>\n\n<ul><li><em>Over 1,000 students have signed up within t</em><em>he first 12 hours of the course going live!</em></li><li>Course includes over <em>6 hours</em> of high quality content, including activities, worksheets, quizzes, exclusive discounts, and access to an exclusive class only web idea generating web application</li><li>You'll learn skills that are <em>invaluable</em> in any situation, like being able to assess an ideas marketability, how to spot market inefficiencies, and how to successfully employ brand new, disruptive business models </li><li>You'll have <strong>direct access to the instructor</strong>, who has vet <em>over 1,000 ideas</em> as a venture capitalists, and hundreds more as a founder and director of a digital agency</li></ul>\n\n<p>---------------------------------------------------------------------</p>\n\n<p><strong>About the instructor:</strong></p>\n\n<p>Top rated Udemy Instructor with <strong>over 600+ 5 star reviews</strong>.<br></p>\n\n<p>Teaches 9 different courses on Entrepreneurship, <em>with over 20,000 students enrolled</em>.</p>\n\n<p>All courses by the instructor have are rated an average of <em>4.97 out of 5 stars.</em></p>\n\n<p>+ Worked as a VC and was in charge of deal flow in Silicon Valley. Oversaw investments in large companies like Facebook, LinkedIn, &amp; Tesla.</p>\n\n<p>+ Startup founder for 5 years, raised 3 rounds of capital worth several millions of dollars.</p>\n\n<p>+ Currently Director of a Digital Agency that specializes in taking ideas from raw concept all the way to launch.</p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "How to come up with killer business ideas: complete workshop", 
    "price": "25.00", 
    "instructors": "Evan Kimbrell", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616958_d93b_4.jpg", 
    "course_url": "https://www.udemy.com/idea-generation-coming-up-with-killer-business-deas/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T01:43:29Z"
}