{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>LAST UPDATED ON APRIL 5, 2015</p><p>  \tDo you want a more successful business? Do you want to reach your weight loss goals? Do you want a better personal life? Effective planning is one of the most important elements of success in any area. The top corporations plan marketing campaigns years in advance. Many seven figure marketers rely on planning to achieve desirable results. The successful individuals of various industries planned their ways to success.  </p>  <p>  \tHowever, most people either do not plan at all or plan incorrectly. The traditional method of giving ourselves a bunch of tasks to complete does not work. It is choosing to complete the right tasks that lead to the best results. There are other traditional methods that don&#039;t work, and I discuss some of those methods in the course.  </p>  <p>  \tPlanning has been a major part of my success, and without it, my entire online presence would be virtually nothing. As a junior in high school on the track team with standardized tests, a blog about digital marketing, over 150,000 Twitter followers, and a few other things, it is fair to say I have a lot on my plate, and with homework, that plate gets filled up quickly.  </p>  <p>  \tHowever, the most challenging high school year has not stopped my progress. In fact, I have accomplished more in my junior year of high school for my business than during any other school year. This growth wouldn&#039;t have been possible without an effective plan.  </p>  <p>  \tIf you want to have a successful day, or week, or month, or year, then you need to know how to effectively plan your way to success. Take this course now to learn what constitutes an effective plan, how you can create an effective plan on your own, and some of the strategies that I use to stay productive by growing my business during junior year. I can&#039;t wait to see you in the course  </p>", 
    "end_date": null, 
    "title": "How To Plan Your Way To Success In Anything You Want", 
    "price": "20.00", 
    "instructors": "Marc Guberti", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375322_3ab5_3.jpg", 
    "course_url": "https://www.udemy.com/plan-way-success/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T03:45:42Z"
}