{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>LEARN HOW TO SET UP FAST SUCCESSFUL BUSINESS ON ETSY NO EXPERIENCE</strong></em><br></p><p>Have you had trouble getting started on etsy! Not sure how to start up or need motivation to make this venture successful if you said to any or all of the questions above then this course is for you. Fernando is a newbie without zero experience in business after taking our Etsy shop complete marketing and social media strategy guide he was so inspired that he decided to start his own 30 day journey. He then asked us to come and help him along.</p><p>This course is a Journey of 30 days challenge from to create a successful Etsy shop from scratch no experience except everything Fernando learned from Sergey and Alex course on Etsy shop complete marketing and social media strategy guide. In this course you will see how Fernando took on this challenge his Journey while co instructors Sergey and Alex will offer tips what he did wrong and right.</p><p>This course is great if you want to start your own Etsy shop it gives you a day by day guide what to do, how to do it and lots of tips and pointers. This is a class like you never before taken on Udemy. It is rich in information, knowledge and hands on experience. So if you are not sure how to start your own shop at Etsy and need guidance and step by step direction this is the right course for you.</p><p>NOTE: This course is part II of our successful Etsy shop complete marketing and social media strategy guide both courses go hand in hand to help you become a successful seller on etsy see you on the inside.</p>", 
    "end_date": null, 
    "title": "How to build an etsy ecommerce home business in record time", 
    "price": "20.00", 
    "instructors": "Fernando D, Alex Genadinik, Sergey Kasimov", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571142_40ce_4.jpg", 
    "course_url": "https://www.udemy.com/building-an-etsy-business-in-30-days-challenge-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-01T20:50:49Z"
}