{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">R.A.T.E.S is an acronym for five essential areas of development which are Response-ability, Account- ability, Technical-ability, Evaluation-ability and Sustain-ability. Each of these five categories represent standard operational practices that are essential for results oriented, nonprofit, Human Service delivery. Students learn strategies for planning and developing effective Human Service delivery and sustainability.</p><p style=\"\">There are 4 levels in R.A.T.E.S. Principles Development. 1) Foundational Development, 2) Organizational Profile; 3) Collaborative Resource Development; 4) Donor Development. Each level offers a certification upon successful completion of student participation including assignments. R.A.T.E.S. Certification also helps attract favor with donors and other resource support. The Level 1 (Foundational Development) R.A.T.E.S. Series content and assignments meet requirements for a total of 10 Continuing Educational Units in Human Services and Nonprofit Development. Student assignments for the entire series include developing contents for a Problem and Needs Statement, Preparing a Client Profile, Developing a Corporate Budget Summary, Planning Organizational Goals and Objectives; Identifying and describing the 8 standard elements of a government grant proposal. There are 5 courses in the Level 1 Series.</p><p style=\"\">R.A.T.E.S. Principles Level 1 courses are intended for Nonprofit startups and Human Services seeking to restructure and build cohesion among staff, partners, board members and supporters. Each course covers one of the 5 areas and are intended to be completed in sequence beginning with “Response-ability.&quot; These courses is based on the book R.A.T.E.S. Principles – Timeless Principles for Successful Nonprofit and Human Services. It is delivered using Multi-media that integrates audio and visual presentations. The course includes supplemental materials such as fillable PDF forms that can be downloaded to allow easy application of the skills learned.</p><p style=\"\">All Level 1 R.A.T.E.S. Principles course can be completed in 10 hours (2 hours per Principle) including assignments. However the time needed to complete assignments vary according to individual students. ADDITIONAL REQUIREMENTS: Students need to be able to download save and retrieve downloaded files to successfully complete course assignments.</p>", 
    "end_date": null, 
    "title": "How to Build Your Nonprofit Startup 1", 
    "price": "50.00", 
    "instructors": "Dr. Margaret Jamal", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479326_a416_5.jpg", 
    "course_url": "https://www.udemy.com/rates-nonprofit-and-human-services-training/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-17T20:58:52Z"
}