{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Who would not want to work in their pyjamas, from the comfort of their home, or on a beach, creating extreme wealth for themselves in a matter of hours, or minutes per day!</strong></p><p>This is what becoming a professional currency trader can offer you.</p><p>But why do 90% of amateur traders fail and lose all, or most of their money?</p><p>They lose their money because they fail to learn the necessary skills required to conquer this market, whilst <strong>the professional trader uses the same skills day in day out, to make hundreds, thousands, or millions of dollars.</strong></p><p>This course is designed to teach you these principles, to arm you with skills you need to survive and prosper in one of the toughest, but most rewarding endeavours on the planet.</p><p><strong>Give yourself an unfair advantage and trade like a pro!</strong></p><p>My name is Andrew McBarnett, I am a serial entrepreneur and I have been trading since November 2008.  I am so confident that if you diligently apply the principles contained in the course that you will succeed as a trader that I am willing to take ALL of the risk and back this course up with my <strong>N</strong><strong>o Excuses 30-Day Money-back Guarantee</strong>.</p><p>Here's what we will cover in the course:</p><ul><li><strong>Lesson #1 - Introduction to Forex</strong>: A description of Forex and the advantage of trading this market</li><li><strong>Lesson #2 - Successful Trading</strong>: the key components to becoming a successful professional trader</li><li><strong>Lesson #3 - Zero-Sum Markets</strong>: What this term means and its implication for you as a trader</li><li> <strong>Lesson #4 - Why Prices Move</strong>: An explanation of what moves prices and I'm sure that you'll be surprised by what this contains</li><li> <strong>Lesson #5 - Probability &amp; The Laws of Small/Large Numbers</strong>: This is a critical element of a trader's understanding and is probably the least understood by most amateur traders</li><li> <strong>Lesson #6 - Probability of Ruin</strong>: How do you know whether over the long-term your trading will yield an increase, or decrease in your trading capital?  This tool will act as a useful guide.</li><li> <strong>Lesson #7 - Trading Psychology</strong>: Your mind is pre-programmed in a way to work against your trading.  This lesson will demonstrate where this happens and will provide you with the tools to combat the impact.</li><li> <strong>Lesson #8 - Your Trading System</strong>: We will discuss what makes for a good trading system and how this can contribute towards your on-going success.</li><li> <strong>Lesson #9 - The Formula For Your Success</strong>: A brief summary bringing the previous lessons together.</li><li> <strong>Lesson #10 - Trading Like A Pro</strong>: I'll attempt to explain why is a professional so much more successful than an amateur trader.</li></ul><p>There is a <strong>SPECIAL LAUNCH 90% DISCOUNT</strong> that is now being offered.  If you chose to wait, you can still get How To Trade Forex Like a Pro, but at a significantly higher price.</p><p><strong>Enrol on this course today, as you could be trading for a living in next to no time!</strong></p>", 
    "end_date": null, 
    "title": "How To Trade Forex Like A Pro - The Principles of FX Trading", 
    "price": "20.00", 
    "instructors": "Andrew McBarnett FCMA, CGMA, MASC (NLP)", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/701674_a5db_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-trade-forex-like-a-pro-the-principles-of-fx-trading/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-19T19:04:32Z"
}