{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   In this course you will discover all the elements needed to start up your very own home mug printing venture including what equipment to buy, How to create your images, The printing process, Finding your first customers, Making your advert graphics and much more.  </p>  <p style=\"\">  \t   We walk you through our own home business that we have operated since 2005 and you get to see exactly what we do.  </p>  <p style=\"\">  \t  We&#039;ll show you what equipment we use and the explain the reasons for choosing the correct equipment and materials and the pitfalls of choosing the wrong equipment.  </p>  <p style=\"\">  \t  Printing on mugs presents endless opportunities to target many different niches and create tailored mugs for many different occasions. We have produced many speciality mugs for clubs and associations as well as our regular niche mugs that we sell on Ebay.  </p>  <p style=\"\">  \t  The list of niches you could exploit is endless. Just think of all the speciality magazines that are on sale in your local store and each of those is a potential niche. You&#039;ll also be surrounded with clubs and groups where you live and they all represent a sales opportunity.  </p>  <p style=\"\">  \t   This is your complete guide to starting this enjoyable home business for fun and profit.  </p>", 
    "end_date": null, 
    "title": "How To Start A Mug printing Business For Fun And Profit", 
    "price": "35.00", 
    "instructors": "Martin Butler", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/122812_0ae4_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-mug-printing-business-for-fun-and-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-20T10:29:26Z"
}