{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                        Starting a business can be an exciting, soul-fulfilling endeavor providing entrepreneurs the means to center their lives around their dreams, talents and passions. But quitting a steady job to pursue a risky venture can be daunting. This course will chart a map for aspiring entrepreneurs on how to begin their journey.  </p>  <p>  \t<strong>Take The Leap from Employment to Entrepreneurship</strong>  </p>  <ul>  \t<li><strong></strong>Determine if entrepreneurship is right for you.</li>  \t<li>Increase your odds of success and reduce the risks.</li>  \t<li>Uncover what you need to know about money: putting it in and getting it out.</li>  \t<li>Develop a 10 step action plan for becoming an entrepreneur.</li>  </ul>  <p>  \t<strong>Launch Your Business On the Right Foot: Be Prepared For the Journey Ahead</strong>  </p>  <p>  \t                        This course is designed specifically for aspiring entrepreneurs who have an idea for starting a business but don’t know what to do next or how to start. It charts a course for beginning your entrepreneurial journey: how to begin, what to expect, how to prepare, and connects you to resources (many free!) that can help you along the way. It also covers some topics that many other “how to start a business” courses don’t touch upon: the personal considerations of starting a business.  </p>  <p>  \t                        Developed by Robin Wang, a 20+ year business owner and veteran of several new ventures, this course incorporates many of the lessons learned (from both his successes and failures) so that you can make that leap to entrepreneurship with greater confidence, less risk, and improved odds. This does NOT cover the nuts and bolts of starting a business like preparing financial forecasts, developing a launch strategy, or writing a business plan. Rather it lays a solid foundation so that you are much better prepared should you one day take a start-up business course.  </p>  <p>  \t<strong>Course Content and Overview</strong>  </p>  <p>  \t                        This course contains 20+ lectures on a wide variety of related topics centered on transforming your idea into a real, tangible business. It is designed for individuals who have no experience with business (let alone starting one) and is industry agnostic. In other words, it doesn’t matter if you want to open up a bakery, become a freelancer, or launch the next Facebook, Apple or Tesla.  </p>  <p>  \t                        It is designed with a very pragmatic and action oriented approach as there is not much in the form of academic theory or principles. Rather, most of the content comes from lessons learned and experiences garnered on “street of life.”  </p>  <p>  \t                        By the end of this course you’ll have much more clarity around your business idea, increased confidence in talking to others about your new venture desires, and have a solid plan for moving forward.  </p>  <p>  \t<strong>Testimonials From the In-Person Course:</strong>  </p>  <p>  \t<em>&quot;Robin gave us great information and a lot of resources to go to for more  info.  He really spells out what it will be like to be an entrepreneur,  so we can decide for ourselves whether it is right for us.&quot;</em>  </p>  <p>  \t<em>&quot;Great opportunity to explore whether you have what it takes and gives an  introduction to what to expect. Then pushes you to the next steps of  making your dreams a reality and provides the necessary tools. Highly  recommended!&quot;</em>  </p>", 
    "end_date": null, 
    "title": "How To Quit Your Job & Start A Business", 
    "price": "20.00", 
    "instructors": "Robin Wang", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322516_7056_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-quit-your-job-start-a-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-19T12:17:34Z"
}