{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>I often get asked HOW I created a 7 figure business after only 18 months of arriving alone, broke and homeless into a brand new country on the other side of the world.</p><p>It wasn't luck.  It wasn't any special 'gift'.  It wasn't a serendipitous moment of epiphany.</p><p>It was adopting some simple strategies and consistently implementing them - and I've decided to share them with the world.</p><p><br></p><p>I have gone from an absolute 'nobody', to a multi-award winning 'somebody' with a 7 figure business, and to top it off, have positioned myself as an authority in my field in the process.</p><p>In this course, I will share with you some of the black and white, fluff-free, immediately implementable methods, tools, hacks and strategies that I used to do it, that you can start using TODAY to make the exact same happen for you too.</p><p>The tools, methods and strategies I will present to you in these 40 'how to' video tutorials are simple, free and applicable to absolutely any industry sector, and whether you're a well established business with a big team or a 'solopreneur' starting a business from your kitchen table.</p><p><br></p><p>All up I have been in business for over 10 years in three different countries and I have learned a LOT on the way.  I've learned from experiences good and bad, mentors good and bad; I have earned a lot of money and I've lost a lot of money.  In this course, I will pass on to you some of the best, most transformative life/business changing methods that have HELPED me make it, so that you can get there the fast way without having to go through all of the lessons that I did to learn it in the first place.</p><p><br></p><p>My passions are education and business, and in particular 'entrepreneurial alchemy', aka: making something profitable out of nothing.  By putting this course together for you I get to fulfill my own life mission of creating entrepreneurial success stories across the globe as a result of my own spectacular journey in business.</p><p><br></p><p>If you want to increase your earnings, get seen, heard and respected in your industry AND finally create for yourself the lifestyle of your dreams as a 'go-to' authority within your field, then this course is absolutely going to change your life, as learning them all has changed mine.</p><p>I cannot wait to hear about your journey and success - let's get started!!</p><p><br></p><p>Sarah Cordiner X</p>", 
    "end_date": null, 
    "title": "How To Become The Go-To Authority In Your Industry", 
    "price": "50.00", 
    "instructors": "Sarah Cordiner", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610338_078f_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-the-go-to-authority-in-your-industry/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-12T23:50:58Z"
}