{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">[UPDATED ON MARCH 9, 2015]</strong></p><p><strong style=\"\">Student Review</strong><br style=\"\"><strong style=\"\"></strong>  </p>  <p>  \t<em style=\"\">With concise, easy-to-follow steps, Akilah does a masterful  job of  explaining the process of preparing content for online delivery  and  expertly clarifies key issues in automating the process of content   delivery for an online audience.   This course is invaluable for anyone   who wants to create successful information products in an online  format.    If you need an easy-to-follow guide for creating an  automated, online  information series you will find this course to be  very helpful. </em><strong style=\"\">- Tricia Francis Morgan</strong></p><p><strong style=\"\">------------------------------------------------------------------------------------------------------------------------</strong></p>      <p>  \t<strong style=\"\">This system turns any idea of yours that can be broken down into  steps, into a digital, automated, subscription-based program that you  can create, upload, arrange, sell, and make money.</strong>  </p>  <p>  \t      If you&#039;ve ever:  </p>  <ul style=\"\">  \t<li style=\"\">written a book or ebook</li>  \t<li style=\"\">  taught a workshop</li>  \t<li style=\"\"> posted a video series on YouTube</li>  \t<li style=\"\"> created your own product</li>  \t<li style=\"\">shared any &quot;how to&quot; skills on your blog</li>  </ul>  <p>  \t                                                         ...or if you happen to be good at something at a level where you think you could probably teach it in a step-by-step format, my &quot;Idea Selling System&quot; may offer you a way to make money sharing your best ideas.  </p><br style=\"\"><p>  \t                                                         Turn your inspirational book or ebook into a subscription-based coaching series.  Or you could turn your wellness workshop idea into an online-based series that&#039;s delivered to your clients&#039; inboxes on the dates and times you schedule them to go out.<br style=\"\">  \t<br style=\"\">  \t                                                         Your client is billed on whatever payment interval you set up and outlined on your product website (which I&#039;ll show you how to create), and the money goes directly to your Paypal or bank account. <br style=\"\">  \t<br style=\"\">  \t                                                         Your idea-turned-automated-product now become what&#039;s known in the digital entrepreneur&#039;s scene as an “Evergreen,&quot; which is a product you make once and sell repeatedly without exchanging your time for money with each sale.<br style=\"\">  \t<br style=\"\">  \t                                                         You make it, launch it, sell it. Then you water it on occasion by marketing, networking with others whose audiences might be part of your ideal target market, and you keep selling your existing product.<br style=\"\">  \t<br style=\"\">  \t                                                         And this is a system you can duplicate and use for ANY of your ideas, existing or new ones.  Once you know the system, you can apply it to  </p>  <ul style=\"\">  \t<li style=\"\">your books</li>  \t<li style=\"\">your coaching programs</li>  \t<li style=\"\">your workshops</li>  \t<li style=\"\">your blog posts</li>  \t<li style=\"\">your photography knowledge</li>  \t<li style=\"\">any knowledge you can explain in increments</li>  \t<li style=\"\">anything you can teach in a step-by-step format.  </li>  </ul>  <p>  \t                                                You don&#039;t need to have technical experience (coding, design, etc.) to do well with this course.  If you&#039;ve ever used Wordpress (or if you&#039;re willing to use Wordpress), and you want to sell your ideas in a step-by-step email process, you have all the prerequisites to take this course.  Enroll today and get started turning your old ideas into new income!  </p>", 
    "end_date": null, 
    "title": "How Creative Entrepreneurs Turn Old Ideas Into New Income", 
    "price": "25.00", 
    "instructors": "Akilah S. Richards", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307278_aa9c_2.jpg", 
    "course_url": "https://www.udemy.com/sellmyidea/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-25T01:17:35Z"
}