{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>JOIN OVER 1,000 STUDENTS USING THIS COURSE AND TEMPLATES TO WRITE A POWERFUL BUSINESS PLAN AND LAUNCH THEIR DREAM IDEA.</strong>  </p>\n\n<p>  \t<em>Course fully updated as of April, 2016.</em>  </p>\n\n<p>  \t<strong>Enroll now to learn everything you will need to turn your idea into a standout business plan that will impress readers and set your dream idea in motion!</strong>  </p>\n\n<p>  \t                                                        ______________________________________________________________________________________  </p>\n\n<p>  \t<strong>    Student Review:</strong><strong> </strong><em>\"Very good course! E</em><em>ach step is well explained, then summarized, then further explained through an example, but still compact enough to re-watch again when needed.\"</em> <em>- Peter Farkas</em>  </p>\n\n<p>  \t<strong>Student Review: </strong><em>\"All the important points of creating an excellent business plan were covered. I encourage any individual wanting or needing to put together a concise business plan to sign up for this course.\" - Francis Markle</em>  </p>\n\n<p>  \t                                                      ______________________________________________________________________________________  </p>\n\n<p>  \t                                                                                                                                                          In my extensive career (see bio at left) - I've written, studied, and analyzed dozens of business plans. This course shares with you everything I've learned about business plans over my career.  </p>\n\n<p>  \t                                                                                                                                                          There are 10 important sections you must cover in any good business plan, and there's a simple <strong><em>SECRET</em></strong> to getting each one right.<strong> <em>I share them all in this course. </em></strong>  </p>\n\n<ol>  \t<li><strong></strong>Executive Summary</li>  \t<li>Product</li>  \t<li>Customers</li>  \t<li>Marketing Strategy</li>  \t<li>Operations</li>  \t<li>Industry Analysis</li>  \t<li>Key Risks</li>  \t<li>Financials</li>  \t<li>Management Team</li>  \t<li>Timeline &amp; Next Steps</li>  </ol>\n\n<p>  \t                                                                                                                                                          Plus I provide detailed examples and <strong>two</strong><strong> step-by-step TEMPLATES in both Word and PowerPoint</strong> <strong>to easily create your own business plan. </strong>  </p>\n\n<p>  \t                                                                                                                                        I will teach you how to write a powerful business plan to impresses investors, potential customers, employees, partners, advisors, and anyone else you're pitching on your business venture.  </p>\n\n<p>  \t                                                                                                                                                          I will walk you through the 10 important sections of any successful business plan and:  </p>\n\n<ol>  \t<li>Explain the purpose of each section</li>  \t<li>Describe exactly what you should include in each section</li>  \t<li>Share the secrets of how to tackle each section</li>  \t<li>Give a detailed example of how to write each section by showing you an imaginary company called \"Smart Watch Inc.\"</li>  \t<li>Show you not just how to create a compelling business plan, but how to think critically about building a great business</li>  </ol>\n\n<p>  \t                                                                                                                                                ______________________________________________________________________________________  </p>\n\n<p>  \t<strong>COMING SOON </strong>(things I'll be adding to the course):  </p>\n\n<ul>  \t<li>A recommended reading list for starting a new business (mapped to sections of the business plan)</li>  \t<li>Detailed answers to frequently asked questions from students</li>  \t<li><strong>All additions to the course are shared with you at no extra cost because you have lifetime access</strong></li>  </ul>\n\n<p>  \t                                                                                                              This course is not about actually launching a new business. It's focused mostly on writing the business plan that begins the launch process.  </p>\n\n<p>  \t                                                                                                                                                ______________________________________________________________________________________  </p>\n\n<p>  \t<strong><em>There is no risk:</em></strong> My personal promise is that you will get everything you need to draft a powerful business plan or your money back within 30 days. No questions asked.  </p>\n\n<p>  \t                                                                                                                                                          You can return to this course for your entire life and access up-to-date lectures on writing a powerful business plan, all at no extra cost.  </p>\n\n<p>  \t<strong>Enroll now to turn your business idea into a powerful business plan and launch your dream!</strong>  </p>", 
    "end_date": null, 
    "title": "How To Draft a Business Plan (includes templates)", 
    "price": "45.00", 
    "instructors": "Todd Myers", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382404_2fdc_13.jpg", 
    "course_url": "https://www.udemy.com/writeabusinessplan/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T20:24:05Z"
}