{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Marketing has been very badly handled in the construction industry and sometimes even overlooked.This course is all about how to grow your construction business, whatever market sector you are in and will enable you to discover key principles and strategies to develop your sales pipeline and grow in profitability. Steve teaches proven strategies that have worked for him over many years as a Business Development Consultant in the construction industry where he has generated millions for main contractors and small specialist trades. Here&#039;s what you get in the Course:  </p>  <ul style=\"\">  \t<li>Ten video lectures by Steve.</li>  \t<li>Downloadable Worksheets which can be used for individual or group use - great for staff training.</li>  \t<li>PDF Copies of all the Power Point Presentations used.</li>  \t<li>Steve&#039;s updated 63,000 word eBook, &quot;Marketing For Construction&quot; - selling elsewhere for £27 GBP $47 US as a single item.</li>  </ul>  <p>  \t  If you don&#039;t already have a marketing manager in your company, these lectures will enable you to get up to speed with the latest strategies for growing your business. If you do have a marketing manager, these lectures and materials will be an ideal refresher course to enable your staff to be more effective in business development principles. Companies invest large chunks of their annual budget for course material like this, so this course represents incredible value for money and if implemented, will result in growing profitability for your company and in return, higher productivity from your workforce. Steve sets out achievable targets and realistic goals to enable you to get excited again about the future of your business. What Steve&#039;s construction clients say: “I really enjoyed Marketing For Construction and found lots of depth in it. From his 101 marketing ideas through to his analysis of the evolution of sales approaches, the book is well thought out, well written and refreshing. His section on lead research questions and partnering are relevant to every field.” Reg Nordman, Rocket Builders, USA  </p>  <p>  \t  “We’ve worked with you for some time now and have been very impressed with your industry knowledge, marketing flair and your ability to enthuse and help in very practical ways. Your e-book is great – tons of highly practical material drawn from years of successful experience. Wider distribution now with the power of personal tuition will mean even more people will be impacted and a lot of new business generated with the secrets to success you are now unlocking.” David Crick, Contractors Marketing Services  </p>  <p>  \t  “We have been successful in business for 10 years, but had reached a point where we wanted to expand our company but were struggling to find fresh inspiration and direction for the marketing side of our business. Once we employed the services of Making Construction Work, Steve Flashman helped us find the inspiration/direction and assisted us in maintaining focus in the right areas of successfully marketing our company. He has had a huge impact on our business and also on us as individuals. It is a pleasure to include Steve as part of our valuable team and we would not hesitate to recommend Marketing For Construction to anyone.” Darryl &amp; Stephanie Higgins, Directors, Premier ACS Ltd  </p>  <p>  \t  “We have had first hand experience of the Construction Marketing Consultancy Services of Steve Flashman through Making Construction Work in the development of our own business and can highly recommend his services to you.” Colin Garwood, Director, Electrical Services &amp; Projects  </p>", 
    "end_date": null, 
    "title": "How To Grow A Profitable Construction Business", 
    "price": "35.00", 
    "instructors": "Steve Flashman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/250076_018e_4.jpg", 
    "course_url": "https://www.udemy.com/marketingforconstruction/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-25T11:35:35Z"
}