{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>As a website investor I have owned and setup web hosting for literally hundreds of websites. In this course, the focus is on the end result. You will go through a fast, straightforward process to choose a new domain (website name), get the domain setup on a web hosting account and learn the basics of web hosting that you will need to know to operate your site. (Oh, and we’ll install WordPress!)</p>\n\n<ul><li>         It will be fast and efficient</li><li>         It will be a high quality web hosting provider</li><li>         It will be cost effective</li><li>         What you learn will apply to any future websites you may buy or create</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>So what exactly will you learn?</strong>    \n\n  </p>\n\n\n\n<ul><li>        The do’s and don’ts in choosing a domain name</li><li>        The best tool for brainstorming names and finding whether they are available</li><li>        How to setup web hosting</li><li>        How to associate the domain with the web host</li><li>        How to setup an email account for the web site</li><li>        How to install WordPress with the famous 1-click installation</li><li>        How to install Filezilla FTP software and use it</li><li>        And much more…</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Is This For You?</strong>\n\n  </p>\n\n\n\n<p>That depends. This is for beginners. If you haven’t setup web hosting or purchased a domain before, this is probably the best place to start. \n\n  </p>\n\n\n\n<p>If you don’t have an idea for a website in mind yet, and want to learn the process before you commit, this is also for you.\n\n  </p>\n\n\n\n<p>If that’s not you, check out my other courses!\n\n  </p>\n\n\n\n<p>If it is you, I’ll see you in Module 1.</p>", 
    "end_date": null, 
    "title": "How To Setup Web Hosting - Fast and Low Cost", 
    "price": 0, 
    "instructors": "Jeff Hunt", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854228_2d5a_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-setup-web-hosting-fast-and-low-cost/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-19T17:25:26Z"
}