{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">One of the fastest paths to success is starting a new project like a business, blog, book or some other creative endeavor. Side projects can result in extra income, greater fulfillment and even a more enjoyable career. If you aren&#039;t creating something in your spare time, you aren&#039;t reaching your full potential.&nbsp;</p><p style=\"\">But learning to work for yourself is no picnic. Most people can&#039;t find the time, energy or correct life priorities to start and complete creative side projects. They keep putting off planning these projects, never finding out what they could have accomplished if they&#039;d only created something.&nbsp;</p><p style=\"\">Instructor Bryan Cohen is no stranger to creative productivity. He&#039;s earned more than $35,000 in the past few years from his side business, Build Creative Writing Ideas. His 30 books, all of which were written in the past few years, have sold more than 20,000 copies. He learned to get more done through the life-enriching tips he learned by reading dozens of books, attending multiple conferences and through his own trial and error.&nbsp;</p><p style=\"\">He&#039;s put in hundreds of hours of refining his creativity techniques so that you don&#039;t have to. By using Cohen&#039;s tips and tricks, you&#039;ll start planning your business, book, blog or course in the next few days with optimized time, renewed energy and an improved balance in your life. You&#039;ll learn to work for yourself.&nbsp;</p><p style=\"\">It&#039;s time to get more done in your life. Click the Take This Course button right now to finally get that amazing (and potentially money-making) idea out of your head, onto paper and into reality.&nbsp;</p>  ", 
    "end_date": null, 
    "title": "How to Work for Yourself", 
    "price": "50.00", 
    "instructors": "Bryan Cohen", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/52902_f775_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-work-for-yourself/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-08T12:34:26Z"
}