{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you are introducing a new product or launching a startup, this course is for you.<br></p>  <p>  \t         In three hours, you'll learn a process for creating and testing a profitable business model for your product. You'll learn proven techniques to make a product launch plan and get in front of potential customers to validate your product and pricing BEFORE you build it. </p><p>You'll learn from an expert how successful companies have created innovative products that maximize revenue.<br></p>  <p>  \t <strong>You'll learn this and more:</strong>  </p>  <ul><li>How to create the ideal business model for your product</li><li>How to find your first customers</li><li>A dozen different ways ways to monetize your product</li><li>How to choose the best price that doesn't leave money on the table</li><li>How to test different pricing models on a budget</li></ul>        <p>The right business model and pricing strategy makes the difference between a lackluster product with mediocre results and a product that is exciting, profitable, and successful.<br></p>  <p>  \t         This course is taught by a product development expert who has helped define, price, and launch award-winning products now generating over $500 million in annual revenue.  </p>  <p>  \t         Business expert Jim Semick from ProductPlan<strong> shows you how to discover and launch the best business model for your product including setting a price that supports a profitable business. </strong>  </p>  <p>  \t         You'll get  real-world, first-person examples of how business models are created and how products are priced.  </p>  <p>Take this course now and start learning today how to get your product on the right track!  </p>", 
    "end_date": null, 
    "title": "How to Launch a Profitable Product: From Idea to Revenue", 
    "price": 0, 
    "instructors": "Jim Semick", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/16567_4343_17.jpg", 
    "course_url": "https://www.udemy.com/business-model-and-pricing-strategy/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-04-19T03:31:19Z"
}