{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Do you want to learn easy steps to writing a book, publishing your book and making money from the sale of your book? </strong> You are in the right place because this high quality and interactive course by Louise Anne Maurice of 90 Day Guru E-Learning was created for you and <strong>recently updated April 1, 2016.</strong><br></p>\n\n<p><strong>How to Write a Book: How to Self Publish a Book Sell Books is for you if:</strong></p>\n\n\n\n<ul><li>You see the <strong>money making and marketing potential of writing a book</strong> but you want the best step-by-step guidance for how to get started writing a book.</li><li>You want <strong>book writing best practices, book writing templates and simple writing formulas for writing a non-fiction book</strong> and have already been tested and proven to work.</li><li>You would like <strong>free and simple ways to get your book published quickly and easily</strong> so that you can use it as a marketing tool to boost your current business.</li><li>You would like to know how you can <strong>self publish a book without spending thousands of dollars.</strong></li><li>You are ready to develop a <strong>simple marketing plan to easily sell books online.</strong></li><li>You are committed to following through with what you're about to learn.</li></ul>\n\n\n\n<p>**************************************************************************************************************</p>\n\n\n\n<p><strong>Why take How to Write a Book, How to Self Publish a Book and Sell Books?</strong></p>\n\n\n\n<ul><li>This is why you are here because you want to know <strong>how to write a book, get that book published and sell that book in the shortest amount of time</strong> without it costing you a small fortune.</li><li>The best part is; every piece of advice, strategy and <strong>logical approach to book writing, book publishing and book sales has been tested;</strong> none of this is theory.</li></ul>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong>What is covered in How to Write a Book, How to Self Publish a Book and Sell Books?</strong></p>\n\n\n\n<ol><li>Learn inside tips to making the most of this course so you write your books, publish your book and sell your book in the shortest amount of time possible.</li><li>Insider tips for how to write a good book. You get our writing a book plan, complete with book writing template plus tips on how to write books titles so you can write a book that sells.</li><li>Discover how to publish an ebook and how to publish your own book plus receive hands-on step-by-step guidance that shows you exactly what to do at every stage of the publishing process.</li><li>Step-by-step guide on how to sell books, how to market your book and how to sell books online</li><li>Walk away with a clear understanding of book cover design plus a completed book cover for your book using free online resources.</li><li>Receive book coaching and consulting that guides you through the obstacles that stop most people from writing a book and helps you connect with your writing genius</li><li>Follow a simple formula for book writing, book publishing and book sales that you can follow and implement for ongoing success as an Author.</li></ol>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>How does How to Write a Book, How to Self Publish a Book and Sell Books benefit you?</strong></p>\n\n\n\n<ul><li>I understand how to write a book that sets you up for success. I became a <strong>self-published Kindle Author</strong> in 2013. I have written several books that not only sell online but market the other aspects of my online business without me doing any work.</li><li>In this course, you learn the exact steps you need to know to <strong>write a good book in a short amount of time.</strong> </li><li>You receive a <strong>book writing formula</strong> that you can follow for success.</li><li>You get <strong>self publishing and book sales insights</strong> that only a professional with my background can give you.</li><li>You get the inside track on what you need to do to <strong>succeed online as an Author </strong>plus what you need to do to follow through.</li><li>If that's something you would like to achieve, you have selected the right course to take. If you complete this entire course and implement everything you learn you <strong>will have a completed published book with a marketing plan that you can follow to sell those books online.</strong> </li><li>Remember, it doesn't matter if you are new or already in full swing, I've been there and I can show you exactly what you need to do to make it happen.</li></ul>\n\n\n\n<p>***************************************************************************************************************</p>\n\n\n\n<p><strong>When Can You Take </strong><strong>How to Write a Book: How to Self Publish a Book Sell Books?</strong><strong></strong></p>\n\n\n\n<p>What are you waiting for? If you’re looking for a course to learn how to write a book, how to self publish a book and how to sell your book, then look no further.</p>\n\n\n\n<p>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</p>\n\n\n\n<p>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; <strong>NO EXTRA COST TO YOU.</strong></p>\n\n\n\n<p><strong>REMEMBER</strong>: If you are not completely satisfied, you can get a full money back refund, so long as you request it within 30 days of purchase – No questions asked.</p>\n\n\n\n<p>Click on the <strong>\"Take This Course\"</strong> button and start learning instantly</p>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p>Still not convinced? Make sure you watch some of the <strong>FREE PREVIEWS</strong> available to learn more about the course and more about me your instructor. Plus you can check out some of the reviews. Here is just one of the many examples:</p>\n\n\n\n<p><strong>What people are saying about How to Write a Book: How to Self Publish a Book Sell Books created by Author Louise Anne Maurice of 90 Day Guru E-Learning:</strong></p>\n\n\n\n<p><em>\"Comprehensive yet Easy to Understand - So much value included in this course. The easy book writing template helped me write my book and the self-publishing lectures where I got to look over your shoulder made it so easy to understand what to do. I enjoyed the book marketing section the most because I am not a sales person but I realize with your simple book marketing plan that I don't have to be - thanks!\"</em></p>\n\n\n\n<p>*****************************************************************************************************************</p>", 
    "end_date": null, 
    "title": "How to Write a Book How to Self Publish a Book Sell Books", 
    "price": "20.00", 
    "instructors": "90 Day Guru® E-Learning, Louise Anne Maurice", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562638_92ad_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-a-book-how-to-self-publish-a-book-sell-books/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T13:49:27Z"
}