{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><strong></strong></strong></p><p><strong><strong><strong>\"I turned over more than $500,000 this financial year and I did it by following all of my own advice presented in this course\" - Ben Kumanovski, Course Instructor</strong></strong></strong></p><strong><br></strong><p><strong><em class=\"redactor-inline-converted\">Financial </em><em class=\"redactor-inline-converted\">Success in the Creative Industries is finally within your reach - if you take this course.</em></strong><br></p>\n\n<p>  \t<em class=\"redactor-inline-converted\"><strong>Most people in the creative industries are struggling to live making only a tiny $40k per year. </strong></em>  </p>\n\n<p>  \t            But you can do something about it. If you're a creative person, passionate about your work but wish you could be paid more for it then this is the course for you.  </p>\n\n<p>  \t                            In this course, I'll show you how I earn more than triple the average income as a video producer. I'll show you the best way to set up your creative business, how to save money on tax and how to sell your creative services to big business clients who pay tens of thousands of dollars for you to produce their work.  </p>\n\n<p>  \t            Every year thousands of students graduate from creative courses like film production, graphic design and web design and there simply aren't enough jobs for everyone. In this course you will learn how to leap frog your competitors and build your own creative business so that you can be paid a better, bigger salary than would be possible if you were to settle for 9:00 to 5:00 employment. I'll take you through master sales techniques, portfolio building, marketing your creative business, where to look for clients, how to handle new customer enquiries, how to present yourself to win business, how to write effective quotes that will give you the best chance of getting the job, how to manage a budget once you get it and much more.  </p>\n\n<p>  \t                            This is the information I wish I had access to when I was starting my video production business. With this information I'd have avoided many mistakes and been on the road to a successful creative business years sooner. If you're serious about making it in your chosen creative industry, then this is the information you need.  </p>\n\n<p>  \t<strong>Give yourself your best chance for success in your chosen creative industry by enrolling in this life-changing course now.</strong>  </p>\n\n<p>  \t  This course is packed with information you will use for the rest of your career. A small investment to make for a lifetime of success.  </p>\n\n<p>  \t  Every moment you delay is literally costing you the opportunity to increase your income. Simple as that.  </p>\n\n<p>  \t<strong>Invest in this course now</strong>.  </p>\n\n<p>  \t  The price of this course is nothing for the information that you will literally use for the rest of your career. How much is your future career worth to you?  </p>\n\n<p>  \t                            Plus, if you're still not sure there's a 30 day absolutely no questions asked full money back guarantee - my personal promise of your happiness and satisfaction! You really cannot lose!  </p>\n\n<p>  \t<strong><em class=\"redactor-inline-converted\"><br>  \t</em></strong>  </p>\n\n<p>  \t<strong><em class=\"redactor-inline-converted\"><br>  \t</em></strong>  </p>", 
    "end_date": null, 
    "title": "How I triple my income as a video producer & how you can too", 
    "price": "30.00", 
    "instructors": "Ben Kumanovski", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392914_7807_6.jpg", 
    "course_url": "https://www.udemy.com/how-i-make-300000-as-a-video-producer-how-you-can-too/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T10:42:18Z"
}