{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are you thinking about starting a new business?</strong><span></span></p><p><strong>Have you just started a business and want to know what to do next?</strong></p><p><strong>Do you have an existing business and need to outsource some tasks to external consultants?</strong></p><p><strong>Do you want to streamline your existing business or set it up in the \"cloud\"?</strong><br></p><p>If any of these apply to you, then this course is perfect for you!  This course is a \"how to\" guide for setting a new business up from scratch.  We will walk through step by step how to turn that business idea in your head into an actual company and go through important considerations to think about along the way.</p><p>This course is a mixture of presentations and exercises.  In our exercises, we will create a sample business from scratch.  This includes the following:</p><ul><li>Looking up various business names to check if we can use them</li><li>Registering our business through a legal website</li><li>Purchasing and registering a domain name</li><li>Registering a \"Doing Business As\" name</li><li>Setting up Accounting Software</li><li>Setting up Productivity Software</li><li>Setting up Business Class Email</li><li>Setting up Filesystems and Backups</li><li>Setting up Business Telephony</li><li>Creating and Finding Document Templates</li><li>Designing and Documenting Business Processes</li><li>Setting up a Customer Relationship Management system</li><li>Choosing Stock Photos</li><li>Building a Website From Scratch</li><li>Creating a Pay Per Click Online Marketing Campaign</li><li>Setting up Social Media</li><li>And More!</li></ul><p><br></p><p>With today's business services and technology in the \"cloud\", it never been easier to setup and organize your business effectively - but there are so <strong>many</strong> choices, and it is confusing! Don't worry about the technology - this course is targeted for all users - you do NOT need any background in legal, business, IT, or accounting.  I'll show you which business services to pick and the correct way to configure and use them.  The only thing you need is the <strong>desire</strong> to turn your business dreams into reality!</p><p>This course will save you time and significant <strong>money</strong> by allowing you to either:</p><p>A. Learn how to do common business setup tasks yourself by following our step-by-step exercises</p><p>--or --</p><p>B. Understand the details and language behind a business task that you are planning on outsourcing.  This will drive down the total cost of the task from your external party as well as improve the quality of the final output by allowing you to ask the correct questions and define the project more accurately.  The cost of this course is a fraction of the cost getting something wrong with an external consultant.</p><p>Please look through the course curriculum to see all the topics we will cover.  Thank you for your time and let's get your business up and running <strong>today</strong>!</p>", 
    "end_date": null, 
    "title": "How to Setup Your New Business From Scratch", 
    "price": "25.00", 
    "instructors": "Ed Wong", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543698_817f_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-setup-your-new-business-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T02:01:30Z"
}