{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are You An Author Who Doesn't Have Time to Publish Enough Books to Make a Substantial Income?</strong></p><p><strong>Want to be a Book Publisher But You Don't Have the Skills to Write in Every Genre?</strong></p><p>My name is Charity Cason, and I'm a bestselling author and ghostwriter with years of experience ghostwriting for clients all over the world. I also run my own team of ghostwriters who have worked with my own clients for the last several years.</p><p>I get a lot of questions about how to best work with ghostwriters in a way that will help authors get more books out faster, so this course was created to answer those questions!</p><p>If you've ever wondered things like:</p><ul><li><strong><em>How do I find a ghostwriter?</em></strong></li><li><strong><em>What kinds of things does a ghostwriter do?</em></strong></li><li><strong><em>What kinds of forms do I need to protect myself?</em></strong></li><li><strong><em>What should I expect from my ghostwriter?</em></strong></li><li><strong><em>How much should I pay a ghostwriter?</em></strong></li></ul><p>... then this course is for you!</p><p>I answer all of these questions and MORE in this course. When you're finished, you'll know how to find ghostwriters, test them, hire them, work with them, pay them and more.</p><p>Click the <strong>TAKE THIS COURSE</strong> button to get started building your publishing empire!</p>", 
    "end_date": null, 
    "title": "How to Work With Ghostwriters In Your Publishing Business", 
    "price": "20.00", 
    "instructors": "Charity  Cason", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/781526_9024_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-work-with-ghostwriters-in-your-publishing-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-03T21:32:27Z"
}