{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t            If you&#039;ve ever wanted to start an online business or sell existing products online You should take this course.  </p>  <p>  \t<strong style=\"\">No experience required.</strong>  </p>  <p>  \t            I will show you <strong style=\"\">step-by-step</strong>, how to create your own beautiful online store with Shopify to sell any physical or digital products. I will also teach you how to source products and use your own designs to manufacture and and start a t-shirt business with <strong style=\"\">ZERO inventory!  </strong>  </p>  <p>  \t            Everyone has thought of starting their own online business and there is no better place to start than t-shirts. We walk students through the theory and application behind your options in t-shirt manufacturing, and even show you how to <strong style=\"\">create a t-shirt with a design</strong> on it and have it available for sale online immediately upon completing the course.  </p>  <p>  \t        For your business to succeed, you need to have an amazing online presence because of the impact it can have on a potential customers buying decision.  </p>  <p>  \t        Unfortunately, a lot of people think they have to pay web designers, developers and business consultants a ton of money to make their dreams come to life.  </p>  <p style=\"\">  \t<strong style=\"\">The good news</strong> is that you can do everything that you need to start an online business or selling t-shirts yourself. I&#039;ll show you how in this course.  </p>  <p>  \t            By the end of this course you’ll be able to:  </p>  <ul style=\"\">  \t<li>Create a store on Shopify</li>  \t<li>Source manufacturers and designers for a t-shirt business</li>  \t<li>Customize your store’s payment options</li>  \t<li>Create a blog for your online store </li>  \t<li>Set up taxes</li>  \t<li>Add and manage products in your store</li>  \t<li>Create and manage product categories</li>  \t<li>Manage the orders placed by your customers</li>  \t<li>Offer your customers discounts</li>  \t<li>Add more functionality using the Shopify app store</li>  \t<li>Market your business and products online</li>  \t<li>Sell T-shirts online with On Demand Merchandising through the Merchify app</li>  </ul>  <p>  \t            Take this course, and start your very own t-shirt business!  </p>  <p>  \t            Note: there&#039;s a 30-day money-back guarantee.  </p>", 
    "end_date": null, 
    "title": "How to Start An Online T-Shirt Business Using Shopify", 
    "price": "20.00", 
    "instructors": "Skills  Learned", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383258_34ef_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-an-online-business-selling-t-shirts-on-shopify/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T17:58:15Z"
}