{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course you will receive 4 different frameworks that you can use to develop your very own personal and individual elevator pitches. No one method is right for everyone, you choose the elements that best suit your personality and style and build from there.</p>  <p><strong>What is an \"elevator pitch\"?</strong></p>  <p>An elevator pitch is a hook designed to gain intrigue followed by interest by providing a basic introduction to whatever you are have to offer be that, you, your product, your service or your offering. </p>  <p>An \"elevator pitch\" is a succinct, carefully planned, and well-practiced message about your professional self that your grandmother should be able to understand in the time it takes to go from the ground floor to the 15<sup>th</sup> floor in an elevator.  </p>  <p>It should be of interest and last no longer than 60 seconds; the words should resonate with your unique personality and interests and most importantly of all make you memorable and different for all the right reasons.</p>  <p>This course gives you the <strong>skills </strong>and <strong>confidence </strong>to make a great first impression every time you deliver your personalised and carefully crafted elevator pitches. As you gain in confidence you will create more pitches specific for different situations and people you meet enabling you to appeal to the best people around, at every you event you attend.</p>  <p>In over 20 years of business I have seen the good the bad and the very ugly when it comes to elevator pitches, I know how to excite and connect with frameworks that work. </p>  <p>This course is an introduction to the world of communication, talking to strangers is not something we all find natural, when its prepared and professional we can be our true confident selves.</p>", 
    "end_date": null, 
    "title": "How to deliver memorable Elevator Pitches everyday", 
    "price": 0, 
    "instructors": "Mike Pagan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/719322_924e.jpg", 
    "course_url": "https://www.udemy.com/how-to-deliver-memorable-elevator-pitches/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-07T07:42:44Z"
}