{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        If you&#039;re an entrepreneur, you know that time is valuable. Quite literally—time is money.<br>  \t<br>  \t        In this course, you&#039;ll learn how to set business goals that will save you oodles of time by learning smart goal setting that is measurable, time-oriented, methodical, and data-driven.<br>  \t<br>  \t        Goals are one of the fundamentals of effective business. Although everyone sets them, most don&#039;t set them in a way that will guide them to achievement.<br>  \t<br>  \t        Smart goal setting takes goals from vague desires to well-thought-out, calculated goals that are reachable and driven by success of short-term goals.<br>  \t<br>  \t        After we go over the essential parts of developing a smart goal, you&#039;ll download a spreadsheet and be walked through setting a 12 month goal, while breaking it down into meaningful stepping stones that will map out the road to accomplishing it.<br>  \t<br>  \t        Goal setting is important, but it&#039;s only half of the equation. If you don&#039;t have the right tools to stay motivated and hold yourself accountable, you run a high risk of failure.<br>  \t<br>  \t        After setting your 12 month goal, we&#039;ll explore 5 methods to stay motivated and hold yourself accountable.<br>  \t<br>  \t        In this course, you will learn:<br>  \t<br>  \t        • How to identify goals that are ambitious, but reachable<br>  \t<br>  \t        • How to use data and research to determine time frames and measure progress<br>  \t<br>  \t        • How to use the 3 essential parts of a smart goal<br>  \t<br>  \t        • How to work backward and set short-term goals that work toward a long-term goal<br>  \t<br>  \t        • 5 Methods to stay motivated and hold yourself accountable with examples of how to execute; including peer-to-peer mentorship, forming routines, and staying hyper focused.<br>  \t<br>  \t        Once you master these skills, you&#039;ll be able to move toward the success of anything you want to achieve with all the right tools and confidence that you&#039;re on the right path.<br>  \t<br>  \t        I&#039;m always available to help you in setting and reaching your business goals. Get started!  </p>", 
    "end_date": null, 
    "title": "How to Set Business Goals That Work", 
    "price": "20.00", 
    "instructors": "Dustin Lien", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303222_10d0_3.jpg", 
    "course_url": "https://www.udemy.com/smart-goal-setting-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-18T21:46:08Z"
}