{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Join over 1,000 students from 92 countries learning <em>how to be a consultant </em>and leaving the drudgery of employment behind! This highly rated, information-packed course will help you decide if consulting is right for you, and teach you how to successfully start a consulting business. </p><p>For the past 18 years I have been a consultant who has created 6 highly profitable consulting businesses in many different fields. </p><p>My consulting career has enabled me to:</p><ul><li>Live where I want to live</li> <li>Work from home and not commute</li> <li>Do work that I love </li> <li>Do work that has meaning</li> <li>Balance work and leisure</li> <li>AND<em> <em>make a great income</em></em></li></ul><p>This course is not based on theory. It is born of real world experience gained from years of consulting. By spending about 90 minutes in this course you will have a crystal clear understanding of how to be a consultant including the following:</p><ul><li>Whether or not consulting the right career option for you</li> <li>What the risks of starting a consulting business are, and how you can successfully manage those risks</li> <li>How to set up and run your own consulting business</li></ul><p>This class also includes the following powerful resources for your use to help you become a consultant:</p><ul><li>A proven tool to identify the kinds of work you are passionate about</li> <li>Step-by-step instructions on how to use Google to determine if there is demand for your consulting services, and exactly how to position yourself in the marketplace</li> <li>A spreadsheet that will enable you to calculate your financial runway for launching your consulting business, and how to manage the finical risk involved</li> <li>How to acquire the skills you need to deliver your services with excellence</li> <li>Links to 55 organizations of consultants that you can team up with to get your business off the ground</li> <li>Actual templates for all the documents you need to successfully run your consulting business </li> <li>And much, much more!</li></ul><p>Don't let fear of the unknown stop you from pursing a rewarding career in consulting. You have my personal guarantee that this course will help you make the leap or you can get a full refund from Udemy. Overcome your fears and set sail toward a bright future by enrolling in this outstanding course on <strong><em>how to be a consultant!</em></strong></p>", 
    "end_date": null, 
    "title": "How to be a Consultant: A Simple Plan for Consulting Success", 
    "price": "30.00", 
    "instructors": "Tom Kuthy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483794_2283_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-consultant-a-simple-plan-for-consulting-success/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T23:11:40Z"
}