{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  In this Course, you will learn how to Avoid 25 Common Small Business Startup Mistakes Entrepreneurs make.  If you fee that your business seems not performing up to your expectations, most probably you already made one of more of these Expensive Mistakes in your business.  <br style=\"\">  \t<br style=\"\">  \t  Whether you plan to start a new business or running an existing business, this tutorial will help you to overcome all those hurdles and Make Your Business Grow By Avoiding those Common Pitfalls.  This Course is developed for Small Business owners and Startups.<br style=\"\">  \t<br style=\"\">  \t  According to a recent study by Bloomberg, 8 out of 10 entrepreneurs who start a business fail within the first 18 months. Meaning, a whopping 80% will be out of business within the first 2 years.  By learning what mistakes lead others to fail can greatly improve upon your success.<br style=\"\">  \t<br style=\"\">  \t  You will Learn how You can avoid mistakes, reduce, manage or resolve them by taking action at the right time.  By implementing the strategies given here, you can take your Business into a New level.  This is your chance to join today for a very special price.  Take action Right Now - Enroll in this Course.  </p>  <p>  \t[Course created by Ali Anjamparuthi.  Graphics designed by Sajeena Ali.  Voice over by Matt Loft]  </p>", 
    "end_date": null, 
    "title": "How to Avoid Small Business Startup Mistakes", 
    "price": "20.00", 
    "instructors": "Ali Anjamparuthi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420240_7304_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-avoid-small-business-startup-mistakes/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T14:40:14Z"
}