{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          Whether you have been laid off from work, your job made redundant,  experienced pay cuts, declared bankruptcy, seeking employment, want to  start up a new business venture, or are simply wanting to improve your  current financial situation, this course will <strong style=\"\">SHOW YOU HOW</strong>.  </p>  <p style=\"\">  \t                This course shows <strong style=\"\">PROOF OF SUCCESS</strong> from my own life.  </p>  <p style=\"\">  \t                What will this course give you:  </p>    <strong style=\"\">The EXACT formula</strong> and vehicles that I used to create an income from scratch numerous times after losing it all TWICE in my life.<p>Exact instructions as to how you can apply these 8 steps in your life as well.</p><p>Show you what the biggest lie is which is handed down to us and how it steals your wealth at all levels.</p><p>Reveal to you the <strong style=\"\">SECRET SAUCE</strong> which makes things happen when engaging with people.  Give you <strong style=\"\">PRACTICAL</strong> examples and opportunities to start creating an income within hours.</p><p>Teach you about the value of combined income models and the use of <strong style=\"\">asset based income</strong> with a small budget.</p><p>How to <strong style=\"\">make money</strong> by building websites for profit.</p><p>Learn how to trade the <strong style=\"\">Stock, Futures and Forex</strong> exchanges.<br style=\"\"></p><p><strong style=\"\">Unlock the power of effective frequency</strong>. Grow almost any business for less than the cost of a family breakfast per month.<br style=\"\"></p><p>Show you <strong style=\"\">how to raise funds</strong> for your business, projects or campaigns without approaching banks, investors or finance institutions.  </p><p style=\"\">  \t                After losing everything twice in my life within 7 years, I learned the hard way how to regroup and recoup my life and finances.</p>  <p style=\"\">  \t                My practical experience and proven track record will act as a guide for students who wish to quickly create an income, or make money at a faster pace  </p>  <p style=\"\">  \t        This course can be completed in a few days, and you can take away a fair amount of value. But that being said, the real value is to be found by taking the steps and embedding the principles in your life for the long term. And the longer you stick to it, the more you will benefit.<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "How I created income in 8 steps from nothing: You can too!", 
    "price": "20.00", 
    "instructors": "Mr Connie Muller", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424220_2c75_2.jpg", 
    "course_url": "https://www.udemy.com/make-money-faster-with-these-8-steps-plus-the-secret-sauce/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-16T19:54:16Z"
}