{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you are looking to make money selling products at street fair, festivals and craft shows, you can't afford to miss this...</p>  <p>This is a complete step-by-step for anyone interesting being a vendor, selling products and making money at street fairs, festivals, craft shows or any event. If you make your own products, you'll learn how to sell more. Also, don't worry, if you don't make your own products, you can still make money as a vendor. I'll share with you little know secrets how to source products and resell them.</p>    <p>You see, for the last 8 years my company has been a festival vendor at countless fairs, festivals and craft shows throughout Michigan and beyond. During the busy summer months, my team and I attend 3 - 5 festivals each month selling our products. </p><p>During the colder fall, winter and spring months we attend indoor events at local schools, food and wine festivals, trade shows, office buildings and even hospitals. So no matter the location of the of the event, time of year or the product your selling, this course is for you.<br></p>  <p>I've only included battle-tested strategies that work in the real world, with real customers to make real money and lots of it. The information in this course has been tested and refined to deliver maximum results and maximum profits. </p>    <p>Selling at an event is an amazing experience. The reason is simple, thousands of people, who are eager to spend money, attend festivals. fairs and craft shows looking for unique products. On any given day, you’ll have countless people stopping by your booth, talking with you and buying your product. </p><p>We’ve attended events like the 3-day  Allen Park Street Fair in Allen Park, Michigan with over 250,000 attendees and the very next day we are at a local hospital selling our products to doctors and nurses. </p>    <p>In addition, I was also a featured breakout speaker teaching the information in this course at the Michigan Festival and Events Association annual meeting. This is a 2-day event to learn best practices on making money at street fairs and festivals.</p>", 
    "end_date": null, 
    "title": "How to Succeed at Street Fairs, Festivals, & Craft Shows", 
    "price": "30.00", 
    "instructors": "Andy LaPointe", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700084_1a42.jpg", 
    "course_url": "https://www.udemy.com/how-to-succeed-at-street-fairs-festivals-and-craft-shows/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T16:30:44Z"
}