{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Have you got an idea for a business but don't know how to make it happen?</strong></p><p>That is a common problem for millions of first-time entrepreneurs, and I am here to help you! In this no nonsense course I walk you through every step of the way on how to turn your idea into a company in the modern business world of 2016. There is not a second wasted in this course, as we get straight to the <em>important</em> stuff.<span></span></p><p><strong>Why take this course?<br></strong></p><p>By taking <em>this </em>course you'll learn quickly and bypass all the unnecessary business jargon that many courses spend hours on. Time is the most valuable resource for you and I both, so we will get straight to it in a friendly, fast paced manner.</p><p><strong>What will you get from this course?</strong></p><ul><li>A real business ready for customers!</li><li>Knowledge about the basics of business.</li><li>A repeatable method to convert future ideas into businesses. </li><li>BONUS: Access to The Exceptions entrepreneur network for free!</li></ul><p><strong><br>How is this course structured?</strong><br></p><p>This course takes you step by step from start to finish. From the idea, to the business model, marketing, legal, strategy, raising money and more. All presented in straight-to-the-point, easy to watch videos.</p>", 
    "end_date": null, 
    "title": "How to Start a Business: Ultimate Guide from Idea to Income.", 
    "price": "20.00", 
    "instructors": "Mitch Hills", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/704316_d392_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-business-ultimate-guide-from-idea-to-income/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-23T01:50:48Z"
}