{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>UPDATED May 13 2015</p><p><strong>How to spare yourself months of frustration and save yourself $1000s of dollars.</strong></p><p>Why am I in any position to teach you this? I've been planning and building profit focused web sites for my clients for over 15 years. I am a web designer by trade. Most of my business comes from referrals... I really don't pound the pavement or do cold calling at all… Happy customers and referral partners just keep sending me more people. I think that says a lot about the way my customers appreciate the knowledge I bring to the web design and marketing process.As of April 20th,2015 this course INCLUDES the 159-page companion PDF e-book for e-readers and kindles.</p><p><em>TESTIMONIAL: This course will pay for itself many times over</em></p><p><em>I began using Jaeson Tanner's service to design websites for my customers 15 years ago. When I started my own book publishing business Jaeson did all of our website work and helped build great websites and drive traffic to increase the sales of our books. Jaeson was always ahead of the curve on the technology that was necessary to make our websites successful and he constantly suggested ways to keep our sites fresh and build new users and customers.</em></p><p><em>This course taps into that creativity and Jaeson's immersion in the technology to allow students to make the best of their websites. It's easy to put up a quick and inexpensive website, but if no one visits it then it is not an effective use of a businessperson's time or money. With websites becoming an increasing part of a company's marketing and customer service and contact they are critical. I speak from my years of experience benefiting from Jaeson's expertise that your investment of time in this course will pay for itself many times over.</em><strong><em></em></strong></p><p><em><strong>CAM MATHER-----</strong></em></p><p>So what are we going to cover?</p><p>Listen: there are three really BIG obstacles between you and the completion of a profitable web site for your business.</p><p>Correct customer targeting , thoughtful and complete web site planning, selection of an ideal web site designer.</p><p>So lets go through those one at a time….</p><p>Correct Customer Targeting: Without knowing how to do proper customer targeting, marketing your business is going to be nearly impossible. It will feel like selling ice to Eskimos. Our course teaches you what you need to know.</p><p>Thoughtful and complete web site planning: What content should you have on your web site? What should my focus be? Almost every new customers I get wants to throw spaghetti. You know throw everything at the wall and lets see what sticks. They want to include every possible message for every possible prospect. That's exhausting and it doesn't work. So what pages should you include? What about blogging? Who has time for that? What do I have to do to turn visitors into customers?</p><p>Finding the right web designer: This will make a HUGE difference in the end product. Learn to select a marketing focused web designer who will...</p><ul><li>pay for themselves</li><li>act in a respectful and responsive way</li><li>work well with you and your people</li><li>bring you new, targeted clients</li></ul><p>A web design company might pitch their services to hundreds of companies in the course of a year. They are well-practiced and know exactly how to put their best foot forward. What about you? How many web design companies have you met with and evaluated? One? Two? None?</p><p>I REVEALS the essential planning and groundwork you should have completed BEFORE you start evaluating web designers so the TAIL IS NOT WAGGING THE DOG. You should be running the show not your web site company. </p><em><em>TESTIMONIAL: </em> What You Need to Know About Hiring a Web Consultant</em><em></em><p><em>If you're a business person who needs a web site, but aren't sure what is involved, then this course will help you define the specifics of what you need. For this alone it earns five stars.</em></p><p><em>If you are a hands on type who wants to build a web site for your business it's probably a good idea to view this course so you know what you're getting into. It's not as easy as some commercials would have you believe--not if you want a successful web site. For this it also deserves five stars.\" - Richard Brassaw</em></p><p>---</p><p>New web sites are being constructed ever moment of every day.</p><p>Focused profitable web sites are rare. This is because they require very specific thinking to be created. Will yours be one of them?</p><p><em>TESTIMONIAL: \"My name is Marc Didemus and I'm Sales and Marketing Manager of Image Advantage Solutions Inc. Jaeson Tanner has been doing our web design for about the last 15 years. I have attended this on-line course and found it to be spot on. All of the things that you need to know to have a proper web site built are addressed in this course. It's a must for anybody looking at creating a new website and also very helpful for owner of mature websites.\" </em><em>MARC DIDEMUS</em></p><p>---In this course you will learn to...</p><ul><li>Plan your web site with profit focus• Identify your web sites primary goals</li><li> Make sure your marketing message is grounded in reality• Plan the structure of your site </li><li>Develop a professional RFP (request for proposal) WE INCLUDE A COMPLETE SAMPLE</li><li>Interview web designers effectively without forgetting a single detail so they can be held to their promises.</li><li>Make sure you get EXACTLY what you want instead of being steered into a high margin, off the rack or cookie-cutter product.</li></ul><p>This course is broken into small sessions designed to completely prepare you for what's ahead. We have NOT used confusing terminology to explain things. If we do use a term you're not likely to know we explain it so everything makes sense.</p><p>Spare yourself the inevitable frustration of delayed production, misunderstandings and confusion. Taking this course is going to save you so much frustration. </p><p>We're offering a 30 day money back guarantee. Honestly if we haven't transformed the way you think about building a web site then we'll refund you, no questions asked. You've got nothing to lose here folks. </p><p>By the end of the day hundreds of web sites will be launched. Not all of them will be focused and not all of them will be profitable. Yours can be with the RIGHT TRAINING, the RIGHT FOCUS and the RIGHT ACTIONS!</p><p> Enrol in the course TODAY! </p>", 
    "end_date": null, 
    "title": "How to Plan a Web Site That Attracts Cash", 
    "price": "20.00", 
    "instructors": "Jaeson Tanner", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470226_1314_7.jpg", 
    "course_url": "https://www.udemy.com/save-1000s-of-dollars-by-hiring-the-right-web-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T21:05:50Z"
}