{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      This course is for any entrepreneur ready to launch their small business. Whether you&#039;re a freelance graphic designer, marketing consultant, or you’re selling your small batch jams to the world, the foundations of running a small business are the same: you need apps and technology to support your operations so you can focus on delivering great client service and products. Don’t miss out on new business opportunities or waste time and money searching for the right tools. Instead, take this class and get all the information you need in one place!  </p>  <p>  \t      This course offers step-by-step instructions on how to set up and use the best apps and technology available for small business owners:  </p>  <ul style=\"\">  \t<li>Starting from the foundations, you&#039;ll build a website, set up your business email, calendar, and file storage tools.</li>  \t<li>Next, you&#039;ll learn how to manage small business accounting, making sure you&#039;re always aware of the financial health of your business.</li>  \t<li>You&#039;ll learn to track and follow up on prospective customers and leads, making sure you&#039;re always focused on business development.</li>  \t<li>Small business owners are busy, so having a solid task management process is critical. You&#039;ll learn the best way to track and review all the to do items on your plate.</li>  \t<li>Next, you&#039;ll dive into promoting your business via online marketing (ex. blogging) and social media. You’ll learn the most efficient way to source, plan, and push out new content to your audience so you’re seen as an expert in your field.</li>  \t<li>Last but not least, you&#039;ll learn tools that are designed to make you faster and more efficient at doing your work. </li>  </ul>  <p>  \t      Take this course now and make your business run like a well-oiled machine.  </p>", 
    "end_date": null, 
    "title": "How To Start A Business Using The Best Apps", 
    "price": "50.00", 
    "instructors": "Vicky Cassidy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/232840_e6ac.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-business-using-the-best-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-29T12:56:55Z"
}