{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tY<span style=\"\">ou’ll have a fistful of very specific, very effective techniques to make more money- starting today!</span>  </p>  <p style=\"\">  \t<span style=\"\">This course was created to guide you on how to make more money and grow your business in the next 90 days.</span>  </p>  <p style=\"\">  \tA how-to guide on growing a business that allows you to profitably live your life with more freedom.  </p>  <p style=\"\">  \tThis course is designed to save you months even years of unnecessary failure and significantly accelerate your success by giving you fast, accurate, stripped-down, no-nonsense information on how to make maximum money in your business in minimum time.  </p>  <p style=\"\">  \tInside this course, here are a few things you will learn:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t·How to increase profitability in 90 days or less  \t</p>  \t<p style=\"\">  \t\t·How to grow your business immediately and earn thousands of dollars next week when you tap into a little known secret  \t</p>  \t<p style=\"\">  \t\t·How to create intense desire for your product/service regardless of your price  \t</p>  \t<p style=\"\">  \t\t·How to create more business than you can handle without spending anything on advertising.  \t</p>  \t<p style=\"\">  \t\t·How to convince your prospects to take action immediately  \t</p>  \t<p style=\"\">  \t\t·Multiple ways to dramatically increase your sales and profits  \t</p>  \t<p style=\"\">  \t\t·How to gain instant attention and credibility to increase sales  \t</p>  \t<p style=\"\">  \t\t·How to create and sell ‘must have’ products and services  \t</p>  \t<p style=\"\">  \t\t·The most profitable ways to set up a business that pays you even if you don’t work.  \t</p>  \t<p style=\"\">  \t\t·Discover the growth strategies, tools, resources and checklists to succeed regardless of the industry  \t</p>  \t<p style=\"\">  \t\t·And much more....  \t</p>  </ul>  <p style=\"\">  \tYou will get access to all this valuable information and more when you join this course  </p>  <p style=\"\">  \tIn order to start living your dreams and make more money in your business, you need to take this first step to your success.  </p>", 
    "end_date": null, 
    "title": "How to Increase Your Profits In Any Economy", 
    "price": "20.00", 
    "instructors": "Lindsay Gill", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365270_3fbd_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-increase-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-07T18:02:56Z"
}