{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">Why we decided to create this course?</strong></p><p>We work with startups on daily basis within our accelerator (StartupAkademia) and we have noticed that despite the tones of very good books on lean methods (i.e. Lean Analytics, Running Lean etc.) startups have problems with applying this knowledge in practice. We have noticed also some consistent problems that we felt needed more pragmatic solutions. First problem that we spotted was the fact that startups do not know how to do market research, spy on competition and analyze data. Second thing we have noticed is that, especially first time startups, do not really understand their business model (which is totally understandable). That&#039;s why, it is very difficult for them to know what they should concentrate on. Third problem, that probably was the biggest source of failure, was not sufficient creativity when it came to acquiring customers. Startups have no problems with naming (not always applying efficiently) how to acquire customers through ads (facebook, adwords, display ads) but they would have problems with finding the right set of non-standard, yet very efficient moves that would work on their market (you can call them growth hacks, tricks or simply tactics)</p><p>The interesting thing was that those problems were pretty universal regardless of the industry, business model or even whether they were ran independently or supported by big corporation.</p><p>So one day, to make our life easier (repeating the same staff on and on is not that fun ;)), we have decided it is time to create a tool that will help our startups and any other to get going faster and more efficient. We started with the do-it-yourself StartupAkademia (half of info is available also in English so go and check that). We have seen that this is still not enough so we proceeded to make on-line courses supplemented with simple yet very powerful tools. </p><p><strong style=\"\">What will this course give you?</strong></p><p>The course is a practical, step by step guide loaded with tones of simple tools that will help you significantly to speed up with your startup. There is little theory – mainly examples, a lot of tips from our own experience as well as other notable examples worth mentioning. Our intention is that thanks to the course you will know:</p><ol style=\"\"><li>what your business model is about, what to concentrate on and what are the key KPIs for you?</li><li>how to research your market, competition and your customers, draw conclusions from the data and apply it in your business?</li><li>what Minimal Viable Product (MVP) to choose and what it will give you, how much it may cost?</li></ol> <p>On top of that every moth we organize office hours for 5 startups (first come first served bases) during which startups get 30 minutes to ask as directly (phone, Whatsapp or Skype) for advices.</p><p><strong style=\"\">How the course is organized?</strong></p><p>The course is divided currently in 3 sections and will be adding new section to address other important issues. Currently you will find the following sections:</p> <ul style=\"\"> <li><strong style=\"\">Market research - effective and cheap - advanced version</strong>. In this section you will learn what kind of methods you can use to get to know better your customers and competitors</li> <li><strong style=\"\">Startup Business Models.</strong> At the end of the section you will have a good understanding of different business models, you will know what KPIs are important depending on the business and what you should concentrate on. You should also be able to guess to which business model your startup has biggest resemblance </li> <li><strong style=\"\">What should be the MVP of your business? </strong>In this section you will see some examples of MVP. We start with reminder what MVP is and then we move to examples for MVP for: restaurant, on-line store, off-line store, SaaS, books and others</li> </ul> <p>We will be adding also section on growth hacks and tricks used by others, increasing LTV of customers and section presenting business models in Excels so check our course regularly for upgrades.</p><p><strong style=\"\">You will be able also to download many additional resources</strong></p> <ol style=\"\"><li>Links to free presentations and movies showing examples of research </li> <li>Links to books worth reading</li> <li>Excels with calculations showing you how you can do the market research </li> <li>Excels with useful analysis showing you how you can draw conclusions</li> <li>Presentations of different business models and MVPs</li></ol>", 
    "end_date": null, 
    "title": "How to build cheaply and efficiently your startup?", 
    "price": "50.00", 
    "instructors": "Asen Gyczew", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450082_ca13_2.jpg", 
    "course_url": "https://www.udemy.com/startup-how-to-analyze-and-improve-it-with-simple-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T06:18:54Z"
}