{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The problem with most blogs is that they are not started with the right mindset. And that is why most blogs (about 95% of those that are started!) are abandoned.<br></p><p>Most bloggers start a blog not knowing why they start it for. Or they have wrong notions about blogging and business.</p><p>How bad is this problem? You start a blog with a dream. You have wrong notions. Your dream is not a realistic one.</p><p>You put all the effort you can to build this blog hoping it will make your dream come true. But as time passes, you find yourself in a position similar to working out on a treadmill.</p><p>You exert so much energy and do the walking, but you go nowhere. You are in the same place – and even worse – now you are so tired, hopeless, discouraged and want to quit, without making any progress.</p><p>See? This is how things go if you start a blog with the wrong mindset.</p><p>Your blog is just the backbone of your business and without it your business will not prosper</p><p>Your blog is the one that promotes your business, that acts as the funnel to attract prospects and customers to your business and helps build your brand and authority online.</p><p><strong>With the right kind of blogging, your business will thrive.</strong><br></p><p>The success of your blog is very crucial for the success of your business. And this course will help you build a blog that will actually serve the purpose. To be precise –</p><p><strong>This course will lay the perfect foundation for you to build a blog that will build your business 24×7.</strong></p><p><strong><strong>You will find that this course will hold your hand and walk you through the right path to blogging success.</strong><br></strong></p>", 
    "end_date": null, 
    "title": "How to start a blog with the RIGHT foundation and succeed?", 
    "price": 0, 
    "instructors": "Blogging Coach, Entrepreneur Jane Sheeba", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794286_0b4c.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-blog-with-the-right-foundation-and-succeed/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T01:26:11Z"
}