{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Have you ever wanted to write a book in a day? How about authoring an online course to sell? Do you like residual income, i.e. royalties?</p><p style=\"\">In this course you&#039;ll learn how to accomplish all three of these points; namely: (a) writing a book in five hours or less, (b) turning that book into an online course to sell, and (c) making sure you are set-up to earn residual income (royalties) that will continue to grow as you produce more content to sell on the world wide web.</p><p style=\"\">This course is for you if you want to work from home successfully as an eBook / book author and self-publisher and course creator. Most importantly though, this course is for you if you like to work fast, produce mountains of profitable content, and all while maintaining the <em style=\"\">highest quality standards</em> in everything you produce and sell online.</p><p style=\"\"><strong style=\"\">Some features of my system:</strong></p><ul style=\"\"><li style=\"\">You will barely have to edit your manuscripts.</li><li style=\"\">You will barely have to do research.</li><li style=\"\">Neither will you have to spend all day writing books nor fret over instructional design.</li></ul><p style=\"\"><strong style=\"\">You will learn how to:</strong></p><ul style=\"\"><li style=\"\">Write chapters everybody benefits from reading.</li><li style=\"\">Implement a first-class template system so you can write books faster than <strong style=\"\">FAST</strong>.</li><li style=\"\">Integrate quality standards in everything you do.</li><li style=\"\">Master English grammar in a flash.</li><li style=\"\">Be a better instructor.</li><li style=\"\">Be a better writer.</li></ul><p style=\"\">I created this system because I was tired of managing freelancers and having to relying on them to create eBooks for my Amazon Kindle publishing business. I was upset by the very low quality standards I was getting from these freelancers. My morals taught me there was a better way, and there is, and this is what you&#039;ll discover when you take my course. You are going to love this!</p><p style=\"\">I&#039;ll see you inside!</p>", 
    "end_date": null, 
    "title": "How I Make 1K+ Per Month Writing Books and Courses", 
    "price": "50.00", 
    "instructors": "Bryan Westra", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503640_a69f_3.jpg", 
    "course_url": "https://www.udemy.com/how-i-make-1k-per-month-writing-books-and-courses-in-5-hrs/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-16T08:14:46Z"
}