{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\">Finally, a Small Business Essentials course aimed specifically at Service Businesses.</em></strong></p><p><strong style=\"\"><em style=\"\">This course is packed with information you will use for the rest of your career. A small investment to make for a lifetime of success.<br style=\"\"></em></strong></p><p>Are you thinking about starting a small service based business?</p><p>Maybe you&#039;re already in business and you want to know how to better present, market and advertise your business.</p><p>Yes? Then this is the course for you. </p><p>In this course I&#039;ll show you how to successfully build and market your business using proven strategies that helped me take my service business from a complete start up to a successful operation. </p><p>I&#039;ll discuss things like </p> <ul style=\"\"><li style=\"\">How to handle new customer enquiries in a way that will give you the best chance of winning the job, </li><li style=\"\">How to perform in a meeting and leave the customer loving you,</li> <li style=\"\">How to present your business to gain customer confidence and make you really stand out from your competitors,</li> <li style=\"\">Marketing and advertising strategies that are specifically designed for service businesses rather than retailers of physical products, </li><li style=\"\">The value of a well designed website and how user experience translates into sales,</li><li style=\"\">How imperative testimonials and showreels are to your business,</li><li style=\"\">How to manage a budget to ensure you&#039;re always in the black,</li> <li style=\"\">A professional approach to quoting, that will give you the best opportunity with your customers, and</li><li style=\"\">Much, much more!</li></ul> <p>Plus I&#039;ll also dive deep into detail on the <strong style=\"\">hot topic</strong> of online video marketing and the <strong style=\"\">secrets</strong> of gaining better performance on YouTube that will help to skyrocket your business to success with your target audience.</p><p><strong style=\"\">This is the information I wish I had access to a decade ago when I was starting my business.</strong> </p><p>With this information I&#039;d have avoided many mistakes and been on the road to having a successful service business years sooner. Now it&#039;s available to you in a format that&#039;s been designed for easy consumption, with practical examples and strategies that you can implement into your business immediately.  If you&#039;re serious about being successful in your business, then this is the information you need.</p><p style=\"\">Give yourself your best chance for success by enrolling in this life-changing course now.</p><p style=\"\">Every moment you delay is literally costing you business opportunities. Simple as that. </p><p style=\"\">Invest in this course now. </p><p style=\"\">The price of this course is nothing for the information that you will literally use for the rest of your career. How much is your future career worth to you? </p><p style=\"\">Plus, if you&#039;re still not sure, there&#039;s a 30 day absolutely no questions asked full money back guarantee - my personal promise of your happiness and satisfaction! You really cannot lose!</p><p>So enroll now, and take hold of your future in business.</p>", 
    "end_date": null, 
    "title": "How To Build a Million Dollar Service Business", 
    "price": "20.00", 
    "instructors": "Ben Kumanovski", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448334_fb09_3.jpg", 
    "course_url": "https://www.udemy.com/successfully-build-and-market-your-service-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-16T05:17:10Z"
}