{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Question1: </strong></p>\n\n<p><strong><em>Can Entrepreneurship - Business Start-up - Freelancing be Taught? </em></strong></p>\n\n<p><strong>A</strong>: Yes! It must be done well. I've been researching and teaching the activity for nearly 15 years \nin UK business schools as we found that not all humans feel they have the genes to start a business. So this course helps more people, like you, to learn from helpful insights from entrepreneurship research and the big data available from practice. <strong></strong>This course is not a<em> story of \"how I won my start up war(s)\"</em><em>. </em>This program is based on the behavioral trends we see in 1000's of entrepreneurship winners as well as problems that I see causing some venture creators fail. </p>\n\n<p><strong>Question 2:</strong></p>\n\n<p><strong><em>Does Starting a Business Mean it Must Hurt?</em></strong></p>\n\n<p><strong>A: </strong>Not anymore! The workplace wellbeing, employee wellness and entrepreneur stress research is now providing us \nwith useful insights that I use in my face to face practice. So business creators of tomorrow can now get a \nmuch better ride with their endeavors, through courses like this.   <br></p>\n\n<p><strong>Content Overview</strong></p>\n\n<p>When\n you take this introduction to the activities of new venture creation you will encounter a holistic business analysis journey, with my professional coaching. You'll find it easy to view all the videos in a hour and the activities might take you between 14 to 28 days to complete. During that time I can give you personal feedback on your results. The course will guide you practically around taking the next steps with \nyour business idea while avoiding key stress and business failure points. It is an online start up coaching with an activity walk though course.<br></p>\n\n<p><strong>You will learn from:</strong></p>\n\n<ul><li>recipes from research</li><li>practical excercises to get you started</li><li>tips to minimize your stress  </li></ul>\n\n<p>The course is structured around three key themes:</p>\n\n<ul><li>explaining terms and research led insights</li><li>personally asses and start to plan for doing the typical start up activities</li><li>tips to hep you avoid the main stress points</li></ul>\n\n<p>It\n is about successful venture creation and uniquely turns the trusted \nresearch into helpful practical assessment tools. In building your \nskills for carrying out each activity the lectures fuse recommendations \nfor healthy mindsets and workplace wellness practices. This course \nfocuses on getting you to analyze readiness for carrying out typical \nbusiness start up activities for self employment or your freelance work. It is the first in my healthy \nentrepreneurial behavior series. </p><strong></strong><br><strong></strong><p><br></p>", 
    "end_date": null, 
    "title": "How To Launch A Healthy Business: Learn The Start-up Tasks", 
    "price": "30.00", 
    "instructors": "Dr Glenis Wade", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651238_3d8f_3.jpg", 
    "course_url": "https://www.udemy.com/becoming-a-healthy-entrepreneur-check-your-1st-15-tasks/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T13:50:49Z"
}