{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are you building your first business and feel lost or unsure of what to do at each step?</strong></p><p>That is how millions of first-time entrepreneurs feel, and it is how I felt when I started my first business. In this course, I walk you through every step of the way from selecting the best business idea to pursue, to business planning, registering your business, raising money, and starting your business with correct fundamentals to give you and your business the best chance to succeed long term.</p><p>  \t<strong>LATEST COURSE UPDATE: September 2015 (now 7 hours and over 75 lectures!)  </strong></p><p><strong>New lectures:</strong></p>  <ol>  \t<li>Case study and step by step insight of how I built my own business</li>  \t<li>How to build momentum and stop procrastinating by building good habits</li>  \t<li>New lectures on how to raise money!</li>  \t<li>Three strategies for doing a fantastic product launch</li></ol>    <p>  \t<em><strong>* OVER 15,000 DELIGHTED STUDENTS HAVE TAKEN THIS COURSE!</strong></em>  </p>    <p>  \t                          By the end of this course, you will no longer be ranked among the thousands of \"wantapreneurs.\" You will have taken your first, positive steps to business success. You'll know exactly where you are going in business - and how you are going to get there. Able to make confident decisions. That's the secret behind every successful entrepreneur.  </p>  <p>  \t                          This course covers all the key things holding you back. We cut the confusion and show you exactly how to gain focus. That's what business strategy is really all about.  </p>  <p>  \t                          We will look at ways to generate new business ideas. How to test the water. How to pitch your ideas to others.  </p>  <p>  \t                          I'll show you how to protect your intellectual property. How to raise funds for a fast-track launch - and how to mastermind your launch. Just as importantly, I'll reveal all the possible pitfalls, so you can navigate safely around them.  </p>  <p>  \t                                                                                                Use this course as a step-by-step guide to go from business ideas to starting a successful business.  </p>  <p>  \t<strong>Personal Attention To Help You When You Need It</strong>  </p>  <p>  \t                                                          In addition to the course lectures, I provide personal help to students of this course via the course discussions and private messages. All students of this course are welcome to message me on Udemy and ask me questions about their business. I love helping students and I look forward to helping you!  </p>  <p>  \t<strong>                                                                      This course contains over 5 hours of video in over 60 lectures!</strong>  </p>  <p>  \t              HERE ARE JUST SOME PARTICULAR TOPICS COVERED:  </p>  <ul>  \t<li>BUSINESS IDEAS</li>  </ul>  <ol>  \t<li>How to come up with business ideas</li>  \t<li>How to pitch ideas and get feedback</li>  \t<li>How to know if your ideas are good</li>  </ol>  <ul>  \t<li>PROTECTING INTELLECTUAL PROPERTY</li>  </ul>  <ol>  \t<li>NDA, patents, copyrights, non compete agreements and more</li>  </ol>  <ul>  \t<li>BUSINESS PLANNING</li>  </ul>  <ol>  \t<li>Business models,</li>  \t<li>Revenue models,</li>  \t<li>Marketing plan and understanding your target market</li>  \t<li>Individual section for each part of a business plan to make sure that you start with great business fundamentals</li>  </ol>  <ul>  \t<li>RAISING MONEY</li>  </ul>  <ol>  \t<li>10 very different ways to raise money for your business</li>  </ol>  <ul>  \t<li>BRINGING YOUR IDEA INTO REALITY</li>  </ul>  <ol>  \t<li>Business registration</li>  \t<li>How to do sales</li>  \t<li>How to improve and evolve your idea and business</li>  \t<li>How to choose a great business name and domain name</li>  \t<li>How to quickly set up your website on your own</li>  </ol>  <p>  \t<strong>Who This Course Is For</strong>  </p>  <p>  \t                                                                                                This course is ideal for people who are either thinking about starting their business, are in the very beginning stages of starting their business, or have started and are struggling to make progress. You will get solid business fundamentals from the lectures, and personal help from me if you have particular questions on how to start your business.  </p>  <p>  \t<strong>Why This Course Is So Unique</strong>  </p>  <p>  \t                                                                                                There is a very unique story behind this course. I originally created the Problemio business apps which now have over 500,000 entrepreneurs who downloaded the apps. On the apps, entrepreneurs are able to ask business questions. I took all the questions that were ever asked on the apps, and summed them up into the issues covered in this course. That means that the issues covered in the course come from entrepreneurs just like yourself!  </p>  <p>  \t                          So if you are starting a business, this is a great way to guarantee that the material in the course will be very relevant to the things you are going through now, or things you will be going through soon.  </p>  <p>  \t<strong>                                                                                                    Money Back Guarantee</strong>  </p>  <p>  \t<em>The course comes with an unconditional, Udemy backed, 30 day money-back guarantee. It is also my personal promise to you that you will get great value from the course and succeed ... just like over a thousand other students in this course.</em>  </p>  <p>  \t<em>So, why not join me, and my community of successful students, right now. See you in class.</em>  </p>", 
    "end_date": null, 
    "title": "How To Start A Business: Business Ideas To Success ", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176758_bdf3_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-business-go-from-business-idea-to-a-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T17:23:51Z"
}