{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Writing and submitting grant applications can so often be both daunting or simply frustrating <br></p><p>Putting together what might be a <em><strong>good</strong></em> grant application is no longer enough! <br></p><p>Similarly, a <em><strong>good</strong></em> project that may help a lot of people is also no longer enough!</p><p>From experience we know that frustration usually comes in one of three ways:</p><p>1. Lots of effort put in, only to receive a friendly rejection letter that tries to convey that you were <em>almost there</em>, it's just that t<em>hey </em>were<em> over subscribed</em>.</p><p>2. \"<em>Not quite what they were looking for...\"</em> but as far as YOU can see, your project matches exactly what they stated they were looking for!</p><p>3. This grant looks good and looks a great fit for what you want to do. You have a strong intention to apply <em>but somehow just never get around to it,</em> and then... it's too late.</p><p>Once you go through this course, there'll be no guessing.</p><p><strong>• You'll know</strong> that you've covered all the bases and submitted a great bid.</p><p><strong>• You'll know</strong> that you've spelt out in no uncertain terms that this is the project they want and need to fund.</p><p><strong>• You'll be</strong> so prepared for any grant application that comes your way that you definitely won't be <em>leaving money on the table</em>.</p><p>Through this course you'll get access to video tutorials, downloadable course materials and resources you can use for practice, or adapt for your real-life applications, or even use in-house to teach your own colleagues. Not only that, but you'll have complete access to all the new materials as the course get's updated or if we ever add new modules.</p><p>This is one of our most popular courses that we've taken all over the UK. In doing so we've had many multi-million pound fundraisers as well as countless fundraising newbies in attendance at this and some of our other courses, and EVERYONE leaves a better fundraiser than when they came. Once you go through this course it will be the same for you. In this course that has been painstakingly designed, tested and delivered by Amal Douglas and his team.</p><p>• You will get to know about the importance of a team and how to build one.</p><p>• You will learn to construct brilliant answers to the key questions.</p><p>• You will learn how to avoid all the hidden traps that lead to so many rejections.</p><p>• You will learn about constructing budgets and building a great case for support.</p><p>• You will even learn how to see if there are other suitable funding options before going down the road of grant funding.</p><p>This course is ideal for you if you simply want to get down to business, submit better grant applications, become a better overall fundraiser, stay up to date and be sure that you are definitely not <em>leaving money on the table</em>.</p><p>This course is also an add-on module for those studying for the Foundation Certificate in Fundraising.</p><p><br></p>", 
    "end_date": null, 
    "title": "How To Submit Really Great Grant Funding Applications", 
    "price": "50.00", 
    "instructors": "Amal Douglas", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764282_95b9_4.jpg", 
    "course_url": "https://www.udemy.com/grantapplications/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T12:32:25Z"
}