{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">I made over $117,000 with my very first website in my first 3 months</strong> using my little known methods for making websites super profitable in record time.  I now have websites that average much <strong style=\"\">more than $1,200 a day</strong>.  And I&#039;ll show you how you can use my methods to make a 6 figure income with your own profitable websites.  Every single technique which I reveal in this course is easy to put into place in minutes - and can give you immediate returns. .... results that feel remarkably good in your bank account and your wallet.</p><p><br style=\"\"></p><p>This course consists of 6 hours of training and 78 coaching sessions that will teach you step-by-step how to create highly profitable websites from scratch in 5 days or less. This will enable you to achieve all the things you&#039;ve dreamed of — whether that&#039;s buying your dream car or dream house, investing in property, sending your kids to college, or donating money to charities. Whatever your dream is, money helps you get there! This course will provide you with the tools to make as much money as you want, whether you are a novice or an experienced web developer.  There are no limits when it comes to web based business profits.  <br style=\"\"></p><p><br style=\"\"></p><p>Ever since creating my first 6 figure website, I&#039;ve been making amazing amounts of income every day since I started to  experiment with what really works.   And that includes everything from site design, customer management,  to massive targeted wallet waving traffic, and even set and hands free forget automation.</p><p>And these experiments and tests have really paid off.  And only what really works is now being <strong style=\"\">revealed here for the first time.</strong>  </p><p>I now have websites that average much more than<strong style=\"\"> $1,200 a day</strong>.  Typically my brand new sites start off at about $100 a day, but with 2 - 3 months, most generate $500-$600 a day.  And that&#039;s net to me.  This is  real serious spendable cash in my hand.  And I&#039;ll  show you how I set these up to run hands free once you set them up.</p><p style=\"\">Every single technique which I reveal in this course is easy to put into place in minutes - and can give you immediate returns. .... results that feel remarkably good in your bank account and your wallet.</p><p style=\"\">Nothing is kept secret - I reveal all I know ... and as I test even more things, those that are successful are added to the course -<strong style=\"\"> at no extra cost to you! </strong>This is a course that will continue to grow and grow.</p><p style=\"\"><em style=\"\"><strong style=\"\">As with all my courses:</strong></em></p><ul style=\"\"><li>the initial low price will increase shortly - the course is currently $197, but will increase to $499</li><li>you have unlimited lifetime access at no extra costs, ever</li><li>all future additional lectures, bonuses, etc in this course are always free</li><li>there&#039;s an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li><li>my help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\">As well as the Udemy<strong style=\"\"> 30 day guarantee</strong>, you have my personal promise that you will be wowed and delighted by what you&#039;ll learn in the next few hours ... and you&#039;ll be kicking yourself for not learning this sooner as you see how easy it is to do and realize how you&#039; have been missing out on fabulous potential earnings.</p><p>Enroll now, if you want my personal &quot;insider&quot; information showing you how to do exactly what I&#039;ve been doing -<strong style=\"\"> remember I&#039;ve earned $117,000 in the first 3 months for minimal work.</strong>  And recently I earned a<strong style=\"\"> net profit of  $27,000 in November  and over $39,000 in December and now over $43,000 in January, (and I now work for no more than 2-3 hours a day) - you need to get this course now ... right this minute.</strong></p><p>Every minute you delay is actually COSTING you money ....</p><p><strong style=\"\">Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "How I Create a 6 Figure Income Earning Website in 1 Day", 
    "price": "20.00", 
    "instructors": "Susie Phillips", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440922_881f_2.jpg", 
    "course_url": "https://www.udemy.com/how-i-create-a-6-figure-income-earning-website-in-1-day/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T02:09:51Z"
}