{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This course is the beginners guide to importing from China from the comfort of your home!! All you need is an Internet connection &amp; a laptop/computer.</strong></p><p><strong><em></em></strong></p><p>For <strong>more than 10 years</strong> I worked with the biggest retailers in the world on developing, sourcing and finding new products for them. I got to know all the standards and product requirements there are and additionally gained a lot of experience and insight working with factories in China.</p><p>Not just that. I learned a lot about China, its culture &amp; manufacturing. Where &amp; how to find the best suppliers, how to negotiate and communicate with them, how to arrange business travel for my Customers, behind the curtain tips &amp; tricks that will make you equally successful as me. </p><p>This course is aimed to make you become a professional Importer in a few days, in what took me over 10 years.</p><p>This course will guide you step by step on how to import goods from China. </p><p>Starting or running an FBA (Fulfillment by Amazon) business? This is the perfect course for you! This course includes an entire eBook (64 pages) on Fulfilment by Amazon. Learn the basics of importing and then dive right into FBA with this eBook! </p><p>This course aims to take away all your worries &amp; doubt and help you to take your business to the next level<strong>!</strong></p><p><strong>I will show you and give you examples on how to turn an investment of 10,000USD into <strong>33,000USD PROFIT! </strong></strong></p><p><strong>Content of the course: </strong></p><p>About China</p><p>Why should you import?</p><p>The 6-step Import process</p><p>How to find the right product</p><p>Validate Your Product Idea</p><p>Ways to Product Sourcing</p><p>Alibaba &amp; Global Sources</p><p>Ordering Samples</p><p>Testing your samples</p><p>General Product requirements</p><p>OEM /ODM Products</p><p>Payment &amp; Delivery</p><p>How to build a relationship with Manufacturers</p><p>Hiring a Sourcing company</p><p>Advantages &amp; disadvantages of drop-shipping (e.g. Aliexpress / Ebay)</p><p>Patents &amp; Copies </p><p>Calculate your costs</p><p>Hot to Contact a logistics provider and get a quote</p><p>How to Contact a third-party Inspection company to inspect your goods</p><p>Create an internal form to follow up your order</p><p>Things you should do before placing an Order</p><p>Packing &amp; labeling</p><p>Minimum Order Quantities (MOQ)</p><p>Negotiation</p><p>Payment options</p><p>Placing the Order- The Essentials</p><p>Receiving your PI (Pro-forma Invoice)</p><p>Monitoring your Order</p><p>Arranging the Inspection</p><p>Logistics - Getting Your Order</p><p>Receiving your order</p><p>Claims &amp; compensation</p><p>Selling your products (Ebay / Amazon)</p><p><strong>BONUS SECTION:</strong></p><p><strong>THE FBA BIBLE - A 65 pages eBook that I wrote on Fulfilment by Amazon</strong></p><p>I will cover all aspects there is to importing from China. Be it to start with Alibaba, get to know about importing procedures, dealing with factories, find your products, how to inspect and ship your goods, find out what legal import requirements your products needs to meet in whatever country you come from and much much more.  </p><p>With this course I want to help you having the same success as me in just a couple of months of hard work. Yes, hard work. To take your ideas or business a step forward takes a lot of hard work. It is also a great tool for you or your new Employee as a general guide and introduction to import. </p><p>There are a few chapters that may or may not apply to you. I recommend going trough them anyway and then decide for yourself to apply these processes or not.</p><p><strong>PLEASE SEE THE DOWNLOAD SECTION FOR EACH CHAPTER ON BONUS MATERIAL &amp; DOCUMENTS</strong></p><p>I hope you enjoy this course and it will help you the same way as it has helped many others.</p><p>Manuel</p>", 
    "end_date": null, 
    "title": "How to import from China - The beginners guide", 
    "price": "20.00", 
    "instructors": "Manuel Becvar", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444478_4d29_2.jpg", 
    "course_url": "https://www.udemy.com/the-import-from-china-course-the-beginners-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T05:51:05Z"
}