{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Writing a none fiction book in a week is not difficult.</strong> All that is required is a subject, a knowledge of that subject and a plan.</p><p>This course will show you how by using a master plan you can write your book in a week. You can then go on to write another book in a week. In fact you can go on to write dozens of books, even books about things you know nothing about yet.</p><p><strong>You will discover:</strong></p><ul><li>How to plan your book</li><li>How to break your idea down </li><li>How to write it all down</li><li>How you can publish it</li><li>How to edit</li><li>The types of publishing available to you</li><li>The tools you need to use to write your book (All free unless you want to pay)</li></ul><p>Although you are learning how to write you book in a week, not how to publish, you will need to know the basics of publishing. So that is covered to ensure you don't get lost.</p><p>By using this plan you will never suffer writers block, as you always know what has to be written about. </p><ul><li>Take the course &amp; Plan your first book today</li><li>Write your first book tomorrow</li><li>Publish next week.</li></ul><p>The plan has been developed and simplified over many years. Originally developed because of report writing taking over my life. I needed a system that enabled ten reports a week to be written that were taking forever. By reading what others did &amp; talking to others, a plan was developed, and has satisfied my requirements for many years. For book writing it needed to be simplified. Reports have a lot of detail, books less so.</p><p>This system is perfect for none fiction writing, there are better systems written for fiction writing.</p><p>With my full support, and 30 days full money back guarantee you are assured of no risk to you. </p><p><strong>Enroll today, publish next week. It really is that simple.</strong></p>", 
    "end_date": null, 
    "title": "How I Can Write a Book in a Week: On almost any subject", 
    "price": "20.00", 
    "instructors": "Peter Clark", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/772898_6f10_3.jpg", 
    "course_url": "https://www.udemy.com/write-a-book-in-a-week/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-24T13:18:22Z"
}