{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t     I like to call this course the <strong style=\"\">Instant Cash Generator</strong>. Why? Because it does <strong style=\"\">just that.</strong> The most work that you will be doing is sending emails. No coding or graphic design skills needed! This same system was used by me at the <strong style=\"\">age of 16</strong> to <strong style=\"\">make thousands online</strong>, and today I will be teaching you those<strong style=\"\"> very same methods</strong>.  </p>  <p style=\"\">  \t     The basic concepts of the course are service brokering, like how a stock broker takes a percentage from brokering a stock trade. You will make <strong style=\"\">huge margins</strong> on brokering services on the internet, like logo creations. You will learn how to find people to work for you for cheap, and the secret sources I use to find people who are interested in buying.  </p>  <p style=\"\">  \t      Not to mention it's <strong style=\"\">so easy</strong> my <strong style=\"\">10 year old</strong> sister could do it. At the end of the course i'll show you how to polish up your image on the web, and you will have all the knowledge necessary to take action to launch your internet marketing career and <strong style=\"\">make tons of cash!</strong>I look forward to hearing from you on the inside.  </p>", 
    "end_date": null, 
    "title": "How to Run a Business Online: No Work Required", 
    "price": "20.00", 
    "instructors": "Francesco Iantorno", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/254214_33a6_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-run-a-business-online-no-work-required/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-02T03:58:23Z"
}