{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn the skills you will need to buy an income producing website with confidence.</p>  <p><strong>Become a competent website business buyer by developing basic investor skills.</strong></p>  <ul><li>Find out why buying websites is faster, less risky and often cheaper than building from scratch</li><li>Learn where to find sites to buy</li><li>Learn how to spot a deal and a lemon</li><li>Uncover the earning potential in websites</li><li>Learn how to evaluate revenue, traffic, content, dependencies and much more</li></ul>          <p><strong>Accelerate Your Online Business By Leveraging Pre-existing Assets</strong></p>  <p>Why create a travel, sports or crafts blog when you can buy one that already has a steady stream of traffic and is already earning an income? When you buy a website you are buying its audience, its customers and its products. </p>  <p>Buying existing customers is much less risky than thinking “If I build it, they will come.” But as every investor will tell you, not every opportunity is what it seems.</p>  <p>In this course you will learn how to dig under the covers and understand the strengths, weaknesses, risks and opportunities of each website that is for sale. </p>  <p><strong>What’s Inside?</strong></p>  <p>The course moves from the beginning to the end of the website buying process. It explains the nature and benefits of buying websites and moves through the process of searching, narrowing down the search and evaluating prime opportunities.</p>  <p>If you aren’t familiar with the ways different types of websites earn their income, there is a section of the five most important business models.</p>  <p>The core of the course discusses how to evaluate the most important elements of each website deal. It includes a section on valuation, how to determine the right price based on the risk and income profile.</p>  <p>Finally, you will complete the process by understanding how a website ownership is transferred and the important aspects of managing your new online business.</p>  <p>There are many other important subjects covered along the way like: What about international websites? Do I need a contract? Where can I get good help?</p>  <p><strong>Structure</strong></p>  <p>The course is composed as a series of short video presentations. Each video includes an outline of its contents with a minute marker that tells you where in the video to find the topic.</p>  <p>The outlines are visible before you buy the course, so check it out to see exactly what you are going to get.</p>  <p>To get the most out of the course you should stop and practice what has been taught. Go out and find for-sale listings. Evaluate a few websites you are interested in!</p>", 
    "end_date": null, 
    "title": "How To Buy Websites - by An Expert Investor", 
    "price": "50.00", 
    "instructors": "Jeff Hunt, John Westbrook", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722964_ff6c_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-buy-websites-from-an-expert-investor/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-10T18:16:52Z"
}