{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>JOIN 4,900+ STUDENTS LEARNING HOW TO CREATE A $60,000+ ONLINE BUSINESS! SEE HOW TO BREAK FREE FROM THE CUBICLE CHAINS FOR GOOD!</strong>  </p>\n\n<p>  \t    In this course, I'll be teaching you the exact methods that I  used to create a game plan for starting my own business that has gone from zero dollars in online independent income to over $60,000 in less than three years.  </p>\n\n\n\n<p>  \t<strong>What is my experience on the topic?</strong>  \t              I've built up a location independence online business that generates over $60,000 per year and full supports me. My business has seven streams of income and it allows me to do what I want with my time.  </p>\n\n\n\n<p>  \t<strong>Who is this course for?</strong>  \t             This course is for the entrepreneur at heart, who doesn't have a clue where to start but knows he/she wants to create an independent online business.  </p>\n\n\n\n<p>  \t<strong>What problems does this course for solve for cubiclepreneurs?</strong>  \t              This course helps you get out of your own way and start making progress toward your dream like. It shows the exact steps I took to create my game plan for starting my own business, that is now earning over $60,000 per year.  </p>\n\n\n\n<p>  \t<strong>Who is this course NOT for?</strong>  \t             The  person looking to make a few bucks on the  side,  in the short term. It's not for someone not willing to follow through and stick  with  this for the long haul.  </p>", 
    "end_date": null, 
    "title": "How I Started My Online Business: Business Launch Game Plan", 
    "price": "35.00", 
    "instructors": "Kraig Mathias", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380058_a2ae_18.jpg", 
    "course_url": "https://www.udemy.com/business-launch-game-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T15:58:27Z"
}