{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Earn your first $1.000,- guarantee: </strong><br>Earn $1K in 10 weeks following the course (OR get free coaching from me until you do)<br><br><strong>What am I going to get from this course  ? </strong><br>If you follow the steps to the point you will have at least a $1.000 client at the end of this course and a clear path to taking your side business full time. <br><br><strong><br>What is the course about?</strong><br>This is about the PROCESS of building a real longterm online agency from scratch. We will reverse any online agencies in your country, and package the service so it sells and offer it to the marketplace! I am currently doing this full time myself, and will use my own agency as a case study during the course.</p><p><strong><br>What is the target audience ?<br></strong>If you are a struggling freelancer. If you want to learn a real and ethical ways to start an online business. If you have been trying to make money online for years with no or little results. If you want to run a business without building a network/audience. If you currently have a agency/consultancy without clients or a good income.<br><br></p><p><strong>What kind of materials are included?</strong><br>Spreadsheets, support group, action steps for each video and relevant links.<br><br><strong>How is the course structured?</strong><br>Its 14 videos created with action task in mind. The main course is structured to see one video, and use 1 week on the action steps so you have a profitable agency within 10 weeks.<br><br><br><br><br>   <br></p>", 
    "end_date": null, 
    "title": "How to Start and Grow Your Digital Agency From Scratch 1.0", 
    "price": "50.00", 
    "instructors": "Nickolas Ite", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658622_c391_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-and-grow-your-online-agency/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T06:22:43Z"
}