{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is aimed towards helping corporate escapees to build a career as a <strong>successful freelancer utilizing opportunities available on Upwork</strong>. Packed with <strong>tried and tested solutions</strong>, I offer highly informative videos help a new Upwork freelancer to outperform the competition and land dream job opportunities.</p>\n\n<p>On the course I talk about why traditional freelancing methods do not work on Upwork or online - lengthy proposals are a great example. I will tell you how to brake those rules and BEAT YOUR COMPETITION BY A MILE!</p>\n\n<p>In this course, I’ll teach practical strategies that I used when I started, and still today, using Upwork. I will show you the exact strategies I did when I build an Upwork income from<strong> zero to $40,000 in a year (verified earnings!). And I can tell you that I did not use any traditional methods!</strong></p>\n\n<p>The best part of this particular course is the community forum wherein you will be able to ask me directly! I will be available for more questions and clarifications once you joined this course.</p>\n\n<p><strong>MY SUCCESS WITH UPWORK - verified earnings (very important!)</strong></p>\n\n<p>I started my career as a freelancer because I got tired of working in the cubicle – I wanted freedom that corporate world could not offer. That’s where Upwork (or Odesk at a time) came in to play.</p>\n\n<p>Today, <strong>I currently am within top 3 in Upwork’s Top Rated Freelancers in my niche</strong>. I’ve been able to work both as a freelancer and as a client. I have hired hundreds of freelancers for various client projects, and I have also worked for number of premium clients as well.</p>\n\n<p><strong>Now, it is my turn to help you do what I did it!</strong></p>\n\n<p><strong>UPWORK MADE EASY FOR BEGINNERS</strong></p>\n\n<p>Is Upwork intimidating because of its busy marketplace? Do you ever doubt how your profile is going to stand out from thousands of freelancers that have their eyes on the same job?</p>\n\n<p>This course is your beginners guide on Upwork, an easy to understand guide, how you can make that leap from newbie to a successful freelancer.</p>\n\n<p>This course will help new and struggling freelancers have the opportunity to land real job opportunities, regardless if you are looking for a long term or a short term project.</p>\n\n<p>This course is designed to help to improve your profile to win clients and convince they need your services.</p>\n\n<p><strong>GOALS OF THIS COURSE</strong></p>\n\n<ul><li><strong>Understand how Upwork works</strong></li></ul>\n\n<p>If you are a bit intimidated about Upwork, this course will help lessen that anxiety. I’ll teach the ins and outs of Upwork. Here, you’ll know how the system and interface work.</p>\n\n<ul><li><strong>Learn to market yourself in your niche</strong></li></ul>\n\n<p>After the course you are able to know exactly how to market yourself. You will be able to build a profile that showcases your skills and abilities in your niche.</p>\n\n<ul><li><strong>Learn how to make attention grabbing proposals</strong></li></ul>\n\n<p>Before you even showcase your skill, you need to be noticed by potential clients. In this particular course, I discusse easy to understand methods on how to make an effective proposal letter allowing you to land an interview.</p>\n\n<ul><li><strong>Locate HIGH PAYING job opportunities</strong></li></ul>\n\n<p>It is a struggle for every newbie to locate lucrative job opportunities online. To help avoid devaluing your own work, I will be teaching students how to find job opportunities that are financially rewarding.</p>\n\n<ul><li><strong>Learn how to handle client interviews and consultations</strong></li></ul>\n\n<p>Once you land an interview, we’ll teach you how to impress your potential client and close the deal.</p>\n\n<p><strong>TAKE THIS COURSE!</strong></p>\n\n<p>This course offers <strong>an active community</strong> where we can discuss anything under the sun about freelancing and Upwork.</p>\n\n<p>You can also contact me via Udemy messaging system if you have questions about Upwork or freelancing in general.</p>\n\n<p>If you have the burning desire to work as a freelancer via Upwork, but you have <strong>no idea how to write proposal letter, this course is the first step towards that goal.</strong></p>\n\n<p>I also run contests every now and then wherein the winners get their free profile or proposal letter consultation for FREE!</p>\n\n<p>BONUS #1: Your<strong> lifetime access</strong> to this course includes ongoing updates</p>\n\n<p>BONUS #2: <strong>Connect with me</strong> on Linkedin and of course within the course.</p>\n\n<p>BONUS #3: Gain <strong>free and discounted access </strong>to my courses and ebooks.</p>\n\n<p>The course has <strong>full 30 days money back guarantee</strong> so you have nothing to lose, just everything to gain.</p>\n\n<p>See you in the course, and don't forget to introduce yourself to other students.</p>", 
    "end_date": null, 
    "title": "How to Confidently Start Upwork Freelance Career & Win Work", 
    "price": "25.00", 
    "instructors": "Nina Kolari, Learnlance Freelancer Training Company", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608418_c414_9.jpg", 
    "course_url": "https://www.udemy.com/upwork-online-freelancing-success/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T20:38:52Z"
}