{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this first-ever free course from bestselling Udemy instructor Jonathan Levi, we explore the role of failure as a methodology for entrepreneurial success.</p>\n\n<p>Recorded during a public lecture given at Google Campus TLV in March of 2016, this course is guaranteed to inspire, inform, and entertain!</p>\n\n<p><strong>Learn to Embrace &amp; Utilize Failure as a Powerful Teaching Tool</strong><br></p>\n\n\n\n<p>Whether or not you have entrepreneurial aspirations, this course will help inspire and motivate you to embrace failure in your own life as a learning opportunity, while properly applying the safety net and mindset to fail both smarter and faster.</p>\n\n\n\n<p><strong>Take the Shortcut to the Top - By Learning From Others' Mistakes</strong><br></p>\n\n\n\n<p>A serial entrepreneur since childhood, Jonathan shares some of his most educational failures along the road towards building numerous multi-million dollar businesses, extracting the wisdom and learnings he accumulated along the way.</p>\n\n\n\n<p>The end result is a fast-track to success - both entrepreneurial and otherwise.</p>\n\n\n\n<p><strong>Skip the Biggest Pitfalls That Hinder <em>Most</em> Entrepreneurs</strong><br></p>\n\n\n\n<p>Throughout the course, Jonathan shares the creme-de-la-creme of entrepreneurial advice and guidance, gleaned from over 25 years of entrepreneurial endeavors. </p>\n\n\n\n<p>You'll learn powerful lessons about:</p>\n\n\n\n<ul><li>Leadership &amp; Management</li><li>Product marketing</li><li>Branding</li><li>Customer Development</li><li>\"Lean\" Startups</li><li>Lifestyle Design</li><li>The importance of goals</li><li>Business Management</li><li>...and much, much more!</li></ul>\n\n\n\n<p>The course is comprised of video lectures, with an optional slide deck available for download. </p>", 
    "end_date": null, 
    "title": "How to Reach Entrepreneurial Success: Fail Smarter & Faster", 
    "price": 0, 
    "instructors": "Jonathan Levi, Yarin Goren", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/842720_6adc.jpg", 
    "course_url": "https://www.udemy.com/failure-entrepreneurial-success/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-08T12:26:01Z"
}