{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p></p><p>This “How to be a Young Innovator“course covers both the professional as well as the personal requirements for\r\nbeing an innovator. I do call this ProPer, Professional as well as Personal. In\r\nother words, this course addresses the yin and yang of being a young innovator.\r\nThat approach will enable you to become a stable and successful innovator. As\r\nthere is a lot of information available about the ‘mechanics’ of innovation\r\n(the ‘doing’), we will focus on the even more important aspects of living the\r\nlife of an innovator (the ‘being’).</p>\r\n\r\n<p>Being an innovator is, both:</p>\r\n\r\n<p>-&nbsp; challenging\r\nand rewarding</p>\r\n\r\n<p>-&nbsp; difficult\r\nand fun</p>\r\n\r\n<p>-&nbsp; lonely and\r\ncollaborative</p>\r\n\r\n<p>-&nbsp; empty and\r\nfulfilling</p>\r\n\r\n<p>-&nbsp; frustrating\r\nand empowering</p>\r\n\r\n<p>Being an innovator is not just a job, which you will\r\nleave at 5pm to pick up your life again. It is a lifestyle of which you are the\r\nembodiment. It is impossible to separate life and work if you are an innovator.\r\nInnovators please be aware: it never stops!</p>\r\n\r\n<p>Therefore you have to pay attention to carefully\r\nlive this life, in order to be successful on all levels. For example, you have\r\nto be healthy and energetic to come up with great ideas. A clear mind is also\r\nneeded to come up with solutions for the grand challenges of our society.</p>\r\n\r\n<p>In the course I will explain some of the key\r\nprinciples of innovation and of being a Young innovator.\r\nI do ask a lot of questions to trigger your learning. You will provide the\r\nanswers and apply them in your (ProPer) life. A ‘live session’ is included to\r\ncoach you with your specific issues.</p>\r\n\r\n<p>Take this ultimate Young Innovators course right now and\r\nlearn how to change\r\nyour life.</p><p></p>\r\n", 
    "end_date": null, 
    "title": "How to be a Young Innovator", 
    "price": "25.00", 
    "instructors": "Arnold Beekes", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/38096_2c15_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-young-innovator/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-25T11:59:40Z"
}