{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>++++This course is all about how to <strong>how to start freelancing </strong>and <strong>become successful</strong>.</p>  <p><strong><em>This course is A-Z guide to start freelancing and become successful. This course will show you exactly how to start freelancing and become successful. It was tough to do on my own. This is why I created this course so that it doesn’t feel that hard on your end.  If you don’t know how to get work, how much to charge- this course will show you. </em></strong></p>  <p><strong><em> </em></strong></p>  <p>This course is actually 2 in one. You are getting two courses in this single course. As-</p>  <ul><li><strong><em></em></strong><strong><em>How to Start Freelancing and Become Successful</em></strong></li><li><strong><em></em></strong><strong><em>How to Start Your Own Business with Zero Cost Investment</em></strong></li></ul>    <p>So you are getting two courses at a time. ++++</p><p><br></p>  <p><strong><em>You'll learn-</em></strong></p>  <ul><li><strong><em>Around 26 lectures and 2.9 hours of content!</em></strong></li><li><strong><em>How to easily </em></strong><strong><em>start freelancing</em></strong><strong><em>.</em></strong></li><li><strong><em></em></strong><strong><em>The secrets of becoming successful in freelancing</em></strong><strong><em></em></strong></li><li><strong><em></em></strong><strong><em>To recognize the reasons behind the failure in freelancing so that they can avoid those mistakes and succeed</em></strong><strong><em></em></strong></li><li><strong><em></em></strong><strong><em>Make your freelancing profile completeness as 100% which is very important to win jobs</em></strong><strong><em></em></strong></li><li><strong><em></em></strong><strong><em>How to pass some basic tests to prove your worthiness to clients</em></strong><strong><em></em></strong></li><li><strong><em></em></strong><strong><em>How to start your own freelancing career</em></strong><strong><em></em></strong></li><li><strong><em></em></strong><strong><em>Understand one should start freelancing even if one doesn’t need to earn money</em></strong><strong><em></em></strong></li></ul>                <p><strong><em>..... And much, much more!</em></strong></p>  <p><strong><em>There is NEVER anything to pay!</em></strong></p>  <p><strong><em>Click the \"take this course\" button, top right, now ... it's your turn...</em></strong></p><p><strong><em><br></em></strong></p>  <p><strong><em></em></strong></p>  <p><strong><em></em></strong></p>  <p><strong><u>More about this course……</u></strong></p><p><strong><u><br></u></strong></p>  <p><strong><u></u></strong></p>  <p><strong><em>Who the course is for and who the course is not for…</em></strong></p>  <ol><li>Anyone who wants to be a freelancer but don’t know where to start and what to do…</li><li>Anyone who doesn’t know how to and where to start his own business</li><li>Anyone who is looking forward to starting his own freelancing career</li><li>Anyone who doesn’t have any money to invest for his business but still wants to start his business</li><li>Anyone who wants to improve his skills, expertise and quality in an effective way</li><li>Anyone who wants to earn some extra bucks</li><li>Anyone who has a great job, but wants to make some money on the side of doing what he loves </li><li>Anyone who has just started freelancing but are not getting any job</li><li>Anyone who has started freelancing but stuck in a position and doesn’t know how to move forward from this position</li><li>Anyone who wants to know that freelancing is not all about earning some money</li><li>This course is not for the people who are already established in freelancing and think that they know freelancing well.</li><li>This course is not for the people who are very lazy and don’t want to take action.</li></ol>                          <p><strong><em></em></strong></p>  <p><strong> </strong></p>  <p><strong><em>Freelancing is working for yourself, earning for yourself. You are not bound to anybody and you can work anytime anywhere including coffee shop! There is no restrictions. This is the beauty of freelancing. This is the beauty of having your own business. You are the boss. No one is going to order you any more until you want so…</em></strong></p>  <p><strong><em> </em></strong></p>  <p><strong><em>There is no bound of starting freelancing. Anybody who has basic computer and internet knowledge can start freelancing</em></strong><em>.</em></p><p><em><br></em></p>    <p><strong>Requirements before starting this course….</strong></p>  <p>A positive mentality, I mean you have to be an optimist</p>  <p>Access to internet and a computer</p>  <p>2/3 hours a day</p><p><br></p><p><strong>One more request: After you enroll to my course please don't forget to leave me a review/feedback.</strong></p>", 
    "end_date": null, 
    "title": "How to Start Freelancing and Become Successful", 
    "price": "25.00", 
    "instructors": "Sujon Mondol", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525060_59bd_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-freelancing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T11:39:21Z"
}