{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is a beginner level course. This course is to help individual who have no knowledge of the fashion industry understand how to get started. At end of this class students will understand the basics and essentials steps needed to start a fashion business and clothing line. By the end of this course, students will understand the foundation components of business and fashion.  </p>  <p>  \tThis fashion online course will provide information about many aspects of starting a  clothing line, including knowing who your customers are, the design process, business planning, and manufacturing.  </p>  <p>  \t  This course is broken up in the following areas of discussion:  </p>  <ol>  \t<li><strong>Creating a  clear business plan.  </strong></li>  \t<li><strong>Looking at your company's projected financials.</strong></li>  \t<li><strong>Performing research on the rest of the market that you are in.</strong></li>  \t<li><strong>Creating your line and building your brand.</strong></li>  \t<li><strong>Finding vendors and manufactures.</strong></li>  </ol>  <p>  \t<strong>This class is taught as lecture based course that provides details on how to start a clothing line. Many people looking to start a clothing line do not realize that it requires you to treat it like starting any business. The only difference is that fashion is creative.</strong>  </p>  <p>  \t  The benefit of taking this class will be that each student in this class will learn about the steps need to start a clothing line. Resources provided in the course is a checklist of things to do when starting a clothing line.<br>  \t<strong></strong>  </p>    <p>  \t<strong></strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong></strong>  </p>", 
    "end_date": null, 
    "title": "How to Start a Clothing Line: The Basics to Getting Started", 
    "price": "20.00", 
    "instructors": "Dr. Koffajuah Toeque-Slyusar Ed.D", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396630_a33c_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-clothing-line-getting-started/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-17T17:13:02Z"
}