{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">How To Turn Your Existing Kindle or Paperback Books Into Another Stream of Income By Tapping Into This Booming $ 3 Billion A Year Market For FREE (Literally!) (For US &amp; UK Publishers only)</p><p style=\"\">What if I told you, you could be earning passive income from the work you have already done? </p><p style=\"\">If you have been dreaming of multiple streams of passive income from your kindle and or paperback books with no marketing or promotions then this may be for you so listen up!<br style=\"\"></p><p style=\"\">I would like to take this opportunity to introduce you to the new phenomenon launched by Amazon in 2011 that is threatening to turn both the Audiobook Publishing &amp; Self Publishing Industries upside down once again!</p><p style=\"\">This platform enables you to partner with Amazon #4 (US), Audible #351 (US) &amp; iTunes (Apple) #26 (US) to sell your audiobook titles for FREE!</p><p style=\"\">If the KDP - Kindle opportunity is anything to go by then this represents an even bigger opportunity because </p><p style=\"\">audiobooks are higher priced, <br style=\"\">pricing is controlled by Audible, <br style=\"\"> audiobooks are perceived to be of higher value <br style=\"\">are being purchased by people with a lot of disposal income<br style=\"\">production costs are nil if you choose the royalty share option<br style=\"\">there are currently only 180,000 + audiobooks on audible versus 3.36 million + titles on kindle<br style=\"\">you don&#039;t have to do any work</p><p style=\"\">This is a comprehensive course delivered in 5 modules:-</p><p style=\"\">A Full Video Course with 26 videos plus PDFs as listed below.</p><p style=\"\">Module 1 – The Power of This opportunity (23 pages)</p><p style=\"\">Module 2 – The “Nuts and Bolts&quot; of the Platform – the how – to! (A visual walkthrough)!(65 pages)</p><p style=\"\">Module 3 – A Summary Checklist (7 pages)</p><p style=\"\">Module 4 – How to Market Your Audio Book if You Want To (16 pages)</p><p style=\"\">Module 5 - 5 Additional Ways to Make Money with this opportunity (13 pages)</p><p style=\"\">And it is jam packed with insider secrets I have learnt by taking advantage of this opportunity.</p><p style=\"\">I am so confident that this can enable you to create audiobooks at no cost and bring you sales on autopilot I am offering you a no questions asked 30 days money back guarantee!</p><p style=\"\">Try it for 30 days and if it is not what I have said you can request a refund!</p><p style=\"\">I will see you in the course!<br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "How I Sold 700+ eBooks In Audiobook Format With No Marketing", 
    "price": "20.00", 
    "instructors": "Mavis  Amouzou-Akue", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455648_1eef_4.jpg", 
    "course_url": "https://www.udemy.com/how-i-sold-700-ebooks-in-audiobook-format-with-no-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T11:28:04Z"
}