{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Startup / Growth Stage entrepreneurs have two resources-time and money; <strong style=\"\">in reality, more of time and less of money.</strong>You are stuck and unable to grow the business.</p><p>Taking this course will help you to come out your predicament and the cash flow starts again.</p><p>Discover your Diamond, is a three-step process to evaluate your marketing efforts for lead generation so that you will be spending time at the right fishing hole. If you market to everyone, you are not marketing to anybody. </p><p>I have given a pre-assignment worksheet for you to record all your current marketing approaches and the outcome, which will later facilitate in the use of the tool.</p><p> The course covers three case studies of startup/ growth stage entrepreneurs who have used the tool successfully and have grown their businesses. You can record your observations in the work sheet at the end of each case study. You can note down the appropriate marketing approaches for your business with the help of summary sheet provided. You will be able to apply the resources return matrix for your business with the findings from these three case studies.</p><ul style=\"\"><li>The course contains seven sections and fourteen lectures. I have given additional resources like pre-assignment work sheet and formats for noting down your observations. There are twelve talking head videos of 59 minutes 27seconds duration.</li></ul><p>You can complete the course in about a hour and half. However you can take as much time as you want to discover your diamond by applying the learnings from three case studies.</p><ul style=\"\"><li>Discover your diamond facilitates you to evaluate and prioritize the marketing ideas to grow  your business. <strong style=\"\">This does not require you to spend more money.</strong></li></ul><p>You can record the alternatives in discover the diamond sheet . </p>", 
    "end_date": null, 
    "title": "How to Acquire More Customers per Hour of Work", 
    "price": "20.00", 
    "instructors": "Business Coach Ranganathan KrishnaRao", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520162_ff3f_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-acquire-more-customers-per-hour-of-work/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T10:54:31Z"
}