{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you&#039;re thinking about starting a business, but are <em style=\"\">worried it won&#039;t work</em>, then this new program will guarantee to take you through the entire process to test whether your idea will be viable, so you won&#039;t need to take any risks until you are confident your business will succeed.</p><p>By the end of this course, you will have<em style=\"\"> analysed your business so thoroughly</em> that if you decide to proceed, you can be confident and excited that it will be a <span><strong style=\"\">success</strong></span>!</p><p>I have started two businesses and so can personally guarantee that assessing the feasibility of your business is essential. I have also coaching and trained over 300 people who have worked to start a business and those who have been most successful are those who have thoroughly assessed their business idea using the concepts in this course. I have applied coaching techniques to this program to ensure that you are able to <strong style=\"\">progress faster and learn more than you would from training alone.</strong></p><p>This is really important because every business is different and everyone has a completely different set of skills, experiences and values. So you will want to test whether <strong style=\"\"><span>YOUR dream can become a reality</span>.</strong></p><p>When you&#039;re thinking about starting a business, it can be really daunting. You&#039;re worried about whether people will want to buy your product or service, whether you will earn enough money to cover your bills. You&#039;ll worry about whether you have the skills to start up and run it and whether you have the confidence to leave your comfortable employed position. It&#039;s a scary decision and you can feel quite overwhelmed when trying to make the decision.</p><p>And it is sensible to be cautious. 8 out of 10 businesses fail when starting up: The two main reasons are not assessing the business enough prior to starting and mis-managing the financial side of the business.</p><p>And that is where this course will really help. Through this course, you will be taught what you need to know<em style=\"\"> before you start the business </em>so that you can ensure it will be <span>successful</span>.</p><p>However, you will also learn <em style=\"\">how </em>to undertake this research and assess your own business so that you can ensure that you feel confident with your business idea before spending any money, quitting your job or taking any risks.</p><p>Research shows that business owners who get training and support to assess their business idea before they launch their business, are much more likely to succeed.</p><p>This program takes you through the process of assessing your business feasibility <em style=\"\">step by step</em>. You will look at the different areas which you will need to assess including the market, the external environment, the financial aspects and your skills. This will help you to assess your business comprehensively which means that you can be assured that if you decide to proceed, you can be confident you will succeed.</p><p>In addition to the course material, you will also have <strong style=\"\">workbooks </strong>to fill out for each module. This means that you can apply all the information to your own business idea and really delve deeply into your own values and beliefs. You will be more successful if you start a business which is in line with your values and these workbooks will enable you to do this so that you still love your business in 5, 10, or 20 years time.</p><p>Plus, the support you&#039;ll receive in the <em style=\"\">private groups</em> will be paramount to your success. You may find that your family and friends don&#039;t always understand or fully support your venture and so surrounding yourself with others in the same situation as you will enable you to seek <strong style=\"\">advice</strong> and <strong style=\"\">guidance</strong>, <strong style=\"\">bounce ideas around</strong> and generally have lots of <strong style=\"\">fun </strong>exploring your idea.</p><p>The price of this course is usually £149, but for this month it is available for <span><strong style=\"\">ONLY £24</strong></span>, so grab it now whilst you can!</p><p>In addition to all this, there will also be additional webinars included in the programme, in themselves worth over £150. These will involve having experts in various areas such as finance, marketing and sales and it will be your chance to ask specific questions related to your own business and get some really valuable advice and support.</p><p>Plus there is a 30 day money back guarantee so if you&#039;re not completely happy, you can get a full refund.</p><p>So pick up the course today for £24 by clicking below. At the end of this month, the course will go up and the additional webinars will be available as additional programmes worth £49 each, so don&#039;t delay.</p><p>There are hundreds of people starting businesses every day and the reality is that those who don&#039;t get appropriate training and support to assess the feasibility of their business are much more likely to fail. If your dream is to run your own business and live a life the life you deserve, then let&#039;s get started. I look forward to seeing you in the support group!</p>", 
    "end_date": null, 
    "title": "How to Start Your First Business (and make it a success!)", 
    "price": "20.00", 
    "instructors": "Kristiina Woollard", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409216_a5bc_2.jpg", 
    "course_url": "https://www.udemy.com/businessstartupcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T17:55:47Z"
}