{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em style=\"\">See my transformation from an employee in the Info Technology industry, and <strong style=\"\">how I left my job, and essentially doubled my salary, being my own boss as a self-employed freelancer...</strong> in only a few hours!</em><br style=\"\"></p><p><em style=\"\">I made over <strong style=\"\">$180,000,</strong> last year doing the same work as a contractor as I did as an employee- all simply by doing the things I have recorded in this course.</em></p><p><em style=\"\">_________________________________________________________________________</em></p><p><em style=\"\">MUST Take Self-Employment Course!</em></p><p><em style=\"\">&quot;I love this course, plain and simple. Catherine presents many concrete and practical ideas on how she made a successful transition to self-employment. This ISN&#039;T another crappy course, or book, talking up the overdone &quot;internet lifestyle,&quot; this is a legit course that offers a road map to succeed as a freelancer.&quot;</em></p><p><em style=\"\"></em>__________________________________________________________________________</p><p>For the last 15 years, I have worked in the Info Technology industry, with the last 10 years as a self-employed contractor in the same field. The day I made the leap to being self employed, <strong style=\"\">I skyrocketed my income, while putting in less time at the office</strong>.</p><p><em style=\"\">Many of the things that I have done in the last 10 years to remain a successful self-employed contractor have really paid off ... <strong style=\"\">And now I&#039;m sharing them with you here for the very first time.</strong></em></p><p>In last few years as an employee, before I started doing the things I teach this course, I only made a maximum of $90,000 / year as an employee. Since then, having gone through a lot of trial and error and figuring out what is successful and what isn&#039;t, I now make on average <strong style=\"\">double</strong> <strong style=\"\">my old salary</strong>! And I <strong style=\"\">work when I want</strong>, not when someone tells me.</p><p>Furthermore, every single thing I share with you in this course is <strong style=\"\">easy</strong> to put into place - and it  gets you one step closer to your dream of being self-employed.</p><p>Nothing is kept secret - I share with you all I know and all that worked for me...As I progress in my own work experience, successful techniques are added to the course - at no extra cost to you! This is a dynamic course that keeps on adding value, so keep this at your fingertips even after you complete it.</p><p>In addition to Udemy&#039;s 30 day guarantee, my personal commitment is that you will be wowed and delighted by what you learn. You will gain valuable insight not only for your career but many of the techniques can be used in every other area of your life as well. Why delay, when you are so close to creating everything that you ever wanted in your life?</p><p><em style=\"\"><em style=\"\">_________________________________________________________________________</em></em></p><p><em style=\"\"><em style=\"\">&quot;Best of all, there&#039;s no fluff, just straight talk from someone who is fulfilling her career and lifestyle aspirations. Tired of 9 to 5, the rat race, slave wages and working for someone else&#039;s dream? Start with this course!&quot;</em><br style=\"\"></em></p><p><em style=\"\"><em style=\"\">_________________________________________________________________________</em></em></p><p><em style=\"\"><em style=\"\"><br style=\"\"></em></em></p><p><em style=\"\"><strong style=\"\">Here is What is Not in Scope:</strong></em></p><p><em style=\"\">In one of the lectures, we go into detail on how to build your resume and make it that of an attractive and successful contractor. </em></p><p><em style=\"\">I will not review your resume and critique it.. I don&#039;t know your industry or your experience - It would be unfair to you. However, if you find it value-added, you can feel free to model your resume after mine. In fact, i invite you to do so, because I know that my resume format has brought me success.</em></p><p><em style=\"\">I won&#039;t teach you anything that in any way breaks contract law, or any other unspoken rules in the business world, or burn bridges in any of your current business relationships.</em></p><p><em style=\"\">I also will not help you find contracting gigs. Again, I don&#039;t know your skill set and your background.. and most importantly, that&#039;s not the business I&#039;m in.</em></p><p>If you want to gain from just the enriching tidbits distilled from the 15 years of industry experience (Remember, I left my job, doubled my own salary, while paying less tax and working on average less than a regular working day) you need to get in this course. Now!!</p><p><strong style=\"\">Enrol now!</strong></p>", 
    "end_date": null, 
    "title": "How I Left my Job and Skyrocketed my Income as a Freelancer", 
    "price": "20.00", 
    "instructors": "Catherine Lam", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433478_66de_3.jpg", 
    "course_url": "https://www.udemy.com/how-i-left-my-job-made-twice-my-salary-doing-the-same-work/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T22:37:51Z"
}