{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t It’s the greatest time in history to be a writer, artist, and creative person.  With advances in technology and new paths for reaching new fans, there’s more opportunity than ever to develop a sustainable career as a creative!  </p>  <p style=\"\">  \t And in this modern world, a website is key for this. If you’re interested in using a website to grow your creative career, then this course is for you.  </p>  <p style=\"\">  \t<strong style=\"\">How To Start A Website for Writers, Artists, and Creative Types</strong> will lead you step-by-step through everything you need to establish your online platform.  </p>  <p style=\"\">  \t  You’ll learn in detail exactly how to set up your own website, make it look just your style, and post updates about your work to connect with new fans.  Whether you’re experienced with technology or still prefer writing with an old-fashioned quill, this course will make managing websites and online interactions with readers accessible, easy, and fun.  </p>  <p style=\"\">  \t By the end of the course, you’ll have a solid foundation in website setup and management, along with all the skills you need to keep up the site and start interacting with your fans. The course uses clear and detailed video and text lectures to show you exactly what to do to set up your site. Whether you&#039;re experienced with computers or not, you&#039;ll be able to follow along at your own pace.  You&#039;ll have lifetime access to all the lessons here as you build your site.  </p>  <p style=\"\">  \t <strong style=\"\">How To Start A Website for Writers, Artists, and Creative Types</strong> is an ideal course for anyone who has a creative drive. Whether you&#039;re a bestselling author or are just starting to learn your craft, a website is an important part of your career.  </p>  <p style=\"\">  \t Most of the advice about websites isn&#039;t geared for artists and creative types; so this course focuses specifically on the needs of creatives. We make sure the website is part of the process, so it doesn&#039;t sap all your creative energy.  </p>  <p style=\"\">  \t After you&#039;ve finished <strong style=\"\">How To Start A Website for Writers, Artists, and Creative Types</strong>, you will know how to:  </p>  <ul style=\"\">  \t<li style=\"\">fit a website into your creative process</li>  \t<li style=\"\">find a great domain name and site address</li>  \t<li style=\"\">reserve your domain</li>  \t<li style=\"\">get the right kind of website for the long career</li>  \t<li style=\"\">find the best hosting for your site</li>  \t<li style=\"\">navigate your host&#039;s control panel</li>  \t<li style=\"\">keep several websites under your hosting account</li>  \t<li style=\"\">install WordPress, the industry-standard blogging platform</li>  \t<li style=\"\">log in and manage your WordPress Dashboard</li>  \t<li style=\"\">update and customize your WordPress site</li>  \t<li style=\"\">browse, install, and active the perfect Theme</li>  \t<li style=\"\">add key information Pages about yourself and your work</li>  \t<li style=\"\">keep new fans up to date with the latest Posts</li>  \t<li style=\"\">lead site visitors to key information with your Menu</li>  \t<li style=\"\">and much, much more!</li>  </ul>", 
    "end_date": null, 
    "title": "How To Start A Website for Writers, Artists & Creative Types", 
    "price": 0, 
    "instructors": "Baker Lawley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/187850_eaf9_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-website-for-writers-artists-creative-types/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-24T15:00:35Z"
}