{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                3 years ago we decided to jump feet first into the wonderful world of startups, building our business while both working full time jobs. It has been an amazing ride  and our business now has several thousand customers world-wide, including many of the largest brands in the world.  </p>  <p>  \t                Over the past couple of years we&#039;ve presented our story at various conferences and speaking events, and have had received countless requests to develop a structured online course.</p>  <p>  \t                This comprehensive course takes on from our successful presentation and turns it into a step-by-step guide for you. This is a recipe for creating a successful startup, explained with practical examples based on our own experiences. You won&#039;t just hear the theory of startup/product development, you&#039;ll hear about our experiences from putting these ideas into practice and invaluable advice for your journey.  </p>  <p>  \t      You will learn how to launch a startup that is lean and cost-effective, design gorgeous products if you are not a designer, drive traffic and find customers and set your self up for the long term. We&#039;ll give you suggestions for excellent online services that you can leverage to build your startup - reducing the amount of work you&#039;ll need to do.  </p>  <p>  \t      This is a practical, hands-on course (no fluff, vague theory or buzzwords!) that will equip and inspire you to tackle a startup of your very own.</p>", 
    "end_date": null, 
    "title": "How we built a successful startup – our guide from A to Z", 
    "price": "20.00", 
    "instructors": "Peter Sbarski, Samuel Kroonenburg", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/435456_0074_2.jpg", 
    "course_url": "https://www.udemy.com/how-we-built-a-successful-startup/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-01T05:44:38Z"
}