{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Building a successful new product and brand is an incredible experience</strong>. Startups all over the world are tackling new opportunities, 100-year-old corporations are investing millions in the next big thing...yet time and time again, <strong style=\"\">talented people build products that never succeed.</strong></p><p style=\"\"><strong style=\"\"></strong><em style=\"\">  &quot;</em><em style=\"\">I&#039;ve seen <strong style=\"\">so many startups struggle and build something that no one wants</strong> wasting precious time and resources. <strong style=\"\">I&#039;m going to force entrepreneurs to take this course</strong> so that they end up building something the customer needs the first time around!&quot; - John Peterson</em></p><p style=\"\">At the core of all successful products and marketing is knowing <strong style=\"\">who your customers are, what they need, and why they need it.</strong> And you won&#039;t get the answers to these make-or-break questions by having a bunch of meetings within your company — you get them from talking to your customers!</p><p style=\"\">In fact, <strong style=\"\">two hours of customer interviews can literally save you 6 months of building the wrong thing. </strong></p><p style=\"\"><strong style=\"\">You learn who your customers are, what they need, and why they need it</strong>. You learn what to build, and what not to build. You&#039;re marry your vision with customer understanding to hit the sweet spot.</p><p style=\"\"><strong style=\"\">People know this, but few actually do interviews</strong>… </p><ul style=\"\"><li style=\"\">Where do I find people to talk to? </li><li style=\"\">What do I ask them? </li><li style=\"\">Can&#039;t I just send around a survey? </li><li style=\"\">How do I not bias or lead them? </li><li style=\"\">How do I turn these interviews into tactical takeaways? </li><li style=\"\">How do I get my boss or colleagues to buy in?</li></ul><p style=\"\">We created this course specifically to answer those questions. I&#039;ve worked with and trained hundreds of product teams from venture backed startups, to accelerators such as TechStars, to corporate innovation labs and product teams.</p><p style=\"\">Knowing how to effectively interview potential customers is key, and if you work with products or want to enable product success, I&#039;d like to cordially invite you to take a straight and to-the-point dive into Customer Interviewing for New Product/Brand Success. See you in the course!</p><p style=\"\">P.S. Here&#039;s what past students have had to say:</p><p style=\"\"><em style=\"\">&quot;<strong style=\"\">This tactical approach to validating demand for a new product/service is arguably the best resource</strong> I&#039;ve come across when it comes to refining my practice of &quot;lean startup&quot; principles.&quot; - Rob Caucci</em></p><p style=\"\"><em style=\"\">&quot;I&#039;ve worked with many startup teams and <strong style=\"\">using the interviewing methods outlined in this course, we&#039;ve been able to make decisions on how to move forward with our product</strong> based on actual evidence versus our assumptions.&quot; - Andrea Luxenberg</em></p><p style=\"\"><em style=\"\">&quot;<strong style=\"\">I&#039;ve attended Sam&#039;s workshops in NYC, and this course captures his exact style: direct, informative, actionable.</strong> I love having all this content at my fingertips now.&quot; </em><em style=\"\">- Steve Dean</em></p>", 
    "end_date": null, 
    "title": "How-To: Customer Interviewing to Create Successful Products", 
    "price": "45.00", 
    "instructors": "Sam Hysell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502334_63c5.jpg", 
    "course_url": "https://www.udemy.com/customer-interviewing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T20:43:29Z"
}