{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong></p>\n\n<p>Hypnosis for Attracting the life you desire guided Hypnosis has been created to give you a similar experience to having a private hypnotherapy session with me.<br></p><p>in this course Hypnosis will help you learn to open your mind to creating new opportunities to create and attracting to you and you to the perfect situations for creating the best life you could never even imagine  by programming your mind with Hypnosis </p>\n\n\n\n\n\n\n\n\n\n<p>You will also be able to eliminate self sabotaging thoughts and feelings that have been a barrier to your success, not only that but you will also be able to eliminate any thoughts or feelings of guilt that have been holding you back and contributing to any self sabotage.</p>\n\n\n\n\n\n\n\n\n\n<p>How you are going to do this is by learning how to apply an easy technique called EFT that I will teach you in the bonus section of this course. But not only that i will guide you through two specially recorded sessions of EFT I created for this course to eliminate guilt and self sabotage.</p>\n\n\n\n\n\n\n\n\n\n<p>Hypnosis for Attracting the life you desire guided Hypnosis course will teach you <br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>1. You will begin by creating an image in your mind of what you want so that you will know where you are going and what you want to be successful at.</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>2. How hypnosis will work for you</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>3. learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>4. Learn how you naturally resist changes even changes that can be very good for you</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>5. Learn just how powerful words can be and their effect on you physically even if they are only self talk.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>6. Learn who can and cannot be hypnotized</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>7. Learn how you can feel amazing any time you want to</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>8. Hypnosis : Attract Wealth Mind Programming Hypnosis</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>1. Attract Unlimited Wealth Hypnosis</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>2. Assertiveness Hypnosis</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Hypnosis Course Bonus </em></p><p><em>How to use and apply EFT  an amazingly powerful technique that can eliminate any limiting bad feelings also</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>1. Release Negative Beliefs That Sabotage Your Abundance</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>2. </em><em>Release Self Sabotaging Feelings Of Guilt</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em><strong>All Files and videos are downloadable for easier access</strong></em></p>", 
    "end_date": null, 
    "title": "Hypnosis for Attracting the life you desire guided Hypnosis", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433996_b0a2_2.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-for-attracting-the-life-you-desire/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T11:40:52Z"
}