{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><span></span></p><p><span>Warren Buffett once said you just need the basic math to become a successful investor. This course will help you get better in resolving problems and making decisions while using simple math. Ever wonder how big successful entrepreneurs and investors, like Warren Buffett got his abilities in decision making? This course will show you their path. </span></p><p><span><strong>Start thinking like the great investor Warren Buffett and change your life.</strong></span></p><p>  \t<span>Farnam Street Invest presents this brand new course on Mathematics. In this Improve your Decision-making Course you'll learn about mathematics for finance with a practical and simple approach that makes fundamental concepts easy to grasp. </span> It is imperative to understand how Math and Business work together and how it has shaped the world in which we live in.</p>  <p>  \t    In this course you'll find:  </p>  <ol>  \t<li>Important concepts commonly used in business and investments.</li>  \t<li>Clear and easy to understand mathematical concepts. </li>  \t<li>Curious and dedicated minds interested in understanding human behaviour .</li>  </ol>  <p>  \t        This course is aimed at everyone who wishes to learn more about the economy and its parts, mainly the financial markets. The ways the financial markets are interlinked make them crucial for living in the present information era. The evolution of the Markets and of Mathematics is astounding and can be seen everywhere in today's world.</p>  <p>  \t        In this course you'll get lots of knowledge and information about how Mathematics and Business evolved together and how many businessman, investor, mathematicians and scientists have been using and developing Mathematics to mutual advantages.</p><p> However, we'll also explore other areas of interest for our topic: Decision-making Process. So expect to hear about Physics, Philosophy, Economics and much more as we dive into the complex and wonderful world of Math &amp; Business.  </p>", 
    "end_date": null, 
    "title": "Improve Your Decision Making: Simple Math to Help Business", 
    "price": "20.00", 
    "instructors": "Lucas Couto", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371390_14df.jpg", 
    "course_url": "https://www.udemy.com/improve-your-decision-making/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T10:33:42Z"
}