{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>¿Quieres innovar para crear valor, generar impacto y dejar tu huella en el mundo pero no sabes por dónde empezar?\n</p>\n\n<p>En la comunidad <strong class=\"redactor-inline-converted\">OpenDistillery</strong> estamos convencidos del potencial que \ntiene la innovación de mejorar la calidad de vida de las personas, y la \ncompetitividad de las organizaciones.  Pero sabemos que Innovar conlleva\n retos importantes: la falta de un proceso estructurado, equipos poco \npreparados, paradigmas culturales, dudas respecto al retorno en la \ninversión y resistencia al cambio entre otros.\n</p>\n\n\n\n\n\n\n\n<p> Para afrontar estos retos y descubrir el valor que agrega la \ninnovación a todos los procesos productivos, le hemos apostado a un \nproceso de colaboración inspirado en los métodos y herramientas de \n<strong class=\"redactor-inline-converted\">Design-Thinking</strong> y <strong>Lean Startup</strong>.\n</p>\n\n\n\n\n\n\n\n<p>Las herramientas del campo del Diseño nos han permitido entender al \ncliente en un nivel emocional para validar el potencial de las ideas y \ndestilarlas a través de un proceso de innovación que nos permita \nconstruir modelos de negocio sostenibles, rentables y escalables.\n</p>\n\n\n\n\n\n\n\n<p>Queremos promover y difundir este proceso, validado con más de 2700 innovadores tanto de grandes empresas, como emprendedores en etapa temprana, y que se expanda su potencial por toda América Latina para que cada vez más personas tengan a mano herramientas prácticas para mejorar su calidad de vida a través de la innovación.</p>\n\n<p><strong class=\"redactor-inline-converted\">¿Qué está incluido en el Curso?</strong></p>\n\n\n\n<ul><li>Acceso Ilimitado, tú decides cuando inicia y cuando termina.</li><li>30 días de garantía de devolución</li><li>17 Clases</li><li>1,5 horas de Vídeo</li><li>13 herramientas descargables en PDF</li></ul>\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>\n<strong class=\"redactor-inline-converted\">Te invitamos a unirte a imaginar un mundo mejor desde la innovación. Estamos ansiosos de co-crear contigo! </strong>\n</p>", 
    "end_date": null, 
    "title": "Innovación Destilada: de la Creatividad a los Resultados", 
    "price": "50.00", 
    "instructors": "Alejandro Rios, Christian Piraquive-Seligman, Carlos Jaramillo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404502_88ee_2.jpg", 
    "course_url": "https://www.udemy.com/innovacion-destilada/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T16:41:03Z"
}