{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Take a look around yourself as you are reading this. All the stuff that you see has elements of innovation in it. Even text that you are reading and the machine/device on which you are reading is outcome of series of innovations. Innovation is an inherent part of human evolution and will continue to remain so. Behind all these innovations are people. Look at some of the great innovators like James Watt, Edison, Micheal Jackson,Steve Jobs etc. They were faced with various problems, as we all do, what differentiated them was that they went around looking to solve that problem. It is an inherent part of you as well. All you got to do is unbox it further and unleash yourself and maybe you will come with something which will put you in the league of innovators just mentioned. Sometimes it just takes a little push to achieve that. This and more that I discovered on my journey of coming with various ideas and filing various patents and along the way enabling others as well.I have captured some of the learning in this course which I hope will be of value to you. The course will cover techniques for idea generation,idea distillation, idea research and refinement, brainstorming, prototyping, patenting and preparing pitch.Whether working on your own or pitching to an investor or going in for a contest or pitching inside your organization, these techniques &amp; tools will help you in your journey of innovation. This course will further sharpen your skills and take your innovative self and your organization to the next level.  </p>", 
    "end_date": null, 
    "title": "Innovation Kickstart", 
    "price": "20.00", 
    "instructors": "Ganesh Sahai", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/102638_43c6_5.jpg", 
    "course_url": "https://www.udemy.com/innovation-kickstart/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-07T17:25:20Z"
}