{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">The biggest problem for marketing your artwork is not knowing where to start. The second biggest problem after that is starting, failing, and getting discouraged. This course aims to alleviate that fear and risk of failure, and to give you a blueprint to be successful on Instagram.</p><p style=\"\">Instagram has an engagement rate that&#039;s higher than any other social media site. On top of that, it is image based, meaning that it&#039;s the perfect platform for any visual artist to start growing an audience, and cultivating collectors.</p><p style=\"\">In this course, you&#039;ll learn a lot of different skills, but mainly: <strong style=\"\">how to attract over 10,000 targeted followers in less than a year</strong>.</p><p style=\"\">You will learn how to engage your audience, how to cater to their wants, and eventually, how to turn that audience into loyal followers and collectors.</p><p style=\"\">By taking this course, your follower count will skyrocket. The number of likes and comments that you get will astonish you. Say goodbye to buying paid ads on Facebook or any other platform - you&#039;ll learn exactly how to utilize Instagram and tap into a collector-base that you didn&#039;t even know existed. You&#039;ll learn exactly how to go from a starving artist to a paid professional, while utilizing only a few hundred dollar advertising budget.</p><p style=\"\">So if you&#039;re an artist currently struggling with marketing, then this is the perfect course for you.<br style=\"\"></p><p style=\"\">Sign up now to learn the skills, tips, and tricks, that will be making you money while you sleep. With this course, you&#039;ll be one step closer to making it, and one step closer to forgetting all that bad business advice that your friends gave you.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Instagram for Artists: A Step-by-Step to Getting 10,000 Fans", 
    "price": "20.00", 
    "instructors": "Max Weber", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450094_ccaf_5.jpg", 
    "course_url": "https://www.udemy.com/instagram-marketing-for-artists-skyrocket-your-of-fans/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T07:12:41Z"
}