{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Install WordPress on Localhost | PC, Laptop or Mac &amp; Move your localhost WordPress website to your shared hosting server / VPS</strong></p>\n\n<p>This course is all about how to <em>install WordPress</em> in your laptop as well as in your hosting server and how to transfer it from localhost to server.</p>\n\n<p>You will also learn, where to get a free domain and a free hosting package to kick-start your learning process. Once you're comfortable with WordPress installation on your PC / free hosting, then if you want more speed and features you can move onto my list of recommended Premium hosting packages, with ease.</p><p>This course will also guide you on, how to move your working localhost website from your localhost (or one hosting provider to another) to your online server.</p>\n\n<p>You can complete this course in a lunch break or a couple of tea breaks - It's just an hour course. This course is organised in the following manner:</p>\n\n<p>&gt; Course Introduction</p>\n\n<p>&gt; Install WordPress in your Laptop and Server using XAMPP (manually), Bitnami (automatic)<br></p><p>&gt; Move your localhost website to Online hosting server</p>\n\n<p>&gt; Install WordPress in your Free hosting server<br></p><p>&gt; Where to buy Paid Domain and Premium Hosting?</p>\n\n<p>&gt; Final Quiz</p>\n\n<p>If you want to learn and try WordPress before you want to buy premium hosting package then the best way is to try <strong>installing WordPress in your laptop or desktop PC / Mac</strong>. This course will guide you to do that.</p>", 
    "end_date": null, 
    "title": "Install WordPress Locally + Move Localhost Website to Server", 
    "price": "20.00", 
    "instructors": "Arun Nagarathanam, Sharomena Aarthi", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702214_9cfe.jpg", 
    "course_url": "https://www.udemy.com/wordpress-install/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T15:43:55Z"
}