{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is the introduction to the full course called <strong>Quantum Leap Your Business in 6 Weeks.</strong> But, don't worry, this intro course is FILLED with TONS of valuable, immediately useful information and strategies that you can use to take your business to the next level. We have personally used these exact tools to create rapid success, and in this program we are offering you OUR proven, step-by-step process.</p>  <p><strong>This program is for you if:</strong></p>  <ul><li>You’re a small business owner, budding entrepreneur, life coach, practitioner, or you’re plotting your escape from the corporate box </li><li>You want to either start a business or expand a current one</li><li>You want to do what you love and get paid for it</li><li>You want your business to work for you instead of feeling like you are a slave to it</li><li>You’re ready to create a thriving business now, not 5 years from now</li><li>You want to commit to a “real” business strategy, not just a short term gimmick</li></ul><p><strong>What this program is NOT:</strong></p>  <p>Most people who buy any “how to grow a business” training will not make any money, whatsoever. In this program our rules are:</p>  <p>No “fake experts”</p>  <p>No “do nothing, get paid”</p>  <p>No “get rich quick”</p>  <p><strong>In this course you’ll learn how to:</strong></p>  <ul><li>Turn your ideas into <strong>concrete strategies</strong> and action steps</li><li>Create<strong> rapid growth</strong> in 6 simple steps</li><li>Discover your tribe of <strong>ideal customers</strong></li><li>Find additional<strong> revenue streams</strong></li></ul>                  If any of this resonates with you I've got GREAT news for you – you are SO in the right place right now!", 
    "end_date": null, 
    "title": "Intro to Quantum Leaping Your Business", 
    "price": "20.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/82982_955e_5.jpg", 
    "course_url": "https://www.udemy.com/intro-to-quantum-leaping/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-24T02:38:05Z"
}