{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Starting your own business is <em>scary</em>. <strong><em>Really scary</em>.</strong></p><p>How do you know if your idea is any <em>good</em>? Or if your customers will <em>ever</em> show up?</p><p>How do you know... what you're doing <strong>AT ALL</strong>?</p><p>There's no place, degree, or university that can teach you how to become a successful Entrepreneur.</p><p>You just have to get out there and learn everything for yourself. <em>One step at a time....</em></p><p><em>Right?</em></p><p><strong>Wrong.</strong></p><p>Entrepreneurship is not a mythical, illusive creature and it's not a secret that's hidden behind doors.</p><p>You <strong>CAN</strong> learn how to become a successful Entrepreneur and you <strong>CAN</strong> learn how to prepare yourself.</p><p>In this course, we're going to do just that.</p><p>You're going to learn everything you need to know about being an Entrepreneur, like:<em></em></p><ul><li><em>The core concepts</em></li><li><em>How to think like an Entrepreneur</em></li><li><em>What you should care about and conversely ignore</em></li><li><em>How to go about gathering the resources you need to tackle your dream</em></li></ul><p>And when you're completely ready to go toe to toe with any \"<em>veteran</em>\" business owner out there, you're going to learn something they wish they knew: </p><p><em>How to consistently come up with insightful, actionable business ideas</em></p><p><strong>It's everything you need to get started. </strong></p><p>You'll go from 0  to Entrepreneur in no time.<strong> Join the course</strong></p><p>--------------------------------------------------------------------------------------------------------------------</p><p><strong>About the instructor:</strong></p><p>Top rated Udemy Instructor with over <strong>650+ 5 star reviews</strong>.<br></p><p>Teaches <em>9 different courses</em> on Entrepreneurship, <em>with over 20,000 students enrolled</em>.</p><p>All courses by the instructor have are rated an average of <em>4.97 out of 5 stars.</em></p><p>+ Worked as a VC and was in charge of deal flow in Silicon Valley. Oversaw investments in large companies like Facebook, LinkedIn, &amp; Tesla.</p><p>+ Startup founder for 5 years, raised 3 rounds of capital worth several millions of dollars.</p><p>+ Currently Director of a Digital Agency that specializes in taking ideas from raw concept all the way to launch.</p>", 
    "end_date": null, 
    "title": "Intro to Entrepreneurship: Get started as an Entrepreneur", 
    "price": "30.00", 
    "instructors": "Evan Kimbrell", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662354_4ff7_7.jpg", 
    "course_url": "https://www.udemy.com/intro-to-entrepreneurship-get-started-as-an-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T19:38:06Z"
}