{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t Do you have a great idea for a business? Set it up is easy. If you feel lost and not know where to start or simply want to check if it is real option for a living, this course is for you.</p><p>Within this itinerary we will share with you real experience of entrepreneurship. You will notice That brands : such as \"Bugs Bunny\", \"Mickey Mouse\" or \"Pocoyo\" are not only the result of a great idea. Thanks to teamwork, creativity and sales strategy, are icons of animation industry. Learn to Develop creative ideas , and start your business With This experience, without dying in the Attempt.</p><p>And finally, imagine you want to work at Microsoft and coincides in an elevator with Bill Gates. Or are you looking for funding and to chat with friends You have with a investor potential Who is About to leave. In this course You will also learn to master the art of convincing in the shortest possible time, to sell and sell your business ideas , successfully.</p><p><strong>synopsis</strong></p>\n\n\n\n<p>  \t   This itinerary is undertaking a comprehensive program consisting of 3 courses YPD to develop your ability to undertake and realize your business ideas:  </p>\n\n\n\n<p>  \t 1. How to set up your business in 10 sessions (business plan)  </p>\n\n\n\n<p>  \t 2. How to build your business without dying in the attempt (EXPERIENCE CARTOON)  </p>\n\n\n\n<p>  \t 3. Learn to sell in 30 seconds (ELEVATOR PITCH)</p><p><strong>authors</strong></p>\n\n\n\n<p>  \tFranco Soldi (Founder &amp; CEO Captain YPD)</p>\n\n\n\n<p>  \t\"Jary\" Juan Antonio Ramos-Yzquierdo (Chief Operations Officer &amp; YPD Captain)  </p>", 
    "end_date": null, 
    "title": "Itinerario de Emprendimiento", 
    "price": "25.00", 
    "instructors": "YPD Young Potential Development", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151732_fe55_2.jpg", 
    "course_url": "https://www.udemy.com/itinerario-de-emprendimiento/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-24T00:33:46Z"
}