{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  This private course is for members of Anton's Dropshipping Course and is intended as a supplementary guide to help jumpstart your success. </p>  <p>  \t  This course is designed to take you through the entire 2 month journey from niche selection, knowing when you are ready to call suppliers and to getting your first sale.</p><p>With easy to follow video tutorials, my goal is to make sure everyone who takes this course has a profitable dropshipping store by the end of your 8 weeks. <br><strong><br></strong></p><p><strong>Prerequisites: </strong><br></p><ul><li>You must already be a member of Anton's Dropshipping Course (AntonMethod dot com)<br></li></ul><p><em>*If you're not yet a member please look at my website under my profile on the left and check out Anton's Dropshipping Course in my Recommended Resources Page or go to JohnnyFD dot com</em></p><p><em><br></em></p><p><strong></strong><strong>Take this course to get:</strong><br></p><ul><li>Step by step guidance on starting a successful store</li><li>Tips on Niche Selection </li><li>Three bonus ways to find niches if you are stuck</li><li>Goal setting worksheets and examples</li><li>A checklist to know when you're ready to call suppliers</li><li>The 80/20 rule to getting your first sale</li><li>How to optimize your store for more conversions</li><li>What to do after you've started making sales</li></ul><p><br></p><p>Included is an introduction and mindset video, niche selection help, how to check out the competition, the 80/20 rule to success in drop shipping, extra niche selection help, and a video to know when you are ready to call suppliers.</p><p>See you inside the course!</p>", 
    "end_date": null, 
    "title": "Jump Start Success - Dropship Ship Lifestyle - Dropshipping", 
    "price": "50.00", 
    "instructors": "Johnny FD Jen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430706_717c_5.jpg", 
    "course_url": "https://www.udemy.com/antonmethod/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T06:57:13Z"
}