{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Last Updated February 2016 / Shall be adding more content if response is good enough and if there is changes in the JVzoo platform  </p>  <p>  \t***************************************\"  </p>  <p>  \t<strong>Finally, Discover How You Can Sell Your Product on the JVZoo Instant Affiliate System And Tap Into Thousands of Affiliates... Starting Today!\"</strong>  </p>  <p>  \t-Do you want to make more money with your existing product  </p>  <p>  \t-Does an extra IPHONE / IPAD appeal to you  </p>  <p>  \t-Maybe a nice vocation or even a treat to your favorite restaurants  </p>  <p>  \t- Do you have a product to sell that can be delivered online?<br>  \t- Do you want to accept PayPal payments?<br>  \t- Do you want others to sell your product for you?<br>  \t- Do you want the ability for JVZoo to pay your affiliates INSTANTLY and not have to worry about when and who to pay?<br>  \t- Do you want access to a dynamic and powerful sales funnel system to setup your upsells and downsells with ease?<br>  \t- Do you want to share your profits with your Joint Venture partners, or give your graphic designers, JV brokers and more a percentage of the sales without worrying about doing it all manually?  </p>    <p>  \tIf you answered yes to any of these questions, then JVZoo is your solution.  </p>  <p>  \tIn this 10 Parts Course you do learn everything about how to get started with JVZoo  </p>  <p>  \tJVZoo is the solution to tap on the biggest affiliate marketers. They are constantly and eagerly looking to promote your product for you.  </p>", 
    "end_date": null, 
    "title": "JVZoo Affiliate Marketing Get Yourself An Army of Affiliates", 
    "price": "20.00", 
    "instructors": "Mr Edward Link", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386208_ab9f_13.jpg", 
    "course_url": "https://www.udemy.com/jvzoo-affiliate-marketing-get-yourself-a-army-of-affiliate/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T00:59:32Z"
}