{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>To make sure this course is for you, ask yourself the following questions:</strong></p><ul><li>How much profit does my biggest client bring?</li><li>Would I like to have more clients like that?</li><li>Would it be worth it to invest two hours of my time, even if I could just close one more dream client?</li><li>How would my life and my company be different if thanks to this course I could multiply the number of dream clients by ten?</li><li>At this moment, am I really applying a successful strategy to bring and close more dream clients?</li></ul><p>Most companies, primarily small and medium size companies, don’t have a marketing strategy specifically design for landing big clients.</p><p>In this course you will learn the strategy that we used to go from 2 or 5 dream clients a year to 60 to 80 every year.</p><p>This is a strategy to attract the kind of clients that can have a great impact in the annual invoicing of your company, in your prestige, in your income. Those clients that can change the year results in an instant, and secure your stability for a long time.</p><p>It is an extremely low cost marketing plan (approximately $3/month per prospect). With the equivalent to a salespersons salary you could implement this campaign to target between 1,000 to 2,000 big accounts a month. Would it be worth even if you just close 5 of those big companies?</p><p>By the end of this course you will have a plan with a calendar of the steps to follow to attract you dream clients list<br></p><p>WHAT THIS COURSE IS NOT:</p><ul><li>Is not a sales technique course</li><li>Is not a cross-selling or up-selling course</li><li>Is not a email marketing course</li><li>Is not a social media selling course</li><li>Is not a closing techniques course</li><li>Is not a inbound marketing course</li></ul><p><span></span></p>", 
    "end_date": null, 
    "title": "Key Account Management - Increase By 10 Your Large Accounts", 
    "price": "30.00", 
    "instructors": "Gustavo Escobar Henríquez", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/623704_54d0.jpg", 
    "course_url": "https://www.udemy.com/key-account-management-sales-training-and-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-27T13:13:52Z"
}