{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">It goes without saying that a solid presentation can be the difference between winning a piece of new business, raising that next round of financing, getting that long overdue raise and taking the next step in your career. </p><p style=\"\">The counterintuitive thing is, having high quality ideas and producing results just isn&#039;t enough in todays hyper competitive workplace. </p><p style=\"\">I personally can think of very little more frustrating than someone failing because they were unable to present their results in a clear, logical and convincing way. </p><p style=\"\">Furthermore, the amount of times I&#039;ve seen executives and decisions makers get held up because of design issues, even though they likely know very little about design, it&#039;s almost comical. </p><p style=\"\">With the above in mind, how is the modern executive / entrepreneur supposed to get ahead? It&#039;s actually fairly simple... </p><p style=\"\">In order to succeed in today&#039;s highly competitive, highly technical world, you need to be able to both produce results and present in a compelling way. </p><p style=\"\">Luckily, this course will provide you with everything you need to know to create a logical, professionally designed and most importantly winning presentation that will allow you to spend more time focusing on your work and sharing your ideas with others. </p><p style=\"\">More specifically, this course is going to teach you:</p><ul style=\"\"><li style=\"\">How to rebuild a number of real world winning templates</li><li style=\"\">How to present any idea in a logical, convincing way</li><li style=\"\">How to build a template that you can repurpose for any presentation</li><li style=\"\">How to use hotkeys and shortcuts to speed up the time it takes to build a presentation</li><li style=\"\">Presentation design best practices</li><li style=\"\">How to replicate any presentation</li></ul><p style=\"\">How to use each tool within Keynote to its fullest potential</p><p style=\"\">Even better yet, I guarantee this course will help take your business or job to the next level. I&#039;m able to make this guarentee because I&#039;m going to give you:</p><ul style=\"\"><li style=\"\">The exact templates I&#039;ve used to win over $5 million in business</li><li style=\"\">A simple to replicate presentation framework</li><li style=\"\">An easily editable, reusable template</li><li style=\"\">A modern design philosophy that anyone can replicate</li><li style=\"\">And every tip and trick in the book to make presentations faster than anyone you know</li></ul><p style=\"\">When you&#039;re done with this course, you&#039;ll have everything you need to grow your business, raise that round of financing, win that big pitch, impress your boss and take your professional life to the next level. </p><p style=\"\">REMINDER: This is a risk free purchase with Udemy&#039;s 30 day money back guarantee. Just imagine what life would be like if within the next 30 days you had everything you needed to build an unlimited number of winning presentations. </p><p style=\"\">Best, </p><p style=\"\">Alexander French </p><p style=\"\">P.S. Due to the recent launch of this course, the course is currently priced at a discount. I plan to increase the price in the near future so sign up at the current price while you can!</p>", 
    "end_date": null, 
    "title": "Keynote Presentations For Beginners 2016", 
    "price": "20.00", 
    "instructors": "Alexander French", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555764_19a5.jpg", 
    "course_url": "https://www.udemy.com/keynote-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T22:46:49Z"
}