{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      Course updated January 2015.  </p>  <p>  \t      Only 1,000 people have raised more than $100,000 on Kickstarter.  </p>  <p>  \t<u style=\"\"><strong style=\"\">How did they do that?</strong></u>  </p>  <p>  \t             I interviewed 6 Kickstarter Expert to ask just that.  Each expert has raised between $50,000 and $500,000 and knows exactly what it takes to create a campaign that delivers well beyond expectations.  We get deep into the detail of how the experts planned, executed and delivered their campaigns.  By taking this course you will be able to understand the steps they took and replicate their success.  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t             This course covers:  </p>  <ul style=\"\">  \t<p>  \t\t<strong style=\"\">Creating your campaign: </strong>How the experts created with their campaign, video and project page and made them stand out.  \t</p>  \t<p>  \t\t<strong style=\"\">Planning:</strong> How you should plan out your campaign beginning to end. What the experts did and what worked for them.  \t</p>  \t<p>  \t\t<strong style=\"\">Launch day: </strong>A minute-by-minute plan for launch day.  \t</p>  \t<p>  \t\t<strong style=\"\">Marketing and promotion:  </strong>Once you’ve created your campaign, it’s time to let the world know it exists. The experts will explain how they marketed their projects to get great results.  \t</p>  \t<p>  \t\t<strong style=\"\">Project fulfilment: </strong>How to deliver on your promises to backers  \t</p>  \t<p>  \t\t<strong style=\"\">Tips &amp; Tricks:</strong> Little known tips and tricks that can make a massive difference in execution as well as key crowdfunding mistakes and pitfalls to avoid  \t</p>  </ul>  <p>  \t             Cram through this course in a day or take your time over 3.  </p>  <p>  \t    You should take this course if you don't want to waste time second guessing what works and doesn't work. The Experts have crowdfunded their own ideas using these techniques, and they'll tell you the mistakes they made for you to avoid.  </p>  <p>  \t<strong style=\"\">Whats included:</strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">6 expert interviews</strong>  </p>  <p>  \t             Detailed questions on how each Expert planned, managed and executed their campaign  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Checklists complied from interviews</strong>  </p>  <p>  \t             No need to hunt through each interview to figure out how to take immediate action. The key steps are outlined for you.  </p>  <p>  \t<strong style=\"\">Money back guarantee</strong>  </p>  <p>  \t  This course comes with a no-questions-asked 30 day money back guarantee. If you don't get what you need out of this course, I personally promise you will get your money back.  </p>  <p>  \t<strong style=\"\">NOW LETS GET STARTED</strong>  </p>  <p>  \tSignup to take the course today.  </p>  <p>  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Kickstarter: Crowdfunding Tips & Tricks to Fund a Campaign", 
    "price": "20.00", 
    "instructors": "Tom Eilon", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145860_5650_7.jpg", 
    "course_url": "https://www.udemy.com/hackkickstarter/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-12T14:41:23Z"
}