{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Kindle Launch Plan - Only 30 days to become Kindle Best sellers &amp; stay there!</strong><br><strong></strong></p><p><strong><br></strong></p><p><strong>Rosa's Online School:</strong></p><ul><li>Teaching <strong>8 Courses</strong> on Kindle &amp; Udemy Successes!</li><li>Teaching <strong>32 Courses</strong> on Music &amp; Piano Courses!</li></ul><p>OVER <strong>15,000 </strong>Successful students have already taken my online courses since July 2014 with <strong>382 - 5 Star Reviews</strong></p><p><strong><strong>Course Updated:</strong> January 1, 2016<br></strong></p><p><strong>++++++++++++++++++++++++++++++++++++++++++++++</strong></p><p><br></p>  <p>  \t<em>I thank people for writing reviews for me.  They help me to become a better instructor.  After reading some of the reviews, I realize my introduction is too thorough, so I have now shortened the introductory videos so that students can get into action with the Launching Plan.  :)  Thank you.</em>  </p>  <p>  \t  ---------------------------------------------------------------------------------  </p><p><strong>Listen to what her students are saying:</strong></p><p><strong>Jamie Brigg:</strong></p><p><strong>High Quality &amp; Actionable</strong></p><p><em>I have purchased several of Rose Suen's kindle books on Amazon and was delighted to see her here on Udemy. This Instructor is as professional and business savvy as they come. I learned a lot about Kindle in this course and HIGHLY recommend everything from this DYNAMIC teacher! 10-STARS</em></p><p><strong>Kim Regan:</strong></p><p><strong>Very Good Course</strong></p><p><em>Lots of great strategies and tips in this course. You will learn the WHY behind the suggestions of a pro author.</em></p><p><em>-------------------------------------------------------------------------------------</em></p>  <p>  \t<strong>How would you like to launch a new kindle book today and watch your book appearing in the Best Sellers pages within 30 Days?</strong>  </p>  <p>  \t                                        It's not as difficult as you may think. After this course, you will be convinced that you, too, can launch a new book into the Best Sellers page using my 30 Day Proven Method.  </p>  <ul>  \t<li>You will see case studies of how others have succeeded to become Best Sellers in 30 days. </li>  \t<li>You will see my case studies that it is possible to create such a success.</li>  \t<li>For the purpose of this course, I even launched a book on November 17, 2014 to show you that it can be done. Today, this book is on the Best Sellers pages in 2 categories already.  You can even check it live yourself.</li>  </ul>    <p>  \t<strong>Nothing is more frustrating and discouraging</strong> than writing a best selling book that gets hidden and buried behind millions of books in Amazon Kindle store.  Days, weeks and months go by and nobody is buying your book.  How can they buy your book? They don't even see your book on the bookshelf.  They don't even know your book existed.    </p>  <p>  \t                            This course is also going to show you <strong>\"how to revive your old kindle books\"</strong> that are already published on the bookshelf and turn them into Best Sellers.  </p>  <p>  \t<strong>The only way</strong> to get people to see your books is to bring your books to the <strong>Top 100 Paid Best Sellers</strong> pages right away.  </p>    <p>  \t<strong>The question is: </strong>Do you believe it is possible to become a Best Selling Author in your area of expertise in 30 days?  </p>  <p>  \t<strong>Here's the Secret of this Course:   </strong>Amazon wants you to succeed to become Best Sellers more than you know.  Amazon has built in a 30 day system for you to take that \"leap forward\" right at the beginning of your launch to take your book to Best Sellers page.  You have neglected the value of the first 30 day launch all along.  Perhaps you didn't even know it existed.  </p>  <p>  \t<strong>In this course,</strong>  you are going to tap into the power of this 30 Day Launch with my strategy and proven method.  </p>  <p>  \t                                        You are going to receive my complete system of how I launch my Kindle books in these 30 days.  I follow this system for all my books.  </p>  <ul>  \t<li>You see a real live book case study of a new book launched on November 17, 2104</li>  \t<li>You see a live case study that it is possible to revive your old kindle books to turn them to Best Sellers, even #1 as it did for my book.</li>  </ul>    <p>  \t<strong>    This complete 30 Day Book Launch will include:  </strong>  </p>  <ul>  \t<li>How to Tap into the power of KDP</li>  \t<li>Where to Promote your new book using free promotion sites</li>  \t<li>How to Promote your new book through various means</li>  \t<li>Advertise your paid book by paying $2 to this promotion site</li>  \t<li>How to Use my gold mine method to gather reviews in Amazon</li>  \t<li>Learn my trick and magic tip to boost your book higher in the Best sellers status</li>  \t<li>Know the kind of mistakes people often make</li>  \t<li>Avoid the mistakes so your account would not get banned</li>  \t<li>Know where to make changes to your books</li>  \t<li>How to look at your book thumbnails and make massive drastic changes</li>  </ul>  <p>  \t<strong>Follow</strong> through my 30 Day Proven Method.  </p>  <p>  \t<strong>    Use</strong> my strategy plan that works.  </p>  <p>  \t                                        Do <strong>not</strong> skip steps.  </p>  <p>  \t                                        Do<strong> not </strong>take short cuts.  </p>  <p>  \t<strong>    Plan</strong> smartly!  </p>  <p>  \t<strong>    Promote</strong> Wisely!  </p>  <p>  \t                                        +++++++++++++++++++++++  </p>  <p>  \t<strong>About Rosa's online course at Udemy:</strong>  </p>  <ul><li><em>Over </em><strong><em>15,000</em></strong><em> </em><em>very happy students already in my Udemy classes</em></li><li><em>See the </em><strong><em>5 Star Reviews</em></strong><em> from VERY satisfied students</em></li><li><em>You get free lifetime access</em></li><li><em>All videos are at your finger tips to watch anytime &amp; anywhere</em></li><li><em>All future extra lectures and upgrades are </em><strong><em>always free</em></strong></li><li><em>Unconditional Udemy </em><strong><em>30 day money-back guarantee</em></strong><em> and that's my personal promise to your success!</em></li><li><em>Join this happy family of students </em></li></ul><p>This is a long awaited dream many Kindle authors had longed for and you can make this dream come true for you today!<br></p>  <p>  \t<strong>    Enroll</strong> into the course and I will <strong>see you inside</strong>,  </p>  <p>  \t                                        Rosa  </p><p><br></p><ul><li><strong><em></em></strong></li></ul>", 
    "end_date": null, 
    "title": "Kindle Secrets #1: Kindle Launch to Kindle Best Seller ", 
    "price": "20.00", 
    "instructors": "Rose Suen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363578_1e6f_7.jpg", 
    "course_url": "https://www.udemy.com/tap-into-kindle-best-sellers-using-my-proven-30-day-launch/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T04:12:48Z"
}