{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>***UPDATE: </strong><em><strong>This course is completely updated as of June 2016***</strong></em></p>\n\n<p><em><strong>Join Over 1,000 Students In This Community!</strong></em></p>\n\n\n\n\n\n<p>--------------------------------------------------------------------------------------</p>\n\n\n\n\n\n<p>Have you ever thought about writing a book?</p>\n\n\n\n\n\n<p><em>Do you have a book, but it's not selling?</em></p>\n\n\n\n\n\n<p>Would you like to become more of an authority in your niche?</p>\n\n\n\n\n\n<p><em>Want to build a brand around your name?</em></p>\n\n\n\n\n\n<p>Can you use some extra cash?</p>\n\n\n\n\n\n<p><em>Would you benefit from a step by step plan to leave your day job?</em></p>\n\n\n\n\n\n<p><strong>If you answered yes to either all or even one of these questions, this course is for you.</strong></p>\n\n\n\n\n\n<p>Kindle Publishing Full Time is about creating a passive income business by self publishing books.</p>\n\n\n\n\n\n<p>_____________________________________________________</p>\n\n\n\n\n\n<p><em>\"I really liked the live over the shoulder walk through to find a profitable niche.\" -<em>jonathan chapman</em></em></p>\n\n\n\n\n\n<p>_____________________________________________________</p>\n\n\n\n\n\n<p>After taking this course, you will be able to develop a plan on how to create a full time income with Kindle publishing.</p>\n\n\n\n\n\n<p>There are over 22 lectures and counting in this course; there are also downloadable guides to take you through some of the lectures more in depth.</p>\n\n\n\n\n\n<p>The course will take about three hours to complete; but <strong>I will be adding lectures and updating the course accordingly.</strong></p>\n\n\n\n\n\n<p>The course is my step by step system of creating profitable kindle books that add value to readers while building a brand and creating a sizable income.</p>\n\n\n\n\n\n<p>__________________________________________________</p>\n\n\n\n\n\n<p><em>\"Finally, an easy to follow Kindle course for everyday people. I really appreciate that the instructor did a walk through on looking at profitable niches on Kindle without getting into elaborate software you have to buy to get the same results. \" -<em>Tiffany Nguyen</em></em></p>\n\n\n\n\n\n<p>__________________________________________________</p>\n\n\n\n\n\n<p>Kindle Publishing Full Time differs from other courses on the topic because it gives you a plan and goal with the intention of leaving your day job.</p>\n\n\n\n\n\n<p>Take this course if you want to learn from someone who is extremely transparent, is making a full time income from their books, and who loves sharing, teaching, and adding value to others.</p>\n\n\n\n\n\n<p><strong>Don't delay! Join now and begin building your Kindle Publishing empire today!</strong></p>\n\n\n\n\n\n<p><strong>***30 Day Money Back Guarantee, You have nothing to lose!***</strong></p>\n\n\n\n\n\n<p>Always wishing you the best,</p>\n\n\n\n\n\n<p><em>Argena Olivis</em></p>", 
    "end_date": null, 
    "title": "Kindle Publishing Full Time Passive Income System", 
    "price": "20.00", 
    "instructors": "Argena Olivis", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527684_ab5e_2.jpg", 
    "course_url": "https://www.udemy.com/kindle-publishing-full-time/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T22:49:47Z"
}