{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you been meaning set up systems to make money outside of your books?</p><p><em>Do you want email list of engaged readers?</em></p><p>Would you like to make diversify your income for more security?</p><p><em>Want to build a brand around your books?</em></p><p>Are you looking to build a sturdy foundation that will last?</p><p><em>Would you benefit from a step by step plan to set up the back end of your books?</em></p><p><strong>If you answered yes to either all or even one of these questions, this course is for you.</strong></p><p>Kindle Publishing Back End is about creating a real business out of your current book business. </p><p>After taking this course, you will be able to set up automated systems that will help you to sell more books, build a solid readership, and earn an income on the back-end. </p><p>There are over 17 lectures and counting in this course; all videos that have in depth tutorials on how to get started. </p><p>The course will take about three hours to complete; but <strong>I will be adding lectures and updating the course accordingly.</strong></p><p>The course is my step by step system to build a back end both for fiction and non-fiction authors. </p><p>Kindle Publishing Back End differs from other courses on self publishing because it gives you live examples on how to build a business around your books.</p><p>Take this course if you want to build a larger audience, feel more secure with your book income, and gain lifetime readers who convert into customers of other products you will offer in the future. </p><p><strong>Don't delay! Join now and begin building your Kindle Publishing Back End today!</strong></p><p><strong>***30 Day Money Back Guarantee, You have nothing to lose!***</strong></p><p>Always wising you the best,</p><p><em>Argena Olivis</em></p>", 
    "end_date": null, 
    "title": "Kindle Publishing Back End", 
    "price": "20.00", 
    "instructors": "Argena Olivis", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634190_649a_2.jpg", 
    "course_url": "https://www.udemy.com/kindle-publishing-back-end/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T23:22:16Z"
}