{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to my Course on Kindle Publishing &amp; How to Scale using Virtual Assistant’s<br></p>\n<p>This course will show you exactly how I make 5 new books a week and not do much of the work, whilst working a full time job…</p><p><u></u></p><p>There is a common problem I see often with Kindle Publishers, they seem to have this issue with being ‘Frugal’ and having ”superhero syndrome” - Basically, doing all the work themselves which limits progress,<br></p>\n<p>Not only they are….the publisher, but also they are niche research specialist, the writer, the book cover designer, the copywriter,the  ebook formatter and even flicking through hundreds of pages to obtain reviews.</p><p>It’s no wonder why they get frustrated—it’s just too much on their plate to handle…<br></p>\n<p>I will show you exactly, from start to finish, not only how to find and hire an amazing general virtual assistant, but I even provide you the copy and paste templates, the spreadsheets and also the FREE online tools that will speed up the process</p><p><u></u></p><p>Also, It doesn’t matter whether you are new to kindle, I will even show you another way to decrease your work load by up to 50% without having to hire a full time assistant…using some tools and my most favourite website in the world</p><p><u></u></p><p>This in turn ,will give you the ability to finally scale and free yourself from all that work load!<br></p>\n<p>There are some short term hacks to making money with Kindle but they are exactly that, SHORT TERM…</p>\n<p>This guide will give you the knowledge and tools to finally get down the fundamentals and create a LONG TERM process without sacrificing on quality and even optimising on quality!</p><p>Some other benefits that I will teach:<br></p><p><br></p><ul><li>I will explain the power of mind mapping</li></ul><ul><li>I will go through the process of Hiring your full team of workers….The assistant,s writers, graphics designers and even your team of reviewers</li></ul><ul><li>A hack that will save you from formatting a kindle book ever again</li></ul><ul><li>A hack that will complete your powerful kindle book title automatically for you</li></ul><ul><li>Free online tools and software that will put your production on steroids and get you finally organised</li></ul><ul><li>Be part of a community that provides each other with help and video tutorials to your workers</li></ul><ul><li>and much much more</li></ul>\n<p>It is my promise to you, that i will be constantly updating new videos and helping out as much as I can with your requests…</p><p><u></u></p><p>‘Kindle publishing - How to scale using virtual assistant’s’ - really is THE perfect resource for building your dream Kindle business with the help of using virtual staff.<br></p><p>So….What are you waiting for? Take a chance, don’t ever touch another review again!<br></p>\n<p> Take this course and let’s get you more money and more importantly….TIME</p><p>Purchase….RIGHT NOW, price will not be staying the same<br></p>\n<p> Thank you</p><p><strong>How long will the course to take to complete?</strong><br></p><p>This course will take you about 1.5 hours to watch, I recommend you to put it on x1.5 speed to increase speed and to evade my weird voice</p><p><strong>Why take this course?</strong></p><p>Stop doing ALL the work, if you really want to grow, you are going have to replace yourself</p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Kindle publishing - How to scale using virtual assistant’s", 
    "price": "50.00", 
    "instructors": "Phil Stone", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777166_b0c5_3.jpg", 
    "course_url": "https://www.udemy.com/kindle-publishing-how-to-scale-using-virtual-assistants/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-28T22:22:23Z"
}