{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Launch Your Venture is a Capture Your Flag course focusing on the emotional journey of entrepreneurship. We have found that there are plenty of courses on the logistics of entrepreneurship, but very few about the personal challenges that the entrepreneur goes through. This course covers those challenges that are faced not only by not by entrepreneurs but also by innovators inside companies, individuals starting charities, or anyone about to embark on a new venture.  </p>  <p>  \t    Through Capture Your Flag, Erik Michielsen has interviewed 75 near-peer exemplars over the course of the past five years. These exemplars have been experiencing the challenges of mid-career: starting ventures, having families, caring for parents, working for promotions, quitting jobs, impacting communities and realizing their potential.  </p>  <p>  \t    The magic of the near-peer exemplar is that they have just been through the challenges that you are facing now. Their story is your story, but a few years ahead.  </p>  <p>  \t    The power of longitudinal interviews filmed over a series of years is that you are able to follow their story rather than just getting a snapshot of their experience.  </p>  <p>  \t    Through examining hundreds of hours of video, we have seen a common thread in the entrepreneur&#039;s journey.  The Launch Your Venture course will take you through this journey by sharing the stories of some of our near-peer exemplars. It will inspire you to reflect on your experience, see where you are in your journey, and learn how to advance to the next steps.  </p>", 
    "end_date": null, 
    "title": "Launch Your Venture: Creating Your Entrepreneur Story", 
    "price": "20.00", 
    "instructors": "Erik Michielsen, JOE Houde", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/196500_1c6c_2.jpg", 
    "course_url": "https://www.udemy.com/launch-your-venture/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-09T19:13:15Z"
}