{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    If you&#039;re here, it&#039;s because you have an idea, but you&#039;re stuck. And chances are the &quot;stuck&quot; part is based on lack of money. You already have all the tools you need to launch and I&#039;m here to show you how! I was in your shoes, but I launched a business with less than $1,000. And I personally know plenty of others who have done so with just a few hundred bucks.  </p>  <p style=\"\">  \t  I didn&#039;t get lucky or suddenly find a windfall of money, I developed strategies that I want to share with you.  </p>  <p style=\"\">  \t    This course is not a &quot;get rich quick&quot; scheme, it&#039;s for serious entrepreneurs who are willing to work. This course is for those who need assistance thinking outside of the box, from someone who has faced every challenge imaginable. This course will not end in me telling you to launch a crowdfunding campaign (though they&#039;re awesome!), or to amass debt, or take out loans. Even if some of the tools and tactics ring familiar, I promise that you&#039;ll see them in a different way.  I firmly believe that you can start where you are to launch a successful, sustainable business.  </p>  <p style=\"\">  \t<em style=\"\">&quot;Yesterday, you said tomorrow.&quot;</em><strong style=\"\"> Enroll Today.</strong>  </p>", 
    "end_date": null, 
    "title": "Launch a business on budget: I did it, so can you!", 
    "price": "30.00", 
    "instructors": "Lizzy Okoro", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389176_dd82_2.jpg", 
    "course_url": "https://www.udemy.com/launch-a-successful-business-with-1k-or-less-i-did-it/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-09T04:38:02Z"
}