{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t We live in an age of unparalleled opportunity for innovation. With the advent of the Internet, cloud computing, and open source software, the cost of building products is at an all-time low. Yet, the odds of building successful startups haven’t improved much.  </p>  <p>  \t <strong style=\"\">Most startups still fail.</strong>  </p>  <p>  \t When entrepreneurs get hit by an idea they either rush towards building out their solution or rush towards finding investors. Both of these approaches take a lot of time and energy, and can be overwhelming.  </p>  <p>  \t <strong style=\"\">They are also backwards.</strong>  </p>  <p>  \t The number one reason startups fail is not because they fail to build what they set out to build, but because they spend too much time, money, and effort building the wrong product.  </p>  <p>  \t I attribute the entrepreneur’s, often unbridled and singular, passion for the solution as the top contributor to this failure. People place too much emphasis on the original idea but studies conducted on product success and failure tell a different story.  </p>  <p>  \t It has been statistically shown that most initial ideas don&#039;t work as anticipated. Rather, what separates successful entrepreneurs isn&#039;t starting with that perfect idea (or Plan A) but finding a plan that works before running out of resources.  </p>  <p>  \t <strong style=\"\">That last part is key.</strong>  </p>  <p>  \t This course will show you how.  </p>", 
    "end_date": null, 
    "title": "Lean Canvas Course", 
    "price": 0, 
    "instructors": "Ash Maurya", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40250_7737_5.jpg", 
    "course_url": "https://www.udemy.com/lean-canvas-course/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-06T02:06:55Z"
}