{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Building a company? Learn how SMART entrepreneurs raise the RIGHT type of capital FAST.</strong>  </p>\n\n<p><strong>***THIS COURSE DOES NOT INCLUDE THE FINANCIAL MODEL TUTORIAL***</strong></p>\n\n\n\n\n\n<p><strong>Visit financeforentrepreneurs dot co for the full version.</strong></p>\n\n\n\n\n\n<p><strong>ABOUT THE INSTRUCTOR</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                     Lili Balfour has advised over 100 companies, who have gone on to raise over $200 million from investors around the world.  She is the author of Master the Finance Game, a Wall Street Journal Guest Mentor, a contributor at Fox Business News, a blogger for The Huffington Post, a guest contributor for HuffPost Live and a guest lecturer at UC Berkeley.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>ABOUT THE COURSE</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong></strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                     Learn everything you need to know to grow revenue, to increase profitability, and to secure capital for $197. This course includes a <strong>downloadable financial model</strong> and <strong>cap table</strong> with step-by-step instructions, as well as a <strong>list of active investors</strong> who have recently raised funds.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>STUDENT REVIEWS</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                     “I've previously spent more than a thousand bucks on business financial consultations which didn't even explain 10% of what this course covers in less than two hours. You get to know real life metrics and milestones that your company must achieve to survive and prosper.” Oleg  </p>\n\n\n\n\n\n\n\n<p>  \t                     “A must for start ups. This is the first course I finished on Udemy! This course covers a lot and Lili was able to condense it to the essential, important things everyone going into a start up should know. A very big bonus is the downloadable excel spreadsheet that contains pretty much everything you need to understand financially when starting a business. Highly recommend.” Mic  </p>\n\n\n\n\n\n\n\n<p>  \t                     “Es un buen curso, Lili sabe mucho sobre el tema, pero quisiera haber tenido mas énfasis en el modelo financiero.” Mateo  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>COMMUNITY</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t  We meet on Spreecast on the second Saturday of each month at 12:30 pm PST.  </p>", 
    "end_date": null, 
    "title": "Lean Finance for Startups - Everything an Entrepreneur Needs", 
    "price": "50.00", 
    "instructors": "Finance for Entrepreneurs", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48921_144c_26.jpg", 
    "course_url": "https://www.udemy.com/financeforstartups/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-08T07:44:27Z"
}