{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Lean Analytics: Use data to build a better startup faster</strong>  </p>  <p style=\"\">  \t The Lean Startup movement swept through the entrepreneurial world, advocating a lean, iterative approach to finding the right product and market with a constant cycle of building, measuring, and learning. Now <a href=\"http://leananalyticsbook.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Lean Analytics</a> dives deeper into the measurement component of that cycle. The best-selling book is being translated into eight languages, and its authors—startup veterans Ben Yoskovitz and Alistair Croll—have travelled the world teaching founders how to use data to build a better startup faster.  </p>  <p style=\"\">  \t In June, 2013, Alistair and Ben presented an all-day workshop in conjunction with <a href=\"http://www.geckoboard.com/?utm_source=udemy&amp;utm_medium=udemycourse&amp;utm_term=Leananalytics&amp;utm_campaign=Lean+Analytics+course\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Geckoboard</a> at London&#039;s Barbican centre, which we&#039;re now making available online. With energy, humour, and a disarming bluntness they&#039;ll take you through the concepts of their book: What makes a good metric; how to match the data you track to the stage of your growth; drawing lines in the sand; and changing the culture of organisations of all sizes.  </p>  <p style=\"\">  \t <strong style=\"\">About the presenters</strong>  </p>  <p style=\"\">  \t In 2010, Alistair and Ben were two of the co-founders of Year One Labs, an early stage accelerator that provided funding and up to 1-year of hands-on mentorship to 5 startups. Year One Labs followed a Lean Startup program, making it the first accelerator to formalize such a structure. Three of five companies graduated from Year One Labs and went on to raise follow-on financing. A great deal of their experience and thought leadership around Lean Startup and analytics emerged during this time.  </p>  <p style=\"\">  \t Alistair has been an entrepreneur, author, and public speaker for nearly 20 years. He’s worked on a <a href=\"http://solveforinteresting.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">variety of topics</a>, from web performance, to big data, to cloud computing, to startups, in that time. In 2001, he co-founded web performance startup Coradiant (acquired by BMC in 2011), and since that time has also launched Rednod, CloudOps, Bitcurrent, Year One Labs, the Bitnorth conference, the International Startup Festival and several other early-stage companies.  </p>  <p style=\"\">  \t Alistair is the chair of O’Reilly’s Strata conference, Cloud Connect, and Interop’s Enterprise Cloud Summit. This is his fourth book on analytics, technology, and entrepreneurship. Alistair lives in Montreal, Canada and tries to mitigate chronic ADD by writing about far too many things at Solve For Interesting.  </p>  <p style=\"\">  \t Ben is a serial entrepreneur with 15+ years experience in web businesses. He started his first company in 1996 while completing university. In 2007 he co-founded Standout Jobs, a B2B software company in the recruitment space. The company raised $1.8M from venture and angel investors. In 2010 after exiting Standout Jobs, Ben co-founded Year One Labs.  </p>  <p style=\"\">  \t Ben has been blogging since 2006. The “<a href=\"http://www.instigatorblog.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Instigator Blog</a>” is recognized as one of the top blogs on startups and entrepreneurship. Ben is also an active mentor to numerous startups and other accelerator programs, including FounderFuel (a TechStars-like program in Montreal.) He regularly speaks at startup conferences and events, including the Michigan Lean Startup Conference, Internet Marketing Conference, etc.  </p>  <p style=\"\">  \t Ben is currently the VP of Product at GoInstant, a venture-backed startup developing co-browsing technology for shared web experiences.  </p>  <p style=\"\">  \t This workshop is presented to you in partnership with <a href=\"http://www.geckoboard.com/?utm_source=udemy&amp;utm_medium=udemycourse&amp;utm_term=Leananalytics&amp;utm_campaign=Lean+Analytics+course\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Geckoboard</a>  </p>  <p style=\"\">  \t <a href=\"http://www.amazon.com/gp/product/1449335675/ref=as_li_tf_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1449335675&amp;linkCode=as2&amp;tag=leananalytics-20\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Buy a copy of Lean Analytics here</a>.  </p>", 
    "end_date": null, 
    "title": "Lean Analytics Workshop - Alistair Croll and Ben Yoskovitz", 
    "price": 0, 
    "instructors": "Lean Analytics", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/60038_8c89_9.jpg", 
    "course_url": "https://www.udemy.com/lean-analytics-workshop-alistair-croll-and-ben-yoskovitz/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-14T10:19:50Z"
}