{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          Whether you are just starting out or making a career change, this introductory course will familiarize you with the many facets of Event Planning and Management, from initial client contact to post-event analysis. You will learn key skills required for event research, needs assessment, and other crucial starting points in planning an event. You will also learn to identify the various types of events, develop event decor and design concepts, work with event stakeholders, and implement production schedules and timelines. Additionally, you will gain transferable, practical knowledge and skills in management practices such as planning, design, marketing, sponsorship, budgeting, risk management and program evaluation.  </p>\n\n<p>  \t  The program is also taught by an experience event manager and consultant, with years of experience in the event management field, is still working in the industry, and shares her experience working with numerous corporate and private clients.  </p>\n\n\n\n<p>  \t  This course is delivered through audio and slides, includes templates, checklists, and popular apps, tools and software to get you started. We also provide links to over 20 free online resources you might never even have discovered!  </p>\n\n\n\n<p>  \t  By the end of the course you will have have the knowledge, confidence and tools to break into the industry and start your career.  </p>\n\n<p>HERE'S WHAT SOME OF OUR STUDENTS ARE SAYING:</p>\n\n<p>\"<strong>So much useful information - </strong>I was a bit hesitant to \ntake this course, because I wasn’t sure if it was going to be any useful\n information. I’m so glad I decided to do this. it was quick and to the \npoint. I’m very pleased. I will be referring this to my friends.\"<br>- Angela</p>\n\n<p>\"<strong>How to Become a Successful Event Planner - </strong>Wonderful \ncourse. Enjoyed the clear outline of each section. Most helpful was \nprobably the tips and tricks provided as well as the website/app \nsuggestions!\"<br>- Kaitlin</p>\n\n<p>\"<strong>Great Intro to Event Planning - </strong>I’ve had an \ninterest in event planning and wanted to take this course to evaluate if\n it’s right for me. I learned a lot of basic steps to planning an event.\n I think the most valuable part of this course is the templates for \ndeveloping a sponsor package, risk assessment, event timeline, etc. and \nwebsites of where to find vendors, venues, and useful online tools!\"<br>- Jessica</p>", 
    "end_date": null, 
    "title": "Learn How to Be a Successful Event Planner", 
    "price": "40.00", 
    "instructors": "Jody-Ann Rowe", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315556_8553_6.jpg", 
    "course_url": "https://www.udemy.com/success-in-event-planning/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-08T04:26:15Z"
}