{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you have a website already?  Maybe you want to build one?  Did you know that you can monetize a website with affiliate programs?  Affiliate marketing is something anyone can do.</p>\n\n<p>I've been building affiliate websites for more than a decade, and earning a decent income from those sites.  The great thing about affiliate websites is that if you build them correctly, they'll mature over time and reward you month after month, year after year in passive income.  However, if you build them incorrectly, you will simply be wasting your time.  In the last few years, Google have tightened the noose around webmasters out to make a quick buck by gaming the system.  This course was created to show you how I build successful affiliate websites now, in 2016 and beyond.  I'll take you from the very beginning and show you, over-my-shoulder, how I:</p>\n\n<ul><li>Decide on a niche for my website.</li><li>Find affiliate products in that niche to promote on my websites.</li><li>Choose a catchy, brandable domain name.</li><li>Buy the domain through a registrar, and set it up to work with a web host.</li><li>Install Wordpress.</li><li>Setup a gmail address and create a \"Gravatar\".</li><li>Setup Wordpress.</li><li>Install a Wordpress theme.</li><li>Install a few essential plugins.</li><li>Create an author bio for your web pages.</li><li>Setup Google Analytics and Search Console so you have the data you need to make your site successful.</li><li>Add a simple homepage to get you started.</li><li>Create Mindmaps to plan and outline all of the main topics you want to cover on your website.</li><li>Add important pages like Contact, Terms and Privacy.</li><li>Create a sitemap and submit it to Google so they always know when you have new content on your site that needs indexing.</li><li>Set up Yoast SEO plugin so your site is search engine ready.</li><li>Setup Facebook and Twitter accounts, and get all new posts automatically syndicated to these platforms.</li><li>Decide on categories for posts.</li><li>Write content that the search engines will reward you for.</li><li>Automate internal site linking, and why it is important.</li><li>Create an affiliate product page and why this works better than affiliate products on all pages of your website.</li><li>Create an affiliate product promotion that is always visible to a website visitor.</li><li>Add social sharing buttons to the site.</li><li>Add related posts to the end of each post, automatically.</li><li>How to use Feedly and RSS feeds to get content ideas.</li><li>How to setup a blog for shorter posts, and how to create these blog posts using Feedly and Youtube.</li></ul>\n\n\n\n<p>This course covers everything you need to know to help you create a high quality affiliate website that you'll be proud of.  With Google cracking down on poor quality affiliate sites, a lot of webmasters have given up creating this type of site.  However, affiliate sites remain one of the best forms of setup and forget \"passive income\".</p>\n\n\n\n<p>With this course, you will have the exact system I personally use to keep Google happy as I continue to build this type of site. </p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Learn how to Build High Quality Affiliate Websites", 
    "price": "25.00", 
    "instructors": "Andrew Williams", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614640_5ce5_3.jpg", 
    "course_url": "https://www.udemy.com/build-affiliate-marketing-web-sites/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T09:46:52Z"
}