{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Legal Advice for Entrepreneurs &amp; Startups: Concepts Every Entrepreneur Should Understand.</strong>  </p>  <p style=\"\">  \t     Lawyers are expensive and can eat up vital start-up funds. So before talking to a lawyer - who will be charging you by the minute - why not take some time to identify and understand what legal issues will be relevant to your business. Getting to grips with this from an early stage will help you flag potential areas of concern before they become serious problems for your business and could save you a lot of money in the long run.  </p>  <p style=\"\">  \t     This class will introduce you to a number of important legal concepts relevant to entrepreneurs and start-ups. Whether you&#039;re looking to launch a tech start-up or a small online business, enroll in this class if you would like to learn some important tips to keep in mind when starting your business.  </p>  <p style=\"\">  \t     The course will take a practical look at the following topics:  </p>  <p style=\"\">  \t<strong style=\"\"> 1. Legal Issues Affecting Commercial Websites</strong> - domain names, ownership of websites &amp; website content, drafting website terms &amp; conditions, liability for website content.  </p>  <p style=\"\">  \t<strong style=\"\"> 2. Intellectual Property</strong> - trademarks, passing-off, design rights, copyright and patents.  </p>  <p style=\"\">  \t<strong style=\"\"> 3. Apps</strong> - the law relating to apps.  </p>  <p style=\"\">  \t<strong style=\"\"> 4. Practical Advice for Start-Ups</strong> - company formation, tips to lower legal fees and other practical considerations for start-ups.  </p>  <p style=\"\">  \t     You&#039;ll leave this class with a better understanding of how to:  </p>  <p style=\"\">  \t     (i) set up your business website; (ii) examine what type of company structure might be appropriate for your business; (iii) identify potential intellectual property issues for your business; (iv) design an app; and (v) save money on future legal bills.  </p>", 
    "end_date": null, 
    "title": "Legal Advice for Entrepreneurs & Startups", 
    "price": "20.00", 
    "instructors": "Mark Connolly", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119870_a6db_6.jpg", 
    "course_url": "https://www.udemy.com/legal-advice-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-14T15:54:55Z"
}