{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  This course will help you understand how to Integrate who you are with your Purpose, Vision, Mission and Passion to create the plan and strategy to be followed each time you want to achieve success developing a specific project in Business.  </p>  <p style=\"\">  \t  Are you working too hard lacking the results you want?  </p>  <p style=\"\">  \t  Are you frustrated, not earning the money you want?  </p>  <p style=\"\">  \t  Are you looking for a lasting solution to more sales and success?  </p>  <p style=\"\">  \t  Are you looking for the people that will understand the value you offer?  </p>  <p style=\"\">  \t  You are not alone!  </p>  <p style=\"\">  \t  This course will show you the road to follow with: Clarity, Confidence and Self-esteem to Live Intensely, Fully energized  </p>  <p style=\"\">  \t<strong style=\"\">What do people say about me and my work?</strong>  </p>  <p style=\"\">  \tAstrid Denise Morgan – Lima - Perú :  </p>  <p style=\"\">  \tI met Esther many years ago, when our children were studying at the Franco Boliviano &quot; Alcide D&#039;orbigny&quot; School. She struck me as a dynamic, positive, outgoing entrepreneur; in other words a modern woman with many interests and new, innovative ideas, who put them into practice very successfully. At the time, she produced spices and also tutored primary, middle school, high school, and University students in math, science, physics and chemistry. Whenever someone asked for a good tutor, the answer inevitably was:&quot; Call Esther Iberkleid, she&#039;s the best.&quot;<br style=\"\">  \t<br style=\"\">  \t<br style=\"\">  \tI was able to ascertain this a few years later, when my eldest child needed one. I obviously called Esther, and she proved to be all that was said about her and more. She helped my daughter to organize herself, acquire better study habits, enhanced her capabilities, learn the subject matter well, and as if that weren&#039;t enough, Esther gave her self esteem a great big boost. My daughter was able to clarify all her doubts and started looking at school with more confidence and self assurance, both gained during her tutoring.<br style=\"\">  \t<br style=\"\">  \tAs a former teacher, I consider this to be a great asset in a tutor. I have seen many students who loose their confidence when they move into higher grades. It is not that they don&#039;t study, or don&#039;t know the subject matter; it is mainly that they loose faith in themselves due to various reasons. Subjects get tougher, they go into their teens and feel more vulnerable and are under the constant criticism of their peers, some even have teachers whom they fail to understand; or who undermine them. This causes children to lower their grades, and as they do so they start believing they aren&#039;t capable enough, which in turn makes them lower their grades even more. Esther is a teacher/tutor, who not only knows the subject she teaches well and is constantly learning more about it; but she is always improving herself in order to find additional ways to impart her lessons, making them interesting and effective. More importantly, she cares and helps students realize that they are capable of facing, and succeeding in any challenge they face.<br style=\"\">  \t<br style=\"\">  \tI admire Esther greatly. She has strength, is always positive, and will go out and do everything she needs to do, to reach her goal. It was only four years ago, that she told me about her new enterprise over a cup of coffee, and now the results are amazing! She is doing something she loves, is happy and is very successful at it. This is what we would all want to achieve in life, isn&#039;t it? ... and it is the reason why I feel that she is such a great role model.<br style=\"\">  \t<br style=\"\">  \tAs a teacher, as a client, and as a parent I would highly recommend Esther. She is excellent at what she does, always seeking to be the best, and is always well informed on new trends, changes or improvements there are in her field. I am convinced that whatever Esther begins, or whichever goals she sets for herself, she will always reach them and be the best at what she does.  </p>  <p style=\"\">  \t---------------------------------------------------------------------------------------------  </p>  Wendy Howard - Small Business Expert, helping Coaches, Trainers, Consultants to grow profitable businesses  <p style=\"\">  \tEsther has the most amazing energy which she brings to all of her work and clients. Her knowledge and experience is very in depth and she has a true gift of connecting and helping people - quite literally change their lives.<br style=\"\">  \t<br style=\"\">  \tShe has a number of diverse programs and offers many tools for business and life directional changes. I would recommend anyone who wants to make positive change and have a wealthier life to work with Esther.<br style=\"\">  \t<br style=\"\">  \tGreat person, great passion, great business!  </p>  <p style=\"\">  \t---------------------------------------------------------------------------------------------  </p>  Sandy Hargrave, MA - Global Distributor at LifeVantage  <p style=\"\">  \tEsther has a passion for helping people to become all that they can be that is powerful beyond belief! She certainly works wonders with all of her clients. She is a masterful coach and teacher and amazing to watch. I have had the honor and privilege of working with Esther as a client, a coach and as a business partner. If you&#039;d like to find your true purpose by finding the missing link to your wealthy, worthy life, then don&#039;t wait another minute. Let Dr. Esther be your guide.<br style=\"\">  \tSandy Hargrave, MA<br style=\"\">  \tCEO, Cruising Through Life - Seminars at Sea  </p>  <p style=\"\">  \t---------------------------------------------------------------------------------------------  </p>  Arthur Partridge [LION] <h6 style=\"\">Specialist Practitioner of Neuro Hypnotic Repatterning at AyPeeCo</h6>  <p style=\"\">  \tEsther is an extremely enthusiastic &#039;Well Being Coach&#039;.<br style=\"\">  \tAs a coach, she sets high standards for herself and her clients and motivates them towards their dreams.<br style=\"\">  \tShe is never without energy and compassion and her attitude allows her clients to aspire even when they may not have the energy.<br style=\"\">  \tShe is never disappointed and is a true stand for both her clients and colleagues and achieves extraordinary results  </p>  <p style=\"\">  \t---------------------------------------------------------------------------------------------  </p>  Elizabeth M. Lengyel - Career Strategist. Radio Host.  Faculty, Conestoga College.  <p style=\"\">  \tEsther is a beam of white light. Highly intuitive. Energetic. A tremendous capacity to excel in connecting others to their gifts and passions. A wise counsel with collective experience and knowledge to boost success.  </p>", 
    "end_date": null, 
    "title": "Live Intensely Fully Energized for Business ", 
    "price": "50.00", 
    "instructors": "Esther  Coronel de Iberkleid", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/86542_729b_9.jpg", 
    "course_url": "https://www.udemy.com/live-intensely-fully-energized-business-oriented/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-31T22:53:55Z"
}