{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t        Para poder emprender cualquier negocio y tener garantías de éxito debemos seguir una metodología específica que nos permita gestionar bien todas las fases del proceso, desde la idea y el modelo de negocio, hasta crear la estrategia y herramientas de venta necesarias para vender nuestro producto o servicio.  </p>  <p style=\"\">  \t     A través de este curso descubrirás las claves para seguir estos pasos hasta obtener un proyecto sólido que puedas lanzar al mercado con garantías de éxito.  </p>  <p style=\"\">  \t     Si tu proyecto necesita inversión no te preocupes, a lo largo del curso encontrarás las herramientas y estrategias necesarias para poder obtener inversión para tu proyecto fácilmente.  </p>  <p style=\"\">  \t        Tener un negocio propio es algo altamente gratificante pero también tiene momentos duros que requieren una dedicación muy intensa. Con este curso crearas las bases necesarias para iniciar tu aventura con unos pilares sólidos que faciliten tu camino hacia el éxito. Además, durante el transcurso del curso podrás contar con el asesoramiento de David Bertrán, coach y fundador de 14 empresas en los últimos 25 años en España, Francia y USA.  </p>  <p style=\"\">  \t        Aprovecha esta oportunidad y lánzate a vivir tu sueño !  </p>", 
    "end_date": null, 
    "title": "Los diez pasos para emprender tu proyecto con éxito", 
    "price": "20.00", 
    "instructors": "David Bertrán", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/239282_bdf2_2.jpg", 
    "course_url": "https://www.udemy.com/los-diez-pasos-para-emprender-tu-proyecto-con-exito/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-08T05:55:28Z"
}