{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Es ist wieder so weit: Da hat man gestern noch bis spät in die Nacht Rechnungen geschrieben,  dringende Mails bearbeitet und die Steuern gemacht und nun kann es eigentlich wieder von vorne losgehen kaum das man an seinem Schreibtisch sitzt.  </p>  <p style=\"\">  \t  Aber was wäre, wenn man die einzelnen Aufgaben einfach schneller und effektiver abarbeiten könnte? Oder viele Dinge schon während des Kundentermins erledigen könnte? Was wäre, wenn man später einfach eine PDF Datei hätte, die die benötigten Informationen für die Steuern schon bereit hält? Richtig - eine immense Zeitersparnis! Wenn man jeden Tag nur eine halbe Stunde einspart, sind das in einer Woche bereits 2,5 Stunden.  </p>  <p style=\"\">  \t  Mit unserem Kurs <strong style=\"\">“Mac für Business”</strong> ist aber “mehr drin”!  </p>  <p style=\"\">  \t  Wir haben Programme ausgewählt, die Euch nicht nur das Leben erleichtern und Euch helfen, Euer Geschäft perfekt im Blick zu behalten, sondern auch jede Menge Zeit sparen. Wenn Ihr schon beim Kunden die Rechnung erstellen, ihm zuschicken und gleich kassieren könnt (per EC-oder Kreditkarte) spart Ihr Zeit, viel Zeit. Wenn gleich nebenbei auch noch die Buchhaltung erledigt wird - perfekt.  </p>  <p style=\"\">  \t  Außerdem wisst ihr mit einem Klick wie es um Euer Geschäft steht, wie viel Zeit Ihr bei Eurem Kunden verbracht habt und wie Ihr auch dies schnell und einfach abrechnet.  </p>  <p style=\"\">  \t<strong style=\"\">In unserem Kurs “Mac für Business”</strong> geben wir Euch darüber den perfekten Überblick. Denn nur so wird Euer Geschäft nicht zur Lebensaufgabe. Schließlich ist es dafür gedacht, Euren Lebensunterhalt zu sichern und Euch die Arbeit so angenehm wie möglich zu machen - und wir zeigen Euch wie.  </p>  <p style=\"\">  \t  Wir schauen uns Programme wie <strong style=\"\">Debitoor, iZettle, Outbank, Lieferung, Maildesigner, Navigon und Timesheet</strong> an, damit Ihr wirklich mit wenigen Klicks alles erledigen könnt. Von der Akquise neuer Kunden bis hin zur Erfassung Eurer Arbeitszeit.  </p>  <p style=\"\">  \t  Der Kurs ist so zusammen gestellt, dass Ihr genau das habt, was Ihr benötigt. Denn selber seit Jahren selbständig wissen wir genau, wovon wir reden.  </p>  <p style=\"\">  \t  Vereinfache dein Leben mit unserem Kurs<strong style=\"\"> “Mac für Business”</strong>.  </p>", 
    "end_date": null, 
    "title": "Mac für Business - So arbeiten Sie effektiver", 
    "price": "20.00", 
    "instructors": "Monja Wessel, Markus Korsten, Online Lernen SimpleLife Stories", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393778_970c_6.jpg", 
    "course_url": "https://www.udemy.com/mac-fur-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T09:40:54Z"
}