{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tJust yesterday you have been working until late to work on mails which need to be done, on taxes which needed to be added, on bookkeeping you had to do and then, while you just got up, you see that you can start all over because your inbox is flooded again with customer emails that need to be done urgently. But what if you could do these tasks faster and more effective? What if you could do many of your duties already while you are working with your customer? What if you would have a PDF file with all the necessary information for your taxes just when you need them and without actually creating it yourself because everything has been tracked for you automatically? Right - it would be a huge time saver! What if you could just save half an hour a day? That means in a workweek you have 2.5 hours more for your pleasure. But with our course, “Mac for Business”, you can save even more! We have chosen programs which do not just make your life easier but also help you to keep an eye on your business and save tons of time. If you can already create your invoice at the customers house and have him paying right when you are there (by credit card for example), it will save you tons of time because with just a few clicks all your accounting is already done! With just a click you know how your business is doing, how much time you’ve spend with your customer and how much money you’ve made. In our course “Mac for Business” we’ll give you the perfect overview to make your business your business and not your life’s work. Because your business just helps you to make sure that you can pay your bills and helps you to work as comfortable as possible you’ll need a way to manage it effectively. From getting in touch with new customers to tracking the time you spend with your customer we have been thinking of all the necessary things you need to do. We created a course which has everything in place you need because we both are self-employed for years and now what it takes to run a successful business. Simplify your life with “Mac for Business”.  </p>", 
    "end_date": null, 
    "title": "Mac for Business - Work smarter & faster, not harder", 
    "price": "20.00", 
    "instructors": "Monja Wessel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394844_7852_5.jpg", 
    "course_url": "https://www.udemy.com/mac-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-15T14:04:53Z"
}