{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>First things first – I'm not a marketing guru.<strong> I'm a small business owner just like you BUT I earn $800+ for every $30 I spend on advertising and decreased my advertising expenditure by 75% through FREE marketing strategies.</strong></p><p>I've designed this boot-camp so you can do the same thing – get more customers and increase your profits. There are 30 activities in Boot-Camp. You can go through the course as fast as you like but the general idea is to complete one challenge before moving on to the next one. </p><p>By the end of the course you will know exactly what to focus your marketing efforts on, have more customers and more money in the bank.</p><p>This is the sort of course you take if return on investment is important for you. <strong>Implement these strategies and you WILL make back the money you spent on boot-camp. </strong></p><p><strong></strong></p><p><strong>Do you ever have so many marketing ideas that you don't know where to start?</strong></p><p>One minute you are told you need to be doing Webinars because that's a guaranteed way to get customers, the next person tells you - the money is in strategy sessions and the next minute Periscope is the hottest marketing trend on the planet. </p><p>The cold hard truth is that not every marketing idea will work for every business (and I should know because I have two). Just because someone is killing it on You Tube doesn't mean it will work for your product or service. </p><p>The important thing is that <strong>SOMETHING</strong> will work for you. Let me demonstrate what I mean with my own story. I run two online businesses. The first is an Astrology Site (because I LOVE astrology). The second is a resume writing service (because before I became self-employed this was my day job).</p><p>I've tried loads of marketing on both of them and guess what? Totally different results. Let me show you.</p><p><strong>The breakdown of my astrology marketing efforts looks a bit like this (results are estimates only):</strong></p> <ul><li>40% of my customers came through Beta-Testing (I offered the first session free and then they paid to have more)</li> <li>40% of my customer come through You Tube (I do monthly forecasts on there and link to my site)</li> <li>10% of my customers come from Facebook</li> <li>10% come from my email list</li></ul> <p><strong>Meanwhile with my resume service its split more like this:</strong></p> <ul><li>40% of my customers come from Google AdWords Advertising</li> <li>40% come from my mailing list</li> <li>1% come from flyers</li> <li>19 % come from word of mouth</li></ul> <p>But here's the thing. I tried using Adwords for my astrology service and never got a single order despite it bringing in 40% of my customers (and 99% when I first launched the service) and I tried YouTube (responsible for about 40% of my astrology customers) for my resume business and haven't had a single order. </p><p>That's why you need marketing boot-camp. So you can find the right marketing method for you. You can progress through the course as fast or slow as you like. The only thing you must do, is to trial each challenge for a week and track your results. </p><p><strong>By the end of Boot-Camp you will have identified the best marketing methods for your business and be able to through all your resources at them – to get more customers and to make more money.</strong> </p><p>I've included a super simple tracking spreadsheet to help you keep tabs on everything (it's the same one I use myself). </p><p><strong>Are you ready to get more customers?</strong></p><p><strong>Are you ready to make more money?</strong></p><p><strong>Let's find your tribe. Go!</strong></p>", 
    "end_date": null, 
    "title": "Make More Money Marketing BootCamp", 
    "price": "20.00", 
    "instructors": "Nicole Coggan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533834_6c6f_3.jpg", 
    "course_url": "https://www.udemy.com/small-business-marketing-boot-camp/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-22T02:06:50Z"
}