{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Did you know that according to data from Parks Associates an estimated <strong>$30.5 billion will be spent on Smart Home Automation Install Services in 2017!</strong></p><p>Looking ahead over the next five years, smart home technology is going to continue to get more prevalent in society. </p><p>This will inevitably lead to increased demand for install professionals who are capable of putting together cohesive smart and connected home systems.</p><p>So big opportunities for those of you who are skilled to take advantage of the upcoming wave of business!</p><p><strong>Enter the 'Make a Living as a Smart Home Automation Installer C</strong><strong>ourse' </strong></p><p>This training course walks you through step-by-step exactly how to increase your revenue from installing various types of smart home automation IoT based systems ranging from IP cameras and smart security sensors to multi-room music, security sensors and smart thermostats. </p><p>This program was created especially for:</p>  <ul>  \t<li>Existing electrical      contractors and security business owners who are thinking about making some extra revenue from installing some entry level smart home systems locally.</li><li>DIY'ers who want to build a smart home installation business on the side.</li></ul><p><strong>The course itself includes the following tools.</strong></p><p><strong>[+]</strong> Smart Home Install Technical Foundations Video Masterclass - This masterclass consists of 44 HD videos (And growing) that provide the core technical skills you need to start installing various types of smart home systems.</p><p><strong>[+] </strong>30+ Practical <strong>how to</strong> videos on how to build a smart home system from scratch using the <strong>Samsung SmartThings</strong> range of products.<br></p><p><strong>[+] </strong>Various step-by-step videos that help you install and setup the <strong>Nest</strong> suite of smart IoT devices, namely Nest Cam, the Nest Thermostat and Nest Protect.<br></p><p>Ready to start installing smart home products in your customer's homes; than join us and start increasing your monthly revenue stream from installing Internet of Things (IoT) and smart home products.<br></p>", 
    "end_date": null, 
    "title": "Make a Living as a Smart Home Automation & IoT Installer", 
    "price": "50.00", 
    "instructors": "Gerard ODriscoll", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309486_01ba_3.jpg", 
    "course_url": "https://www.udemy.com/make-a-living-as-a-smart-home-installer/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-28T15:48:28Z"
}