{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Seen all the other listing courses around that claim it is a professional eBay listing and they all show you the same stuff, drag this image here, create a table here and drag this image and change this blah blah blahh.........</strong></p><p><strong>Well finally we have created a real professional eBay listing template add more than just ZAZZ to your business but really blow them away!<br><br></strong>Increase sales by at least 50% and create brand awareness with your custom eBay listing template no need to use Photoshop (however for the pro section Photoshop will be advantageous and we go into more depth) or any paid service as we get to use GIMP a simple free design software and use a HTML editor and create this listing.<br><br><strong>Not only have we created a PRO listing course we have also added in a simple course for those of you who are extremely new to coding etc, we evolve from a simple listing design into a powerful pro listing that has search bars that link to your store, image slides, web and mobile responsive background that repeat, tab bars, roll over images and roll over menu with changing colour! </strong><strong>Not only do you learn HTML, CSS</strong><strong> and image editing you also learn the function of a FTP server and register a domain name for your business and as a added bonus FREE HOSTING!</strong></p><p><br>You can upload your images to a site and call your images from there to bypass the first portion of the lessons however i would not recommend it as the pro listing portion requires hosting which is FREE<br></p><p>eBay is a huge market place and one way to stand out apart from the price is your listing design and that is exactly what we will be doing!</p><p><strong>If you want to increase your earning potential but are not technological in any form then this is course for you! It's simple, easy to grasp and easy to learn and implement just copy everything from the course and add your own twist your imagination is the ultimate tool here.<br></strong><br>So lets get started!<br><br></p>", 
    "end_date": null, 
    "title": "Make a PROFESSIONAL eBay listing template using photoshop", 
    "price": "50.00", 
    "instructors": "Pixelated Academy", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604990_3766.jpg", 
    "course_url": "https://www.udemy.com/create-a-real-professional-ebay-listing-using-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T16:32:18Z"
}