{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul style=\"\"><li>Are you tired of searching music libraries for the perfect song for your project?</li><li>Would you rather have FULL rights to your own music rather than pay licences for others songs?</li><li>Do you wish you could write music, but think you have no musical talent?</li><li>Do you want to have the satisfaction of knowing that the music you attached to your project is your own?</li></ul><p><strong style=\"\">Just follow my steps and I&#039;ll show you how to make your OWN music for your projects, videos, presentation, etc..  It&#039;s easy, and you DON&#039;T have to be a musician to do it! <br style=\"\"></strong></p><p>For PC Only. A separate Mac course will be coming soon using Garageband.</p><p>You do not need ANY experience as a musician.  We go over some very basic concepts with some very easy software, that will get you professional results. I&#039;ve been a musician for 25 years and what you will be learning in this course, ANYONE can do.<br style=\"\"></p>  <p><strong style=\"\">  \tYou will learn:  </strong></p>  <ul style=\"\">  \t<li><strong style=\"\">How to create a catchy beat that&#039;s perfect for the project you are creating</strong></li><li><strong style=\"\">How to arrange a song so it enhances your project, rather than distracts from it</strong></li>  \t<li><strong style=\"\">How to make adjustments to your music like the pros do, to make it sound radio ready</strong></li><li><strong style=\"\">How to make your song into an MP3 so you can use it in virtually any software</strong></li>  \t<li><strong style=\"\">How to come up with ideas from scratch and turn them into a full song</strong></li>  \t<li><strong style=\"\">And much more...</strong></li>  </ul><p style=\"\">Enhance your projects now!</p><p style=\"\">It&#039;s time you starting writing the perfect music for your projects instead of searching for it.  You CAN do it and I&#039;m here to help you.  Feel free to message me anytime throughout this course if you are stuck or have a question.  I&#039;m an official Udemy Level 3 Responder so your questions will get answered fast.</p><p>Oh, and there&#039;s no risk. This course has a 30 day money back guarantee. So give it a try!  See ya on course.</p><p>-Steve C</p>", 
    "end_date": null, 
    "title": "Making Intro Music for Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Steve Cherubino", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/401712_e294_2.jpg", 
    "course_url": "https://www.udemy.com/make-amazing-intro-and-background-music-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-23T00:00:16Z"
}