{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Point your business in the right direction by making it professional and grooming yourself into someone that people want to do business with. Because, at the end of the day, that's the key – people have their choice of providers and business partners, so competition is always there. Making it is about more than simply having the best idea, or even executing on that idea – it's about being THE person that people want to work with.</p><p><strong>Becoming A Premier, Desired Business Provider</strong></p><p>You know what they say—image is everything. It isn't so much that you need to “fake it 'till you make it,\" though that can at times be true – it's more about establishing a reputation and building your public image and presence. This new book, “Making Your Business Professional, Making YOU Someone That People WANT to do Business With,\" will walk you through doing just that, putting you on the path to better business success.</p><p><strong>What it is</strong></p><p>Unlike other business titles that take you through how to run the day-to-day logistics and finances, this book will take you through the actual qualifiers that will help you understand your business' current position, provide tools that you can leverage in real-world practice to strategize and map your business' direction, and give you the insights; background; and next steps to building a unique, recognizable brand. </p>", 
    "end_date": null, 
    "title": "Making Your Business Professional", 
    "price": "20.00", 
    "instructors": "Marc Thomas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442696_914e.jpg", 
    "course_url": "https://www.udemy.com/making-your-business-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-09T12:16:58Z"
}