{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>OVER 980 Students are planning their promotion already!!!</strong></p><p><strong>Do you want to finally have a profitable year in your business? </strong> <em>January is the prime time to kick off your promotional calendar and get raving fans who will buy from you all year long.</em></p><p><strong>However, in order to have a fantastic January, you need to start your planning now.</strong></p><p>If you are struggling in your business, chances are you are not creating attractive marketing and you are probably working <strong>WAY TOO HARD </strong>for little results.</p><p><strong>In Marketing Plan #1 you will learn:</strong></p><ul><li>How to create a solid and engaging promotion that will set you up for success for the 12 months that follow</li><li>How to come up with a unique angle that will be fun for both you and your audience to participate in</li><li>What is going on in your audience’s mind and how to craft your offer around their biggest problem</li><li>How to do the work once and then reuse and improve upon it for the rest of the year</li></ul><p><br></p><p>Join the Marketing Promotion Plan community and you will get lifetime access to this course so you can come back year after year as you create your promotions.</p><p><em><strong>FULL 30 DAY MONEY BACK GUARANTEE.</strong></em></p><p>If you are tired of creating great programs and services only to have no one buy, then now is the time to start planning a successful marketing campaign that starts of the new year right.</p><p>This course will take you from a frustrated struggling business owner marketing to the sound of crickets on your social media page to a savvy smart entrepreneur who has raving fans who can’t wait for your next offer.</p><p>Remember you get lifetime access plus a full 30 day money back guarantee.</p><p><strong>The days are flying by, don’t wait to start your planning.</strong></p><p><strong>Click the Enroll Now button today and let’s get started.</strong></p>", 
    "end_date": null, 
    "title": "Marketing Promotion Plan", 
    "price": "20.00", 
    "instructors": "Julie Ann Price", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/602394_f9e0_4.jpg", 
    "course_url": "https://www.udemy.com/marketing-promotion-plan-1/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-04T12:24:48Z"
}