{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        It is important to develop a solid understanding of your industry.  This includes who your competitors are, what products they offer, who your suppliers are, and possible areas for growth. This course walks you through each of these variables and how they impact your business.  </p>  <p>  \t    This course provides videos from professors and real-world entrepreneurs who have built their own successful businesses, PDF downloads of exercises to complete for your own business, and topic evaluations to see where you stand in your industry knowledge.  </p>  <p>  \t    The course curriculum is divided into six sections consisting of a general introduction called &quot;Gaining Industry Knowledge&quot; which discusses the importance of why you should be familiar with the different areas of your industry.  The introduction is followed by five sections which discuss more in-depth topics to help you understand your industry to give you a competitive advantage.  The sections include: <span style=\" color:inherit;\">Industry Characteristics, </span>Competitive Rivalry, Influence of Suppliers, Nature of Customers, and Substitute Products.  </p>  <p>  \t  This course was developed for anyone looking to start a new business, entrepreneurs growing an existing business, or anyone looking to refresh their knowledge of the industry they are currently in.  </p>", 
    "end_date": null, 
    "title": "Mastering Your Industry: Competitors, Products, & Suppliers", 
    "price": "50.00", 
    "instructors": "The Main Street Entrepreneur", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/407940_e320_5.jpg", 
    "course_url": "https://www.udemy.com/how-well-do-you-know-your-industry/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-29T17:00:33Z"
}