{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h4>Course Description</h4>\n\n<p>This course is designed for anyone who is willing to put in the work to bring in more money. Whether you are wanting to eventually quite your job or if you are simply wanting to raise money for your local school or charitable organisation.\n\nI have looked at a lot of other courses assisting people with creating an online store, and found the most common complaint is that people don't understand what all the options are. So I made sure to mention each setting we cover to give you a full understanding of Woo Commerce. Which gives you the understanding and freedom to do more than just what I teach you.</p>\n\n<p>While there are optional paid upgrades for some of the software used in the course, <strong>everything we use is 100% free</strong> and can be successfully used to create a professional online store and start earning from it.</p>\n\n<p>The course should take you between 3 and 5 days to get your first online store built. Thereafter it becomes very quick to launch.</p>\n\n<p>The course is designed to be followed in chronological order. The early lectures start off with setting up a flash drive for testing (optional), and works right through to the end where we edit an installed theme to suit our purposes.\n\n<strong>If you honestly take this course and launch your site, I believe you should earn more than your money back within 30 days of starting the course.</strong>\n</p>\n\n\n\n<h4>What are the requirements?</h4>\n\n<ul><li>We will be using two pieces of software, both of which are free. For people not wanting to use a paid webhost, there is a third piece of software but that is also free. All software used is covered in the course.</li></ul>\n\n\n\n<h4>What am I going to get from this course?</h4>\n\n<ul><li>Create a Profitable Online Store</li><li>Understand the basics of managing stock in an online environment</li><li>Know how to use correct keywords and tags for proper search results</li><li>Learn how to profit with nearly zero overhead</li></ul>\n\n\n\n\n\n<h4>What is the target audience?</h4>\n\n<ul><li>This course is best suited for people who are wanting to work for themselves and have entrepreneurial desires and feels comfortable around computers (PC or Apple) and the internet. No prior experience in WordPress or Woo Commerce is required. This course covers a fair amount of detail through the process, so is best suited for people who want to take this as a serious opportunity. This is not suited for people looking for a \"get rich quick\" scheme.</li><li>People who want to succeed</li><li>Anyone who can manage themselves, and is tired of having a boss</li><li>Anyone with an interest in WooCommerce or Word Press</li></ul>", 
    "end_date": null, 
    "title": "Mastering Online E-Commerce", 
    "price": "20.00", 
    "instructors": "Stephen Beak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/517200_7c26_2.jpg", 
    "course_url": "https://www.udemy.com/woo-commerce/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T15:56:14Z"
}