{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul><li><em>This course is written and <strong>presented by a medical doctor with 20 years' experience</strong> in self-improvement training, coaching and counseling.</em></li></ul>\n\n<ul><li><em>It has been recorded and produced on a <strong>studio quality level</strong>.</em></li></ul>\n\n<ul><em></em><li><em>By enrolling in this course, you will get a lifetime access to the current content, as well as, <strong>BONUS MATERIAL</strong> .</em></li><em></em><li><em>No risk involved! Watch our </em><strong><em>PREVIEW VIDEOS</em></strong></li><li><strong><em><strong></strong></em></strong><em>Over <strong>10000 happy students</strong> enrolled in our courses!</em></li><li><em>Over <strong>500 TOP reviews!</strong></em></li></ul>\n\n<p>Most people do not realize that the <strong>great majority of communication is actually NON-VERBAL</strong>. Whenever people speak, their brains send information to different parts of their body to display the message they are trying to convey. By watching these gestures, postures, facial expressions or even eyeball movements, you can easily <strong>recognize what exactly is going on in people's head.</strong></p>\n\n<p>All that is required of you in order to do that effectively is to have <strong>KNOWLEDGE of what these signals actually look like</strong>. Once you have it, detecting people's true intentions will be as easy as a walk in the park.</p>\n\n<p>Now, this is where The Art of Body Language is getting interesting. By decoding the signals that your interlocutor is unconsciously transmitting, you can use that intel to <strong>direct the conversation in your favor</strong>. This is exactly why the greatest and richest entrepreneurs or politicians in the world possess deep knowledge of body language.</p>\n\n<p>The wisdom that comes with the understanding of the non-verbal signals could actually be <strong>perceived as a type of MIND READING</strong>.</p>\n\n<p><em>Wouldn't you like to know what people think even before they speak?</em></p>\n\n<p><em>Or perhaps even if they do speak their mind clearly, wouldn't you like to be able to instantly tell if they were fabricating a lie?</em> </p>\n\n<p>This kind of skill is not only useful in business interactions, but it could also be a <strong>LIFE CHANGER in your social communication</strong>. Every type of emotion or interest has a powerful yearning to be let out of the brain and into the body. Even the emotion of love and sexual attraction.</p>\n\n<p>What's more, having that profound knowledge of body language can also be used in reverse. By understanding the meaning of each gesture, position or expression, you will be able to <strong>CONTROL YOUR OWN BODY LANGUAGE</strong> so as not to give away the secrets of your own mind...</p>\n\n<p>Following this course will help you to:</p>\n\n<ul><li><strong>Read people effectively</strong></li><li><strong>Control your own body language</strong></li><li><strong>Settle an argument</strong><strong></strong></li><li><strong>Detect lies and deceitfulness</strong></li><li><strong>Close a profitable deal</strong></li><li><strong>Win a job interview</strong></li><li><strong>Be charismatic</strong><strong></strong></li><li><strong>Get a promotion</strong></li><li><strong>Emanate confidence</strong></li><li><strong>Get a pay raise</strong></li><li><strong>Conquer the corporate jungle</strong></li><li><strong>Exceed at business and social interactions</strong></li></ul>", 
    "end_date": null, 
    "title": "Master The Art of Body Language & Boost Your Confidence!", 
    "price": "25.00", 
    "instructors": "Dr. Roy Naraine, Adam Naraine", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506266_8494_2.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-body-language/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T15:48:32Z"
}