{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Max Profit Marketing: How to Double Your Business Profits in 6 Months or Less</strong></p>\n\n<p><em class=\"redactor-inline-converted\">This Course is Designed for the Small Business Owner to Quickly and Easily to Double their Net \"Bottom Line\" Profits in 6 Months or Less!</em></p>\n\n<p><em>If you are a small business owner:</em><br></p>\n\n<p>You <strong class=\"redactor-inline-converted\">want Increase Net Business Profits in your small\nbusiness.</strong><br></p>\n\n<p>You don't want spend more money on <strong class=\"redactor-inline-converted\">High Stress, Low Return</strong>\n<strong class=\"redactor-inline-converted\">Advertising.</strong></p>\n\n\n\n\n\n\n\n<p>You want to <strong class=\"redactor-inline-converted\">B</strong><strong class=\"redactor-inline-converted\">uild your business with Good Customers\n/ Clients with High Net Profits in mind.</strong></p>\n\n\n\n\n\n\n\n<p>You want to <strong>add to your current marketing and sales methods that will show results quickly.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">You Want to Maximize your Small Business Profits Quickly without reinventing the wheel!</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">If you say yes to the above then you need to take Double your Business Profits in 6 Months\nor Less and start raising your business profits today!!</strong></p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Take any product or service base business, either online or\noffline....</em></p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Add in Secret, Simple, Low Stress Sales and Marketing Methods.....</em></p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Develop &amp; Grow Your Own Ideal Customer Base that Pay, Stay\nand Refer...</em></p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Then Watch your Bottom Line Business Profits Soar!</em></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I've been where you are right now. </strong>I know how\nhard it is to get a small business up and going, how tough it is to\nraise business profits that has plateau or fallen. I know what it\nlike to wake up each morning worried about payroll, debt, taxes,\nrent, government regulation, or where the next sales or check will\ncome from. I know how stressful being a self employed small business\nowner can be especially when you are the last to be paid in line!</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">But...</strong></p>\n\n\n\n\n\n\n\n<p>After many years of research, experimenting, failures, and\nsuccess, I am now running my businesses with high net profit margins\nusing the same exact same sales and marketing methods I teach. By\nusing these same sales and marketing methods you too can double your\nbusiness profits in 6 months or less! <strong class=\"redactor-inline-converted\">And I will show you\nexactly how I do it.</strong></p>\n\n\n\n\n\n\n\n<p>This course walks you through the entire process of doubling your\nsmall business profits in 6 months or less. We start by covering some\nbackground information on me and how use of this sales and marketing\nprinciples help make my businesses become profitable right from the\nget go. We then cover what keeps a business owner up at night and how\nmost business issues can be solved by one critical thing. Next we \nfigure out what you what to do with your increase business profits to\nhelp keep you motivated in applying these principles. We then look\ninto the magic formula that can raise your business profits almost\nimmediately, as well as the magic kicker that can double or even\ntriple your business profits at little or no cost.</p><p> We then examine\nyour customer needs and wants and how best you can serve them which\nin turn builds your business raising your net profits. We cover some\nreal life examples in the course as well as a detail case study of\nhow these methods work in real life.<strong class=\"redactor-inline-converted\"> We also review key principle ideas\nand workshop them so you have an action list to get started right\naway!</strong></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">ARE YOU READY TO TAKE ACTION?</strong></p>\n\n\n\n\n\n\n\n<p>Enroll now, and we'll dive right in.</p>\n\n\n\n\n\n\n\n<p>Marc Lawson, DC</p>", 
    "end_date": null, 
    "title": "Max Profit Marketing - How to Double Your Business Profits", 
    "price": "20.00", 
    "instructors": "Dr. Marc Lawson, D.C.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776354_655d_2.jpg", 
    "course_url": "https://www.udemy.com/maximum-profit-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T21:32:06Z"
}