{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      Este curso está dirigido a cualquier persona que quiera utilizar Internet para atraer clientes y fortalecer las relaciones con clientes actuales.  Mercadeo Oportuno es una filosofía que define un camino claro para entender mejor al cliente y ayudarlo en sus problemas para construir relaciones estables y duraderas.  </p>  <p>  \t       Cada día hay más gente conectada a Internet.  Tus amigos, familiares, clientes y proveedores están usando Internet para conseguir nuevas empresas, adquirir productos y decidir dónde gastar su dinero.  Cada vez que tenemos una necesidad hacemos una búsqueda.  Y con la telefonía celular no tenemos que esperar a llegar al computador.  </p>  <p>  \t<strong style=\"\">Tus clientes están conectados a Internet y si no sabes como conectarte con ellos, otra empresa los va a atender.  </strong>  </p>  <p>  \t       En este curso aprenderás cómo:  </p>  <ul style=\"\">  \t<li><strong style=\"\">Convertirte en un Experto para tus clientes</strong></li>  \t<li><strong style=\"\">Utilizar la Página Web como centro de tu estrategia</strong></li>  \t<li><strong style=\"\">Conocer cómo funcionan los buscadores</strong></li>  \t<li><strong style=\"\">Entender como usar las Redes Sociales</strong></li>  \t<li><strong style=\"\">Atraer las personas más interesadas</strong></li>  \t<li><strong style=\"\">Acompañar a los prospectos en su decisión</strong></li>  \t<li><strong style=\"\">Mejorar el servicio que ofreces a tus clientes</strong></li>  </ul>  <p>  \t       Aprenderemos a usar herramientas gratuitas o de muy bajo costo disponibles en Internet.  Evitando las complicaciones técnicas nos centraremos en los objetivos importantes para tu negocio.  Sólo hace falta que tengas una conexión a Internet y que sepas como navegar en Internet.  Todo lo demás te lo explicamos de una forma sencilla y amena.  </p>  <p>  \t       La mayor parte del curso son vídeos con explicaciones y casos prácticos.  También se incluye un diccionario con todos los términos utilizados para que no te pierdas de nada.  Todo el tiempo se está agregando enlaces a materiales interesantes, así como libros electrónicos en formato PDF.  </p>  <p>  \t       La filosofía de Mercadeo Oportuno te muestra el camino para atraer personas interesadas, y que éstas personas te recomienden nuevos clientes usando las Redes Sociales.  Es una filosofía fácil de entender y con unas indicaciones claras de cómo utilizarla.  Es el resultado de años de experiencia manteniendo un negocio en Internet.  Está orientada específicamente a emprendedores que quieran mejorar su negocio y llevarlo a niveles más altos.  </p>  <p>  \t       Este curso no te ofrece ninguna receta mágica, sino que te muestra un camino claro, comprobado, con sentido común, para que puedas adaptarte y triunfar en el mundo moderno.  Como las cosas importantes de la vida, requiere dedicación, talento y constancia de tu parte.  </p>  <p>  \t       Yo recomiendo tomar todo el curso en 4 semanas para que te dé tiempo de hacer los ejercicios y asimilar todo el conocimiento.  Aunque si tienes el tiempo y la dedicación puedes completarlo en 5 días.  </p>", 
    "end_date": null, 
    "title": "Mercadeo Oportuno para Emprendedores", 
    "price": "50.00", 
    "instructors": "Imolko Corp", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/245120_f6c7_4.jpg", 
    "course_url": "https://www.udemy.com/mercadeo-oportuno-para-emprendedores/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-17T16:49:05Z"
}