{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>[July 13th 2015 update: Some students have wondered why I don't teach or talk about common learning strategies like speed reading, advanced note taking or mnemonics. The reason why is because there is no evidence that Elon Musk uses any of these strategies. The value of this course isn't these things anyways, you can learn these strategies in many places. </strong></p><p><strong>Instead, this course focuses on everything else that has helped Musk learn so many skills so quickly and implement them so rapidly, which is arguable even more valuable a skillset. </strong></p><p><strong> -Timothy </strong><strong>/update]</strong></p><p>In this course you'll learn how to learn like Elon Musk.</p><p>Not only that, you'll also learn how to develop the same skillset the Elon has.</p><p>Accelerated learning isn't just about how fast you learn, it's also about learning the right things.</p><p>The major skillsets Elon has are these</p><ul><li>Programming</li><li>Engineering/Physics/Mathamatics</li><li>Leadership</li><li>Entrepreneurship/Economics</li></ul><p>In this course you'll learn about what books Elon reads, how he devours information and how he educated himself, largely independently, as a young child and teenager.</p><p>You'll follow him through his college years, where he got a dual bachelors in Physics and Business, and then to Stanford and his first business, Zip2, in Silicon Valley.</p><p>This course also covers information about Musk that is not included in his recent biography by Ashley Vance, including the pioneering new school he is building for his children and a handful of other kids (who's parents are SpaceX employees).</p><p>Besides the subjects above, you'll also learn how Elon developed his extraordinary vision in the first place as a child. You'll learn what Elon did to motivate himself to work as hard as he has and to believe in himself so strongly.</p><p>This course isn't just about intellectual learning, it's also about emotional learning.</p><p>This might be a term you haven't heard of before... if so, emotional learning is the process of learning to like something or dislike something. It's the foundation of motivation. Pleasure and pain. These twin forces are what drive us to do what we do and avoid doing these things we know we should do but never end up doing.</p><p>Emotional learning is important when looking at Elon because so much of his success has to do with the fact that at an early age he learned to believe in himself, that anything was possible and that if he learned the right skills he could do whatever he set his mind to.</p><p>In this course you'll learn how he, often unintentionally, learned these lessons. You'll also learn how to replicated this kind of emotional learning yourself so that you can build the same sort of emotional fitness that has served Elon so well throughout his life.</p><p>Finally, you don't have to be an engineer or a programmer to take this course or understand how he learns. Even if you don't wish to replicate his exact skillset, there is much to learn in how Elon has managed to learn so much and implement it successfully in such a short amount of time.</p><p>If you're interested in learning how the mind of one of the most important figures in history has built his mind, this course is the only resource out there, book, course or otherwise that covers these subjects. Learning fast is the biggest advantage you can have in business.</p><p>Take this course and discover how Elon Musk learned to become the man who he is today.</p>", 
    "end_date": null, 
    "title": "Modeling Report: Elon Musk's Business & Learning Strategies", 
    "price": "50.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523838_685a_3.jpg", 
    "course_url": "https://www.udemy.com/elon-musk/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-09T03:33:30Z"
}