{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Mastermind groups offer a combination of brainstorming, education, peer accountability and support in a group setting to sharpen your business and personal skills. A mastermind group helps you and your mastermind group members achieve success.<br><br>Participants challenge each other to set powerful goals, and more importantly, to accomplish them. The group requires commitment, confidentiality, willingness to both give and receive advice and ideas, and support each other with total honesty, respect and compassion. Mastermind group members act as catalysts for growth, devil’s advocates and supportive colleagues. This is the essence and value of mastermind groups.<br><br>Mastermind groups are everywhere! The popularity of masterminding is growing as people just like you are finding the success they want through brainstorming with others, creating goals, holding each other accountable, and encouraging a positive mental attitude.<br>Masterminding keeps you on target and moving forward with the important things in your personal and professional life.</p><p>Here’s what you’ll learn:</p><ul><li>You’ll learn which are the most profitable types of mastermind groups</li><li>How to select the right members for your group</li><li>How to determine how many members you should have in your group</li><li>You’ll learn how much you should charge and when to host FREE groups</li><li>How to set your fees the right way</li><li>The purpose of free masterminds</li><li>How to enroll members into your mastermind group</li><li>Exact steps for running your mastermind the right way</li></ul>", 
    "end_date": null, 
    "title": "Money and Mastermind: Building A Profitable Mastermind Group", 
    "price": "40.00", 
    "instructors": "Mark  Sumpter", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/866292_45fc_3.jpg", 
    "course_url": "https://www.udemy.com/money-and-mastermind-building-a-profitable-mastermind-group/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-01T23:12:51Z"
}