{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>How do you learn to be an entrepreneur?</strong></p><p>You can either learn it the hard way — the school of hard knocks — or you can learn it from someone who's already been there. What's your time worth? Why not leverage your time by using Larry Jacobson's 20 years of experience? </p><p>Are you prepared to deal with the fears, risks, decision-making, changes, and loneliness of being an entrepreneur? Many of today's classes, books, and audio programs fail to address these very real challenges. </p><p>This powerful course will help you thrive as an entrepreneur as the no nonsense instruction comes from 20 years of real world experience. </p><p>You'll learn how to deal with the entrepreneurial roller coaster ride that can be tough and lonely at times. Larry Jacobson knows what you're going through. </p> <ul><li>Do you consider yourself an entrepreneur?</li> <li>Are you managing a one-person venture from home? </li> <li>Are you new to a leadership position? </li> <li>Do you have an online retail, coaching, or other service business? Or perhaps you own a brick and mortar store with employees? </li> <li>Are you losing sleep because of your business life? </li> <li>Do you worry about your business so much that it's not as fun as you imagined? </li> <li>Do you struggle with pending decisions? </li> <li>Are you an employee working for someone else and want to move up the ladder? </li> <li>Do you feel alone in your pursuit, wishing you had an advisor who understands the challenges you're facing? </li></ul> <p>If you answered YES to any of these questions, read on…. </p><p><strong>After taking this course, you will:</strong> </p><p>• Increase your self-confidence as a leader of yourself and others. </p><p>• Turn your dreams into achievable, measurable goals. </p><p>• Reduce your stress level. </p><p>• Make your time more effective. </p><p>• Make decisions faster and easier. </p><p>• Never fear your fears again. </p><p>• Truly ENJOY being an entrepreneur!</p>", 
    "end_date": null, 
    "title": "Navigating Entrepreneurship", 
    "price": "25.00", 
    "instructors": "Larry Jacobson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594728_a908_2.jpg", 
    "course_url": "https://www.udemy.com/navigating-entrepreneurship/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T07:17:47Z"
}