{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Negotiation: more than tactics, successful entrepreneurial negotiations relies on understanding the nuances of human action and the psychology of behavior.  </strong> </p>    <hr>  <strong></strong>    <p>  \t                   Thought provoking, practical, and sometimes even entertaining principles of influence and negotiations that are simple to integrate into your life and business!  </p>      <hr>    <p>  \t                   The ideas presented in this course are \"integrated principles\". They are most effective when they become ingrained into your way of thinking and behaving in business and life.  </p>  <p>  \t<strong>Negotiation </strong>is any conversation between two or more parties where an agreement is trying to be reached. <strong>Influence</strong> is having the ability to 'sway' the outcome of a situation - to produce a desirable effect.  </p>  <p>  \t               All <strong>Successful negotiation and influence</strong> strategies are dependent upon our thoughts about the situation, and how well we respond to the situation.  </p>  <p>  \t               By learning to to think differently, and learning to 'respond' as opposed to 'react',  we're able to produce very desirable business and personal results.  </p>  <p>  \t                   *** When learning the principles in this course do not allow the brevity nor the simplicity of the concepts to dissuade you from integrating them into your life.  As with many things, simple can become the most profound when applied consistently.  </p>  <p>  \t                   The title indicates that these are principles you can begin to use right away, and I sincerely hope that you do!  </p>  <p>  \t                   All concepts taught in this course promote true WIN-WIN (not win-lose) outcomes!  </p>", 
    "end_date": null, 
    "title": "Negotiation Vol. 1: Negotiate to Your Advantage Principles ", 
    "price": "20.00", 
    "instructors": "NLP, Positive Psychology Coach Patrick Howell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/344746_42a1_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-negotiate-how-to-influence-people-consultant-coaching-money/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-15T00:32:19Z"
}