{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Negocios Digitales</strong>. <em><strong>The Heroes Club Institute</strong></em> es el Centro de Formación Empresarial y de Emprendores de <em><strong>The Heroes Club </strong></em>plataforma internacional de <strong>Networking</strong> : Red Global de Empresas; Talento, ideas , proyectos, Iniciativas increíbles. Financiación e Inversores, Mercados , Conocimiento, Visibilidad.</p><p>The Heroes Club Institute cuenta con más de 100 mentores de primer nivel en el mundo empresarial, financiero y de negocios para apoyar tanto empresas tradicionales que se están digitalizando como a startups que están en sus fases de nacimiento o crecimiento.</p><p>En esta ocasión la conferencia de Negocios Digitales se denomina \"Across The Digital Line\" y en ella varios mentores de Negocios Digitales de The Heroes Club plantean los nuevos pasos y retos que se están encontrando la compañías para entrar en el mercado digital, se analiza esto desde los siguientes puntos de vista:</p><p>- Presentación de Jornada por <strong>Aurelio García de Sola</strong>. Presidente de The Heroes Club y por <strong>Carsten Moser</strong> Vicepresidente de The Heroes Club</p><p><strong>- Consejos de Dirección de Grandes Compañías Tradicionales. </strong><em><strong>Por Abel Linares</strong>. Fue CEO en cuatro compañías, dos de ellas cotizadas en el Ibex 35 y una dentro de las 100 primeras del Nasdaq. Actualmente es CEO de Nunkyworld y Consejero de Catenon Executive Search.<span></span></em></p><p><strong>- Implementación de Startups en Europa.</strong> <em><strong>Por Pilar Moreno. </strong>Directora/Co-fundadora de <em>Expandiendo S.L</em>. Asesoramiento a empresas y agencias de desarrollo en comercio e inversión internacional</em></p><p><strong>- Innovación en las empresas, y próximos pasos de los mercados.</strong> <em><strong>Por Ignacio Villoch.</strong> Centro de Innovación BBVA. Director Eventos y Actividades. Comunicación, Ocio y Entertainment</em></p><p><strong>- Internacionalización de empresas tradicionales y startups. </strong><em><strong>Por Geraldine Filippi,</strong></em><em> Directora Comercial y Marketing, Marca y Comunicación, Infraestructura de Business France Península Ibérica<span></span></em></p><p><strong>- Cómo están cambiando las reglas del juego. <em>Por Ángel Barbero</em></strong><em><strong>.</strong> Responsable de Desarrollo Corporativo Tecnológica</em></p><p><strong>- Caso de éxito explicado: BlaBlaCar. </strong><em><strong>Por Vincent Rosso,</strong> Director de España y Portugal de BlaBlaCar en España</em><em></em></p><p><br></p>", 
    "end_date": null, 
    "title": "Negocios Digitales para Empresarios y Transformación Digital", 
    "price": 0, 
    "instructors": "Club de Negocios The Heroes Club Club", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725332_72ba_2.jpg", 
    "course_url": "https://www.udemy.com/negocios-digitales-the-heroes-club-institute/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T09:42:13Z"
}