{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>NOTE</strong>:  The original name of this course was \"[<em class=\"redactor-inline-converted\">NEW] BUSINESS IDEAS: Create Your $1,000,000 Business This Week!\"  Due to Udemy's new rules, the titled was changed to \"</em><em>New Business Ideas to Start a Company of Your Own\"</em></p>\n\n<p>=========================================================<br></p>\n\n\n\n<p>+++The intent of this course is to help you create your million dollar business from scratch, even if you never started a business before.+++</p>\n\n\n\n<p>Everything you will learn in this course \"<strong class=\"redactor-inline-converted\">BUSINESS IDEAS: Create Your $1,000,000 Business This Week</strong>\" is real data. They are real actions I took for my own business and the entire course is based on a real Case Study. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">NEW COURSE</strong>: Created January 2016 ***T<em class=\"redactor-inline-converted\">ake the course for 30 full days, risk free - there's a full, no questions asked ever refund policy!</em></p>\n\n\n\n\n\n<p>In synthesis, it is a million-dollar business I am building for the entire world to see. By the end of this course, you’ll be able to effortlessly turn a vague business idea into a real million dollar business.</p>\n\n\n\n\n\n<p><br> <strong class=\"redactor-inline-converted\">Come with me on a journey to business creation fast-track wealth ... in only 2 hours!</strong><br></p>\n\n\n\n\n\n<p>This course is part of the Millionaire’s Roadmap series. It will teach you how to hack your business initial cash-flow, growth, and customer acquisition by the truckloads, empowering you to build a business faster, more effectively and with a much higher chance of selling it at a high price (<em class=\"redactor-inline-converted\">if you desire to do so</em>)<br></p>\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>Whether you're an entrepreneur, a professional, an existing business owner or simply thinking on starting a new business, you are forced to grapple with an every-increasing amount of competition and technology transformation. In fact, according to the SBA 2/3 of US businesses quietly cease to exist before they reach 10 years of existence. This means that most small businesses generate cash-flow for an owner and his or her family for some period of years and then quietly close. <br></p>\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Anyone can build and grow a successful business </strong></p>\n\n\n\n\n\n<p>This course is about improving your chances of building and growing a profitable and successful business <em class=\"redactor-inline-converted\">faster and effectively</em>. We go far beyond the kinds of \"<em class=\"redactor-inline-converted\">business ideas</em>\" (or “<em class=\"redactor-inline-converted\">how to</em>” gurus) you may have been exposed to, by diving into an actual real live case study that shows in real time the progress of going from absolutely $0 to $1M. </p>\n\n\n\n\n\n<p>This specific course of the Millionaire Roadmap series, gives you step-by-step instructions on how to find an idea and validate it to build a million dollar business without having to guess.  It takes the wishful thinking out of the process.  It also answers once central question, and that is ...<em class=\"redactor-inline-converted\">\"would there be at least a million dollars’ worth of customers if I start my business today?\"</em></p>\n\n\n\n\n\n<p>In the Millionaire’s Roadmap series, you'll learn how to bring your initial cash-flow; massively grow your customer acquisition; run ads as close to zero cost to you as possible; upsell, down-sells, cross-sells and increase customer value in a whole new way - a faster, better way. </p>\n\n\n\n\n\n<p>The core of this Business Ideas course teaches you how to:</p>\n\n\n\n\n\n<ul><li>Effortlessly      turn a vague business idea into a real million dollar business. </li><li>Effortlessly      find a niche market </li><li>Effortlessly      find a profitable business idea </li><li>Effortlessly      find $1,000,000 worth of customers </li><li>Effortlessly      calculate a customer’s value </li><li>Effortlessly      pick the winner idea </li><li>Effortlessly      find if there will be enough traffic for a product or service </li><li>Effortlessly      validate if people will be willing to pay for a product or service</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How I'll teach you to growth hack your business from $0 to $1M </strong></p>\n\n\n\n\n\n<p>The sad irony is that in order to build a successful business in the past, you had to have lots of money, borrow heavily or have access to investors. Or, you had to invest hundreds of dollars and hours attending an MBA program to understand all the moving parts of running a business, or wing it trying to figure out how to make your business successful.  I spent 18 years of my life doing exactly that. </p>\n\n\n\n\n\n<p>Fortunately, I already made all the mistakes. I have two master’s degrees, one in Business and one in Finance. I have built a business from scratch. That is correct, I started my first business from my bedroom. My kitchen table was my \"<em class=\"redactor-inline-converted\">telemarketing department</em>” and my closet was my “<em class=\"redactor-inline-converted\">support department</em>.” I grew this business to be the top 10 in the country in my industry. I used it as my guinea pig to see what worked and what didn’t ... and boy, do I have the scars to show you what didn’t work!</p>\n\n\n\n\n\n<p>I've designed a course based heavily on a real business I am building as we speak. One thing I noticed about “<em class=\"redactor-inline-converted\">gurus</em>” is that they all show you the “<em class=\"redactor-inline-converted\">how</em>” but none of them show you a live case study.  Anyone can teach you the how, all you have to do is read a couple of books and regurgitate the information. Showing you the “<em class=\"redactor-inline-converted\">how</em>” <strong class=\"redactor-inline-converted\">LIVE </strong>is an entirely different story. You see the good, the bad and the ugly. You learn how to iterate or pivot. You have something to emulate without taking massive risks or trying to figure out the next steps on your own. </p>\n\n\n\n\n\n<p>This 7-section course does not contain any flashy graphics or fancy videos. It shows simple screenshots or screencasts of the case study as we progress; presented in video-lectures and a great deal of worksheets and exercises. The course will require that you implement and follow through with each course in the Millionaire’s Series if you want to build a million dollar business. It won't be easy - but if you put in the work, you will massively increase your chances of success. </p>\n\n\n\n\n\n<p>In addition to the lectures, there is an additional 4-set sales funnel, worth over $1,000 each.  You can access them from the bonus section. These are ready to be implemented for complete holiday sales campaigns. All you have to do is tweak the text, links and images/videos and you are good to go. In future courses, I will teach you how to run these sales campaigns.</p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Millionaire’s Roadmap\" is a trademark of Jackie Burgoa.</em></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Every minute you delay is actually COSTING your business money....<br> <br> Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "New Business Ideas With a Million Dollars Worth of Customers", 
    "price": "30.00", 
    "instructors": "Jackie Burgoa, MBA, MSF", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654452_c4e8_9.jpg", 
    "course_url": "https://www.udemy.com/growth-hacking-your-business-ideas/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T11:57:25Z"
}