{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Course summary</strong></p><p style=\"\"><strong style=\"\">Why we decided to create this course?</strong></p><p style=\"\">We work with startups on daily basis within our accelerator StartupAkademia  and we have noticed that despite tones of very good books on lean methods (i.e. Lean Analytics, Running Lean etc.) startups as well as small / medium businesses have problems with applying this knowledge in practice. We have noticed that, especially first time startups, do not really understand their business model (which is totally understandable). That&#039;s why, it is very difficult for them to know what they should concentrate on. Most entrepreneurs / startups have more or less clear business idea but quite often they do not know the business models they can chose and end up learning it the hard way, through their mistakes. Some of them have read the Lean analytics, Lean Starup or Running Lean but even then they do not know exactly how to translate it into coherent Excel model. A business model in the form of Excel is very important for evaluating your business, seeing how much cash you need and how your hypothesis and KPIs are translating into the business</p><p style=\"\"><strong style=\"\">What will this course give you?</strong></p><p style=\"\">The course is a practical, step by step guide loaded with tones of tips and tools that will help you significantly speed up with your business, especially if you are a startup or a small / medium business. There is little theory – mainly examples, a lot of tips from our own experience as well as other notable examples worth mentioning. Our intention is that thanks to the course you will know:</p> <ol style=\"\"><li style=\"\">what your business model is about, what to concentrate on and what are the key KPIs for you?</li> <li style=\"\">How you can translate it into Excel and evaluate your business?</li> <li style=\"\">How to make conclusions on the basis of your business model presented in the form of Excel</li></ol> <p style=\"\">In this course we concentrate only on on-line business models</p><p style=\"\">On top of that every moth we organize office hours for 5 startups (first come first served bases) during which startups get 30 minutes to ask as directly (phone, Whatsapp or Skype) for advices.</p><p style=\"\"><strong style=\"\">How the course is organized?</strong></p><p style=\"\">Currently the course is divided into 5 sections:</p> <ul style=\"\"> <li style=\"\"><strong style=\"\">Introduction</strong>. In this section I give you quick overview of the purpose and approach we will use in each and every section</li> <li style=\"\"><strong style=\"\">E-commerce business model.</strong> In this section you will get insight t into the business model of different e-commerce companies. E-commerce businesses group is very diversified so we will try to show the similarities and the differences between concepts.. You will learn here the definition of this business model, see some examples of companies using this business models. You will also understand what really matters in this sort of business, what KPIs you should look at and what values you can expect. Afterwards, I will show you how you can build the model in Excel and what conclusions can you draw from it.</li> <li style=\"\"><strong style=\"\">2-sided market business model. </strong>This business model has been very popular over the last 5-years and successful companies in this model can grow to be true global players at big scale. Here you will get insight into the business model of 2-sided market, especially marketplaces. You will learn not only the definition of this business model but you will have also the opportunity to see some examples of companies using these models. You will also understand what really matters in this sort of business, what KPIs you should look at and what values you can expect. Afterwards, I will show you how you can build the model in Excel and what conclusions can you draw from it.</li> <li style=\"\"><strong style=\"\">Media site business models.</strong> Here you will have a look at relatively simple and cheap business model – media site. You will learn the definition of this business, see some examples of companies using this business models. You will also understand what really matters in this sort of business, what KPIs you should look at and what values you can expect. Afterwards, I will show you how you can build the model in Excel and what conclusions can you draw from it.</li> <li style=\"\"><strong style=\"\">SaaS business models.</strong> Here you will get insight into the business model of Software as a Service companies. You will learn the definition of the business model , see some examples of companies using this business models. You will also understand what really matters in this sort of business, what KPIs you should look at and what values you can expect. At the end, I will show you how you can build the model in Excel and what conclusions can you draw from it.</li> </ul> <p style=\"\">We will be adding another 2 business models: mobile application model an User Generated Content model. The price will increase as we develop further the course</p><p style=\"\"><strong style=\"\">You will be able also to download many additional resources</strong></p> <ul style=\"\"><li style=\"\">Models in Excel show in lectures</li> <li style=\"\">Links to books worth reading</li> <li style=\"\">Presentations of different business models</li></ul> <p style=\"\"><strong style=\"\">At the end of my course, students will be able to…</strong></p> <ol style=\"\"><li style=\"\">Pick the right business model for their business idea</li> <li style=\"\">You will understand what is important in your business</li> <li style=\"\">You will know what KPI you should look at and what are the benchmarks</li> <li style=\"\">You will be able to write down your business model in the form of an Excel model and to draw conclusion out of it</li></ol><p style=\"\">Good luck with the course and if you have any question please write to me or in the discussin panel</p>", 
    "end_date": null, 
    "title": "On-line Business Models in Excel - Practical Guide", 
    "price": "25.00", 
    "instructors": "Asen Gyczew", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/603904_a568_4.jpg", 
    "course_url": "https://www.udemy.com/on-line-business-models-in-excel-practical-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-06T11:06:33Z"
}