{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Have you always wondered how all of these people online make a TON of money without doing much if ANY work at all?</strong> Well, in this course I am going to show you all of the ways that you can start generating easy and guaranteed money instantly without doing much work.  </p>  <p style=\"\">  \t  Inside the course I will tell you about all of the free tools online that you can use to start your home business and make money from the comfort of your home. You will see me break everything up into simple terms and ways to get started without any hassles. I reveal all of my secrets that others don't want you to know about and take advantage of.  </p>  <p style=\"\">  \t  The internet is a powerful place that has a lot of resources for you to use but you have to go out there and find it however in this course, I save you the time and effort and show you all of the tools and platforms that are free to use to make easy and instant money with.  </p>  <p style=\"\">  \t  Don't waste any more time because the more you wait, the more money you are actually losing by not finding out about these free resources that others are already taking advantage of and making hundreds if not thousands of dollars every month from the comfort of their home.  </p>", 
    "end_date": null, 
    "title": "Online Business: Secrets to Success While Working from Home ", 
    "price": "20.00", 
    "instructors": "Andrew Nagy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403848_3389_4.jpg", 
    "course_url": "https://www.udemy.com/online-business-secrets-to-success-while-working-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T22:15:36Z"
}