{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\">I was skeptical about making money online. It sounded too good to be true. I mean if it was that easy, why wasn't everyone doing it?</strong></em></p><p style=\"\">We have all heard of the people that became overnight internet success stories and made millions of dollars. I'm not one of them – <strong style=\"\">but I did</strong> <strong style=\"\">earn over $50,000 in my first official year of online business, all working part time from my laptop with a baby in tow</strong>.</p><p style=\"\">I'm about to show you how and best of all I include a month by month break down of all my profits so you can see exactly how I did it, with practical tips you can implement to start turning a profit right now.</p><p style=\"\">Everything I show you is something you can put into practice right now to increase your profits.</p><p style=\"\">But first let me give you an idea of my story and profit break down:</p><p style=\"\"><strong style=\"\">The First Three Months</strong></p><p style=\"\"><strong style=\"\">Profit</strong></p><p style=\"\"><strong style=\"\">Month One </strong>- $5093</p><p style=\"\"><strong style=\"\">Month Two - </strong>$6563</p><p style=\"\"><strong style=\"\">Month Three - </strong>$6762</p><p style=\"\"><strong style=\"\">The Idea</strong></p><p style=\"\">I had an idea of writing resumes online but I needed to test it first – I only had $100 budget to start my business so I needed to make sure my idea would work before spending any money on it. My testing phase worked great and I had my first 4 clients in one day. I'm going to show you exactly how I tested my idea and at the end of this module, you will be able to test any idea you have and know if it is going to make money within 24 hours. </p><p style=\"\"><strong style=\"\">Improvements</strong></p><p style=\"\">Next on the agenda was to improve my business structure (this course is going to show you how to improve yours as well)</p><p style=\"\">This included a website (I have no tech skills so I used a very basic drag and drop site which worked a treat). By the end of this course module you will be able to set up your own website with no technical knowledge and have it up and running within a few hours.</p><p style=\"\">I worked out the most profitable advertising and marketing structure for my business and I'm happy to say that for every $30 I spend on advertising I make around $800 profit. You will learn how I set this up in the course and it's so simple to implement you can expect to have it up and running within a day too.</p><p style=\"\">I included a special something for potential clients to sweeten the deal which meant it was a no brainer to buy from me instead of the competition. I'll tell you exactly what it was – and it doesn't matter what business you are in – it's something you can apply right now.</p><p style=\"\">I'll show you exactly the kind of testimonials you need to actually sell your services and products – and I'm going to show you my exact sales page which is still converting customers to this day.</p><p style=\"\"><strong style=\"\">Months 4,5 &amp; 6</strong></p><p style=\"\"><em style=\"\">I ended up pregnant and with severe morning sickness for months four, five and most of six. As a result I completely I only worked about 10 hours per week if that so my profits were less – but still really good for the amount of hours worked.</em></p><p style=\"\"><strong style=\"\">Month Four:</strong> $3916</p><p style=\"\"><strong style=\"\">Month Five:</strong> $4522</p><p style=\"\"><strong style=\"\">Month Six:</strong> $2512 (included a two week holiday)</p><p style=\"\">One of the big issues I had was that my phone rang non-stop with client enquiries. At the end of month two I outsourced this to a virtual receptionist. I would divert my calls to her and she would act as a receptionist and answer any FAQ's, take orders etc. There are a lot of business tasks you can outsource without paying for a full time staff member – I'll show you more inside.</p><p style=\"\">I also increased my prices and tried different pricing points to find the sweet spot between what I could charge and what people were willing to pay. I'll show you the super simple way to work this out as part of the course structure.</p><p style=\"\">I also implemented some really important boundaries which really helped me deal with the fact that I was sick and still needed to work. Boundaries are super important but often overlooked - You will learn how to tee them up without annoying your clients as part of the course.</p><p style=\"\"><strong style=\"\">Months Seven, Eight and Nine</strong></p><p style=\"\">Having an ideal client in mind really helped to eliminate the bad apples from the basket and made my job so much easier! You will learn how to find the right customer for your business and how to turn negative customer experiences into positives.</p><p style=\"\">During this time a bunch of other important stuff happened for me – including the implementation of new software which saw my customer conversations skyrocket and my refund rate drop to 0. This led to more money in the bank so I'm showing you exactly what software I used and how I dropped my refund rate to 0 as part of the course.</p><p style=\"\">I also started networking with other entrepreneurs and did some professional development – again more on this inside.</p><p style=\"\"><em style=\"\">My profits started to creep up again during this period, despite the fact that I spent nearly a month in Bali without doing a drop of work, was still sick for the start of quarter and was still only averaging 10 hours a week.</em></p><p style=\"\"><strong style=\"\">Month 7 </strong>- $4850</p><p style=\"\"><strong style=\"\">Month 8</strong> - $3730</p><p style=\"\"><strong style=\"\">Month 9</strong>- $4838</p><p style=\"\"><strong style=\"\">Months Ten, Eleven and Twelve</strong></p><p style=\"\">These were the best months yet in my business and a lot of super important stuff happened that rocket fueled my business. </p><p style=\"\">First I found a free way to cut 75% of my advertising costs. You will learn this strategy straight up inside so you can implement it at the very start!</p><p style=\"\">I also started to track important business statistics which identified that I was barking up the wrong tree in terms of my offerings. If there was one thing I wish I'd known at the start it was this. You can find out why in the course.</p><p style=\"\">In month 11 I was on track to making it my most profitable month ever (actually it was my most profitable month ever before I had to refund a whole bunch of payments because I went into labor early). I'd just beat my previous best of around the $6700 mark with 8 days still to go when I went into labor early and had to refund a whole bunch of orders because I was stuck in hospital.</p><p style=\"\"><strong style=\"\">Month 10:</strong> $5525</p><p style=\"\"><strong style=\"\">Month 11</strong>: $4178 (despite spending the last part of the month in hospital)</p><p style=\"\"><strong style=\"\">Month 12:</strong> Maternity Leave</p><p style=\"\">I'm going to show you a whole bunch extras you need to get your business rolling as part of the course including 80+ business ideas you can use to get started right now, 50+ ways to market your business and my business resource guide with a list of all the software I use to collect payments, set up my site and run my business with no fuss.</p><p style=\"\">If you want to start your own business, or you aren't making any money in your existing business, you need this course.</p><p style=\"\">It's actually costing you money not to learn these strategies.</p><p style=\"\"><strong style=\"\">Start Now</strong></p>", 
    "end_date": null, 
    "title": "Online Business for Total Beginners: How to Get Started", 
    "price": "20.00", 
    "instructors": "Nicole Coggan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514492_0e9d_9.jpg", 
    "course_url": "https://www.udemy.com/online-business-for-total-beginners-how-to-get-started/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T10:57:17Z"
}