{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">How Do You Work From Home And Survive?</strong></p>\n\n<ul><li><p>Do you want to work from home, but are not sure how to handle the pressure?</p></li><li><p>Do you want to learn how to succeed as an online entrepreneur?</p></li><li><p>Do you want the freedom of being your own boss?</p></li><li><p>Do you want to know how to survive the emotional and mental pressures of running an online business?</p></li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Mental And Emotional Pressures</strong></p>\n\n\n\n<p>Being an online entrepreneur comes with a unique set of challenges, both mentally and emotionally.</p>\n\n\n\n<p>But they don’t have to hold you back, once you are aware of them and how to manage them, your productivity and entrepreneurial flair will flourish and your business profits will grow.</p>\n\n\n\n<p>This course focuses on the mental and emotional pressures of being an online entrepreneur and how to survive them and thrive on them.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn From 15 Years Of Experience</strong></p>\n\n\n\n<p>This course is based on 15 years of online entrepreneurial experience, both good and bad, from running online retail businesses, online digital product based businesses and online service based businesses.</p>\n\n\n\n<p>We share the lessons that we have learned that will protect your greatest asset, which is YOU.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Power Of Hope</strong></p>\n\n\n\n<p>What is the single most important motivational factor, that will keep you working through the long nights and hard times?</p>\n\n\n\n<p>Hope...</p>\n\n\n\n<p>Understanding how to set goals properly and with realistic balance is key to your success.</p>\n\n\n\n<p>In this course we will take you through how to harness hope and grow your business.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Strength Of Diligence</strong></p>\n\n\n\n<p>The secret that many miss, is that diligence is key.</p>\n\n\n\n<p>The tortoise wins the race, success online is founded on the principle of diligence.</p>\n\n\n\n<p>Compounding your interest, or hard work, is the real secret.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Being Misunderstood</strong></p>\n\n\n\n<p>How do you cope when those around you misunderstand what it is that you do, when your friends, family and acquaintances just don’t understand you and what you are trying to do?</p>\n\n\n\n<p>When they think that you are unemployed?</p>\n\n\n\n<p>Learning how to filter information and advice, is critical when trying to grow your business, not everyone’s advice should be welcomed.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Failing Your Way To Success</strong></p>\n\n\n\n<p>Failure is not your enemy, by embracing failure and learning how to use it, you can grow a profitable business.</p>\n\n\n\n<p>Also learning not to condemn yourself, will free up your productivity and creativity.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Secret To Productivity</strong></p>\n\n\n\n<p>There is a very simple secret to being productive and in this course we show you a very simple technique that will enable you to get productive, fast!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Finding Support</strong></p>\n\n\n\n<p>Working from home as an online entrepreneur can be lonely and you will often feel isolated.</p>\n\n\n\n<p>But knowing how to find the right type of support will help you flourish.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Avoiding Burn Out</strong></p>\n\n\n\n<p>One of the greatest threats faced by online entrepreneurs is burn out.</p>\n\n\n\n<p>When you work from home, you are always at work, but one simple principle will help you master the threat of burnout!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Identifying Opportunities</strong></p>\n\n\n\n<p>When it comes to growing your business, it is all about identifying opportunities.</p>\n\n\n\n<p>Knowing what to watch for, means that you can move fast when a genuine business opportunity arrives.</p>\n\n\n\n<p><strong>Take The Course - Survive And Thrive!</strong></p>\n\n\n\n<p>Join us on the other side and learn how to survive and thrive as an online entrepreneur.</p>", 
    "end_date": null, 
    "title": "Online Entrepreneur Survival Guide - Work From Home & Thrive", 
    "price": "20.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/867060_33ed.jpg", 
    "course_url": "https://www.udemy.com/online-entrepreneur-survival-guide-work-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-02T17:23:07Z"
}