{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is ideally suited to you if you’re thinking about starting an online business, or have already started one and you’re not sure why things aren’t as expected.</p><p>There are 44 video lectures, divided into themed sections, with learning assignments, online quizzes and supplementary resources taking around three and a half hours to complete, excluding assignments.</p><p>The first section deals with common perceptions about <strong>Online Business</strong>, followed by a section on whether you have the <strong>Personality, Skill &amp; Resources</strong> for an online business, which includes an online self-assessment quiz.<br> <br>There’s also a section devoted to <strong>Your Business Idea</strong>. What you need do to test if your business idea is really viable and considers if you’re struggling to come up with an idea.  </p><p>In <strong>Is This Online Business For You</strong> section, who your competitors are, whether you can compete - for attention - with your value proposition - and on search engines. How to work out the number of visitors and sales you need to be profitable and the pitfalls of relying on SEO and free visitors.</p><p>A section deals with the importance of <strong>Your Business Plan</strong>, why you need one and the 10 steps you need to create one. There’s also the case study of Bill Weber who uses six steps of the process to make the right choice for his online business. </p><p>In the final section <strong>Starting an Online Business - Revisited</strong> are the six biggest and most important mistakes made by new or existing online business entrepreneurs; so important, each is covered in a separate lecture.</p>", 
    "end_date": null, 
    "title": "Online Business - Do You Have What It Takes ?", 
    "price": "45.00", 
    "instructors": "Tony Simpson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761426_4601_4.jpg", 
    "course_url": "https://www.udemy.com/online-business-do-you-have-what-it-takes/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T12:34:42Z"
}