{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In the past 12 months my websites have received over 25 million page views. In this course I explain the simple steps required to get started using Google Search Console (Webmaster Tools) to optimize your website for attracting traffic and advanced, on-site SEO strategies.</p>\n\n<p><strong>On-site SEO is the simplest, and highest impact activity you can do to attract traffic!</strong>\n\n  </p>\n\n\n\n<p>… and it is the one thing that is completely under your control:\n\n  </p>\n\n\n\n<ul><li>         Get your website verified under Google Search Console</li><li>         Learn all the helpful information that Google collects about your website</li><li>         Use that information to optimize your titles, meta descriptions and internal links</li><li>         Monitor the changes in the ranking of your pages and keywords</li><li>         Speed up your website to increase its user friendliness and Google rankings</li><li>         And much more</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>That’s the great news.\n\n  </p>\n\n\n\n<p><strong>How Are We Going To Do This?</strong>\n\n  </p>\n\n\n\n<p>We will understand what SEO is, how ranking works and march through the extensive Google Search Console menu to get an idea of all the goodies available to the webmaster inside. \n\n  </p>\n\n\n\n<p>You will learn why titles make such a huge difference in Google ranking.\n\n  </p>\n\n\n\n<p>You’ll learn how to optimize your titles using information from Google itself combined with strategies to borrow from what your competitors are doing.\n\n  </p>\n\n\n\n<p>We will use a real, live website as a case study for optimization with Webmaster Tools.\n\n  </p>\n\n\n\n<p>As you apply the principles to your own website you will:\n\n  </p>\n\n\n\n<ul><li>         Get your website verified under Google Webmaster Tools</li><li>         Learn the menu structure of the tool and the information it provides</li><li>         Analyze your existing keyword performance</li><li>         Look at your ranking and keyword performance vs your competitors</li><li>         Learn which pages and keywords to focus on first</li><li>         Install the plugins you need for SEO on your site</li><li>         Optimize the titles of your most important pages</li><li>         Improve the “clickability” of the meta descriptions on your pages</li><li>         Measure and quantify your page speed load time</li><li>         Improve your page speed load time using Wordpress plugins</li><li>         Track and tweak the ranking of keyword phrases</li><li>         Establish a process for monitoring and improving your website ranking</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Is This For You?</strong>\n\n  </p>\n\n\n\n<p>That depends. This is for beginners (even though experienced entrepreneurs will benefit from the tips and advice).\n\n  </p>\n\n\n\n<p>It is for two categories of people:\n\n  </p>\n\n\n\n<p>1) Those who have a website and are ready to make SEO enhancements to improve traffic\n\n  </p>\n\n\n\n<p>2) Those who don’t have a website but want to understand on-site SEO and maximizing the use of Webmaster Tools\n\n  </p>\n\n\n\n<p>If that’s not you, check out my other courses!\n\n  </p>\n\n\n\n<p>If it is you, I’ll see you in Module 1.</p>", 
    "end_date": null, 
    "title": "Onsite SEO Using Google Search Console-Webmaster Tools", 
    "price": "30.00", 
    "instructors": "Jeff Hunt", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841542_55db.jpg", 
    "course_url": "https://www.udemy.com/onsite-seo-using-google-search-console-webmaster-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-06T19:16:26Z"
}