{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>------QUICK VERSION------</p><p><strong style=\"\">What are the requirements?</strong></p><p>Ideas, passion, a desire to create freedom and purpose</p><p><strong style=\"\">What am I going to get from this course?</strong></p><p>-25 lectures with worksheets and video content </p><p>-Powerful understanding of your brand and how to plan to communicate that message to your target audience </p><p>-A personal company profile, including Mission, Vision, and Values, to ensure a uniform message wherever you have a presence </p><p>-Clarity on your goals as a person and as an entrepreneur, as well as a plan for executing them </p><p>-Recognizing obstacles and using them for growth </p><p>-A detailed work process that allows you to focus on what you&#039;re good at while dishing out the stuff you&#039;re not so passionate about </p><p>-An intuitive schedule that factors in your desire to have freedom and discipline all at once. All while creating time for creativity and other things you love</p><p><strong style=\"\">What is the target audience?</strong></p> <p>-Entrepreneurs (brand new to highly experienced)</p><p>-Bloggers</p><p>-Artists </p><p>-Creatives</p><p>-Health &amp; Fitness Entrepreneurs</p><p>-Visionaries </p><p>-Hustlers</p><p>-Partnerships </p><p>-Small companies</p><p> -Anyone that has an idea and wants to live a more meaningful life</p><p>------MORE MEANINGFUL VERSION-----</p><p><strong style=\"\">What will I learn in this course?</strong></p><p>First of all, we&#039;re going to get straight to work. This course is like study hall for your business.</p><p>I&#039;m going to guide you through a series of questions that will help you get past the overwhelming thoughts and feelings that come up when thinking about how to successfully and productively run your business. You&#039;ll soon know exactly who you are, what you need to do, how you&#039;re going to do it, when you need to do it, and how much time it is going to take you.</p><p>I&#039;ve left so many business/life coaching events feeling great and then not knowing what the hell I was supposed to do to accomplish a single thing. People run out of these sessions to quit their jobs and leave their spouses. But then what? <strong style=\"\">Inspiring ideas are meant to give us freedom, not take it away.</strong></p><p>The truth is, the most successful businesses in the world are a marriage of vision and execution.</p><p>I believe in taking time to set things up properly. <strong style=\"\">I created this manual by outlining literally every single thing I needed to do in order for my business to be successful.</strong></p><p>Once I implemented a successful system for my business and my time I stopped having to worry about all the things I thought I was supposed to be doing. I went from literally freaking out every day to wondering what I was going to do with all my free time. Now, I&#039;m free to concentrate more on the things I love, like creating content and brain-storming new ideas.</p><p><strong style=\"\">I&#039;ve created a process for identifying what it takes to run your dream business and how to eventually get that message across to your intended audience.</strong></p><p>This course is easy to use because it adapts to everyone&#039;s individual needs. It&#039;s fun, and it&#039;s refreshing.</p><p>The most common reason people fail with their businesses is their inability to get out of their own way. Most people will spend more time thinking about all the work they have to do than actually working. You won&#039;t have that problem with this course. You will be mauling projects down left and right.</p><p><strong style=\"\">We gain freedom through discipline and it&#039;s incredibly liberating to have a sense of order in our work.</strong></p><p><strong style=\"\">Is this course right for me?</strong></p><p>There will be a moment when this course is right for you and it&#039;ll look like this - <em style=\"\">you have good ideas, some form of a brand, maybe some decent revenue streams or at least the thought of where the money will be coming from, you&#039;ve been working on your business for a while but it doesn&#039;t seem to be taking off or you&#039;re just afraid to launch. More than enjoying your work you are stressed out, you feel unorganized, unprofessional, and sometimes like an outright fake.</em> <em style=\"\">You can&#039;t stand the thought of working a 9-5 but aren&#039;t quite sure you can make it on your own. Deep down you know you are meant for something more meaningful, you have the desire to balance your work with your life, to develop personally, professionally, and creatively. You want happiness and you want success, together.</em></p><p>If you have any of these thoughts then you will enjoy this course. It is honest, funny, sensitive, motivating, and comes only from experience that has proven to work.</p><p>I have open, run, and now sold profitable businesses. I use the scheduling techniques from this course every day. I make enough money to live in a nice apartment downtown and have all the things I need. I write, draw, dance, cook, hang out with friends, and travel all the time. But the most important thing is that I feel 100% in control of my life - when I say yes, when I say no, nobody is telling me what to do anymore. Isn&#039;t that why we started this journey in the first place?</p><p><strong style=\"\">BONUS MATERIAL!</strong></p><p>1) I&#039;ve included <strong style=\"\">The Working Styles assessment</strong> in here as well. It&#039;s like a horoscope, only for your working style. You&#039;ll learn what type of worker you are and what environments you should put yourself in to stimulate productivity. </p><p>2) <strong style=\"\">Expert&#039;s Guide for Starting a Small Business</strong> - an eBook I wrote for Amazon that is included as a bonus. This book deals with writing business plans, approaching investors, getting funded, preparing the dreadful financial documents, as well as sample contracts so you can look pro in front of any bank or investor.</p><p>3) <strong style=\"\">Expert&#039;s Guide for Social Media Management</strong> - another Amazon eBook that gives a basic rundown of some of the major social media channels. This will help you utilize free marketing platforms to grow your business more quickly. </p><p>That&#039;s it folks. Now it&#039;s up to you. </p>", 
    "end_date": null, 
    "title": "Organizing Inspiration", 
    "price": "50.00", 
    "instructors": "Kirk Hensler", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351564_41e8_4.jpg", 
    "course_url": "https://www.udemy.com/organizinginspiration/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T04:22:10Z"
}