{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>What do <em>Slack, Fab, Skype, Klout, </em>and<em> GitHub</em> all have in common?</p>\n\n<p>They all started by <strong>outsourcing</strong> their product development.</p>\n\n<p>They didn't have technical founders, they didn't recruit a team of in-house engineers, and they didn't have gigantic development budgets. </p>\n\n<p><em>(And oh did I mention, they're collectively worth over 20 Billion dollars?)</em></p>\n\n<p>Outsourcing is the <strong>GO - TO</strong> strategy for saving time, money, and launching ideas that otherwise would never make it to market</p>\n\n<p>Did you know <strong>you</strong> can build a <em>world class</em> product without hiring an in-house team or recruiting partners?</p>\n\n<p>When you finish this course, you'll be able to outsource like a professional. You'll cut your development costs by <strong>up to 90%</strong> and become a much more <em>capable &amp; skilled</em> entrepreneur</p>\n\n<p><strong>-------------------------------------------------------------------------------------------------------------</strong></p>\n\n<p><strong>Why you should take this course:</strong></p>\n\n<p><strong>Every single </strong>company or startup outsources in one way or another. Whether its your product development, your advertising, your testing, or customer service - you need to be equipped to take advantage the opportunity outsourcing presents you.</p>\n\n<p>As an entrepreneur, outsourcing is an essential skill for saving money, being lean, and being successful.</p>\n\n<p>At the end of this course, you'll be able to:</p>\n\n<p>- Create, conceptualize, and map out your idea in a way that <em>anyone</em> can easily understand</p>\n\n<p>- Take your idea and create visual wireframes, mockups, and prototype that are <em>crucial</em> for solidifying your vision and communicating it effectively</p>\n\n<p>- How to sketch on the fly and rapidly build out, test, and collaborate on your feature ideas.</p>\n\n<p>- Understand in intricate detail the forces that effect your outsourcing project and how to position your project to be successful</p>\n\n<p>- Write job descriptions that bring in the best bids and are tailored for each platform</p>\n\n<p>- Put together professional documentation for your idea and identify any potential pitfalls before you spend any money</p>\n\n<p>- Select the best possible long term team based on a framework built over 100+ professional outsourcing projects.</p>\n\n<p>- Employ 10 advanced techniques for getting the best price and cutting your deployment time in half</p>\n\n<p>- Tailor popular tools like Asana, Trello, and Google docs to run your outsourcing project masterfully</p>\n\n<p>- Spot and document bugs before they become a significant problem</p>\n\n<p><strong>--------------------------------------------------------------------------------------------------------------</strong></p>\n\n<p><strong></strong><strong>About the instructor:</strong></p>\n\n<p>Top rated Udemy Instructor with over 300+ 5 star reviews and over 11,000 students</p>\n\n<p>All courses by the instructor have 100% positive reviews with an average of 4.95 stars.</p>\n\n<p>Startup founder for 5 years, raised 3 rounds of capital worth several millions of dollars.</p>\n\n<p>Worked as a VC and was in charge of deal flow in Silicon Valley. Oversaw investments in large companies like Facebook, LinkedIn, &amp; Tesla.</p>\n\n<p>Currently owns and runs Sprintkick, a web agency, that builds web and mobile apps for 20+ Fortune 500 companies. Created and launched over 100+ apps in the last 4 years.</p>", 
    "end_date": null, 
    "title": "Outsource your idea | Launch your business for 1/4 the price", 
    "price": "20.00", 
    "instructors": "Evan Kimbrell", 
    "commitment": "20.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483166_3165_3.jpg", 
    "course_url": "https://www.udemy.com/outsource-your-idea-launch-your-business-for-14-the-price/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T12:20:38Z"
}