{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\">It&#039;s sad to say, I&#039;m just addicted to helping people - there I said it.</em></strong>  </p>  <p>  \t  This course will share with you all of things I have learned in almost <em style=\"\">20 years of outsourcing technical &amp; marketing projects all over the world.</em>  I didn&#039;t learn this in my dorm room, in a class, or anywhere except the real world. I paid with real money, made lots of mistakes and also have had TONS of success with this approach.  </p>  <p>  \t<strong style=\"\"><em style=\"\">If you want to learn on how to tap a resource pool you never know existed or more importantly, how do I actually find and work with them - THIS Class is for YOU! </em></strong>  </p>  <p>  \t  In my real &quot;job&quot; (if you call it that) I work directly with clients on ways to grow their business.... so rather than figure out HOW to get things done I learned to focus on the WHAT and WHY.  I do, however use these platforms and these approaches all the time for my clients.  It&#039;s been a great way to help my clients grow without the headaches associated with employees.  </p>  <p>  \t<strong style=\"\"><em style=\"\">I literally fell into this solution well before any small business had these resources available and I decided to put together this course so you can learn all the great places I have found to get this stuff done.</em></strong>  </p>  <p>  \t  DISCLAIMER:  I don&#039;t own any company that provides this type of service so please don&#039;t think this is a sales job to get you to my &#039;guys&#039; somewhere in the world.  </p>  <p>  \t  I&#039;ve done everything from large scale software application development to a simple logo or intro video (some for as little as $5!) so please spend the for me to teach you how to do it.  </p>  <p>  \t  P.S. I&#039;m just like all the Entrepreneurs in the world trying to get a million things done, simultaneous with everything I need to keep my business running.  Oh without spending a fortune doing it.  </p>  <p>  \t  P.P.S - We will provide continual support for this 10 lecture series and will keep adding bonus content, great places to find cool resources or other ideas I come across on how to grow your business.  </p>", 
    "end_date": null, 
    "title": "Outsourcing without Fear - an Entrepreneur's Hands on Guide ", 
    "price": "20.00", 
    "instructors": "Bryan Durkin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430024_d280_2.jpg", 
    "course_url": "https://www.udemy.com/outsourcing-without-fear-an-entreprenuers-hands-on-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T15:56:36Z"
}