{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>You have a lot of goals and ideas. You are confident they will work. However, finding the time of day to make those goals and ideas happen is close to impossible. Open time quickly gets filled up with other tasks that steal our attention from our best goals and ideas.</p><p>How much would your life change if most of the tasks that take up your time were done by other people? Imagine not having to schedule social media posts, edit videos, or do other tasks that you know take up too much of your time.</p><p>That is possible with outsourcing. Ever since I started outsourcing most pf my tasks, I have found more time to create training courses. The overall result has been a profit in less time than ever before. Outsourcing saves me over 40 hours of my time per week. For a small investment, I now buy back 40 hours of my life every week. </p><p>This is how entrepreneurs become successful. We often praise the top entrepreneurs for their work ethic. While their work ethics are exemplars for all of us, they hire people to do most of their tasks. The most successful entrepreneurs only work on their most important work. Any work that does not matter as much gets outsourced to save them more time.</p><p>In this course, you will discover how to outsource your business and repurpose your newfound time towards making a profit.</p><p>If you are ready to take your business to the next level, then click \"Take This Course\" now.</p>", 
    "end_date": null, 
    "title": "Outsourcing Mastery: How I Became A Successful Entrepreneur", 
    "price": "20.00", 
    "instructors": "Marc Guberti", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619826_9598_2.jpg", 
    "course_url": "https://www.udemy.com/outsourcing-mastery-successful-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T22:53:26Z"
}