{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    New Updates January:  </p>  <p>  \t        Pumped to announce that my team and I just hit $4,000,000 in total sales between a few of my companies just in the past 20 months by utilizing my virtual team members.  </p>  <p>  \t            I&#039;m also excited that over 1600 students and 5 start reviews on this course in the past month -- Couldn&#039;t do it without your support.  </p>  <p>  \t            My outsourcing experiments have really paid off ... and those that worked are revealed here in this course.  </p>  <p>  \t                          Are you looking for a course that will teach you how to utilize the right tools and resources to <strong style=\"\">leverage your time and grow your business</strong> with hiring virtual team members through outsourcing?  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">In this course I’m going to cover: </strong>  </p>  <ul style=\"\">  \t<li>How to determine what you need to outsource by showing you examples and helping you identify your needs </li>  \t<li>How to find the right team on your first try from some of my favorite websites </li>  \t<li>How to train your team without feeling like you’re baby sitting them all day long </li>  \t<li>How to grow your team and make sure they are allowing you to scale and finally </li>  \t<li>How to actually make more money by hiring a virtual team</li>  </ul>  <hr style=\"\">  <p>  \t                            If you are <u style=\"\"><strong style=\"\">tired of that long to-do list that never seems to get done</strong></u> then I’m excited you’re here. I’m here to teach you how to profit while others do your work. We’re going to dive into tips and strategies that will help you remove your daily tasks by delegating them to someone who can do them better than you so that you can focus on what you are really passionate about.  </p>  <p>  \t<strong style=\"\">Beginner to Outsourcing?</strong> If you’re just getting started with outsourcing, I’m going to provide you with the right foundation to get started. You’re not going to have that “<u style=\"\">Am I wasting money</u>” voice talking to you because I have the exact strategies to follow to succeed with outsourcing.  </p>  <p>  \t                            If you’ve <strong style=\"\">tried outsourcing before and failed</strong>, I know how you feel. In fact I’ve spent thousands of dollars learning how to create a team that works well for me and<strong style=\"\"> how to leverage talent to meet the needs of my business.</strong> I’ve met many people that have hired their virtual assistant, only to find themselves doing twice as much work. You should remove yourself from the equation as fast as possible.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Bonus Material Included in this Course:</strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">Training Guides</strong> for you to Fill Out to Design Your Plan</li>  \t<li><strong style=\"\">Video Walkthroughs</strong> of my Favorite Tools [many of the tools are FREE ones]</li>  \t<li><strong style=\"\">Templates</strong> for you to Use that have Saved Me 60% of My Time</li>  \t<li><strong style=\"\">Examples</strong> of Entrepreneurs and Companies that Outsource Using the Same Tactics</li>  </ul>  <hr style=\"\">  <p>  \t                            With <strong style=\"\">38 lectures</strong> and <strong style=\"\">4 hours of content</strong>, this course contains everything you need to know to remove your to-do list of tasks, gain freedom in your business and scale your business with the right team in place.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">The course is broken down into 6 main objectives:</strong>  </p>  <ol style=\"\">  \t<li><em style=\"\">Determine the Right Tasks to Start Outsourcing</em><br style=\"\">  \t                               When you&#039;re first getting started with hiring a virtual team to take over your tasks, there is an internal battle with tasks you want to hold onto because you feel that no one can do better at them than you. Determine what tasks to outsource is a very important step in this process.</li>  \t<li><em style=\"\">Find What Your Time Is Worth</em><br style=\"\">  \t                               Once you can determine what your time is actually worth, you will know what you&#039;re willing to pay for your team members. The last things you want to do is not get a strong return on your virtual assistant investment.</li>  \t<li><em style=\"\">Create a Top 10 List</em><br style=\"\">  \t                                 Your Top 10 List will give you initial outline for outsourcing you&#039;re entire business. We will start small with the most important tasks and then grow this list to continue removing tasks from your day.</li>  \t<li><em style=\"\">Hire the Right Virtual Assistant or Virtual Team on the First Try</em><br style=\"\">  \t                               Learn how to go through the entire hiring process from beginning to end with your virtual assistant. Gain access to valuable templates and strategies that you can use to make the process more efficient. </li>  \t<li><em style=\"\">Train Your Virtual Team with Proper Documentation</em><br style=\"\">  \t                               Giving somebody a bunch of tasks to do usually ends up with that person coming back every couple of hours asking for help or asking for more tasks. Setting up a system that keeps them busy and removes you from the equation is what we&#039;re going to have you achieve.</li>  \t<li><em style=\"\">Grow Your Business and Gain Freedom</em><br style=\"\">  \t                               The ultimate goal of this course is to allow you the freedom to <u style=\"\">focus on the things that REALLY matter</u> in your life and in your business. If you&#039;re free to a long to-do list of tasks, what would you do? Answering your WHY will help you stay determined to hire a virtual team and gain freedom.</li>  </ol>  <hr style=\"\">  <p>  \t                            Students completing this course will learn the steps to outsource their life and business to a virtual team and scale their business.  </p>  <p>  \t                            By taking this course, you&#039;re taking action on the most valuable thing in life...<strong style=\"\">YOUR TIME</strong>. It&#039;s the one thing you can&#039;t get more of no matter how many resources you have. Our time is limited but now you have the opportunity to remove tasks from your life and spend quality time on the important things.  </p>", 
    "end_date": null, 
    "title": "Outsource Your Life and Business ", 
    "price": "20.00", 
    "instructors": "John Price", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/104124_27f3_15.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-outsource/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-10T13:31:00Z"
}