{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The Outsourcing Pros and Cons and How to Make Massive Profits course is designed to teach new and veteran entrepreneurs to outsource successfully and profitably.  There is a lot of information out there and a lot of courses that teach outsourcing, but none that give you the strategic business view that is <strong>necessary</strong> for making money with outsourcing.</p><p>In this course you'll learn the top 3 myths about outsourcing that 95% of people fall for, costing them tons of money. I teach you not only how to avoid those traps, but to how to use them to your advantage.</p><p>You'll discover the necessary mindset shifts that you can use to outsource from anywhere around the globe and make a lot of money doing it. Plus I give you the tools and templates to get started right away to find and hire your first person, form a business model around your outsourcer, and I show you the exact secret document that I use for all of my workers that makes training a breeze.</p><p>I've been working with people domestically and overseas for over 6 years now, and I have workers that have been with me for over 4 years that still move my business forward.  The best part is that because of the information that I share in the Outsourcing Pros and Cons and How to Make Massive Profits Course is information that I actually use on a daily basis, you can rest assured that if you implement the information from this course you will see a drastic impact on the profits of your business.</p><p>Whether you are new to outsourcing or experienced, the 2+ hours of video, audio, and templates, I am confident you will see that the Outsourcing Pros and Cons and How to Make Massive Profits courses is an amazing tool to have in your business arsenal.  I am excited to have you in this course and I look forward to your success story!</p>", 
    "end_date": null, 
    "title": "Outsourcing Pros and Cons and How to Make Massive Profits", 
    "price": "50.00", 
    "instructors": "Dean Soto", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642378_2695_3.jpg", 
    "course_url": "https://www.udemy.com/outsourcing-pros-and-cons-and-how-to-make-massive-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T12:39:13Z"
}