{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Join the thousands of people making a great income online by sharing what they already know!</strong></p><p>As a business owner or entrepreneur, you already have years &amp; years of experience that you can share online and create a passive income stream.<br></p><p>Imagine making an extra $500 a month just from a simple ebook. Imagine making $1000 a month or even $5000 a month or more. These are not simply made up numbers. </p><p>With a proven plan, you can make a great additional (or even full-time) income online based on what you already know! It's just a matter of packaging up your knowledge &amp; expertise and selling it online to people interested in your message. </p><p>This course will teach you everything you need to know to create passive income online. You'll learn:</p><p>-the income potential for earning online</p><p><span></span><strong>-the two main factors that will make or break you with online passive income</strong></p><p><strong></strong>-how to decide what kind of product is right for you</p><p><span></span><strong>-how to come up with profitable product ideas from the start</strong></p><p><strong></strong>-how to create your digital products</p><p><span></span><strong>-how to set up shop online &amp; take payment</strong></p><p><strong></strong>-key pricing strategies to make the most money with the smallest effort</p><p><span></span><strong>-advanced strategies that the big internet marketers use to literally make millions of dollars</strong></p><p><strong>This Course is Perfect For...</strong></p><p>Any business owner or entrepreneur who wants to take their knowledge, put it up online, and enjoy a new stream of income.</p><p>Specifically, this course is for:</p><p>-Financial Services Professionals - accountants, insurance agents, bookkeepers</p><p><span></span>-Home Services Professionals - realtors, interior decorators, contractors, painters, roofers</p><p><span></span>-Medical Professionals - doctors, chiropractors, dentists, pharmacists, acupuncturists</p><p><span></span>-Photographers</p><p><span></span>-Health &amp; Beauty Professionals - hair salon owners/stylists, estheticians, personal trainers</p><p><span></span>-Business Professionals: sales people, marketing, business coaches</p><p><span></span>-Pretty much anyone who has years of expertise and experience in a given field is qualified to create an income online.</p><p>By taking this course, you'll find the answers to questions like: </p><p>How do I make passive income online? </p><p>What are passive income streams? </p><p>How can I create digital products? </p><p>Where can I sell my products online? </p><p>How do I price my ebooks, ecourses, or video courses?</p><p>What is a membership site? </p><p><em>And much more! </em></p><p>Be sure to hit the<strong> Take This Course </strong>button today!</p><p><strong>::</strong></p>", 
    "end_date": null, 
    "title": "Passive Income - Create Digital Products For Online Profit", 
    "price": 0, 
    "instructors": "Sean Marshall", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446692_6d62_3.jpg", 
    "course_url": "https://www.udemy.com/passive-income-create-digital-products-for-online-profit-videos/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T17:37:18Z"
}