{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong>\"Find The Job You Love And You Will Never Work Again\" </strong></em></p>\n\n<p>If you are interested in starting a business online using an interest, hobby and passion, then this is the course for you. It will show you step by step how to find multiple business ideas within the activities you already take everyday in your life. Your passions are what you naturally turn to each day as this is where you are happiest and most fulfilled. This course will show you how you can begin your journey now by using your biggest asset to help people to earn money online in just 6 steps.</p>\n\n\n\n<p>Inside the course, we go through each step together as we begin to learn that all of us have the ability and choice to live our lives on our terms. <em>This is not a get rich quick scheme.</em> It is a high quality course that first shows you strategically that it is possible for you. It does not matter what your passions are, when this course is applied, we will find multiple business opportunities for you to get started immediately. It will show you how your dreams can be broken down into achievable steps so you can see them go from impossible, to possible. </p>\n\n\n\n<p>Unlike a traditional business, you will not be required to invest a huge amount of upfront capital. The only small cost involved is for your own domain name and hosting as you start your own blog to share your passion to the world.</p>\n\n\n\n<p>Although, nothing in this course can guarantee your success, your earnings and decision making are your responsibility but once the course is completed and fully applied, you will have the skills and knowledge required to start your own personal brand and the ability to build your own fully automated sales funnel. </p><p><br></p>", 
    "end_date": null, 
    "title": "Passion To Profit: 6 Steps To Making Money Online", 
    "price": 0, 
    "instructors": "Kevin Blackburn", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/856610_c943_2.jpg", 
    "course_url": "https://www.udemy.com/passion-to-profit-6-steps-to-making-money-online/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-22T15:13:02Z"
}