{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>On this course you will Learn how to use Periscope for Business and with over 12 hours of hands-on training and strategies this course is one of the most comprehensive courses on Periscope.</strong></p><p>Welcome to <strong>Periscope 101 Profits: Business Strategies Pro</strong> <strong>Course </strong>which will help you grow your business using Twitter's great new live video streaming video service - Periscope.</p><p><strong>No Power Points, no slides! This is all hands-on Action! </strong></p><p><strong>Learn How To use Periscope for Business to Maximize Your Profits.</strong></p><p><em>Who else wants to know... How To use Periscope to help build your brand and following and help you maximize your profits?</em></p><p><em></em>Periscope is the fastest growing Social Media Platform in a long time and its leveraging live video to help you connect to your audience in a way you've never been able to do before.</p><p>In this course we will help get you started with Periscope and give you all the best tips on how to leverage this platform to its<strong> MAX!</strong></p><p><strong>This course is all hands-on examples shared straight from Periscope - this is NOT a Power Point theory course!!</strong></p><p>As Periscope evolved over the next 6, 12. 18 months the course will evolve with it, with modules changing, vanishing and new ones added. </p><p>So its going to evolve into a massive recourse of all the latest and most update information on Periscope and using it for business that exists.</p><p><strong><em>We will also include our archive or training live scopes as that evolves - so masses of content!</em></strong></p><p>If you're looking to improve your lifestyle, if you want to improve your business, if you want to make a better life for your family, <em>this course is definitely for you.</em></p><p>Simply listen to the secrets of how ordinary people became successful in this exciting fact filled course.</p><p>No shortcuts, no \"get rich quick\" scams, no nonsense.</p><p>Just simple, proven steps to wealth and success, easily, quickly and simply.</p><p><em>Give yourself a fresh start by enrolling in this life-changing course now.</em></p><p><em>Every moment you delay, you lose out. Simple as that.</em></p><p>We will be adding lots more new and up-to-date modules to this course as time goes by, new modules, new techniques, new strategies <em><strong>AND </strong></em>the good news is, all the ongoing updates to this course are <strong>FREE</strong>, always, for ever. So whatever you pay for this course <strong>TODAY</strong>, you won't pay a penny more for all the great value we will add over time.</p><p><em><strong>And there's a 30 day absolutely no questions asked full money back guarantee - my personal promise of your happiness and satisfaction! You really have nothing to lose and everything to Gain!</strong></em></p>", 
    "end_date": null, 
    "title": "Periscope 101 Profits: Business Strategies Pro Course", 
    "price": "50.00", 
    "instructors": "The Covert Formula", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592616_1b7d.jpg", 
    "course_url": "https://www.udemy.com/periscope-101-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T08:13:58Z"
}