{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you have been broadcasting in the live streaming app, Periscope, and are ready to amp up your use of the channel for sharing content and growing your following, you have found the right course. In this course, featured in the Udemy blog, experienced social media strategist, author, and online course creator, Vickie Maris, shares her experiences from 8 months of using the channel to better connect with her followers and to grow her email list. Talking direct to the camera in the course videos, she shares insights from her experience of scoping at least once a day and often several times a day. During the week, she provides tips for online course designers and Periscopers. On the weekend, she scopes from her farm - often with her llamas, rabbits or pony on the scopes. </p>\n\n<p>You will want to have a few scopes under you belt before you take this course. This isn't a step-by-step walk through the process of downloading the app and tweaking the settings for getting started. But if you're ready for over 20 videos (approximately 1 hour of content) full of tips, tools and techniques for improving the quality of your broadcasts with the goals of increasing your following and growing your email list, you've found the right course!</p>\n\n<p>Join the over 1000 students who have already chosen to take one of Vickie's courses.</p>", 
    "end_date": null, 
    "title": "Periscope: How to Improve Your Scopes and Grow Followers", 
    "price": "30.00", 
    "instructors": "Vickie Maris", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/768146_1ae5_2.jpg", 
    "course_url": "https://www.udemy.com/periscope102/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-19T22:43:57Z"
}