{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><br><em></em></p><p><em>- Have you been thinking lately how to build a powerful personal brand?</em></p><p><em>- Do you want to take control of your online presence and create a memorable brand of you? </em></p><p>===================================================================<br></p><p>In the past few years personal branding has been discussed exhaustively \nthroughout the web. The difference between today's personal branding and over ten years ago \nwhen it was first mentioned by Tom Peters, is the rise of social \ntechnologies that have made branding not only more personal, but within \nreach.</p><p>However, in today’s marketplace, it’s tough to stand out. Here the personal branding comes...</p><p>Your brand is your reputation. It’s your calling card.  </p><p><span></span></p><p><strong>Your Brand </strong><strong>Will Differentiate\nYou and Will Allow You To Compete in the Global Marketplace.</strong><strong></strong></p><p><br></p><p>It’s what you’re known for and how people experience you. It’s about bringing <em>who you are</em> to <em>what you do</em> and<em> how you do it</em>. Delivering your brand clearly and consistently will create a memorable experience in the minds of those you interact with and can open doors to new opportunities.</p><p>================================================================<br></p><p>So, why to wait? Hit the <strong>START LEARNING NOW</strong> button and let's get started...</p><p><br></p><p><span></span></p>", 
    "end_date": null, 
    "title": "Personal Branding: Build an Awesome Personal Brand", 
    "price": "20.00", 
    "instructors": "iMarketer Training", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678546_497f_2.jpg", 
    "course_url": "https://www.udemy.com/personal-branding-101-build-an-awesome-personal-brand/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T19:45:20Z"
}