{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Personal Effectiveness  is not something you're born with, and people aren't naturally winners or losers. Effectiveness and success are developed through habits, mindsets and tools - and this is what we'll develop in this course.</p><p><strong><br></strong></p><p><strong>Would you like to see exponential success in your personal and business life? Then Personal Effectiveness Blueprint training is for you.</strong></p><p><br></p><p><strong>Course Description:</strong></p><p>Chris Mower is a successful serial entrepreneur, and has established several highly profitable businesses. Now he is passing on his top 17 Personal Effectiveness Life Tips to cultivate success across all areas of life. Ranging from quick fixes, to significant lifestyle changes, this course covers every aspect of your life and career. Many of these tips can be applied to family/personal life as well as rocketing your business and career growth, so truly will embed the Personal Effectiveness potential in you.</p><p><br></p><p>Whether you're an entrepreneur or employee there are ideas in here that will change your life. This course is suitable for all ages and all levels of the career ladder - you're never too old or young to learn fantastic sales, management, and people skills. <strong>If your life is not how you always dreamed, now is the time to develop your Personal Effectiveness.</strong></p><p><strong><br></strong></p><p>Creating this course took a lifetime of learning. Chris has read hundreds of books and interviewed some of the greatest business minds in the country. All of that has been combined and distilled into 17 core lifestyle changes that will build your path to success. </p><p><br></p><p><strong>The Personal Effectiveness Blueprint Overview:</strong></p><ul><li>Be memorable and popular at networking events</li><li>Dramatically increase your sales closing rate</li><li>Tune out negativity and become a positive thinker</li><li>How your closest network of people determines your income</li><li>Making a great first impression</li><li>Identifying the common denominator of success</li><li>Adapting your leadership style to suit any employee</li><li>Finding your point of excellence to put you ahead of the pack</li></ul><p><br></p><p>This course also comes with a 100% Money Back Guarantee.<br></p><p><br></p><p>Take this unique home-study course at your own pace and gain clarity, and confidence in areas ranging from sales, management, people skills and more.  </p><p>There's no time like the present to start building a life of success. Join the Personal Effectiveness Blueprint today.</p>", 
    "end_date": null, 
    "title": "Personal Effectiveness Blueprint: 17 Life-Changing Lessons", 
    "price": "20.00", 
    "instructors": "Chris Mower, Louise Croft", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613826_78ee_3.jpg", 
    "course_url": "https://www.udemy.com/success-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T15:26:34Z"
}