{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>*** First version of this course published end of March 2016***<br></p><p>If you are PASSIONATE ABOUT PHOTOGRAPHY (amateur or professional) and are wondering how you could MAKE MONEY ONLINE from this passion, then this course is just the right one for you. However, although I will be giving a few tips that I believe could increase your chances of selling via Stock Photography, this is NOT the focus we will be taking throughout this course. Instead, we will be looking into CREATIVE WAYS, that may appear less obvious at first, of earning a living out of Photography. These will include platforms such as FACEBOOK, WEBSITES, INSTAGRAM and much more… </p><p>To create this course, I have combined my interest for photography, the high number of examples I have gathered over time as well as my knowledge about Making Money Online - since I write blogs in both French and German on the subject. Personally, I am only an amateur when it comes to Photography, yet I myself have sold a couple of pictures online already. </p><p>Since I have now many ideas of how you could make a living out of Photography, I've decided to create this course! And if you had a hard time finding a project idea that may work, just get in touch via the Udemy Communication tools - I'll be happy to brainstorm for you!</p><p>Be careful though! This course IS NOT A GET-RICH-QUICK scheme! There is no such thing as becoming a millionaire overnight… Except maybe for a few exceptions (of which winning at the lottery!). You will need to be patient, passionate, determined and stay motivated to make it! Of course, you could try your project idea out on the side, do not expect to earn high returns after just a few weeks...<br></p><p>Of course, we will look into plenty of examples to illustrate the concepts throughout the course. This way you should stay motivated all along! These also intend to show you what works and to help you understand the main patterns behind the Online Business world, but for Photography.</p><p>All the ideas presented could also work for other passions you may have, even the the examples may not be tailored to these. </p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Photography: Start an Online Business with your Photography", 
    "price": "20.00", 
    "instructors": "Anja Altberger", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/782950_9566_3.jpg", 
    "course_url": "https://www.udemy.com/photography-make-money-online-in-creative-ways/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-05T09:35:09Z"
}