{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Non capita tutti i giorni di avere l'opportunità di presentare la propria idea davanti ad un investitore. </strong>E nonostante spesso durante le primissime fasi di vita di una startup i fondatori riescano ad autofinanziarsi, ovvero a partire bootstrap, <strong>la raccolta di capitali è spesso un passo fondamentale e necessario per accelerare la crescita dai primi prototipi al grande mercato. In questi casi, è quindi fondamentale essere preparati ad esporre una presentazione, in gergo un \"pitch\", efficace e coinvolgente, che colga l'attenzione degli investitori.</strong></p><p><strong><br></strong></p><p>Un buon pitch si compone però di diversi elementi:</p><p><strong>- Aspetti grafici - come predisporre la slide;</strong></p><p><strong>- Aspetti contenutistici - quali concetti toccare;</strong></p><p><strong>- Aspetti di presentazione - come esporre tali concetti.</strong></p><p><strong><br></strong></p><p>In questo corso andremo quindi a toccare, mano a mano, <strong>tutti gli elementi fondamentali a creare una presentazione efficace per un investitore. </strong>Ed andremo a farlo attraverso<strong> l'esempio concreto di una startup italiana che attraverso tale impostazione ha convinto alcuni tra i suoi primi finanziatori. </strong></p><hr><p><strong>Perché Lacerba?</strong></p><p>Vero, ci sono centinaia di corsi online su come strutturare un pitch . <strong>Questo corso è diverso perché:</strong></p><ul><li><strong>è tenuto da startupper</strong>, che ci sono passati, conoscono bene i primi ostacoli e applicano queste tecniche tutti i giorni, non da professori e/o consulenti</li><li><strong>è incentrato sul mercato italiano</strong>, è in lingua italiana e racconta casi di StartUp italiane</li><li>è il primo passo per formare una <strong>community interattiva di startupper</strong>, per supportarci a vicenda e crescere assieme</li></ul><hr><p><strong>Cosa imparerai in questo corso?</strong></p><p><strong>A strutturare, scrivere, disegnare ed esporre una presentazione efficace. Un pitch efficace.</strong></p><p>Di seguito i contenuti dettagliati del corso:</p><ul><li>Distinguere le presentazioni per scopo</li><li>Cos'è e come si struttura un Elevator Pitch</li><li>Come trovare un template accattivante e come modificarlo su Microsoft Power Point</li><li>Dove e come scaricare il vostro font preferito</li><li>Quali stili di presentazione famosi possano farvi da ispirazione</li><li>Lo schema di una presentazione efficace</li><li>Slide per slide, come strutturare ogni singola slide dai punti di vista:<ul><li>Grafico</li><li>Contenutistico</li><li>Espositivo</li></ul></li></ul><ul><li>Quali errori evitare per non perdere l'attenzione dell'investitore</li></ul><hr><p><strong>Quanto tempo ci vorrà per terminare il corso?</strong><br></p><p>In totale i video durano circa <strong>due ore</strong>. 10 minuti al giorno per due settimane sono più che sufficienti per seguire le lezioni, ma attento! Dovrai ritagliarti il giusto tempo anche per mettere in pratica gli insegnamenti e scrivere il tuo elevato pitch e la tua presentazione, uscendo di casa e facendo esperimenti su potenziali interlocutori.</p><hr><p><strong>Che aspetti dunque? Struttura il tuo pitch e convinci l'investitore!</strong></p>", 
    "end_date": null, 
    "title": "Pitching - Crea la presentazione perfetta", 
    "price": "35.00", 
    "instructors": "Michele Di Blasio", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678000_b9f4_3.jpg", 
    "course_url": "https://www.udemy.com/pitching-lacerba/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T08:28:46Z"
}