{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t    Running your own private practice can be very rewarding if you value the freedom and independence that come from working for yourself. You get to work with more of your ideal clients.\r\n</p>\r\n<p>\r\n\t    The downside of running your own private practice includes periods of uncertainty, especially when you are starting out. It takes a while to learn to go with the flow and to trust the big picture. There are also feelings of discomfort in having to push the boundaries in doing things you may never have done before, such as speaking to others about what you do and managing the money issues.\r\n</p>\r\n<p>\r\n\t    Running your own private practice gives you the freedom to work in areas in which you have a passion, to be innovative and entrepreneurial if you wish, to avoid office politics, and to be properly rewarded for what you do.\r\n</p>\r\n<p>\r\n\t    Whether you are a counsellor, psychologist, psychotherapist, hypnotherapist, social worker, occupational therapist, naturopath, or other self-employed service provider, this course programme will help you to avoid the pitfalls that lead approximately 10%%%% of small businesses to fail each year and a significantly higher proportion to struggle financially.\r\n</p>\r\n<p>\r\n\t    This course contains 10 individual sessions, outlining the most common pitfalls and what you can do about avoiding them. You will get some great insights while starting to recognise how you can be more effective in sourcing new clients when building your private practice.\r\n</p>", 
    "end_date": null, 
    "title": "Pitfalls of Private Practice", 
    "price": "40.00", 
    "instructors": "Wolf Matejek", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/124020_8ab0_5.jpg", 
    "course_url": "https://www.udemy.com/pitfalls-of-private-practice/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-22T16:44:20Z"
}