{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      This course will turn your expensive hobby to a viable and profitable business while maintaining your <em>sanity</em>. This course will answer the two most basic and fundamental concerns that Ladypreneurs face; customers and revenue.  </p>  <p>  \t<strong>Learn to <em>monetize</em> your passions by putting your business in a anguage that causes your customers/clients to actually seek you out!</strong>  </p>  <p>  \t      Articulate a business model to monetize your effort  </p>  <p>  \t      Focus on fundamental business steps to generate profit  </p>  <p>  \t      Simplify language that allows Ladypreneurs to immediately apply course content  </p>  <p>  \t      Avoid becoming a &quot;desperate saleswoman&quot; in the eyes of your customers/clients  </p>  <p>  \t<strong>Immediately infuse your business and prime it for immediate revenue generation</strong>  </p>  <p>  \t      Starting a business from a passion can be overwhelming and daunting. To compound this difficult undertaking many Ladypreneurs are wearing multiple hats personally and professionally. You are moms, girlfriends, wives, employees, and heads of households that are also tasked to be owners, accountants, secretaries, web designers, promoters, saleswomen, etc.... within their business as well. Positioning For Profit was built for the Ladyprenuer to address the specific set of circumstances that female entrepreneurs face when looking to profit from their passions.  </p>  <p>  \t      This is a perfect opportunity for the Ladypreneur that is:  </p>  <ul>  \t<li>Having a hard time monetizing their product or service.</li>  \t<li>Having a hard time expanding your network leaving you stuck battling with friends, family, co-workers, etc... to grow and expand your business</li>  \t<li>Having a hard time finding the time to actually provide your product or service, while spending more time being a saleswoman and marketing.</li>  \t<li>Having a hard time making yourself available to a larger audience.</li>  </ul>  <p>  \t      Content and Overview  </p>  <p>  \t      Positioning For Profit is for the Ladypreneur that has either already started their respective business or the Ladypreneur that is prepared to launch looking for guidance. This course combines practical business practices with the concepts of Education Based Marketing specifically tailored to the circumstances of today&#039;s female entrepreneur.  </p>  <p>  \t      There are 6 modules that are best suited to be accessed weekly but in respect to the individual Ladypreneur can be taken at your own pace. The sections cover topics on today&#039;s business climate for the Ladypreneur as well as defining and forecasting where business is and is going in the near future. What&#039;s really innovative about this course is that is practical. Meaning that the language is conversational which opens the content up to Ladypreneurs of all business backgrounds and demographics who are ready to focus efforts in order to start reaching business goals and expectations. Also the course is made to scale so whether you&#039;re a Ladypreneur looking to quit your job and go all in or if your just looking to supplement your current income this course can assist your in reaching your objectives.  </p>  <p>  \t      Sections include engaging video lectures and downloadable handouts (module supplements, summaries, recaps, and business flow charts) that allow the Ladypreneur to measure her progress in real time.  </p>", 
    "end_date": null, 
    "title": "Positioning For Profit For The Ladypreneur", 
    "price": "30.00", 
    "instructors": "Marcus Carter", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/330940_0a8b_4.jpg", 
    "course_url": "https://www.udemy.com/thegoalmentorp4p/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-29T20:16:39Z"
}