{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>PPC Ads - Google Adwords Facebook Ads &amp; Bing Ads Using PPC</strong></p><p><strong><br></strong></p><p><strong>Do You Need Website Traffic And You Need It NOW?</strong><br></p><p>How would you like to discover a super-simple way to drive low-cost traffic to your website? (from Google ads, Yahoo ads, Bing ads and Facebook ads)</p><p>With Pay Per Click (PPC) and online Paid Advertising networks, now you can!</p><p>Imagine having a paid advertising expert walking you through each step of:</p><ul><li>A walkthrough of the top online advertising networks and their best use</li><li>Setting up your ad campaigns on Google AdWords</li><li>Setting up your ad campaigns with Facebook ads</li><li>Setting up your ad campaigns with Yahoo ads &amp; Bing ads (Microsoft Ad Network)</li><li>Details of what you need to do on Google, Yahoo, Facebook and Bing, and why</li><li>How to write quality ads for your Pay Per Click (PPC) ad campaigns</li></ul><p>In this course, we'll take a \"tour\" of the top 9 paid ads networks, show you how to set up your Google AdWords PPC account and walk you through the basics of setting up online ad campaigns on the top 3 pay per click ad networks:</p><ul><li>Google AdWords</li><li>Facebook Ads Network and </li><li>Microsoft Ads Network (Yahoo ads / Bing ads) </li></ul><p>And, I will walk you through the process, step-by-step.</p><p>If you are new to online advertising, then this is the course for you...</p><p>Enroll today, and begin receiving website traffic immediately upon completing this course!<br></p><p>We will cover all the terminology you need to learn, as well as give you a practical demonstration of the top paid ads (PPC) / online ad networks.</p><p>Take a look at the free preview lectures below and get ready to drive as much traffic as you want to your website!</p><p>Your enrollment today is backed by Udemy's 30-day, money-back guarantee, so you risk nothing by trying it out!</p>", 
    "end_date": null, 
    "title": "PPC Ads - Google Adwords Facebook Ads & Bing Ads Using PPC", 
    "price": "25.00", 
    "instructors": "Dave Espino", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563156_6a50_2.jpg", 
    "course_url": "https://www.udemy.com/paid-ads-ppc-how-to-run-google-facebook-bing-ads/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T00:20:06Z"
}