{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">After the first 360 students. Price Will Start To Raise $3 Every 10 new students until we reach $97. </strong>  </p>  <p style=\"\">  \t    Dan Dasilva's Info Product Riches will take you by the hand in an in-depth course on how to launch a killer info product and create an amazing sales funnel as well as drive traffic to your product in order to clear 6 figures in a launch.  </p>  <p style=\"\">  \t    You will learn how to start from nothing but an idea and turn it into a product. What if you don't have any ideas? Well thats fine because Dan teaches you how to do thorough market research to see what will sell like 'hot cakes'.  </p>  <p style=\"\">  \t    Within the first few days you will need to learn and implement that tactiques used to setting up a sales funnel but once that 'learning curve' is over, its nothing but profits from there on out.  </p>  <p style=\"\">  \t    This course is broken down into sections and little mini lessons. You will need to follow each lesson step by step and make sure you take notes. The more you learn the more you will make.  </p>  <p style=\"\">  \t    This course is for you if you want to start and maintain a successful online business. Dan doesn't teach 'overnight' successes. Rather Dan teaches you how to create a REAL business and launch products for a long lasting sustainable income.  </p>", 
    "end_date": null, 
    "title": "Product Launching Guide: How to Create Information Products", 
    "price": "20.00", 
    "instructors": "Daniel Dasilva", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/324140_72e3_3.jpg", 
    "course_url": "https://www.udemy.com/product-launching-guide-how-to-create-information-products/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-21T13:54:10Z"
}