{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The Products to Sell from Home for Profit is the best course for new entrepreneurs that want to know the secrets to finding and creating product that you can sell from the comfort of your own home.  In this course<strong> I will condense over 6 years of online business experience</strong> into one amazing course designed to give you the edge in starting your online business.</p><p>With this course you will learn how to find product that you can buy cheap at garage sales, thrift stores, and retail stores and then sell them for massive profits on eBay, amazon, and more.  You'll learn how to take full advantage of these platforms and make some great money doing it.</p><p>eBay and amazon aren't your thing?  No problem!  you'll also learn how to create and launch your own information products!  If you want <strong>products to sell from home</strong> that require very little or no upfront cost, but can lead to large amounts of revenue, information products may be perfect for you.  You'll learn how to turn your hobby into sell-able information and also where to find hungry buyers that want to pay for that information.</p><p>You'll also get access to interviews with experts that our team conducted and hear from some of the best entrepreneurs that sell on Amazon, eBay, Udemy, and more.  The content in this course is always growing and as more students join and participate the more lectures I create. You'll always get the latest, greatest and best information in this course because I do this stuff for a living! </p><p>All-in-all this course is perfect for those that are looking for tons of ways to find products to sell from home.  It's not your typical business course.  It's <strong>proven information</strong> that my team and I use on a daily basis to make a living from.  I'm excited to have you as a student in the course and look forward to helping you reach your goals!</p>", 
    "end_date": null, 
    "title": "Products to Sell from Home for Profit", 
    "price": 0, 
    "instructors": "Dean Soto", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/643624_18ee_2.jpg", 
    "course_url": "https://www.udemy.com/products-to-sell-from-home-for-profit/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-18T00:06:41Z"
}