{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>When a new product idea (invention) enters our minds, we often feel both exhilaration and fear simultaneously. Our mind races wondering if our brilliant idea could be the next big thing and at the same time question what to do next!</p><p><strong style=\"\">You need immediate answers to questions like:</strong></p><li>Can I make money with this invention?</li><li> How do I protect my idea? Do I need a patent? What kind?</li><li> How do I fund my business?</li><li> How do I find a manufacturer?</li><li> How do I sell my product?</li><li> How do I get publicity?<br style=\"\"><br style=\"\"></li><p>Or…You may have been on this journey for a number of years already and are having trouble achieving your goals. You know you have a great idea; you've done tons of hard work, but have hit one road block after the next. You now realize that if you had some focused guidance you could get to market much faster than going it alone.</p><p><strong style=\"\">Here's How The Ultimate Product Launch System Will Help You:</strong></p><p>The fastest way to get your Invention idea to market is by following this proven crystal clear road map. <br style=\"\"><br style=\"\">And, if you dream of pitching your great idea to the television show Shark Tank, or seeing your product prominently displayed on shelves like Walmart, or selling on-air via Home Shopping networks, then you've come to the right place! <br style=\"\"><br style=\"\">My books and proven step-by-step system have been used by entrepreneurs like <strong style=\"\">Tiffany Krumins, inventor of Ava the Elephant</strong>, who was the first woman to receive funding on Shark Tank; <strong style=\"\">Ann Hurley, inventor of Luv-Chicken Booster Seats</strong>, landed her product on the shelves of Babies-R-Us across America; <strong style=\"\">Valarie Moody, founder of Fodeez</strong>, is successfully selling her product line to Walgreens nationwide; and <strong style=\"\">Kim Nimsgern, Founder of Click-n-Curl</strong>, is a regular guest on home shopping networks like ShopHQ and The Shopping Channel.</p><p><strong style=\"\">This is the ONLY complete and proven road-map of its kind!</strong> You will have access to the same tools, resources and information that my students have used to successfully land six figure purchase orders.<br style=\"\"></p><p>And, the best part... once you learn this system, you can use it again and again for future product ideas.</p><p>You have everything you need right here to jump in and get started.</p><p><em style=\"\">Be Unstoppable in Pursuit of Your Dreams!</em></p><p>Tamara<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Product Invention and Business Launch Guide for Beginners", 
    "price": "50.00", 
    "instructors": "Tamara Monosoff", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/451262_5c85_6.jpg", 
    "course_url": "https://www.udemy.com/product-invention-business-launch/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T14:25:50Z"
}