{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course, you will learn how to stop limiting your income to one-on-one coaching and consulting clients. Through the tools and techniques shared in these lessons, you'll learn how to develop multiple products, how to position your coaching business for maximum impact, and how to develop passive-income generating programs.<br><br></p><p>This course is taught through a combination of video lectures, written guides, workbooks, and checklists.</p><p>The course is broken down into 4 major sections:</p><p><em>Section One: Discover Your Winning Idea</em></p><p>Everyone has one. It's what your clients are begging you for, but since they don't always tell you in so many words, you might struggle to figure it out. In this section, we'll how to identify what your prospective clients are seeking, and how bets to position yourself to deliver it.</p><p><em>Section Two: Designing and Creating Your Program</em></p><p>Your signature program is going to be the thing you become known for, but it doesn't have to take weeks or months to create.</p><p><em>Section Three: The Short and Sweet Product Launch</em></p><p>A simple, tasteful and timely launch will go far toward solidifying your brand and your signature product.</p><p><em>Section Four: How to Generate Passive, Non-Coaching Income</em></p><p>How to take what you are already doing in your business and created automated tools and programs to make you more money and give you more time.</p>", 
    "end_date": null, 
    "title": "Profitable Passive Income Products for Coaches", 
    "price": "50.00", 
    "instructors": "David Baer", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659382_b9fa.jpg", 
    "course_url": "https://www.udemy.com/profitable-passive-income-products-for-coaches/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T21:25:10Z"
}