{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Turn your written assets into a course and make money while you sleep</strong></p><p><em>You've written and published a book, and you want to share your message with a wider audience.</em> <br></p><p><strong>Having a book is one of THE best statements you can possibly make about your expertise and your knowledge. Sharing it in a course means that more people get to know you and learn from you, whilst you make money doing what you love. </strong></p>  <p>\t You already have expertise and experience, a story to tell, some how-to knowledge and most importantly a book or almost book.</p>  <p>\t<em><strong>All you need to do now is to learn how to turn it into a course. </strong></em>  </p>  <p>\t<strong>How Can I Help?</strong>  </p>  <p>\t I have put this programme together to teach you a step-by-step process that helps you turn your book into a course that will help you to a) make money b) raise your brand c) give you an additional asset to use alongside your book</p>  <p>\t<strong>The Right Foundation</strong>  </p>  <p>\t I start by helping you to re look at the outline for your book. Then we look at which content can be turned into lectures. With a strong outline as a foundation, you are ready to create your course.</p>  <p>\t<strong>Linking book to your course</strong>  </p>  <p>\t Next I will show you how to turn your content into a course that will engage your ideal customer.</p>  <p>\t<strong>Course Structure</strong>  </p>  <p>\t The <strong>Turn your book into a profitable course</strong> programme comes with videos and downloadable worksheets or spreadsheets to guide you through exactly what you need to do.</p>  <p>\t<strong>Your Commitment</strong>  </p>  <p>\t You can do this really quickly. Put aside some time every day for two to four weeks (you might even be able to do it over a few weekends) and you will get your course finished. I recommend that you watch each section, do the work and create your course as you go along.</p>  <p>\t<strong><em>Make this the month you expand your books reach, with a course.</em></strong>  </p>  <p>\t<em><strong>Where you are now? </strong></em>  </p>  <p>\t<em> You may have your book written and ready to go </em>  </p>  <p>\t<em> You may be writing your book and planning ahead or you may only be at outline stage. </em>  </p>  <p>\t<em><em>What matters is that you have a book that you want to share to a wider audience and make money. </em></em>  </p>  <p>\t<em> My question is - do you want to learn <strong>how to turn your book (or almost book) into a course</strong>? </em>  </p>  <p>\t<em> Yes? Great you are in the right place. Enroll now and let's get that book off the bookshelf and available to a wider audience. </em>  </p>", 
    "end_date": null, 
    "title": "Profit from your knowledge. Turn your book into a course.", 
    "price": "25.00", 
    "instructors": "Jacqui Malpass", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398902_1d2c_3.jpg", 
    "course_url": "https://www.udemy.com/profit-from-your-knowledge-turn-your-book-into-a-course/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T06:58:40Z"
}