{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          Si eres emprendedor este curso <strong style=\"\">va a cambiar tu vida</strong>.  </p>  <p>  \t<strong style=\"\">Ahórrate meses</strong> de frustraciones inútiles construyendo productos o servicios que nadie quiere.  </p>  <p>  \t          En este Programa de Lanzamiento de tu Negocio aprenderás de manera <strong style=\"\">práctica</strong> los pasos que tienes que dar para poner en marcha tu idea de negocio en 12 semanas usando <strong style=\"\">enfoques Lean Startup</strong>. Estos enfoque se basan en la metodología de Desarrollo de Clientes del profesor Steve Blank  y Bob Dorf de la Universidad de Stanford, usado por miles de <strong style=\"\">emprendedores de éxito</strong> alrededor del mundo como Dropbox, Airbnb o Instagram.  </p>  <p>  \t          Te permitirá estar literalmente como en una <strong style=\"\">pre-aceleradora </strong>de startups desde la comodidad de tu casa. Aprendiendo y practicando los procesos, herramientas y habilidades que <strong style=\"\">están cambiando el mundo</strong> de los negocios.  </p>  <p>  \t          Seguramente te has hecho como emprendedor alguna vez estas <strong style=\"\">preguntas:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">¿cómo puedo llevar a la <strong style=\"\">práctica</strong> mi idea?</li>  \t<li style=\"\">¿cómo puedo saber si mi idea es un <strong style=\"\">buen negocio</strong>?</li>  \t<li style=\"\">¿cómo puedo <strong style=\"\">testear</strong> mi solución sin gastarme mucho dinero?</li>  \t<li style=\"\">¿cómo puedo encontrar a mis <strong style=\"\">primeros clientes</strong>?</li>  </ul>  <p>  \t          Si es así, debes que empezar a aplicar <strong style=\"\">Lean Startup</strong>.  </p>  <p>  \t          ¿Pero en que se basa <strong style=\"\">Lean Startup</strong>?  </p>  <p>  \t          En tres principios:  </p>  <ol style=\"\">  \t<li style=\"\">Diseño del <strong style=\"\">Modelo de Negocio</strong>.</li>  \t<li style=\"\">Aplicación del proceso de <strong style=\"\">Desarrollo de Clientes</strong>.</li>  \t<li style=\"\">Desarrollo del producto o servicios usando el proceso de <strong style=\"\">Desarrollo Ágil</strong>.</li>  </ol>  <p>  \t          El curso empezará con una introducción a la filosofía y el enfoque que durante 12 semanas tendrás que llevar para realizar la <strong style=\"\">búsqueda de tu modelo de negocio</strong>.  </p>  <ul style=\"\">  \t<li style=\"\">En el primer bloque de semanas (la primera y la segunda), aprenderás la filosofía del enfoque Lean Startup y al <strong style=\"\">diseño de modelos de negocio</strong>.</li>  \t<li style=\"\">En el segundo bloque de semana (de a tercera a la décimo primera) aprenderás a aplicar Desarrollo de Cliente en las fases del <strong style=\"\">encaje problema-solución</strong>: Descubrimiento de Cliente y <strong style=\"\">encaje producto-mercado</strong>: Validación de Cliente.</li>  \t<li style=\"\">En el ultimo bloque de semanas (de la décimo segunda a la décimo quinta) a la aprenderás a usar enfoque <strong style=\"\">ágiles</strong> para el <strong style=\"\">desarrollo de tu producto o servicios</strong> así como una serie de herramientas y consejos prácticos.</li>  </ul>  <p>  \t          Este Programa de Lanzamiento de tu Negocio pretende literalmente ayudarte a <strong style=\"\">lanzar tu negocio durante 12 semanas</strong> basándonos en tres ejes claves:  </p>  <ol style=\"\">  \t<li style=\"\">Una startup es una <strong style=\"\">organización temporal</strong> diseñada para la <strong style=\"\">búsqueda de un modelo de negocio</strong> escalable y repetible en un espacio del alta incertidumbre donde los emprendedores asumen que su modelo esta basado en una serie de supuestos e hipótesis.</li>  \t<li style=\"\">Que la única manera de validar y testear estas hipótesis es <strong style=\"\">saliendo a la calle</strong>, experimentando y prototipando con clientes, canales o socios claves reales para obtener el feedback lo antes posible siguiendo <strong style=\"\">de manera ordenada el proceso de Desarrollo de Cliente</strong>.</li>  \t<li style=\"\">Que la mejor manera de entregar un valor real al cliente es <strong style=\"\">trabajar de manera iterativa en la mejora de los prototipos </strong>con el feedback del cliente en periodos muy cortos de tiempo, en ocasiones semanas, días u horas.</li>  </ol>  <p>  \t          Esto es lo que pretende este Programa de Lanzamiento de tu Negocio, que puedas <strong style=\"\">vivir en primera persona</strong> lo que verías en una pre-aceleradora, escuela de negocio o programa de emprendedores pero en la comodidad de ir a tu ritmo.  El objetivo es que pueda experimentar este increíble proceso que <strong style=\"\">tantos negocios de éxito está creando</strong> en todo el mundo y que te ayudará a ti también a <strong style=\"\">convertir tu idea en un gran negocio</strong>.  </p>  <p>  \t          Bienvenido.  </p>", 
    "end_date": null, 
    "title": "Programa de Lanzamiento de tu Startup", 
    "price": "50.00", 
    "instructors": "Nestor Guerra, Consuelo Verdu", 
    "commitment": "33.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33577_4511_11.jpg", 
    "course_url": "https://www.udemy.com/programa-de-lanzamiento-de-tu-startup/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-25T19:20:01Z"
}