{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Starting in 2004, Yelp has earned its way to the top dog among review websites. </p><p style=\"\">Originally designed so customers could find and review restaurants, Yelp quick expanded across the United States and now in every country around the world. </p><p style=\"\">It was recently reported that there are more than 130 million Yelp users per month (and growing) with 80 million users accessing the Yelp app via mobile devices. </p><p style=\"\">In this course, we'll explore:</p> <ul style=\"\"><li style=\"\">How Yelp works to promote your business and earn you more sales and more customers.</li><li style=\"\">How you can use Yelp to earn better search engine rankings in Google and other search engines.</li><li style=\"\">How to get your business ranked higher within Yelp's own search engine.</li><li style=\"\">How the Yelp review system works (and why some reviews aren't published).</li><li style=\"\">How to use Yelp tools to create special sales offers to customers.</li></ul> <p style=\"\">There are dozens upon dozens of online review; business listings and mapping websites, including Google+ Local (formerly called Google Maps or Google Places); Bing Local; Manta; City Search and many others.</p><p style=\"\">While many small business owners don't have the time to create and manage multiple accounts and websites, they should create and manage their profiles in Yelp. </p><p style=\"\">Consistently, Yelp is ranked in the Top 10 in Google search results on many local keywords. By participating in Yelp, you give your business the opportunity to be ranked higher and earn more customers and more sales. </p>", 
    "end_date": null, 
    "title": "Promote Your Business and Earn More Sales By Mastering Yelp", 
    "price": "20.00", 
    "instructors": "Steve Phillips", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600668_b0ac.jpg", 
    "course_url": "https://www.udemy.com/mastering-yelp/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T18:12:24Z"
}