{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Investors like to say that, if given the choice, they make bets on jockeys instead of horses. Translated, this means they put more faith in the <strong>TEAM</strong> over the <strong>IDEA</strong>. With this in mind, every entrepreneur's goal should be to frame their backgrounds and achievements in a way that captures investor attention <strong>compelling</strong> them to invest. Good products or good businesses wont' sell themselves! In this course, Nestor will go in depth on how to effectively <strong>CRAFT</strong> a persona that investor's will feel comfortable backing. This will include creating a <strong>NOTEWORTHY</strong> online profile via leveraging a variety of tools including <strong>LinkedIn</strong>, <strong>Google</strong> and <strong>Twitter</strong> just to name a few. Nestor will also teach how to maximize the effectiveness of your email signatures, business cards and headshots.</p><p>------------------------------------------------------------------------------------------------------------------------------------------------<br></p><p><strong>What will I get out of the course?</strong><br></p><ul><li>Over 19 lectures and 1 hours of audio and visual content. </li> <li>Firsthand experience from a professor and entrepreneur that has raised capital and mentored numerous other startups to do the same. </li></ul><p>------------------------------------------------------------------------------------------------------------------------------------------------</p><p><strong>What do other people say about Nestor Villalobos and his courses?</strong></p><p><em>This course is informative and get straight to the information we what to know. You will be attentive from the beggining to the end. Useful for many purposes. Thank you! </em></p><p>-- Dominic </p><p><em>Amplifies &amp; Clarifies bits and pieces of the full picture that we know of, but dont think of them are very important.</em></p><p>-- Chetan </p><p><em style=\"\">His professionalism, attention to detail and business management skills set him apart.</em></p><p>-- Alex Rodriguez</p><p>------------------------------------------------------------------------------------------------------------------------------------------------<br></p><p><strong>About the Instructor</strong></p><p>Nestor Villalobos is the CEO of the <strong>Tudor Ice Company</strong> where he has raised over a <strong>MILLION DOLLARS</strong> in venture funding to get the business going. Aside from also running his <strong>blog</strong>, Nestor is a professor of entrepreneurship at a local university that is considered one of the top 5% worldwide in business according to the AACSB. Furthermore, he has mentored a number of startup CEOs helping them raise venture capital as well. Nestor has won numerous awards as well as business plan competitions including “<strong>Most Promising Startup</strong>\" at Venture Pitch Orlando, “<strong>Best Pitch</strong>\" at Gulf Coast Venture Forum, <strong>1<sup>st</sup> Place</strong> at the UM Elevator Pitch Contest<strong>, 2nd Place</strong> in the FAU Business Plan Competition and was a <strong>finalist</strong> in the Miller Lite Tap the Future, Miami Herald and Inversiones business plan competitions. You can follow Nestor on twitter at @nesvillalobos.<strong></strong></p><p>------------------------------------------------------------------------------------------------------------------------------------------------<br></p><p><strong>What is the risk? </strong></p><ul><li>None! If you don't like the class, within 30 days I will provide you with your money back, guaranteed. There is <strong>NOTHING</strong> to lose!</li></ul><p><span style=\"\">------------------------------------------------------------------------------------------------------------------------------------------------</span></p>", 
    "end_date": null, 
    "title": "Raising Angel Capital: Your Personal Brand", 
    "price": 0, 
    "instructors": "Nestor Villalobos", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604314_77fe.jpg", 
    "course_url": "https://www.udemy.com/personalbrand/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-06T23:14:31Z"
}