{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t         Reframing is an easy, four-step process that generates creative approaches for your own life and work. Reframing strongly held beliefs will help you to expose conventional wisdom that stands in the way of progress. By overturning these conventional wisdom&#039;s and gaining a novel perspective you will disarm skeptics and exploit the inability of others to think differently. Push the boundaries of innovation by completely flipping an idea and create new possibilities.  </p>  <p style=\"\">  \t         The technique of reframing has been developed at <strong style=\"\">THNK, School of Creative Leadership</strong> by <em style=\"\">Karim Benammar</em>. The tool is extensively used in THNK&#039;s online Innovation course called Start Innovating Now  </p>  <p style=\"\">  \t   In order to enlighten a maximum amount of people with this process, we created a online tool called ReFrame that takes you through all its processes.  </p>  <p style=\"\">  \t     The methodology is rooted in the theory of paradigms by Thomas Kuhn. The methodology and its background are explained in detail in the book “Reframing / The art of thinking differently”.  </p>  <p style=\"\">  \t         Reframing will take you out of your mental comfort zone, enabling you to discover new perspectives and creative solutions. If you can make yourself chuckle during the process, then you’re on the right path.The beauty of it is that anyone, anywhere can apply this technique without prior training.  </p>", 
    "end_date": null, 
    "title": "Reframing: Creativity for Innovation", 
    "price": 0, 
    "instructors": "THNK School of Creative Leadership, Karim Benammar, Ph.D.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235514_35e6_3.jpg", 
    "course_url": "https://www.udemy.com/reframe-creativity-for-innovation/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T10:37:55Z"
}