{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to this <strong class=\"redactor-inline-converted\">beginners guide</strong> to how to go about correctly registering and configuring a Domain name for your online business. </p>\n\n<p>This course is mainly aimed at beginners but is actually for people of all experience levels. </p>\n\n<p>All are welcome to jump in - as I realise that even those that have been using and working with Domain names for several years may not know all the working of domains - or the important SEO factors of a Domain name, so everyone can learn from this.</p>\n\n\n\n<p>Not many people know that the good SEO of a website can actually start before you have even designed a single page - and actually begins with the registration of a great Domain Name in the 1st instance. This can be half the battle won, and can pay real dividends when it comes to the SEO of your website.</p>\n\n\n\n<p>This course is a real hustlers guide to Domain Names and will teach you:</p>\n\n\n\n<ul><li>How to choose a great Domain Name for your website / business</li><li>How to choose a Domain Name based on important modern SEO factors</li><li>How to go about choosing the right Domain Name registrar to add your domain to the domains database / register (Icann)</li><li>Other nuggets of information related to Domain Names </li></ul><p>I am super confident that you will learn more than you already know about the important aspects of a Domain Name, and as I am sure you will agree, if you learn just one new thing then it will have been worth it. </p><p><strong>You have nothing to lose, so jump in!</strong></p><p>We are super proud that this course is covered by the Udemy 30 Day money back guarantee, so you really have absolutely nothing to lose - and knowledge to gain. </p><p>...... see you on the inside!</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Registering A Domain Name for Business - An e-Hustlers Guide", 
    "price": "20.00", 
    "instructors": "Drop Ship Businesses for Sale", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/862418_2422_3.jpg", 
    "course_url": "https://www.udemy.com/registering-a-domain-name-for-business-a-how-to-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-28T19:02:03Z"
}