{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em><em><strong>A must-have, differentiated, Udemy Premium Course - DOUBLE CERTIFICATION</strong></em></em></p><p style=\"\"><em>Looking to fulfill your biggest financial dream along with your life partner? </em></p><p style=\"\">Great! Just tap into the benefits of this first-class money guide which will completely change your life!</p><p style=\"\">Test the secrets of identifying <em><strong>behavioral hacks</strong></em>. And transform them into your own special <strong>money project</strong>, developing a stronger relationship with our life partner.</p><p style=\"\"><strong>Important</strong>: This is not just a self-development and entrepreneurial guide. It is a NLP coaching strategy, based on the neuro-logical levels of change. Yet, don't bother with theory. I'll show you EXACTLY how to do it. I have trained more than 4000 persons into this program over the last 6 years in Austria and France, and others in the online environment.</p><p style=\"\">In this class you will earn important information on <strong>How to</strong>:</p><ul><li>Build Your Very Own Money Project with Your Life Partner.</li><li>Use High Quality Behavioral Changes that will Support Your Thriving Financial Mission.</li><li>Create High Converting Environmental Resources that will Emotionally Compel You and Your Life partner to Become Proactive and Generate Ideas, Resources and Actions.</li><li>Create the Most Profit Skills Possible with the Least Amount of Expense.</li><li>Test and Validate Your Ultimate Set of Resources to Guarantee your Financial Mission's Success.</li><li>Effectively Fulfill Course Activities and Manage Your Money Project with Your Life Partner.</li><li>Provide Outstanding Emotional Strength and Integrity to Work along this Financial Project.</li><li>Get Abundant Outcomes from this Course and Plan Even more Actions, Strategically.</li><li>Continually Identify the Strengths and Abilities you've Formed during this Course</li><li>Focus on Important Actions During Your Strategy for Reaching your Financial Goal.</li><li>Automate the Process so that You Can Start Implementing The Actions Right Away.</li><li>Expand Your Relationships Boundaries For Generating Unlimited Resources for Your Financial Project.</li><li>Benefit from Each Coaching Lecture, Working Step-by-step with Your Life Partner.</li></ul><p style=\"\">This course is exciting and comprehensive and you're getting a combination of the necessary coaching and personal behavior change towards your financial dream. </p><p style=\"\">By the time you finish this class, you will have all the tools and a simple, effective and elegant project you can start implementing immediately with your life partner.</p><p style=\"\">*At the end of this course, each student will recive a<strong> DOUBLE CERTIFICATION</strong> - An official Certification Signed and released by me with an endorsement for you and a Certificate of Completion from Udemy</p><p style=\"\">Change Your Life Today!</p>", 
    "end_date": null, 
    "title": "Secret Tactics for Entrepreneurial Couples - NLP Mind Hacks", 
    "price": "20.00", 
    "instructors": "Alina Tudorache", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526936_1df2_4.jpg", 
    "course_url": "https://www.udemy.com/make-money-right-now-with-your-life-partner/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-12T17:55:23Z"
}