{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Grow your business in half the time with the right entrepreneurial habits, skills and mindsets. Create massive wealth, at least double your productivity and take full control of your financial destiny with this 11-part crash course on entrepreneurship.</p><p><strong>This course on becoming an entrepreneur is 100% FREE until July 19th 2015!</strong></p><p>After that date it won't be free anymore, so get in now.</p><p>+++++++++++++++++++++++++++++++++++++++++++++</p><p><strong>About This Course:</strong></p><ul><li><em>Over 1,034 students have taken this course already!</em></li><li><em>Sequel of my best-selling \"Productivity Secrets: The Ultimate Time Management System\" course with over 1,214 students on Udemy</em></li><li><em>Different than any other dry and boring course on entrepreneurship, no filler and fluff talk, this course cuts straight to the chase of what it takes to become an entrepreneur</em></li><li><em>I personally built 3 successful businesses with these wealth-producing mindsets</em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my \"giant balls promise\" to you. You either love it or get your money back.</em></li><li><em>Includes a total of 11 modules and over 1 hour of high-definition video</em></li></ul><p><strong>Who Is This Course For?</strong></p><p>No matter if you've been thinking of starting a business, or if you're already a bootstrapping entrepreneur, discover the \"insider\" secrets of the most successful entrepreneurs and ethically steal them to build your own business without making costly mistakes. </p><p>You'll get the most out of this if you are one of the following:</p><ol><li>Bootstrapping internet entrepreneur</li><li>Work from home business owner</li><li>Coach, speaker, author or expert</li></ol><p>You don't need any prior knowledge to get started, no software, no additional materials. Just lean back, hit the play button and \"download\" the hidden psychology of successful entrepreneurs to your own brain and finally take control of your financial life.</p><p>The only requirements for this course are: Being positive and open-minded.</p><p><strong>Here's What You're Getting</strong></p><p>Over one hour of astonishing belief hacks, wealth-producing mindsets and ruthless productivity tips that will make your success as an aspiring entrepreneur almost inevitable.</p><p>Lectured by next generation marketing expert and serial entrepreneur Till Boadella.</p>", 
    "end_date": null, 
    "title": "Secrets of Entrepreneurship: How to Become an Entrepreneur", 
    "price": "20.00", 
    "instructors": "Till Boadella", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541060_1b19_4.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-crash-course-how-to-become-an-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T10:46:19Z"
}