{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Business Growth Secrets</strong></p><p>This course could save you $1000s in just a few minutes - if you own your own business, or are thinking of starting one, this course will give you everything you need to increase your sales by at least 46%.</p><p>Andy Edwards is an international speaker and widely published author, who's been teaching business skills to companies for over 20 years. He's taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life changing skills to transform your business.</p><p>He covers four key business principles, each with practical implications and ideas - leaving you with a 12 Step Action Plan for super charge your profits. You'll learn how to get more customers through your door, get them spending more each time, coming back more often, and never switching to your competitors. You'll hear lots of real life examples and gives practical tools you can use right away to get better results.</p><p>The course overview includes:</p><ul><li>Stop missing out on hundreds of potential customers searching for you</li><li>Rewards your loyal fans and make your customers feel loved</li><li>Prevent any customers leaving you to use your competitors</li><li>Make the most of your great quality service by tripling your referral income</li><li>Spot what your competitors are doing right, and learn from them</li><li>Get access to twice as many customers by joining with other businesses</li><li>Cross-sell and up-sell to HELP the customer</li><li>And lots lots more!</li></ul><p><em><br></em></p><p><em><strong>Some praise for this course:</strong></em></p><p><em>\"Gurus are charging $10,000's more for the same info as Andy is literally spoon feeding in this course.\"</em></p><p><em>\"If you are a fan of Jay Abraham's philosophies on business and marketing you will enjoy this course. It teaches a similar philosophy and mindset in a practical, light-hearted, actionable and concise fashion.\"</em></p><p><em>\"This course won't leave you scrapping around still trying to find ideas how to grow your business as the opportunities to grow are mostly already sitting right there in your business already.</em><em>\"</em><br></p>", 
    "end_date": null, 
    "title": "Secrets to Business Growth", 
    "price": "20.00", 
    "instructors": "Andy Edwards", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546882_9ce0_4.jpg", 
    "course_url": "https://www.udemy.com/grow-your-turnover-by-46/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T16:31:32Z"
}