{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                  Have you ever wanted to write a children's book?  Don't know where to start?</p><p>I will bring you through the entire process from start to finish.  I won't leave a single stone un-turned and I'll be here to help you through the entire process.</p>  <p>  \t                  Whether you have a character concept, a complete manuscript, simply a lesson to teach, or <em>nothing </em>at all, this course will bring you through the children's self-publishing process step-by-step and leave NO excuses for a book gone unpublished!  </p>  <p>  \t                  This is one of the best times in history to be a children's author.  The barriers to entry are dropping rapidly, and the market is far from saturated.  I'll show you how to define your book's value, create your own market gap, identify with your readers (<em>and </em>buyers) and create a product that is delivers huge value and enjoyment.  </p>  <p>  \t                  We begin with the end in mind to create a product that will have a definite purpose and unique selling point(s).  This way you, the author, can be confident before you even begin your self-publishing endeavor and you will have a definitive plan and specific target audience interested in your book.  </p>  <p>  \t                I've also included a myriad of reference books with this course to help give you even more insight.  </p>  <ul>  \t<li><strong>Amazon Best-Seller Strategies </strong>(20 pages) - Value: $20</li>  \t<li><strong>List Building Wisdom </strong>(26 pages) - Value: $10</li>  \t<li><strong>Google+ Authority (</strong>31 pages) - Value: $15</li>  \t<li><strong>The Successful Entrepreneur </strong>(32 pages) - Value: $17</li>  \t<li><strong>Social Media Plan of Attack</strong> (41 pages) - Value: $14</li>  \t<li><strong>Twitter Marketing Made Easy </strong>(21 pages) - Value: $17</li>  \t<li><strong>Unstoppable Facebook Traffic </strong>(45 pages) - Value: $17</li>  \t<li><strong>Discovering the World of Pinterest </strong>(35 pages) - Value $20</li>  </ul><p></p>  <p>  \t          If you've always dreamed of publishing a children's book, or if you've published one that wasn't a success, you're in the right place!  I'll teach you not only how to become a children's author, but how to become an entrepreneur and successfully sell your product to bring smiles to thousands of tiny faces!  </p><p>Contrary to popular belief, you can self publish your book even on a very limited budget, and I'll show you how.</p>", 
    "end_date": null, 
    "title": "Self-Publish Your Children's Book - From Start to Finish", 
    "price": "40.00", 
    "instructors": "Tim Johnson", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/216842_545c_7.jpg", 
    "course_url": "https://www.udemy.com/self-publish-your-childrens-book-from-start-to-finish/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-13T02:21:48Z"
}