{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tEste curso es el inicio de tu andadura en las metodologías Lean Startup. Será el curso que <strong style=\"\">cambie tu manera de pensar cuando intentes validar tu idea de negocio. </strong>  </p>  <p>  \t<strong style=\"\">Ahórrate meses de frustraciones inútiles construyendo productos o servicios que nadie quiere. </strong>  </p>  <p>  \tEstos enfoques se basan en la metodología de Desarrollo de Clientes del profesor Steve Blank y Bob Dorf de la Universidad de Stanford, usado por miles de emprendedores  y startups de éxito al rededor del mundo como Dropbox, Airbnb o Instagram.  </p>  <p>  \tSeguramente te has hecho como emprendedor alguna vez estas preguntas:  </p>  <ul style=\"\">  \t<li>¿cómo puedo llevar a la práctica mi idea?</li>  \t<li>¿cómo puedo saber si mi idea es un buen negocio?</li>  \t<li>¿cómo puedo testear mi solución sin gastarme mucho dinero?</li>  \t<li>¿cómo puedo encontrar a mis primeros clientes?</li>  </ul>  <p>  \tSi es así, debes que empezar a aplicar<strong style=\"\"> Lean Startup.</strong>  </p>  <p>  \t¿Pero en que se basa <strong style=\"\">Lean Startup</strong>?  </p>  <p>  \tEn tres principios:  </p>  <ol style=\"\">  \t<li>Diseño del Modelo de Negocio.</li>  \t<li>Aplicación del proceso de Desarrollo de Clientes.</li>  \t<li>Desarrollo del producto o servicios usando el proceso de Desarrollo Ágil.</li>  </ol>  <p>  \tEl curso empezará con una introducción a la filosofía y el enfoque  para realizar la búsqueda de tu <strong style=\"\">modelo de negocio.</strong>  </p>  <p>  \tEn esta primera semana (del bloque del <strong style=\"\">Programa de Lanzamiento de tu Startup</strong>), aprenderás la filosofía del enfoque  y <strong style=\"\">el diseño de modelos de negocio.</strong>  </p>  <p>  \t<strong style=\"\">El objetivo es que puedas experimentar este increíble proceso que tantos negocios de éxito está creando en todo el mundo y que te ayudará a ti también a convertir tu idea en un gran negocio arrancando con esta primera semana.</strong>  </p>  <p style=\"\">  \tBienvenido.  </p>", 
    "end_date": null, 
    "title": "SEMANA 1- Programa de Lanzamiento de tu Startup ", 
    "price": "20.00", 
    "instructors": "Nestor Guerra", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/406710_3173_5.jpg", 
    "course_url": "https://www.udemy.com/semana-1-programa-de-lanzamiento-de-tu-startup/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T14:57:54Z"
}