{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">Contents and Overview</strong></p><p style=\"\">This course begins with an introduction into what it means to be a freelancer, regardless of what industry you work in.</p><p style=\"\">You'll realize that you have the opportunity to take control of your career, regardless of your previous experience, by seeing the world the way your clients do.</p><p style=\"\">Seth walks you through choosing your clients and how to be at the right place at the right time to find them. By pushing yourself to produce remarkable work, the clients will start coming to you.</p><p style=\"\">Each short, intense (and sometimes funny) lecture helps you identify ways to build your reputation and promote your business so you can step out of invisibility. You'll make your work more valuable, and you'll know how to price your work to attract and retain clients.</p><p style=\"\">You have the opportunity to become a well-known specialist in your field. You'll learn the foundation that consistently generates client leads that translate into a higher freelancer income.  </p><p style=\"\">Also included: In-depth answers to FAQs that Seth has collected from his audience in preparation for this course. The FAQs will help clarify common concerns that freelancers have, as well as provide insight into overcoming everyday challenges. </p><p style=\"\">Throughout the course, you'll have the opportunity to complete exercises that will help you forge a path you can easily follow. You'll get as much out of this course as you choose to put into it.</p><p style=\"\">By the end of this course, you'll know what you need to do to pave your way towards a more lucrative and fulfilling freelancing career. You'll be confident enough to be your own boss, and you'll know how to put your goals in motion. </p><p style=\"\">Whether you're currently freelancing full-time or you're stuck in a job that you want to get out of, Seth shows you what it takes to be an accomplished freelancer—or, as he calls it, “a warrior without a king.\"</p>", 
    "end_date": null, 
    "title": "Seth Godin's Freelancer Course", 
    "price": "45.00", 
    "instructors": "Seth Godin", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475170_209f.jpg", 
    "course_url": "https://www.udemy.com/seth-godin-freelancer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-13T17:26:15Z"
}