{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Most people go through the process of starting their business or blog blind. They have no idea whether or not what they create will be popular with their potential customers. It's a shot in the dark.  </p>  <p>  \t    You don't want start your business like that, do you? I should hope not!  </p>  <p>  \t    In this course, I walk you through every step that you need to take in order to find your potential customers and begin communicating with them in order to create products and content that they will love.</p>  <p>  \t    This will allow you to:  </p>  <ul>  \t<li>Get your first core group of loyal customers and subscribers</li>  \t<li>Launch your website the right way with customers and readers waiting to see what you create</li>  \t<li>Break into any niche and be successful</li>  \t<li>Increase conversion rates to your email list and sales to your products beyond \"normal\" rates</li>  \t<li>Start your business, even if you don't have a product yet</li>  \t<li>And more!</li>  </ul>  <p>  \t    If you have been struggling to take action in your business or you don't know where to start, you've found your answer. In this video training I am starting a business and going through the process that I am teaching.  </p>  <p>  \t<strong>Watch right over my shoulder as I am actually talking to customers, getting feedback and building my business using this strategy.</strong>  </p>  <p>  \t    No more \"methods\" that are not in practice. I will be talking to customers, showing you real feedback, and tweaking my business based off of it to create something that my market will love.  </p>  <p>  \t    I will also show you how this strategy doubles as your tool to get your first <strong>50-100 </strong>subscribers and use them as a launchpad for the rest of your business.  </p>  <p>  \t    Use this as your quick start guide to start your business with only 1.5 hours of video that cuts the fluff out and gets straight to the point of what you need to do. Don't go and sit through 20 hours of video and pay hundreds of dollars only to learn out of pracitce methods. Start talking to your customers now!  </p>", 
    "end_date": null, 
    "title": "Simple Customer Development - Get your first 100 customers", 
    "price": "20.00", 
    "instructors": "Travis Levell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394206_b917_5.jpg", 
    "course_url": "https://www.udemy.com/simple-quick-customer-development/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T18:51:13Z"
}