{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t***********1000 Plus Students.... Join this Growing Community***************  </p>  <p>  \t<em>As a small business owner, do you struggle to increase your profits?  Are you tired of working harder and getting less results?  Does it seem like your efforts are not working as well as you would like?</em>  </p>  <p>  \t  It is time for you to understand the foundation of your small business. PROFITS.  If you are not generating profits and in an effective and consistent basis, your business will dwindle slowly.  </p>  <p>  \t  Small business struggle to generate profits because they do not know the formula for creating profits on demand.  If you understand the foundation of increasing and generating more profits you will be able to create a plan and implement a plan that will generate profits consistently.  </p>  <p>  \t  This course is designed to teach you the foundation of profit maximization and creation for your small business.  </p>  <p>  \t  The course digs into the 4 main ways for you to increase profits.  If you understand these 4 ways and are able to create a plan then implement the plan you will have a formula that you can recreate on demand for profits.  </p>  <p>  \t  The techniques and strategies that you will learn are very cost effective strategies that might not even cost you anymore than what you are already spending.  If you put the strategies to work for you and your business, you will be able to keep and attract customers and ultimately profits on demand.  </p>  <p>  \t<strong>The course will teach you:</strong>  </p>  <ul>  \t<li>The 4 main ways to generate profits </li>  \t<li>How to get more customers</li>  \t<li>How to increase the sale value of a customer transaction</li>  \t<li>How to increase the frequency by which your customers visit you </li>  \t<li>How to increase customer retention</li>  </ul>  <p>  \t<em>If you follow these strategies you will know yourself, your business, your customer and your market at a deeper level.</em>  </p>  <p>  \t<strong>The course is ideal for:</strong>  </p>  <ul>  \t<li>Small business owners</li>  \t<li>Marketers</li>  \t<li>Entrepreneurs</li>  \t<li>Any one looking to increase their knowledge</li>  </ul>  <p>  \t  The course includes a ***<strong>BONUS*** </strong>that will help you understand direct marketing ad tips and techniques to generate a bigger response to your ads.  <strong>FREE</strong> infographic included with the course.  </p>  <p>  \t  Please note the course is <strong><em>not</em></strong> a course to teach you how to get rich quick... The course is a thorough process to help you understand your business, customers and how to generate lasting profits.  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>GUARANTEE:  </strong>If you take the course and you do not feel that the course met your expectations, you have a 30 day money back guarantee backed by Udemy. <em>You have nothing to lose and everything to gain.</em>  </p>  <p>  \t<strong>TAKE ADVANTAGE NOW... ENROLL TODAY!!!!!!!!</strong>  </p>", 
    "end_date": null, 
    "title": "Small Business Profit Maximization: Increase Your Profits...", 
    "price": "20.00", 
    "instructors": "Julio A Lara", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372466_ad6c.jpg", 
    "course_url": "https://www.udemy.com/small-business-profit-maximization-increase-your-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T16:07:56Z"
}