{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<strong></strong><p>Starting your own business is scary. Managing your own Business can be Scary. Investing your own money in projects can be Scary. Really scary. Everything is Scary...if you don't know what you are really doing.</p><p>How do you Find, Filter, Track, Grow &amp; Expand Your Ideas ?</p><p>How do you Accept &amp; Reject Customers ?</p><p>In fact, there is no one size fits all but...there are principles, values, operating procedures, systems, templates, checklists to follow that will give you the results you are searching for, in your current situation that works in your industry.<br>Invest in Yourself and Prepare well for the things that come.</p><p>Inside this course you're going to learn about:</p><p>The core concepts and everything related for a solid business foundation<br>How to think &amp; act to get better results</p><p>What you should pay attention on and what to ignore<br>How to go about gathering the right resources and expanding your toolkit with the best things possible</p><p>You will get also TOP Value Documents, Resources, worksheets regarding:</p><ul><li>best business resources, mobile apps, websites</li><li>awesome templates to follow</li><li>checklists &amp; systems</li><li>products &amp; services</li><li>mindmaps</li><li>personality tests (mainly because professions come and go but your personality traits remain with you for the rest of your life and is crucial to know those very well, even before you are pressured with a lot of tasks, projects etc.)</li><li>what's working in your specific industry</li><li>changes in your mindset and your way of doing business overall</li><li>Business action plans, trends, metrics to pursue in developing and executing your GREAT IDEA with success</li><li>pricing, packaging, offer strategies</li><li>productivity systems</li><li>strategies to scaling your business</li><li>building, leading &amp; managing a team or something else</li><li>How to consistently come up with insightful, actionable business ideas and how to recognize a great product, service, idea when you first see it.</li></ul> <br>Core Modules included at this moment inside the course: Products &amp; Assets<br>The Right Business Foundation<br>Your Vision &amp; Mission With Your Business<br>Marketing &amp; Sales Part<br>The Dream TEAM<br>Systems &amp; Processes in Your Business<br>ACTION, EXECUTION is the KEY Ingredient<br>Time, Cash and REAL Intrinsec Values<br>and more...<br>Enroll Now and let's start Building your Business The SMART Way !", 
    "end_date": null, 
    "title": "SMART Biz", 
    "price": "50.00", 
    "instructors": "Sebastian Papp", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705364_ac39_3.jpg", 
    "course_url": "https://www.udemy.com/smartbiz/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T01:07:08Z"
}