{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t <em style=\"\">Have you heard about social entrepreneurship but aren’t really sure what it is?</em>  </p>  <p style=\"\">  \t <em style=\"\">Lost in a long list of jargon and fuzzy definitions?</em>  </p>  <p style=\"\">  \t <em style=\"\">Not sure how, or if, it applies to you and your work?</em>  </p>  <p style=\"\">  \t   Then this course is for you.  </p>  <p style=\"\">  \t   Social entrepreneurship has a lot to offer. It’s building some of the greatest social change work on the planet, and it’s using cutting edge tools that are increasing efficiency, effectiveness, and the scale of social change.  </p>  <p style=\"\">  \t   However, the social entrepreneurship space can be a difficult one to navigate and determining how it applies on the ground can be especially challenging.  </p>  <p style=\"\">  \t   This course was designed as an ‘insanely useful’ first step in using social entrepreneurship to increase the impact of your work. Using a street smart approach, and an applied case study, this course looks at five of the most useful tools social entrepreneurs use:  </p>  <ul style=\"\">  \t<li style=\"\">Hybrid Organizations</li>  \t<li style=\"\">Earned Revenue</li>  \t<li style=\"\">Impact Capital</li>  \t<li style=\"\">Impact Measurement</li>  \t<li style=\"\">and Human Centered Design.</li>  </ul>  <p style=\"\">  \t Rather than focusing on a theoretical definition, or giving you a  laundry list of who’s who’s in the space, we’ve brought together the  essentials to create a 1 hour crash course that will give you the confidence you need  in this burgeoning field.  </p>  <p style=\"\">  \t <strong style=\"\">Join one of the social sectors fastest growing movements and discover why it’s shaking up how we create social change today.</strong>  </p>", 
    "end_date": null, 
    "title": "Social Entrepreneurship: A Crash Course", 
    "price": "25.00", 
    "instructors": "Jessica Lax, School for Change Inc.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/158254_d75f_2.jpg", 
    "course_url": "https://www.udemy.com/crashcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-04T22:40:30Z"
}