{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are you ready for an amazing 2016!  Charge what you're worth.</strong></p><p>  \t              Have you wondered if you're charging enough for your services?   or too much?  </p>  <p>  \t              Have you been curious about why some prices ended in a 9 or a 7?  </p>  <p>  \t              Do you want to take the mystery out of your pricing strategies and tactics so you can test and update your pricing effectively?  <strong>This is the course for you! </strong>  </p>  <p>  \t<strong>Over 800 students!  </strong>Join this growing community of solopreneurs!</p>  <p>  \t              I bring a combination of academic research and the hands-on experience of working with hundreds of small business owners to teach you how you can learn it, do it and profit!  in your business.  </p>  <p>  \t              About this course:  </p>  <ul>  \t<li>Full, free lifetime access</li>  \t<li>All future extra lectures and upgrades are always included for free</li>  \t<li>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</li>  \t<li>Worksheets and checklists so you can easily and quickly implement this approach for YOUR business.</li>  </ul>  <p>  \t              LEARN HOW:  </p>  <ul>  \t<li>To choose the right pricing strategies for your small business so you make more money.</li>  \t<li>To implement the right pricing tactics with an understanding of not just what, but also why.</li>  \t<li>Benefit from the odd irrational quirks consumers have so that you can provide great value at a price that you both want!</li>  </ul>  <p>  \t              I’ve worked with hundreds of small business owners and solopreneurs over the past 15 years. Plus I’ve taught MBA students similar material for even longer. This info is up to date with key learnings and customized for the small business owner who wants to know some of the why and what but really wants to know how to learn it, do it and profit!  </p>  <p>  \t              “I was just telling a friend how Lisa has helped me to more than double my income in 9 months and I felt that I should let the whole world know. I am a self employed acupuncturist and prior to working with Lisa I was spinning my tail doing lots of stuff at once then getting tired and not doing anything for several months. I was feeling like my business was never going to grow. Lisa helped me to get clear about my business message, helped me to come up with strategic methods and timelines for reaching people, was a great sounding board for working out ideas and helping me to discern which marketing activities would NOT be worthwhile for me, my brand and my style. I cannot recommend her enough.”  </p>  <p>  \t              ~ Marie B, 5 Star Review posted on Yelp  </p>  <p>  \t              Click the \"take this course\" button, top right, ... don’t waste time or money, get started now!  </p>  <p>  \t              Lisa Cain  </p>", 
    "end_date": null, 
    "title": "Solopreneur Marketing: Pricing for Profits! ", 
    "price": "35.00", 
    "instructors": "Lisa Cain, PhD", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368364_1cb1_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-more-money-by-setting-the-right-price/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T20:59:18Z"
}