{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Viele Coachs, Trainer/innen und Berater im Gesundheitsbereich merken irgendwann: Mit Dienstleistungen, die ihre <strong style=\"\">persönliche Anwesenheit</strong> erfordern, lässt sich ihr Einkommen nicht weiter erhöhen. Schließlich braucht der Mensch auch Zeit zur Erholung. </p><p style=\"\"><strong style=\"\">Wie lassen sich trotzdem noch viel mehr Menschen erreichen?</strong></p><p style=\"\"><strong style=\"\">Durch die Entwicklung von Produkten</strong>, die Skalierbarkeit gewährleisten und keine persönliche Anwesenheit voraussetzen. Sie ermöglichen Ihnen,<strong style=\"\"> ortsunabhängig zu arbeiten</strong> und sich <strong style=\"\">arbeitsfreie Intervalle</strong> zu gönnen, ohne dass das Einkommen gleich auf Null fällt: </p><p style=\"\">Produkte lassen sich auch dann verkaufen - online nämlich - wenn Sie gerade nicht vor Ort sind.</p><p style=\"\">In diesem Video-Kurs lernen Sie, wie Sie als <strong style=\"\">Wissensarbeiter/innen</strong> Info-Produkte entwickeln können und wie sich deren Verkauf gestaltet.   </p><p style=\"\">In 41 Lektionen - verteilt über 8 Abschnitte - erfahren Sie, </p> <ul style=\"\"><li style=\"\">wie skalierbare Produkte Sie <strong style=\"\">unabhängiger</strong> von Ihren Kunden machen</li><li style=\"\">wie Sie aus Ihrem Wissen <strong style=\"\">Informationsprodukte erstellen </strong><strong style=\"\"></strong></li><li style=\"\">wie Sie ein <strong style=\"\">Buch &quot;on demand&quot; </strong>veröffentlichen und wieviel Sie mit eBooks verdienen</li><li style=\"\">wie Sie <strong style=\"\">eigene CDs</strong> entwickeln, z.B. mit Entspannungsübungen</li><li style=\"\">wie Sie die Produkt-Erstellung <strong style=\"\">wirtschaftlich sinnvoll</strong> gestalten</li><li style=\"\">wie Sie Produkte <strong style=\"\">online verkaufen</strong></li><li style=\"\">wie Sie Ihre Kunden <strong style=\"\">von Offline- zu Online-Angeboten</strong> führen</li></ul> <p style=\"\">In 7 Quizes können Sie überprüfen, was Sie von dem Gelernten behalten haben.</p><p style=\"\"><strong style=\"\">Alle Materialien sind herunterladbar. </strong></p><p style=\"\"><strong style=\"\"></strong>Die 19 vertonten Folien-Vorträge und 14 Person-Videos (in denen ich zu Ihnen spreche) sowie die 5 Text-Lektionen liefern Ihnen ein abwechslungsreiches Programm, an dem Sie hoffentlich viel Freude haben werden. </p><p style=\"\">Es erwarten Sie zusätzlich Druck-Vorlagen und weitere <strong style=\"\">Materialien zur Vertiefung</strong>.</p><p style=\"\"><strong style=\"\">Zu 33 Lektionen gibt es umfangreiche Aufgaben für Sie!</strong></p><p style=\"\">Schließlich wollen und sollen Sie aus diesem Kurs möglichst viel mitnehmen.</p><p style=\"\">Alle Fall-Beispiele und Praxisberichte basieren auf meinen Erfahrungen: Lange Jahre war ich als <strong style=\"\">selbständige Beraterin</strong> zum Betrieblichen Gesundheitsmanagement tätig, und bin inzwischen mehrfache Autorin (<strong style=\"\">ca. 30 Bücher, 40 eBooks</strong>) und Entwicklerin von Toolboxes, Online-Kursen und Videotrainings - wie Sie merken ;-) </p><p style=\"\"><strong style=\"\">Was ich während der letzten Jahre auf meinem Weg von der Dienstleisterin zur Produkt-Entwicklerin gelernt habe, erhalten Sie nun in komprimierter Form als Online-Kurs.</strong> </p><p style=\"\">Für Sie heißt das, dass Sie <strong style=\"\">erprobte und bewährte Konzepte</strong> kennenlernen und keine abgehobene Theorie. </p>", 
    "end_date": null, 
    "title": "Solopreneur im Gesundheitsbereich 3: Produkte entwickeln", 
    "price": "45.00", 
    "instructors": "Anne Katrin Matyssek", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476922_4907_2.jpg", 
    "course_url": "https://www.udemy.com/solopreneur-im-gesundheitsbereich-3-produkte-entwickeln/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T09:40:19Z"
}