{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h5></h5>  <h5>Business networking doesn&#039;t have to be scary.</h5>  <p>  \t                   There&#039;s <em>nothing worse</em> than being at a networking event and not being comfortable talking to anybody there. <strong>Dozens</strong> of successful people in the same room as you all looking to see what you have to say.  </p>  <p>  \t                        You might be afraid you&#039;ll ramble, or people won&#039;t be interested in what you have to say, or that people are going to laugh when you tell them about your new business. For introverted entrepreneurs everywhere, this can be a <strong>terrifying experience</strong>!  </p>  <p>  \t<strong>But it doesn&#039;t have to be!</strong>  </p>  <p>  \t                     You <strong>can</strong> learn to be seen as an extroverted entrepreneur, even if you&#039;re really an introvert! <br>  \t<br>  \t                        You <strong>can</strong> get people talking about your company!<br>  \t<br>  \t                        You <strong>can</strong> get people to see you as an expert. <br>  \t<br>  \t                        And you <strong>can</strong> guide the conversation to get people to talk about what <strong>you</strong> want them to talk about.  </p>  <p>  \t                      This is all possible with soundbites.  </p>  <p>  \t                        I first debuted my work on soundbites on Richard Branson&#039;s corporate website <a class=\"external-link\" href=\"http://www.virgin.com/author/ysmay\" target=\"_blank\" rel=\"nofollow\">Virgin.com</a>. Over the last 2 years I have been analyzing conversations, and relationships (both business and political), and working on a way to teach people how to develop their own set of soundbites.  </p>  <p>  \t                     Using <strong>video lectures, formulas, workshops, and quizzes,</strong> this Udemy course will teach you how to <strong>develop your very own soundbites</strong> that will make those scary networking events a <strong>little less scary</strong>; make you <strong>be seen as an expert</strong> by acquaintances, colleagues, and key backers, and help you <strong>talk about your startup with ease</strong>.  </p>  <p>  \t                     This course will be updated with new material - whether lecture, supplemental, or both - <strong>at least once a month</strong>. I will login to the course to interact with the students, and ask questions <strong>at least twice a week</strong>. Please ask me questions! I&#039;m here to help!  </p>  <p>  \t                Keep in mind, while this course has a lecture time of 1.5 hours the actual time needed to invest in this course is approximately 4-6 hours. Each soundbite can take 30 minutes or more to write and revise. I recommend setting aside a weekend so you have large blocks of uninterrupted time to work on your soundbites.  </p>  <p>  \t                      Get started, and take control of your message and success today!  </p>", 
    "end_date": null, 
    "title": "Soundbites for Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Ysmay Walsh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48034_8a01_9.jpg", 
    "course_url": "https://www.udemy.com/soundbites-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-31T20:36:32Z"
}