{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Für Udemy- und andere <strong>E-Learning-Dozenten, Podcaster, Unternehmer, Video-Produzenten, Filmemacher, angehende Profisprecher</strong> und überhaupt alle, die Sprache in optimaler Qualität und ohne großen Aufwand aufzeichnen möchten.</p><p>In diesem Kurs lernen Sie innerhalb weniger Stunden, wie Sie mit einfachen Mitteln und ohne Tonstudio professionelle <strong>Sprach-Aufnahmen in Tonstudio- und Rundfunk-Qualität</strong>  erstellen können. Der Kurs selbst dauert sogar nur etwa 1/2 Stunde. </p><p>Sie lernen, wie die wichtigsten Studio-Plugins wie Noise Gate, Kompressor, Equalizer, De-Esser und Limiter eingesetzt werden und welche Funktionen sie erfüllen und Sie lernen, wie man mit Studio-Software <strong>Top-Aufnahmen</strong> macht, die so bis vor ein paar Jahren nur mit sündhaft teuren Hardware-Geräten möglich gewesen wären.</p><p>Wenn Sie das Equipment beisammen haben, brauchen Sie <strong>nur etwa 2-3 Stunden, um den Kurs umzusetzen</strong> und Ihre erste professionelle Sprachaufnahme fertig zu stellen.</p><p>Mindest-Investition, vorausgesetzt, Sie haben bereits einen PC oder Mac: Etwa € 130 (digitales Aufnahmegerät).</p><p>Empfohlene Investition in Aufnahmegeräte: Etwa € 500 (Studio-Kondensator-Mikrofon, USB-Audio-Interface, Studio-Software, geschlossener Kopfhörer).</p><p><strong>Kursaufbau</strong></p><p><strong>Equipment</strong> - Sie erfahren, welches Equipment Sie sich anschaffen müssen und wozu die einzelnen Komponenten gut sind.</p><p><strong>Einleitung</strong> - Sie lernen alles, was Sie theoretisch wissen müssen, um eine professionelle Sprachaufnahme zu erstellen, aber nicht mehr, denn Ihre Zeit ist kostbar. Pareto lässt grüßen!</p><p><strong>Setup</strong> - Sie lernen, wie Sie Ihr Equipment für die Aufnahme bereit machen.</p><p><strong>Aufnahme</strong> - Sie erstellen Ihre erste professionelle Aufnahme.</p><p><strong>Nachbearbeitung -</strong> Mit der Aufnahme alleine ist es nicht getan - Sie müssen Ihre Stimme noch nachbearbeiten.</p><p><strong>Rendering und Formate</strong> - Im letzten Schritt erzeugen Sie die fertige Audio-Datei in verschiedenen Formaten, z.B. als mp3 oder hochauflösende wav-Datei für Ihren Film-Ton.</p><p>Die im Kurs verwendete Studio-Software ist <strong>Logic Pro X</strong> von Apple. Die erklärten Prinzipien sind <strong>auf alle gängigen anderen Softwares und auch Hardware-Lösungen anwendbar</strong>. Zusätzlich gibt es Lektionen zur kostenlosen Software <strong>Audacity</strong>.</p>", 
    "end_date": null, 
    "title": "Sprache professionell aufnehmen", 
    "price": "50.00", 
    "instructors": "Matthias Ernst Holzmann", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467992_c64d_4.jpg", 
    "course_url": "https://www.udemy.com/sprache-professionell-aufnehmen/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-05T06:53:36Z"
}