{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hast du auch schon oft gehört, dass du als Gründer als erstes einen Business Plan schreiben musst? Das stimmt nicht! Bevor du ein Dokument mit mehr als 30 Seiten Text erstellst, solltest du dir vielmehr über die wirklich wesentlichen Aspekte deiner Geschäftsidee bewusst werden und diese schnell und einfach auf ihr Potenzial hin testen. Wenn du das machst, kannst du danach auch einen wirklich überzeugenden Businessplan schreiben.</p>\n\n<p>Im Kurs lernst du, wie du schnell und mit einfachen Mitteln eine erfolgsversprechende Geschäftsidee entwickeln kannst. Da erfolgreiche Gründer bei ihrer Unternehmensgründung auch unbedingt ein zum Angebot (Produkt und / oder Dienstleistung) passendes Geschäftsmodell brauchen, erfährst du zudem, wie du überzeugende Geschäftsmodelle entwickelst. Hier gibt es auch ausreichend Praxisbeispiele sehr erfolgreicher Startups. Letztendlich lernst du, wie du durch den Einsatz effizienter Marktexperimente schon frühzeitig systematisch dein Marktrisiko verringern kannst. Im Kurs lernst du zudem die für Startups wesentlichen Tools Value Proposition Canvas (Wertangebotsleinwand) und Business Model Canvas (Geschäftsmodellleinwand) sowie das Vorgehen nach der Lean Start-up-Methode und Design Thinking kennen.</p>\n\n<p>Nach dem Kurs wirst du feststellen, dass die ersten Schritte zu deinem Start-up nicht mit viel Geld und Risiko verbunden sind. Vielmehr ist wichtig, dass du dich am Anfang deiner Unternehmensgründung auf die wirklich wesentlichen Dinge konzentrierst und systematisch vorgehst.</p>", 
    "end_date": null, 
    "title": "Start-up Basics:  Geschäftsideen entwickeln und testen", 
    "price": "45.00", 
    "instructors": "Dr. Mario Geißler", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569618_3409_4.jpg", 
    "course_url": "https://www.udemy.com/start-up-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T20:44:08Z"
}