{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<!-- ................................................................................................... -->  <h5>About the Course:</h5>  <p>  \t <strong style=\"\">The Founder Institute is giving you \"Startup and Go\" – a crash course on the initial steps to creating a meaningful and enduring technology company.</strong>  </p>  <p>  \t \"Startup and Go\" is a collection of talks from the very beginning of the <a class=\"external-link\" href=\"http://fi.co/r/udemy\" rel=\"nofollow\" style=\"\" target=\"_blank\">Founder Institute’s startup accelerator program</a> - which, in just 4.5 years, has launched over 1000 technology companies across 55 cities and 6 continents. Taught by some of the program’s highest-rated Mentors, this course helps you create a strong foundation for a technology startup – from a properly vetted and researched idea, to a strong initial team. We’ve also included some follow-on assignments to help you turn these lessons into immediate action. The goal? To help you  come up with smart business ideas and provide you the basic business development training to finally create the business you’ve been dreaming of. Startup and Go build your dream company. This course includes three topics - Startup Ideation, Startup Research, and Startup Hiring, Firing &amp; Co-Founders.  </p>  <!-- ................................................................................................... -->  <h5>Lecture 1: \"Startup Ideation – Ideas, Vision, and Values\"</h5>  <p>  \t We all have many \"great\" ideas, but how do we best choose which one to pursue? What are the components of a good technology business idea? What is your key differentiator? What type of business will you build? How will you make money? Can you quickly articulate your idea?  </p>  <h5>Lectures:</h5>  <ul style=\"\">  \t<li><strong style=\"\">Phil Libin – \"So You Want to be an Entrepreneur?\"</strong><br style=\"\">  \t  Phil Libin is the CEO of <a class=\"external-link\" href=\"http://evernote.com\" rel=\"nofollow\" style=\"\" target=\"_blank\">Evernote</a>, a web service designed to allow users to easily capture and store information, memories, and content in any environment. Phil was a founder of two other successful tech startups, is an investor and advisor in several startups, is the inventor of several issued and pending technology patents, and holds a top-secret security clearance from the Department of Defense.</li>  </ul>  <!-- ................................................................................................... -->  <h5>Lecture 2: \"Startup Research\"</h5>  <p>  \t Almost any entrepreneur can play with some numbers and say \"our market is worth billions of dollars\" – but what is your actual serviceable market? Is your target market big enough? And growing fast enough? Where can you find this information, and how should you interpret it?  </p>  <h5>Lectures:</h5>  <ul style=\"\">  \t<li><strong style=\"\">Jim Kaskade – \"Get used to Startup Research – You Never Stop Performing It\"</strong><br style=\"\">  \t  Jim Kaskade has been a successful CEO of 10 years, and an expert in large data warehouse systems for another 10 years. He's recently been immersed in Cloud Computing, having built and scaled his own digital media SaaS company, serving over 10,000 SMB businesses. Currently, Jim is the GM and Chief of Cloud at <a class=\"external-link\" href=\"http://sios.com\" rel=\"nofollow\" style=\"\" target=\"_blank\">SIOS Technology Corporation</a>.</li>  \t<li><strong style=\"\">Joe Betts-Lacroix – \"Ideas are Dangerous\"</strong><br style=\"\">  \t  Joe Betts-LaCroix founded <a class=\"external-link\" href=\"http://oqo.com\" rel=\"nofollow\" style=\"\" target=\"_blank\">OQO</a>, creator of the world’s smallest PC, in 2000, and established the resulting market category of smaller-than-laptop PCs, now called UMPCs, netbooks, etc. Joe has patents pending and granted for over 80 inventions in a diversity of fields, ranging from electronic methods to user interfaces to cleantech.</li>  \t<li><strong style=\"\">Dan Shapiro – \"Gathering Online Feedback for your Startup\"</strong><br style=\"\">  \t  Dan Shapiro is the founder and CEO of Sparkbuy Inc, a comparison shopping website recently acquired by Google. Previously, Shapiro was founder and CEO of Ontela, a pioneering mobile imaging company, where he was named CEO of the Year by MobileBeat. Ontela was frequently recognized including the Dow Jones Top 10 in Wireless list, receiving the CTIA award for Best Social Networking Application, and being named Breakthrough Startup of the Year by the WTIA. Ontela merged with Photobucket in December of 2009 where Shapiro now holds a seat on the Board of Directors.</li>  </ul>  <!-- ................................................................................................... -->  <h5>Lecture 3: Startup Hiring, Firing, &amp; Co-Founders</h5>  <p>  \t Your dream company requires a dream team. But how can you find and convince great talent to take a chance on your idea? Who should you hire at the garage, seed, and funded stages? What types of management structure work best for tech startups? If you raise money, how will investors be involved?  </p>  <h5>Lectures:</h5>  <ul style=\"\">  \t<li><strong style=\"\">Jonathan Abrams – \"Hire Based on Passion and Future Performance\"</strong><br style=\"\">  \t  Jonathan Abrams is the founder and CEO of Nuzzel, and Co-Founder and Managing Partner of the <a class=\"external-link\" href=\"http://www.foundersden.com/\" rel=\"nofollow\" style=\"\" target=\"_blank\">Founders Den</a>. Previously Jonathan was the Founder and CEO of Socializr, Friendster, and HotLinks. Jonathan was hailed as \"The Social Pioneer\" by Vanity Fair in June 2008 for creating the pioneering social networking service Friendster, and was also honored as one of the world’s top young innovators by the MIT Technology Review.</li>  \t<li><strong style=\"\">Aaron Patzer – \"Hiring – Your Biggest Differentiator\"</strong><br style=\"\">  \t  Aaron Patzer is both the visionary and technical mind behind <a class=\"external-link\" href=\"http://mint.com\" rel=\"nofollow\" style=\"\" target=\"_blank\">Mint.com</a>, now the leading free, online money management tool in the U.S., and purchased by Intuit for $187mm in 2009. In 2008 he was named one of CNN Money's \"Money Heroes\", and a World Economic Forum Tech Pioneer. In 2009, he was named to Inc Magazine's Top 30 Entrepreneurs Under 30, and Fortune's Top 40 Business Leaders Under 40.</li>  \t<li><strong style=\"\">Jim Franklin – \"Hire on Values, Fire on Values\"</strong><br style=\"\">  \t  Jim is the CEO of <a class=\"external-link\" href=\"http://sendgrid.com\" rel=\"nofollow\" style=\"\" target=\"_blank\">SendGrid</a>, the leader in email deliverability. Previously, James Franklin was the VP and General Manager of the Crystal Ball Global Business Unit and the VP for Enterprise Performance Management for Oracle Corporation. Previously Jim was the CEO of Decisioneering, Inc., CFO at Vericept Corporation and was a founder of webfamilies.com. Jim has also served as a mentor for Boulder TechStars, runs the Founder Institute Denver Chapter, and has invested in early stage startups.</li>  </ul>  <p>  \t <strong style=\"\">So what are you waiting for? Startup and Go!</strong>  </p>  <p>  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <h5>About the Founder Institute</h5>  <p>  \t <a class=\"external-link\" href=\"http://fi.co/r/udemy\" rel=\"nofollow\" style=\"\" target=\"_blank\">The Founder Institute</a> is the world’s largest entrepreneur training and startup launch program, helping aspiring founders across the globe build enduring technology companies. In the Founder Institute's four-month, part-time program, promising startup entrepreneurs “learn by doing” and launch a company through structured training courses, practical business-building assignments, and expert feedback from a large network of business mentors. Plus, aspiring founders are not required to quit their day job to participate, so they can begin building a business around their ideas without putting their livelihood at risk.  </p>  <p>  \tFor more information, visit <a class=\"external-link\" href=\"http://fi.co/r/udemy\" rel=\"nofollow\" style=\"\" target=\"_blank\">http://fi.co</a>.  </p>", 
    "end_date": null, 
    "title": "Startup & Go - First Steps to Building a Technology Company ", 
    "price": "50.00", 
    "instructors": "Founder  Institute", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/6706_c36c_7.jpg", 
    "course_url": "https://www.udemy.com/startup-and-go/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-02-11T01:24:23Z"
}