{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">What is this course about?</strong>  </p>  <p>  \t          The startup idea can make or break a startup. Ideas alone don&#039;t make a startup but picking the best idea for you to work on will get you off onto a good start.  </p>  <p>  \t          This course will give you a big picture view and an in-depth insight into what makes the best startup ideas for you. It will introduce you to some fundamental and essential concepts about ideation for startups that you must grasp before you embark on your startup journey.  </p>  <p>  \t          This course is all about concepts and insights. It’s more of a <em style=\"\">how-to-think</em> course than a <em style=\"\">how-to-do</em> course. It was developed as the precursor part of a more comprehensive course called &quot;Think like an entrepreneur&quot; that I will be launching shortly. I decided to offer the Ideation part of the course as a standalone course for free for a limited time to make it more accessible.  </p>  <p>  \t<strong style=\"\">Why take this course? </strong>  </p>  <p>  \t          Picking the right startup idea to work on will speed up your learning curve and save you a lot of time and heartache learning the hard way.  </p>  <p>  \t          There is a huge opportunity cost in picking the best startup idea to work on - it takes an enormous amount of time, energy, money, focus and dedication to execute a startup idea. You don&#039;t want to settle for anything less than the most worthy startup idea for you.  </p>  <p>  \t          By the end of this course, if you have fully assimilated the concepts, you will know what makes the best startup idea for you and where to find it.  </p>  <p>  \t<strong style=\"\">How is the course structured?</strong>  </p>  <p>  \t          This course is divided into core concept sections. Each lecture introduces you to an essential concept or idea. Putting all the pieces together with each lecture will give you a big picture overview and a more in-depth understanding of what makes the best startup idea and how to come up with one for you.  </p>  <p>  \t<strong style=\"\">How long will the course take to complete?</strong>  </p>  <p>  \t          The course has about a full hour of video material. I&#039;ve chosen to focus on core concepts to keep the lectures short and to the point. The lectures may be short but they pack a punch. I would highly recommend that you take your time to fully assimilate the material and apply it to your own case, own each concept and idea introduced in each lecture before moving on to the next.  </p>  <p>  \t          The lectures within each section tend to flow and follow from the previous one. A good recommended pace would be to take on one section in one sitting. You can easily complete the entire course in a week or in a day!  </p>", 
    "end_date": null, 
    "title": "Startup Ideation: What you need to know to get an edge", 
    "price": "20.00", 
    "instructors": "Judith Zen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/244412_9c8f_2.jpg", 
    "course_url": "https://www.udemy.com/startup-ideation/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-16T20:19:15Z"
}