{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you looking to start a new company, stuck on a business plan, overwhelmed by incorporating or having a hard time writing a fair partnership agreement?</p>  <p> Well don’t worry you are in the right place!</p>  <p>No matter what stage you are at I promise this course will revolutionize the way envision a corporation.</p>  <p><strong>How does this work?</strong></p>  <p>You'll be given <em>immediate</em> access to all the lectures and content for this course. Mostly composed of video lectures, that were designed to be <strong><em>engaging</em></strong> and <strong><em>fast paced</em></strong>. Nothing is worse than poor quality, hard to understand audio, with mind numbing, boring slides that drag on and on. This course was design to be <strong><em>painless</em></strong>, something you'll <strong><em>enjoy</em></strong>, and something you'll actually <strong><em>finish</em></strong>.</p>  <p>The course is split into 2 main parts that will walk you through the content in easy-to-follow steps.</p>  <p>Starting with the basics, I'll show you exactly how to access your prospected market, determine workforce and capital requirements as well how to split company equity. </p>  <p>Once you understand the basics we will learn the free market economic theory that supports our business plan and explore the implications and affects the market has on a corporation.</p>    <p>After you are fluent in the terminology, I'll show you how to apply the knowledge to create the perfect business plan. </p>    <p>Finally we will enforce the aspects of the business plan through a partnership agreement.</p>    <p>As a <strong><em>bonus,</em></strong> you will get the complete business plan and partnership plan templates for free.</p>  <p>Are you ready to structure your dream company for success? Empower yourself with the ability and knowledge to create a sustainable business? Being your exciting new adventure today!</p>", 
    "end_date": null, 
    "title": "Starting a Business: Plans & Partnership Agreements", 
    "price": "20.00", 
    "instructors": "Kurt Bihelek", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606314_31fd_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-a-business-plan-partnership-agreement/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T20:42:21Z"
}