{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Are You Afraid to Start your Startup: Grab the Frameworks You Need to Succeed as a Startup Entrepreneur and Get Going!</em></strong></p>  <p>  \t        +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<em>+++</em></p><p><em></em>This Introductory Startup Course covers 36 Major Issues which are critical to startups.</p>  <p>  \t                                 If you are considering a Startup and do not know where to start...start here!  </p>  <p>  \t                                 I create a 6x6 Matrix of Topics which I describe in brief detail to give you the basics from which to build your knowledge of Startups.  Through this simple and easy to understand approach, I will discuss the Six Most Important Topics relating to Startups:  </p>  <p>  \t<strong>1. Startup Market</strong>  </p>  <p>  \t<strong>2. The Importance of Profit in Your Startup</strong>  </p>  <p>  \t<strong>3. Startup Plan</strong>  </p>  <p>  \t<strong>4. Raising Startup Capital</strong>  </p>  <p>  \t<strong>5. How to Value your Startup</strong>  </p>  <p>  \t<strong>6. Startup Investors</strong>  </p>  <p>  \t                                 I have provided a Video of each Topic, with a downloadable Slide Deck in PDF Format.  I also include a PDF at the end with a text summary of all the issues covered so that you have a checklist to take away.  </p>  <p>  \t                   ******************************************************************************************************  </p>  <p>  \t<strong>\"Good and Clear Information - It gives you a good idea of what to expect from, when you are creating a new business, doing the start-up process and it's a excellent entry to the course Entrepreneurs Guide to Start-up Funding\" </strong>  </p>  <p>  \t<strong><em>Mario Valadas</em></strong>  </p>  <p>  \t                   ******************************************************************************************************  </p>  <p>  \t                                 The Course should take no more than 45 minutes.  </p>  <p>  \t                                 If you want to start learning about Startups, this introductory course is simple and straightforward and will introduce you to 36 of the major topics you will need to learn about if you are serious about Startups.  </p>  <p>  \t                               At the end of the Course, you will find a Special Offer (Discount Code) for my more in-depth Udemy Course, Startup Funding: Pitch and Raise Finance for your Startup  </p>    <p>  \t                   ******************************************************************************************************  </p>  <p>  \t<strong>\"A clearly communicated, well curated guide that delivers a nice summary of the most important elements to consider before creating a startup. I've put a lot of time, research, and creative brain-storming into a hopelessly long business &amp; marketing plans. Taking this course helped me to remind me to focus on the most important elements and remove the clutter. It's not intended to give you everything you need to get started but it will give you an idea of the process and point you in the right direction for anything you're missing.\"</strong>  </p>  <p>  \t<strong><em>George Maier</em></strong>  </p>  <p>  \t                   ******************************************************************************************************  </p>  <p>  \t<strong>         Have I missed a Startup topic you would like covered?</strong>  </p>  <p>  \t<strong>         Have a question relating to this Startup course?</strong>  </p>  <p>  \t<strong>         Message me here on Udemy!</strong>  </p>  <p>  \t                     Please don't forget to leave me a positive review and a rating if you think it is appropriate to do so. :)  </p>", 
    "end_date": null, 
    "title": "Startup Essentials Advice New Founders Need To Know Now", 
    "price": "20.00", 
    "instructors": "John Colley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/82774_bc4c_8.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurs-introduction-to-startups/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-23T15:13:47Z"
}