{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  The goal of this course is to show you how to start a business with the Internet.  If you have an idea, skill, talent or product, I will show you how to build a platform quickly to see if you can turn it into a business.  If you can show proof of concept with your service or product and you start to make money then I will show you how to turn your platform into a business.  </p>  <p>  \t  First I will show you how to <strong style=\"\">create your own website</strong> so you don&#039;t have to worry about hiring a developer.</p><p>1) First I will show you how to purchase a domain and website hosting</p><p>2) Then I will show you how to use Wordpress so you can create your own website.  This will allow you to quickly make updates on your own.</p><p>The <strong style=\"\">platform and plugins I recommend</strong> you use to follow along is <strong style=\"\">WordPress</strong> and the <strong style=\"\">Visual Composer</strong> plugin. <strong style=\"\"> </strong></p>  <p>  \t  In an upcoming section, I will will show you how to optimize your website using search engine optimization to see your service or product. I will show you step by step instructions so you don&#039;t have to hire an SEO specialist to get noticed by the search engines.</p><p>1) You will learn on-page optimization and receive a checklist in the form of a PDF to use for the SEO process.</p><p>2) You will learn about the importance of external signals like Citations, Link Earning, Reviews and Social Media.</p>  <p>  \t  Also in an upcoming section, I will show you how to turn your platform into a business.  Once you prove that you can start making money, we&#039;ll review how to make your business more professional.  Many companies fail because they spend too much time and money perfecting a product/service that has no proof of concept.  Also spending money on setting up a business is an expense that can hold you back if your startup is a bootstrap strategy.  </p><p>1) You will learn different ways to incorporate your business</p><p>2) You will learn specific techniques to setup your business so you look professional to your potential clients</p>  <p>  \t  The strategy that worked for me in building my company is to take an idea, produce the minimum viable product that I could sell and get it on the market as fast as possible.  Then as we start making sales we are constantly updating and making our service/product better.  </p>  <p>  \tThis course has currently over an hour and a half of video content and I will be adding much more video in the future.  </p>  <p>  \tYou should join this course if you want to start a business and you want to do it with the least amount of financial risk.  I will show you how to build a business on your own or with a partner.</p>  <p>  \tThis course is for go-getters who want to succeed and have a dream of running there own business!  You must be willing to where a lot of hats.  I also encourage partnerships if you have a love one, a good friend or close associate.  Sometimes it&#039;s easier to climb the mountain with a partner.  This way you can share the workload and be there to push each other.</p>  <p>  \tI encourage everyone who signs up to send me recommendation of future lessons that can answer questions along the way to help you build your business.  Everyone who signs up will be able to communicate with me personally!  I look forward to seeing you inside the course!  </p>", 
    "end_date": null, 
    "title": "Start A Business With The Internet", 
    "price": "20.00", 
    "instructors": "Nick Marks", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206806_62fa_3.jpg", 
    "course_url": "https://www.udemy.com/start-a-business-with-the-internet/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-28T21:09:00Z"
}