{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Running a web design business is an amazing entrepreneurial springboard to other opportunities. </p><p>Both of us, Zach Swinehart and Rob Cubbon, started web design businesses and successfully removed ourselves from the day-to-day running of the business and built teams. This has enabled us to scale our revenues to <em>over six-figures each</em>. We both travel while working on our lifestyle businesses. </p><p>But it wasn't always easy! We've both had challenges along the way and therefore we will talk about every stage of the web design business: setting up, getting clients, running and, eventually, growing. </p><p>Firstly we explain how you can start your business:</p><ul><li>how to think of a name and domain name for your business</li><li>how to set up a business’s finances</li><li>action steps for building or improving your website</li><li>how to differentiate and determine your niche</li><li>and setting business goals for the future</li></ul><p>Then we give you great ideas about finding clients:</p><ul><li>long term strategies like blogging and building online authority as well as networking to get clients</li><li>How to incentivize word-of-mouth referrals</li><li>We’re also going to give you some quick win ideas so you can get clients now!</li><li>Craig’s List</li><li>BNI</li><li>Cold calling</li><li>purchasing leads</li><li>and what to say on the sales call</li></ul><p>With those clients safely in the bag, we go on to how to successfully run the business:</p><ul><li>how to map out and clarify the project scope</li><li>how to simplify the dialog with the client to minimize problems</li><li>we have sample proposals, contracts and invoices for you to download and instructions on how to proceed through the project and how to ensure you're paid properly and on time</li></ul><p>Finally we’ll talk about growing the business:</p><ul><li>How you can pivot the web design business to earn more passive income through digital product sales.</li><li>And how you can outsource and remove yourself from the business so that you can scale the business and do less of the work yourself so you are free to live the amazing lifestyle that we enjoy.</li></ul><p>As you can see, this course gives you a behind-the-scenes look at the exact strategies Zach and Rob have employed to build fantastic lifestyle businesses. So what are you waiting for? Come join us!!</p>", 
    "end_date": null, 
    "title": "Starting, Running and Growing a Web Design Business", 
    "price": "30.00", 
    "instructors": "Rob Cubbon, Zach Swinehart", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690284_b512.jpg", 
    "course_url": "https://www.udemy.com/starting-running-and-growing-a-web-design-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T12:53:29Z"
}