{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        There&#039;s never been a better time to create a freedom-based lifestyle as a freelance copywriter. Why? Because more and more businesses are discovering that marketing themselves with great content--including videos, podcasts, webinars, social media, etc.--is how they&#039;re going to stand out from competitors. And, who do they need to create this content? Copywriters!  </p>  <p>  \t        Instead of smothering your ambition to launch a freelance copywriting business in an avalanche of details, I&#039;ve designed this course to give you ONLY the essentials of what you need to get up and going fast. It&#039;s based on what I&#039;ve learned during 10+ years a successful freelance copywriter--so I know it works! You&#039;ll learn:  </p>  <ul style=\"\">  \t<li>Why a freelance copywriting business is the ideal freedom-based business </li>  \t<li>Who you need on your &quot;team&quot; to maximize the success of your business</li>  \t<li>How to set up your workspace for optimal performance</li>  \t<li>How to set fees focused on rewarding you for what you do instead of undercutting the competition</li>  \t<li>How to set yourself apart from other copywriters and become the &quot;go-to&quot; choice for clients</li>  \t<li>What you need to include within a copywriting business website</li>  \t<li>Where clients are and how to get them</li>  \t<li>How to build and maintain productive and profitable client relationships</li>  </ul>  <p>  \t    In addition to video lectures, I&#039;ve also included downloadable checklists that will help you get organized, stay focused and LAUNCH YOUR BUSINESS! I&#039;ll be adding materials as we go along.  </p>  <p>  \tReady? Let&#039;s go!<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Starting a Freelance Copywriting Business  ", 
    "price": "45.00", 
    "instructors": "Kara Michele Lashley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319670_0a3c_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-launch-a-copywriting-business-that-works-for-you/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T19:05:29Z"
}