{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Many inventors just sit on their idea because they don’t know where to start, or they’re worried someone will rip them off.  This introductory course is designed to get the inventor “un-stuck,” teaching you a 4-step plan to get your idea off and running.  </p>  <p style=\"\">  \t<strong style=\"\">Learn the First 4 Critical Steps to Launching an Invention or New Product Idea</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Document </strong>a foundation for a provisional patent application</li>  \t<li style=\"\"><strong style=\"\">Research</strong> the market and related patents to see if your idea is novel</li>  \t<li style=\"\"><strong style=\"\">Prototype</strong> the product to get a working model and learn how to make it</li>  \t<li style=\"\"><strong style=\"\">Strategize</strong> to determine the best way to monetize your invention</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Find Out What Gets Inventors Stuck and How to Keep Your Idea Moving Forward</strong>  </p>  <p style=\"\">  \t   We&#039;ve all heard stories about inventors getting ripped off, but there are steps you can take to reduce your risk.  The first step is to get started on proper documentation, the start of a provisional patent application. Once filed, this will give you a year of “Patent Pending” status.  You will also learn about the two key agreements you can use to protect your rights before your application is filed.  </p>  <p style=\"\">  \t   We’ll show you free Internet resources you can use to scan the market and the patent literature to see if your idea is novel.  If you don’t know how to make a prototype, this course will point you towards local and internet resources that can help you get started on building a working model.  </p>  <p style=\"\">  \t   Finally, you need to know if they’re going to make and sell this product yourself, or if you’re going to license it to a company that’s already selling products in this market.  At the end of this course you will have a basic road map to turn your invention into a revenue stream.  </p>", 
    "end_date": null, 
    "title": "Start Inventing: First 4 Steps for Inventors & Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Kevin Prince", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338842_d59b_3.jpg", 
    "course_url": "https://www.udemy.com/inventing-101-first-4-steps-for-the-inventor-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T21:40:18Z"
}