{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t     Startup Steroids walks you through a new approach that will help business founders, idea generators, entrepreneurs, intrapreneurs or business innovators in finding their way to launch a successful product.  </p>  <p style=\"\">  \t     The course starts by synthesizing the idea into a visionary statement that could be used as a guide during the whole process and then deep dives into the three main aspects that compose an idea for a product: People, their Activities and the Context of those activities.  </p>  <p style=\"\">  \t     Each of the three areas is developed as a stand-alone steroid.  </p>  <p style=\"\">  \t     A steroid is a single piece that you can take to enhance your thinking on a topic and improve the way you approach a better solution. With each steroid you gain extra knowledge and understanding of your customers, needs, expectations and competitor landscape. You will start developing new insightful ideas that will help you to move forward in the right direction to satisfy your customers.  </p>  <p style=\"\">  \t     The model for Startup Steroids has been synthesized during the last years based on my own experience with Service Design, Design Thinking, Customer Experience and the Lean methodologies. It simplifies and adds order to help evolve the thinking of a team creating a product that suits customer needs.  </p>  <p style=\"\">  \t     It&#039;s absolutely compatible with Lean Canvas and Business Model Canvas, indeed it would help you to fill out and discover most of the areas of those canvases.  </p>  <p style=\"\">  \t     This is an experiential course that would provide lectures explaining each of the three steroids together with examples on how to use the proposed tools. You will need to use your own team and ideas to put what you learn in practice!  </p>  <p style=\"\">  \t     If doesn&#039;t matter if you are a business founder with existing experience or a software developer that starts to create a new business, in both cases you will learn how to look at customers and their needs through a different lens.  </p>  <p style=\"\">  \t     You will get unlimited access to the course materials, templates and tools.  </p>  <p style=\"\">  \t I will be available during the week to answer questions and help you with doubts on how to use the proposed tools or apply them to your context.  </p>  <p style=\"\">  \t <strong style=\"\">EXTRA GIFT: </strong>You will get a free digital copy of the upcoming book &quot;Startup Steroids&quot; that collects and evolves all the thinking, tools and processes outlined in this course.  </p>  <p style=\"\">  \t <strong style=\"\">SIDE EFFECTS BONUSES: </strong>A new lesson will be published under the Side Effects lesson after each bundle of 100 students enroll in the course. This bonus lessons will include topics like:  </p>  <ul style=\"\">  \t<li style=\"\">How to integrate with Lean Canvas</li>  \t<li style=\"\">How to tell a compelling Product Story</li>  \t<li style=\"\">How to use Steroids with existing products</li>  \t<li style=\"\">How to integrate with Business Model Canvas</li>  \t<li style=\"\">How to create a Product Explainer Video</li>  \t<li style=\"\">and much more!!!</li>  </ul>", 
    "end_date": null, 
    "title": "Startup Steroids", 
    "price": "20.00", 
    "instructors": "Miguel Jiménez", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/113394_259f_3.jpg", 
    "course_url": "https://www.udemy.com/startup-steroids/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-31T17:29:32Z"
}