{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t     If you&rsquo;re thinking about starting a business, there is no time like the present! Never have there been so many opportunities.  </p>  <p style=\"\">  \t     However, the failure rate for <em style=\"\">new</em> businesses is high &ndash; some say as high as 90% in the first year. And, the economy and competition, not just locally but globally is also making it even more difficult. So you need something to help you beat the odds &ndash; and the &ldquo;7 Secrets of Successful Business Owners&rdquo; can help!  </p>  <p style=\"\">  \t     I have over 20 years&rsquo; experience working with business owners and I designed this class to give you a glimpse into some of the elements necessary to build a successful business today so that if you decide to take the leap, you will have a solid foundation to start with. In less than one-hour <em style=\"\">(no fluff included)</em>, I will share 7 secrets and how to structure them in your business plan or incorporate them into your existing business. The 7 secrets work whether you have a product, a service or a combination of the two.  </p>  <p style=\"\">  \t     So what does it take to build a successful business today&hellip;one that can stand the test of time? I&rsquo;ll provide some of the answers in this class as we explore each of the 7 secrets. I&rsquo;ll also include some examples, some <em style=\"\">do&rsquo;s</em> and <em style=\"\">don&rsquo;ts</em> and give you the opportunity to start working on your business idea with exercises and worksheets.  </p>  <p style=\"\">  \t     So let&rsquo;s not waste another minute, let&rsquo;s get started!  </p>", 
    "end_date": null, 
    "title": "Start-Up Strategies: 7 Secrets of Successful Business Owners", 
    "price": "45.00", 
    "instructors": "Patricia Stallworth", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/144066_14a7_10.jpg", 
    "course_url": "https://www.udemy.com/start-up-strategies-7-secrets-of-successful-business-owners/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-08T16:24:47Z"
}