{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Do you want to sell your products on Amazon?</strong>  </p>  <p>  \t                                We'll show you how to design your own products, manufacture them, and then sell them on Amazon.  We'll also show you how to utilize Amazon's FBA service that allows you to send all your products to Amazon's warehouse.  When a customer purchases a product, Amazon will automatically ship it to the customer, charge them, and handle all the customer service...so you basically don't have to do much other than collect the paychecks every month.</p>  <p>  \t<em style=\"\">Amazon Seller Testimonials</em>  </p>  <p>  \t          \"I'm 25 years old, and Amazon has allowed me to build a company that's grossed over a million dollars so far.\" -Joel Michael, Owner, Cruzerlite Wireless  </p>  <p>  \t  \"I have the income and freedom I always wanted. More freedom than I could have ever imagined.\" - Kathy Wojtczak, Owner, Element Jewelry  </p>  <ul style=\"\">  </ul>  <p>  \t<strong style=\"\">What will you learn in this course?</strong>  </p>  <p>  \t          We'll teach you the same strategies that sellers have used.  For example, you'll learn...  </p>  <p>  \t                      * How to design your own products  </p>  <p>  \t                      * How to manufacture your product  </p>  <p>  \t                      * How to display your product in a compelling way  </p>  <p>  \t                      * How to make your product appear whenever people search for it on Amazon  </p>  <p>  \t                      * How to increase your product rating  </p>  <p>  \t                      * How to automate your business so you can do more in less time  </p>  <p>  \t                      * How to set up your own company  </p>  <p style=\"\">  \t<strong style=\"\">Why take this course instead of other courses?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">HIGH-DEF - The course uses high definition 1080p video, music, illustrations, and humor in order to make the concepts more memorable and engaging.</li>  \t<li style=\"\">SAVES YOU TIME - We have worked very hard to make the course as concise and crisp as possible. We want you to learn as quickly as possible and spend your time actually managing your Amazon business.</li>  </ul>  <p>  \t<strong style=\"\">Course Reviews</strong></p>  <p style=\"\">  \t                        \"This course outlined and described every step necessary to sell well on Amazon--including tips and suggestions which I wouldn't have thought of otherwise. Clear graphics, clear narration, and entertaining!\" - Elizabeth Berkowitz  </p>  <p style=\"\">  \t                        \"I'm not a native English speaker, so some times I have a hard time understanding recorded lectures, but this one was very easy to comprehend. I think all the information is very valuable and well put through the course, making it easy to absorb all of it. I highly recommend it.\"  -  Cintia Higashi  </p>  <p style=\"\">  \t                        \"This course really helps the whole process of selling products on Amazon. It covers from basic stuff like setting up a corporate bank account to more in-depth things like branding, marketing, and being sponsored. Later part of this course is very specific about Amazon selling, I think this step by step know-how will be valuable for people who begins.\" - Haewon  </p>  <p style=\"\">  \t<strong style=\"\">100% Satisfaction Guarantee</strong>  </p>  <p style=\"\">  \t                        We are certain that you will be satisfied with this program and offer a 30-day money back guarantee.</p>  <blockquote style=\"\">  </blockquote>", 
    "end_date": null, 
    "title": "Start Your Own Business Offering Products on Amazon", 
    "price": "50.00", 
    "instructors": "Millionaire Drive", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354514_5b9b_4.jpg", 
    "course_url": "https://www.udemy.com/amazonsalesbootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T14:56:39Z"
}