{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em style=\"\"><strong style=\"\">On Sale Until 27th May, Price Rise to $197</strong></em>  </p>  <p>  \tHave you noticed those T-Shirt ads popping up on Facebook that show the year you were born, or maybe your favorite football team? Surely you have. And someone is making money out of them! So why shouldn't it be you?  </p>  <p>  \t    There's a lot of talk about the Teespring platform at the moment, but not a lot of information out there about how people are <em style=\"\">really making any money</em> of it. The beauty of Teespring is that give you a complete solution to sell your own shirts, tank tops, hoodies and jackets online. They provide the website, handle the payments, print and post the shirts and pay you your profit!  </p>  <p>  \t    But without a proper system to follow, you could <em style=\"\">easily waste thousands of dollars </em>marketing the wrong designs, or to the wrong audience. The Easy Teespring Profit System uncovers a proven strategy, that will guide you step-by-step through the right process to build your own online business selling t-shirts online using the Teespring platform.  </p>  <p>  \t    In this easy to follow course, you're going to learn:  </p>  <ul style=\"\">  \t<li style=\"\">What Is Teespring and Why is it such a powerful platform</li>  \t<li style=\"\">How to find the hottest selling niches</li>  \t<li style=\"\">Where you can get your shirt ideas designed dirt cheap</li>  \t<li style=\"\">How to set up a winning Teespring campaign</li>  \t<li style=\"\">Killer tips to promote your shirt with Facebook and other social media</li>  \t<li style=\"\">And leveraging your design to make extra money on other platforms</li>  </ul>  <p>  \t    With <em style=\"\">over three hours</em> of video training, split up into short, easy sections, the Easy Teespring Profit System will have you ready to start your own online clothing business in no time at all.  </p>  <p>  \t    So what are you waiting for? <em style=\"\">Sign up today!</em>  </p>", 
    "end_date": null, 
    "title": "Start Creating and Selling T-Shirts on Teespring", 
    "price": "20.00", 
    "instructors": "Michael Shane", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/407598_5cae_2.jpg", 
    "course_url": "https://www.udemy.com/teespring-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-29T08:41:10Z"
}