{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">\t<em>The Ultimate StartUp course is here for you:</em>  </p>  <p>\t<strong>Please Note: All students to this course will be able to ask questions to investors, entrepreneurs and consultants for free!</strong>  </p>  <p>\t<strong><br style=\"\">\t</strong>  </p>  <p>\t<strong>GET THE HELP YOU NEED AND START YOUR COMPANY TODAY!</strong>  </p>  <p style=\"\">\t<strong>Do you want to meet and interact with successful investors, entrepreneurs and consultants to get immediate assistance on how to create your own company?</strong>  </p>  <p style=\"\">\t<strong><br style=\"\">\t</strong>  </p>  <p style=\"\">\t<em><strong>&gt;&gt; </strong>Important notes:</em>  </p>  <ul>\t<li>Initial price is <strong>$139</strong>, but will next increase to <strong>$239</strong> January<strong> 1st 2016</strong>)</li>\t<li>New lectures and updates</li>\t<li>Full 30 day money-back-in-full guarantee</li>\t<li>Support</li>\t<li>Udemy Premium Teachers: <strong>Christos Pittis</strong>, <strong>Alex Genadinik</strong> and <strong>Jerry Banfield</strong> have More than <strong>58,000 students</strong> in total joined our courses and <strong>479+ reviews and ratings &lt;&lt;</strong></li>  </ul>  <p style=\"\">\t If you answered yes, this is the course for you.</p>  <p style=\"\">\t It is a common dream for many people to get a business off the ground. The problem is that it takes a lot of knowledge, expertise, and practical hands-on experience to achieve your highest potential.</p>  <p>\t<strong>In summary, if you are going to create a business, StartUp Success Stories: Tips for creating your own startup contains what you need to know. I hope you are ready to get started with what could potentially be the first step to success.</strong>  </p>  <p>\t<strong><br style=\"\">\t</strong>  </p>  <p style=\"\">\t It's easy to want to start your own business, however the skill set you will need is extremely unique. Owning a business requires you to do the majority – if not all – of the work unless you get a partner early on.</p>  <p style=\"\">\t In this course, you will be able to access a large selection of interviews from influential entrepreneurs, investors, and consultants. You will be able to listen to their wisdom, and absorb what they say. The goal is for you to gain a better perspective of how to operate a great business.</p>  <p style=\"\">\t It takes years to acquire the insight that the interviewees share with you in this course. That's why having the opportunity to learn from educated and experienced businesspeople is so important. Instead of diving into a venture head-first, consider learning from the best.</p>  <p style=\"\">\t By claiming a seat in <strong>StartUp Success Stories: Tips for creating your own startup</strong>, you will be exposed to the opinions of the following professionals:</p>  <ul>\t<p style=\"\">\t\t ·<strong>Christopher Jonet</strong> – operates the most renowned archery shop in his area. \t</p>\t<p style=\"\">\t\t ·<strong>Dave Kaster</strong> – 15 years of experience in financial consulting. \t</p>\t<p style=\"\">\t\t ·<strong>Carlos Flores</strong> – decades of experience in business consulting and investing. \t</p>\t<p style=\"\">\t\t ·<strong>Doros Kyriakoulis</strong> – inventor of a hot product, the GoKey. \t</p>\t<p style=\"\">\t\t ·<strong>Chase Hughes</strong> – a young business advisor who explains how to make it in a cut-throat industry. \t</p>\t<p style=\"\">\t\t ·<strong>Alex Genadinik</strong> – seasoned entrepreneur who has seen it all. \t</p>\t<p style=\"\">\t\t ·<strong>Jerry Banfield</strong> – motivated and hungry, Banfield exemplifies the attitude required for success. \t</p>\t<p style=\"\">\t\t ·<strong>Michalis Virardi</strong> – an influential business consultant with strong background in teamwork and satisfaction. \t</p>\t<p>\t\t ·<strong>Stylianos Lambrou</strong> – began entrepreneurship at a young age. Currently, he runs 3 profitable businesses. \t</p>  </ul>  <p style=\"\">\t In this course, you will learn what it takes to be successful. Learning the characteristics and the mindset which generates success is crucial. You will be exposed to individuals who discuss their mentality behind business and life in general.</p>  <p style=\"\">\t In addition to learning how to run a business, knowing how not to run a business is equally as important. Knowing where you can run into trouble and how to avoid it will greatly increase your chances of success. You will learn about the most significant pitfalls and how to avoid them.</p>  <p style=\"\">\t To get an idea of the structure of these interviews, these are some of the typical questions I pose to the entrepreneurs, investors, and consultants:</p>  <ul>\t<p style=\"\">\t\t ·Tell us about your business. \t</p>\t<p style=\"\">\t\t ·How did you finance your business? \t</p>\t<p style=\"\">\t\t ·How did you get into entrepreneurship? \t</p>\t<p style=\"\">\t\t ·How did you fund this business? \t</p>\t<p style=\"\">\t\t ·What are the best businesses to start? \t</p>\t<p style=\"\">\t\t ·What advice would you give to new entrepreneurs? \t</p>  </ul>  <p style=\"\">\t Whether you are building a small venture which will provide you enough money to live, or a seriously big company, this course is for you.</p>  <p style=\"\">\t After this program, you will have the fundamentals of business and then some. You will be miles ahead of any other fresh entrepreneur, and you will be able to make much more informed decisions.</p>  <p style=\"\">\t This will <strong>benefit you </strong>in multiple ways:</p>  <ul>\t<p style=\"\">\t\t ·You will <strong>save time</strong> and <strong>money</strong>. \t</p>\t<p style=\"\">\t\t ·You won't squander any of your <strong>personal money</strong> on stupid things. \t</p>\t<p style=\"\">\t\t ·You will have a permanent <strong>competitive edge</strong> over your competition. \t</p>\t<p style=\"\">\t\t ·You will <strong>practical knowledge</strong>. \t</p>\t<p style=\"\">\t\t ·And much more. \t</p>  </ul>  <p style=\"\">\t In summary, if you are going to create a business, <strong>StartUp Success Stories: Tips for creating your own startup</strong> contains what you need to know. I hope you are ready to get started with what could potentially be the first step to success.</p>", 
    "end_date": null, 
    "title": "Startup Stories: tips for creating your own startup", 
    "price": "20.00", 
    "instructors": "Alex Genadinik, Jerry Banfield, Christos Pittis", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321558_928f.jpg", 
    "course_url": "https://www.udemy.com/startup-success-stories-tips-for-creating-your-own-startup/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-17T14:27:50Z"
}