{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn how to start and grow your own small business. </p><p>Scared to start your own small business because of fear of the unknown? Fear of not being able to make enough money? We will walk you through all the steps you need to take to not only start your own small business, but feel confident in your product or service offering, revenue and budget projections, and how to run and manage your business effectively. <br></p><p>We tackle practical challenges you will face and provide lots of useful information. We know  because we have created our own successful small business, and crafted this course to teach you what we've learned from our hands on experience. </p><p><em>Unconditional 30 day money back guarantee from Udemy</em><br></p><p><em>All future upgrades and lectures are included for FREE</em></p><p>In this course:</p><ol><li>Introduction To The Course</li><li>Use Your Passions To Pick Your Path (so you know what to do)</li><li>Pick and Price Your Products and Services (so you know what to sell)</li><li>Business Organizations 101 (so you know how to setup)</li><li>Business Management (so you know how to run your business)</li><li>Marketing and Sales (so you know how to grow)</li><li>Growth and Next Steps (so you know what's next)</li></ol><p><em>and much, much more!</em></p><p>Click the \"Take This Course\" button at the top right of this page now and get started right away. You don't want to delay learning how to turn your passion into a profitable small business.</p><p><br></p>", 
    "end_date": null, 
    "title": "Start Your Own Business, Be Your Own Boss", 
    "price": "45.00", 
    "instructors": "Guthrie Weinschenk, Susan Weinschenk, Ph.D.", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655222_9583_2.jpg", 
    "course_url": "https://www.udemy.com/beyourownboss/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T04:54:46Z"
}