{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>**** all new case study material added 2016 ***</p><p>  \t<strong>Starting a business seems like a great idea</strong>....  </p>  <p>  \tBut it can soon  become overwhelming. So many requirements, regulations. And that's even without  assessing <em>whether we have a marketable  idea</em> and whether it will create <em>the  kind of success we really want</em>.  </p>  <p>  \t<strong>From idea to implementation</strong>  </p>  <p>  \tThis course is  designed to cut through all of that and to take you on a thirty day journey  from <em>inspiration to income</em>. I want to  take your desire and your passion and show you how to turn it into practical  actions that allow you to come up with profitable business ideas and your passion  and to create income before the month is over.  </p>  <p>  \t<strong>Accessible training in bite sized chunks</strong>  </p>  <p>  \tDay by day, step-by  step, this course will strip away much of the overwhelm you may feel as a new  entrepreneur. It will take you on a journey from coming up with profitable business  ideas,  discovering <em>where your talents lie</em>, to testing and packaging <em>what you are going to sell</em>, and to show  you how to actually <em>make money now</em>.  </p>  <p>  \t<strong>You need to check out your idea against these three  criteria</strong>  </p>  <p>  \tThere are so many  books and courses for new businesses and coming up with profitable business ideas. Books that tell  you about business plans and accounts. But before you start to pull together  these processes, you need to know that you have:  </p>  <p>  \t1.  Profitable business  ideas.  </p>  <p>  \t2.  A business model that is a  fit for the life and income you want to create.  </p>  <p>  \t3.  A product or service that people want to buy!  </p>  <p>  \t<strong>Shortcut your  success</strong>  </p>  <p>  \tI work with clients  who sometimes find years later that their business might be successful  financially but they want to get out and so something they love. Or they have a  great idea but they just can't make money with it. Or they have a business that  runs their life, rather than a business that gives them the life they want. I  don't want this for you.  </p>  <p>  \tI created this  course so that you could <em>shortcut this  journey</em>. Yes you will need the right legal and financial framework. But you  must also build your business on a foundation that will give you the  fulfillment, the life and the income you want.  </p>  <p>  \t<strong>Check you are on the right track right from the start</strong>  </p>  <p>  \tThis course shows  you how to understand and rigorously test your profitable business ideas so that you know you  are on the right track before you start (or to help you get re-oriented when  you've hit a roadblock!).  </p>  <p>  \t<strong>This is for you if...</strong>  </p>  <p>  \tThis course is for  you if you want to start a business <em>doing  what you love</em>. If you want to <em>feel  fulfilled by what you do</em>. And you want to <em>create a lifestyle that works for you</em>.  </p>  <p>  \tThis course is for  you if you've already started a business but you're feeling as if you didn't  take the right path. Or if you know that you've found your passion but <em>you're struggling to turn it into income</em>.  Or if you simply want to know how to do the things <em>that will move you forward</em> day by day.  </p>  <p>  \tBecause it's the  staying in action that gets results for you.  </p>  <p>  \t<em>Get Momentum: Start  A Business You Love</em> combines motivation with real, practical, actionable  strategies. Anyone who is running a service business or a is a solo-preneur  will find it especially valuable - creatives, coaches, consultants, designers,  healers... This is designed for you.  </p>  <p>  \t<strong>We'll cover:</strong>  </p>  <p>  \t●  How to build a  business from your strengths - because this will make you more successful  </p>  <p>  \t●  Why people buy what  you're selling and why are will buy from you  </p>  <p>  \t●  How to do the 'five  minute money check-in' (do this before you make important decisions!)  </p>  <p>  \t●  How to create income  before the course is over  </p>  <p>  \t●  Why knowing your  revenue model will help you know how to grow your business  </p>  <p>  \t●  Measuring success an  easy way to monitor the numbers you need to pay attention to  </p>  <p>  \t●  How to take one step  at a time to achieve your ambitions (hint: I tell my clients I can get rid of  80%% of the things on their to-do list and this technique will help you do that  too)  </p>  <p>  \t●  Identify and know  how you are going to achieve your money goal (with downloadable spreadsheet)  </p>  <p>  \t●  Where to begin  delegating even if you think you can't afford it yet  </p>  <p>  \t●  Three very simple  questions that will help you stay on track when the course is over  </p>  <p>  \t<strong>Practical actions</strong>  </p>    <p>  \tAnd the best part is  that this course isn't just about learning. It's about practical actions. Every  day you will take an action step that is relevant and specific to you and your profitable business  ideas.  This is what will take you from <em>idea to  income</em> - this is what separates those who succeed from those who stay stuck  - it's about the <em>doing</em> not just the  learning...  </p>", 
    "end_date": null, 
    "title": "Start A Business You Love. Idea to Income in Thirty Days.", 
    "price": "25.00", 
    "instructors": "Cathy Presland", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/19360_226f_11.jpg", 
    "course_url": "https://www.udemy.com/start-a-business-you-love/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-11T13:54:49Z"
}