{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>FULLY UPDATED and COMPLETELY REDONE as of 1/2016</strong></p>\n\n<p><strong> </strong>So check out RECENT reviews for an accurate assessment of the CURRENT course.</p>\n\n<p><strong></strong></p>\n\n<p><strong>____________________________________________</strong></p>\n\n<p>So, you have a great business idea.</p>\n\n<p>You grab your two best friends, get all excited, and then start a company together.</p>\n\n<p><strong>In your haste to get started, you and your two cofounders decided to divide the equity evenly in thirds--it seemed the obvious and fair choice then.</strong><br></p>\n\n<p>Two months later, just as you're starting to get some traction, one of the \"friends\" changes his mind and drops out entirely. But for the work that he did, he believes he should still keep his 1/3 share of the company.</p>\n\n<p><strong>The two of you left are now essentially doing all the work, but for only 2/3 of the company. </strong>Still worth pursuing? Maybe. But you definitely won't be happy.</p>\n\n<p>With 'deadweight' cofounders with significant equity stakes, you'll be lucky if you could attract any new team members or investors.</p>\n\n<p><strong>Don't make this dumb mistake. My course and my calculator will allow you and your cofounders to have a collaborative and transparent conversation how much of the company each person should get. </strong></p>\n\n<p><strong>_____________________________________________</strong><br></p>\n\n<p><strong>Look, starting a new venture is hard enough, but having to figure out what is fair for each cofounder shouldn't be the hardest thing. </strong></p>\n\n<p>By taking this course and using my easy to use <strong>startup equity calculator</strong>, you'll learn some ways on how to avoid this unfortunate, yet preventable situation. And you and your team might even have fun with the pie slicing exercise!</p>\n\n<p>Through the course, you'll learn what you should into your equity pie considerations and how to use a systematic approach for calculating each founders fair share, collaboratively and openly.</p>\n\n<p>While this course isn't intended to provide you with the THE \"correct solution\", it will give you and your team a great starting point.</p>\n\n<p><strong>And it'll make easy an often awkward conversation about who should get how much and why.</strong></p>\n\n<p>Deciding and agreeing on how to divide the initial equity pie is no trivial task, but this tool will definitely help get the conversation going on the right path <em>by forcing you and your cofounders to decide on what are the key milestones for your venture and how each of you are going to be making your contributions.</em></p>\n\n<p><strong>What if your starting a more traditional business?</strong></p>\n\n<p>Whether you're going for a high growth type of startup or a more traditional startup with known benchmarks for revenue and cash flow, I've got you covered.</p>\n\n<p>I'll explain to you which of the TWO frameworks and tools you should use depending on the type of venture you're starting up.</p>\n\n<p><strong>Take a look at the preview lectures to check out the calculators in action and you'll see how they can help you and your cofounders with having a smart and equity conversation about splitting the pie.</strong><br></p>\n\n<p><strong><strong>Good luck and happy slicing!</strong></strong></p>\n\n<p><strong>_____________________________________________________</strong><br></p>\n\n<p><strong>Also, I personally respond to EVERY question or discussion post.</strong><br></p>\n\n<p><br></p>\n\n<p><em><br></em></p><p><em><em><em><em><em><em><em></em></em></em></em></em></em></em></p>\n\n", 
    "end_date": null, 
    "title": "Startup Equity Calculator: How to Divide Up Startup Equity", 
    "price": "40.00", 
    "instructors": "Symon He", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/30481_41c7_18.jpg", 
    "course_url": "https://www.udemy.com/founders-pie-calculator/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-24T22:59:46Z"
}