{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course you will learn to launch and promote a T-Shirt label online. We will avoid all inventory costs and overhead by using print on demand merchants to sell our designs on shirts around the world. In this course, We will promote on social media to get free marketing. I won't just show you how to upload shirts for sale, we will go through building a lasting brand, and developing a workflow for producing high-quality art. We will use structured descriptions to make uploading our designs a breeze. Even better, what we design for T-shirts can be made for sale on other products, like stickers coffee mugs, wall clocks, and just about any other product you can imagine.</p> <p>I'll be giving you the knowledge I acquired in the last two years running my own T-shirt businesses. I have had a lot of fun running online T-shirt shops just like the ones we will be creating. Everyday smiles are brought to my face via emails alerting me to a purchase. While it is hard to make huge money selling t-shirts, its relatively easy to make consistent good money. But it's not about the money. The best part of the t-shirt business is knowing that somewhere around the world, somebody is wearing something you have designed. It's also fun to wake up to emails saying you have made money while sleeping!</p> <p>I hope this course get you as excited about T-shirts as I am, and<strong> I wish you great success</strong>.</p>If you have any trouble, please post in the discussions part of the course and I will get back to you!!", 
    "end_date": null, 
    "title": "Start an Online T-Shirt Business at Zero Cost", 
    "price": "20.00", 
    "instructors": "Douglas Butner", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/253536_257d_4.jpg", 
    "course_url": "https://www.udemy.com/start-an-online-t-shirt-business-at-zero-cost/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-01T05:54:42Z"
}