{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>We have dreams of that perfect business idea. It’s amazing. It’s everything we know it could be. All we need is someone to build it.</strong></p><p><strong>And the dream dies there.\n</strong></p><p><strong>Well, no more. </strong></p><ul><li>At the end of the course, students will:<ul><li>Gain the confidence to execute on an idea without having a technical co-founder on their team.</li><li>Understand how a technical co-founder actually fits into the overall business.</li><li>Have made at least a basic attempt at learning how to code.</li><li>Will know how to work with outside resources to execute a technical project</li><li>Will understand the basics of wire framing and product development</li><li>Will know how to recruit a technical co-founder onto their team.</li></ul></li><li>Who should take this course:<ul><li>This course is for people who are passionately pursuing an idea of theirs, but lack the technical know-how to get started on building it.</li><li>It’s also beneficial for entrepreneurs who want to have a better relationship with a technical co-founder.</li><li>This course is not if you’re already a developer.</li></ul></li><li>What will students need to know or do before starting the course?<ul><li>Have an idea that you know you want to start, and ideally have vetted it out by developing a business plan or using Lean Canvas.</li></ul></li></ul>", 
    "end_date": null, 
    "title": "Start a Company Without A Technical Co-Founder", 
    "price": "25.00", 
    "instructors": "Zvi Band", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515684_c7ce_5.jpg", 
    "course_url": "https://www.udemy.com/no-technical-co-founder-no-problem/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T22:40:03Z"
}