{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>PLATFORM ONE VIRTUAL SERVICES, are pleased to launch this inspiring new course, exclusively on the UDEMY platform.</strong></p><p>Updated October 2015.</p><p>We create unique, inspiring courses that we would love to share with you. Our learning materials are not available elsewhere and our staff believe in the power of great learning opportunities. We create courses that challenge and open new directions.</p><p>This course has already attracted over 800 students. on Udemy we have over 2000, unique students.</p><p>So if you are seeking new opportunities, new challenges or just wish to run your own show, lets get started.</p><p>This short course takes you through the inception to mobilisation phase of opening your own business, with lots of tips and guidance along the way.</p><p>We know change can be daunting so we include all of the information you need to get started.</p><p>Lynda our course presenter has extensive experience in working for both blue chip companies as well as public services within the UK. Lynda has provided training and support for lean start ups and social enterprises since 2001.</p><p>Lynda is part of our team at Platform One Virtual Services, a leading UK, training and communication company,</p><p>We include a project plan for you to follow to support you in growing your confidence along the way. We show you all of the steps needed to get started and cover all of the practicalities and choices available.</p><p>Each film takes you one step further on your entrepreneurial path. This course will take you over an hour to complete, with ongoing assignements to embed the learning.</p><p>This course provides generic content so whether you wish to start selling goat wool jumpers in Japan or fine china in the USA, you will find this course relevant to you.</p><p>Everyone has to start somewhere and we are delighted to be launching this course on the Udemy Platform to reach potential students all over the world.</p><p>We take you through the essential steps to becoming a great leader and finding work that challenges and inspires. We cover business planning, strategy and business modelling so there are no more excuses about getting going in a new inspirational direction.</p><p>Work with us and find the work you love to do</p>", 
    "end_date": null, 
    "title": "Start Your Own Business From Scratch", 
    "price": "20.00", 
    "instructors": "Platform One Virtual Services", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608336_fb03_8.jpg", 
    "course_url": "https://www.udemy.com/start-your-own-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T19:12:06Z"
}