{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                          Take this course which is a killer course where I give you ALL of my secrets and a blueprint on creating, implementing and TOTALLY executing your own online nightlife membership ticket website for a very LOW COST for a start up.  </p>  <p>  \t                          However,if you SELL TICKETS TO ANY EVENT (music, parties, sporting, plays, performances, and more) whether you are an event planner or want to be; you can still use the guide that I give you in this course to start and execute your business INSTANTLY.  </p>  <p>  \t                  You will also get the steps on how to convert visitors to your site into members to become long-term customers to sell your tickets to.  </p>  <p>  \t              In addition, getting paid memberships onto your website from event promoters and venue owners.  </p>  <p>  \t                        Also, I will show you how to set up a ticketing system to start selling your tickets right away.  </p>  <p>  \t                                        The biggest secret to the nightlife site is that this is within a BILLION DOLLAR business in the nightclub industry and I am giving you an unconventional &amp; UNIQUE way to enter into this booming market!  </p>  <p>  \t                                      I have experience in this industry and I&#039;m taking everything I learned and compiled it into this course and giving away the milk and the cow. I have possibly saved you both time and money by creating this course and fast tracking you on your way into creating your own business in this industry.  </p>  <p>  \t                          Again, even if you do not have an interest particularly in the nightlife but would like a business selling tickets to ANY EVENT, then you can use this as your blueprint and apply and tailor it to the type of events that you want.  </p>  <p>  \t                                      Why I am doing this? If you like me wish to earn extra income and own your own business and has an interest in entertainment then I say why not do it, it is a FUN business and you can MAKE MONEY too so find out how and take this course now.  </p>", 
    "end_date": null, 
    "title": "Start a Startup for a Low-Cost Today: Event Membership Site", 
    "price": "20.00", 
    "instructors": "Krystal Taylor", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265328_c1a4_4.jpg", 
    "course_url": "https://www.udemy.com/create-a-membership-ticketing-website-using-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-20T23:31:55Z"
}