{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">&gt;&gt;&gt;The only course of its kind: This course also includes interviews with experts who charge thousands for consulting!</p>  <p style=\"\">\t<em style=\"\">&quot;</em><em style=\"\">Im into your course now, sitting next to my 65yo mother who has just retired and she is almost goggle-eyed with excitement! She is a well educated (various uni degrees etc) professional, and is finding your lectures to be very clear, high quality, well laid out and informative. Not to mention that she is starting to see a whole new world available to her...&quot; </em>- Val</p>  <p style=\"\">\t Chances are you don&#039;t love your job. But I bet you would if you could do it from a laptop on the beach in the tropics... It&#039;s currently 75 degrees and sunny outside as I write this, even though it&#039;s winter.</p>  <p style=\"\">\t This course is specifically for people who are looking for something greater...people who want to break off from society&#039;s script and create total freedom of time and location.</p>  <p style=\"\">\t<strong style=\"\">This course is for you if you&#039;ve ever wished you...</strong>  </p>  <ul style=\"\">\t<li style=\"\"><strong style=\"\"></strong>Had the ability to spend more time with your kids \t \t</li>\t<li style=\"\">\t \t\t Could wake up when you want \t \t</li>\t<li style=\"\">\t \t\t Worked for yourself, as your own boss \t \t</li>\t<li style=\"\">\t \t\t Could travel the world on a never-ending vacation \t \t</li>  </ul>  <p style=\"\">\t My name is Grant Weherley and I&#039;ve started several businesses all while traveling the world and having crazy adventures.</p>  <p style=\"\">\t &gt;&gt;The funny thing is that I make more money than most people I know who are being &quot;responsible&quot; in their cubicle-death back home! And to be honest I work quite a bit less...&lt;&lt;</p>  <p style=\"\">\t I&#039;ve made tons of ridiculous mistakes getting here, as most people do, and I want to share with you the exact framework I would use if I had to start over from scratch tomorrow.</p>  <p style=\"\">\t<strong style=\"\"> More specifically you will learn: </strong>  </p>  <ul style=\"\">\t<li style=\"\">The 6 most common mistakes with starting a business that you won&#039;t hear anywhere else (learned the hard way!)</li>\t<li style=\"\">The sliding scale of business models (and how starting at the wrong point can waste years of your life)</li>\t<li style=\"\">How you can quit your job and become self-employed starting tomorrow (and how I would do it if I had to start over)</li>\t<li style=\"\">The 3 phases of entrepreneurship, and how mixing these up will cause you to fail</li>  </ul>  <p style=\"\">\t<em style=\"\"> And you&#039;ll be hearing from several other badass entrepreneurs as I interview them on exactly how they&#039;d start over given everything they know now. </em>  </p>  <p style=\"\">\t This course covers a variety of business models (each expert has a different model - drop shipping, online courses, productized services, consulting, etc.) and I make sure you finish the class understanding the different models and how to choose the model for your business!</p>  <p style=\"\">\t This is NOT for people who are looking to be sold another shiny product pushing a particular platform or model (<em style=\"\">Make a million dollars per year with X</em>, whether X is kindle, drop shipping, twitter, etc.).</p>  <p style=\"\">\t<strong style=\"\"> One particular business model is not suitable to everyone. So instead this course focuses on: </strong>  </p>  <ol style=\"\">\t<li style=\"\">A framework that successful entrepreneurs use to start businesses</li>\t<li style=\"\">The most common mistakes that cause failure that don&#039;t get told in all the &quot;success stories&quot; you hear</li>\t<li style=\"\">A variety of business model options to choose from, so you can pick which is most appropriate for you!</li>  </ol>  <p style=\"\">\t Enroll today and get an unprecedented chance to learn from several successful entrepreneurs who show you <strong style=\"\">exactly</strong> how you can make ridiculous amounts of money while working for yourself and traveling the world, regardless of your age, occupation, or experience.</p>  <p style=\"\">\t This is not slight of hand, misleading marketing, or the promise of an unattainable dream. It&#039;s fact - and I know thousand other location independent entrepreneurs that are doing this RIGHT NOW!</p>  <p style=\"\">\t Enroll today and take control of your time, your finances, your life.</p>  <p style=\"\">\t See you on the inside!</p>  <p style=\"\">\t Grant, Serial Entrepreneur and Author of <em style=\"\">Break The System</em></p><p style=\"\">P.S. My coaching on these same topics averages about $300/hour, so the cost of this course should be a no-brainer :-)</p>", 
    "end_date": null, 
    "title": "Start a Business and Travel the World in 30 Days!", 
    "price": "20.00", 
    "instructors": "Grant Weherley", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/379838_5076_6.jpg", 
    "course_url": "https://www.udemy.com/lifestyle-business-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T09:35:42Z"
}