{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>So you&#039;re thinking about making a tutoring business? Well, you&#039;re in the right place! My name is Kody D&#039;Amours, CEO of Smart2tor - the largest college private tutoring business in Arizona, and PhD in Mathematics, and I have been there and done that. At one point, I managed 40+ tutors doing what you are looking to do, and I can tell you all of the secrets and traps that you might encounter.</p><p><strong style=\"\"></strong>I&#039;m sure you&#039;ve thought of ways on how to reach students. Did you know that Facebook advertising is one of the most inefficient ways of advertising a tutoring business? Did you know that there are tools on Craigslist that can get you more students than you can handle? This is a $5 billion industry and you should take advantage of it!</p><p><strong style=\"\">Build Your Successful Tutoring Business Today!</strong><br style=\"\"></p><p>In as little as six weeks, you can...</p><ul style=\"\"><li>Manage tutors to do the work for you while you relax!</li><li>Have a full time job making lots of money or...</li><li>Keep it part time and still make lots of money</li><li>Build websites and gateways for students to pay easily</li><li>Effectively advertise to your future customers</li></ul><p><strong style=\"\"><strong style=\"\">What Are You Waiting For? Start Your Success Today!</strong><br style=\"\"></strong></p><p>It&#039;s so easy too. This course and the start up fees (less than $100 total) will pay for itself within less than 3 hours of work. After that, you are on your way to making easy money.</p>", 
    "end_date": null, 
    "title": "Start Your Tutoring Business Today: Easy Success And Profit", 
    "price": "20.00", 
    "instructors": "Kody D'Amours", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461058_8ce1.jpg", 
    "course_url": "https://www.udemy.com/tutoringbusiness/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-27T22:50:54Z"
}