{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                 If you haven't got a company you can set it up in the US, even if you are a foreigner. If you have a foreign company, you can create a US company to establish your presence in the US market and increase your brand reputation, because:  </p>  <ul>  \t<li><strong>Fact 1: </strong>Nobody will take you seriously in business unless you have a company.</li>  \t<li><strong>Fact 2</strong>: You get most credibility in business with a US-based company.</li>  </ul>  <p>  \t                             The problem is that setting up a US company is very costly. It can easily amount to $10,000 and above, since corporate lawyers are extremely expensive.  </p>  <hr>  <strong>The Good News</strong>  <p>  \t                            Setting up a US company is actually not that complicated and expensive, you just have to follow some easy steps and understand some basic concepts. Instead of having a corporate lawyer explain them to you (charging hundreds of dollars / hour), you can take this course! It contains:  </p>  <ul>  \t<li>a hands-on approach on the <strong>best legal practices</strong></li>  \t<li>with a step-by-step guide to create your company in a <strong>few hours</strong></li>  \t<li>on a <strong>few hundred-dollar budget</strong></li>  \t<li>in <strong>plain English</strong></li>  \t<li>with 37 lectures with videos, instructions, quizzes and checklists</li>  \t<li>and templates for all the necessary <strong>legal documents</strong></li>  </ul>  <hr>  <strong>A Foreigner-Friendly Course</strong>  <p>  \t<strong>If you don't live in the US</strong>, I'll teach you how to set up your own US company without ever having to travel to the US in a special set of lectures I've prepared for foreign entrepreneurs.  </p>  <hr><strong><ul><li><strong><strong>More than 1000 satisfied students</strong></strong></li><li><strong>5-star rating</strong></li></ul><p><strong></strong></p><hr><p><strong>Don't take my word for it. Hear what others have to say...</strong><br></p></strong><p><strong>Adelina COJOCARU</strong>: \"<em>After taking this course I finally know what I'm doing. I know what needs to be done, what decisions need to be made and their impact on my business. Most importantly, I know now that I can do it myself and save all that money on legal fees.</em>\"<br></p>  <p>  \t<strong>Juren Strnik:</strong> \"<em>The instructor is knowledgeable about the subject and explains it in plain English. The fact that he's created several companies gives you peace of mind as he's able to point out several gotchas along the way.</em>\"  </p>  <p>  \t<strong>Francesc Sanahuja</strong>: <em>\"</em><em>I have the feeling that it just saved me much more time, trouble and hours of frustration than I can image! Good invested money!</em>\"  </p>  <p>  \t<strong>Alberto Fernandez</strong>: \"<em>I've read many things about starting a company in the US. But I'm a foreigner and I didn't know it was possible for me to start one. Now I know that it is possible, that I don't have to fly to the US, and that there are some things and traps you really have to be careful with as a foreigner</em>\"  </p>  <hr>  <strong>Why I Made This Course for You</strong>  <p>  \t              I'm a serial entrepreneur and over the years I've started 4 companies and helped many other entrepreneurs establish their own. Setting up my companies without a lawyer has saved me thousands of dollars, but it has costed me many hours of reading legal stuff, talking to corporate attorneys, calling the IRS, etc. I have worked through all this information and summarized it in a digested version for you. I would like to share the acquired knowledge in this course to save you <strong>n</strong><strong>ot only your money, but also your time</strong>.  </p>  <hr>  <p>  \t              If this sounds interesting to you, I highly recommend making this investment in yourself.  </p>", 
    "end_date": null, 
    "title": "Startup Guide: Setup and Run a US Company", 
    "price": "25.00", 
    "instructors": "Miguel De Vega Rodrigo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286418_a27f_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-set-up-and-run-a-us-company/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-23T10:50:35Z"
}