{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>**Course Updated November 2015 - Over 700 students.**</strong></p><p>This course is designed for those of you who are ready to:</p><ul><li>Position your authority and influence online to get a rush of prospects, <strong>increase sales and make a passive income.</strong></li><li>Find out more about Virtual Summits and how you can be <strong>leveraged to make a profit</strong>.<strong></strong> </li><li>You are not sure if a Virtual Summit is going to be a good idea and want to<strong> find out more before investing more time and money. </strong></li></ul><p>You recognize that you want to:</p><ul><li>Learn <strong>low cost and no cost ways to market</strong> your business onlin.</li><li>Make a bigger impact, increase the size of your buyers list and <strong>have more customers.</strong></li><li>Reach a <strong>global audience without leaving your home.</strong></li><li><strong>Host a live event </strong>but don't need the hefty bill and months of planning</li><li>Significantly <strong>cut your marketing and advertising spend</strong></li><li>Be seen as the <strong>leader and go-to-expert </strong>in your field</li></ul><p>Hi I'm Wendy Kier,</p><p><br></p><p><strong>I've been hosting Virtual Summits since 2013</strong>, I've created An Introduction to Profitable Virtual Summits to help you find out how you can run your first profitable Virtual Summit <strong>without getting stressed out or breaking the bank</strong>.<br></p><p>Here's Just A Taste Of What You'll Learn…</p><ul><li>What is a Virtual Summit?</li></ul><ul><li>The Key Ingredient you need to make your Virtual Summit a Success</li></ul><ul><li>The top 5 reasons to host a Virtual Summit in 2015/16</li></ul><ul><li>How a Virtual Summit fits in with your digital marketing mix</li></ul><ul><li>Why and what your Virtual Summit needs to be focused on to give you the best high-value leads</li></ul><ul><li>The cheap as chips nuts and bolts which will save you thousands</li></ul><ul><li>The NO.1 Virtual Summit to host that's right for business</li></ul><ul><li>9 Sure ways to make money from your Virtual Summit</li></ul><ul><li>How to tell if you are good to go</li></ul><p>Find out if a Virtual Summit is going to be a good investment for you before you make a much bigger investment of time and money.</p><p>Wendy Kier</p><p>Virtual Summit Ltd</p>P.S. I am here online to support you, ask all the questions you need.", 
    "end_date": null, 
    "title": "Step-by-step Introduction to Profitable Virtual Summits", 
    "price": "45.00", 
    "instructors": "Wendy Kier", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543980_94e1_3.jpg", 
    "course_url": "https://www.udemy.com/profitable-virtual-summits-step-by-step-introduction-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T10:49:45Z"
}