{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>*350+ students have already learned how to make $$$ with their fitness passion. Now it is your turn; enroll NOW!</strong></p>\n\n<p><strong>Testimonials </strong></p>\n\n<p>“If you are passionate about Fitness -like me- take this course. I am a stay at home mother of two and now I am also a Zumba Instructor, all the tips Marcelo gives you in this entire course are so practical and they apply in real life, I personally found it very useful and it answered a lot of questions I had regarding the best Certification, CPR and even how to get advice when ready to start your own business. Recommended 100%!” - Stephanie Rangel</p>\n\n<p>“I really liked the golden nuggets Marcelo teaches in this course. As an aspiring trainer I will definitely implement a lot of the tips and strategies he shares here. Thanks Marcelo!” – Jose Guevara</p>\n\n<p><strong>-------------------------------------------------------------------------------------</strong></p>\n\n<p>Welcome to my course, <em>“Steps to Become an In-Demand Fitness Professional\"</em>, where you will learn how to get paid doing what you love.</p><p>I created this course for stay-at-home moms, college students, and anybody passionate about health and fitness who wants to create extra income or make a living doing what they love… fitness!!!</p>\n\n<p>By the end of this course you will have the tools to successfully start helping others get in shape and improve their overall health. While helping others you will get compensated for sharing the love of fitness.</p>\n\n<p>In this course you will find everything you need to start helping others and make extra money. I will walk you step-by-step through the entire process of becoming a fitness professional.</p>\n\n<p>The ideal student is a person that is very passionate about health and fitness and wants to make a difference in people's lives. </p>\n\n<p>You only need the passion, the desire and willingness to help others get in shape and improve their overall health.</p>\n\n<p>Follow your dream and start making money with your fitness passion today! If I did it, you can do it too. Please take a look at the course description and I will see you inside!</p>", 
    "end_date": null, 
    "title": "Steps to Become an In-Demand Fitness Professional", 
    "price": "20.00", 
    "instructors": "Marcelo Vazquez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538592_efa4_4.jpg", 
    "course_url": "https://www.udemy.com/make-money-with-your-fitness-passion/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-27T12:47:44Z"
}