{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">Have you ever wondered if there's a way you could live your life by travelling the world, surrounding yourself with natural beauty and adventure?</em></strong>  </p>  <p style=\"\">  \t          What if, right now, you could book a one-way ticket to a beautiful tropical country with white sands, turquoise oceans and you could stay there as long as you like?  </p>  <p style=\"\">  \t                      If you have at least some proficiency in a marketable skill that you can sell online, I’ll show you how to become a Freedomlancer and achieve precisely that.  </p>  <p style=\"\">  \t<strong style=\"\">Learn How to Establish Yourself as a Freelancer While You Travel the World</strong>  </p>  <p style=\"\">  \t                      This course is about how to establish yourself as a professional freelancer while you travel the world effectively and affordably.  </p>  <p style=\"\">  \t                      You'll discover how to work your way from sole traders or small-medium-business  clients, and then on to larger companies with big budgets.  </p>  <p style=\"\">  \t                      You’ll learn how to remove the pressure of covering huge living costs associated with more expensive countries (such as the US or the UK) by travelling to exotic countries and leveraging differences in currency value to seriously reduce your living expenses while you work from incredible beaches and sip coconuts.  </p>  <p style=\"\">  \t<strong style=\"\">Why is This Such a Great Idea? Well, Because You Can… </strong>  </p>  <ul style=\"\">  \t<li style=\"\">Relax into your freelancer profession in beautiful locations</li>  \t<li style=\"\">Free up <em style=\"\">huge</em> amounts of time to work on new projects both professional and personal</li>  \t<li style=\"\">Take time out from the rat race to decide what you want to do with the next 10 years of your life</li>  \t<li style=\"\">Get a refreshing change of scenery</li>  \t<li style=\"\">Learn new transferable business skills</li>  \t<li style=\"\">Make new business contacts</li>  \t<li style=\"\">Experience different cultures to gain new perspectives on the world</li>  </ul>  <p style=\"\">  \t                      You’ll discover how to plan your time and plan your money so you can travel successfully, find considerable freelance success and enjoy a life of complete locational freedom with the ability to generate your own income whenever you want.  </p>  <p style=\"\">  \t<strong style=\"\">What Are Some Example Skills Freelancers Can Use?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Writing (Journalism, copywriting, blogging etc)</li>  \t<li style=\"\">Videography, video editing or audio editing</li>  \t<li style=\"\">Photography</li>  \t<li style=\"\">Graphic design</li>  \t<li style=\"\">Illustration</li>  \t<li style=\"\">Animation</li>  \t<li style=\"\">Programming</li>  \t<li style=\"\">App developing</li>  \t<li style=\"\">Web design</li>  \t<li style=\"\">Online marketing (search engine optimization, social media marketing)</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Is it <em style=\"\">Really</em> Achievable?</strong>  </p>  <p style=\"\">  \t                      Not only is it achievable, it’s a easier than you might think. With just a little guidance, a bit of graft and a healthy dose of courage, you’ll find everything you need to achieve these goals in this course.  </p>  <p style=\"\">  \t                Further reading is provided in the resource sections from many famous travelling entrepreneurs to show you just how achievable really is. This is not some pipedream. It's an opportunity that's never been more viable than it is today.  </p>  <p style=\"\">  \t<strong style=\"\">What Will We Cover? 1. How to Set Up</strong>  </p>  <p style=\"\">  \t                You'll learn how to achieve all of these things from scratch. The course begins with setting up an online presence such as the LinkedIn page, freelancer website profile and simple personal website, all of which will be used to build the kind of social proof that allows you to work your way up to larger, better quality and better paying clients.  </p>  <p style=\"\">  \t<strong style=\"\">What Will We Cover? 2. How to Find Work</strong>  </p>  <p style=\"\">  \t                  Once that's done, we look at how to filter the Internet in an organised way for well-paid jobs. We look at how to find clients paying at least $50 per hour on Elance, what you need to do to engage and impress these clients to win jobs.  </p>  <p style=\"\">  \t                All of the proposal writing strategies and organisational techniques are applicable to any source of freelance clients. The course uses Elance as a platform to demonstrate them.  </p>  <p style=\"\">  \t    I show you how I make $50-$200 per hour on this platform. There's a lot of cheap outsourcing work going on, but there are great clients there, too. You just need to know how to find them.  </p>  <p style=\"\">  \t<strong style=\"\">What Will We Cover? 3. How to Travel Effectively &amp; Affordably</strong>  </p>  <p style=\"\">  \t                  Finally, we look at how to travel the world effectively, keeping on top of your money and enjoying beautiful tropical countries where it's only necessary to work a few hours per month to cover all of your living expenses.  </p>", 
    "end_date": null, 
    "title": "Steps to Start a Freelancing Career & Travel While You Work", 
    "price": "50.00", 
    "instructors": "Mark Mackay", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/279296_a85f_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-freelancer-travel-the-world/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-12T08:54:16Z"
}