{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "LATEST: Course Last Updated 26th February 2016<p>************************************************</p><p>Learn how a few people are earning big on the internet by making use of article writing secrets to profit. This course will show you how to do the same so that you can live the life that you want.</p><p>+++++++++++++++++++++++<br></p><p>About this course:</p><ul><li><em><strong>On sale until the next 3 days! Price increases to $67 after that!</strong></em></li><li><em><strong>1000+ Students in The First Week Of Launch</strong></em></li><li><em>No workbooks, CD's or anything else is required</em></li><li><em>Tons of satisfied students</em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li></ul><p>+++++++++++++++++++++++</p><p>This course teaches you how to earn money from writing articles online. If you have a good command of English and an eagerness to write, then you can live the life that you have always wanted. Forget 9 to 5 and start experiencing the freedom that comes with being able to work from anywhere in the world! </p><p><u>In this course you will learn how to:<br></u></p><ul><li>Assess and improve your writing skills</li><li>Become a topic specialist</li><li>find places that pay highly for writing jobs</li><li>use little known resoruces to profit even more</li><li>correctly market your services to clients</li><li>make clients see you as pure gold</li><li>negotiate like an A+ article writer would</li><li>overcome client price objections</li><li>command high prices even if you're a newbie</li><li>how and why to guest blog</li><li>why you should set up your own website even if you're a beginner</li><li>make sure that your website functions as it should</li><li>and more...</li></ul><p><br></p><p>There are also a number of resources with several of the lectures which will give you additional information about how to best succeed when you apply the tactics given in this course.</p><p>The course is presented in a number of videos to cover each of the sections mentioned above. Apart from the videos, there is also a quiz in each section to ensure comprehension of the topics that are covered. The students are also provided with a task that they are encouraged to do at the end of each section. This task can be done by modelling what the instructor has shown in the appropriate video in the section. If you do these tasks, you will be well on your way to achieving the success you want.<br></p><p>However, students are encouraged to take an active role throughout the course, by taking down notes and participating in the tasks.</p><p>If you believe that you are ready to change your lifestyle and enjoy the freedom that you deserve - this is your chance. If your English is already up to a high standard, then this is your chance. The topics covered in this course will ensure that you will have the skills to earn the money which can drastically change your life. </p><p>Welcome to this new and exciting challenge - your time is now - get started today!</p>", 
    "end_date": null, 
    "title": "Step By Step Guide To Writing Online Articles", 
    "price": "20.00", 
    "instructors": "Kevin Farrugia", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436036_7d0c_3.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-guide-to-writing-online-articles/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T00:23:40Z"
}