{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">How can you attract more clients for your small business</strong>? Storytelling lets you introduce your service, show why you&#039;re different, highlight your expertise and come across as warm and authentic. You grab your audience&#039;s attention and keep them engaged even in a noisy, crowded marketplace.</p><p>You will discover why marketing stories are structured differently from other stories and use different types of content. You&#039;ll be prepared to meet all kinds of marketing challenges with 4 types of stories. You&#039;ll discover how to use storytelling even if you don&#039;t want to share your own journey and don&#039;t have a rags-to-riches story to share.</p><p>You&#039;ll also learn some techniques of the master storytellers so you&#039;ll exponentially increase your “know, like and trust&quot; factor. </p><p>Your marketing success beings with your ability to share your expertise and your skills While you may feel uncomfortable promoting yourself, storytelling will give you a platform to speak confidently, whether you&#039;re pitching yourself and your business, answering objections, or dealing with challenging clients. This toolkit will enhance your success at any stage of your business. Once you take the time to learn how to tell your marketing stories, you will stand apart from the competition and engage meaningfully with your best prospects. Mostly, your marketing will become more like fun and less like a hated chore!</p> <ul style=\"\"> <li style=\"\">9 video lectures and 2 hours of content!</li> <li style=\"\">Discover how to get more impact from your marketing by telling stories</li> <li style=\"\">Learn how and where to tell stories for maximum effect</li> <li style=\"\">Develop 4 types of stories to use in your marketing</li> <li style=\"\">Promote yourself with authenticity and professionalism</li> </ul>", 
    "end_date": null, 
    "title": "Storytelling For Small Business Marketing", 
    "price": "35.00", 
    "instructors": "Cathy Goodwin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440022_d90d_11.jpg", 
    "course_url": "https://www.udemy.com/storytelling-for-small-business-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-06T00:32:10Z"
}