{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\"><br style=\"\">  \t</em></strong>  </p>  <p>  \t<strong style=\"\"></strong><strong style=\"\">We invite everyone to enjoy this course, which will help you to create a unique and extraordinary business and stay away from competition seriously. This course was created based an award we obtained in the Peter Drucker Challenge. </strong>  </p>  <p>  \t<strong style=\"\">We hope you enjoy !!</strong>  </p>  <p>  \t              Many entrepreneurs and business scholars believe that being an entrepreneur is born with or something that only a few highly gifted people can carry it out. We think not, and that <strong style=\"\">anyone on the planet can be an entrepreneur and succeed</strong>. No need to be a genius, a business manager or have an MBA to start a business. All you need is decision. In fact, the most famous serial entrepreneurs in the world are totally ordinary people, and believe me ... they are no better than you. Only that they had the decision and conviction to bring an idea to reality, and not give up too soon.  </p>  <p>  \t              Our goal is to offer<strong style=\"\"> general advice</strong> so <strong style=\"\">you can create a successful business model</strong> from anywhere in the world where you are. <strong style=\"\">The course aims to give you the tools to be able to transform a simple idea into a disruptive innovation</strong>.  </p>  <p>  \t<strong style=\"\">The course is structured in 4 sections:</strong>  </p>  <p>  \t<strong style=\"\">The Life of an Entrepreneur:</strong> In this section we discuss the meaning of entrepreneurship, the personality it needs an entrepreneur to run a business, how to create a successful business model and strategic innovation process.<br style=\"\">  \t<strong style=\"\">The Fertilization of the Idea:</strong> In this section we talk about the importance of the creation of the idea, the meaning of the idea and how to use differents tools of innovation to create the best idea possible. <br style=\"\">  \t<strong style=\"\">The Gestation of the Idea:</strong> In this section we analyze the process of developing the idea chosen in order to achieve a unique business model.<br style=\"\">  \t<strong style=\"\">The Birth of the Idea:</strong> In this last section we analyze the birth of the idea, the launch of the business model and the importance of testing the model.  </p>  <p>  \t<strong style=\"\">The main benefits of this course are:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Meaning of entrepreneurship</strong></li>  \t<li style=\"\"><strong style=\"\">Understand that requires an entrepreneur to be successful</strong></li>  \t<li style=\"\"><strong style=\"\">Understand what it is an idea and how work it.</strong></li>  \t<li style=\"\"><strong style=\"\">Clarify ideas</strong></li>  \t<li style=\"\"><strong style=\"\">Systematically develop an idea</strong></li>  \t<li style=\"\"><strong style=\"\">Achieve various business models</strong></li>  \t<li style=\"\"><strong style=\"\">Choosing the best business model</strong></li>  \t<li style=\"\"><strong style=\"\">Launch and test business model</strong></li>  \t<li style=\"\"><strong style=\"\">Feedback and changes according to market realities</strong></li>  \t<li style=\"\"><strong style=\"\">Achieving a unique, different and sustainable business</strong></li>  </ul>  <p>  \t<br style=\"\">  \t<strong style=\"\">This course is based on an essay  that we sent to international management challenge in which we obtained a place among the best</strong>. <strong style=\"\">(Peter Drucker Challenge)</strong>  </p>  <p>  \t<strong style=\"\">We hope that you create your own Great Business, with a picture and a clearer view of what is build and manage a business. </strong>  </p>", 
    "end_date": null, 
    "title": "Strategic Innovation For Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Marco Dadone, Andres Dadone", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322168_6897_2.jpg", 
    "course_url": "https://www.udemy.com/strategic-innovation-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-18T15:52:38Z"
}