{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>\" The FIRST, LAST and ONLY Entrepreneur course you will EVER need\" </strong>  </p>  <p>  \t                  This course is based on the principle learning behind my best selling book:  </p>  <p>  \t<em>Third Circle Theory: How visionaries create billion dollar ideas.</em>  </p>  <p>  \t<strong><em>FREE BONUS INCLUDED: With this course, you are getting the eBook version of Third Circle Theory and Check Mate: 16 rules of Leadership </em></strong><em>(B</em>oth are a $30 Value) <br>  \t<strong></strong>  </p>  <p>  \t                         Entrepreneurship is more than self employment or business ownership, it is about having the opportunity to help advance society and facilitate change for those around you. It is about pushing the boundaries of what others call \"impossible\" or what others deem to be a \"stupid idea\" and instead find a way to bring a vision to life. While business owners are busy worrying about money and see the world for what it is today, true Entrepreneurs instead see the world for what it can be  and take on a burden greater than themselves simply due to their belief that they can bring forth the change they envisioned.  </p>  <p>  \t                  While most understand that 9/10 businesses fail and that 98% of those taking Entrepreneurship give up, I believe it shouldn't be that way and the core of changing that is not about giving you a few tips to help you succeed or increase the revenue in your business, those are temporary fixes. Instead we must look deep into the core of the individual and reprogram some of the components like habits, belief, perspective and awareness in order to increase the individual's ability to grasp and execute the concepts taught. Perhaps this sounds a bit too philosophical?  </p>  <p>  \t                  Allow me to clarify it with an example many may be familiar with \"Workout Videos\"  </p>  <p>  \t                  Workout videos teach you a skill such as specific ab techniques, dance moves, cardio routines and more, but what they do not teach you is habits, determination, attitude, mindset. All of which play a significant role in your success with the program. This is the key reason why many who are already fit and active embrace the program and see results while those who typically don't work out or stay healthy and active give up. The difference between success and failure lies in the BASELINE/FOUNDATION of the individual. The same can be said about ENTREPRENEURSHIP.  </p>  <p>  \t<em>Note: I filmed this course as if you were being directly hanging out with me, this influential method of teaching helps you absorb the information much better. You will be my co pilot as we hang out, drive around in my Aston Martin or simply grab a bite to eat.</em>  </p>  <p>  \t                  This course aims to help you understand yourself and helps reprogram your thinking and awareness towards yourself, all while also teaching you the fundamentals behind the necessary steps to succeed. You will learn the following:  </p>  <ul>  \t<li>Understand the 18 verticals that make up a successful Entrepreneur</li>  \t<li>Find the gaps in your self-foundation and fill them instantly.</li>  \t<li>Leverage the power of observations.</li>  \t<li>Increase your confidence significantly. </li>  \t<li>Increase your Entrepreneurial Awareness and tweak your Perspective.</li>  \t<li>Take full control of your belief system and emotions.</li>  \t<li>Wipe Fear, Doubt and Uncertainty from your life.</li>  </ul>  <p>  \t                  Once you master the core foundations above, you will be prepared to undertake Entrepreneurship into its purest state. You will then learn the following:  </p>  <ul>  \t<li>How to create a business from scratch with NO money and NO Experience.</li><li>How to leave your 9-5 job without risk of going back</li>  \t<li>How to build a residual business model with an exit strategy attached to it.</li>  \t<li>What a great revenue model looks like and how to create one.</li>  \t<li>How to turn lack of resources into resourcefulness.</li>  \t<li>How innovation is born, passion formed and purpose created.</li>  \t<li>How to leverage the art of influence.</li>  \t<li>How to apply Third Circle Principles to succeed and crush failure.</li>  </ul>  <p>  \t                  What are Third Circle Principles and Third Circle Theory?  </p>  <p>  \t                  Third Circle Theory is a system I finished creating in late 2012, which encompasses 10 years of my experiences coaching and leading incredible Entrepreneurs, Business Owners and Corporate Leaders. My journey as well as theirs held similarities and therefore enabled me to break down the core of Entrepreneurship and the emotional roller coaster it can be into 3 main categories.  </p>  <ul>  \t<li>Circle 1: The mastery of Circumstance</li>  \t<li>Circle 2: The mastery of Society</li>  \t<li>Circle 3: The quest for Purpose and the mastery of Living.</li>  </ul>  <p>  \t                  This simple book became a guideline to 1000's of Entrepreneurs, all at very different places in their journey. The formula I use is universal regardless of your skill-set or level of awareness but the delivery of the information varies based on your perspective despite ultimately holding a similar outcome, no matter who reads or follows its instructions.  </p>  <p>  \t                  Here are 3 testimonials from leaders you might have heard of:  </p>  <p>  \t<em>\"I recommend this as a blueprint, outline or road map to a successful life.\"</em> - <strong>Allen Wong / Millionaire App Developer.</strong>  </p>  <p>  \t<em>\"This is not your average rant, rather a comprehensive guide into the  inner workings of entrepreneurship, that should be a required read in  all educational curriculum.</em> - <strong>Tom Cruz / CEO and Founder Apto HQ</strong>  </p>  <p>  \t<em>Never before have I seen a video combine such a high level of  consciousness with functional, step-by-step business building strategy </em>- <strong>Chris McCann / Entrepreneur Coach and CEO of Outlier Academy.</strong>  </p>  <p>  \t                  In this course you will learn true Entrepreneurship broken down into a practical and usable guide broken down into lectures and over 60 videos I have created highlighting my own experiences and important elements I wanted to expand on with a visual. All videos are shot in HD and are of the highest quality.  </p>  <p>  \t                  I hope you find all the answers you seek and more, but more importantly I hope you will join me in helping re-establish the true glamour and prestige being an Entrepreneur once had.  </p>", 
    "end_date": null, 
    "title": "Successfully transition from your 9-5 job to Entrepreneur", 
    "price": "50.00", 
    "instructors": "Pejman Ghadimi", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121878_b0bb_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-great-entrepreneur-complete-framework/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-18T20:58:09Z"
}