{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>Learn the secret key to effective target marketing! FIND YOUR TRIBE!!</strong></em></p>\n\n<p>Getting to know your tribe is one of the most powerful things that you can do for yourself and your business. Understanding your niche, your target market, and your ideal clients is the key to marketing your business effectively. But embracing your core TRIBE of raving fans is the key to your business’ success!</p>\n\n\n\n<p><strong>Below are common symptoms of NOT targeting your tribe properly:</strong></p>\n\n<ul><li>Feeling <strong>stuck </strong>pulling from the same small, local market</li><li>Having minimal or no business generated from online, website or social media marketing efforts</li></ul>\n\n<ul><li>Having<strong> low enrollment</strong> in programs or low sales volume</li><li>Spend the majority of your time trying to reach people, with little results</li></ul>\n\n\n\n<p><strong>Once you identify and reach your tribe:</strong></p>\n\n<ul><li>You know <strong>exactly</strong> who your clients are and how to reach them    </li><li>You get to work with the people you<strong> truly enjoy</strong></li><li>You get <strong>exclusive insight</strong> into what your ideal clients truly want so you can better meet their needs</li><li>You develop <strong>raving fans </strong>that support you and market your business FOR you</li><li>Your marketing is more effective with less cost and effort</li></ul>\n\n<p><strong> </strong></p>\n\n<p><strong>If you are going to take the time to invest in creating a website, emails, videos, newsletters, products and programs for your target market…. don’t you think it’s a good idea to understand who they are?</strong></p>\n\n<p> </p>\n\n<h4>If you don’t define your tribe…How much time, money, and energy might you waste guessing???</h4>\n\n<p> </p>\n\n<p>Stop wasting your time trying to convince people to want what you have to offer… and stop neglecting the ones that are eager to work with you!</p>\n\n<p>Stop wasting your money on ineffective marketing strategies that target too broadly or target the wrong market.</p>\n\n<p> </p>\n\n<p><strong><em>Marketing isn’t about having the right message, it’s about COMMUNICATING the right message to the right AUDIENCE.</em></strong></p>\n\n<p> </p>\n\n<p><strong>In this course, we’re going to help you:</strong></p>\n\n<ul><li>Identify your tribe—your ideal target market—and turn them into raving fans</li><li>Test your niche to see if it’s profitable</li><li>Determine where to find your tribe members, both in person and online</li><li>Develop powerful collaborative relationships that get you direct access to your tribe</li></ul>", 
    "end_date": null, 
    "title": "Target Marketing: Find Your Tribe and Niche", 
    "price": "20.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/889866_f483.jpg", 
    "course_url": "https://www.udemy.com/target-marketing-find-your-tribe-and-niche/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-27T19:44:07Z"
}