{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Do you need to get more traffic to your website?</strong><br></p>\n\n<p>Are you a developer? Do you already understand SEO but want a clearer picture of how technical SEO can help your website? Are you sick searching for information online that is repetitive and difficult to understand?</p>\n\n<p>Well, you're not alone.</p>\n\n<p>I can teach you technical SEO in a simple, no- BS way with pictures and drawings.</p>\n\n<p>In this course - just a few videos - you will learn SEO basics, how to make Search Engines happy with your website, and how to fix all the technical things step by step.</p>\n\n<p><strong class=\"redactor-inline-converted\">It's simple. It's easy.</strong></p>\n\n<p>At the end of the course, you will have a fully SEO optimized website, a clear knowledge of how Search Engines Work, and how to rank higher on Google.</p>\n\n<p><strong>This course is anyone who wants to make a positive change on their website and revenue.</strong> If you are a developer working at a company, this is for you. If you are an online entrepreneur, this is for you. If you own a e-commerce website that can get more sales, this course is for you. </p>\n\n<p>And l try to entertain you along the way.</p>\n\n<p>Take the class now! It's fun, it's EASY. And you will remember this process FOREVER. You will always have an easy time optimizing clients' sites by following this course. </p>\n\n<p>See you in class!</p>\n\n<p>Click the button to enroll in this course now! </p>", 
    "end_date": null, 
    "title": "Technical SEO", 
    "price": "20.00", 
    "instructors": "Jane Cui", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538036_be38_2.jpg", 
    "course_url": "https://www.udemy.com/seo-for-developers-technical-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T15:46:34Z"
}