{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Learn How To Capitalize On The Hot T-Shirt Marketing Trend Using Simple Strategies!</em></strong><br></p>\n\n<p>  \t<strong>ABOUT THE COURSE</strong>  </p>\n\n<p>  \t                This course will show you exactly how to start your own T-shirt company - and <em>to be successful at it! </em>After successfully launching several T-shirt campaigns, I always thought that I wish someone had told me exactly how to start. It was tough to do on my own! This course is meant to teach you the proper strategies for working with the right online T-shirt company to get your clothing products created and then launched into the marketplace and<em> make some extra money on the side. </em>Here is what's in the course:  </p>\n\n<ul>  \t<li>Basics of this business model</li>  \t<li>The differences between<strong> </strong>top t-shirt websites</li>  \t<li>How to capitalize hot trends</li>  \t<li> How to target the right audience</li>  \t<li>Learn ways to get traffic - including social networks</li>  \t<li>Advanced strategies</li>  \t<li>Tactics and tips</li>  \t<li>Traffic methods for finding buyers</li>  </ul>\n\n<p>  \t<strong>WHY YOU SHOULD ENROLL</strong>  </p>\n\n<p>  \t          You are at a point in your life where you want to get out of your 9-5 desk job. You are just graduating from college and need some sort of income. You have a great job, but want to make some money on the side doing something you enjoy and love. These are all great reasons for you to enroll in this course. There are thousands more!  </p>\n\n<p>  \t          If you don't know exactly where or how to start; if you don't know how take advance of this <em>new business model</em>; if you don't know how to launch your own tee shirt company- <em>this is the course for you!</em>  </p>\n\n<p>  \t<strong>ABOUT THE INSTRUCTOR</strong>  </p>\n\n<p>  \t      I have launched several successful t-shits campaigns now. In the beginning, it was really hard to to understand how this business model works but after a while, I realized that to be successful wasn't difficult - I just needed to be committed, positive, and have a good plan of action. These are things that I will teach you in the course.  </p>\n\n<p>  \t      Click the<strong> \"take this course\"</strong> button, top right, now... every hour you delay is another hour wasted!  </p>\n\n<p>  \t      Ricardo Soto  </p>", 
    "end_date": null, 
    "title": "Teespring Business: Run a Company Selling T-Shirts Online", 
    "price": "20.00", 
    "instructors": "Ricardo Soto", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375456_4e64_9.jpg", 
    "course_url": "https://www.udemy.com/start-a-home-business-make-a-full-time-income-selling-tees/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T08:12:26Z"
}