{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  In this course I show you <strong style=\"\">10 specific strategies</strong> that anyone can use to make <strong style=\"\">10 thousand dollars</strong>. The actual amount you can make with these strategies is unlimited, but 10 thousand is realistic for anyone in a short time frame with each of these methods.  </p>  <p style=\"\">  \t  Getting good at business and <strong style=\"\">learning how to make money </strong>is not rocket science. Just like anything else, you simply have to study and learn how to do it. If you see a successful person who obviously has learned how to make money, the simplest thing to do is emulate them to get the same kind of results!  </p>  <p style=\"\">  \t  I have used every single one of the strategies in this course, and am currently using all of them right now. I used these strategies to successfully quit my very stressful teaching job and haven&#039;t looked back.  </p>  <p style=\"\">  \t  In this course <strong style=\"\">you will learn how to</strong> make passive income from the internet, easily flip cars and houses for large chunks of cash, invest successfully in an income producing stock portfolio, and generally<strong style=\"\"> learn the BEST ways to make money that ANYBODY can</strong> take advantage of.  </p>  <p style=\"\">  \t  It doesn&#039;t take a college degree, a super high IQ, or a lot of capital to get started. All it takes is <strong style=\"\">a strong desire and the willingness to take action</strong>. Even if you have a full time job, you can use these strategies to make extra income streams on the side. That is how I was able to transition from a full time job to working for myself making a lot more money than I was when I had a boss and a lot more stress.  </p>  <p style=\"\">  \t  In addition to learning ten specific strategies to easily make money you&#039;re going to learn how you can take these ideas and come up with some of your own, because there is no limit to the creativity of entrepreneurship!  </p>", 
    "end_date": null, 
    "title": "The Many Ways to Be Successful Without a College Degree", 
    "price": "20.00", 
    "instructors": "Greg Vanderford", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356340_034d.jpg", 
    "course_url": "https://www.udemy.com/10-ways-to-make-10-thousand-dollars/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T17:38:16Z"
}