{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you are a sales rep, freelancer, consultant or small business owner, you need revenue. Profitable revenue. Recurring revenue. Revenue that stems from quality leads who have money.</p><p>How? Sell to clients who have money, need your product, and are in the market for your product. </p><p>The most frustrating thing in the world is to spend hours, days, even weeks on prospects, only to deliver your proposal and discover that they are cheap, losing money, and will never pay you what you are worth. How many times has this happened to you?</p><p>This <strong style=\"\">KILLS </strong>your energy, your soul, and can ultimately kill your business.</p><p>But...It doesn't have to be that way.<br style=\"\"></p>  <p>  \t    If you are selling valuable services or complex products, you <strong style=\"\">MUST </strong>work with businesses that need your product, are actively searching for your product, and will actually <em style=\"\">pay you </em>full price for your product.</p><p>Just think about it:</p>  <ul style=\"\">  \t<li>A business with 5 staff generating $250k in sales might seem rich on the outside. But after salaries &amp; overhead, do you really think they have the cash to buy your $2,500 service? Possible, but unlikely.</li><li>How many hours have you poured into live consults and proposals only for the prospect to complain about pricing, go silent, and fall off the face of the earth?</li><li>What if you could easily identify, contact, and close prospects that generate over one million dollars in revenue per year and won't complain and beat you up on your pricing?</li><li>What if you could find 1,000 million dollar clients within driving distance from your home or office?</li><li>What if you could give an ultimatum to your cheap clients to: <em style=\"\">Pay up or find another provider?</em></li></ul><p><br style=\"\"></p><p>This is where <em style=\"\">Million Dollar Prospecting: How to Sell To 7-Figure Clients</em> will help you.<br style=\"\"></p><p>  \t    I am a career sales professional with experience working on Wall Street and in inside B2B technology sales for one of America's fastest growing venture backed companies. I share with you the tools I use to generate dozens of meetings, proposals, and closed deals with million-dollar clients in my businesses each month.</p><p>I will introduce you to free technologies that help you identify, contact, and close million dollar  clients with less frustration, less pain, and less time than <em style=\"\">The Old Way.</em><br style=\"\"></p>  <p>If you want to take the pain from prospecting and consistently generate warm, qualified leads for your business, check out this course today. </p><p>If you aren't 100% satisfied, submit a request for a full refund: I stand by my courses 100%. </p>", 
    "end_date": null, 
    "title": "The Ultimate Sales Prospecting Course", 
    "price": "20.00", 
    "instructors": "Chad Pavel", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/391366_dd3a_3.jpg", 
    "course_url": "https://www.udemy.com/dealflowpro-painless-prospecting-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-11T18:34:39Z"
}