{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Creating a podcast changed my life. It made me more employable, it helped me start my own life as a consultant and it gave me a strong professional network that continues to support me and provide me with all kinds of opportunities.</p>  <p>At the end of this course, you'll understand how to create a podcast that has focus and structure. You'll also understand how it can be used it as the ultimate marketing vehicle for yourself, whether you want to break into a new industry and become an expert, further your current career and strengthen your network or simply start a new project and see where it goes.</p>  <p>In the course I'll show you my own case studies of success and failure. You will see why it's important to choose the right niche for your show (and your personality), and why you should treat your own personal back story ('about' section) as well as your own house.</p>  <p>We'll also discuss planning interviews and guests, how to attract hard to get guests to your podcast and how to develop a unique hook that will make your podcast stand out from the competition.</p>  <p>Finally, we'll look at promoting and marketing your show especially when you're on a tight budget and at the very end you'll find examples of how you can make money from your podcast.</p>  <p>I designed this course for people that are bored of standing in line with their resumes, waiting for things to happen. If  you want to accelerate your career, become a recognised industry expert  and create a powerful professional network then you're in the right place! </p>", 
    "end_date": null, 
    "title": "The Simple Guide To Starting & Monetizing Your Own Podcast", 
    "price": "20.00", 
    "instructors": "Fred Williams", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705854_d3df_3.jpg", 
    "course_url": "https://www.udemy.com/the-power-of-podcasting/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T16:46:06Z"
}