{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Anyone can <strong>tell</strong> you how to start a crowdfunding campaign, but not many people can <strong>show</strong> you. I'm going to do both. The biggest asset you receive from this course is the fact that I have personally built and launched my own extremely successful crowdfunding campaign and I'm not just giving you information you can probably find through a search engine. </p><p>You will see how everything looks and works on the backend of kickstarter in various screen recorded tutorials, all while I explain how to properly use and function all of its resources.<br></p><p>I will teach you how I did it from A to Z, while overcoming hurdles and obstacles along the way. I will share with you my personal experience of creating a Kickstarter campaign, how my project was featured on some of  the biggest news sources in the world (Mashable, Buzzfeed, New York Times, Huffington Post, Cosmopolitan, Refinery29, etc.), and how I did it with absolutely no crowdfunding experience, no photography or videography knowledge/experience, and no budget all in just 30 DAYS.</p><p>Before your project, during your project, and after your project.. I will teach you EVERYTHING you need to know about launching a successful project. I am so confident that my course will help you launch a successful campaign, that I will offer a 30-day money back guarantee if that isn't the case. <strong>This is a course you do not want to miss out on.</strong><br></p>", 
    "end_date": null, 
    "title": "The Ultimate Kickstarter Guide: How my project raised 784% !", 
    "price": "20.00", 
    "instructors": "Ahmad Ghanem", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/623780_61ed_6.jpg", 
    "course_url": "https://www.udemy.com/kickstarter/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-27T15:44:21Z"
}