{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Because of Amazon Prime restrictions this course is only applicable to people living in either the USA, Canada, UK, France, Germany, Spain or Italy.</strong></p><p>If you live <strong class=\"redactor-inline-converted\">outside</strong> of these countries then the information inside this course will <strong>not</strong> be of use to you.</p><p>------------------------------</p><p>In the next <strong class=\"redactor-inline-converted\">2 hours and 25 minutes of video tutorials</strong> you will discover how you can easily create a full time income selling second hand books for huge profits. You will learn what the Fulfilment by Amazon method is all about and how you can use it to <strong class=\"redactor-inline-converted\">buy books for pennies</strong> and sell them, often with <strong class=\"redactor-inline-converted\">no competition</strong>, for $20, $30, $50 and more on Amazon.</p>\n\n<p>You learn all of the every day places that you can buy the perfect used books that will bring in the biggest profits while avoiding the duds.</p>\n\n\n\n<p>If you've ever wanted to learn how to sell on Amazon but you didn't want to deal with drop shipping or importing goods from wholesalers or manufactures then this course is what you're looking for.</p>\n\n\n\n<p>The course is structured to take you from total beginner with no prior knowledge of selling on Amazon or using the FBA system to a seasoned Pro who can spot the best books that sell for the biggest profits and often without needing to leave home.</p>\n\n\n\n<ul><li>No Droppshipping</li><li>No Importing</li><li>No Wholesale suppliers</li><li>Perfect For Complete Newbies</li><li>Can All Be Done From Home</li></ul>\n\n<p>This method can only be used if you live in a country where Amazon offer their Prime service which currently only include the USA, Canada, UK, France, Germany, Spain and Italy. If you live outside of these countries then please do not enrol in this course as the information will not be of any use to you.</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "The Ultimate FBA System. Learn To Sell On Amazon", 
    "price": "40.00", 
    "instructors": "Michael Sherriff", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854858_8f76_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-fba-system-learn-to-sell-on-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T09:27:07Z"
}