{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Hi, I am Mike Stemple a professional, multi-successful, serial entrepreneur and innovator. I am really excited to make my courses available here on Udemy. It seems like just yesterday I had the opportunity to mentor one of the founders of Udemy as he made his way through Founder Institute, and now I am launching a series of courses on his amazing startup!<br style=\"\"></p><p style=\"\"><strong style=\"\">Overview</strong></p><p style=\"\">Inspirer Mike Stemple, an expert at ideation, innovation, startups, and brand creation, who has built over 20 companies that have grown to be worth $100+ million, for the first time is revealing all the tips, tricks, hacks, and processes he used, and still uses, to rapidly grow an idea into a full fledged business. A sought after speaker and an award winning mentor Mike&#039;s teaching style is to the point, based on REAL world experience and at times humorous in his candor and life lessons. Along with his video lessons Mike is sharing his treasure trove of cheatsheets, templates and how-to guides that he has himself built over a 20 year successful career. These documents by themselves are worth thousands of dollars and they are included with each relevant course.</p><p style=\"\">Mike has created dozens of brands for companies and products in his career seemingly overnight and for the first time he is revealing all his tips tricks and giving away his cheat sheets and template files so new and established entrepreneurs can rapidly build out their brands themselves. In this course Mike walks you through the step-by-step process he uses to create a full brand presence in a day. Buckle up for this course is fast paced with Mike driving the mouse and showing exactly how he did it and still does it. This course is filled with over 20+ template files and cheat sheets that will save you thousands of dollars while also giving the confidence to create your own brands.</p><p style=\"\"><strong style=\"\">Here are some of the questions covered:</strong></p><ul style=\"\"><li style=\"\">How do you develop a good name for your business?</li><li style=\"\">How do you position the business with a name?</li><li style=\"\">What characteristics make a good name?</li><li style=\"\">How do you test different name candidates?</li><li style=\"\">What infrastructure do you need when you pick your name?</li><li style=\"\">Are there tips to finding a good domain name?</li><li style=\"\">What social media platforms should you look to get your name on?</li><li style=\"\">How do you develop a logo?</li><li style=\"\">Does a name really matter?</li></ul><p style=\"\"><strong style=\"\">Here are some of the topics covered:</strong></p><ul style=\"\"><li style=\"\">Why you should clean up your personal social media profiles.</li><li style=\"\">Why personal websites matter.</li><li style=\"\">The importance of a consistent personal story.</li><li style=\"\">How to choose a great domain and business name.</li><li style=\"\">Pitfalls of phonetic naming.</li><li style=\"\">How to find a great URL.</li><li style=\"\">How to see if your domain name id blacklisted.</li><li style=\"\">How your company colors plays a role in emotion.</li><li style=\"\">How to pick great company colors.</li><li style=\"\">How to quickly create a logo.</li><li style=\"\">How to find good looking logo font.</li><li style=\"\">How to find a logo icon and why you need one.</li><li style=\"\">What logos do you need to make and have on file.</li><li style=\"\">How you can hire someone to make a great logo.</li><li style=\"\">Where to buy a turn-key brand and domain.</li><li style=\"\">Template files for making your own logos anytime.</li><li style=\"\">How to create a brand guideline.</li><li style=\"\">How to keep track of where your brand files go and why you should care.</li><li style=\"\">What type of website do you need.</li><li style=\"\">How to save a ton of money buying a theme.</li><li style=\"\">What do you need to have on a professional website.</li><li style=\"\">How to setup your website yourself.</li><li style=\"\">How to check your website before you launch.</li><li style=\"\">How you can search for great usernames on social media.</li><li style=\"\">What social media accounts you need to have.</li><li style=\"\">How to make your social media account appear more valuable.</li><li style=\"\">How to manage all your accounts everyday.</li><li style=\"\">How to quickly make all the social media account images for a great brand appearance.</li><li style=\"\">How to make a simple email signature.</li><li style=\"\">How to secure my email to look more professional.</li><li style=\"\">How to insure my email address is not picked up by spam-bots.</li><li style=\"\">How to quickly design my own business card.</li><li style=\"\">How to always have a business card on you.</li><li style=\"\">Why business cards still matter.</li><li style=\"\">Have all the correct info on you business card.</li></ul><p style=\"\">64 Lessons &amp; 24 Downloads<br style=\"\">Total: 4h 45m 20s : Min: 1m 36s : Max: 19m 0s : Avg: 4m 46s</p><p style=\"\"><strong style=\"\">Why This Course Is So Unique</strong><br style=\"\"></p><p style=\"\">I actual TEACH it. Most instructors write up content and use a teleprompter to deliver it, I don&#039;t. All my lessons are taught with only notes for my review. I believe the best instructors SHOULD be able to talk about their topics without a script. Because I do not follow a vetted script my lessons take you on a journey. I talk about the real-world success and more importantly the mistakes I made in my companies. I teach each topic off the top of my head because I know the content inside and out. After building 20 companies and hundreds of products I know all the mistakes you can make and will teach you how to avoid them. All my courses also use real-world examples that I ACTUALLY did vs pointing to someones else&#039;s success and teaching to it.</p><p style=\"\">Additionally all my courses feature numerous downloads of the ACTUAL files I use to build my companies. I walk you through each one and demonstrate how I use them to rapidly grow my ideas into companies.</p><p style=\"\">And finally I ACTUALLY am the one in the forum answering questions, not some intern or outsourced partner. My responses are sometimes pithy, sometimes funny, sometimes insightful, and always genuine.</p><p style=\"\"><strong style=\"\">Money Back Guarantee</strong></p><p style=\"\">All my courses come with an unconditional, Udemy backed, 30 day money-back guarantee.</p>", 
    "end_date": null, 
    "title": "The Serial Entrepreneur's Guide To Startup Brands", 
    "price": "50.00", 
    "instructors": "Mike Stemple", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/451462_1a15.jpg", 
    "course_url": "https://www.udemy.com/how-i-create-10mm-startup-brands/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T18:15:08Z"
}