{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc</p><p><strong class=\"redactor-inline-converted\">Are You Interested In Becoming An Instructor On Udemy And Learning The Step By Step Method To Creating Online Courses That Are Guaranteed To Sell?</strong></p><p>The online education industry reached a staggering $107 billion in 2015 and it's growing year after year. With smartphones, iPads, laptops and faster internet, people can now learn what they want when they want.<br><br>Udemy right now is like a gold rush, and it's just beginning. Millions of students are flocking here to learn and find the solutions to their problem, and <em class=\"redactor-inline-converted\">instructors are making bank</em>. </p>\n\n<p>Instructors don't spend a dime on advertising and promotion by letting Udemy do that for them whilst still pulling in 5 figures per month.</p>\n\n\n\n<p>Learn how to properly create courses that are guaranteed to sell where you can launch your course and sit back watching the sales roll in.</p>\n\n\n\n\n\n<p>You can spend a couple of days creating a course that will bring you <em class=\"redactor-inline-converted\">thousands of dollars</em> in extra revenue month after month. Then do it again with more courses and watch your income build up.</p>\n\n\n\n\n\n<p>Imagine making a full time income from recording a few simple videos and uploading it to Udemy where then it's their job to sell your course.</p>\n\n\n\n\n\n<p><strong>How is this possible?</strong> </p>\n\n\n\n<p>Udemy makes money from selling online courses, so it's in their best interest to sell as many courses as they can, and this means they actively promote your courses for you. There is no other website like it in existence.</p>\n\n\n\n\n\n<p><em>It's the easiest way to make money online in 2016, and it's just the beginning.</em></p>\n\n\n\n\n\n<p>Top instructors are making millions of dollars per year selling what they already know. Imagine if you take just a fraction of that? $100,000 per year? $50,000 per year? And all that in your sleep. Just put your course out there and Udemy will do the rest.</p>\n\n\n\n\n\n<p>Don't beat yourself up for not taking advantage of this great opportunity and share your knowledge with the world right now by learning how to do it properly with this course.<br><br><strong class=\"redactor-inline-converted\">In this Udemy course creation course, you will learn:</strong></p>\n\n\n\n\n\n\n\n\n\n<ol><li>How to find the perfect topic for your course that has a massive audience eager to learn to ensure that your course is guaranteed to sell.</li><li>The best way to gather highly valuable information for your course so your students are dying for more.</li><li>How to go about properly creating your course lectures and videos so that it looks professionally made and makes you look like you've been doing this for years</li><li>How to set up a sales page and promo video that influence potential students to take your course (Doing this wrong leaves a lot of money on the table and I'll show you why most instructors aren't doing it properly)</li><li>A whole list of promotional strategies that will get you massive sales straight away.</li></ol>\n\n\n\n\n\n\n\n\n\n<p>And a whole lot more.</p>\n\n\n\n\n\n<p>With a 30 day money back guarantee, if you're not getting the results I'm promising you then the refund is yours no questions asked. You have absolutely nothing to lose and everything to gain.</p>\n\n\n\n\n\n<p>Grab your pick axe and take advantage of the modern day gold rush, and start creating online courses now. <br></p>\n\n<p>This course is not sponsored or affiliated with Udemy, Inc<br></p>", 
    "end_date": null, 
    "title": "The Complete Guide To Selling Courses On Udemy - Unofficial", 
    "price": "20.00", 
    "instructors": "Mr Daniel Boehm", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814234_6bd9.jpg", 
    "course_url": "https://www.udemy.com/the-complete-guide-to-creating-selling-courses-on-udemy/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T08:08:18Z"
}