{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  <strong style=\"\"><em style=\"\">Ever feel generally overwhelmed even though you work your butt off?</em></strong></p>  <p>  \t        Struck by that you do everything you can to get ahead, yet seem to be sinking beneath all you need to be doing?</p>  <p>  \t     Maybe you have a million things to do you and you sit not really knowing where to start, feeling like you are doing something wrong when you look at all the successful people out there...  </p>  <p><strong style=\"\">THIS COURSE WILL SHOW YOU HOW TO FIX THIS</strong></p>  <p>  \t               As an entrepreneur (or aspiring one) you will be faced by the most menacing and persistent distractions that<strong style=\"\"> will</strong> cause you to fail if you let them. Staying focused and effective to build a successful business is one of the most difficult aspects of entrepreneurship (as well as working in business), but that&#039;s <em style=\"\">exactly</em> what this course will walk you through, step by step.  </p>  <p>  \t               This course is about the specifics of ensuring you maintain laser focus, cut through all the BS, and maintain constant efficiency without burnout.  </p>  <p>  \t            This is taught through 4 primary sections:  </p>  <p>  \t            1. <strong style=\"\">Efficacy</strong>: Sorting through all the minutiae to focus on the few things that REALLY matter in your business, and ignoring or outsourcing the rest.  </p>  <p>  \t            2. <strong style=\"\">Efficiency</strong>: Now that you are focused on doing the things that actually matter, it is time to be uber productive and power through as much as possible so that you are always on top of things. <em style=\"\">Maximizing</em> output while <em style=\"\">minimizing</em> input.  </p>  <p>  \t            3. <strong style=\"\">Avoiding distractions</strong>: This goes far beyond text messages and email notifications...there will be new threats constantly and fundamentally derailing you unless you do THESE things.  </p>  <p>  \t            4. <strong style=\"\">Common pitfalls of entrepreneurs</strong>: Let&#039;s face it, entrepreneurship is hard! This section details all the common problem areas that startups and entrepreneurs encounter that almost <em style=\"\">everyone</em> goes through, but I want to help <strong style=\"\">you</strong> avoid. Destroying some conventional wisdom here, so some of these WILL surprise you...  </p>  <p>  \t            These lessons combine the best practices of entrepreneurship with advanced techniques in ADHD management. Why you ask? Because being in the chaos and distractions of entrepreneurship is quite similar to ADHD in its challenges, and because if entrepreneurs who actually have ADHD (extremely common) can succeed in being focused, then so can you, utilizing some the same lessons learned.  </p>  <p>  \t            Even the downloadable tools alone are worth the price of this course. Get started today and start avoiding the massive sinkholes of time, energy, and money that you will inevitable encounter in your business.  </p>  <p>  \t        What have you got to lose?  Let me give you laser focus in your business today.  </p>  <p>  \t        See you on the other side,  </p>  <p>  \t        Grant Weherley, APA, ADDA, Serial Entrepreneur, Author of<em style=\"\"> Break the System</em></p>", 
    "end_date": null, 
    "title": "The Focused Entrepreneur: Double Your Productivity", 
    "price": "20.00", 
    "instructors": "Grant Weherley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/193174_b634_5.jpg", 
    "course_url": "https://www.udemy.com/laser-focused-entrepreneurship/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-03T04:53:40Z"
}