{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Ever ask yourself if you could become a successful entrepreneur and free yourself from the 9-to-5 grind? Chances are you have asked yourself this question dozens of times. The entrepreneurial desire is burning within you. You want to spend more time chasing your dreams and spend less of your time at the job you hate.</p><p>But every time you ask yourself this question, <strong>you always come across the same roadblocks</strong>.</p><p>You want to become an entrepreneur, but you wish you had the expertise. You wish you knew which opportunities to leverage, how to incorporate entrepreneurship into your current lifestyle, and access to a mentor.</p><p>Basically, you want to know where to start and how to continue on the entrepreneurial journey. Most people go into entrepreneurship with blindfolds wondering where to begin and how to expand. <strong>Those blindfolds don't work</strong>.</p><p>In fact, those blindfolds are one of the main reasons why<strong> 8 out of 10 entrepreneurs' businesses crash and burn in the first 18 months.</strong> If you do what the majority does, then expect the results that the majority of people get. What would happen if your business crashed and burned in the first 18 months? It's scary to think about.</p><p>It's been well over 18 months since I became an entrepreneur. Not only is my business standing, but it is also thriving. <strong>Through intense trial-and-error, I discovered the path to entrepreneurial success.</strong></p><p>And in this course, I will reveal what you need to know to become a successful entrepreneur. You can get out of that job you hate. You can build a thriving business based on something that you love to do. You can be your own boss.</p><p><strong>But only if you are ready to take action. </strong></p><p>If you wish to pursue the path towards entrepreneurial success without wearing the blindfolds, then click \"Take This Course\" now.</p>", 
    "end_date": null, 
    "title": "The Ultimate Entrepreneur Course For Massive Success In 2016", 
    "price": "20.00", 
    "instructors": "Marc Guberti", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715660_7d08_2.jpg", 
    "course_url": "https://www.udemy.com/ultimate-entrepreneur-course/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T15:16:17Z"
}