{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is all about how tradesmen and women can get more customers and make more money using the internet and modern day business development methods.</p><p>It aims to provide you with a support framework for entrepreneurial learning within the construction industry. </p><p>It aims to assist in the business education and development that is holding your construction business back.</p><p>Topics include:</p><ul><li>How to make sure your customers can find you</li><li>How to target your paying and profitable customers</li><li>The tradesmens guide to making money using social media </li><li>How to turn your contacts into money</li><li>Identifying your key services and turning them into cash</li><li>How to get free marketing</li><li>How to get other people's paying customers as your own</li><li>The Tradesmen's 2016 'Make More Money' Plan</li><li>BONUS: Get your FREE eBook</li></ul><p><br></p><p>This course of 20+ tutorial videos will provide tradesmen and tradeswomen - anyone who is a self-employed 'tradie', or has a 'man in a van' type business, to get more customers and make more money.</p><p>It will provide you with the fundamental strategies for making more money while doing less; so that you can increase your income without constantly pulling 50+ hour weeks and wondering where the next project is coming from.</p><ul><li>Run by two successful business owners, this course for tradies is the start to getting the internet to work harder for you and your bank account laughing again.</li></ul><p><em>We are not there to teach a carpenter to chop wood, we are there to aid him grow his carpentry business. THERE IS MONEY TO BE MADE BY GOING ONLINE, let us who have been there from business start-up right through to sale of a large award winning company show you the way.</em><em></em></p>", 
    "end_date": null, 
    "title": "The Trademan's Guide To Marketing", 
    "price": "50.00", 
    "instructors": "Sarah Cordiner, Ciaran Brennan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/668490_8f77_2.jpg", 
    "course_url": "https://www.udemy.com/the-tradesmans-guide-to-making-more-money/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-13T05:05:16Z"
}