{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Last Updated: February 4th 2016<br></p><p>I've been a full time entrepreneur since the age of 24 when I quit my IT engineering job making over $70,000 a year to pursue a music career.</p><p>I sold hundreds of thousands of albums in the music industry starting my own record label and decided to invest in real estate after reading the book Rich Dad Poor Dad.</p><p>I continued to have success becoming debt free in 2015 with no loans, mortgages or lines of credit anywhere in the world.</p><p>I have now built a successful online business generating thousands of dollars every month including my other businesses that are running without me.</p><p>The biggest obstacle I had to face was fear and overcoming the doubt in my mind that said \"I couldn't do it\".</p><p>There has never been a better time for us as entrepreneurs to start a business solving peoples problems and turning a profit.</p><p>The key is you just have to start!</p><p>This course takes you step by step what it takes to become a successful entrepreneur teaching you the new rules of entrepreneurship.</p><p>You will be motivated, challenged and encourage to take action in this course.</p><p>There is no sugar coating it or magic pill that is going to make you rich over night.</p><p>You have to put in the time and work to make your dreams a reality.</p><p>This course will help get you there but it is YOU that is going to make the difference.</p><p>Never give up!</p><p>Chris</p>", 
    "end_date": null, 
    "title": "The Successful Entrepreneur 10 New Rules of Entrepreneurship", 
    "price": "20.00", 
    "instructors": "Christopher Greenwood", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/729364_0fb3_2.jpg", 
    "course_url": "https://www.udemy.com/newrulesofsuccess/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T18:58:30Z"
}