{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>When it comes to having the right skills to launch and operate a successful business, you will be far ahead of the competition when you are able to learn from successful, seasoned mentors. &nbsp;</p><p>This first course, &quot;Getting Started&quot;, in the Entrepreneur&#039;s Playbook Series is a fun, and interactive way for you to learn many of the basic business and personal things you will need to reach success faster, and with less failure. This first course is three hours, and will help set a strong foundation to learning over 50 total hours in the entire series. If you stick with with the entire series, you will receive more direct information than an entire semester of learning, but at small fraction of the cost!<br style=\"\"></p><p>In this first course, you will learn about the Critical Flow of the Free Enterprise System and how to maximize positive business growth in any economy. <br style=\"\"></p><p>We will discuss 9 Signs of Successful Entrepreneurs and why they have found success in their business ventures. Once you master these 9 areas you will find the success in your own business and personal life you are hoping to achieve.&nbsp;</p><p>Next we move into some crucial elements about leading and motivating your team. This critical area will make or break your business depending on how much attention you place here. <br style=\"\"></p><p>Then we start to learn about what makes you unique and how your skills and talents (and those that you may not even know about) will help you build a successful business - whether you are just starting out, or you already have an operating business. This section is a refresher course that even the most seasoned business people should take at least twice a year to help re-focus and re-double our efforts towards the passion of being in business.&nbsp;</p><p>Our next area of focus will be centered on 10 Questions that you will need to answer before you launch your business, or move into the next phase of your business if you are an existing business owner. If you can honestly answer these questions, then you will be miles, and even years ahead of your competitors. After 30 years of running highly successful ventures, these are the top 10 questions that can make or break your business - depending on your answers.</p><p>We wrap up this course with some very cool ways to make your business recession proof. When you build on this information you will be armed with the knowledge and the tools to build a solid business case to attract customers, strategic alliance partners, and key investors.&nbsp;</p>  ", 
    "end_date": null, 
    "title": "The Entrepreneur's Game Plan", 
    "price": "20.00", 
    "instructors": "Brian Hazelgren", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/53114_b904_10.jpg", 
    "course_url": "https://www.udemy.com/getting-started/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-09T18:19:03Z"
}