{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is the ONLY Udemy course on Social Enterprise. Purchasing ‘The Complete Guide on How to Build a Social Enterprise’ will give you LIFETIME ACCESS to all the videos and resources. With Udemy’s 30-day Money Back Guarantee, if you find learning about Social Enterprise isn’t for you, Udemy will give you a full refund.</p><p>How to Build a Social Enterprise will talk you through creating a business of your own that also does good for both society and the environment. The course is filled with resources and tools to make sure you are on the right path. </p><p>Be Your Own Boss and Spread Positivity - what could be better? This is a course for people who want to make a real difference to their local communities and even the whole world, whilst making money too.</p><p>This course will also encourage you to grow as a person and a lecture on Personal Goals is also included. Featuring an entire module to Marketing and Communications ensures that once you have your business idea, you are ready to shout about it! </p><p>Join this course to be an Entrepreneur with a difference. Or even if you are curious and want to learn about the world of Social Enterprises… I look forward to you joining me, and if you have any questions in the meantime, feel free to send me a message. Many thanks, speak soon.</p>", 
    "end_date": null, 
    "title": "The Complete Guide on How to Build a Social Enterprise ", 
    "price": "30.00", 
    "instructors": "Kimberley Corr", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692246_f8dd_11.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-social-enterprise/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T19:38:07Z"
}