{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t            The hardest part of starting your own business is taking the first step. This course is designed for budding entrepreneurs of all backgrounds and experience levels. If you're even remotely interested in becoming an entrepreneur or starting your own business, you can't afford to miss out on Guy's 30 years of hard-earned wisdom.  </p>  <p style=\"\">  \t<strong style=\"\">Discover How to Build a Business and a Brand Identity that Wows Investors and Attracts a Devoted Following</strong>  </p>  <p style=\"\">  \t            ·Master the essential steps for creating your own company.  </p>  <p style=\"\">  \t            ·View your startup through the eyes of marketing evangelist Guy Kawasaki.  </p>  <p style=\"\">  \t            ·Improve the efficiency of your business plan by learning what steps to avoid.  </p>  <p style=\"\">  \t            ·Experience a live pitch by an entrepreneur and hear uncensored feedback.  </p>  <p style=\"\">  \t<strong style=\"\">Develop a Versatile Approach to the Startup Process from a True Innovator who’s been both an Entrepreneur and an Investor</strong>  </p>  <p style=\"\">  \t            In this course, you’ll not only learn the essential principles of starting your own business, you’ll also benefit from the course instructor Guy Kawasaki’s 30+ years of experience working as an entrepreneur, advisor, and investor.  </p>  <p style=\"\">  \t            Guy understands the entrepreneur’s point of view and the investor’s point of view, and he will help you to see your business from both sides of the table. When you take this course, you will receive privileged access to Guy’s unique anecdotal advice about his experiences working for technology giants like Apple and Google, and his role in creating several innovative Silicon Valley startups.  </p>  <p style=\"\">  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p style=\"\">  \t            Whether you already have a detailed business plan or just a great idea that you’re passionate about, you’ll find value in the way this course breaks down  the various concepts of entrepreneurship in an easy and accessible manner with plenty of real-world examples, tips and tricks, and wisdom from a seasoned entrepreneur.  </p>  <p style=\"\">  \t<strong style=\"\">·Entrepreneurship from A to Z:</strong> Starting with Launching and Pitching, moving on to Fundraising and Team Building, and concluding with Marketing and Evangelizing, this course will take you through each step necessary to start your own business.  </p>  <p style=\"\">  \t<strong style=\"\">·Interactive Exercises:</strong> You’ll watch as an entrepreneur just like yourself pitches his company to a potential investor and then hears Guy’s uncensored feedback.  </p>  <p style=\"\">  \t<strong style=\"\">·Answers to FAQs:</strong> Guy will answer several commonly asked questions that have been posted on his social media pages, including “When do you know when you have a winning idea?” and “How do you stay positive during the lows and stay calm during the highs?”  </p>  <p style=\"\">  \t            After completing this course, you will understand a range of time-tested strategies and have gained practical advice that takes you further along the journey from having an idea to being a full-fledged entrepreneur. You will gain the clarity and confidence needed to create a lasting, influential company.  </p>", 
    "end_date": null, 
    "title": "The Essential Guide to Entrepreneurship by Guy Kawasaki", 
    "price": "40.00", 
    "instructors": "Guy Kawasaki", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399444_78d4_5.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-course-by-guy-kawasaki/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T22:18:37Z"
}