{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">You don&#039;t have to quit your job to start a business!  Keep your paycheck and benefits while you grow a business and earn extra income.  Many courses teach how to start a business, but this is <strong style=\"\">the <em style=\"\">only</em> business course that shows you the path towards quitting your job</strong>. Isn&#039;t it time that you stop working hard to make someone else rich? Start directing your hard work towards creating a foundation of <strong style=\"\">wealth and freedom</strong> for yourself!<br style=\"\"></p>  <p style=\"\">  \t                    In this course, Joe Papa reveals how he started <strong style=\"\">multiple six-figure businesses</strong> to earn extra income and quit a high-paying engineer job.  Joe explains how he started four businesses and three brands over the past decade while working a full time job, and, for the first time, he shares how to <strong style=\"\">grow your business and develop your entrepreneurial skills while you work.</strong>  </p>  <p style=\"\">  \t                    Growing a business while you work is challenging and unique.  This course is specifically designed for <strong style=\"\">people that want to start a business or grow their income while working a job</strong>.  </p>  <p style=\"\">  \t                    In this course you will:  </p>  <ul style=\"\">  \t<li style=\"\">Create a <strong style=\"\">Clear Plan</strong> on How You Will Earn Enough Extra Income to Quit Your Job</li>  \t<li style=\"\">Learn the <strong style=\"\">Most Popular Business Types</strong> for Working Entrepreneurs and <strong style=\"\">Get Ideas</strong> for Your Own Business</li>  \t<li style=\"\">Easily Decide Which Business to <strong style=\"\">Start in the Next 30-90 Days</strong></li>  \t<li style=\"\">Begin Developing Key <strong style=\"\">Entrepreneurial Skills</strong> While You Work</li>  \t<li style=\"\">Identify How Entrepreneurs <strong style=\"\">Think Differently</strong> from Employees and How to Adjust Your Mindset <strong style=\"\">Instantly</strong></li>  \t<li style=\"\">Discover <strong style=\"\">Hidden Ways</strong> Your Job Can Help Your Business Grow</li>  \t<li style=\"\">Utilize a Simple Framework to <strong style=\"\">Grow Profits</strong> While You Work</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Extra Guarantee</strong>  </p>  <p style=\"\">  \t                    In addition to the Udemy 30 Day Money back guarantee, I personally guarantee that you get extreme value from this course.  Take the complete course during the  first 30 Days and if you don&#039;t think you got <strong style=\"\">5X the value</strong> from what you paid, just ask for a refund. (Sorry, refunds do not apply to mobile purchases due to technical issues.)</p>  <p style=\"\">  \t<strong style=\"\">Support</strong>  </p>  <p style=\"\">  \t                    Although this course is not produced or backed by Udemy, the wonderful Udemy staff is available to assist if you have trouble or need assistance.  </p>  <p style=\"\">  \t<strong style=\"\">What this course is not...</strong>  </p>  <p style=\"\">  \t                    This course is not a business opportunity, a get-rich-quick scheme, or an offer to invest into any business.  We do not believe in get-rich-quick schemes or magic shortcuts, only hard work and persistence..  I am not an accountant, an attorney or an expert on anything, and do not provide professional advice that requires certification or other credentials.  This is my story, my perspective, and the techniques I&#039;ve used to get my own results and help many clients achieve their goals.  I don&#039;t know you or your personal situation and I can&#039;t make any earning claims or even claim that you will be able to do anything.  In fact, most people do not achieve results because it takes work...  But don&#039;t let that stop <em style=\"\">you</em>.  </p>  <p style=\"\">  \t                    Every day you waste precious energy and time working for someone else.  <strong style=\"\">Get Your Business Idea Off The Ground TODAY!</strong>. Start putting your plan into action and begin creating your foundation for  wealth and freedom.  </p>  <p style=\"\">  \t            Get Started Now. Click the <strong style=\"\">&quot;Take This Course&quot; Button</strong> in the upper right to enroll.  </p>", 
    "end_date": null, 
    "title": "The Complete Guide: Start A Business While You Work", 
    "price": "50.00", 
    "instructors": "Joe Papa", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373564_e9e1_8.jpg", 
    "course_url": "https://www.udemy.com/start-a-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-19T00:17:33Z"
}