{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong><strong>JOIN OVER 1800+ SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE!</strong><em></em></strong></p><p><strong><em>LATEST: Course is updated for month of July 2015.</em></strong></p><p><strong>4 July 2015: </strong>New lecture added! - Section 7 Lecture 55: Shopify</p>  <p>  \t<em>******************************************************</em><em>****************</em><em>*********************************************</em>  </p>  <p>  \t<strong>        THIS COURSE IS CREATED FOR ONE SIMPLE PURPOSE :  </strong>  </p>  <p>  \t                            To help you start your own Online Ecommerce Business from scratch.  </p>  <p>  \t                Whether you are - A total newbie on Ecommerce Online Business and clueless on how to get started:  </p>  <p>  \t<em>You will gain a</em><em> solid foundation on the WHATs and HOWs to </em><em>starting your own Ecommerce Business. This is a structured course that teaches you a systematic way to choose the right profitable products to sell,where to get product ideas, where to source products locally and overseas, and creating your own online store that will save you years of time figuring things out on your own.</em>  </p>  <p>  \t<strong>              About this course  </strong>  </p>  <ul>  \t<li>Over 60+ Lectures and 2.5 Hours of Content</li>  \t<li>Full, free lifetime access</li>  \t<li>All future extra lectures and upgrades are always included for free</li>  \t<li>30 day money-back guarantee -- my personal promise to your success!</li>  \t<li>Monthly BONUS Lectures to increase your sales</li>  \t<li>24/7 Instructor Chat Support -- I will personally help you</li>  </ul>  <p>  \t<strong><em>After taking this course, you'll be able to...</em></strong>  </p>  <ul>  \t<li>Learn how to choose the BEST product to sell to maximize profits</li>  \t<li>Learn where to find profitable product ideas that make TOP MONEY</li>  \t<li>Learn how to validate product ideas before launching to build a profitable online business</li>  \t<li>Learn the TOP 4 WAYS to acquire your chosen products for maximum success</li>  \t<li>Learn the Pros and Cons of Wholesale,Dropshipping &amp; Manufacturing</li>  \t<li>Learn where to source profitable products overseas and locally</li>  \t<li>Learn the Pros and Cons of sourcing products LOCALLY vs. OVERSEAS</li>  \t<li>Learn how to request a proper quotation from suppliers to get the BEST DEAL</li>  \t<li>Learn how to write the PERFECT Email to wholesalers/suppliers -- without getting ignored!</li>  \t<li>Learn why your Business Name and Logo are crucial to your business success!</li>  \t<li>Learn how to create an online store for FREE -- without any upfront and hidden fees included!</li>  \t<li>Learn how to use your COMPETITION to your advantage!</li>  </ul>  <p>  \t<strong>      By enrolling in this course, you will also receive support from me and I will be personally answering your questions in the student discussion area.</strong>  </p>  <p>  \t<em>************************************************************************</em>  </p>  <p>  \t<strong><em><em>30-Day Full Money Back Guarantee</em></em></strong>  </p>  <p>  \t<em><em>In the event that this course does not meet your expectations or you are unhappy with this course </em><em>for any reason</em><em>, I promise to give you a full refund with no questions asked.</em></em>  </p>  <p>  \t<em><em>************************************************************************</em></em>  </p>  <p>  \t                            If you are willing to learn and put in the effort to implement what I teach you in this course, <strong>go ahead now and click the big blue button at the top to enroll yourself and start experiencing the results for yourself!  </strong>  </p>  <p>  \t<strong>    I look forward to hear your personal success story and I'll see you on the other side!  </strong>  </p>", 
    "end_date": null, 
    "title": "The Ultimate Ecommerce Guide To Starting An Online Business", 
    "price": "20.00", 
    "instructors": "Ramon DeBelen", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386760_2ffa.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-ecommerce-guide-to-starting-an-online-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T15:46:48Z"
}