{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Have you ever wanted to learn how to use a 3D printer?</em></p><p>Imagine.. one day you design a digital model of an action figure to be 3D printed. You share it online and next thing you know thousands of people are downloading it and printing it out themselves! Your digital creation became a physical reality for legions.</p><p>This is the power of 3D printing and just one of the examples of its amazing potential.</p><p>Wouldn't it be awesome to <strong>show off vibrant prints</strong> <strong>you made yourself</strong> to your friends? There are online communities where people share and rate 3D designs. But it's even possible to monetize your 3D designs as well on 3D printing design marketplaces.</p><p>This course <strong>The Fundamentals Of 3D Printing </strong>includes the basic terms and definitions of 3D printing along with the history of the technology. One will be able to learn how to use a 3D printer and learn its potential future applications. There are also case studies on successful businesses already using 3D printing for customization. We take you through the creation of your own 3D model and walk you through 3 of the most popular 3D printing services to print, sell and share your design.</p><p>You will learn:</p><ul><li>The key 3D printing methods and technologies.</li><li>Proficiency in 3D design with TinkerCAD.</li><li>Where you can not only share but also sell your designs in various 3D marketplaces.</li><li>Important 3D printing stocks to invest in.</li><li>Know and identify the important parts of a 3D printer.</li><li>The materials which can be used for printing.</li><li>Identify major 3D printer manufacturers and services.</li><li>Discover 3D printing customization as a service through case studies including: Spuni, Shapify, Feetz, Sols and Protos Eyewear.</li><li>How to effectively use 3D Hubs, Shapeways and Thingiverse.</li><li>Different industries that are ripe for disruption with 3D printing.</li><li>Future prospects to start a 3D printing business.</li><li>The potential global impact of the technology.</li><li>Be able to teach others about the fundamentals of 3D printing.</li></ul>", 
    "end_date": null, 
    "title": "The Fundamentals Of 3D Printing", 
    "price": "25.00", 
    "instructors": "Jeffrey Ito", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618618_bc34_4.jpg", 
    "course_url": "https://www.udemy.com/fundamentals-of-3d-printing/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T23:26:42Z"
}