{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you are a business owner and aren&#039;t as successful as you hoped, or perhaps feeling quite overwhelmed by your business and kind of lost the love a little, then this mini program promises to help you re fall back in love with your business and take it to the next level!</p><p><br style=\"\"></p><p>I have coached and trained over 300 people and have started two businesses myself and so know the value of business training, but also have seen the exceptional progress that people make when they focus on personal development as well.</p><p><br style=\"\"></p><p>As you know, when you&#039;re running your own business, it&#039;s all down to you. The difference between mediocre business owners and really successful business owners is that the successful ones will also invest in themselves as they have identified that they are their business. If you don&#039;t work on yourself as well, unfortunately you will always feel overwhelmed or will not be as effective as you could be. It will continue to be a nerve-wracking process often leaving you feeling anxious, worried and ultimately not as successful as you deserve to be.</p><p><br style=\"\"></p><p>You only need to read a few of the most successful entrepreneurs and business owners like Richard Branson and Oprah to see what effect it can have on your business by specifically focusing on your personal development as well as the business development.</p><p><br style=\"\"></p><p>And this is where this programme is unique, we focus on you and your business so that you can develop as a whole and ensure that you are successful both from a personal and business point of view.</p><p><br style=\"\"></p><p>If you sign up to this program, you will get focus and clarity on yourself and your business, you will overcome barriers and will progress further and faster that you have in a long time! So you can stop feeling so overwhelmed about your business and start enjoying the success you deserve!</p><p>I know that business owners are not always feeling too flush when they search out support and so this program allows you to make loads of progress without feeling that fear of making a huge investment.</p><p><br style=\"\"></p><p>This program is made up of four vital topics to help you develop as a business owner . These include videos, work sheets and activities to help you constantly progress as a business owner.<br style=\"\"></p><p><br style=\"\"></p><p>In addition to this, there will be a support group where you can meet other like-minded individuals who are all focused on improving themselves and their businesses. If you&#039;ve read any success books or training, they always say to surround yourself with positive successful people and so this group will allow you to be inspired and to inspire others.</p><p><br style=\"\"></p><p>So if you want to live the life you deserve, then book your place today!</p>", 
    "end_date": null, 
    "title": "The Next Level", 
    "price": 0, 
    "instructors": "Kristiina Woollard", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381088_0608_2.jpg", 
    "course_url": "https://www.udemy.com/the-next-level/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-30T19:46:14Z"
}