{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\">Uncover new business prospects for your startup FAST...</strong></p><p style=\"\"><strong style=\"\"> Start closing more sales now!</strong></p><p style=\"\">Finally Crack the Email Prospecting Code! Let&#039;s face it, email marketing simply does not work for most people in sales. Almost every method being taught is simply another rehashed version of the same old stuff. – And None of it Works! </p><p style=\"\"><strong style=\"\">Learn to use this powerful 3x5 email marketing startup sales strategy and start seeing results.</strong></p><p style=\"\"><strong style=\"\">This is a complete lead generation sales process you can use - Nothing is left out of this sales coaching program! </strong></p><p style=\"\">- Deliver the business building leads to increase closed sales and generate leads using email, internet marketing while increasing your selling communication.  </p><p style=\"\">At the end of the day - it just doesn&#039;t matter how good of a sales person you are, if you don&#039;t have enough people to sell to.</p><p style=\"\"><strong style=\"\">Crack the cold email code and stop cold calling for business.</strong></p><p style=\"\"> Learn these sales growth, business building secrets. Increase your selling opportunity with these sales coaching ideas.</p><p style=\"\"> This sales training and coaching program has been built with a specific person in mind.</p><p style=\"\">Have people picking up the phone to call you &amp; Separate yourself from the competition. Do something different and dramatically increase your sales leads, good fit prospects and finally get in front of real decision makers…NOW!</p><p style=\"\"><strong style=\"\">The individuals who will make the most money, generate qualified leads and close more sales are those who have the ability to leverage the conversations they&#039;ve already had.</strong></p><p style=\"\">Learn email prospecting with a simple 3 step email sales formula.</p><p style=\"\">Generate sales leads with email marketing and using these 5 easy to implement sales coaching secrets.</p><p style=\"\"><strong style=\"\">Do what most don&#039;t to get the results others can&#039;t.- Start closing more sales now.</strong></p><p style=\"\">This is interesting… If we look around what do we see?</p><p style=\"\">Legions of people in sales all trying to be the best at what everyone else is doing.</p><p style=\"\">Once of the concepts we coach to comes from a quote by Peter Drucker.</p><p style=\"\"><strong style=\"\">“If you want something different – then you have to do something different.&quot;</strong></p>", 
    "end_date": null, 
    "title": "The Business Building Email Formula to Launch Your Startup", 
    "price": "35.00", 
    "instructors": "Bob Marx", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554622_1b95.jpg", 
    "course_url": "https://www.udemy.com/launch-your-startup/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T18:08:02Z"
}