{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t This course is based on the \"Best\" Startup Investor Pitch Deck Methodology, which has become the #1 Startup Pitch Deck online, viewed and downloaded over 300,000 times, and taught at top business schools and accelerators around the world.  This course is taught by its creator, J. Skyler (Sky) Fernandes, who is a top ranked Venture Capitalist, an Angel Investor, a serial entrepreneur, adviser to start-ups, and a frequent speaker on the topic of entrepreneurship at institutions such as Harvard Business School, Wharton, New York University, New York Stock Exchange, and also presented the first TED Talk on Venture Capital.  </p>  <p>  \t The knowledge you'll obtain from this class comes from an aggregation of some of the best pitch decks and wisdom from some of the top angels, VCs, and entrepreneurs, including Sky's personal insights and experiences.  </p>  <p>  \t The class is much more than just a template for entrepreneurs to use to present to investors and a discussion of what details should be addressed on each slide.  During each session, Sky will discuss personal stories and share some of the \"secret\" inner thinking that goes on inside an investor's mind and how (ultimately) they decide to invest in a select few of the thousands of opportunities that show-up in their in-boxes each year.  </p>", 
    "end_date": null, 
    "title": "The \"Best\" Startup Pitch Deck - How To Raise Venture Capital", 
    "price": "50.00", 
    "instructors": "J Skyler Fernandes", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140140_5e55_10.jpg", 
    "course_url": "https://www.udemy.com/the-best-startup-investor-pitch-deck/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-31T16:35:43Z"
}