{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>*** LIMITED OFFER - ENROLL FOR ONLY $39 ***</em></strong></p><p>I am eager to bring you my course about the <strong>essential tools</strong> for <strong>starting your career </strong>as <strong>freelancer</strong>! As this is course is still <em>under development</em> I am happy to offer you a <strong>second mover advantage</strong> of enrolling <strong>for only $39!</strong></p><p><strong><em>Upcoming lectures: </em></strong></p><ul><li>Create and manage projects the easy way</li><li>Never forget or lose sight of your documentation</li><li>Get a grip in finance: It can be Fun!</li><li>Creativity and Knowledge Buildup</li></ul><p><strong><em>*** ENROLL NOW ***</em></strong></p><p>I will cover the essential tools you need to know for <strong>starting</strong> and/or <strong>enhancing</strong> your freelancer business. You will receive <strong>Hands-On</strong> experience of me showing you the tools and what essential options you need to be aware of. In my career I had a lot of stressful situations in which the pressure of things to do and <strong>information overflow</strong> just got out of hands. Over the years I've been developing a unique work-style which combines <strong>structural approaches</strong> with the <strong>best tools</strong> available. <br></p><p><strong>Jumpstart Your Freelancer Career With The Proven Essential Toolkit And Hands-On Experience!</strong></p><p>I will show how you can become a master of work in the essential fields of:</p><ul><li>Conquer email management</li><li>Master personal task management</li><li>Have fun with project management</li><li>Find relief in creating financial transparency</li><li>Spark your Creativity </li><li>Create a habit of building up knowledge</li></ul><p>Find <strong>guidance through the wilderness</strong> and let me show you what to be aware of, how to structure your work, how to choose the right tools and what tools I am using today. To <strong>achieve my goals</strong> and <strong>get my tasks done.</strong><br></p><p>Beside me talking <strong>in person</strong> and explanatory screencasts I will provide you with the links to the tools so you can <strong>easily follow up</strong> and reproduce my steps on your computer. </p><p>As always: If you have any questions, please feel free to ask. <strong><em>I am here for you.  </em></strong></p>", 
    "end_date": null, 
    "title": "The essential Freelancer Toolkit: Work smarter. Not harder.", 
    "price": "20.00", 
    "instructors": "Florian Hettenbach", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577404_31d8_4.jpg", 
    "course_url": "https://www.udemy.com/the-essential-freelancer-toolkit-work-smarter-not-harder/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T14:12:30Z"
}