{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<pre style=\"\" class=\"prettyprint\">What do Pinterest, Snapchat, Amazon, and Alibaba all have in common? </pre>  <p>  \t        They were all started by <em style=\"\">non-technical founders</em> who <em style=\"\">couldn&#039;t code</em> and didn&#039;t have a <em style=\"\">CTO</em></p>  <p>  \t        Nowadays, anyone who has an idea is told they &quot;<em style=\"\">have to learn to code</em>&quot; or they have to &quot;<em style=\"\">find a partner</em>&quot;. <strong style=\"\">But learning how to code isn&#039;t realistic</strong>; it takes <em style=\"\">years</em> to get good at and forces you to neglect your other skill set. </p><p>Finding a technical partner is <em style=\"\">insanely difficult</em> because <em style=\"\">everyone</em> is trying to do it. And of you do find someone, its going to be really expensive.  </p>  <p>  \t        If you have an idea, you don&#039;t need to learn how to code and you don&#039;t need to sacrifice half your vision to someone &quot;<em style=\"\">technical</em>&quot;. </p><p>As an entrepreneur, a freelancer, or even a small business owner you <strong style=\"\">need</strong> to learn how to independently test and launch your ideas, <em style=\"\">without anyone else&#039;s help.</em>  </p><p><em style=\"\">________________________________________________________________________</em></p>  <p>  \t         Hi, I&#039;m Evan Kimbrell and I&#039;m the founder of Sprintkick, a full service web application studio based out of San Francisco. Over the last 4 years I&#039;ve personally overseen the launch of <strong style=\"\">over 100 apps</strong> all the way from concept to deployment. <em style=\"\">I have no idea how to code and I&#039;ve never had a technical partner. </em>  </p>  <p>  \t        I created this course to teach you how you can launch your idea without spending years learning how to code, having to recruit a partner, and without breaking the bank along the way.  </p>  <p>  \t<em style=\"\">What we&#039;re going to cover:</em>  </p>  <p>  \t         » 5 easy ways to pre-evaluate your idea before you even spend your first dollar. Do this in less than 1 hour. </p><p> \t         » The most effective and simple way of using a landing page for validation purposes, using Launchrock </p><p> \t         » How to wireframe like a pro with Balsamiq (in exactly 39 minutes) </p><p> \t         » How to determine the best route for designing your application  \t         - How to get your app designed for as little as $9 </p><p> \t         » How to get designers to compete for your app with no money upfront  \t         - Navigating the designer relationship and how to save as much money as possible </p><p> \t         » How to find and validate the best contractors  \t         - How to negotiate rates and guarantee on time delivery </p><p> \t         » How to bug hunt on both web and mobile with free tools  \t         - How to streamline communication throughout your project </p><p> \t         » Ways to save considerable money and time when working with a developer  </p>  <p>  \t      » How to leverage what you&#039;ve built to recruit going forward  </p>  <p>  \t         » Much more!  \t  \t<strong style=\"\"><em style=\"\">   And we&#039;re going to do this, all in less than a week!  </em></strong>  </p>  <p>  \t      The course is divided into 6 easy to follow sections that comprehensively cover all you need to know to take an idea from napkin to launch. This course isn&#039;t theory; it&#039;s 100% application.</p>  <p>  \t  \t         <strong style=\"\">Why you should take this course</strong>:  </p>  <p>- Over 22+ hours of content and direct access to me, the instructor, as a guide and personal helper (I respond to everyone)  </p>  <p>  \t        - You&#039;ll learn essential and repeatable skills like 10 minute validation, rapid wireframing, &amp; effective contracting. These are skills every entrepreneur and small business owner should know  </p>  <p>  \t        - Being able to identify an idea, test it, and launch it will be an invaluable tool even if you never do decide to pursue your idea. There will be unlimited opportunities to implement these skills in your life. </p><p> \t         - Learn a skill set that will make you a more well rounded Entrepreneur, freelancer, marketer, business owner, or sales expert. </p><p>  \t         - Course is updated WEEKLY with new tips, tricks, tools, and discussions.  \t         - Lifetime access to abbreviated summaries of each lecture, called &quot;cheat sheets&quot;. </p><p> \t         - Get to follow along and collaborate on a joint project. Get to watch me take an idea (voted on by the class) all the way through the process taught in this course and into deployment.  </p>  <p>  \t        I&#039;ve packed together everything I know from:  </p>  <p>  \t        - 3 years being a solo non tech founder building a mega app with no in-house tech team (that I raised several million dollars with)  </p>  <p>  \t        - 1 year working directly with 50+ non technical founders as a venture capitalist in Silicon Valley  </p>  <p>  \t        - 4 years as Director of Sprintkick, overseeing over 100 apps from concept to launch, for small startups and big Fortune 100 companies.  </p>  <p>  \t<strong style=\"\"> Included in this course</strong>: FREE access to hand written legal documents. These documents cost over $5000 to get made, and our Udemy students will get them for FREE.  </p>  <p>  \t      I know the frustration that someone can feel when they have a business idea, and they can&#039;t act on it.</p><p>  \t        REMEMBER: You have an idea and it&#039;s not going to get more valuable by sitting on it. Let me show you how to turn the idea quickly and cheaply into reality. Empower yourself with the this immensely valuable skill set and join the course. </p><p> \t  \t         Evan  </p>  <p>  \t        PS  If you&#039;re unhappy with the course for any reason, I promise I will personally refund you your money back. Anytime for any reason. I&#039;m not talking just the 30 day Udemy guarantee, I&#039;ll refund anytime. Seriously.</p>", 
    "end_date": null, 
    "title": "The Non-Technical Person's guide to building products & apps", 
    "price": "30.00", 
    "instructors": "Evan Kimbrell", 
    "commitment": "23 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369660_c351_3.jpg", 
    "course_url": "https://www.udemy.com/launch-your-idea-idea-to-mvp-with-no-cto-and-no-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-13T16:50:43Z"
}