{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong>COURSE DESCRIPTION</strong></p>\n\n<p><em><strong>LATEST:</strong> Course is updated for Summer 2016</em>-------------------------------------------------------------------------------------------------------------</p>\n\n<p>Do you know how I've found the time to write 30 books, hundreds of magazine articles, develop 11 online courses,  create more than a half-dozen commercial webinars, and consistently increase my income? By <strong>finding small chunks of free time </strong>that I sandwich between real-life \"have-to's\".</p>\n\n<p>\"<em>Nancy is a wealth of ideas about how to get more out of the small bits of time that can be easily wasted. I can see now how I will be able to progress towards some very large goals. Thanks!</em>\" Bruce Myron</p>\n\n<p>If you have a real life - and I hope you do - your days are probably filled with</p>\n\n<ul><li>kids</li><li>cooking</li><li>email</li><li>eating</li><li>work</li><li>Facebook</li><li>play</li><li>appointments</li><li>sports </li><li>friends</li><li>driving</li></ul>\n\n<p>What you <strong>DON'T </strong>have is four to six hours of free time every day to just sit down and quietly write . . . even though you want to write a book, make more money with your writing or start a freelance business.</p>\n\n<p>If this sounds like you, The 15-Minute Writer is exactly the right course for you. In this course you'll discover just <strong>how much you can get written in 15 minutes</strong>. And you'll be shocked at how those 15 minutes can add up over a week, month or a year. (Hint:Yes, you can write a novel using this technique). The reality is: <strong>the more you write the more your income can increase.</strong></p>\n\n<p>Don't spin your wheels if you don't have hours of free writing time because you really can accomplish more than you imagine in just 15 minutes of writing daily.</p>", 
    "end_date": null, 
    "title": "The 15-Minute Writer: The Ultimate Productivity Hack", 
    "price": "50.00", 
    "instructors": "Nancy Hendrickson", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452262_6f32_27.jpg", 
    "course_url": "https://www.udemy.com/the-15-minute-writer/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T15:13:14Z"
}