{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course covers the main aspects of developing your own 'online' coaching business in relation to: finding your best-suited to your practice 'niche' and developing short- and long-term strategies for 'attracting' new clients.</p><p>This course offers you an opportunity to expand your own coaching practice to the next level: through combining therapy and coaching in your session, and through implementing marketing strategies that are taught throughout the lectures. </p><p>This course is for those who are developing their own coaching practice and wishes to work as an 'online' coach or a therapist. <em>In this course the student will learn, for example</em>:</p><ul><li>What is the difference between 'therapy' and 'coaching' and how to combine both, </li><li>How to find your own 'speciality' or 'niche', </li><li>How to make sure that your 'niche' is profitable, </li><li>How to write and publish your own book within only a week or so</li><li>How to 'get known' through social media</li></ul><p>and much more.</p><p><strong>The BONUS lectures include:</strong> a) How much you should charge your clients for your services, b) When you should quit your 'current' job and start coaching full time, and c) Should you offer your 'free' trial sessions to your potential clients or not.<br></p><p>This course contains 29 lessons: some are as short as 3 minutes, whereas others are as long as 13 minutes. Each lesson is created to be engaging and thought provoking. </p><p>Most lectures are video-based, whereas a few lectures are text-typed for the purpose of studying the material at your own spare time. The course can be completed within 2-3 weeks. </p><p>The course will teach you how to find your own 'speciality', how to become an 'expert' in your field, and how to find your own clients both short- and long-term. After completing this course you will feel more confident about working as a successful 'online' coach. </p>", 
    "end_date": null, 
    "title": "Therapist / Coach Online: Find Niche + Get Clients in 7 Days", 
    "price": "20.00", 
    "instructors": "Elmira Strange", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747022_a0f0_3.jpg", 
    "course_url": "https://www.udemy.com/niche-clients-7days/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T16:44:17Z"
}