{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Take your new marketing tools and use them to build credibility and income!</strong></p><p>You have a book you wish to create and on your way to creating it.  Now the book is complete.  One thing, you don't know how to market it or how to use it for business so you can live the lifestyle that you desire.</p><p>Learn the tools necessary to maximize the vast work you put into your book and explode your income!</p><p>There are so many tools you can use to showcase and expose your best seller.  Learn the steps to take to create the right kind of relaionships with key people you wish to do business with, get on the stages you wish to be on, create the joint ventures that will make you tons of money!</p><p>Use tools like websites, opt ins, landing pages, giveaways, learn to leverage others, build joint ventures, use podcasting and videos to promote.</p><p>Learn how to publish your book and what options you have to do so.  You can use a traditional publisher or self publish or other options in between.</p><p>Do you create an ebook, a workbook, a paperback.  Which option is <strong>best for you and your purpose</strong>?</p><p>How do you integrate social media and video to promote your book?</p><p>You will learn all of these tools in this course!</p><p>Stop building someone else's dream and start living the dream you want to live!</p><p>Register today!</p>", 
    "end_date": null, 
    "title": "Top Three Steps to Authoring a Best Selling Book", 
    "price": "20.00", 
    "instructors": "Scott Paton, Randi Goodman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616914_089d_2.jpg", 
    "course_url": "https://www.udemy.com/best-seller-books-for-a-7-figure-income/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T23:50:51Z"
}