{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In <strong>Parts 1 and 2</strong> of <strong>'Transform Your Idea Into A Profitable Business'</strong> you learned how to create a viable business model, product prototype and how to market and build your brand.</p><p>But what about <strong>scaling up your business</strong>? That's hard to do if you're just one business owner. But, at the same time, you don't want your business to fail because you have <strong>chosen the wrong business partner</strong>.</p><p> How can you make the <strong>right decisions</strong> for your business?</p><p>Part 3 of this course is all about <strong>business partnerships</strong>. </p><p>This course will show you all that you have to do to <strong>prevent problems</strong> with your partnership and use it to boost your business:</p><ul><li><strong>Who</strong> to choose as a partner and <strong>how</strong></li><li>Understand the <strong>different kinds of partnerships </strong>and work out what is best for your business</li><li>How to <strong>structure the partnership</strong> for maximum success</li><li>How to prevent and resolve <strong>partnership disputes </strong></li><li>How to use partnerships to <strong>skyrocket your business growth</strong></li><li>How to create the <strong>legal agreements</strong> to protect your interests</li></ul><p><br></p><p>The course takes 2 hours to complete and includes templates and case study interviews by entrepreneurs who share their experiences.</p><p>This course gives you essential knowledge to avoid wasting time, money and stress in building up your business. If you have had a bad business partnership experience before, you can learn how to get it right this time. </p><p><br></p>", 
    "end_date": null, 
    "title": "Transform Your Idea Into A Profitable Business: PARTNERSHIPS", 
    "price": "45.00", 
    "instructors": "Christine Baker", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661886_30c9_2.jpg", 
    "course_url": "https://www.udemy.com/transform-your-idea-into-a-profitable-business-partnerships/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T09:02:19Z"
}