{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In today’s rapidly changing world, learning to lead and design our communities and organizations to ride the turbulence creatively is critical to our ability to make a positive impact. This course covers the subject of evolutionary change, and the implications for us as individual leaders, as well as for our organizational cultures and structures. It combines intellectual rigor with personal challenge, collaboration with creative expression. Students engage with integrative maps of organizational and leadership development, as well as instantly applicable practices for becoming more effective and dynamic as individuals and collectives.</p><p>This course has over 10 hours of professionally produced educational video, a wealth of learning resources including pdfs of all the slides used in the presentations and comprehensive multiple choice quizzes to help you test your progress and integrate your knowledge. This course is also available for academic credit with Ubiquity University - contact registrar@ubiquityuniversity.org.</p><p>You can also engage with others in the Facebook group for this course. Search for transformationalleadershippetermerry on Facebook and request to join the group!<br></p>    <p>The main subjects covered include:</p>    <ul><li>Transformation and Change</li><li>The Learning Organization</li><li>Levels of Leadership Development</li><li>Practices for Transformational Leadership</li><li>Personal Effectiveness and Resilience</li><li>Organizational Culture</li><li>Tools for Collaboration</li><li>Levels of Organizational Development</li><li>Creating an Agile Organization</li><li>Practices from the Future</li></ul>", 
    "end_date": null, 
    "title": "Transformational Leadership and Governance", 
    "price": "50.00", 
    "instructors": "Peter Merry", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362324_b4d2_3.jpg", 
    "course_url": "https://www.udemy.com/transformational-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T15:18:36Z"
}