{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Is there anything more frustrating than having a great product or service that <strong>no one is buying</strong>?</p>  <p>How you find and keep customers is <strong>NOT</strong> about yelling ‘buy me now – special price!’</p><p>Most entrepreneurs are <strong>not selling the way customers want to buy</strong>.</p><p>This course will give you the <strong>competitive edge</strong> you need.</p>  <p>In this course you will learn about:</p>  <ul><li><strong>Why</strong> customers buy (or not)</li><li>How to make your marketing messages <strong>stand out</strong> in a noisy and crowded marketplace</li><li>What is the no. 1 reason which will turn your <strong>prospects into customers</strong> (and it’s not about the price)</li><li>How to build long-term <strong>customer loyalty</strong></li><li>How to harness the power of <strong>social media promotions</strong></li><li>The <strong>power of a brand</strong> and how to create and grow it to stand out from the crowd</li><li>The 5 steps you must take to <strong>protect</strong> your brand and products</li></ul>                <p>At the end of this course you will be able to:</p>  <ul><li>Create marketing campaigns that hit your target market with <strong>laser precision</strong></li><li>Take the essential actions to <strong>build your brand and reputation</strong></li><li>Have confidence that you know how to build long-term <strong>customer loyalty</strong></li><li>Optimize your <strong>time and money</strong> spent on marketing campaigns</li></ul>          <p>This 2-hour course is packed full of ideas and each lecture has practical exercises to build your business promotional activities from Day 1.</p>", 
    "end_date": null, 
    "title": "Transform Your Idea Into A Profitable Business: Part 2 ", 
    "price": "45.00", 
    "instructors": "Christine Baker", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645602_482e_2.jpg", 
    "course_url": "https://www.udemy.com/transform-your-idea-into-a-profitable-business-part-2/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T08:36:28Z"
}