{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>En mi blog, muchos apprendedores me preguntan sobre aspectos para crear su app para móvil, sin darse cuenta que fallan en lo esencial, <strong>su idea de app</strong>.</p><p>Por mucho que hagas bien las cosas con tu app, si te equivocas en lo básico, la idea, todos los esfuerzos posteriores no te servirán para nada. Tu app será un fracaso.</p><p>Pero estás aquí porque ya te has dado cuenta de eso. Ya no eres un apprendedor que se ha enamorado de la idea y desea lanzarla sí o sí, sobre ese tema en concreto. </p><p>Te has dado cuenta del primer error de los autores de apps:</p><p>\"<strong>Tengo una idea de negocio genial para hacer una app\"</strong></p><p>Nop! Déjame  que  te  diga  que  tu  app  no  es  tan genial  como  crees.  Disculpa  si  soy  algo  rudo, pero  la  realidad  es  la  realidad.  Solo  corro  el riesgo de no equivocarme    en    un    95% aproximadamente.<br> </p><p>¿Quieres  tener  éxito  o  tener  razón?<br>¿Seguir  con  tu  idea  o escuchar lo que tengo que decirte?</p><p>No es que no quiera que lances tu app (es lo que más satisfacción me produce cuando  trabajo con mis alumnos), es que deseo que lo hagas con la información adecuada.</p><p>Tu idea será buena solo si el mercado, la gente, decide que es  buena.  Y  será  buena  si  la  gente  decide utilizar  tu  app porque  aporta  valor  a  sus  vidas  y  de  alguna  manera,  es diferente a otras aplicaciones que ya hayan en el mercado.</p><p>Porque no creas que tu idea es única. De nuevo, con riesgo a no equivocarme  en  un  95%,  tu  idea  ya  está  en  el mercado   a   través de   alguna   otra   app.   Quizás   no   es  exactamente la app que querías hacer, pero probablemente será muy parecida.</p><p>¿Qué  pasa  si  tu  idea  de  app  o  parecida,  no  está  en  el <br>mercado? Pueden pasar dos cosas:</p><p><strong>1) La  idea  no  es  buena  porque  ha  fracasado  cuando otros la han llevado a cabo.<br>2) A nadie se le ha ocurrido antes.</strong></p><p>Con respecto a la opción 2, ¿De verdad te quieres arriesgar a crear una app que no sabes si va a tener éxito?<br>Esa   es   tu   decisión,   particularmente   creo   que   solo   es interesante a lanzar una idea genial de app cuando ya has publicado otras apps y tienes cierto conocimiento de qué es lo que funciona en el mercado y qué no funciona.</p><p>Invertir tiempo y dinero en un proyecto que entraña mucho riesgo porque es tu primera app y nadie ha tenido “la idea genial”,  es  la  primera  causa  de  tener  emprendedores  de <br>apps fracasados en España.<br></p><p>¿Qué hacer?<br>Sencillo,   crea   diferentes   apps   de   bajo   presupuesto   y aprende   cómo   funciona   el   mercado.   Después   y   solo después, asume el riesgo de crear una app con “Tu idea <br>genial”.</p><p><br>¿Sabes qué?<br>Muy  probablemente,  esa  idea  genial  ya  no  lo  será  tanto, una  vez  que  conozcas  qué  funciona  en  el  mercado  y  qué no funciona.<br>Luego  tendrás  otra idea  genial ,  pero  como  tendrás  un conocimiento   del   mercado   que   antes no tenías,   las probabilidades de éxito serán mucho mayores.</p><p><br>¿Qué te propongo?<br>Que sigas los pasos que enseño en el curso.</p><p>¿Te parece parece coherente?<br>Esto  que  te  digo  está  basado  en  mi  experiencia.  Yo  no invento  la  rueda,  no  trato  de  innovar,  trato  de  mejorar  lo que ya hay.<br></p><p>¿No lo hace ya la industria?<br>Fíjate,   en   temas   de   propuestas   de   márketing   y   de productos, pocos innovan. <br></p><p>Los coches cada vez se parecen más,  las  motos  también... <br>Si  algo  funciona,  ¿Para  qué cambiarlo? <br>Si  no  tienes  los  recursos  para  salir  de  un  batacazo,  echa un vistazo al curso.</p>", 
    "end_date": null, 
    "title": "Tu Idea para una App no es tan Genial", 
    "price": "50.00", 
    "instructors": "Jordi Martin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/686926_d216.jpg", 
    "course_url": "https://www.udemy.com/tu-idea-para-una-app-no-es-tan-genial/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T11:07:07Z"
}