{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong></strong><strong></strong><strong></strong><strong></strong><strong></strong><strong></strong><strong></strong></p><p><strong>Course Description</strong></p><p><em><strong>I've already started 3 companies and I am only 24 years old!</strong></em></p><p><strong>My courses have been taken hundreds of times by students all over the world!</strong><br></p><p><em><strong>LATEST: Course Updated Again for October 2015</strong></em></p><p><em><strong><em></em>Come with me on a journey to the fast-track of starting your own business. </strong></em><br></p><p>See how I have started 3 companies out of my house using the internet. Easily and simply.</p><p>I've been making an amazing amount from my companies each month, since I started to experiment with what REALLY works.</p><p><em>My experiments have really paid off ... and those that worked are now revealed here for the very first time.</em></p><p><em></em></p><p>Every single technique which I reveal in this course is easy to put into place in minutes - and can give you instant returns.</p><p>Nothing is kept secret - <strong>I reveal all I know</strong> ... and as I test even more things, those that are successful are added to the course - at no extra cost to you! This is a course that will continue to grow and grow.</p><p>As well as my <strong>30 day guarantee</strong>, you have my personal promise that you will be wowed and delighted by what you'll learn in the next 4 to 5 hours.</p><p><em>What this course is not:</em></p><p><em>I do not cover items that are freely published online. I present you with real evidence of what works to turn your product or service ideas into reality.</em></p><p><em>I will not \"look at your business\" and \"tell you what's wrong\". I don't know your niche or your knowledge - and it would be reckless of me to advise you. I know you have an idea that you've been sitting on that you have never started.</em></p><p><em>I won't teach you anything that in any way breaks, rules, conditions etc, whether they are written or implied - I value my reputation too much!</em></p><p><em>This course is not backed or produced by a third party - it's all my own work.</em></p><p>But, if you want my personal \"insider\" information - remember I've started 3 businesses and I am only 24 (and I do what I want when I want) - you need to get this course now ... right this minute.</p><p>Every minute you delay is actually COSTING you money ....</p><p>Enroll now!</p><p>I look forward to seeing you in the course!</p><p>-Matt</p>", 
    "end_date": null, 
    "title": "Turn Your Business Idea Into Reality in 1 day", 
    "price": "20.00", 
    "instructors": "Matt Rutkovitz", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/652814_67c2_4.jpg", 
    "course_url": "https://www.udemy.com/business-idea-into-reality/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-27T22:04:48Z"
}