{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">What if you could turn your mobile device into a positive income stream? What if your iPhone could be an asset instead of a liability?</em></strong></p><p style=\"\"><strong style=\"\">In this course, Kelly Johns will teach you several easy concepts that will make your phone pay for itself. </strong></p><p style=\"\">Since 1998, Kelly Johns has made a living online. When the App Store launched, he utilized cutting edge mobile strategies to create a full time mobile income. For the first time, he has created a course outline several techniques geared toward creating a fast, sustainable income with your mobile device. </p><p style=\"\">We&#039;ve all been in a situation where we need to bring in money quick and diversify to create additional income. This course is NOT a get rich quick scheme. In fact, you will NOT get rich using this techniques. However you will be able to turn your mobile device into a positive income stream that could possibly pay your rent, or your mortgage. The challenge is knowing what to do, and how to do it, and that&#039;s what you will learn in this course. </p><p style=\"\">MORE IMPORTANTLY: For the first time, Kelly Johns will make himself available in the Discussion section to consult and answer questions regarding developing mobile income streams. This is arguably the most valuable part of this course. </p><p style=\"\">In addition to instructional videos, there are section summaries that give you the links you need to grab the apps that will earn you money.</p><p style=\"\">This course is not meant to be a definitive tutorial on each method covered. Instead it is meant to open your eyes to the different ways you can create income with only your iPhone. </p><p style=\"\">Most of these methods will work anywhere in the world, no matter what type of smartphone you own. Kelly Johns teaches on an iPhone, and some apps may not be available on other platforms. </p><p style=\"\">Enroll in this course today and join a community of people who are turning their mobile devices into positive income streams. </p>", 
    "end_date": null, 
    "title": "Turn Your iPhone into a Positive Income Stream", 
    "price": "45.00", 
    "instructors": "Kelly Johns", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496364_8be9_4.jpg", 
    "course_url": "https://www.udemy.com/make-money-on-your-iphone/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-07T23:57:57Z"
}