{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>   Join over 1,000 students who have already taken this course!</strong></p>  <p>  \tUPDATE: Course updated February 2016 and new updates are continuously being added each month.  </p>  <p>  \t<strong>Please note that the cost of this course will rise on the 15th of March 2016.</strong></p>  <ul>  \t<li>Do you have a flair for teaching?</li>  \t<li>Have you always wanted to earn a living as a teacher or tutor but struggled with ways to get started?</li>  \t<li>Would you like to use your knowledge, talents and gifts to inspire other people?</li>  </ul>  <p>  \t        If so, this is THE course for you.  </p>  <p>  \t        In this course, I'll be introducing you to the <strong>multi-billion dollar industry</strong> of tutoring.  </p>  <p>  \t        You'll learn:  </p>  <ul>  \t<li><strong>How to attract great clients from the very first day you begin tutoring</strong></li>  \t<li><strong>How to have clients begging you to work with them</strong></li>  \t<li>The<strong> 3 subjects</strong> that are in demand no matter where you live</li><li>How to always ensure that your tutoring lessons are amazing</li>  \t<li>5 tools for online tutoring that I personally recommend</li>  </ul>  <p>  \t        And much, much more.  </p>  <p>Unlike alternative courses, this course is <strong>taught by a fellow tutor</strong>. I'll take you step-by-step through the very processes, methods, tools and systems that I have used to build my tutoring business. These strategise can be applied to any tutor; it doesn't matter what subject you teach or where you live.</p><p>  \t<strong>Who should take this course?</strong>  </p>  <p>  \t    You should take this course if:  </p>  <ul>  \t<li>You'd love to earn an income teaching what you know to others.</li>  \t<li><strong>You're passionate about education and want to inspire the next generation.</strong></li>  \t<li><strong>You want a career that's incredibly rewarding.</strong></li>  \t<li><strong>You want to make a difference in the lives of others.</strong></li>  \t<li>You want the flexibility of teaching without being limited to the rules that traditional teachers have to endure.</li>  </ul>  <p>  \t<strong>Who is this course NOT for?</strong>  </p>  <p>  \tThis course is not for you if:  </p>  <ul>  \t<li>You have no interest in teaching or educating others.</li>  \t<li>You hate learning new things.</li>  \t<li>The idea of working with students (of any age) doesn't appeal to you.</li>  \t<li>You're not willing to follow tried and tested instructions so that you build a great business.</li>  </ul>  <p>  \t        What are you waiting for? Sign up for this course today.  </p>", 
    "end_date": null, 
    "title": "Tutoring Success: How To Start Your Own Tutoring Business", 
    "price": "50.00", 
    "instructors": "Vicky Olubi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329474_54a4_6.jpg", 
    "course_url": "https://www.udemy.com/tutoring-success-how-to-earn-up-to-3k-per-month-as-a-tutor/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T15:45:45Z"
}