{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>“This course is not sponsored by or affiliated with Udemy, Inc.”</strong><br></p><p>This course is focused to help any UDEMY Instructor to solve their biggest problem!<br></p>\n\n<p>How to get Traffic to their Udemy Landing page without relying only in Udemy organic or promotional campaigns.</p>\n\n<p>I will show you how to use some of the best Secret Traffic sources in order to increase your the number of visitors that will land in your Sales page and also will increase your conversion ratio and obviously your SALES!</p>\n\n<p>I will not only share with you what are the traffic source BUT how to use it effectively to get you the best traffic quality and for <strong class=\"redactor-inline-converted\">FREE</strong> without spending money in the process!</p>\n\n<p>Besides my practical cases how doing it and replicate in your own scenario, i also have included some of the best case studies about <strong class=\"redactor-inline-converted\">Traffic Generation.</strong></p>\n\n<p>For last but not least I will also offer <strong class=\"redactor-inline-converted\">100% FREE </strong>AMA sessions!</p>\n\n<p>You may ask: Paulo, what the heck is <strong class=\"redactor-inline-converted\">AMA</strong> Sessions?</p>\n\n<p><strong class=\"redactor-inline-converted\">AMA</strong> &gt;&gt;&gt; <strong class=\"redactor-inline-converted\">A</strong>sk <strong class=\"redactor-inline-converted\">M</strong>e <strong class=\"redactor-inline-converted\">A</strong>nything sessions that i will offer for free and LIVE 1 session every month to answer to all my students' questions about this course! So you can be 100% clarified about the entire course!</p>\n\n<p><strong class=\"redactor-inline-converted\">Is awesome right! I only provide value to you guys!</strong></p>\n\n<p>But that´s not all guys :) i am also providing weekly updates with at least 1 new traffic source so the course can be fully updated for LIFE!</p>\n\n<p>Don´t hesitate to Enroll while the price is really cheap!</p>", 
    "end_date": null, 
    "title": "Udemy Crusher - Best Traffic sources Revealed! “Unofficial\"", 
    "price": "35.00", 
    "instructors": "Paulo Ribeiro", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848884_0d1e.jpg", 
    "course_url": "https://www.udemy.com/udemy-crusher-the-best-udemy-traffic-sources-revealed/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T09:34:10Z"
}