{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Im März 2015 habe ich meinen ersten Kurs bei Udemy veröffentlicht. Fast genau ein Jahr später ist ein Umsatz von 20.000 € erreicht. Dieser Kurs zeigt Ihnen en detail meine seriöse Langzeit-Strategie, mit der sie ein solides Einkommen aus Ihrer Dozenten-Tätigkeit bei Udemy erzielen. </p><p>Ich verspreche Ihnen bewusst keine konkreten Zahlen. Aber ich verspreche Ihnen:</p><ul><li><strong>Spaß </strong>am Lehren</li><li><strong>Zufriedene </strong>Studenten</li><li>Eine Zeit-Investition, die sich für Sie <strong>rentiert</strong></li></ul><p>Eines jedoch werden Sie garantiert nicht erreichen: passives Einkommen. Wer als Dozent bei Udemy erfolgreich sein will, muss <strong>aktiv sein</strong>. Einmalig einen Kurs zu erstellen genügt nicht. Sie müssen den Kurs vermarkten, ihn pflegen, mit Ihren Teilnehmern in Kontakt treten. </p><p>Bei all diesen Schritten wird der Kurs Sie unterstützen. Er ist deshalb in <strong>monatliche Abschnitte</strong> unterteilt, die wiederum aus je vier \"Wochen\" (Abschnitten) bestehen. Sie können einzelne Abschnitte selbstverständlich schneller durcharbeiten, wenn Sie das neben Ihrem Beruf schaffen. Aber das brauchen Sie nicht. Manche Entscheidungen müssen auch reifen. </p><p>Der Vorteil der Modularität: Sie müssen keinen teuren Gesamt-Kurs buchen, sondern können sich je nach Interesse für einzelne Teile entscheiden. Natürlich werden Sie als zahlender Teilnehmer für Folgekurse günstigere Preise erhalten.</p><p>Im Kurs lege ich großen Wert auf</p><ul><li><strong>Verständlichkeit</strong>,</li><li>persönlichen Kontakt und</li><li>Ihren Erfolg</li></ul><p>Deshalb bitte ich Sie, sich im Kursforum vorzustellen. Manchmal ergeben sich Lösungen auch erst durch eine Diskussion. Selbstverständlich stehe ich auch stets direkt für Fragen zur Verfügung. </p><p>Die einzelnen Monats-Teile werden <strong>etwa alle zwei Wochen</strong> erscheinen. Wie der Kurs sich entwickelt, hängt auch ein bisschen von seinen Teilnehmern ab. Ich habe zwar eine Art Drehbuch, doch wenn sich zwischendurch herausstellt, dass andere Fragen dringender sind, kann ich stets variieren – jedenfalls bis alle zwölf Monate erschienen sind. Dann sind hoffentlich wirklich alle Fragen beantwortet, die je zum Thema Online-Kurse aufgekommen sind. Das ist, Leser meiner Selfpublisherbibel wissen das, ein Anspruch, den ich an mich stelle: zu jeder Frage eine Antwort parat zu haben.</p>", 
    "end_date": null, 
    "title": "Udemy-Kurs (1): Die seriöse 12-Monats-Strategie - Unofficial", 
    "price": "20.00", 
    "instructors": "Matthias Matting", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700632_6efd.jpg", 
    "course_url": "https://www.udemy.com/einkommen-als-udemy-dozent-strategie-kurs-monat1/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-18T09:39:08Z"
}