{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Ce cours n'est pas sponsorisé par ou affilié à Udemy, Inc.</p><p>Avec ce cours, vous allez comprendre d'où vient le succès des professeurs sur Udemy et pouvoir mettre à profit ce qui peut marcher pour votre propre cours. Analyse de marché, positionnement, prix, techniques de marketing pour susciter l'achat de vos étudiants. Ce cours se veut un condensé vous permettant de rapidement améliorer vos chances de vendre et de créer un revenu passif sur Udemy. Si vous aimez les cours rapides et efficaces, vous êtes au bon endroit!</p>\n\n<p>Ce cours a été créé dans l'idée d'aider les professeurs francophones démarrant sur Udemy et encore peu au fait des techniques d'Online Marketing. Il couvrira notamment les thèmes suivants:<br></p>\n\n<ul><li>Analyse du marché actuel de Udemy: ses dynamiques et son évolution probable</li><li>Positionnement par rapport à ce marché très spécifiques</li><li>Techniques pour attirer des étudiants en dehors de la plate-forme</li><li>Marketing sur Udemy: présentation, actions, prix, promotions - comment se positionner?</li><li>Quelques recettes anti-pirates pour éviter de perdre des étudiants potentiels</li><li>Techniques pour augmenter vos chances de remonter dans les recherches</li><li>Des conseils pour vous motiver et faire en sorte que vous réussissiez à long-terme</li></ul>\n\n<p><br></p>\n\n<p>Ayant débuté en Septembre 2015 (mon premier cours est en ligne depuis début Octobre 2015), j'ai depuis suivi plusieurs cours donnés par les professeurs ayant eu le plus de succès sur Udemy. Au travers de mon cours, je partage avec vous en toute honnêteté ce que j'ai appris, testé et ce qui me semble être le plus pertinent. Pour aller plus loin, j'ai ajouté quelques analyses (notamment du marché actuel tel qu'il me semble être et évoluer sur Udemy) et conseils qui me semblent être indissociables de la réussite à long-terme sur Udemy, mais qui ne sont pas vraiment évoqués dans d'autres cours que j'ai moi-même suivi.<br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Udemy: comprendre le marché et mieux vendre - non officiel", 
    "price": "20.00", 
    "instructors": "Anja Altberger", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691034_979f_2.jpg", 
    "course_url": "https://www.udemy.com/udemy-comment-font-ils-pour-gagner-30000mois/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T13:18:36Z"
}