{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   Have you ever felt you are working long and hard on your company but no one is taking notice? or you just want to take it to the next level?  </p>  <p>  \t   Do Feel like you have an amazing product or service and if you could just get people to try it or learn about it then you know they will love it?  </p>  <p>  \t   Do you have a website that you are trying to get traffic to but nothing is working?  </p>  <p>  \t   This Simple and Easy Formula  will allow you to:  </p>  <p>  \t   1. Stick out from the Crowd<br>  \t   2. Become an Authority <br>  \t   3. Make Money Doing It  </p>  <p>  \t   Many companies and entrepreneurs are using webinars and online events as their secret weapon in business.  </p>  <p>  \t   THis course will walk you step by step to <strong> Supercharge Your Online Event or Webinar.</strong>  </p>  <p>  \t <strong>Anyone with a computer and a microphone will be able to follow along and put into practice webinar and online event methods.</strong>  </p>  <p>  \t        Here is the Full Details of Everything you will Learn:  </p>  <p>  \t    Section 2 Big Problems, Pitfalls and Big Mistakes to Avoid AND the BIG Success Story  </p>  <p>  \t    Section 3 Benefits and why to have an Online Event and Webinar  </p>  <p>  \t    Section 4 Get Amazing Guests --Learn the Speakers Pyramid  </p>  <p>  \t    Section 5 Produce amazing content - Preparation for your Presentation &amp; Interview  </p>  <p>  \t    Section 6 Technology and Set up --- how do you create &amp; setup a great video interview  </p>  <p>  \t    Section 7 PRO&#039;s &amp; CON&#039;s of Live vs. Recorded Content and Audio vs. Video Recording  </p>  <p>  \t     Section 8 Create the best converting copy and optimize your Website and Landing Pages  </p>  <p>  \t    Section 9 Get Tons of Traffic and Promote Your Epic Content even with no budget  </p>  <p>  \t    Section 10 Monetization: Make Money with these Strategies -Ads, Tickets, Membership, &amp; more  </p>  <p>  \t    Section 11 Partnership Strategies for Monetization &amp; Promotion  </p>  <p>  \t    Section 12 A to Z Case Study : Final WALKTHROUGH showing all the steps in action  </p>", 
    "end_date": null, 
    "title": "Ultimate Guide to Supercharge Your Webinars & Podcast", 
    "price": "50.00", 
    "instructors": "Marco Montemagno, Dr. Jeremy Weisz", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251384_53d2_2.jpg", 
    "course_url": "https://www.udemy.com/stickout/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-27T07:12:14Z"
}