{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Do you want to be a TOP SELLER on Fiverr and bring in thousands of dollars a month while working from home (or anywhere else)?</strong></p>  <p>  \t          For years, I'd heard of people doing this, but I didn't think it was actually possible.<strong> And then, when I was unemployed and down to my last $75, I started doing voiceovers on Fiverr</strong>. In a couple months, I went from a trickle of sales to a top level seller.  </p>  <p>  \t          After only seven months on Fiverr, <strong>I make between $3-4,000 a month from one solid gig as of Jan 2015</strong>, with NO marketing on my part.</p>  <p>  \t          This course will teach you exactly how I did it, step by step, starting at the very beginning - what Fiverr is, how to create your gig, etc. Then we'll talk about how to make your gig stand out, find and keep great customers, and make the most money possible from one gig.  </p>  <p>  \t          This course is <strong>probably NOT for you if you are already a successful Fiverr seller</strong>, as much of it will seem redundant to you. It's <strong>definitely NOT for you if you are looking to get rich quick, resell gigs, outsource gigs, etc.</strong> There are plenty of courses like that out there - this is not one of them!  </p>  <p>  \t<strong>Here we will talk about how to create YOUR OWN unique, high quality gig and turn it into a profitable part- or full-time business.</strong>  </p>  <p>  \t          Enroll today! It's risk free, as it's backed by a full 30-day money back guarantee. I'm available for any questions you may have, so please feel free to contact me at any time!  </p>", 
    "end_date": null, 
    "title": "Ultimate Fiverr Success: How To Make a Living On Fiverr", 
    "price": "20.00", 
    "instructors": "Rebecca Schwab", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/422476_c885_5.jpg", 
    "course_url": "https://www.udemy.com/be-a-fiverr-top-seller/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-15T13:05:02Z"
}