{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\n\n</p><p style=\"\">The Ultimate Guide to Working with Brokers is the comprehensive\nand definitive GPS guidance system for Owner-operator and Small Fleet\nCarriers!  As an Owner-Operator and Small\nFleet Carrier, getting set up to do business with a brokerage company can be\nconfusing, bothersome and downright challenging.  The Ultimate Guide to Working with Brokers\ncourse breaks through the red tape, pitfalls and snares to get you the valuable\ninformation and guidance that a successful Owner-Operator and Small Fleet Carrier\nneeds.</p><p>\n\n</p><p style=\"\">The main goal of this course is to help you to save time,\ndecrease risk, maximize profits and increase cash-flow when working with brokers.  Knowledge is power.  This course will walk you through everything\nthat you’ll need to get set up with a brokerage company to do business, step by\nstep.  This course will also show you\nways to build trust and rapport with brokers, to maintain a stellar reputation\nin the business and little known tips to keep you organized and your business\nrunning smoothly and efficiently.  </p><p>\n\n</p><p style=\"\">Did you know that there is a direct connection relationship\nbetween your accounts payable system and your ability to get loads?</p><p>\n\n</p><p style=\"\">Did you know that there is a technique that you can use to increase\nthe likelihood of working with brokers that pay well and on time?</p><p>\n\n</p><p style=\"\">Did you know that many of the larger brokerages track your\nperformance and have a rating system?</p><p>\n\n</p><p style=\"\">Would you like to know some of the factors that the larger\nbrokerages use in their formula, to come up with their rating?</p><p>\n\n</p><p style=\"\">If you answered “Yes” to any of those questions, this is THE\ncourse for YOU!</p><p>\n\n</p><p style=\"\">The Ultimate Guide to Working with Brokers will guide you\nthrough the financial aspects of the business and will reveal guidance, tips\nand techniques designed to save you money, provide insight on insider industry\nknowledge and to gain a competitive advantage within the industry.</p><p>\n\n</p>", 
    "end_date": null, 
    "title": "Ultimate Guide To Working With Brokers", 
    "price": "45.00", 
    "instructors": "Carrier Pal LLC", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/855312_31f8.jpg", 
    "course_url": "https://www.udemy.com/ultimate-guide-to-working-with-brokers/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T21:27:48Z"
}