{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Understanding Yourself as an Entrepreneur </strong>will provide students with a solid foundation in small business conceptualization, planning, innovation, and design based on Scriptural principles. We seek to help the student learner better understand their spiritual gifts and talents, and what makes you uniquely you. With this as a foundation, it is our desire to help the student learner assess their own goals, talents, strengths and weaknesses in order to realistically prepare to launch a business of their choosing. Within this course, there are eight modules, which we describe as follows:  </p>  <p style=\"\">  \t <strong style=\"\">Module I: Course Introduction:</strong> David and Scott introduce the course, discussing who can benefit from taking the course, and their  </p>  <p style=\"\">  \t <strong style=\"\">Module 2: Discovering Your DISC Profile:</strong> In this session, you will be introduced to the DISC personality profile assessment. We’ll describe its history, what it is, and how it can benefit you. We’ll show you how to log into the Uniquely You Portal.  </p>  <p style=\"\">  \t <strong style=\"\">Module III: A Realistic Appreciation of Who You Are:</strong> In this session, we lay out the learning objectives for this session. We examine what French Economist John Baptiste Say meant when he coined the term “entrepreneur.” Using your DISC personality profile assessment, we ask you to think about your personality blend in light of what it takes to be an entrepreneur.  </p>  <p style=\"\">  \t<strong style=\"\">Module IV: Counting the Cost of Entrepreneurship:</strong> In this session, we ask you to think about what you are willing to invest to achieve your goals of becoming an entrepreneur. We begin exploring the creation of a business plan by examining the book publishing industry.  </p>  <p style=\"\">  \t <strong style=\"\">Module V: Becoming a Team Player:</strong> Sooner or later, you will have to work with others; and build a business team. Entrepreneur must be very specific about the structure of the business and the roles of the business team members if they are to succeed. In this session, we’ll consider the elements you must address when establishing these processes.  </p>  <p style=\"\">  \t <strong style=\"\">Module VI: Your Journey from Ignorance to Expertise:</strong> This session covers Generation Self Employed’s approach to talking about entrepreneurship by using the “story” of the book publishing industry. Using the book publishing industry, we will begin to work on creating a business planning process you can apply to your business idea.  </p>  <p style=\"\">  \t <strong style=\"\">Module VII: The Lemonade Stand Game: A Case Study:</strong> In this session we see that if you are an owner instead of an employee, success or failure of your business rests on your shoulders. An employee can walk away form a J.O.B. An owner cannot easily walk away. An OWNER must consider what might go wrong and cause people to complain about your product or service. By playing the Lemonade Stand Game, you will learn what it means to have an OWNERSHIP mindset.  </p>  <p style=\"\">  \t <strong style=\"\">Module VIII: Next Steps:</strong> In this session, we discuss the other courses in the Generation Self Employed study series, and how they can help you in your journey from ignorance to expertise.  </p>  <p style=\"\">  \t As you take this course, our goals for you and what you will learn are as follows:  </p>", 
    "end_date": null, 
    "title": "Understanding Yourself as an Entrepreneur", 
    "price": "25.00", 
    "instructors": "David Lantz", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65488_1354_7.jpg", 
    "course_url": "https://www.udemy.com/understanding-yourself-as-an-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-15T02:23:37Z"
}