{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Free ebook - \"Upwork Success Intensive\"</strong> <strong><em></em>- when you enroll in the course!</strong><br>  \t  </p><p>Most people never get a good rating on Upwork and become as successful as they could be and they don't know why. Instead of asking <em>why</em>, they should ask <em>how</em> they can change their freelancing business into a successful one?  </p>  <p>  \t  The honest truth is your success may have nothing to do with how good your work is, how good the companies are nor even how much money you earn. It is your innermost mindset and attitude that determines if you will be struggling your entire life or if you can attract success to yourself. Unfortunately, you may be stuck with this mindset for the rest of your life unless you change it!  </p>  <p>  \t<strong>Learn to Be Successful With Your Freelance Business on Upwork</strong>  </p>  <ul>  \t<li>Program your mindset for success </li>  \t<li>Set realistic goals for your business</li>  \t<li>Prepare yourself to set up correctly on Upwork</li>  \t<li>Communicate effectively and set customer expectations</li>  \t<li>Marketing and Sale techniques</li>  </ul>  <p>  \t<strong>Master the Skills that will Make You Successful on Upwork and Beyond</strong>  </p>  <p>  \t        Thousands of people go to Upwork to look for help on their business and they don't want to work with just anybody.  They want to work with someone who knows what they are doing, if not the best.  I will show you how to make yourself an expert in your niche and stand out from your competition.  </p>  <p>  \t        While you might have the technical skills to do the job, you still need to provide the best customer service to your customers and your communication skills is the key.  I will show you how to communicate effectively and also project manage your jobs.  </p>  <p>  \t        No business is successful without repeat customers.  If you have happy customers keep coming back to you, you won't need to keep applying for new jobs.  I will show you the key to manage customer expectations and have satisfied customers.  </p>  <p>  \t<strong>Content and Overview</strong>  </p>  <p>  \t        Suitable even for beginners, this course covers all the elements required for your Upwork career to be a success in over 5 hours of content and 79 lectures. Students will learn that success begins in your mindset. Change your mindset and you change your life.  </p>  <p>  \t        On top of that, students will learn how to correctly set themselves up on Upwork. They will also learn how to become an expert in their niche and market their business effectively on Upwork. The secrets of how to keep your customers happily coming back to you will also be revealed.  </p>  <p>  \t        Upon completion of the course, students will have a complete different mindset and skills that will lead them to success on Upwork.  </p>  <p>  \t        This course comes with an ebook so students can easily follow along.  </p>", 
    "end_date": null, 
    "title": "Upwork Success Intensive: Guide to Freelancing on Upwork", 
    "price": "50.00", 
    "instructors": "Tom Powers", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360924_8f07_4.jpg", 
    "course_url": "https://www.udemy.com/odesk-success-intensive-marketing-your-freelance-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T23:49:08Z"
}