{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>With the generation who grew up playing games and comfortable with technology, <strong style=\"\">68% own a game console, 76% own a smartphone and 73% own a laptop,</strong> the game mechanics are the very least worth paying attention to.</p><p>Big brands like<strong style=\"\"> McDonald&#039;s, Starbucks and Coca Cola </strong>developing tactics based on gamification principles.</p><p>That said, <strong style=\"\">gamification tactics can be the next big thing in MARKETING. </strong></p><p>And thanks to social media increasing number of businesses are discovering that gamification principles can be applied to help solve their marketing problems. </p><p>The consumer became more and more engaged and games allow them to spend more and more time with your brand and reward with incentive to do so.</p><p><strong style=\"\">Game based marketing its the system that&#039;s engaging and changing the average into the exciting. </strong></p><p>Research shows that gamification can even been employed in order to help ensure completion of market surveys, encourage desirable website behaviour, and perform other tasks which are traditionally boring and perhaps difficult to get customers to engage in. </p><p>So, why not to start employing some game tactics to your current marketing strategy? If you agree with us, then start your learning journey today!</p>", 
    "end_date": null, 
    "title": "Use Gamification in Marketing", 
    "price": "20.00", 
    "instructors": "iMarketer Training", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234824_d80c_4.jpg", 
    "course_url": "https://www.udemy.com/marketing-with-fun-gamification-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-31T23:56:10Z"
}