{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">                      A few years ago I was just another personal trainer who was working early mornings and long hours in the gym. <em style=\"\">I wanted to</em> <em style=\"\">earn more money, work less, and have the flexibility to work when I wanted and from where I wanted</em> (yes, I wanted to travel!) </strong>  </p>  <p>  \t<strong style=\"\">Sound familiar?</strong>  </p>  <p>  \t                          That&#039;s why I started my first online business. I found a way to use my fitness expertise to help people from all over the world. At the same time, I was able to achieve the financial and lifestyle flexibility I had been craving.  </p>  <p>  \t<strong style=\"\">Use Your Health and Fitness Expertise to Develop a Brand, Build a Loyal Following, and Create a Flexible and Fulfilling Career as an Online Entrepreneur.</strong>  </p>  <p>  \t                WHAT YOU WILL GAIN FROM THIS COURSE  </p>  <ul style=\"\">  \t<li>Find the online niche that is perfect for your skills and experience</li>  \t<li>Identify your ideal target customer, the one who is going to buy from you!</li>  \t<li>Learn the simple online marketing tactics that will build your personal brand</li>  \t<li>Discover how your expertise can be used to create valuable products online</li>  \t<li>Learn how easy (and inexpensive) it is to produce professional digital products</li>  \t<li>Develop strong online selling skills that will start earning consistent revenue</li>  </ul>  <p>  \t<strong style=\"\">This course is for health and fitness professionals who are ready for a change. Take your career to a whole new level by building your <em style=\"\">Personal Brand</em> and becoming a trusted <em style=\"\">Authority</em> in your area of expertise.</strong>  </p>  <p>  \t                LEARN MY STEP-BY-STEP PROCESS  </p>  <p>  \t                    When I began building my first online business I had absolutely no idea how to begin. I didn&#039;t know anything about online branding, creating digital products, or how to sell to customers via the Internet. But, I did know a lot about fitness and I believed that I could turn this into a career as an online entrepreneur.  </p>  <p>  \t                    This course outlines everything I did (and still do today) to earn a living online. You will also benefit from learning about my mistakes: I wasted a LOT of time and energy on ideas and tactics that simply did not work. Avoid my early mistakes and save your time by following this step-by-step formula that has been proven to work.  </p>  <p>  \t                HOW THE PROCESS WILL WORK FOR YOU  </p>  <p>  \t                This course is broken into 4 main sections, each outlining an important step in the process of building your first online business. First, you will <strong style=\"\">Prepare</strong> to launch your business by finding a niche and identifying who your perfect customers will be.  </p>  <p>  \t                Next, you will <strong style=\"\">Build Your Presence</strong> online. I will teach you how to create a place where you can build a community, one that will let you display your knowledge and expertise. This is where you are going to begin enhancing your personal brand.  </p>  <p>  \t                In the third step you will <strong style=\"\">Grow Your Audience</strong>. Learn how to attract a huge following of prospective customers. These followers will look to your for leadership and will rely on your expertise to meet their needs.  </p>  <p>  \t                Finally, you will <strong style=\"\">Monetize Your Business</strong>. Having an audience and a powerful personal brand are only useful if they help you earn money. The final section of the course explains how to create and sell the digital products and services your audience are looking for.  </p>  <p>  \t        UPON COMPLETION OF THIS COURSE YOU WILL HAVE...  </p>  <ol style=\"\">  \t<li>Established your first online business</li>  \t<li>Created a group of followers who know and trust you</li>  \t<li>Developed your first products to sell online</li>  \t<li>Begun earning revenue by converting your followers into paying customers</li>  </ol>  <p style=\"\">  \t        From there they sky is the limit. Once you&#039;ve completed the process outlined in this course you will be able to &quot;rinse and repeat&quot; to create new products and generate larger revenues online.  </p>", 
    "end_date": null, 
    "title": "Use Your Health & Fitness Expertise to Earn A Living Online", 
    "price": "50.00", 
    "instructors": "Dave Smith", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416222_c2fb_2.jpg", 
    "course_url": "https://www.udemy.com/create-online-health-fitness-business/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T01:31:55Z"
}