{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Questo corso presenta i più importanti tra i vari siti presenti on line che permettono di cominciare una carriera da freelance. I siti per lavorare on line sono veramente tantissimi, e anche se nella maggior parte dei casi è fondamentale la conoscenza di almeno un po&#039; di inglese, esistono delle nicchie anche per chi privilegia altre lingue.  </p>  <p>  \t    Oltre a mostrare come ci si registra alle varie piattaforme e come si può costruire una presenza on line, questo corso analizza vari dati sull&#039;utilizzo di questi siti, sulle competenze più richieste e meglio pagate, come si ragiona per scegliere le offerte di lavoro più promettenti, e su come si definiscono i clienti migliori per cui lavorare.  </p>  <p>  \tLa crisi globale cominciata nel 2008 e le nuove tecnologie stanno creando dei problemi occupazionali e l&#039;opportunità di competere a livello globale per lavori da tutto il mondo, e con freelance da tutto il mondo. Questo può rivelarsi sia un problema che un&#039;opportunità: l&#039;opportunità di creare un portfolio clienti da tutto il mondo, ma anche le criticità di un possibile livellamento verso il basso delle tariffe.  </p>  <p>  \tQuesto corso consente di scoprire quali sono i lavori che rendono di più, e analizza le varie piattaforme per il lavoro on line, evidenziando i trucchi per non perdere tempo, le competenze meglio pagate e quelle dove c&#039;è meno concorrenza.  </p>", 
    "end_date": null, 
    "title": "Vita da freelance: impostare e gestire un business ovunque", 
    "price": "20.00", 
    "instructors": "Valentina Porcu", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351790_c707_4.jpg", 
    "course_url": "https://www.udemy.com/vita-da-freelance-impostare-e-gestire-un-business-ovunque/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T10:24:56Z"
}