{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">Business Models for the 21st Century</strong> is a course for anyone interested in going into business for themselves or already in business but looking to branch out into other areas of business. </p><p><strong style=\"\">In the 21st century things have changed for business people</strong> all over the world. With new technology, the internet, and more competition than ever, some older business models no longer work like they once did, and some totally new business models have been born.</p><p>In this course we will <strong style=\"\">identify and explore business models</strong> that will work in the 21st century while revisiting traditional business models that <strong style=\"\">STILL WORK</strong> in the new environment. We will look at WHY these business models work, analyze the strengths and weaknesses of various models and strategies so that you, the student, will have ammunition to take with you into the world of business that will help you <strong style=\"\">be successful no matter where you live</strong>.</p><p>Whether you&#039;re in business for the freedom of being your own boss, looking for financial independence, or simply love you product or craft,<strong style=\"\"> this course will help you to understand business </strong>more clearly, so that you can make more money in your chosen field, or purpose branch out into a totally new area of business where the future is bright. For either goal, this course is for you!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Wealth Building Strategies for the 21st Century", 
    "price": "20.00", 
    "instructors": "Greg Vanderford", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/486814_5599_3.jpg", 
    "course_url": "https://www.udemy.com/business-models-for-the-21st-century/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-26T16:25:03Z"
}