{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course you'll learn <strong>how to choose the perfect web host and web hosting account for your circumstances</strong>.</p><p>[last update: 1st March 2016]</p><p>\"I have also decided to upgrade my hosting package choice <strong>due to several things Neil pointed out.</strong>\" (5-stars, Crystal Whiting, Feb 2016)</p><p>\"<strong>I have never seen a hosting presentation better then this one.</strong>\" (5-stars, Anthony DeCurtis, Feb 2016)<br></p><p>\"The instructor makes all the lectures clear and concise. Thanks Neil for another fantastic course.\" (5-stars, David Mackay, Jan 2016)</p><p>Choosing a web-host is often a difficult, but important task for anyone starting an Internet-based business. It often seems confusing because there are many web-hosting accounts to choose from, and a huge number of features offered by each web-host. How can you decide?<br></p><p>This course will take you through everything in a step-by-step manner. You'll learn about <strong>the different types of web-hosting accounts and all the different features they offer</strong>, with full explanations of jargon along the way. :)</p><p>I've had web-hosting accounts since 1997, or 1996 if you include free webspace. I've had everything from free webspace to shared web-hosting accounts, to three dedicated servers running at the same time! I can help you choose the right type of web-hosting account with the right features at the right web-host!</p><p>After the introductions, we look at the <strong>different types of web-hosting account</strong>, from shared to reseller, to Virtual Private Servers, dedicated servers and cloud hosting.</p><p>We then look in detail at as many different <strong>web-hosting features </strong>as I could think of, and I try to explain what each feature is, what it does and how important it is likely to be in your choice of web-host.</p><p>In the next section, we consider which <strong>reviews of web-hosting</strong> we can use to help make a decision, and which are biased.</p><p>Finally, we look at<strong> common web-host problems</strong> and check to see if we can spot them before signing up with a web-host.</p><p>After taking this course you will know how to decide which web-hosting account is right for you and which features you'll want the account to have. You'll also know which reviews can help you decide whether or not to go with a particular web-host, and which problems to look for before signing up.</p><p>This course is <strong>aimed at beginners</strong>, but more experienced people may also find value in it.</p>", 
    "end_date": null, 
    "title": "Web Hosting Essentials: Right Web Host + Web Hosting Account", 
    "price": "20.00", 
    "instructors": "Neil and Linda Shearing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698080_8e46_6.jpg", 
    "course_url": "https://www.udemy.com/web-hosting-essentials-how-to-choose-a-web-host/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T11:49:33Z"
}