{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">If you&#039;re thinking about starting a business, but are worried it won&#039;t work, then this <strong style=\"\">FREE</strong> course will introduce you to the three fundamental activities that you will need to undertake to test whether your idea will be viable, BEFORE you start spending any money on the business.</p><p style=\"\"><em style=\"\">By the end of this course, you will know exactly what you need to do to start testing whether your business idea will work.</em> </p><p style=\"\">I have started two businesses and so can personally guarantee that assessing the feasibility of your business is essential. I have also coaching and trained over 300 people who have worked to start a business and those who have been most successful are those who have thoroughly assessed their business idea using the concepts introduced in this course. </p><p style=\"\"><em style=\"\">It is really important to understand what you need to know before you start the business so that you can ensure that when you do start, that it will be a success.</em></p><p style=\"\">It can be really exciting dreaming about starting your own business, but a lot of people never take that step because they are too scared that it won&#039;t work. So they stay in their comfortable, but often dissatisfying jobs and can often feel that they just aren&#039;t able to fulfil their potential, or spend enough time working on the things they are passionate about.</p><p style=\"\">However, with the right support, you can explore your business idea to test whether it will work <strong style=\"\">without taking any risks</strong>.</p><p style=\"\">And that is where this course will really help. Through this course, you will be taught what you need to know before you start the business so that you can then test it thoroughly before you make any big leaps. </p><p style=\"\">You will learn about the three fundamental areas which you will need to test before you take any steps to start the business and research shows that business owners who investigate these areas thoroughly before they start their business are much more likely to succeed.</p><p style=\"\"><strong style=\"\">This course is totally FREE so if your dream is to run your own business and live a life the life you deserve, then let&#039;s start investigating whether this could be a reality for you.</strong></p>", 
    "end_date": null, 
    "title": "Will Your Business Idea Work? ", 
    "price": 0, 
    "instructors": "Kristiina Woollard", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299552_7ac1_3.jpg", 
    "course_url": "https://www.udemy.com/will-your-business-idea-work/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T09:55:40Z"
}