{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In  2014, the UK central government spent over £12 billion outsourcing contracts to small and medium sized businesses. This equates to 26% of central government spend.<br></p><p>The UK government has set targets to increase the number of small businesses it deals with to a third. This would mean an extra £3 billion per year going to small businesses.</p><p>This course is designed to show small businesses where to find contract opportunities and what information they need to have in place to bid for contracts. It is packed full of useful tips and guidance to boost understanding and confidence.  <br>  </p><p>Learn where to find and apply for contracts with UK: <br></p><ul><li>Central government departments and their agencies</li><li>Local authorities</li><li>NHS trusts</li><li>The emergency services (police, ambulance, fire service)</li><li>Publicly funded bodies (such as the BBC, arts venues)</li><li>Schools, colleges and universities</li><li>Housing associations</li></ul><p><br></p><p>There are now a record number of small firms in the UK;\napproximately 5.2 million, an increase of 760,000 since 2010 so the need for a\npractical guide is even more in demand and this course will serve as a basic introduction to help small businesses see new commercial opportunities. <br></p><p>The course comprises of 6 sections and 27 lectures each of which go to the point and show you what you need to know. </p><p>You will also receive essential documents to help you develop your bid proposal. </p>", 
    "end_date": null, 
    "title": "Win UK (Public) Contracts- PQQ and ITT  introduction", 
    "price": "50.00", 
    "instructors": "Naomi Soko", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746808_f224.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-a-10000000-uk-public-government-contract/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T11:59:18Z"
}