{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is for business owners and entrepreneurs who want to start selling online through their own WordPress-powered website. If you’re baffled by eCommerce jargon like payment gateways, merchant accounts, and SSL certificates, this course will provide you with the knowledge you need to make informed decisions about your online business.</p>\n\n<p><strong class=\"redactor-inline-converted\">Learn How To Launch An eCommerce Website With WordPress</strong></p>\n\n<ul><li>Learn the essential ingredients you’ll need to get your eCommerce website online.</li><li>Learn the four major types of selling plugins and how to determine which one is right for your website.</li><li>Learn how to accept secure online payments.</li><li>Learn how to identify the best WordPress theme for your eCommerce website.</li><li>Learn the the essential website elements you need in order to build customer trust.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">Arm yourself with the knowledge you need to make informed decisions about your online business.</strong></p>\n\n\n\n<p>WordPress is the number one tool for building websites. It powers over 25% of all websites globally. And now WordPress is quickly becoming the most popular way to build eCommerce websites. </p>\n\n\n\n<p>Business owners and entrepreneurs around the world are using WordPress to build every kind of business imaginable — from traditional product-based eCommerce to digital downloads and membership websites.</p>\n\n\n\n<p><strong>Content and Overview</strong></p>\n\n\n\n<p>This course is designed for business owners and entrepreneurs who have no prior knowledge of eCommerce. Over the course of 25 lectures you will learn about the core elements required to launch a WordPress-powered eCommerce website.</p>\n\n\n\n<p>The course starts by explaining how and why WordPress has evolved from a simple blogging tool to become the most popular platform for eCommerce. </p>\n\n\n\n<p>The WordPress marketplace is flooded with eCommerce plugins. This course provides you with the knowledge you need to identify the best plugin for your business. Likewise, the course will help you better understand your design requirements so that you can pick the best WordPress theme for your site.</p>\n\n\n\n<p>The course demystifies the jargon surrounding online payment processing. You’ll learn about merchant accounts, payment gateways, and how to minimize your payment processing fees. </p>\n\n\n\n<p>The course explains best practices for data and operational security, and provides an introduction to resources you can use to keep your website secure and healthy.</p>\n\n\n\n<p>By the end of the course you will be conversant in all aspects of eCommerce and you will have identified the tools you need to turn your WordPress website into a full-featured store.</p>", 
    "end_date": null, 
    "title": "WordPress eCommerce Quick Start", 
    "price": 0, 
    "instructors": "Kirk Biglione", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/826620_fc7d_4.jpg", 
    "course_url": "https://www.udemy.com/wordpress-ecommerce-quick-start/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-19T23:57:27Z"
}