{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to the Work Smart! Using iPhone apps to get the job done business course. Are you ready to bring your business into the modern world?</p><p>Soon your tech savvy self will be impressing others and having people asking you, how did you do that? This course will teach you not only how use your iPhone more efficiently, but you will also discover the amazing apps that are out there, most are free to use, that will bring you into the modern world. You invested in purchasing your iPhone, now invest in learning it! Using the apps featured in this course you will be able to:</p><p>- Work smarter with less stress</p><p>- Know where your notes are</p><p>- Store &amp; Find your passwords in a safe place</p><p>- Be able to create, sign, and fax documents on the go</p><p>- Keep track of and watch your money come in</p><p>- And more...all from your iPhone</p><p>This course is for everyone from beginners to more advanced users. The apps covered in this course are organized in a way that everyone can benefit from them. People ask me all the time how I only have one iPhone yet, I can make and receive calls from both my business and personal line. These apps are no secret. I am just bringing them to your attention, showing you how to use them, and presenting them in an order that makes sense – setting you up for success. </p>", 
    "end_date": null, 
    "title": "Work Smart! Using iPhone mobile apps to get the job done.", 
    "price": "25.00", 
    "instructors": "Ed Troxell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/751608_45e4.jpg", 
    "course_url": "https://www.udemy.com/worksmart/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T20:03:02Z"
}