{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em>“How To Get $3,000 Deposited Directly Into You Bank Account Every Month Working From Home”</em></strong></p>\n\n<p>Earn $3,000, $6,000 or even $12,000 a month without any real start up costs. When I first discovered the plan with Charlie, we started with “back-of-the-sofa change” and made thousands of dollars in the first 30 days.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">NOW WE WANT TO TEACH YOU HOW TO DO THE SAME THING!</strong></p>\n\n\n\n\n\n\n\n<p>Maybe you’ve already thought you could <strong class=\"redactor-inline-converted\">do something yourself</strong>.</p>\n\n\n\n\n\n\n\n<p>And as you think about it you realise how different your life would be running a real business that rakes in <em>large predictable sums of money month after month after month</em>.</p>\n\n\n\n\n\n\n\n<p>You can imagine what a great feeling it is, and how many of the things you've given up on in the past, might now only be a stones throw away.</p>\n\n\n\n\n\n\n\n<p>But like many people, one of the things that may be holding you back is the time it takes to learn new things, the other thing is just knowing what works</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">\"How To Grow A $3000 A Month Business In Less Than 30 Days Working From Home\"</strong></p>\n\n\n\n\n\n<p>Now, this course is dramatically different from anything you’ve ever seen by a L-O-N-G shot - because its a double whammy. </p>\n\n\n\n\n\n\n\n<p>It gets right down to the job at hand, showing you exactly what to do AND how to do it, when it comes to creating a real long term sustainable business.</p>\n\n\n\n\n\n\n\n<p>And, it’s as easy as falling off a log.</p>\n\n\n\n\n\n\n\n<p>In fact you can probably run the whole thing in 60 minutes a day or less</p>\n\n\n\n\n\n\n\n<p>Just imagine what you could do with the other 23 hours of the Day?</p>\n\n\n\n\n\n\n\n<p>At just 6 modules, you’ll have the concepts down in an afternoon, so you can settle your own curiosity of how to live life on your terms and put a rocket under your finances so you can start doing the things you love.</p>\n\n\n\n\n\n<p>Best part being, you won't need to spend a penny to get started!</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">HERE ARE THE FACTS</strong></p>\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\"><em>GET PAID BEFORE YOU SPEND</em></strong>…. No borrowed money to start</li><li><strong class=\"redactor-inline-converted\"><em>FAST</em></strong>… Thousands of dollars a month</li><li><strong class=\"redactor-inline-converted\"><em>HANDSFREE</em></strong>… This business will pretty much run hands free</li></ul>\n\n\n\n\n\n\n\n<p>If you've been online for a while you've probably seen it all, I'll be honest with you...</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I THOUGHT I KNEW EVERY PLAN<br></strong></p>\n\n\n\n\n\n\n\n<p>After all, my and Charlie's business is online marketing, teaching on many topics. It's my specific job to buy every “Make Money Online” course that lands in my inbox.</p>\n\n\n\n\n\n\n\n<p>Then do some research, test them, see which work and don’t. Most are worthless. Nothing that you could call a “<strong class=\"redactor-inline-converted\"><em>Real Business</em></strong>\" that would keep food on the table of the everyday family.</p>\n\n\n\n\n\n\n\n<p>The fact of the matter is over the past 18 years online we've got a great education on how to be successful working from home. High end corporates (like Microsoft, HP, Citrix, Nestle, Pepsi to name but a few) pay us a hefty sums to apply these things to their marketing strategies.</p>\n\n\n\n\n\n\n\n<p>You see, after all that research and testing, we discovered a business model that is specifically engineered to bring regular money while you can work in the comfort of your own home. </p>\n\n<ul><li>A <em>real</em> Work From Home Business business that could stop anyone trading time for money.</li></ul>\n\n<ul><li>A <em>real</em> business that could be scaled to $20,000 even $100,000 with a little extra work. (On the inside, well show you proof of our 100K months)</li></ul>\n\n<ul><li>A <em>real</em> business that you could manage in less than an hour a day.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I'll reiterate, this is a real business, that generates a <strong class=\"redactor-inline-converted\">passive income.</strong></p>\n\n\n\n\n\n\n\n<p>You can even do it full or part time, maybe even along side you current job.<br></p>\n\n\n\n\n\n<p>Because...</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">HERE's EXACTLY WHAT YOU'LL BE DOING</strong></p>\n\n\n\n\n\n\n\n<ul><li>BUY… something once</li><li>SELL… it over (and over) again</li><li>PROFIT… month after month</li></ul>\n\n\n\n\n\n\n\n<p>Truth be told, you'll be leveraging the exact same business strategy as the likes of Netflix, Spotify and Amazon and those guys at the moment are KILING it...!</p>\n\n\n\n\n\n<p>You'll just copying their model and pasting it to service other businesses, in a specific way that will generate a long term passive income.</p>\n\n\n\n\n\n\n\n<p>And before you ask:<br></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">NO</strong> it has absolutely nothing to do with importing tacky goods from China and reselling them on Amazon… If like me you’ve not got the time to invest to get all of the over hyped FBA nonsense off the ground…</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">NO</strong> it has nothing to do with selling inconsistent gigs on Fiverr for crazy low prices. I mean you'd have to sell allot of gigs to make even $1000 a month… </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">No</strong> it has absolutely nothing to do with the next social media fad that’s bombarding your inbox. Chances are by the time you even look at it, the next one will be along anyway.</p>\n\n\n\n\n\n\n\n<p>Instead, this is about building a <strong class=\"redactor-inline-converted\">real sustainable business</strong> around a service offering that’s all but bullet proof to market fluctuations and economic change…</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">PLUS</strong>… You’ll Also Get These Additional 11 Impact Accelerator Resources For Download:</p>\n\n\n\n\n\n\n\n<ol><li>What Successful People Read</li><li>Your Brand Builders Bible</li><li>Your Rules For Business</li><li>The Profitable Prospect Profiling</li><li>Knowing Your Numbers</li><li>60 Second To Maximum Trust</li><li>Stealth Magnetic Customer Attraction - Fill In The Blanks 1</li><li>Stealth Magnetic Customer Attraction - Fill In The Blanks 2</li><li>10 Steps Pain Free Client On Boarding</li><li>The Top Line Audit</li><li>The Opportunity Maximiser</li></ol>\n\n\n\n\n\n<p>———————</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">OK - LETS WRAP THIS UP…</strong></p>\n\n\n\n\n\n\n\n<p>With all that being said let me ask you this... </p>\n\n\n\n\n\n\n\n<p>What if this course helps you get generate just $1,000 a month? Just ONE. What would that be worth to you?</p>\n\n\n\n\n\n\n\n<p>Now ask yourself... </p>\n\n\n\n\n\n\n\n<p>What if there’s even a chance that this course can actually teach you how to get $3,000 month on month working from home - and then scale that to as much as you you want?</p>\n\n\n\n\n\n\n\n<p>The question is, are you going to do exactly what you need to, to make it a success? Or are you going to let each of these opportunities slip buy and never know what might have happened?</p>\n\n\n\n\n\n\n\n<p>I have one final thought to share with you.</p>\n\n\n\n\n\n\n\n<p>After studying behaviour for many years, I know one thing...</p>\n\n\n\n\n\n\n\n<p>If you don’t make the decision to get this part of your life handled right now, there’s a very very small chance that you’re going to do anything about it in the future.</p>\n\n\n\n\n\n\n\n<p>You know how they say that you can’t tell someone how to get somewhere unless you’ve been there yourself? </p>\n\n\n\n\n\n\n\n<p>... Well we've been there, and we're going to show you the way.</p>\n\n\n\n\n\n\n\n<p>See you on the inside...</p>", 
    "end_date": null, 
    "title": "Work From Home & Earn Passive Income With A Real Business", 
    "price": "50.00", 
    "instructors": "The Digital Hack Academy", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794532_fd6b_2.jpg", 
    "course_url": "https://www.udemy.com/createmanageyourownhomebasedbusiness/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T08:46:20Z"
}