{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you an <strong class=\"redactor-inline-converted\">entrepreneur </strong>with an epic product or service but your sales just aren’t what they should be?\n\n  </p>\n\n<p>Do you have an <strong class=\"redactor-inline-converted\">important message</strong> but you feel like people just aren’t getting it… or they seem to get it but just DON’T BUY?\n\n  </p>\n\n<p>Do you find yourself trying to explain what you do but sometimes it just does not come across effectively?\n\n  </p>\n\n<p>Do you have a hard time (or feel uncomfortable) “selling” because you’re not really sure how to explain the benefits of what you offer?\n\n  </p>\n\n<p>Do you have a website with low or no sales?\n\n  </p>\n\n<p>Are you stumped about how to write effective marketing copy?\n\n  </p>\n\n\n\n<p>If this sounds like you, you’re not alone. Many entrepreneurs that have a fantastic product or service put a lot of time and effort into marketing but have poor results. A HUGE cause of lack of desired sales or growth is COMMUNICATION… marketing isn’t just about putting information out into the world about what you have to offer… it’s about EXPRESSING YOUR MESSAGE in a way that is both appealing and converts to sales.\n\n  </p>\n\n<p>This course provides <strong class=\"redactor-inline-converted\">proven copywriting techniques</strong> that will help you clearly communicate your message, target your market, and lead to sales. Through instructor videos and detailed PDF worksheets we’ll walk you through how to write effective marketing copy, both for print marketing material and your website. \n\n  </p>\n\n\n\n<p><strong>You will learn how to:\n\n  </strong></p>\n\n<ul><li>Express your core message\n\n  </li><li>Attract to your ideal target market\n\n  </li><li>Establish credibility\n\n  </li><li>Communicate the value you offer\n\n  </li><li>Appeal to your clients’ problems and needs\n\n  </li><li>Select powerful keywords\n\n  </li><li>Write effective marketing copy\n\n  </li><li>Write website copy that leads to sales\n\n  </li><li>Master your elevator speech\n\n  </li></ul>\n\n\n\n<p>Plus, we’ll go over a variety of marketing strategies you can use to get your message out there!</p>", 
    "end_date": null, 
    "title": "Write Epic Marketing and Sales Copy", 
    "price": "20.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/881094_072d.jpg", 
    "course_url": "https://www.udemy.com/write-epic-marketing-and-sales-copy/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-17T17:40:00Z"
}