{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you like to write? I do. I love writing. I like it so much that sometimes I’ve wanted to write more, and more and more. But life happens. Work has always been a priority in my life. My first job was in a fast food restaurant. Then I worked at the zoo with animals and as a teacher for several years. Until <strong>I made a life changing decision: to work as a writer.</strong> I thought: “Hey, if I enjoy writing so much, I’d rather work as a writer for other people to get money AND improve my writing skills at the same time. And that’s what I’ve been doing: <strong>I’ve tried several freelance writing jobs and published my own books</strong>. Truth is, It’s been a very difficult journey with ups and downs, and it still is. But I’ve learned so many <strong>interesting facts and practices about the job that you’ll be thrilled to know if you want to be a full time writer </strong>too. </p><p>Hi! My name is Manuel Arnedo and I’m an Author and an Entrepreneur <strong>who helps thousands of writers improve their skills.</strong> This course is about becoming a Writerpreneur, that is, about writing for a living. First, you’ll learn how to <strong>make money online as a freelance writer, create irresistible proposals </strong>to get hired in the best platforms,<strong> get quality customers and beat the competition.</strong> Secondly, you’ll learn how to <strong>write high quality books that people pay for</strong>, so that you can <strong>get passive income while you sleep</strong>. Finally, I’ll teach you how to <strong>manage your sales</strong> so that you can focus your efforts just on writing while other professionals do the tasks required to<strong> develop your best projects ever. </strong></p><p>Most of the lessons are designed so that you can <strong>take instant action</strong> after watching them. That means you can <strong>start your professional writer career as soon as today.</strong> </p><p>If you follow the instructions step by step it <strong>is impossible that you don’t see the benefits</strong>. Plus, this course has 30 day money back guarantee, so there’s much to gain and nothing to lose.</p><p>Are you ready to<strong> turn your pen into pennies</strong>? Welcome!</p>", 
    "end_date": null, 
    "title": "Writerpreneur: Start your Writing Career", 
    "price": 0, 
    "instructors": "Manuel Arnedo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632726_1499_3.jpg", 
    "course_url": "https://www.udemy.com/writerpreneur/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T18:44:46Z"
}