{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Many successful entrepreneurs never write a formal business plan. However, they do create a vision for the future; they do set goals regularly; and they do structure their time to achieve their goals – they just don&#039;t write a formal 30 page document. So why do most colleges and universities offer a course in business plan development? Here are eight great advantages we see in creating a longer and more complete plan:</p><ol style=\"\"><li>It is essential for raising money from banks, angel investors and venture capital groups. No one will give you money without a professional, well thought out business plan.</li><li>It forces you to answer questions that will expand your knowledge of your market, competitors, business model, management team, marketing strategies, and financial plan.</li><li>It teaches you a process of research and discovery you can continue to implement throughout the growth and development of your business.</li><li>It improves your communication skills. Writing a full plan and presenting it to others helps improve both your written and oral communication abilities.</li><li>It will help you attract the key talent you need to succeed. A well devised plan can help you find advisors, partners, team members, suppliers, etc.</li><li>It tests your commitment to launch the new venture. After working through all the issues on paper you will know if the venture is feasible and if you want to proceed.</li><li>It provides a roadmap for executing your business concept. If you choose to proceed with your startup, your plan specifies what needs to be done quickly to gain traction.</li><li>It won&#039;t hurt you! It certainly isn&#039;t going to weaken your new enterprise. Rather, it can increase your chances for success.</li></ol>This course walks you through the components and process of writing a business plan.  You will hear from other successful entrepreneurs and venture capitalists sharing their thoughts on the business plans they have seen and created. At the end of the course you will be able to create your own, well thought out plan to further the success of your business.", 
    "end_date": null, 
    "title": "Writing a Professional Business Plan: The Dos and Don'ts", 
    "price": "50.00", 
    "instructors": "The Main Street Entrepreneur", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540306_4196_2.jpg", 
    "course_url": "https://www.udemy.com/writing-a-professional-business-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T15:11:55Z"
}