{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">If you&#039;ve ever seen “The Lion King,&quot; “Wizard of Oz,&quot; or “Star Wars,&quot; you&#039;ve experienced the power of The Hero&#039;s Journey in action. It&#039;s a beautiful, amazing thing. These are films that are successful as wonderful stories and are extremely profitable as well. <em style=\"\"></em><br style=\"\"><br style=\"\">But this course is not about how to write the next Hollywood blockbuster. It&#039;s about how to apply the power of mythology to your storytelling, whether it&#039;s short stories, novels, scripts, etc. Once you apply these principles, your stories will be more engaging and possibly more salable.</p><p style=\"\"><strong style=\"\">Introducing: Write Better Fiction With The Hero&#039;s Journey</strong><br style=\"\"></p><p style=\"\"><strong style=\"\">Here&#039;s what you get:</strong><br style=\"\"><br style=\"\"><strong style=\"\">Detailed lectures on all 12 stages of the Journey </strong>- This is comprehensive training; nothing is left out.<strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Background knowledge lectures</strong> - Develop a strong foundation for your learning. Understand what the journey is, and where it comes from. First, learn the rules, then break them.</p><p style=\"\"><strong style=\"\">Downloadable Mindmaps </strong>- great for increasing comprehension and recall. Saves you time by compressing all the main points. </p><p style=\"\"><strong style=\"\">Case studies</strong> - see the journey in action with several real-life case studies. These case studies show you how to recognize the underlying story patterns that once seemed invisible. Soon, you will be able to analyze any story using this method. Figure out why a narrative works, or why it doesn&#039;t. It&#039;s like having story “x-ray&quot; eyes!</p><p style=\"\"><strong style=\"\">Step-by-step Hero&#039;s Journey writing assignments</strong> - start applying what you&#039;ve learned immediately! Here&#039;s how to begin writing your own mythologically-enhanced stories.</p><p style=\"\">Speaking to you as a Creative Writing teacher, I can show you first hand what actually works. This is not theory, it&#039;s a comprehensive course that has been field tested over several years with many students. The writing assignments are my own design and come directly from my classroom.</p><p style=\"\"><strong style=\"\">Warning:</strong> This course is free for a limited time only. I reserve the right to start charging for this course at any time, so register now. I&#039;ll see you on the inside, Richard.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Write Better Fiction With The Hero's Journey", 
    "price": "20.00", 
    "instructors": "Richard Winser", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437888_8941_2.jpg", 
    "course_url": "https://www.udemy.com/the-heros-journey/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T20:15:33Z"
}