{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>      This course is about understanding business planning and writing a <strong class=\"redactor-inline-converted\">quality business plan</strong> . <strong class=\"redactor-inline-converted\">You will be provided with all the relevant templates and case studies.</strong></p>\n\n\n\n\n\n<p>     You will be taught all the important concepts of business management quickly along the way so that you can walk away as a business owner after this course , ready to tackle all business challenges.</p>\n\n\n\n<p>     It doesn’t matter whether you want to open an ice cream stall, a small manufacturing setup or build a billion-dollar service, you need a quality business plan to understand your own idea and pitch it to different audiences.\n\n  </p>\n\n\n\n\n\n<p>In this course, I will empower you with the tools and skills you need to create a simple, yet extremely effective </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">(a) business plan presentation </strong>and</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"> (b) a business plan document for your new business or idea.</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"> (c) At the end of the course, I will provide you with a real world business plan presentation and document for you to look and take help of.  </strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">(d) As you might not be familiar with certain business concepts, we will also go over some of them and do some assignments along the way to help you create this document.</strong>\n\n  </p>\n\n\n\n\n\n<p>     You will need this knowledge when you are <strong>pitching your idea </strong>to your friends, colleagues or investors. Internally, the business plan will help your <strong class=\"redactor-inline-converted\">critically analyze your own business situation </strong>and see whether it is worth your time and money in the long run.\n\n  </p>\n\n\n\n\n\n<p>    This course will help you answer the most critical questions you need to answer when you want to validate your business idea. Once you take this course, you will be able to create as many business plans as you want for as many ideas you want. And don’t fool yourself into thinking that your idea is worth anything; its absolute garbage unless you make a business plan out of it and test all your assumptions.\n\n  </p>\n\n\n\n\n\n<p>    Again, remember that ideas are useless unless you make something out of them, and writing a quality business plan is the most crucial step. 98% of Ideas never see the light of the day because the fear of failure is very high. Well if you enthusiastically take this course, you will be able to know beforehand whether your idea will work or not, and you can avoid pitfalls.\n\n  </p>\n\n\n\n\n\n<p>I am extremely excited to be a part of this journey and hope that you will help me help you bring out the best in you and your business idea. Let’s show the world how great your idea is.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Writing a Business Plan: Outline, Templates & Case Study", 
    "price": "30.00", 
    "instructors": "Sedan Kureshi", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/844028_2e0f_2.jpg", 
    "course_url": "https://www.udemy.com/quality_business_plan/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-09T17:33:38Z"
}