{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>YouTube is the perfect outlet to use any skill, interest, or passion you have for a paycheck. Whether you want to make YouTube videos for a living or just extra income, this course is going to help you achieve that. I will teach you everything you need to know walk you through starting a YouTube career. </p>\n\n<p>You don't need to have any prior knowledge about making money online to take this course. Everything you'll need to learn I will teach you in the lessons. However, if you are experienced with YouTube, but are not sure how to create videos that will generate you a revenue, this course is for you as well. That being said, the following lessons are perfect for total beginners, but also beneficial to the veterans. </p>\n\n\n\n<p>The course is made up of a few main sections. Each section consists of a few specific lessons that directly relate to it. </p>\n\n\n\n<p>There are over 90 minutes of tutorial content. I recommend that you devote half an hour a day to the course and starting your YouTube career. That way, you should set everything up and learn all the material in under a week. But if you really wanted to, you could do it all in less than 1 day. </p>\n\n\n\n<p><strong>After you finish the course, you will know exactly:</strong></p>\n\n\n\n<ul><li>How to start a YouTube channel</li><li>How to make money through YouTube</li><li>What will affect your income</li><li>What to do and what not to do</li><li>What type of content to upload</li><li>How to effectively utilize all the features available on YouTube</li><li>How to grow an audience from zero</li><li>How to increase your viewership and revenue</li></ul>", 
    "end_date": null, 
    "title": "YouTube Videos For a Living: Turn Passion to Passive Income", 
    "price": 0, 
    "instructors": "Adam Kwiatek", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814440_f7c6_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-for-a-living/", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T13:34:46Z"
}