{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Do you know Youtube is the number 2 largest search engine in the world beside Google. Imagine what you can do if you are able to rank any video you desire to the 1<sup>st</sup> page of youtube search engine?</strong></p>\n\n<p><strong>Course Update June 2016</strong></p>\n\n<p><strong>Course is Fresh with Case Study Done in October 2015</strong></p>\n\n<p><strong>You can even see me rank a competitive video with keywords \"lose weight\" in the 1st page of youtube. See this is lecture 6</strong></p>\n\n<p>This course is a complete blueprint to master YouTube as a marketing platform to promote any offer you want. You can promote CPA, Affiliate or just driving traffic to your website. It is up to your imagination. I have successfully done all this.</p>\n\n<p>I show you a couple of my youtube channel. I have many more channel as you may have guess. I show you my Maxbounty CPA earning from just 1 youtube channel. I show you my udemy affiliate earning.</p>\n\n<p>I walk the talk and setup a case study and show you how to rank the selected keyword to the 1<sup>st</sup> page of youtube.</p>\n\n<p>You see me rank a video from start to finish. From nowhere in the search engine and I come out first.</p>\n\n<p>Case study show that I am nowhere in search engine on the 5th October 2015. 30 mins into uploading I am rank 1st page on youtube for <strong>multiple keywords</strong>, not 1 not 2 but <strong>multiple keywords</strong></p>\n\n<p><strong>Watch it live how I rank multiple keyword on 1st page of youtube in 1 hours. I am not talking about long tail keyword but short and searchable keywords.</strong></p>\n\n<p>\"Thailand property agent, Thailand property agency, Thailand real estate agent, Thailand real estate agency, cheap Thailand property agent, good Thailand property agent, affordable Thailand property agent, budget Thailand property agent, etc I am not able to list all the keyword, there is too many\"</p>\n\n<p><strong>I am ranking also for a competitive keywords \"1970s let it be\" and I am ranked 1st on 1st page of youtube. You will see this in the course</strong></p>\n\n<p>I will let you look over my shoulder on how I setup everything in order to be profitable on YouTube.</p>\n\n<p><strong>Join me now and I will see you on the inside.</strong></p>", 
    "end_date": null, 
    "title": "YOUTUBE 2016  Youtube Power Ranking Formula 1st page Youtube", 
    "price": "20.00", 
    "instructors": "Winston Wee", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628540_184e_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-on-steroids-rank-multiple-keywords-in-1-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T04:14:21Z"
}