{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>「あなたの売上に貢献できて幸せです」</strong></p>\n\n<p>これは先日、購入者の方からもらったメールです。きっと情報ビジネスである程度の成功をおさめている方なら、一度や二度はもらったことがあるはずです。</p>\n\n<p>BBC（イギリス放送協会）によると、iPhoneの発売日にストアの前で列をなすApple信者の脳と、<strong>カルトや新興宗教にハマる人の脳は</strong>、全く同じ部位が発火しているそうです。</p>\n\n<p>憶測にしか過ぎませんが、先に紹介したメールの送信者も、きっとApple信者やカルト信者と同じ部位の脳が発火しているはずです。ちっとも不思議なことではありません。</p>\n\n<p>なぜなら、情報販売をしている（いわゆる）インフォプレナーと呼ばれる人たちは、意識的しろ無意識的にしろ、<strong>お客さんが「欲しい！」と思ってしまう</strong>ようなマーケティングのスキームを組んでいるからです。</p>\n\n<p>僕を含めて、成功している情報起業家は以下の手順を踏んでお客さんを説得します。</p>\n\n<ol><li>まずは参入する分野をGoogleのキーワードプランナーを使い探し出す</li><li>「まぐまぐ」や「ブログ」を更新しながら見込み客を集める</li><li><strong>コミュニケーションをとりながら見込み客の悩みを聞き出す</strong></li><li>見込み客の悩みをセールスレターに書き起こす</li><li>悩みの解決策を商品にして販売する</li></ol>\n\n<p>この流れです。見込み客から欲しい商品を聞いて、その商品を売っているんだから、売れないわけがないだろ！というのが僕らの内心。砂漠で彷徨っている人に対して「今、何が欲しいですか？」と聞けば、おそらく「水が欲しい」と答えるでしょう。あなたがその場で水を差し出せば、<strong>3秒も経たずに成約することができるでしょう。</strong><br></p>\n\n<p>何も難しいことはありません。</p>\n\n<p>このコースは、<strong>成功している情報起業家が踏むステップ</strong>を具体的に説明したものです。マインドセットに関するレクチャーが多いと感じられるかもしれませんが、できるだけ抽象的な概念をそぎ落とし、明日からでも使えるものだけをピックアップしたので心配はご無用。</p>\n\n<p>5分〜10分のレクチャーが44講義あるので、土日を使えば一気に視聴することができます。「これは言っておきたい！」と頭に降ってきたものから順番に講義にしたため、レクチャーの順番通りに作業を進めても、稼げるようにはなりません。</p>\n\n<p>通しで何度も見て、頭の中に<strong>「情報起業ってのはこーゆーもんなんだな」</strong>という体系的な知識構造を作っていただきたいのです。全体像が見えれば、次にやるべき具体的なステップが見えてくるからです。</p>\n\n<p>講義のほとんどは動画で行われているので、文章を読みたくない方や、耳だけで学習するのが苦手な方に最適のコンテンツになっているはずです。</p>\n\n<p>情報起業にはアンダーグラウンドなイメージが付きまといます。そして、この業界で儲けている人たちは、心底<strong>そのままアンダーグラウンドな状態であってほしい</strong>と願っています。なぜなら、世間の人々が、自分の知らないことを「むかつく」「怪しい」「ありえない」と叫び続けてくれる限り、情報起業家はますますその地位を確固たるものにします。</p>\n\n<p>それ故に、この講座を通して、<strong>アングラなイメージを払拭しようなんて気持ちはサラサラありません。</strong>ということで・・・この講座を受講して、情報起業家としてのビジネスモデルが完璧に理解できたとしても、他人に吹聴しないでください。吹聴した結果、たくさんの人たちがこの分野に参入して、<strong>業界全体の旨味が減ってしまうと困るからです。</strong></p>\n\n<p>繰り返しますが、仮にビジネスがうまく回っても黙っていてください。粛々と、人目を惹き付けないように、<strong>こそこそと仕事をしていてください。</strong></p>", 
    "end_date": null, 
    "title": "俺なら、3秒で説得するね！アングラに生きる情報起業家の生態学", 
    "price": "20.00", 
    "instructors": "Haamalu Limited Liability Company", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790438_6b8a_2.jpg", 
    "course_url": "https://www.udemy.com/infopreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-12T09:05:03Z"
}