{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>【このコースは、日本語字幕版です。字幕を表示するには、視聴画面下部の再生バーにある「CC」ボタンをクリックしてください。】</strong></p><p>新しいビジネスを立ち上げる時は、最初の一歩が肝心です。このコースでは、分野や経験を問わず、起業に興味のあるかた、いつか自分のビジネスを持ってみたいと思うかたへ向けて、シリコンバレーで30年スタートアップを見てきたガイ・カワサキ氏が、起業のエッセンスを語ります。</p>  <p><strong>ビジネスを立ち上げ、投資家やユーザーを惹きつける強いブランドを構築する方法</strong></p>  <p>  \t          ·ビジネスを立ち上げるために重要な観点を習得。</p>  <p>  \t          ·マーケティングの達人でもあるガイ・カワサキ氏から、ご自身のビジネスに対する評価のしかたを学びます。</p>  <p>  \t          ·「やってはいけないこと」を学び、効率的にビジネスを拡大する方法を学びます。<span></span></p>  <p>  \t          ·実際の起業家のセールスピッチを聞き、生のフィードバックをご覧いただきます。</p>  <p><strong>スタートアップにまつわる、起業家と投資家の両視点を知る</strong></p>  <p>このコースでは、ビジネスを立ち上げる際のポイントを学ぶだけではなく、ガイ・カワサキ氏が30年にも渡り積み上げてきた、起業家・アドバイザー・投資家としての知見を得ることができます。</p>  <p>起業家と投資家の両方を経験しているガイ・カワサキ氏ならではの視点で、両プレイヤーから見たビジネスについて解説します。このコースを通じて、彼がAppleやGoogle、またシリコンバレーで複数のスタートアップを立ち上げた経験から得たことをみなさまにお伝えしたいと願っています。<span></span></p>  <p><strong>コース概要</strong></p>  <p>既にビジネスプランを持っているかたから、ちょっといいアイデアを思いついたばかりのかたまで。起業のエキスパートであるガイ・カワサキ氏が、実話を交えながら、起業の各ステップをわかりやすくご説明します。</p>  <p>  \t<strong>·起業に関するAからZ：</strong>ローンチからセールスピッチまで、資金集めとチームビルディング、そしてビジネス拡大のためのマーケティングまで。事業拡大に必要なポイントをステップごとに学べます。</p>  <p>  \t<strong>·セールスピッチの実践プレゼンテーション:</strong> 起業を目指す若者による、投資家向けのセールスピッチをご覧いただきます。ガイ・カワサキ氏が本気のフィードバック（手加減ゼロです！）を行いますので、お楽しみに。</p>  <p>  \t<strong>·ガイ・カワサキ氏によるQ&amp;Aセッション:</strong>「良いアイデアと悪いアイデアの見分けかたは？」「事業が不調なときの気持ちの保ち方、事業が好調なときの気持ちの落ちつけかたは？」など、SNSフォロワーからの質問にガイ・カワサキ氏が答えます。</p><p>シリコンバレーで長年培われてきたスタートアップの知見や、実践的なアドバイスをもとに、ぜひあなたのアイデアをビジネスに結び付け、拡大させていく一助となれば幸いです。</p>", 
    "end_date": null, 
    "title": "元Appleエバンジェリスト、ガイ・カワサキの起業家塾（日本語字幕）", 
    "price": "50.00", 
    "instructors": "Guy Kawasaki", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425618_feef.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-course-by-guy-kawasaki_jp/", 
    "currency": "USD", 
    "subject_name": [
        "Entrepreneurship"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T04:14:03Z"
}