{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>\nLearn how to create a multimedia EPUB eBook by hand for\nApple iBooks and Apple devices (including the iPad and iPhone), and submit it\nto the iBooks store. Obtain complete control over your project by building from\nscratch, and implement unique features and functionality where WYSIWYG\nsolutions fall short.</p><p><br></p><p>       <strong>Build a strong foundation in the EPUB e-book format for the Apple iBooks platform and its many features.</strong></p><ul><li>The main example of this course is a published children's e-book, but knowledge gained from this course can be used to create many different types of e-books, not just children’s e-books</li><li>Complete review of all Apple sites and tools including the iBooks App, iBooks Store, iTunesConnect, and iTunesProducer</li><li>Crash course in HTML and style sheets (CSS)</li><li>Detailed look at all EPUB files and folders, and all of their sections, definitions, properties, and values</li><li>Custom narration with read-along highlighting text, and background sounds</li><li>Complete and extensive review of basic audio recording and editing</li><li>Submitting a final book to the iBooks Store and selling your book globally</li></ul><p><br></p><p>     <strong>Powerful and desirable skills for authors, publishers, developers, and freelancers.</strong></p><p>The e-book market is growing exponentially, and the EPUB format is a cross-platform standard. The adoption of and demand for e-books on iPads and other Apple devices is soaring. With over 2.5 million books on the iBooks Store, a number that is rising continually, the electronic book market is here to stay. This market presents an amazing opportunity not only for publishers, but independent authors and freelancers alike.</p>    <p>This unique and extensive course covers the entire scope of creating a multimedia EPUB iBook, from Apple support tools and sites, to a complete dissection of an EPUB project, to HTML and audio recording crash courses, to submitting, selling, and managing your final e-book.</p><p><br></p><p><strong>Content and Overview</strong></p>  <p>\nThis course represents months of research, reading extensive\ndocuments, examining files line-by-line, dissecting and creating projects, and\nsuccessfully publishing a children's iBook, which we will use as the main\nexample      throughout this course. Now let me show you how to do it      in a fraction of the time!</p><p><br></p><p>We will not be using iBooks Author (or any EPUB creation software) in this course. Instead, I'll show you how to do this by hand. But even if you already use WYSIWYG solutions to create EPUB files, this course will show you what is happening behind the scenes, and will give you the skills and felxibility to implement features that WYSIWYG solutions do not currently support. In this course I will be using screencast videos to show you exactly what I'm doing,      with over 10 hours of lessons and practice challenges, documents, downloadable sample EPUB files, and more.</p>    <p><br></p><p>We will cover: </p>  <ul><li>Review and dissect a published children's EPUB ebook, and other EPUB files</li><li>A complete review of all Apple sites and tools including the iBooks App, iBooks Store, iTunesConnect, and iTunesProducer</li><li>A crash course in HTML and style sheets (CSS)</li><li>Zipping and unzipping EPUB files</li><li>A detailed look at all EPUB files and folders, and all of their sections, definitions, properties, and values</li><li>Image formatting</li><li>Custom narration with read-along highlighting text, and background sounds</li><li>A complete and extensive review of basic audio recording and editing</li><li>Submitting a final book to the iBooks Store and selling your book globally</li><li>The iTunes Affiliate program</li></ul>                    <p><br></p><p>This course is designed for an author who is ready for the challenge of creating a multimedia EPUB iBook, as well as a publisher, developer, and freelancer whose goal is to complete projects for clients. Whichever it is, this is a hands-on endeavor that gives the student a thorough education into EPUBs for iBooks, and complete control of their project by diving deep into the code and files, and assembling a masterpiece by hand where WYSIWYG software solutions fall short.</p>    <p>At the end of this course, you’ll be able to create an EPUB ebook by hand for Apple devices by creating an EPUB with HTML, style sheets (CSS), text, images, and audio, dissect and edit existing EPUB files, record and edit audio for narration with read-along highlighting text and background sounds, upload your book to the iBooks Store using iTunes Producer, manage, sell, and update your book using iTunesConnect, and join the iTunes Affiliate program to earn even more money from the iBooks store.</p><p><br></p>", 
    "end_date": null, 
    "title": "Create EPUB Multimedia eBooks By Hand for Apple iBooks & iOS", 
    "price": "30.00", 
    "instructors": "Eric Larson", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/484520_4461_4.jpg", 
    "course_url": "https://www.udemy.com/create-epub-multimedia-ebooks-by-hand-for-apple-ibooks-ios/", 
    "currency": "USD", 
    "subject_name": [
        "Other Programming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-23T17:49:44Z"
}