{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t Con \"Programación desde cero de PLC con RSLogix500\" aprenderas todo acerca de la programación de controladores de la marca Allen Bradley, para las plataformas SLC y Micrologix, incluso sin nunca has programado un PLC con anterioridad.  </p>  <p style=\"\">  \t Este curso esta diseñado para que particulares, estudiantes, profesionistas que con algo o nada de conocimientos ni experiencia en programación de PLC's pueda programar desde cero secuencias, algortimos de programación en escalera para distintos tipos de procesos, semaforos, elevadores, llenadoras de botellas, compresores, procesos de batch etc.  </p>  <p style=\"\">  \t Alguna vez te has preguntado como funcionan las líneas de producción de una fabrica, como es posibles crear productos en masa, miles de productos ?  </p>  <p style=\"\">  \t El cerebro de cualquier línea de producción de una fábrica es un PLC Programable Logic Controller por sus siglas en ingles, un elemento indispensable para llevar a cabo cientos de tareas a la vez y de manera automática para controlar procesos a nivel industrial, incluso domesticos.  </p>  <p style=\"\">  \t Este curso cuenta con decenas de lecciones y examenes divididos en diferentes secciones. Cada sección te lleva a un nuevo nivel de conocimientos. Comenzamos desde lo más básico que es la instalación del software y herramientas.  </p>  <p style=\"\">  \t Hasta cubrir de una manera práctica los comandos más utilizados y necesarios para realizar practicamente cualquier tipo de secuencia, lógica y algoritmo de programación. El cielo es el límite, tu imaginación puede llevarte a controlar practicamente cualquier proceso que te imagines, desde automatizar tu casa, hasta controlar una fabrica completa.  </p>  <p style=\"\">  \t Al final de las secciones tienes examenes que te permitiran reafirmar los conocimientos adquiridos en las lecciones, esto es muy importante para saber si el curso esta cumpliendo con su objetivo.  </p>  <p style=\"\">  \t En la última sección del curso comenzaremos con la programación de casos reales, con aplicaciones de procesos que te permitiran aplicar todas las lecciones y resolver problemas muy comunes en el mundo real del control.  </p>", 
    "end_date": null, 
    "title": "Programación desde cero de PLC con RSLogix500", 
    "price": "40.00", 
    "instructors": "Luis Cruz", 
    "commitment": "19 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206338_1901_4.jpg", 
    "course_url": "https://www.udemy.com/programacion-desde-cero-de-plc-con-rslogix500/", 
    "currency": "USD", 
    "subject_name": [
        "Other Programming"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-28T05:27:47Z"
}