{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t      En este curso aprenderemos a crear  reportes personalizados para su impresión utilizando para ello el kit de  Jasper Reports Integration y la herramienta de  diseño de reportes gratuita IReport Designer.  </p>  <p style=\"\">  \t      Abarcaremos temas como:  </p>  <ul style=\"\">  \t<li style=\"\">Instalación y configuración del kit de JasperReports Integration</li>  \t<li style=\"\">Creación de reportes básicos utilizando los templates que trae por defecto el IReport Designer 5.1</li>  \t<li style=\"\">Creación de Informes parametrizados utilizando imágenes dinámias de nuestra tabla en la base de datos.</li>  \t<li style=\"\">Creación de un Informe Gráfico en IReport y en Oracle Apex aprendiendo a filtrar el informe por medio de un intervalo de fecha.</li>  \t<li style=\"\">Creación de Formularios e Informes en Oracle Apex para gestionar los reportes creados en PDF.</li>  </ul>  <p style=\"\">  \t El curso cuenta con 15 lecciones en el cual paso a paso te guiaré en la creación del entorno para la gestión de impresión de reportes en Oracle Apex utilizando herramientas gratuitas existentes en el mercado.  </p>  <p style=\"\">  \t Para tomar este curso es necesario que tengas acceso a una instancia de la Base de Datos Oracle con acceso a Oracle Application Express Listener instalado en un Servidor Glassfish.  </p>  <p style=\"\">  \t ¿Por qué debería tomar éste curso?  </p>  <p style=\"\">  \t Si estas trabajando con el desarrollo de aplicaciones web con Oracle Application Express y necesitas que tus reportes se vean profesionales y personalizados sin tener que gastar grandes sumas de dinero tanto para el desarrollo de los reportes como por gastos de licencia, éste curso es para ti!  </p>  <p style=\"\">  \t Estas listo para empezar?  </p>", 
    "end_date": null, 
    "title": "Reportes Oracle APEX", 
    "price": "50.00", 
    "instructors": "Clarisa Maman Orfali", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/220122_4497_5.jpg", 
    "course_url": "https://www.udemy.com/reportes-personalizados-pdf-oracle-apex/", 
    "currency": "USD", 
    "subject_name": [
        "Other Programming"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-16T01:38:05Z"
}