{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Is this course for me?</p><p>Do you have basic German skills and want to expand them, but you only have limited time? Do you need an online course that will help you improve your speaking, listening and reading comprehension skills at the same time? Do you wish you could get the intonation right? Would you like to be able to understand higher-level conversations in German? Would you like to immerse in the German language and culture in an authentic way? Then, this course is for you!</p><p>The course starts with an guidance through an online flashcard-making site, which will help you reach your goal in the shortest time possible. </p><p>5 words/phrases and a proverb constitute the focus of each one of the 50 video-lessons the course consists of. The vocabulary is embedded in short dialogs. You will be able to read along as you are listening to  the meanings of the proverbs as well as to the dialogs. Should you want to practice intonation and/or pronunciation, feel free to pause the video after each sentence and repeat it. If you invest 15 minutes a day, it will take you 10 weeks to complete the course and consolidate all vocabulary. Ideally, you study a lesson per day from Monday to Friday and have a review of the vocab learnt during the week on the weekend. You can review the vocab entirely online as you will see in the introductory lesson.</p><p>Are you ready to immerse into the wonderful world of figurative language? <em style=\"\">Dann lass uns loslegen!</em></p>", 
    "end_date": null, 
    "title": "Boost your German!", 
    "price": "20.00", 
    "instructors": "German Learner  Corner", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497086_0aae_4.jpg", 
    "course_url": "https://www.udemy.com/boost-your-german/", 
    "currency": "USD", 
    "subject_name": [
        "German"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-08T20:06:59Z"
}