{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Dive deep into the realms of the German language. Master all the ins and outs of German grammar and you’ll feel much more comfortable about the language. In this course we’ll explore all the main areas of German grammar, pronunciation and spelling.</p>    <p><strong>Discover How Fantastically Ordered the German Language Is and How Marvelous It Is To Use It Correctly.</strong></p>    <ul><li>Pronunciation and Spelling</li><li>Conjugation Patterns of Regular and Irregular Verbs, German Tenses</li><li>Number and Gender of Nouns</li><li>Declension Patterns of Nouns and Adjectives, German Cases</li><li>Articles, Pronouns, Prepositions and Conjunctions</li><li>Word Order in Declarative and Interrogative Sentences</li><li>Cardinal and Ordinal Numbers, Date and Time</li><li>Direct and Indirect Objects</li><li>Verb Forms, Participles</li><li>Special Verbs – Modal and Reflexive Verbs</li><li>Verbs with Separable and Inseparable Prefixes</li><li>Comparison of Adjectives and Adverbs</li><li>Possessives</li><li>Diminutives</li><li>Compound Nouns</li><li>Ways to Express the Future</li><li>Compound and Complex Sentences, Coordination and Subordination of Clauses</li><li>Passive Voice</li><li>... and much more</li></ul>                                          <p><strong>Become a Highly Skilled User of German – It’s All Well Within Your Reach.</strong></p>      <p>German is definitely one of the most popular languages in the world. There’s a whole bunch of benefits to knowing German. Let me just mention a few. In our global society you can make use of it in business, becoming a more valuable worker, in private life, on vacation, chatting online, reading Goethe or watching satellite TV. In some parts of the world, like for instance in Europe, German is taught as the foreign language number two, just after English. And I could go on and on like that...</p>    <p>This is an intensive course, which means it covers the basics from level zero (absolute beginner) and then you wander across all the lectures and learn quite a lot of stuff. The language is concise and clear. You should have no difficulty following it and understanding. A lot of stuff and a lot of practice.</p>    <p><strong>Contents and Overview</strong></p>    <p>This course is pretty comprehensive. It contains all the basic areas of German grammar. Starting off with German spelling and pronunciation, touching upon all the main grammatical categories in the first sections and then going into much more detail in the following sections. The language I use is simple and should be easily understood by absolute beginners.</p>    <p>This course is divided into 16 sections, each of them covering a broad topic subdivided into lectures. The pace is up to you, you can go through the easier parts faster and then take more time to study the more sophisticated ones.</p>    <p>To help you memorize and practice all the new stuff, there are loads of exercises. Most lectures are accompanied by additional resources. These are downloadable files with written and audio exercises (with key). There also files with vocabulary and, first of all, the main text file containing the material covered in the lecture video. This written material is much more detailed and extended than what you can find in the video.</p>    <p>After you finish each section, there’s a quiz for you that covers the material discussed in that section.</p>    <p><strong>This course contains:</strong></p>    <ul><li>112 lectures in 16 sections</li><li>243 pages of grammar explained in detail (extended lecture materials)</li><li>over 10 hours of video content</li><li>182 written exercises on 132 pages, with complete answer keys</li><li>214 audio exercises with complete scripts and answer keys (over 3 hours of recorded content)</li></ul>              <p>After you finish this course you will be able to use the German language comfortably and correctly, understanding all the underlying rules and thus able to generate any constructions you want, in both spoken and written language. You will be able to use simple, compound and complex sentences and you will know what word order should be used. You will know how the language works and you will get a good feel of it.</p>", 
    "end_date": null, 
    "title": "Deutsch Intensiv - Intensive German Course for Beginners", 
    "price": "25.00", 
    "instructors": "Kamil Pakula", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607816_21f5_3.jpg", 
    "course_url": "https://www.udemy.com/deutsch-intensiv-intensive-german-course-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "German"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T09:18:40Z"
}