{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Speak Better German Today: Effective and Easy German Grammar for Beginners</p><p>Are you a complete beginner when it comes to the German language? Or someone who sat through lots of lessons in school and felt bored and confused?</p><p>Don't give up on one of the most important languages in the world today! </p><p><strong>German is a language spoken by millions of people and one of the Top 5 Desirable Languages in UK Employer Surveys according to the Goethe Institute. </strong><br></p><p>It's normal to get stuck when you are trying to make sense of complicated grammar books. But let me assure you:</p><ul><li>You are not too old to learn a language</li><li>You are not too stupid to learn a language</li><li>You are not too forgetful</li></ul><p>Want some proof? Then take this course and discover German grammar with simple, straightforward explanations in English.</p><p>I have taught German for three years and have worked with American CEOs, Chinese students and EU-approved translators. The best way of learning is always to have complex rules explained  in simple terms. </p><p><span></span>For everyone who has a phrasebook gathering dust on the shelf, try working with me and using:</p><ul><li>Simple explanations from a friendly and fun teacher</li><li>In-depth Workbooks full of exercises that will help you test yourself</li><li>Quizzes that assess your knowledge step by step</li><li>Real life examples of German grammar \"in the wild\"</li></ul><p><strong><br></strong></p><p><strong>Wouldn't you love to learn at your own pace and access lessons whenever you need to?</strong></p><p>The course covers every topic that the beginning learner needs. It is developed to match the content of leading course books, for example <em>Menschen </em>and <em>Deutsch Plus.</em></p><p><em>Kerstin makes it easy, exciting and gives elegant examples that take zero effort to learn, though we cannot promise that a  little effort won't go a long way once you start using this knowledge. (Anthony Metivier, Magnetic Memory Method and author of the Udemy Course How to Memorize the Vocabulary of Any Language)</em></p><p><em></em>If you take <strong>Easy German Grammar for Beginners, </strong>you'll have the foundation to become a confident speaker and learner of German.</p><p><span></span></p><ul><li><span></span></li></ul>", 
    "end_date": null, 
    "title": "Easy German Grammar for Complete Beginners", 
    "price": "30.00", 
    "instructors": "Kerstin Hammes Cable", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634668_eeba_4.jpg", 
    "course_url": "https://www.udemy.com/german-grammar-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "German"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T10:17:08Z"
}