{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<ul><li><strong>Latest Update: April 2016</strong></li><li><strong>Join 5,100+ successful students who have already taken this course!</strong></li><li><strong>Instructor is available inside the course to answer questions and provide feedback</strong></li></ul>\n\n<p>_________________________________________________________________________________________________</p>\n\n<p>Learn the grammar, vocabulary and communication skills you need in order to become a fluent German speaker.<br></p>\n\n<p><strong>This course is perfect if you want to:</strong><br></p>\n\n<ul>  \t<li>master everyday situations in a German speaking country</li>  \t<li>communicate accurately what you want to say</li>  \t<li>be spontaneous in conversations and discussions</li>  \t<li>develop your reading, writing, speaking and listening skills</li><li>pronounce German words like native speakers</li><li>use German grammar with ease and fluency</li>  </ul>\n\n<p><em></em></p>\n\n<p><em>\"Ingo has a ton of experience in German teaching. You can tell all of the best practices and good tips come to life here. His pace is perfect for the beginner so don't be intimidated! Highly recommend.</em><em>\" - Gabriel John Rodriguez</em></p>\n\n<p><em> </em></p>\n\n<p><strong></strong></p>\n\n<p><strong>Cover the basics and then progress fast</strong></p>\n\n<p>  \t                                                                      Whether you are a complete beginner, too busy for a language class, or needing to brush up before a vacation or business trip, this is the course for you. It covers all four basic skills: speaking, listening, reading and writing, and you can enjoy the freedom and flexibility to learn at your own pace.  </p>\n\n<p>  \t                                                                  Grammar and vocabulary are taught through texts and dialogues based on everyday situations ranging from talking about interests and hobbies, daily routines to ordering food in a restaurant and making a doctor's appointment.  </p>\n\n<p><em></em></p>\n\n<p><em>\"This course was great on many levels. It really outlines the basics and builds a solid foundation. Things are explained and taught in a simple and clear format. The progression is also very encouraging because one continues to build on previous lessons. I highly recommend this course!\" - Peter Hamon</em></p>\n\n<p><em> </em></p>\n\n<p><strong></strong></p>\n\n<p>  \t<strong>Start forming sentences after the very first lesson</strong>  </p>\n\n<p>  \t                                                            The language is approached in a functional and communicative way so that you can easily use what you have learned to communicate in German effectively.  </p>\n\n<p>  \t                                                    I have kept the grammatical explanations as simple and user-friendly as possible to allow you to progress at a steady pace but at the same time build up a sound understanding of how the language works and so build up your confidence.</p>\n\n<p><em></em></p>\n\n<p><em>\"I love the approach the teacher uses. It's all about immediate immersion in to full sentences, then he breaks down the parts of the sentences. He also encourages you to get out of the course to online forums and apps that will help build your vocabulary and connect you with native speakers. It's really great and totally worth the $!\" - Levi Baade</em></p>\n\n<p><em> </em></p>\n\n<p><strong></strong></p>\n\n<p><strong>This is what you can expect:</strong></p>\n\n<ul>  \t<li>Professional, fun and easy-to-understand lessons</li>  \t<li>Engaging exercises that let you test your comprehension</li>  \t<li>Guided speaking lessons to build your conversational skills</li>  \t<li>Exceptional support and prompt answers to your questions</li>  \t<li>Downloadable MP3 audio versions of all lessons to listen to on the go</li>  \t<li>A 30-day full refund guarantee, no questions asked</li>  \t<li>And last but not least… to learn German fast!</li>  </ul>\n\n<p><strong></strong></p>\n\n<p><strong></strong></p>\n\n<p>  \t<strong>                  Are you ready? Then take this course and start speaking German right away!  </strong>  </p>", 
    "end_date": null, 
    "title": "German Made Simple: A Complete Course for Serious Learners", 
    "price": "25.00", 
    "instructors": "Ingo Depner", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339906_c888_4.jpg", 
    "course_url": "https://www.udemy.com/german-made-simple/", 
    "currency": "USD", 
    "subject_name": [
        "German"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T15:35:16Z"
}