{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong></strong>Are you a German learner and struggling to conjugate German verbs in the past tense?</p>\n\n<p>Do you keep on forgetting how the verbs change from the present tense to the past tense? Do you often wonder if it's a regular or irregular verb or if you need to use HABEN or SEIN?</p>\n\n\n\n\n\n\n\n<p>Is this really annoying you?</p>\n\n\n\n\n\n\n\n<p>Then this course is going to help you!</p>\n\n\n\n\n\n\n\n<p>In this course we will only look at German verbs in the past tense and we'll cover the following:</p>\n\n\n\n\n\n\n\n<ul><li>the perfect tense with haben</li><li>the perfect tense with sein</li><li>regular verbs</li><li>irregular verbs</li><li>separable verbs</li><li>inseparable verbs</li><li>the imperfect tense</li><li>the pluperfect tense</li></ul>\n\n\n\n\n\n<p>This course is not necessarily designed for you to work your way through.<br></p>\n\n\n\n\n\n\n\n<p>If you are a beginner then this course isn't for you yet. This course assumes that you already have a sound knowledge of the present tense, so make sure you know how to conjugate verbs in the present tense before buying this course.</p>\n\n\n\n\n\n\n\n<p>If you are an advanced student, you probably know everything in this course but it might be a welcome refresher.</p>\n\n\n\n\n\n\n\n<p>If you are an intermediate student, then either watch all the videos to revise what you have already learned, or pick those chapter that you are struggling with.</p>\n\n\n\n\n\n\n\n<p>It doesn't matter how quickly you complete the course - it isn't a race - the important bit is that you can conjugate verbs in the past tense!</p>\n\n\n\n\n\n\n\n<p>At the end of the course you will have a better understanding of German verbs in the past tense which will make life a lot easier when you want to be able to tell people in German about things you have done.</p>", 
    "end_date": null, 
    "title": "German grammar - the past tenses", 
    "price": "20.00", 
    "instructors": "Angelika Davey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680340_03ee_2.jpg", 
    "course_url": "https://www.udemy.com/german-grammar-the-past-tenses/", 
    "currency": "USD", 
    "subject_name": [
        "German"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T09:14:22Z"
}