{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<strong></strong><strong>Are you travelling to Germany for a holiday or for business? </strong>This course will exceed your expectations and in no time you will know plenty of German to go to Germany for a holiday or to speak successfully at a business meeting! So what are you waiting for and enroll today!  </p>  <p>  \t<strong>                                                             What's in it for you?</strong>  </p>  <ul>  \t<li>This course will ultimately provide you the key success and confidence to speak German at a business meeting or on a holiday.</li>  \t<li>It starts your journey to German giving you the basic knowledge and skills for speaking, writing and listening in German.</li>  \t<li>It teaches you the necessary structures and vocabulary to communicate in German. </li>  \t<li>This course gives you the confidence to speak German - very important!</li>  </ul>  <p>  \t<strong>It offers a 17 page guide on Grammar, an 11 page guide on Essentials, a section on 'How to order food', a section on 'How to get there', Podcasts and also contains 21 videos with dialogues and a large range of Vocabulary for <em>your</em> learning.</strong>  </p>  <p>  \t<strong>                                                                  What does it include?</strong>  </p>  <ol>  \t<li>Willkommen! </li>  \t<li>Teacher's Recommendations</li>  \t<li>Grammar</li>  \t<li>Essentials</li>  \t<li>How do you get there?</li>  \t<li>How to order Food?</li>  \t<li>Deutsch macht Spaß! </li>  \t<li>More About German</li>  </ol>  <p>  \t                                                                                                                 Once you have completed this practical course, you will easily be <strong>able to speak German in confidence at that business meeting or on your holiday in Germany. </strong>  </p>  <p>  \t                                                                                                                 Enroll in this course now and start speaking German today!  </p>", 
    "end_date": null, 
    "title": "Learn German for Beginners - For Business or Holidays!", 
    "price": "25.00", 
    "instructors": "Alexander Dalla-Riva", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/247120_f98f_8.jpg", 
    "course_url": "https://www.udemy.com/german-course-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "German"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-20T12:40:51Z"
}