{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<strong style=\"\">Why should you learn idioms?</strong>  </p>  <p>  \tIdioms will help students improve their communication skills. The use of idioms has a great influence on the learning process in a new language, especially in German.  </p>  <p>  \tTo develop an <strong style=\"\">understanding of idioms</strong> helps you mainly in two ways:  </p>  <p>  \t 1. The more idioms you master, the more natural the language sounds like  </p>  <p>  \t 2. When learning the idioms, you will also learn about the country&#039;s culture and everyday language  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Why should you improve your German language skills by using this course?</strong>  </p>  <p>  \tYou want to reach to the next level in your language comprehension?  </p>  <p>  \tThen, this course is the right one for you.  </p>  <p>  \t<strong style=\"\">Why?</strong>  </p>  <p>  \tIdioms play a very crucial role in the German language.  </p>  <p>  \tOnly those, who developed an understanding of the key idioms in German language, will be able to gain a better understanding of the language and the cultural roots of the German language and society.  </p>  <p>  \tYou will find many helpful idioms in this course, such as:  </p>  <p>  \t„am Ball bleiben“  </p>  <p>  \t„alles unter einen Hut bringen“  </p>  <p>  \t...and many more.  </p>  <p>  \t<strong style=\"\">Do not try to translate</strong> word by word..  </p>  <p>  \t„stay at the ball“  </p>  <p>  \t„get everything under your hat“  </p>  <p>  \tBecause like this, all the sentences are nonsense and nobody would understand you if you used the words like this, nor could you follow a conversation in German properly, if you understood these words literally.  </p>  <p>  \t If you &quot;want to have more on the box&quot; (etwas auf dem Kasten haben) fast, then you should not „head into the sand&quot; (den Kopf in den Sand stecken) but &quot;roll up your sleeves&quot; (die Ärmel hochkrempeln). <strong style=\"\">(Literally translated :)</strong>  </p>  <p>  \tDo not worry: at the end of <strong style=\"\">this course</strong>, you will understand all these idioms and you will be able to use them appropriate in your conversations.  </p>  <p>  \tEnjoy getting a better grip of the <strong style=\"\">German language</strong>!  </p>", 
    "end_date": null, 
    "title": "Master German Language With Idioms", 
    "price": "25.00", 
    "instructors": "Angela Akar", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397202_452b_2.jpg", 
    "course_url": "https://www.udemy.com/master-german-language-with-idioms/", 
    "currency": "USD", 
    "subject_name": [
        "German"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-18T12:53:12Z"
}