{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>ABOUT THIS COURSE</p><p><strong style=\"\">&quot;Master your German online&quot;</strong></p><p>In my course, which is NOT a language course, you will learn how to master and improve your language skills over a given time span of your own choice by using open and free online resources which are authentic and constantly updated by institutions and different providers.</p><p><strong style=\"\">Who Is This Course For?</strong> </p><p>The target group of my course are adult and highly motivated students of German worldwide who have already achieved an intermediate level of German (B 1 / B2 according to the European Common Framework) either at their schools or universities or in other contexts. Improving your “Business German&quot; is not directly addressed in this course, but can be mastered as well by choosing your own resources online.</p><p><strong style=\"\">No teaching but coaching</strong></p><p>I will take you step by step through known portals like the website of the GOETHE-INSTITUT and DEUTSCHE WELLE and help you to create and develop your individual and powerful pathway to improve your understanding of authentic videos and texts and media updates in the target language and demonstrate based on my 35 years experience of teaching languages and literature how to improve your grammar, your reading and writing skills and how to boost up your German without losing interest in the subject matter.</p><p>I will use a clear project based lesson structure for my course allowing you to follow my examples and then explore freely on your own without further guiding and tutoring. This adult learning concept trust that you will not have to study texts or videos on subject matters you are not interested in.</p><p>So no waste of time and lost energies.</p><p><strong style=\"\">This course is suitable for anyone with normal computer and IT skills.</strong></p><p>If in trouble I will be there to guide you through possible solutions teaching you to find answers on the net or on special forums.</p><p><strong style=\"\">What will you be able to do after taking this course?</strong></p><p>By the end of the training you will know how to:</p><p>- Navigate the portals above successfully and bookmark the relevant sites you need for your own second language development.</p><p>- Know how to use videos, audio and text resources to master and improve your language skills</p><p>- Be able to use audio resources of your choice and find text versions so that you can read what you are listening to (2 channel learning)</p><p><strong style=\"\">What Is Covered In The Course?</strong></p><p>- Introduction - Motivation and adult learning concepts</p><p>- Learning German with the GOETHE - INSTITUT</p><p>- Learning German with DEUTSCHE WELLE</p><p>- SPIEGEL online - Authentic texts, Audio and Video resources in the target language</p><p>- SPIEGEL online INTERNATIONAL - English resources and how to use them to boost your German</p><p>- Projekt Gutenberg - reading German literature online and how to get audio resources or English translations to boost your German</p><p>- The novel &quot;Jahrestage&quot; by Uwe Johnson / a free audio streaming project</p><p>- Master your general communication skills</p><p>- How to communicate effectively</p><p>- Reading strategies - how to improve reading comprehension</p><p>- Master your vocabulary</p><p>- Master your grammar skills</p><p>- Final ideas and support</p><p>- Summary</p><p><strong style=\"\">30 Day Money Back Guarantee</strong></p><p>If you are not happy with the course for any reason whatsoever, you are entitled to a 30 day money back guarantee. No questions asked.</p><p>The course will be upgraded regularly and students&#039; feedback will be considered for further updates.</p><p><strong style=\"\">WHAT&#039;S IN THE COURSE?</strong></p><p> 1  To start with 10 sections and 20 lectures / more than 20 hours of content according to your own navigation and needs</p><p> 2  You will be able to navigate the GOETHE Website and DEUTSCHE WELLE and bookmark the relevant sites of your choice</p><p> 3  You will be able to participate in forums with likeminded students of German</p><p> 4  You will be able to find partners for mail exchange in both German and English </p><p> 5  You will be able to find partners for SKYPE sessions to practise and improve your German</p><p> 6  This course will be upgraded and extended / more to come.</p><p><strong style=\"\">COURSE REQUIREMENTS:</strong></p><p> 1  Normal computer skills and access to the internet</p><p> 2  A minimum of 2 to 3 hours per week to boost your German</p><p> 3  A high degree of self motivation </p><p>WHO SHOULD ATTEND?</p><p> 1  This course is designed for students of German worldwide who have already achieved an intermediate knowledge of the target language.</p><p> 2  This course is NOT a language course.</p><p> 3  This course is highly suitable for teachers of German worldwide who want to feel more confident in front of their language classes.</p>", 
    "end_date": null, 
    "title": "Master your German", 
    "price": "20.00", 
    "instructors": "Peter Bloecker", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520984_6391_5.jpg", 
    "course_url": "https://www.udemy.com/master-your-german/", 
    "currency": "USD", 
    "subject_name": [
        "German"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-05T04:18:04Z"
}