{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<ul><li><strong>Latest Update: April 2016</strong></li><li><strong>Join 2,100+ successful students who have already taken this course!</strong></li><li><strong>Instructor is available inside the course to answer questions and provide feedback</strong></li></ul>\n\n<p>_________________________________________________________________________________________________</p>\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n<p>This course is designed to teach practical and useful German conversation. It will help you make new friends, find the right words in daily conversation and speak German with confidence in a wide range of real-life situations.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>\"Speak German like a Native\" is perfect if you want to:</strong><br></p>\n\n\n\n\n\n<ul><li>be able to express yourself in perfect German</li><li>say the right thing at the right time</li><li>improve your listening and comprehension skills</li><li>perfect your pronunciation</li><li>boost your conversation skills</li><li>speak German with confidence</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><em><em>“I have found myself in many situations where\nthis course would have come in very handy, wish I've studied this earlier!” –\nBrenda Penante</em></em></p>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>The focus is on conversation and communication</strong></p>\n\n\n\n\n\n<p>This course will improve your German knowledge with hundreds of customizable phrases used in spoken German. It does not include grammar explanations, but focuses on conversation (fluency and confidence). It is the perfect complement to self-study, traditional classroom lessons or video courses such as my best-selling course \"German Made Simple: A Complete Course for Serious Learners\". </p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><em>\"Ingo has made a great effort to include a variety of different situations where a language learner may stumble if put on the spot - even as far as including what you could say regarding a football match! It's well thought out, clear and includes PDF's for all sections.</em><em>\"  - Jacky S</em><br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>This is what you can expect:</strong></p>\n\n\n\n\n\n<ul><li>Professional, fun and easy-to-understand lessons</li><li>Engaging exercises that let you test your comprehension</li><li>Exceptional support and prompt answers to your questions</li><li>Downloadable PDF files with all the course content </li><li>A 30-day full refund guarantee, no questions asked</li><li>And last but not least… to speak German like a native!</li></ul>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>Are you ready? Then sign up for this course and take your German conversation skills to the next level!</strong></p>", 
    "end_date": null, 
    "title": "Speak German like a Native: A Practical Conversation Course", 
    "price": "20.00", 
    "instructors": "Ingo Depner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426984_fff4_2.jpg", 
    "course_url": "https://www.udemy.com/speak-german-like-a-native-german-conversation/", 
    "currency": "USD", 
    "subject_name": [
        "German"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T16:24:10Z"
}