{
    "selfpaced": true, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Este curso utiliza un enfoque no técnico para analizar la forma en la que los gobiernos utilizan políticas económicas para influenciar la economía de sus países. Al finalizar el curso el participante hablará con propiedad sobre temas tan importantes como la deuda y el déficit de los países, podrá examinar las políticas fiscales y monetarias así como las reformas estructurales de los países. Estos conceptos le ofrecerán los conocimientos necesarios para estar informados y poder crear su propio criterio respecto a los debates económicos de la actualidad: estímulos fiscales vs. austeridad, las virtudes de las innovaciones de los bancos centrales en política monetaria, cuándo se necesitan altas tasas de interés y el camino hacia el crecimiento para muchas de las economías más avanzadas.\n\n                                            Syllabus\n                        Información general de macroeconomíaEstamos rodeados de noticias y comentarios relacionados con la macroeconomía. Para entenderla, necesitamos afianzar conceptos básicos como son el del PIB, inflación y desempleo para conocer cuáles son sus niveles “normales” y cómo se relacionan entre sí. A pesar de que dichos niveles no son algo mecánico, ofrecen los cimientos básicos para entender qué es lo que hacen los gobiernos en macroeconomía.La herramienta de la política fiscal¡Bienvenido al Módulo 2! Profundizaremos en la política fiscal, una de las herramientas que tienen las autoridades para influir en la economía y llevar al PIB más cerca de su tasa de crecimiento ideal. Estas herramientas son cambios que hace el gobierno sobre sus gastos y los ajustes en los impuestos del país. Para tratar de medir cuánto gasto e impuestos se necesitan para llevar al PIB a su potencial, utilizaremos dos conceptos: el multiplicador y el efecto de desplazamiento. Sin embargo, el gasto y los ingresos por concepto de impuestos también se mueven automáticamente en el ciclo económico, lo que hace que la economía sea más estable. ¡Gracias por acompañarnos! ¡Disfrute aprendiendo!Déficits, deudas, mitos y realidades¡Bienvenido al Módulo 3! Ahora sabemos cómo se supone que funciona la política fiscal en la economía, para cerrar las brechas recesivas o inflacionarias. En este módulo miraremos en detalle los déficits y las deudas en el mundo real. ¡Estoy segura de que tendremos debates interesantísimos sobre estos temas! ¿Cómo es que se aplican? ¿Qué son los déficits y las deudas de los gobiernos? Cuando los gobiernos incurren en déficit y necesitan pedir préstamos, ¿cómo y a quién se los piden? ¿En qué momento se convierten en un problema el déficit y la deuda? En este módulo estudiaremos a los EEUU y a otras economías avanzadas para responder estas preguntas, aclarar algunos malentendidos y estudiar los conceptos más importantes de esta época en cuanto a déficits y deudas. ¡Buena suerte y nos vemos en línea!Política monetaria¡Bienvenido al Módulo 4! Esta semana estaremos abordando un tema fascinante: la política monetaria, y puedo anticipar que tendremos unos debates muy activos. La política monetaria es la otra herramienta fundamental que tienen los gobiernos para influenciar la economía. Las autoridades monetarias trabajan con la masa monetaria para influir en los mercados monetarios y por tanto a la economía real. Pueden realizar operaciones de mercado abierto, variar sus propias tasas activas y reservas o modificar el coeficiente de reserva. Tal como sucede con la política fiscal, una vez que se identifica la brecha económica, se debería utilizar una política monetaria expansiva para las brechas recesivas, y una política monetaria restrictiva en una brecha inflacionaria. La política monetaria es mejor que la política fiscal en muchos sentidos, pero su mayor debilidad es que es mucho menos efectiva en las brechas recesivas que en las brechas inflacionarias. ¡Siga haciendo tan buen trabajo!Combinando políticas económicas y otras herramientas¡Bienvenido Courseriano a nuestro quinto módulo en el curso “Analizando la política económica”! Ya conocemos muchas herramientas y ahora podemos invertir nuestras últimas sesiones en juntar todas las partes y abordar los desafíos de las políticas del mundo real. Hay pocas cosas que podrían ser así de relevantes y espero que lo disfrute. En el mundo real, las autoridades fiscales y monetarias puede que se muevan en la misma dirección o pueden actuar en sentidos opuestos el uno del otro. Exploraremos qué sucede cuando las autoridades fiscales y monetarias interactúan en la economía real. Adicionalmente, los que toman las decisiones sobre estas políticas tienen otras dos opciones que pueden utilizar para influenciar la economía, que son la política de tipo de cambio y las políticas estructurales. Discutiremos cómo funcionan y cuáles son las complicaciones y ventajas que conllevan. Este módulo incluye un trabajo que será revisado por sus compañeros. Para responderlo, tendrá que utilizar el Simulador de Políticas Económicas, un ejercicio interactivo gratuito para los participantes de Coursera. En el cual tendrá la oportunidad de decidir las políticas para un país cuyo nombre no conoce. Utilice todas las herramientas que hemos aprendido juntos y disfrute de la oportunidad de tomar decisiones para ese país. Gracias por la efusiva participación, ¡disfrute los dos últimos módulos del curso!Formulación de Políticas tras la Crisis Financiera¡Ya se encuentra en el último módulo de nuestro curso “Analizando la política económica”! Tras haber visto la teoría que hay detrás de la formulación de políticas económicas, dedicaremos este último módulo a ver qué hacen los formuladores de políticas en los países desarrollados. Discutiremos si las tasas de interés han sido apropiadas para un grupo de países y cuáles son las consecuencias en caso de que no sean apropiadas. Discutiremos también la expansión cuantitativa, principal política monetaria “no convencional”, y trataremos de anticipar algunas de sus consecuencias. Daremos un vistazo a los déficits y las deudas de algunos países y utilizaremos nuestras herramientas para determinar si son un problema; analizaremos las políticas de “austeridad” que han aplicado muchos países europeos; también veremos la combinación de políticas fiscales, monetarias y estructurales que se están utilizando en Japón, conocidas como “Abenomics”. También consideraremos los peligros de la búsqueda agresiva de crecimiento que tienen los formuladores de las políticas económicas, sobretodo en esta época donde el crecimiento se ha vuelto más escurridizo. El examen final tendrá preguntas sobre lo discutido en este módulo y en cada uno de los anteriores, así que puede utilizar los exámenes anteriores para prepararlo. ¡Mucho éxito para completar el curso! Ha sido un placer contar con su participación en este curso. Saludos cordiales.\n                                    ", 
    "end_date": "2015-11-13T00:00:00Z", 
    "title": "Analizando las Políticas Económicas", 
    "price": 0, 
    "instructors": "Gayle Allard", 
    "institution_name": [
        "IE Business School"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/analizando-politicas-economicas", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-10-02T00:00:00Z"
}