{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Público-Alvo\nInteressados em geral.\n \nObjetivo do Curso\nO curso visa introduzir os quatro pilares do Capitalismo Consciente, uma proposta de aperfeiçoamento do principal sistema econômico vigente que orienta cidadãos e organizações para uma dinâmica mais responsável, considerando o desenvolvimento econômico e o bem estar social de longo prazo.\n\nObjetivos de Aprendizagem\nAo final do curso o aluno será capaz de:\n•\tExplicar o que é Capitalismo Consciente e como ele visa atender às demandas atuais da sociedade.\n•\tExplicar com exemplos brasileiros e internacionais cada um dos pilares que norteiam o Capitalismo Consciente.\n\nDedicação e Carga-Horária\nUm módulo por semana, com cerca de 2h por módulo, totalizando seis semanas de duração e aproximadamente 12h de carga-horária.\n\nAssista ao vídeo de divulgação do curso: https://youtu.be/nOGNlAMFxdo\n\n                                            Syllabus\n                        Introdução ao Capitalismo ConscienteOlá! Seja bem-vindo ao curso de Capitalismo Consciente! Neste primeiro módulo, você verá qual a dinâmica proposta para o curso e começará a construir uma ideia do que vem a ser Capitalismo Consciente. Bons estudos!Propósito ElevadoPor meio do exemplo da Rede Asta, você verá o que é o Propósito Elevado, um dos pilares do Capitalismo Consciente.Liderança ConscientePor meio do exemplo do Whole Foods, você verá o que é o Liderança Consciente, um dos pilares do Capitalismo Consciente.Cultura ConscientePor meio do exemplo do Whole Foods, você verá o que é o Cultura Consciente, um dos pilares do Capitalismo Consciente.\nOrientação para StakeholdersPor meio do exemplo do projeto VerBem, você verá o que é Orientação para Stakeholders, um dos pilares do Capitalismo Consciente.Capitalismo Consciente: uma JornadaEstamos chegando ao final do curso! Agora que você já viu o que são os quatro pilares do Capitalismo Consciente, discutiremos quais são os principais desafios para colocá-lo em prática.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Capitalismo Consciente", 
    "price": 0, 
    "instructors": "Priscila Claro", 
    "institution_name": [
        "Insper"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/capitalismo-consciente", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}