{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Ce cours présentera, en 6 semaines, l’organisation générale du système de sécurité sociale français et les grands enjeux auxquels il est aujourd’hui confronté.Chaque semaine un sujet de sécurité sociale sera abordé, de façon descriptive, mais surtout à travers les grandes questions qui se posent aujourd'hui. L’objectif est de permettre aux apprenants de pouvoir mieux comprendre ces questions d’actualité, que les médias simplifient quelquefois à l’extrême.\n\n                                            Syllabus\n                        Semaine 1 : Fondements historiques, organisation générale et gouvernance de la sécurité sociale.Semaine 2 : Politiques familiales, politiques sociales. Vie privée/vie professionnelle, cadre de vie et politique du logement, précarité, handicap. Quelle légitimité pour les pouvoirs publics à intervenir dans tous ces domaines ?Semaine 3 : L’assurance maladie, coordinations des nombreux acteurs, a t-elle un impact sur la santé des français ? Peut-on maitriser les dépenses ?Semaine 4 : Les retraites. Pourquoi le système français est-il si compliqué et si souvent réformé ?Semaine 5 : Le financement. Comment le système est-il financé ? Quels rapports avec la croissance, la compétitivité ou l’emploi ?Semaine 6 : Perspectives. Nouveaux risques, nouveaux enjeux dans un cadre européen et mondial.\n                                    ", 
    "end_date": "2015-11-12T00:00:00Z", 
    "title": "Comprendre les enjeux de la protection sociale", 
    "price": 0, 
    "instructors": "Julien Damon and Benoit Bost", 
    "institution_name": [
        "Ecole Nationale Supérieure de Sécurité Sociale"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/en3s/77001/session01/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-10-01T00:00:00Z"
}