{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    This course is designed as an eight-week introduction to the study of economics. Participants will be exposed to the economic way of thinking and learn about the functioning of a modern market economy. The early part of the course focuses on microeconomic analysis including the behavior of consumers and firms. We analyze markets for goods and services and policy choices that affect these markets. The later part of the course moves on to macroeconomic concepts such as national production, employment, inflation and interest rates. We explore models that determine long-run growth and short-term fluctuations in national economies. We then discuss the role of government regulation, monetary policy, and fiscal policy.\n\n                                            Syllabus\n                        Part 1The Basic CoreGetting StartedObserving and Explaining the EconomyThe Supply and Demand ModelUsing the Supply and Demand Model\r\nPart 2The Competitive Equilibrium ModelDeriving DemandDeriving SupplyMarket Equilibrium and EfficiencyFirms and Industries Changing Over TimeCost and Changes at Firms Over TimeThe Rise and Fall of Industries\r\nPart 3Deviations from CompetitionMonopoly and Market PowerBetween Monopoly and CompetitionAntitrust Policy and Regulation\r\nPart 4Labor MarketsThe Labor Supply and Demand ModelLabor Model Cont. – Min. Wage and DiscriminationKey Economic Policy IssuesTaxes, Transfers and Income DistributionPublic Goods and ExternalitiesGovernment Failure and Success\r\nPart 5Financial and Capital MarketsMarkets for Physical CapitalFinancial Markets: Risk and ReturnMacro Facts and MeasuresGetting Started with Macroeconomic IdeasMeasuring Production, Income and Spending of Nations\r\nPart 6Long Run MacroDetermining Consumption, Investment and Govt. SharesEmployment and UnemploymentProductivity, Econ. Growth and Determining FactorsA Look at Money, Inflation and the Fed\r\nPart 7Short Run MacroIntroduction to Economic FluctuationsEconomic Fluctuations ModelUsing the ADIA Model\r\nPart 8Macro Policy IssuesIntro to Macroeconomic PolicyFiscal PolicyMonetary PolicyMonetary Policy AnalysisInternational Economic IssuesGains from TradeInternational Trade Policy – Tariffs and Quotas\n                                    ", 
    "end_date": "2015-09-02T00:00:00Z", 
    "title": "Econ-1: Principles of Economics", 
    "price": 0, 
    "instructors": "John Taylor", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://lagunita.stanford.edu/courses/HumanitiesSciences/Econ_1/Summer2015/about", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Stanford OpenEdx"
    ], 
    "start_date": "2015-06-24T00:00:00Z"
}