{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Qu'est-ce qui détermine les prix fonciers et les prix immobiliers en général? Comprenez les liens de ces prix avec les taux d'intérêt, les rentes foncières et les loyers. Un cours d'économie pour les personnes qui n'ont aucune connaissance formelle d'économie.\n\nUn cours d'économie qui ne présuppose aucune connaissance économique formelle. Il vise à donner l'intuition du fonctionnement des marchés foncier et immobilier, en lien avec le marché du logement et les politiques publiques pertinentes. Il introduit les principales méthodes de calcul des valeurs foncières et immobilières. Le cours est illustré d'exemples et de statistiques principalement suisses.\n\nNous aborderons:\n•\tLes calculs d'arbitrage\n•\tLa rente foncière et le prix du sol\n•\tLa demande de terrain et le compte à rebours du promoteur\n•\tLe calcul des valeurs immobilières\n\n                                            Syllabus\n                        AccueilInformations sur le contenu du cours, son organisation et le travail attendu des participant-e-sModule 1 - Premiers conceptsL'objectif de cette première semaine est mettre en place les concepts économiques qui nous seront utiles tout au long du cours, un par leçonModule 2 - Plus-value et anticipationsL'objectif de cette deuxième semaine est mettre en place de nouveaux concepts économiques et surtout financiers nécessaires pour le coursModule 3 - Autres points de vue et confrontationNous continuons à apprendre des concepts économiques qui nous aident à comprendre la formation des prix fonciers, en introduisant de nouveaux acteurs: le vendeur et l'usagerModule 4 - Financement et calculs financiersL'objectif de cette quatrième semaine est d'aborder le financement immobilier et les calculs financiers inter-temporels; elle va permettre de mettre en place une nouvelle série de concepts économiques et financiersModule 5 - Calculs intertemporelsPour se donner les moyens de faire des calculs financiers portant sur plusieurs années, alors que jusqu'ici l'arbitrage ne portait que sur une seule annéeModule 6 - Évaluation immobilièreNous allons passer en revue les principales méthodes utilisées dans la pratique professionnelle pour évaluer les biens immobiliersConclusion de la première partie du cours\n                                    ", 
    "end_date": "2016-03-30T00:00:00Z", 
    "title": "Economie du sol et de l'immobilier I", 
    "price": 0, 
    "instructors": "Philippe Thalmann", 
    "institution_name": [
        "École Polytechnique Fédérale de Lausanne"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/economie-sol-immobilier-1", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-02-17T00:00:00Z"
}