{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    If you really care about the big questions in the economies and societies of the 21st century, such as distributive justice - namely, inequality of income or wealth, and its correlation with economic growth - this course is meant for you. The knowledge you will gain can truly change your outlook on our world.\n\n\"Economic Growth and Distributive Justice -  Maximizing Social Wellbeing\" is the second part of a two part course and it includes the following five lectures: \n(1) The excess burden of taxation\n(2) Tax incidence: who bears the economic burden of tax?\n(3) Progressivity: definition and ways to achieve\n(4) Low Income, Low Ability and the Optimal Income Tax Model\n(5) Designing the Tax and Transfer System that Maximizes Social Wellbeing\nIf you haven't done that already, we strongly recommend that you register for the first part of the course: \"Economic Growth and Distributive Justice - the Role of the State\". Taking both parts of the course would enable you to obtain a fuller and more comprehensive knowledge about Economic Growth and Distributed Justice.\n\nThe course is founded upon the elemental idea that the role of the state is to maximize the well-being - or simply the happiness - of its residents. In 9 fascinating, edifying lessons, using only simple words and decoding professional terminologies that sometimes baffle the intelligent layman, the course expounds many truths – both intuitive and unintuitive. Often using examples from the US and Europe, it does not however focus on policies in any particular region of the world, and is directly applicable to all countries around the globe.\n\nThe course touches upon the essence of important concepts like efficiency and equity, inequality and poverty, gross domestic product, tax evasion and tax planning; it presents the work of Nobel Laureate James Mirrlees and his followers - promoting a coherent system that integrates tax and government expenditures to maximize social welfare; and illuminates a range of high-profile issues from their economic angle:\n• Climate change: the atmosphere and oceans as public goods, and how smart (Pigovian) taxation can be used to combat the rapidly increasing threats to our planet;\n• Technology as the engine of economic growth;\n• Taxing the rich: How can we mitigate the growing inequality problem? Should we   impose a global tax on capital?\n\nThe curriculum includes interviews with major figures in the fields of law and of economics:  Harvard's Elhanan Helpman, Dan Shaviro from NYU and Richard Epstein from the University of Chicago and NYU.\n\nAfter successfully completing this course, you can expect to be able to:\n• better understand economic issues presented in the media\n• form an informed opinion on the strengths and weaknesses of presented social economic policies\n• define and measure inequality and poverty\n• define the connection between inequality (income, wealth) and economic growth\n• explain the foundations of economic growth\n• design a tax and transfer system to maximize the happiness of individuals\n\nAll these will allow you to better understand the policies being developed around you, and to play a larger, more informed role in their development, as a conscientious citizen.\n\n                                            Syllabus\n                        The Excess Burden of TaxationDear students, \nThe first half of the course is behind us, and there's one more half to go. We hope you are enjoying yourselves! In the previous class, we focused on the equity side of the equity-efficiency tradeoff, learning how to measure inequality and poverty. In this class, we will move on to talk about measuring efficiency. We will study the principles of SOCIAL EFFICIENCY, guided by the logic of trade, profitable transactions and the influence of TAXATION. Using everyday examples (have you ever babysitted?!), we will investigate the concept of EXCESS BURDEN, how and why taxes reduce social efficiency, and how this can be measured. \n\nSo let's begin week 5! \nBest, Economic Growth and Distributive Justice teamTax Incidence: Who Bears the Economic Burden of a Tax? Dear students, \nThis week we will learn how market forces determine who bears the economic burden of a tax. We will follow various classic examples and see how this happens - often in an unintuitive manner, which may be contrary to the legislator’s intention. \n\nBest, \nEconomic Growth and Distributive Justice teamProgressivity: Definition and Ways to AchieveDear students, \nThis week's lecture is all about progressivity. We will learn about the difference between MARGINAL and EFFECTIVE tax rates, how progressivity can be achieved, and how the transfer side of the system (e.g. welfare benefits) can create steep marginal tax rates, in addition to those generated by the tax side of the system. In the second part of the lesson we will begin studying the OPTIMAL INCOME TAX MODEL, in our search for the tax and transfer system that would maximize social wellbeing.  \n\nBest, \nEconomic Growth and Distributive Justice teamLow Income, Low Ability and the Optimal Income Tax ModelDear students, This week's lecture will continue our discussion about progressivity. In this second part of the lesson we will begin studying the OPTIMAL INCOME TAX MODEL, in our search for the tax and transfer system that would maximize social wellbeing.  Best, Economic Growth and Distributive Justice teamDesigning the Tax and Transfer System that Maximizes Social WellbeingDear students, \nTime goes by, as always, and here we are, in our last week of the course 'Economic Growth and Distributive Justice'. We hope that by now you have all acquired sufficient knowledge and understanding in the various issues taught by Prof. Margalioth, enabling you to  better analyze the social-economic reality in which you live, and form your own educated views and preferences regarding these issues. The last week of the course will be devoted to the OPTIMAL MODEL OF THE TAX &amp; TRANSFER SYSTEM. Combining all materials taught in the course and applying them together, Prof. Margalioth will present to you what he believes to be the best possible model, through which a government can achieve both Economic Growth and Distributive Justice. Will you agree to adopt it as well? Perhaps you have some other interesting ideas? We will be more than happy to discuss them. Thank you for taking our course. It was our pure delight to have you as our students! \n\nSo let's begin week 8! \n\nBest, \nEconomic Growth and Distributive Justice team\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Economic Growth and Distributive Justice Part II - Maximize Social Wellbeing", 
    "price": 0, 
    "instructors": "Professor Yoram  Y. Margalioth", 
    "institution_name": [
        "Tel Aviv University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/economic-growth-part-2", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}