{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/histcontabilidade\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/histcontabilidade-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    histcontabilidade-001\n                                                                    histcontabilidade-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    O curso é desenhado para auxiliar estudantes com pouco ou nenhum conhecimento em História da Contabilidade e que tenham interesse em aprender sobre momentos importantes e cruciais na História da Contabilidade e seu papel na sociedade. O curso também é destinado a professores de Contabilidade Introdutória que desejem complementar o currículo inicial de seus estudantes com este conteúdo.Ao desenvolver uma visão crítica sobre a relação entre a contabilidade e a sociedade através do tempo, os estudantes serão estimulados a exercitar habilidades cognitivas de compreensão de fatos históricos relacionados à área contábil, e de análise das práticas atuais à luz de acontecimentos passados. Também serão encorajados a avaliar criticamente convenções contábeis atuais. \n\n                                            Syllabus\n                        SEMANA 1: “Introdução à História da Contabilidade”Na sessão inicial participantes serão apoiados para construção de contexto com a ambientação na Mesopotâmia (características, contribuição e contabilidade). Discussão sobre práticas administrativas em Uruk (3500 a 2900 a.C.) será estabelecida pelo Prof. Grof (convidado). Aspectos de troca, estoque e empréstimo serão objeto de reflexão. Por fim, participantes serão convidados a jogar a primeira fase do DEBORAH Game, atuando como um escriba na Mesopotâmia. Na segunda parte desta sessão, os estudantes serão levados à reflexão sobre os sete elementos apontados por Littleton como antecedentes das partidas dobradas. Ainda nesta sessão, teremos a participação especial do Prof. Schmidt (autor de tese pioneira sobre História da Contabilidade aqui no Brasil). Haverá indicação de leituras opcionais para a complementação dos estudos.SEMANA 2: “Sistema de Contabilização por Carga e Descarga”Na sessão, será apresentado o método de Carga e Descarga, pouco conhecido entre os próprios contadores. As professoras Rodrigues e Gomes (Universidade do Minho - Portugal) farão participação especial compartilhando seus conhecimentos a respeito do tema, notadamente o sistema, suas características e regiões em que foi utilizado. Participantes serão convidados a jogar outro míni-jogo do DEBORAH Game, com base em contabilidade por Carga e Descarga, que se passa em um monastério feminino português do final do século XVIII e início do XIX. O Professor Oliveira (Universidade do Porto - Portugal) participará como convidado destacando aspectos da ligação histórica entre Contabilidade e Religião. Exemplos serão apresentados sobre este método. Materiais de apoio e leitura serão indicados para complementar estudos.SEMANA 3: “As Partidas Dobradas (Pré-Pacioli)”Na terceira sessão, sistemas alternativos às partidas dobradas serão discutidos. Aspectos sobre o desenvolvimento das partidas dobradas na Roma Antiga e no Antigo Egito serão expostos. Também será abordado o seu desenvolvimento em outras regiões, como Itália no período renascentista, China, além de comentários sobre a Índia. Reflexão sobre os Templários será feita. Tendo por base o artigo de Littleton (1927) – The antecedents of double-entry – serão retomados os sete elementos necessários para o surgimento das partidas dobradas. Participantes irão jogar o míni-jogo do DEBORAH Game ambientado em Florença do século XIV, em que o objetivo do jogador é explorar o cenário da época tentando localizar os sete elementos mencionados no texto de Littleton. Será abordado desenvolvimento da contabilidade nas cidades italianas de Milão, Gênova e Florença, assim como referência a Luca Pacioli e a Summa de Arithmetica, Geometria, Proportioni et Propornalità. Materiais de apoio e leitura serão indicados para complementar os estudos.SEMANA 4: “Luca Pacioli e a Summa de Arithmetica, Geometria, Proportioni et Propornalità”Na quarta sessão do curso, atenção será dada a Luca Pacioli e a Summa de Arithmetica, Geometria, Proportioni et Propornalità. Será estabelecida reflexão sobre como o registro da descrição do sistema contábil por partidas dobradas em um livro possibilitou a padronização de um modelo passível de ser reproduzido em vários países, colaborando para sua adoção por toda a Europa, até o século XIX. Será apresentado também tópico sobre as escolas de comércio em Portugal pela Prof.ª Rodrigues (Universidade do Minho - Portugal). A Professora Vasconcelos (Doutoranda - FEA-USP) irá compartilhar o caso das Companhias Pombalinas e seu papel na disseminação das partidas dobradas no Brasil. Materiais de apoio e leitura serão indicados para complementar estudos.SEMANA 5: “Contabilidade Contemporânea”A quinta sessão versará sobre a Contabilidade no mundo contemporâneo. Reflexões sobre a evolução do papel da contabilidade na sociedade, com ênfase para informação contábil, decisões, regulação, auditoria, riscos e consequências desejadas e indesejadas do estágio atual de desenvolvimento. Será disponibilizada aos participantes o míni-jogo do DEBORAH Game que aborda o papel do contador na sociedade, ambientado na Austrália, e desenvolvido com base no artigo de Hines (1988) – Financial accounting: In communicating reality, we construct reality. Materiais de apoio e leitura serão indicados para complementar estudos.\n                                    ", 
    "end_date": "2015-11-19T00:00:00Z", 
    "title": "História da Contabilidade", 
    "price": 0, 
    "instructors": "Alan Sangster and Edgard Cornacchione", 
    "institution_name": [
        "Universidade de São Paulo"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/course/histcontabilidade", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-10-15T00:00:00Z"
}