{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    ***Este curso será impartido en español***\n\nEn las próximas décadas, las pensiones se convertirán en uno de los ejes centrales de las políticas económicas y sociales en América Latina y el Caribe (ALC).\n\n¿La razón? En 2050 habrá en la región el triple de adultos mayores que ahora, con una mayor esperanza de vida y, por lo tanto mayores necesidades de atención.\n\nEsos adultos mayores del futuro están hoy en un mercado de trabajo donde sólo 4 de cada 10 trabajadores contribuyen a un sistema de pensiones. Esto significa que en la actualidad 130 millones de personas están trabajando sin ahorrar para su pensión en ALC.\n\nEn ausencia de reformas, incluso con un crecimiento sostenido en la región, 1 de cada 2 jubilados no tendrá una pensión o esta no será adecuada, dejando entre 66 y 83 millones de adultos mayores dependiendo de las familias o del Estado para su manutención, lo que será económica, fiscal y socialmente insostenible.\n\nPor otra parte, aquellos sistemas que prometen beneficios más generosos tienen baja cobertura y eventuales problemas de equidad y sustentabilidad. Lo que genera un importante desafío, ya que el aumentar la cobertura bajo el mismo diseño puede mejorar la situación financiera en el corto plazo, pero acrecentar los problemas de sustentabilidad en el largo plazo.\n\nEn este curso comprenderemos las complejidades que afronta el mercado de trabajo en ALC y, por ende, su sistema de pensiones. Vamos a esclarecer las políticas que se pueden formular en los diferentes contextos de la Región que podrían llevar a un funcionamiento de sistemas de pensiones más eficientes, financieramente sostenibles y equitativos y así ofrecer “mejores pensiones” a todos los adultos mayores, no solo a unos pocos.\n\nLa preparación de este curso fue financiada por el Programa Especial para el Desarrollo Institucional (SPID) del Banco Interamericano de Desarrollo. Mayor información en la página web del SPID.\n\n                                    ", 
    "end_date": "2016-08-23T00:00:00Z", 
    "title": "IDB2x: Pensiones en América Latina y el Caribe", 
    "price": 0, 
    "instructors": "Mariano Bosch, Ángel Melguizo and Carmen Pagés-Serra", 
    "institution_name": [
        "Inter-American Development Bank"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/pensiones-en-america-latina-y-el-caribe-idbx-idb2x", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-07-12T00:00:00Z"
}