{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    ¿Sabías que hay más de 270 acuerdos comerciales en el mundo que cubren la mitad del comercio mundial? Los países de América Latina y el Caribe participan en 70 tratados que cubren el 70% del comercio intrarregional.\n\n¿Qué necesitas saber sobre estos acuerdos? ¿Qué oportunidades, desafíos e implicaciones tienen para las personas, empresas y gobiernos? ¿Qué puedes hacer para aprovecharlos al máximo?\n\nEn este curso analizarás en profundidad las disposiciones de los acuerdos comerciales regionales y multilaterales y por qué los países de América Latina enfrentan aún importantes obstáculos para aprovecharlos plenamente. Aprenderás de la mano de destacados académicos, investigadores, responsables y gestores de política comercial sobre nuevas tendencias, temas emergentes, dinámicas y posibles escenarios futuros.\n\nEste curso va dirigido a todos los interesados en el comercio y la integración en América Latina y el Caribe y en conocer los aspectos prácticos y más candentes de cómo funcionan los tratados comerciales y cómo aprovecharlos mejor.\n\n \n\n                                    ", 
    "end_date": "2016-05-31T00:00:00Z", 
    "title": "IDB5x: Nuevas Tendencias en los Tratados Comerciales en América Latina", 
    "price": 0, 
    "instructors": "Antoni Estevadeordal , Joaquim Tres , Matthew Shearer, Juan S. Blyde, Sergio Diaz-Granados, Pablo Garcia, Jeremy Harris, Mauricio Mesquita Moreira , Mario Umaña, Bernard Hoekman, Gustavo Idígoras, Fernando Ocampo, Antonio Ortiz-Mena, Miguel Rodríguez Mendoza, Mario Sánchez Moreno, Kati Suominen and Carmen Gisela Vergara", 
    "institution_name": [
        "IDB ( Inter-American Development Bank )"
    ], 
    "commitment": "8-10 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/nuevas-tendencias-en-los-tratados-idbx-idb5x", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-04-19T00:00:00Z"
}