{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Las economías latinoamericanas han padecido en forma generalizada la falta de crecimiento e inestabilidad. Ha habido numerosos episodios de recesiones profundas, crisis bancarias, inflación desbordada y escasez de divisas. Todos estos factores afectan la calidad de vida en América Latina. En realidad, sólo con mayores niveles de crecimiento sostenido a través del tiempo, es posible pensar que América Latina supere la pobreza y mejore el nivel de vida de la región.\n\nEste curso analiza los principales desafíos que la región enfrenta en cuanto a su crecimiento económico y estabilidad macro-económica. Los contenidos serán presentados en un lenguaje simple y comprensible para todos aquellos participantes que no son especialistas en el área temática.\n\nEste curso pretende abordar las siguientes preguntas:\n\n\n\t¿Cuáles son los desafíos que enfrentan los países en América Latina y el Caribe para incrementar sus niveles de inversión privada? \n\t¿Por qué la productividad en la región es más baja comparada con la de otras regiones?\n\t¿Cuáles son los principales desafíos que enfrenta la infraestructura, sea ésta la relacionada con agua y saneamiento básico, el transporte o la energía, para mencionar algunos sectores?\n\t¿Por qué los recursos naturales, que abundan en la región, no siempre han dado los resultados esperados para propiciar el desarrollo regional?\n\t¿Cómo se originan la inestabilidad económica y las crisis macro-económicas?\n\n\n¿Cuál es el rol de las políticas monetarias, cambiarias y financieras para alcanzar estabilidad macro-económica?\n\nLa preparación de este curso fue financiada por el Programa Especial para el Desarrollo Institucional (SPID) del Banco Interamericano de Desarrollo. Mayor información en la página web del SPID.\n\n \n\n*Note - This is an Archived course*\n\nLatin American economies have suffered from a lack of growth and instability. There have been major recessions, bank crises, excessive inflation, and currency shortages. All of these factors affect the quality of life in Latin America. In reality, only with higher levels of economic growth sustained over time will it be possible for Latin America to overcome poverty and improve the region’s quality of life.\n\nThis course analyzes the main challenges the region faces regarding economic growth and macroeconomic stability in simple and understandable language for those who are not specialists in the subject area.\n\nThis course aims to address the following questions:\n\n\n\tWhat challenges do Latin American countries face in reaching increased private investment? \n\tWhy is the region's productivity lower than other regions?\n\tWhat are the main infrastructural challenges related to water and basic sanitation, transportation, energy, and other sectors?\n\tWhy haven't the natural resources, abundant in the region, always provided the expected results to contribute to regional development?\n\tHow did the region’s economic instability and macroeconomic crises originate?\n\n\nWhat is the role of monetary, exchange rate, and financial policies in achieving macroeconomic stability?\n\nThe preparation of this course was financed by the Special Program for Institutional Development (SPID) of the Inter-American Development Bank. For more information visit the SPID website. \n\n\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\n                                    ", 
    "end_date": "2015-08-04T00:00:00Z", 
    "title": "IDB9x: Realidad Macroeconómica Latinoamericana | The Macroeconomic Reality of Latin America", 
    "price": 0, 
    "instructors": "Eduardo Fernández-Arias", 
    "institution_name": [
        "IDB ( Inter-American Development Bank )"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/realidad-macroeconomica-latinoamericana-idbx-idb9x", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-06-23T00:00:00Z"
}