{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    With real incomes falling and personal debt at a record high, there has never been a better time to improve your personal financial skills – Managing My Money aims to do just that.\n\nThis free online course starts by giving you practical guidance on how to compile a budget and use it to make good decisions about your spending. You’ll explore debts and investments, and find out how mortgages are used to finance home ownership. The critical issue of pension planning is explained, with guidance on different pension products.\n\nThe course concludes by examining different types of insurance and offers practical advice on how to make rational decisions about which insurance products to buy.\n\nUsing up-to-the minute data from the UK, you’ll develop financial skills and approaches that are relevant globally. The course is rich in high-quality text, images, video, audio and interactive elements to support your learning.\n\nYou can use the hashtag #FLMyMoney16 to join and contribute to Twitter conversations about this course. And you can get a taste of some of the advice this course offers in Martin Upton’s blog post: 10 Christmas spending tips: how to avoid a financial hangover in the New Year.\n\nThis course is presented on FutureLearn with the kind support of True Potential LLP.\n\nThe True Potential Centre for the Public Understanding of Finance (True Potential PUFin)\n\nThe True Potential Centre for the Public Understanding of Finance (True Potential PUFin) is a pioneering Centre of Excellence for research in the development of personal financial capabilities, based at The Open University Business School. The establishment and activities of True Potential PUFin have been made possible thanks to the generous support of True Potential LLP, which has committed to a five-year programme of financial support for the Centre totalling £1.4 million.\n\n\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Managing My Money", 
    "price": 0, 
    "instructors": "Martin Upton", 
    "institution_name": [
        "The Open University"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/managing-my-money?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}