{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Perfect markets achieve efficiency: maximizing total surplus generated. But real markets are imperfect. In this course we will explore a set of market imperfections to understand why they fail and to explore possible remedies including as antitrust policy, regulation, government intervention. Examples are taken from everyday life, from goods and services that we all purchase and use. We will apply the theory to current events and policy debates through weekly exercises. These will empower you to be an educated, critical thinker who can understand, analyze and evaluate market outcomes.\n\n                                            Syllabus\n                        Costs and Profits + Perfect CompetitionIn the first part of the course we learnt that if we allow market forces to work we reach an efficient outcome: the maximum benefit that can be generated by a market. The second part of the course explores cases where the markets fail to accomplish our goals. This week sets up the benchmark case of the perfectly competitive market: a model we will modify in the next few weeks. We define Perfect Competition, learn to model it graphically and discuss some key results in terms of long run profits and implications for efficiency.MonopolyA monopoly is a case where there is only one firm in the market. We will define and model this case and explain why market power is good for the firm, bad for consumers. We will also show that society as a whole suffers from the lack of competition.Monopoly ContinuedMonopolies come in various types: one price monopoly, natural monopoly, price discrimination and monopolistic competition. This week we will expand the basic monopoly model to cover these cases and then explore market outcomes in each case. We will also discuss how government may intervene in such cases to benefit society as a whole and increase the surplus generated by the market.Externalities + Public GoodsTwo classic cases of market failure will be defined and explored: externalities and public goods. We will define each case, demonstrate why the market fails to provide the efficient outcome and suggest interventions through either marked design or regulation.Asymetric Information and InequlityUp to this point we assumed that there is full information in the market. We are now ready to relax this assumption as we introduce the concepts of moral hazard and adverse selection. We learn that asymmetric information may lead to market failure and we discuss some remedies. The last segment in the course is a reminder that besides efficiency, equity is also a criteria we all care about. A short introduction will explore how economist measure poverty and inequality.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Microeconomics: When Markets Fail", 
    "price": 0, 
    "instructors": "Rebecca Stein", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/microeconomics-part2", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}