{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    We make economics decisions every day: what to buy, whether to work or play, what to study. We respond to markets all the time: prices influence our decisions, markets signal where to put effort, they direct firms to produce certain goods over others. Economics is all around us. \n\nThis course is an introduction to the microeconomic theory of markets: why we have them, how they work, what they accomplish. We will start with the concept of scarcity and how specialization according to comparative advantage helps us achieve more than we could alone. Next we model a marked using the tools of Supply and Demand and learn what well working markets accomplish and what their limit are. We end by exploring the impact of government intervention on perfect markets. Examples are taken from everyday life, from goods and services that we all purchase and use. We will apply the theory to current events and policy debates through weekly exercises. These will empower you to be an educated, critical thinker who can understand, analyze and evaluate market outcomes.\n\n                                            Syllabus\n                        The Concept of ScarcityWhere do markets come from? We will start with understanding the constraint of scarcity that we face and the concept of opportunity cost that reflects the true cost of any decision we make. We will learn to model scarcity using the Production Possibilities Frontier that allows us to visualize tradeoffs, distinguish between efficient, inefficient and unattainable points. We will also discuss how economic growth affects our options and allows us to achieve the previously unattainable.Specialization &amp; TradeTrade allows us to achieve the unattainable- we can consume more than we can produce on our own. We will introduce the concept of Comparative Advantage and discuss how gains from specialization allow us to use our resources efficiently. We will apply these concepts to a simple model of trade, showing that now the Consumption Possibilities Frontier allows points outside the Production Possibilities Frontier.Supply and DemandWe will introduce the central model of Supply &amp; Demand. This will allow you to communicate with other economists and finally understand those business pages and market updates. We will distinguish between a movement along and a movement of the supply &amp; demand curves. We will define market equilibrium as understand that at an equilibrium price there is neither excess demand nor excess supply. We will end by a few scenarios where exogenous changes affect supply and/or demand and analyze the impact on equilibrium price and quantity.Understanding Markets: Elasticities, Market Surplus, Efficiency, and EquityThere is a lot of terminology this week. We will introduce of the concept of elasticity of demand that measures the responsiveness of quantity demanded to a change in the price of a good. We will explore the relationship between change in price and revenue or sales and how elasticities can help us predict whether a decrease in price will increase or decrease revenue. We then introduce other elasticities of note: cross price elasticity, income elasticity and elasticity of supply.  We end the week by exploring the great accomplishment of markets: maximizing the size of the pie or the total benefit to society. When Government IntervenesIn week four we learnt that the markets maximize the surplus that can be generated. So what happens if the government steps in and intervenes in the market? This week we will analyze price floors and ceilings, taxes and subsidies and learn how the best intentions sometimes lead to very unfortunate results.\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Microeconomics: The Power of Markets", 
    "price": 0, 
    "instructors": "Rebecca Stein", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "5-8 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/microeconomics-part1", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}