{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Quel est l’état de santé de l’économie ? Comment la politique économique peut-elle rétablir ou contribuer à la bonne santé d’un pays ? Ces questions sont au cœur de la programmation financière. Nos cours de PPF (Programmation et politiques financières) vous permettront d’acquérir les bases nécessaires pour y répondre.\n \nLa programmation financière est un cadre qui permet d’analyser l’état actuel de l’économie, de prévoir la direction qu’elle prend, et de déterminer les politiques économiques qui peuvent en changer le cours.\n \nLa première partie du cours de PPF, présentée par l’Institut du FMI pour le développement des capacités, vous permettra d’acquérir les compétences de base indispensables pour mener à bien la programmation financière. Dans ce cours, vous découvrirez les principales caractéristiques des quatre grands secteurs macroéconomiques (réel, financier, extérieur et monétaire), vous apprendrez comment lire, interpréter et analyser les comptes de chacun d’eux, et vous comprendrez à quel point ils sont interdépendants.\n(La deuxième partie du cours de PPF portera sur la formulation de projections de base et l’élaboration d’un programme d’ajustement.)\n \nAu long de ce cours, les économistes du FMI vous guideront dans les comptes et dans l’analyse d’une économie. En outre du suivi de conférences sous forme de vidéos, vous serez appelés à répondre à des questions sur les concepts expliqués, à résoudre de brefs exercices pratiques, à réfléchir avec les autres participants sur l’évolution économique de votre pays, et à travailler sur les données d’un pays imaginaire. Les dossiers de lecture vous seront fournis.\n \nQue vous soyez un cadre de la fonction publique chargé de dossiers économiques pour votre pays ou que votre travail repose sur l’exploitation de données économiques, ou tout simplement si vous souhaitez mieux comprendre l’évolution économique d’un pays, ce cours vous apportera une formation pratique en analyse macroéconomique, et nous attendons avec intérêt votre participation à ce fascinant apprentissage!\n \nLa première partie du cours de Programmation et politiques financières est proposée par le FMI avec le concours financier du gouvernement de Belgique.\n\n                                    ", 
    "end_date": "2016-10-26T00:00:00Z", 
    "title": "PPF.1x: Programmation et Politiques Financières, Première Partie: Analyse des Comptes Macroéconomiques", 
    "price": 0, 
    "instructors": "Eric Verreydt and Antonio David", 
    "institution_name": [
        "International Monetary Fund"
    ], 
    "commitment": "8-10 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/programmation-et-politiques-financieres-imfx-ppf-1x-0", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-09-14T00:00:00Z"
}