{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Learn how to model social and economic networks and their impact on human behavior.  How do networks form, why do they exhibit certain patterns, and how does their structure impact diffusion, learning, and other behaviors?   We will bring together models and techniques from economics, sociology, math, physics, statistics and computer science to answer these questions.\n\nThe course begins with some empirical background on social and economic networks, and an overview of concepts used to describe and measure networks. Next, we will cover a set of models of how networks form, including random network models as well as strategic formation models, and some hybrids. We will then discuss a series of models of how networks impact behavior, including contagion, diffusion, learning, and peer influences.\n\nYou can find a more detailed syllabus here:  http://web.stanford.edu/~jacksonm/Networks-Online-Syllabus.pdf \n\nYou can find a short introductory videao here: http://web.stanford.edu/~jacksonm/Intro_Networks.mp4\n\n                                            Syllabus\n                        Introduction, Empirical Background and Definitions  Examples of Social Networks and their Impact, Definitions, Measures and Properties: Degrees, Diameters, Small Worlds, Weak and Strong Ties, Degree DistributionsBackground, Definitions, and Measures ContinuedHomophily, Dynamics, Centrality Measures: Degree, Betweenness, Closeness, Eigenvector, and Katz-Bonacich. Erdos and Renyi Random Networks: Thresholds and Phase TransitionsRandom NetworksPoisson Random Networks, Exponential Random Graph Models, Growing Random Networks, Preferential Attachment and Power Laws, Hybrid models of Network Formation.Strategic Network FormationGame Theoretic Modeling of Network Formation, The Connections Model, The Conflict between Incentives and Efficiency, Dynamics, Directed Networks, Hybrid Models of Choice and Chance.Diffusion on NetworksEmpirical Background, The Bass Model, Random Network Models of Contagion, The SIS model, Fitting a Simulated Model to Data.Learning on NetworksBayesian Learning on Networks, The DeGroot Model of Learning on a Network, Convergence of Beliefs, The Wisdom of Crowds, How Influence depends on Network Position..Games on NetworksNetwork Games, Peer Influences: Strategic Complements and Substitutes, the Relation between Network Structure and Behavior, A Linear Quadratic Game, Repeated Interactions and Network Structures.Final ExamThe description goes here\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "Social and Economic Networks:  Models and Analysis", 
    "price": 0, 
    "instructors": "Matthew O. Jackson", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "3-6 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/social-economic-networks", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}