{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    You will review the evolution of the Korean economy decade by decade since Korea’s independence from Japan in 1945. Major policies of each decade will be explained and their effect on the Korean economy will be analyzed. Also, the backgrounds and limitations of important policies will be scrutinized. By doing so, you will be able to compare the Korea experience with the other developing countries’. \n\n1.\tYou will be able to explain how the miracle of the Korean economic development was made possible. \n2.\tBy examining internal and external conditions behind the decision making of major policies in Korea, you will be able to draw lessons that can be applicable to today’s developing countries.\n3.\tYou can explain how the Korean economy has interacted with the global economy in the past.\n4.\tYou can observe how economic theories and models can be applied to the Korean case.\n\n                                            Syllabus\n                        Introduction: Preview and Overall EvaluationModule 1. Introduction I: This module introduces initial conditions of the Korean economy at the time of independence from Japan in 1945. Upon describing unfavorable initial conditions, it summarizes three major achievements of the Korean economic development after the Korean War (1950-1953).\nModule 2. Introduction II: In order to explain the determinant factors of the Korean economic success, this module provides two approaches. First, it introduces neoclassical growth model, and explains how each production factor has contributed to economic growth. Second, it introduces institutional approach, which emphasizes the role of the government. Also, it shows the strength and weakness of the Korean economy.1940s and 1950sModule 3. From independence to the War: After independence from Japan, the newly established Korean government has implemented two meaningful reforms; land reform and educational reform. Main contents and implications of these reforms are explained. This module also introduces economic impact of the Korean War.Module 4. Import Substitution Policy of the 50s: After the Korean War, the Korean government needed to stabilize the hyper-inflation from the mid-1950. Also, IS (import substitution) polices were employed to achieve industrialization and growth. This module introduces major policy tools of IS, and its results.Module 5. The Role of Economic Aid: This module introduces the size and role of economic aids on the Korean economy during the 1950s. It also compares Korea to the other developing countries in terms of aids policies. It also briefly introduces the history of ODA (official development assistance) in Korea.1960sModule 6. Export Promotion of the 60s: From the early 1960s, Korea has changed its development strategy from IS (import substitution) to EP (export promotion). This module introduces backgrounds, major policies, and results of EP policies. Also it compares the Korean experiences of EP to those of Japan. Module 7. Five Year Development Plan and Mobilization of Capital: This module explains how the Five Year Development Plans were launched from the early 1960s. Also, it introduces efforts of the Korean government to mobile capital inside and outside Korea during the 1960s.1970sModule 8. Heavy and Chemical Industrialization (HCI) of the 70s: From the early 1970s, Korea has aggressively pursued HCI (heavy and chemical industrialization) policies. This module explains backgrounds, major policies, and main results of HCI policies.Module 9. Side-effects of HCI and Oil Shocks: This module introduces some side-effects of aggressive HCI (heavy and chemical industrialization) policies. It explains how these side-effects are inter-related with each other. Also, it introduces impacts of oil shocks on the Korean economy during the 1970s, and explains how the Korean economy recovered from oil shocks.1980sModule 10. Crisis Management &amp; Structural Reform and Trade Liberalization of the 80s: The Korean economy was close to foreign exchange crisis in the early 1980s. This module explains how Korea could avoid the crisis and stabilize the economy by the mid-1980s. It also introduces structural reforms and trade liberalization reforms. Module 11. Three Lows &amp; Economic Boom of the 1980s: This module introduces favorable international environments called ‘three-lows’, which emerged from the mid-1980s. It introduces backgrounds of three-lows, and explains how these three-lows helped the Korean economy to enjoy the unprecedented economic boom. Also, it introduces how the democratization of the Korea society has influenced the economy.The early 1990sModule 12. The Early 1990s: In the early 1990s, the Korean economy has faced the end of high growth era. However, the Korean economy has failed to adapt itself to slower growth, and the problem of ‘high costs and low efficient’ economic structure emerged.1997 Asian Financial CrisisModule 13. 1997 Asian Financial Crisis I: In the end of 1997, the Korean economy fell into foreign exchange crisis and had to be bailed out by IMF (international monetary fund). This module explains the internal and external causes of the 1997 Asian Financial Crisis.\nModule 14. 1997 Asian Financial Crisis II: In order to recover from the 1997 Asian Financial Crisis, the Korean government and IMF implemented four major reforms in the area of financial sector, corporate sector, labor market, and government. This module introduces main contents of these reforms, and explains how they helped the Korean economy to recover from the crisis.\nModule 15. 1997 Asian Financial Crisis III: This module introduces some side-effects and controversial issues with respect to the 1997 Asian Financial Crisis. Also, it explains about implications of the 1997 crisis on the Korean economy.2008 Global Financial Crisis and BeyondModule 16. 2008 Global Financial Crisis &amp; Beyond: In September, 2008, the global economy fell into financial crisis after the collapse of Lehman Brothers. This module explains how the 2008 global financial crisis affected Korea, and also explains how Korea has recovered from it.\nModule 17. 2008 Global Financial Crisis &amp; Beyond: This module introduces implications of the 2008 global financial crisis on the Korean economy. Also, it shows the most recent picture of the Korean economy by introducing strength and weakness of the Korean economy.Final  Peer Review\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "The Korean Economic Development", 
    "price": 0, 
    "instructors": "Doo Won Lee", 
    "institution_name": [
        "Yonsei University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/korean-economy", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}