{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    What went wrong in Greece’s handling of its public debt? How does a city government like Detroit go from prosperity to bankruptcy? And how could the looting, theft and corruption in Malawi’s “cashgate” have been avoided?\n\nWe are all concerned about where “our” money goes. We all want good roads and schools, thriving industry, and personal and national security, but how can we be sure that public monies are being managed properly, and how can we hold those in charge to account?\n\nUnderstand and evaluate the management of public finances\n\nThis free online course will provide you with the knowledge and tools to understand and evaluate the management of financial resources across the public sector, wherever you are.\n\nDrawing on the expertise of the Centre for Financial and Management Studies at SOAS, University of London, we’ll look at:\nhow governments and public sector organisations obtain financial resources through taxation, fees, charges, natural resources and other means;\nhow public sector organisations decide to use financial resources for attaining public policy goals and implementing public programmes;\nhow public sector organisations report their financial performance to the public;\nhow the use of public financial resources is audited;\nand how governments are made accountable for their financial decisions.\n\nBy the end of the four-week course, you will be able to:\nunderstand the basics of public financial management;\nread simple public sector financial statements;\nexplain how governments raise finance through various means;\nexplain how the budget process works at national and sub-national levels;\nunderstand how auditing is conducted in public sector organisations;\nand understand how public sector organisations are held accountable to the public.\n\nYou can find out more about some of the issues this course covers in Alberto Asquer’s post for the FutureLearn blog: “Why the shock news of austerity in Saudi Arabia should raise questions for us all.”\n\n\n                                    ", 
    "end_date": "2016-02-22T00:00:00Z", 
    "title": "Understanding Public Financial Management: How Is Your Money Spent?", 
    "price": 0, 
    "instructors": "Alberto Asquer", 
    "institution_name": [
        "SOAS University of London"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/public-financial-management?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-01-25T00:00:00Z"
}