{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    The purpose of the course is to bring the basic knowledge on the specific aspects of Russian economy that had significant impact on the latest development trends in Russia.\nThis course will provide you with knowledge on: \n1)    the basics of economy;\n2)\tunderstanding the role of market reforms in developing the key features of modern Russian economy;\n3)\tunderstanding  specific aspects of Russian economy;\n4)\tcause-effect relationship of the most significant trends in Russia’s economic development;\n5)\tinstruments for analysis of Russian economy;\n6)\tbusiness climate in Russia and skills required for doing business in Russia.\nCurrently, different aspects of economy have some influence on us and our behavior - e.g. currency exchange rates, inflation and other things define the way in which we distribute our income between savings and investments. In order to understand these principles it is required to have the basic knowledge on economics. So it is not only a lecture on Russian economy. Another main objective of the course is to develop knowledge on the basics of economy as such. So the course will disclose universal patterns by analyzing trends in Russian economy.\nFAQ:\nQ: What is targeted audience for this course? What are the course prerequisites?\nA: The course is mainly developed for students pursuing their master’s degree in the field of international economy and for those who have professional interest in Russian economy. It requires basic knowledge of economic terms.\nQ: What are the minimum requirements to pass the course?\nA: In order to pass the course and receive a Course Certificate you will need to have at least 80% of correct answers in each quiz.\nWelcome to the course “Understanding Russian Economy. Problems of Transition”!\n\n                                            Syllabus\n                        Introduction to ‘a transition in Russia’ courseWelcome to the Week 1! This module will introduce you to the basics of the given course and to the general issues of transition in Russia. You will learn about economic features of Russia. Our video-lectures will answer the following question: how the transition was at all possible in Russia. Finally, the end of the module is accompanied with a test. Test questions are based on the information from the lectures, but for some of them you will have to find the right answer using different statistical and informational sources.Brief Russian economic historyWelcome to the Week 2! On this week you’ll learn how the transition was set up and organized. In this module we begin the analysis of the Russian economic policy. Understanding the specifics of transition process is crucial for understanding the roots and reasons of modern domestic issues of Russian Federation. That’s why we will make a thorough analysis of it.Pillars of market reformsWelcome to the Week 3! Today we continue to analyze initial measures within market reforms in Russia. The module will cover several topics like price liberalization including radical reform widely known as ‘’shock therapy’’ and real estate privatization. Then we will proceed to major controversies and paradoxes of transition. This module provides discussion on the ‘’New Russians’’.Lost opportunities of transitionWelcome to the Week 4! Now we are coming to the next period of the Russian economic transition, namely the period since 1993. As usual you will get useful knowledge through video-lectures. However don’t forget to look at the list of recommended literature in case you want to learn more about the topic of this week. Also you will have to pass a short quiz in order to be assessed as a result of the Week 4.Understanding the golden decade and the subsequent crisisWelcome to the Week 5! We continue to analyze Russian economy in transition. This week we pass on to an extremely interesting period of Russian economic history. We will look at the decade of steady growth, which can be called the golden decade for Russian economy. Economic crisis in 2008 in Russia will be the second important point of this week.Lessons of transition. Searching for solutionsWelcome to the Week 6! Now we will focus on some lessons of transition. To be more precise you will learn what role Stabilization Fund plays in Russian economy. ‘’To save or to borrow’’ dilemma and its solution in Russia will be discussed in this module as well. Then we are going to look at the impact of 2008 financial crisis on Russian economy.Fundamental challenges to the Russian economyWelcome to the Week 7! Special focus will be on difficulties which Russia has faced as a result of the transition. There is rather long list of current challenges to Russian economic development. These problems have different roots, which we will consider. Please finish with the weekly quiz, which will help you to refresh your knowledge and help us to assess them.Fundamental challenges to the Russian economy (follow up)Welcome to the Week 8! We continue to speak on major challenges of Russian economy. It is our final lecture on the domestic issues of Russian economy. So you will get some general conclusions over economic transition in Russia. We offer you to pass a test that differs a bit from the previous ones - it includes a few questions from the previous topics. Good luck with your further studies!\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "Understanding Russian Economy. Problems of Transition", 
    "price": 0, 
    "instructors": "Vladimir Zuev", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/economy-russia-transition", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}