{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    В течение жизни мы постоянно взаимодействуем с другими людьми. Маленькие дети, пытаясь добиться того, чтобы родители купили понравившуюся конфетку, часто шантажируют родителей своими слезами. Принимая решение заплакать, ребенок рискует — он не знает, как поведут себя папа с мамой. В чуть более взрослом возрасте абитуриенты, выбирающие вуз, принимают сложное решение о том, в какие университеты подать документы. Ошибка может стоить дорого: при неправильной стратегии можно оказаться в слабом университете или вообще остаться без заветного студенческого билета. Окончив вуз, юноши и девушки начинают искать работу. Перед интервью с работодателем они штудируют статьи в интернете о том, что можно и чего нельзя говорить на интервью, — они пытаются найти наилучшую стратегию своего поведения, исходя из ожиданий компании, в которую они устраиваются. Все эти ситуации объединяет то, что решения, которые принимают одни люди, оказывают влияние на других людей. Такие взаимодействия называются стратегическими. Именно их изучает теория игр.\n\nЧтобы проанализировать ту или иную реальную жизненную ситуацию стратегического взаимодействия и найти оптимальный вариант поведения в ней, необходимо сделать две вещи. Во-первых, необходимо формально записать ситуацию на языке теории игр, то есть создать модель (игру). Во-вторых, после того как модель (игра) составлена, ее необходимо решить. Этому мы будем учиться в течение курса. Мы разберем основные виды игр (одновременные и последовательные, с совершенной и несовершенной информацией, коалиционные и некоалиционные), приведем способы их решения и обсудим их на многочисленных примерах.\n\nКурс будет интересен желающим разобраться в том, как конкурируют друг с другом несколько компаний и можно ли гарантированно выиграть в шашки, есть ли смысл угрожать на переговорах и с кем стоит объединяться в коалиции в парламенте.\n\nFAQ\n\nВ: Требуется ли предварительная подготовка для прохождения курса?\nО: Курс является базовым, поэтому он не требует специальной подготовки. Для его успешного освоения достаточно уверенных знаний курса математики в объеме школьной программы. В одном-двух примерах могут пригодиться знания начал математического анализа (дифференцирование функций одной переменной, необходимое условие экстремума) и знания начал теории вероятностей (понятие математического ожидания случайной величины).\n\nВ: Что требуется для успешного окончания курса?\nО: Итоговая оценка за курс складывается из результатов 10 оцениваемых тестов. Для успешного окончания курса необходимо дать не менее 80 % правильных ответов на каждый из этих тестов.\n\n                                            Syllabus\n                        Стратегические взаимодействияДобро пожаловать на первую неделю нашего курса! На этой неделе мы поговорим о предмете изучения теории игр; определим, какие ситуации можно называть стратегическими взаимодействиями, а какие — нельзя; обсудим примеры таких взаимодействий и узнаем о том, как описывать реальные жизненные ситуации на формальном теоретико-игровом языке.Доминирующие и доминируемые стратегииДобро пожаловать на вторую неделю курса! На первой неделе мы разобрались с тем, как игры можно моделировать, а теперь мы начинаем изучать способы решения теоретико-игровых моделей. Вторая неделя будет посвящена доминирующим и доминируемым стратегиям. Мы рассмотрим первые концепции решения игр: равновесие в строго (слабо) доминирующих стратегиях и равновесие, получаемое исключением строго (слабо) доминируемых стратегий, а также поговорим о том, как эти концепции связаны между собой.Равновесие НэшаДобро пожаловать на третью неделю курса! Видеолекции этой недели посвящены равновесию Нэша — одной из важнейших концепций решения игр. Помимо прослушивания лекций, приглашаю вас проверить свои знания в еженедельном тесте и изучить еженедельную подборку дополнительных материалов. Напоминаю, что если у вас возникают вопросы по курсу, пожалуйста, не стесняйтесь задавать их на форуме. Как правило, это помогает лучше разобраться в материале.Модель Хотеллинга — Даунса и модель КурноДорогие слушатели, приветствуем вас на четвертой неделе курса! Многих из вас наверняка интересует вопрос о том, где применить знания, полученные на курсе по теории игр, в реальной жизни. Материал четвертой недели частично даст на него ответ. Мы поговорим о политической конкуренции кандидатов во время предвыборной кампании и экономической конкуренции фирм на рынках с несколькими производителями. На следующих неделях мы поговорим и о других примерах использования теории игр в жизни.Игры в развернутой формеДорогие слушатели! Начинается пятая неделя курса. На ней мы поведем разговор о втором важном классе стратегических взаимодействий — о последовательных взаимодействиях. Пятая неделя будет посвящена рассмотрению принципов решения таких игр и, в первую очередь, алгоритму обратной индукции. Кроме того, на этой неделе очень важно разобраться с тем, что такое стратегия в игре в развернутой форме — практика показывает, что при встрече с этим определением в первый раз многие испытывают затруднения. Желаем вам успехов и плодотворной учебы!Равновесие Нэша, совершенное на подыграхДорогие слушатели! Наш курс приближается к своему экватору. На этой неделе мы продолжаем изучать последовательные стратегические взаимодействия. Вводится новая концепция решения игр в развернутой форме — равновесие Нэша, совершенное на подыграх. Проверить себя можно с помощью еженедельного теста по этой теме. Кроме того, приглашаем вас изучить повнимательнее еженедельную подборку дополнительных материалов, посвященную последовательным стратегическим взаимодействиям. Там можно найти как ссылки на основополагающие научные работы, так и ссылки на подборки задач по этой теме. Успехов!Игры с несовершенной информациейSalut! Мы рады видеть вас уже на седьмой неделе нашего курса. Преодолен своеобразный рубеж: на первых шести неделях мы изучили джентльменский набор начинающего теоретико-игровика. Начиная с седьмой недели мы будем говорить о более высоких материях. Тема этой недели — несовершенство информации. Иногда бывает так, что при последовательном стратегическом взаимодействии один из игроков не знает, какие действия выбрал другой игрок. Можно ли анализировать поведение игроков в таких ситуациях? Оказывается, что да, и мы будем этому учиться.Смешанные стратегииДобро пожаловать на восьмую неделю курса! На восьмой неделе мы изучим смешанные стратегии, попробуем найти равновесия Нэша в смешанных стратегиях и узнаем о том, что в процессе поиска равновесий можно исключать стратегии, доминируемые смесью нескольких других стратегий. После просмотра видеолекций приглашаем вас выполнить очередной еженедельный тест. Удачи и успехов в обучении!Задача о стабильных мэтчингахДобро пожаловать на девятую неделю курса, друзья! Эта неделя полностью посвящена задаче о стабильных мэтчингах (паросочетаниях). Всплеск интереса к этой теме произошел в 2012 году, когда Нобелевскую премию по экономике получили Ллойд Шепли и Эл Рот за теоретические исследования в области стабильных мэтчингов и практику дизайна рынков. Вместе с видеороликами опубликован новый тест, а также подборка дополнительных материалов. Успехов и хорошего настроения!\nКоалиционные игрыДорогие слушатели! Десятая неделя посвящена коалиционным играм. Они отличаются от тех игр, которые мы рассматривали раньше: теперь у игроков нет привычных множеств возможных стратегий, но зато они имеют возможность сговариваться и вступать в коалиции. Мы рассмотрим две концепции решения коалиционных игр: ядро и вектор Шепли (кстати, Ллойд Шепли вполне мог бы получить Нобелевскую премию не за теорию мэтчингов, а за вклад в теорию коалиционных игр). Опубликованный в рамках этой недели тест будет последним тестом на нашем курсе. На одиннадцатой неделе нового теста не будет. Тем не менее мы надеемся увидеть всех и на одиннадцатой неделе!Краткая история теории игрДорогие слушатели! В видеолекциях одиннадцатой недели курса мы решили поговорить об истории теории игр. Помимо получения предметных знаний, важно видеть логику развития дисциплины. Надеюсь, что материалы одиннадцатой недели нам в этом помогут. Удачи и дальнейших успехов в постоянном и непрерывном обучении!\n                                    ", 
    "end_date": "2016-04-06T00:00:00Z", 
    "title": "Теория игр (Game Theory)", 
    "price": 0, 
    "instructors": "Dmitry Dagaev", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/game-theory", 
    "duration": "11 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-01-20T00:00:00Z"
}