{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Эконометрика – наука, позволяющая исследовать закономерности в реальных данных. К концу курса мы научимся отвечать на два вопроса. Как одна переменная, y, зависит от другой переменной, x? Как спрогнозировать переменную y?\n\nМы будем подробно изучать линейные регрессионные модели,  рассмотрим наиболее частые отклонения от предпосылок классической линейной регрессии. Изучим базовые модели (логит и пробит) для качественных зависимых переменных. Наряду с теоретической основой мы будем работать с реальными данными, используя статистический пакет R.\n\nНеобходимые знания:\nТеория вероятностей и математическая статистика.\nЛинейная алгебра опционально.\n\n                                            Syllabus\n                        Метод наименьших квадратов или рабочая лошадка эконометриста, введение в RМатериалы всех недель доступны сразу, но в системе указаны рекомендуемые сроки выполнения всех заданий. Форум также открыт для Ваших вопросов. Ознакомьтесь с правилами оценивания и проведения контрольных работ. Обращаем Ваше внимание на то, что тест можно делать сколько угодно раз, но на каждые 8 часов даются только три попытки. Если Вы начали выполнять тест, то время на его выполнение неограничено. Ссылки на pdf-файлы лекций и скрипты для всех недель находятся в разделе Ценные ресурсы так же, как и правки к видео-фрагментам :) В первых же тестах есть вопросы, где необходимо использовать R, поэтому надеемся, что Вы уже успели поставить его на свои компьютеры. Если нет, то в Ценных ресурсах лежат подробные инструкции по установке софта. После установки не забудьте открыть в R-Studio (File -&gt; Open file) файл \"install_all.R\" и запустите его, чтобы поставить все необходимые нам в ближайшее время пакеты. Выделите все строчки и запустите с помощью сочетания Ctrl + Enter на Windows или Cmd + Enter на Mac. Чтобы познакомиться с R поближе, в данной виньетке представлено краткое и наглядное описание интерфейса R-studio, шоткатов и других полезных вещей. Успехов!Статистические свойства оценок коэффициентовБета с крышкой - друг и враг эконометриста :)Дамми-переменные, сравнение вложенных моделейДамми для дам и не только :)МультиколлинеарностьИли зачастую \"самая нестрашная\" проблема в данных :)ГетероскедастичностьВ древнерусском Разноразбросие :)АвтокорреляцияИли о том, чем могут быть опасны зависимые ошибки  :)Метод максимального правдоподобия. Модели бинарного выбораИли о том, что делать, если зависимая переменная принимает всего два значенияСтационарные временные рядыДаты, встаньте в ряд! :)ЭндогенностьПроблема, которую можно найти почти во всех исследованиях :) Нестандартные сюжетыПродвинутые методы, включая машинное обучение\n                                    ", 
    "end_date": "2016-08-05T00:00:00Z", 
    "title": "Эконометрика (Econometrics)", 
    "price": 0, 
    "instructors": "Boris Demeshev", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "3-8 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/ekonometrika", 
    "duration": "10 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-27T00:00:00Z"
}