{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Экономическая социология опирается на длинную и богатую интеллектуальную традицию и в то же время является молодой, становящейся. Она пережила ренессанс в 1980-е годы с появлением «новой экономической социологии», активно и плодотворно анализирующей экономические объекты – развитие современных рынков, деятельность компаний и домашних хозяйств, трудовое, финансовое и потребительское поведение людей. Экономическая социология – широкая интегративная дисциплина. В данном курсе отобраны темы и концепции, наиболее важные для понимания и содержательного использования экономико-социологического подхода.\n\nВ результате освоения курса слушатели:\n- получат углубленные знания о предмете, основных направлениях исследований и перспективах развития экономической социологии;\n- научатся применять разнообразные аналитические инструменты, используемые в современных экономико-социологических исследованиях;\n- выработают навыки критического осмысления научных материалов по экономико-социологическим проблематикам.\n\nПрограмма курса\nКурс включает 10 тем по экономической социологии.  В каждой теме Вам предлагаются видеолекции, перечень основных вопросов лекции, литература и проверочный тест. \n\nТемы курса\n1. Предмет экономической социологии\n2. Модель человека в экономической социологии\n3.Человек в роли предпринимателя\n4. Человек в трудовых отношениях\n5. Человек в домашнем хозяйстве\n6. Человек в роли потребителя\n7. Человек в денежном хозяйстве\n8. Рынок как форма хозяйства\n9. Государственное регулирование хозяйства\n10. Неформальная экономика как форма хозяйства\n\n                                            Syllabus\n                        ВводныйВ данном модуле представлена общая информация о курсе \"Экономическая социология\" НИУ ВШЭПредмет экономической социологииРазбирается, что и как изучает экономическая социология, в чем заключается специфика экономико-социологического подхода по сравнению с экономической теорией. Разворачивается ключевое понятие укорененности экономического действия, и изучается, в каких именно социальных отношениях это действие укоренено. В результате раскрываются исходные основания экономической социологии, и показывается, какие типы исследовательских задач она помогает решать.Модель человека в экономической социологииСравниваются модели поведения человека, из которых исходят экономическая теория и экономическая социология. Показывается, что лежит в основе мотивации хозяйствующего человека, и почему она не сводится к эгоистическому интересу. Раскрывается понятие рациональности человеческого поведения и объясняется, как возникают множественные формы рациональности. Выясняется, как формируются модельные и векторные стратегии поведения человека. В результате прослеживаются принципы, на которых строятся разнообразные модели поведения человека в экономической социологии.Человек в роли предпринимателяРаскрывается общее понятие предпринимательской деятельности. Объясняется, кого следует относить к предпринимателям, какими мотивами руководствуются предприниматели, кроме денежного интереса, и какими качествами они обладают. Изучаются исторические корни, из которых вырос дух современного предпринимательства. Характеризуется среда, которая порождает предпринимателей и нередко делает предпринимательство вынужденным. Рассказывается об особенностях этнического предпринимательства. В результате проясняются специфика предпринимательства как функции и особенности положения предпринимательских групп в современном обществе.Человек в трудовых отношенияхРаскрываются основные элементы трудовых отношений. Показывается, как эволюционировали модели управленческого контроля над трудом в течение двадцатого столетия. Дается сравнительный анализ стратегий, которые вырабатываются менеджерами для утверждения авторитета внутри фирмы. Изучаются разнообразные формы активного и пассивного сопротивления менеджменту со стороны работников. Рассказывается о судьбах забастовочного движения в западных странах и современной России.  В результате вырабатывается содержательное понимание трудового процесса как органического соединения конфликта и сотрудничества.Человек в домашнем хозяйствеОпределяются общие понятия домашнего хозяйства и домашнего труда. Выясняется, как отделить домашний труд от рыночной занятости, потребления и досуга. Раскрываются принципы организации домашнего хозяйства как субстантивной и моральной экономики. Сравниваются разнообразные модели распределения трудовой нагрузки между супругами в домашнем хозяйстве. Показывается, как меняются характер и структура современного домашнего хозяйства. В качестве эмпирического кейса анализируется производство домашнего алкоголя в современной России. В результате раскрывается специфика поведения человека в домашнем хозяйстве в отличие от его поведения в условиях рынка.Человек в роли потребителяПредлагается общее понятие потребления. Показывается, как потребление связано с социальной дифференциацией людей, и как формируются разнообразные стили жизни. Демонстрируются характерные черты общества потребления и сдвиги, вызванные переходом от производства продуктов к производству знаков. Потребление рассматривается также как совокупность инновационных практик. В качестве эмпирического кейса анализируется то, как трансформировалась торговля в течение последних полутора столетий, как возникали новые торговые форматы в современной России, и как эти трансформации воздействовали на процесс потребления. В результате складывается объемное представление о социальном характере потребительских процессов и механизмах их преобразования в современный период.Человек в денежном хозяйствеРаскрывается, что такое деньги, и каковы их основные функции, как они возникали, эволюционировали и меняли формы с течением времени. Объясняется, почему деньги выступают как социальное отношение, и что происходит, когда деньги пересекаются с сакральными ценностями. Изучается то, как возникает множественность денежных единиц, и как люди самостоятельно создают целевые деньги. В качестве эмпирического кейса рассматривается развитие в современной России рынка безналичных платежей с использованием банковских карт. В результате формируется представление о меняющемся характере денег и механизмах их социального производства.Рынок как форма хозяйстваРаскрывается общее понятие рынка и множество его более частных значений. Показываются первоначальные формы, в которых исторически возникал рыночный обмен. Анализируются механизмы действия рыночной конкуренции. Рынок характеризуется как организационное поле и как цепь поставок. В качестве эмпирического кейса рассматривается возникновение глобальных цепи поставок на примере легкой промышленности и ситуация, в которой оказалась отрезанная от этих цепей российская легкая промышленность. В результате появляется понимание основных подходов к анализу рынков и конкуренции в экономической социологии. Государственное регулирование хозяйстваПредлагается общее понимание государства как тройственной монополии. Раскрывается специфика государства как особого участника хозяйственного процесса. Анализируются основные модели государственного вмешательства в хозяйственные процессы. Вводится формальное определение коррупции и прослеживается отличие коррупции от других форм реализации агентских отношений в деятельности чиновников. В качестве эмпирического кейса рассматривается государственный сектор в современной российской экономике и институциональные гибридные формы, которые он порождает. В результате вырабатывается понимание новой парадигмы в изучении хозяйственной роли современного государства. Неформальная экономика как форма хозяйстваПредлагаются определения неформальной экономики и ее основных сегментов. Объясняется, почему возникают неформальная и теневая экономика. Рассматриваются методы измерения теневой экономики и их ограничения. Прослеживаются различия формальных и неформальны правил, регулирующих хозяйственную деятельность. Раскрываются механизмы деформализации и формализации правил. В качестве эмпирического кейса анализируется процесс легализации российского бизнеса в 2000-е годы. В результате формируется понимание неформальной экономики и механизмов ее функционирования с точки зрения структурного и институционального подходов.\n                                    ", 
    "end_date": "2016-08-29T00:00:00Z", 
    "title": "Экономическая социология", 
    "price": 0, 
    "instructors": "Радаев Вадим Валерьевич ", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/ekonomicheskaya-sociologiya", 
    "duration": "10 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}