{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    Главная цель курса - заложить у наших слушателей основы экономической грамотности, \"экономического образа мышления\" и показать, как экономические знания могут применяться в реальной жизни.\n\nКурс спроектирован так, чтобы быть интуитивно понятным даже слушателям, не обладающим какими-либо исходными знаниями по экономической теории, поэтому он не требует предварительной подготовки. Надеюсь, что изложение материала получилось максимально живым и неформальным.\n\nКурс включает важнейшие и наиболее связанные с повседневной жизнью темы из двух разделов экономической теории, микроэкономики и макроэкономики. Микроэкономика изучает поведение отдельных элементов экономической системы страны - прежде всего, потребителей и производителей - то, как они делают свой выбор (что купить/произвести) и как взаимодействуют друг с другом. Ключевые категории микроэкономического анализа, с которыми мы познакомимся: спрос и предложение; производство, издержки и прибыль; рыночные структуры (такие, как совершенная конкуренция, монополия и олигополия). Макроэкономика изучает экономическую систему страны как единое целое и проблемы, общие для всей экономики. Ключевые категории макроэкономического анализа, с которыми мы познакомимся: ВВП, инфляция и безработица; экономический рост и деловой цикл; государственная макроэкономическая политика.\n\nДля успешного завершения курса необходимо получить проходной балл по ВСЕМ оцениваемым заданиям (не менее 80% от максимального балла за задание). При этом каждое задание вы можете повторять до тех пор, пока не добьетесь успеха.\n\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "Экономика для неэкономистов (Economics for non-economists)", 
    "price": 0, 
    "instructors": "Igor Kim", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/ekonomika-dlya-neekonomistov", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-07-11T00:00:00Z"
}