{
    "selfpaced": false, 
    "topic_name": [
        "Economics"
    ], 
    "description": "\n\n                    \n                    \n                    人是否會如同理論經濟學的預測進行決策？這門課將透過每週的課程影片以及課後作業帶你了解實驗經濟學的基本概念。每週將會有習題練習以及指定閱讀的期刊論文。你將會參與一些線上的實驗、報告論文並且互評其他同學的報告。\n\n❖ 課程介紹（About the course）\n\n這是一門進階的經濟學課程，課程目標為介紹實驗經濟學的基本概念，並且讓學生們能開始在這個領域從事自己的相關研究。\n\n詳細課程目標如下:\n\n1. 實驗經濟學的介紹: 在上完這堂課之後，學生應能列舉經濟學各個領域的數個知名實驗，並且解釋實驗結果如何驗證或否證經濟理論及其他實地資料。\n\n2. 評論近期相關領域研究：上完這堂課之後，學生應能閱讀並評論實驗經濟學相關的期刊論文。在課堂中，學生將會閱讀指定的期刊論文，並且（在影片中）親自上台報告一篇論文。\n\n\n\n❖ 授課形式（Course format）\n\n1. 本堂課將以影片的形式為主，搭配課後作業的形式來進行。\n\n每個同學將閱讀一篇實驗經濟學論文，並錄影成兩段各 10 分鐘的介紹影片並後上傳至 Coursera（或上傳到 Youku，再複製連結到作業上傳區）。第一段期中報告影片請同學介紹該論文所描述的實驗設計，第二段，也就是期末報告影片則介紹實驗結果。此外每位同學至少需觀看其他兩位同學的呈現內容，並給予評論。\n\n2. 這堂課將簡單地運用以下賽局（博弈）概念：\n\n奈許均衡 / 纳什均衡（Nash Equilibrium）\n混合策略均衡（Mixed Strategy Equilibrium）\n子賽局完美均衡 / 子博弈精練纳什均衡（SPNE）\n共識 / 共同知識（Common Knowledge）\n信念（Belief）\n\n                                            Syllabus\n                        實驗經濟學歡迎來到實驗經濟學的世界！在這個禮拜的課程中，我們將會介紹什麼是「實驗經濟學」？它與其他經濟學的分支有甚麼關係？然後，我們特別專注探討有別於傳統賽局論的「行為賽局論」。在此，我們將會用三個例子，「最後通牒談判實驗」、「產業發展分水嶺實驗」以及「選美結果猜預測賽局」來為這門課揭開序幕！ 個別決策與實驗設計這個禮拜的課程共分為兩個部份，分別是：「個別決策」與「實驗設計」。在個別決策部份，我們將要介紹如何測量每個人的風險偏好與時間偏好，以及其背後的理論。在實驗設計部份，我們會先以四個元素定義一個「經濟學實驗」：真實誘因、對照組的設計、隨機分組、不欺騙受試者，並討論在這個定義下如何設計一個「好」的經濟學實驗。社會偏好 - 1人們在做決策的時候真的只會在乎自己的報酬嗎？還是也會在乎別人得到的報酬？在很多情況下我們發現，人們的實際行為與經濟理論的預測似乎不太相符，但不見得是因為他們沒有極大化自己的效用，而是因為人們的效用跟別人所得到的報酬有關。在這個禮拜的課程中，我們將會介紹「社會偏好」，也就是我們偏好「別人」得到多少的報酬。首先，我們將從以下三個賽局實驗：「囚犯的兩難」、「自願捐輸賽局」以及「最後通牒談判」來討論社會偏好在人們的決策中所扮演的角色。社會偏好 - 2在上個禮拜的課程中，我們從實驗結果中，看到社會偏好如何影響人們的決策。在這個禮拜的課程，我們將會從經濟理論的角度，來討論社會偏好。我們在這個禮拜的課程，我們會比較三種社會偏好模型：Guilt-Envy、ERC，以及Fairness Equilibrium。另外，我們也觀察在「信任賽局」中，人們互惠的社會偏好如何運作。混合策略的均衡實驗只有混和策略均衡的賽局在生活中比比皆是，而且人們在這樣的賽局中的行為似乎會自然地趨向這個均衡，使得賽局論的數學結果得以被經濟學實驗結果驗證。在這個禮拜的課程中，我們會從「剪刀石頭布」、「Matching Pennies Games」、「Joker Game」以及「三種選擇的黑白猜賽局」來探討人們的在混和策略賽局中的行為。議價談判「談判」，是人們每天都會碰到的情境，因此人與人之間的談判行為也成為至關重要的議題。在這個禮拜的課程中，我們將會討論議價談判中的主要兩種實驗形式：「自由談判」與「制式談判」。「自由談判」用來驗證「合作賽局」中的議價談判，有別於「制式談判」是用來驗證前幾個禮拜所探討人們在「非合作賽局」中的行為。接下來，我們會進一步討論，在談判一方或雙方資訊不透明時，談判行為又會如何改變。優勢可解賽局實驗在解賽局均衡時，「優勢 ( dominance ) 」是一個非常重要的觀念，即：一個策略如果「在任何情況下都比另一策略差」，就不應該用，因為它無論如何都不會極大化你的報酬。然而你自己會不會遵守極大化、使用優勢策略，跟「你相信別人會不會遵守極大化、使用優勢策略」不太一樣，因為後者牽涉到你對別人行為的「信念」。如果人們對別人理性的程度沒有足夠信心，他們實際在做決策時就可能不會按照優勢可解賽局的預測來做。在這個禮拜的課程中，我們將會討論人們在輪流出招的優勢可解賽局中的行為。我們首先會討論Beard and Beil的實驗及其相關研究，接下來我們會看看人們在蜈蚣賽局中的行為是否與理論相符，最後，我們會討論機制設計與人們在「髒臉賽局」中的行為。多層次思考在上個禮拜的課程中我們可以發現，在輪流出招的優勢可解賽局中，人們的行為與其信念的層次有很大的關聯。而在這個禮拜的課程中，我們將進一步討論，在兩人同時出招的賽局中，人們的行為是如何受到「多層次思考」的影響。我們首先會利用多層次思考模型來解釋人們在「捉迷藏賽局」與「同時決定的優勢可解賽局中」中的行為。接著，我們亦會重新探討我們先前所看過的兩個賽局：「選美結果預測賽局」以及「Joker Game」。Final Assignment恭喜你完成了這八個禮拜的課程！在最後這個禮拜中，我們將用兩份期末作業來檢視你在過去八個禮拜的成果。這兩份作業分別是：「Final Quiz: Strategic IQ Games」以及「『論文書面報告』或『論文報告影片』 」。另外，我們有一份實驗設計作業為額外挑戰題(其結果將不影響總成績與證書認證)。如果你的時間允許，歡迎你嘗試應用實驗設計原理來「設計屬於你的實驗」。\n                                    ", 
    "end_date": "2016-08-24T00:00:00Z", 
    "title": "實驗經濟學 (Experimental Economics I: Behavioral Game Theory)", 
    "price": 0, 
    "instructors": "王道一 Tao-yi  Wang", 
    "institution_name": [
        "National Taiwan University"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/shiyan-jingji-xue", 
    "duration": "9 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-22T00:00:00Z"
}