{"selfpaced": true, "topic_name": ["Disease & Disorders"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Health &amp; Medicine\n                                                                                            \n                            \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Health &amp; Medicine\n                                                                                                    &gt; Disease &amp; Disorders\n                                                            \n                            \n                                                \n                    \n                    \n                    Not so long ago, it was almost guaranteed that you would die of an infectious disease. In fact, had you been born just 150 years ago, your chances of dying of an infectious disease before you've reached the tender age of 5 would have been extremely high. \n \nSince then, science has come a long way in understanding infectious diseases - what they are, how they spread, and how they can be prevented. But diseases like HIV/AIDS, Malaria, Tuberculosis, or the flu are still major killers worldwide, and novel emerging diseases are a constant threat to public health. In addition, the bugs are evolving. Antibiotics, our most potent weapon against bacterial infections, are losing their power because the bacteria are becoming resistant. In this course, we'll explore the major themes of infectious diseases dynamics.\n\nAfter we’ve covered the basics, we'll be looking at the dynamics of the flu, and why we're worried about flu pandemics. We'll be looking at the dynamics of childhood diseases such as measles and whooping cough, which were once considered almost eradicated, but are now making a comeback. We'll explore Malaria, and use it as a case study of the evolution of drug resistance. We'll even be looking at social networks - how diseases can spread from you to your friends to your friends' friends, and so on. And of course we’ll be talking about vaccination too. We’ll also be talking about how mobile phones, social media and crowdsourcing are revolutionizing disease surveillance, giving rise to a new field of digital epidemiology. And yes, we will be talking about Zombies - not human zombies, but zombie ants whose brains are hijacked by an infectious fungus. \n\nWe're looking forward to having you join us for an exciting course!\n\n                                            Syllabus\n                        Course IntroductionWelcome to Epidemics: the Dynamics of Infectious Diseases.  This course will teach you about the variety of parasitic organisms that infect humans, animals, and plants, how these parasites spread through populations, and the various methods that we employ to control them.PathogensIn the first module, you will learn about the organisms that can infect us and make us sick: pathogens. We will first take a look at the various types of pathogens that exist, and then learn about what it means to be infectious, and what it means to cause disease. After that, we will cover the various methods by which pathogens can transmit from one person to the next, thereby causing an epidemic. You will learn about the most important number in all of epidemiology, R0, and why this number is so important. Finally, we will learn that microorganisms are not always harmful, but can be beneficial to us as well.HostsThe second module of the course covers host factors that determine the outcome of infection. We will first focus on host immunity and present both the general immune capabilities—the innate immune response—that are encoded in our genes and that provide the initial response to infection and the adaptive immune response, which arises from highly specialized cells that protect against a specific pathogen. You will then learn about the ways that pathogens circumvent these two types of immunity and consider other factors that can contribute to an individual becoming infected or diseased—including genetic factors, other microbes, and how social and emotional factors influence immunity. We will then consider how infection with a microorganism causes disease and how public health officials determine whether a disease outbreak is caused by an infectious organism.Basics of EcologyThe third module of the course covers ecological factors that influence the dynamic patterns of infectious disease. We will discuss the conditions under which a pathogen can drive its host to extinction. We will look at how the demography of the host may allow the pathogen to persist in some populations but not others. We will talk about how host and pathogen characteristics interact to shape different temporal patterns of disease incidence at the population level and discuss the ecological consequences of infecting more than one host species.EpidemiologyWhere humans live and how they are connected to each other, have strong effects on how infectious diseases can spread. In this module, you will learn about some of the related key concepts of epidemiology. After looking at some fascinating history, we’ll learn about social networks as the ultimate “road map” on which diseases can travel and we’ll talk about how the structure of the network can influence disease dynamics. After that, we’ll cover three topics that all affect infectious disease epidemiology in dramatic ways: human transport systems, population density and so-called superspreaders - individuals who can spread a disease to dozens or even hundreds of other individuals. We’ll close by identifying what information is required for disease surveillance.VaccinationIn module 5 of the course, you will learn about vaccination, one of the most common approaches to the prevention of epidemics. We'll first put vaccination in the context of the many types of public health interventions that that can be used to prevent or treat disease. After that you will learn about the development of the first vaccine, how vaccines work to prevent infection, and the impact that vaccination has had on the prevention of disease worldwide.  After that, you will learn about how vaccination can provide protection to everyone, even the unvaccinated, in the population through \"herd immunity\" and how we can use the structure of social networks within populations to more efficiently achieve this herd protection. Finally we'll learn about how individuals choices about whether or not to get vaccinated can lead to impacts across the whole of the population.Control MechanismsIn module 6 of the course, you will learn about mechanisms involved in controlling epidemics. In these lectures, we will discuss what control mechanisms are trying to do, such as breaking the chain of transmission, and many ways by which animals and humans attempt to achieve control. These means include pharmaceutical and non-pharmaceutical interventions, appearing at individual or population levels. We will describe examples of great successes in eradication, and the reasons why control efforts fail.EmergenceIn module 7 of the course, we’ll look at so-called emerging infectious diseases. These are diseases that are causing new problems. They include infectious agents that are new to humanity, but also infectious agents that were once controlled and are now returning, particularly those that are evolving around formerly very effective public health tools like drugs and vaccines. This means much of the week involves a discussion of evolution. We will look at these emerging diseases and ask, where do they come from and what can be done about them? You will learn about new ideas for managing evolution, and some of the societal challenges involved. We will also look at the related question of how some diseases evolve to be nicer or nastier to their hosts.Global HealthIn this final module we explore the global context of epidemics. The world is rapidly changing with the global population increasing and the speed of travel and extent of globalization piling on the pressure of infectious diseases. In this week we set out first to explore a textbook example of disease shaped by the conditions presented by modern living: the disease SARS. We will see how high density living in cities coupled with links to wildlife diseases through markets can create a pandemic. We then explore traditional methods of disease surveillance and then more recent ones afforded to us by the web and networks made possible through google, twitter and other social media. Important to this global view is human behavior, our evolving culture and health. We will also consider emerging disease and the global pattern of diseases across our recent history and how from our earliest beginnings of global travellers we have affected the spread of diseases. Finally, we discuss disease of our food plants and how models of disease spread are developed to promote better global health. As a postscript to the course we ask the questions, so beloved of modern media, could we become zombies?Ask Us Anything VideosThe videos accessible in this module are responses to questions that have been posed in previous sessions of this course. We invite you to look around here as an additional resource to answer questions you might have yourself or explore topics that pique your interest. \n                                    ", "end_date": "2016-08-01T00:00:00Z", "title": "Epidemics - the Dynamics of Infectious Diseases", "price": 0, "instructors": "Marcel Salathé, Ottar N. Bjornstad, Andrew Read, Rachel A. Smith, Mary L. Poss, David P. Hughes, Peter Hudson and Matthew Ferrari", "institution_name": ["Pennsylvania State University"], "commitment": "1-2 hours", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/learn/epidemics", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}