{"selfpaced": false, "topic_name": ["Disease & Disorders"], "description": "\n\n                    \n                    \n                    Ce cours présente, de façon simple et compréhensible par tous, la maladie d’Alzheimer et les maladies apparentées. Sont abordés les données actuelles sur leur physiopathologie, les signes de ces maladies, la démarche médicale qui conduit à leur diagnostic, ainsi que leur prise en charge. De plus, le retentissement sur la société, l’état de la recherche et les pistes pour la prévention sont aussi abordés.Ce cours s’adresse à toute personne intéressée par ces maladies et aussi aux professionnels de santé intéressés. Il ne concerne pas les experts de ces maladies. Ce cours est formé de 10 parties comportant chacune un exposé, des interviews d’experts des sujets abordés et un questionnaire d’autoévaluation.La maladie d'Alzheimer est la plus fréquente des maladies neurodégénératives. Elle touche plus d'un million de personnes en France et 36 millions dans le monde. Bien que l'on parle beaucoup de cette maladie, de nombreuses idées fausses circulent à son propos et le diagnostic est souvent méconnu ou posé trop tardivement. Ce cours présente de façon simple et claire, les données actuelles scientifiques bien établies sur cette maladie.\n\n                                    ", "end_date": "2015-10-23T00:00:00Z", "title": "La maladie d’Alzheimer : tout ce que vous avez toujours voulu savoir", "price": 0, "instructors": "Joel Belmin", "institution_name": ["Sorbonne Universités"], "commitment": "1-2 hours", "subject_name": ["Health & Medicine"], "course_url": "https://www.france-universite-numerique-mooc.fr/courses/UPMC/18004/session01/about", "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["France Université Numerique"], "start_date": "2015-09-18T00:00:00Z"}