{"selfpaced": false, "topic_name": ["Disease & Disorders"], "description": "\n\n                    \n                    \n                    We are currently experiencing an international explosion of liver disease that continues to have enormous impact upon healthcare systems and global health. In the UK we have seen a 20% increase in deaths related to liver disease since 2000 and this pattern reflects the global situation.\n\nContrary to expectations, this dramatic increase in liver disease is not restricted to patients who drink alcohol, and liver cancer is the third most common cause of cancer related death. Many inherited conditions and acquired infections can also cause liver disease, and liver disease as a consequence of obesity and diet is becoming especially significant.\n\nThis course will teach you about the amazing roles the liver fulfils to keep you healthy and will show you how these functions are compromised when the liver is damaged. We will highlight the reasons why liver disease is on the increase and show you some of the amazing new treatment options available to address the global challenge of liver disease. Finally we will also show you some simple steps you can take to look after your liver to prevent liver disease.\n\nYou can see what the tutors are up to by following their Twitter feed @BirminghamLiver. You can also find out more in Patricia Lalor’s blog post: “What can you do to look after your liver?”\n\n\n                                    ", "end_date": "2016-06-06T00:00:00Z", "title": "Liver Disease: Looking after Your Liver", "price": 0, "instructors": "Patricia Salinas Martínez", "institution_name": ["University of Birmingham"], "commitment": "3 hours", "subject_name": ["Health & Medicine"], "course_url": "http://www.futurelearn.com/courses/liver-disease?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-05-16T00:00:00Z"}