{"selfpaced": false, "topic_name": ["Disease & Disorders"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    mhglobal-001\n                                                                    mhglobal-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Mental illness can affect anyone. It is an important cause of disability worldwide. However the pathways to receiving adequate and humane mental health care vary within countries and between countries. This mental health inequity is a challenge to be explored and overcome in order to attain better health for all nations. Participating in this course is a step towards overcoming this global challenge.The 5-week course begins with an introduction to fundamental concepts related to mental health and illness and presents evidence for global mental health inequity. The course will consider how factors such as stigma, violations of human rights, culture, spirituality, partnerships and technology may affect the pathways to mental health care. We will also consider the effects of globalisation on mental illness and mental health care. The course concludes by looking at the opportunities we have in the 21st century to prioritise and improve mental health from a local and global perspective.\n\n                                            Syllabus\n                        Week 1 - Mental health: a global priority?We begin the course with an introduction to concepts of mental health and mental illness and we recognise the reasons for global variations in common mental illnesses. At the end of this week you should be able to explain what level of priority you think mental health should be given in your country and other countries.\n\nWeek 2 - Pathways to mental health: suffering, stigma and human\nrightsThis week we consider how stigma and human rights affect people with mental illnesses in different countries and explore approaches to overcoming stigma.\n\nWeek 3 - Pathways to mental health health 2: culture and\nspiritualityContinuing with our pathways to mental health approach, we seek a deeper understanding of the role of culture in mental health care with a focus on spirituality.\n\nWeek 4 - Pathways to mental health 3: people and\npartnershipsThis week we look at how different partnerships can be formed to improve mental health care services and we consider the care-giving roles of professionals and lay people.\n\nWeek 5 - 21st century challenges and\nopportunities in mental healthWe finish the course with a review of innovation opportunities in mental health care from the perspective of globalisation. At the end of this week you should be able to suggest how mental health might be improved in your own country as well as in other countries.\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Mental Health: A Global Priority", "price": 0, "instructors": "Liz Grant, Anne  Aboaja and Narinder Bansal", "institution_name": ["University of Edinburgh"], "commitment": "1-3 hours", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/course/mhglobal", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-10-12T00:00:00Z"}