{"selfpaced": false, "topic_name": ["Physics"], "description": "\n\n                    \n                    \n                    In our highly technological society, it is useful to have a basic understanding of the how and why the world works the way it does: that’s what physics is all about. It also involves a touch of history, a bit of mathematics, and many everyday examples.Before starting this course, you are recommended to have the following equivalent mathematical knowledge:\r\n• Calculus• Elementary statistics• Trigonometry• Sine and Cosine graphs• Algebra\r\nPhysics is concerned with every aspect of our universe, and in Basic Physics you will explore 4 main areas: Motion, Waves &amp; Sound, Electricity &amp; Magnetism, and Light. You will gain some valuable insight into these topics, and be able to make simple calculations and predictions.\r\nWhat will I learn?\r\n\r\nThe important quantities that describe motion: position, velocity, acceleration\r\nHow to analyse the causes of motion using Newton’s Laws of Motion\r\nWhat the relationship is between force and energy\r\nHow to understand the properties of waves, including a mathematical description\r\nHow to understand sound and light in terms of their wave nature\r\nHow waves overlap and interfere, and how this applies to some musical instruments\r\nWhy a siren changes pitch as it moves past you\r\nThe general properties of electric and magnetic fields\r\nHow to understand the motion of charge as an electric current, and its application in simple circuits\r\nHow to determine the forces on charges and currents from magnetic fields\r\nKey steps in the development of our understanding of light\r\nHow to use the basic principles of reflection and refraction to understand the behaviour of lenses and mirrors\r\nAn insight into the unusual and unexpected properties of light that are simultaneously wave-like and particle-like\r\n\r\nThis course requires approximately 2 - 4 hours of study per week, but can vary depending on the student. This includes watching videos, and taking quizzes and assessments.\r\nIf you pass this course you'll receive a Certificate of Achievement. While this certificate isn't a formal qualification or credit, you can use it to demonstrate your interest in learning about this area to potential employers or educational institutions.\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nResearcher\r\nEngineer\r\nPhysicist\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: MOTION\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: WAVES &amp; SOUND\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: ELECTRICITY &amp; MAGNETISM\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: LIGHT &amp; OPTICS\r\n\r\n\r\n\r\n\n                                    ", "end_date": "2016-02-08T00:00:00Z", "title": "Basic Physics", "price": 0, "instructors": "Dr Wayne Rowlands", "institution_name": ["Swinburne University of Technology"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.open2study.com//node/1765", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Open2Study"], "start_date": "2016-01-11T00:00:00Z"}