{"selfpaced": true, "topic_name": ["Religion"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Humanities\n                                                                                                    &gt; Religion\n                                                            \n                            \n                                                \n                    \n                    \n                    The letters of Paul are the earliest texts in the Christian scriptures, written by a Jew at a time when the word “Christian” hadn’t yet been coined. What is the religious and political context into which they emerged? How were they first interpreted? How and why do they make such an enormous impact in Christian communities and in politics today? Archaeological materials and ancient writings will help you to enter the ancient Mediterranean world and to think about religious groups, power, poverty, health, and the lives of elites and slaves in the Roman Empire. We’ll explore how immediately controversial these letters were, and how these letters are used today to debate relations between Christians and Jews; issues such as love, law, and grace; and topics such as charismatic Christianity, homosexuality, and women’s religious leadership.\r\nArchaeological materials and ancient writings will help you to enter the ancient Mediterranean world and to think about religious groups, power, poverty, health, and the lives of elites and slaves in the Roman Empire. We’ll explore how immediately controversial these letters were, and how these letters are used today to debate relations between Christians and Jews; issues such as love, law, and grace; and topics such as charismatic Christianity, homosexuality, and women’s religious leadership.\r\n \r\nWhether you’ve been studying Paul’s letters for years or are merely curious about what Christian scriptures are, this course will provide you with information to deepen your understanding of the ancient contexts and present-day controversies about these texts.\n\n                                    ", "end_date": null, "title": "HDS1544.1x: Early Christianity: The Letters of Paul", "price": 0, "instructors": "Laura Nasrallah", "institution_name": ["Harvard University"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.edx.org/course/early-christianity-letters-paul-harvardx-hds1544-1x", "duration": null, "language_name": ["English"], "provider_name": ["edX"], "start_date": "2014-01-06T00:00:00Z"}