{"selfpaced": false, "topic_name": ["Religion"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Humanities\n                                                                                                    &gt; Religion\n                                                            \n                            \n                                                \n                    \n                    \n                    Many conflicts in the world today are framed in terms of religion, but there is much discussion and confusion concerning  the precise role religion plays in these conflicts. According to some,  conflict and violence are inherent to religion. Others claim that religion is only the guise under which social, economic or political conflicts are fought out. The first step to solving religiously framed conflicts is understanding the role of religion in them, and that is what this free online course is about.\n\nOur point of departure is that religion means different things in different circumstances and to different (groups of) people. Therefore, the aim of this course is to show how a religiously framed conflict can be studied in the wider cultural and political contexts of these conflicts. In the course material, we will refer to various religious, cultural and political settings. In addition, we invite you to engage in some modest research activities in your own environment and compare your own findings with those of fellow students.\n\nIn the first two weeks, we will discuss how the concepts of religion, conflict and violence have been understood historically and cross-culturally, and address the question of how they are linked. This will enable you to move beyond thinking about religion as either an unavoidable cause for conflicts or merely an excuse to mask more mundane conflicts of interest.\n\nThe third week focuses on the question of why religious conflicts have appeared to increase in the late 20th and early 21st centuries. During the fourth week, we will analyze case studies like conflicts over abortion policies in the United States and the rise of IS in the Middle East. In week five, we will shift our attention to the role of religion in peace building and reconciliation.\n\nThe course concludes with an assignment in which you will apply your newly acquired analytical tools to write a briefing paper on the role of religion in a specific conflict situation of your own choice.\n\nAfter completing this course, you will have acquired the knowledge and analytical skills to develop critical insights into one of the most urgent issues of today’s world: the various roles of religion in conflicts.\n\n\n                                    ", "end_date": "2016-04-18T00:00:00Z", "title": "Religion and Conflict", "price": 0, "instructors": "", "institution_name": ["University of Groningen"], "commitment": "4 hours", "subject_name": ["Humanities"], "course_url": "http://www.futurelearn.com/courses/religion-and-conflict?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-03-07T00:00:00Z"}