{"selfpaced": true, "topic_name": ["Religion"], "description": "\n\n                    \n                    \n                    Tibetan Buddhist Meditation and the Modern World explores the immense variety of meditation practices past and present. We present their histories, their philosophical underpinnings, their transformations in the modern global world, and we give you a chance to reflect upon meditation practices through secular contemplations designed just for this course. \n\nWe use a traditional, if overly simplistic, way of grouping Buddhist philosophical systems and ritual-contemplative practices into “three vehicles”, three programs of theory and practice supporting the personal journey from suffering to enlightenment. This scheme became normative in India and Tibet: (i) the Lesser Vehicle (Hīnayāna), (ii) the Great Vehicle (Mahāyāna), and (iii) the Adamantine Vehicle (Vajrayāna), also referred to as “esoteric Buddhism” or “Buddhist tantra”. To this, we will add a fourth Vehicle which is explicit in many Tibetan materials, though no standard term ever emerged that was accepted by all sectarian traditions - we will thus term it as the “Natural Vehicle” or “Post Tantra”. We follow an indigenous Tibetan tradition in terms of characterizing each with a specific orientational paradigm - repression, refinement, transformation, and natural freedom. These twelve meditative traditions constitute the framework for the course’s discussion of the main streams of Tibetan Buddhist meditation.\n\nThe five modules of the present course, dedicated to \"Lesser Vehicle\" practices and perspectives, treat the first five of these twelve types. Each module in turn has four components: (i) the specific Buddhist meditation in its traditional presentation and practice; (ii) modern scientific research into its efficacy and dynamics, or on practices, principles, and processes related to this type of meditation in our analysis; (iii) the fact, problems, and opportunities of modern secular adaptations in a variety of educational, professional, and personal settings; and (iv) secular practices for experimentation, which are either direct adaptations or new practices designed to give an experiential sense of some of the principles underlying the Buddhist meditative practice.\n\n                                            Syllabus\n                        Course IntroductionThe Content, Structure, and Instructors of the Course. This class is the first in a four part series on Buddhism.  The other classes will focus on the Greater Vehicle, Adamantine Vehicle, and Natural Vehicle.Ordinary Preliminary PracticesTibetan perspectives on the foundations of contemplative practice; early Buddhist meditations; the beginnings of Western Buddhist meditation; and an introduction to the science of meditation. Includes lectures by Dr. Clifford Saron, Khenpo Tsultrim Lodro, and Tsoknyi Rinpoche, as well as an interview with David McMahan. Contemplative labs with Anne Klein and Anam ThubtenMindfulness Meditation (smṛti)An introduction to Mindfulness meditation practice and the contemporary Mindfulness-Based Stress Reduction (MBSR). Includes lectures by Dr. Clifford Saron, Khenpo Tsultrim Lodro, and Tsoknyi Rinpoche, as well as an interview with Jim Coan. Contemplative labs with Anne Klein, Anam Thubten, and Susan Bauer-Wu.Calm Meditation An introduction to Calm meditation and its use in contemporary research environments. Includes lectures by Dr. Clifford Saron and Khenpo Tsultrim Lodro, as well as an interview with Tish Jennings. Contemplative labs with Anne Klein, Anam Thubten, and Susan Bauer-WuInsight MeditationAn introduction to Insight meditation and its use in the contemporary development of contemplative pedagogy. Includes lectures by Dr. Clifford Saron, Khenpo Tsultrim Lodro, and Tsoknyi Rinpoche, as well as interviews with Rhonda Magee, Erik Braun, and David Mick. Contemplative labs with Anne Klein, Anam Thubten, and Susan Bauer-WuThe Diverse Objects of Early Buddhist MeditationAn introduction to the diverse objects of early Buddhist meditation. Includes lectures by Dr. Clifford Saron and Khenpo Tsultrim Lodro, as well as an interview with Sharon Salzberg. Contemplative labs with Anne Klein, Anam Thubten, and Susan Bauer-Wu\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Tibetan Buddhist Meditation and the Modern World: Lesser Vehicle", "price": 0, "instructors": "Kurtis Schaeffer and David Germano", "institution_name": ["University of Virginia"], "commitment": "4-6 hours", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/buddhist-meditation", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}