{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">This course will guide you through two exciting elements of design: the SketchUp 3D modeling program and the interior design principles that have allowed the instructor and interior designer, <strong style=\"\">Rebecca <span style=\"\">Robeson</span>,</strong> to create award-winning bedrooms.</p><p style=\"\">If you&#039;re interested in interior design, even if it&#039;s just to improve the way your home flows and feels, this fun course will show you how to apply basic design techniques that will make your home look like it was professionally designed.</p><p style=\"\"><strong style=\"\">Master Basic Interior Design Principles You Can Easily Apply</strong></p><ul style=\"\"><li style=\"\">Create a virtual model of a sample bedroom using SketchUp</li><li style=\"\">Learn how to properly arrange furniture to make the most of a bedroom space</li><li style=\"\">Choose the best paint colors, accessories, and lighting for a bedroom<strong style=\"\"></strong></li></ul><p style=\"\"><strong style=\"\">Use the SketchUp 3D Modeling Program to Design the Perfect Bedroom</strong></p><p style=\"\">Whether you&#039;re an interior designer, someone who&#039;s interested in interior design, or someone who simply wants to make their home look its best, this course will show you how to download and use the easy-to-learn interior design program, SketchUp, to design a samplebedroom.</p><p style=\"\">Once you&#039;re comfortable designing this sample bedroom, you can then use the same principles to create your own dream bedroom as well as other rooms throughout your home. <strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Contents and Overview</strong> </p><p style=\"\">The first half of this course will focus on how to use SketchUp. </p><p style=\"\">You&#039;ll download it, set up your toolbar, and create the walls of your room. You&#039;ll also master the paint tool, as well as the doors, windows, and component library. </p><p style=\"\">Once the room is set up as a 3D model, you can move on to the second half of the course, which focuses on decorating a bedroom virtually before tackling it in the real world.</p><p style=\"\">You&#039;ll begin with furniture placement so you can set every piece of furniture, from your bed to your nightstand, in its optimal place. This includes choosing the right wall that your bed should be placed against.</p><p style=\"\">A great design also encompasses the right wall colors and artwork, so you&#039;ll tackle how to select the best wall colors, and you&#039;ll understand the role that art plays in your design so you can choose the right pieces to display. </p><p style=\"\">Accessories and lighting, as well as area rugs and window treatments, will serve to complete the look of your sample bedroom and bring everything together, so you&#039;ll learn how to find complementary décor and where to place it.</p><p style=\"\">By the end of this course, you&#039;ll know how to use SketchUp to create customized designs for every room in your home, not just your bedroom. <strong style=\"\">You will be ready to move on to the next level by creating your own completely scaled bedroom, providing you the opportunity to design your own virtual reality dream bedroom. </strong></p><p style=\"\">You&#039;ll even be invited to post screenshots of your design on the <span style=\"\">Robeson</span> Design Facebook page to show off your new skills.</p>", 
    "end_date": null, 
    "title": "Design your Room Using Sketchup", 
    "price": "20.00", 
    "instructors": "Rebecca Robeson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507172_7793_3.jpg", 
    "course_url": "https://www.udemy.com/robesoninteriordesign/", 
    "currency": "USD", 
    "subject_name": [
        "Interior Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T14:34:19Z"
}