{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Un nuevo espacio no tiene porque ser costoso ni mucho menos traumático. Los cambios son necesarios y mucho más si se trata de nuestro espacio ideal, aquel donde hacemos vida, donde logramos nuestros sueños y compartimos con nuestros seres queridos. </p><p style=\"\">En este video curso compartiremos los conceptos básicos necesarios para emprender el proyecto, hablaremos de presupuestos, de estilos, de tendencias e incluso de herramientas para que puedas hacer todos los ensayos que quieras.</p><p style=\"\">Si deseas realizar un cambio en tus espacios, poder administrar tu presupuesto, conversar y entenderte con arquitectos y contratistas de obras y sentirte feliz con tu nuevo espacio este curso definitivamente es para ti. De igual modo si eres estudiante de arquitectura o diseño de interiores y si lo deseas puedes solicitarnos un cupón de descuento especial para estudiantes.</p><p style=\"\">Este curso podrás realizarlo en un par de semanas, ya verás que términos que parecen complejos te parecerán muy sencillos, de igual modo, tendrás mi acompañamiento a lo largo del mismo. </p><p style=\"\">Compartiremos durante 8 video capítulos diversos conceptos los cuales son reforzados con enlaces a videos existentes en la web que ejemplifican cada clase.</p><p style=\"\">Soy la Arquitecto Liliana Barrios y junto contigo quiero decir &quot;logré tener Mi Espacio Ideal&quot;.</p>", 
    "end_date": null, 
    "title": "Diseñando mi espacio ideal", 
    "price": "35.00", 
    "instructors": "Liliana Barrios", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495204_f09c_2.jpg", 
    "course_url": "https://www.udemy.com/disenando-mi-espacio-ideal/", 
    "currency": "USD", 
    "subject_name": [
        "Interior Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-06T17:59:21Z"
}