{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tIn this 90-minute interview-style course, Feng Shui experts Nicolette Vajtay and Carol Olmstead teach you how to enhance the Career area (Gua) of your home and office to exponentially grow your business and bring more flow into your life.  </p>  <p>  \tNicolette and Carol explain the Feng Shui Bagua, then give you specific information about rearranging the Career area in your home and office so you may welcome new opportunities and allow miracles to flow into your life. You’ll learn how to enhance the Career area in your home and workspace to raise your chi and attract new opportunities and connections.  </p>  <p>  \tAfter taking this class, you’ll know how to identify what’s holding you back and restricting your ability to move forward. More importantly, you’ll have the Feng Shui tools to adjust, deflect, or remove the restrictions from your space and rearrange your office for career and life success.  </p>  <p>  \tThe Career area represents the work we do in this world, and you’ll learn the Feng Shui adjustments, cures, and tips that can better connect you with your passion and purpose, so you can move that vision out into the world.  </p>  <p>  \tAs you watch Nicolette and Carol complete a hands-on office transformation, you’ll learn specific Feng Shui principles for a business, including desk placement, lighting, the use of plants, clutter clearing, and placement of artwork to enhance your space. You’ll come away with Feng Shui skills you may use immediately to create a workspace that helps your business grow, flourish, and succeed.  </p>  <p>  \tEven if you don’t run a business, the Career sector affects your life journey, so if you feel stuck and want to move forward this course is for you! Similar to what acupuncture does for your body, Feng Shui for your home unblocks your stuck energy, known as chi. When the chi around you is blocked, your opportunities are blocked and you feel stuck in your career, depleted in your health, or angry about your life circumstance. However, just like acupuncture unblocks stuck chi in your body and restores health, Feng Shui for your Career Gua and office removes stuck energy and restores your business to a state of health and vitality.  </p>", 
    "end_date": null, 
    "title": "Grow Your Business with Feng Shui", 
    "price": "35.00", 
    "instructors": "Nicolette Vajtay, Carol M. Olmstead", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235272_6ae5_3.jpg", 
    "course_url": "https://www.udemy.com/grow-your-business-with-feng-shui/", 
    "currency": "USD", 
    "subject_name": [
        "Interior Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T01:05:02Z"
}