{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Do you need to add some digital modeling skills to your toolbag of design tools but are concerned about the time and expense of mastering a program? SketchUp has a low learning curve but produces incredible results. It&#039;s easy enough that they teach it in elementary schools, but powerful enough to be utilized by most architecture and design firms. I focus on teaching the most efficient way to use SketchUp and the most important tools for you to quickly add SketchUp to your workflow for designing and presenting interiors to your clients…or for your own home.</p><p style=\"\"><strong style=\"\">Quickly Learn the Best SketchUp Tools for Modeling Your Home</strong></p><p style=\"\"><strong style=\"\">Part 1 </strong>covers the basics of SketchUp and best use practices for all its tools</p><p style=\"\">Step-by-step projects include:</p> <ul style=\"\"><li style=\"\">A seris of mini-projects to learn all the basic tools</li> <li style=\"\">Building a simple cabin from a hand-drawn floorplan</li> <li style=\"\">Importing and placing components from the 3D Warehouse</li> <li style=\"\">Learning the basics of applying materials</li></ul> <p style=\"\">After this initial section, you&#039;ll have a solid grounding in SketchUp to begin creating some simple models.</p><p style=\"\"><strong style=\"\">Part 2 </strong>refines<strong style=\"\"> </strong>your skills by working on a condo model.</p><p style=\"\">You&#039;ll learn:</p> <ul style=\"\"><li style=\"\">Creating a building from a floorplan</li> <li style=\"\">Working with groups, layers, and scenes as your model becomes more complex</li> <li style=\"\">Other resources for finding and creating custom materials</li> <li style=\"\">Working with dynamic components</li> <li style=\"\">Using shadows and styles to improve how SketchUp displays</li> <li style=\"\">Utilizing the FollowMe Tool to create complex geometry such as crown moldings</li> <li style=\"\">Basic kitchen layout</li> <li style=\"\">Creating Sections, Elevations, and simple dimensioned drawings</li> <li style=\"\">Exporting Images</li></ul> <p style=\"\">By the end of the series, you&#039;ll be comfortable creating detailed interiors in SketchUp and you&#039;ll have learned to enjoy drawing with SketchUp!</p><p style=\"\"><strong style=\"\">SketchUp is an Easy-to-learn yet Powerful Tool that still is Incredibly Fun to Use.</strong></p><p style=\"\">This course has 35 lessons and 6.5 hours of content. It includes an 85 page manual that we follow step-by-step throughout the course that you can refer to later. You can watch the lessons over and over until you master each.</p><p style=\"\">By the end, you will confidently be able to create whatever you like with SketchUp. This class provides a great overview of how to use SketchUp efficiently, and provides extra specific information relevant to interiors, such as importing real materials, kitchen design, and creating final images for clients.<strong style=\"\"> </strong>I teach SketchUp is a series of small projects adding skills in each one. I start with a general overview using the basic skills, move on to a small cabin, and then create a condo from a floorplan. Since I&#039;ve taught this class to hundreds of students, I know the questions that will arise and the problems you might have, and I&#039;ve tried to proactively answer them in the course. </p><p style=\"\">SketchUp is a design language that you and you customers can understand. With HGTV a permanent fixture in the mind and expectations of clients, you need to master a program that will help communicate and convince your clients of your design solutions.  If you&#039;re searching for a job in the design field, you&#039;ll find many positions require you to have a familiarity with SketchUp.  SketchUp is an easy-to-learn and affordable software that still is a powerful design tool to utilize in investigating possible solutions to a design problem.</p>", 
    "end_date": null, 
    "title": "SketchUp BootCamp:  Creating Interiors with SketchUp", 
    "price": "50.00", 
    "instructors": "Diane Dieterich", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529180_3406_3.jpg", 
    "course_url": "https://www.udemy.com/sketchup-bootcamp-creating-interiors-with-sketchup/", 
    "currency": "USD", 
    "subject_name": [
        "Interior Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T04:09:55Z"
}