{"selfpaced": false, "topic_name": ["Biology"], "description": "\n\n                    \n                    \n                    Biochemistry brings together all of the sciences to study the chemical and physical processes that occur in living organisms. It truly is the science of life.\n\nAs a scientific discipline in its own right, biochemistry has a major impact on all areas of the life sciences and biochemists are in high demand among employers.\n\nGet an introduction to biochemistry\n\nThis free online biochemistry course will outline the background and history of the field, and its contemporary significance in the life sciences. It’s ideal if you enjoy biology and chemistry at school, and are thinking about studying or working in biochemistry as a distinct subject.\n\nBy the end of the course, you will be able to:\n\n\n  discuss how biochemistry brings together the natural sciences, to describe the chemical basis of living systems;\n  describe the events and scientists that have been significant during the historical development of biochemistry;\n  describe the seminal experiments that led to significant advances in biochemical knowledge;\n  discuss where biochemistry will play a role in future scientific advances, such as bioenergy, pharmaceuticals and synthetic biology.\n  recognise the wide range of jobs and career opportunities that become possible as a biochemistry graduate.\n\n\nLearn with expert biochemists from UEA and beyond\n\nThroughout the course, you will learn with a range of staff from UEA’s Schools of Biological Sciences and Chemistry, and find out how biochemistry is underpinning developments in the life sciences at the Norwich Research Park (NRP), and Norfolk and Norwich University Hospital. You will also get the chance to see interviews with people using biochemistry in a wide range of careers.\n\n\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Biochemistry: the Molecules of Life", "price": 0, "instructors": "Richard Bowater", "institution_name": ["University of East Anglia"], "commitment": "", "subject_name": ["Science"], "course_url": "http://www.futurelearn.com/courses/biochemistry?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-06-20T00:00:00Z"}