{"selfpaced": false, "topic_name": ["Biology"], "description": "\n\n                    \n                    \n                    Most people know that electrically active cells in nerves, in the heart and in the brain generate electrical currents, and that somehow these result in measurements we all have heard about, such as the electrocardiogram.  But how?  That is, what is it that happens within the electrically active tissue that leads to the creation of currents and voltages in their surroundings that reflect the excitation sequences timing, and condition of the underlying tissue.  This course explores that topic.  Rather than being a primer on how to interpret waveforms of any kind in terms of normality or disease, the goal here is to provide insight into how the mechanism of origin actually works, and to do so with simple examples that are readily pictured with simple sketches and one’s imagination, and then moving forward into comparison with experiments and finding outcomes quantitatively.\n\n                                            Syllabus\n                        Week 1A brief history of extracellular measurements, and an example of such a recording.  The goal is to understand the amplitudes and time variation of such measurements, as well as learn about some interesting and useful historical events.Week 2 A presentation of the cylindrical fiber model of a nerve.  The goal is to see how this geometrically simple model of a nerve actually is sufficient to explain complex bioelectric events within and around electrically active tissue.  One learns that currents are driven forward by voltages across cell membranes,.  Current loops are created, with some parts of the current loop inside and other parts outside the active cells.  Electrical potentials are created by the current loops, and are positive when these are approaching, negative when they are receding.   In so doing they form the basis of all extracellular wave forms.Week 3Notable and useful aspects of extracellular wave forms are their changes in shape.  What causes such changes?  Two illuminating examples are studied, one that does not, and then another that does.Week 4Weeks 1 to 3 present some intriguing concepts and explain them with drawings and sketches. Do the wave forms so drawn have any connection with real tissue?  Indeed they do.  The goal of this week is to examine some specific experimental wave forms that were measured in cardiac Punkinje fibers, and to compare them those anticipated in earlier weeks.Week 4 is the end of the standard course.  The remaining weeks are for honors study.Week 5The concepts of week 3 give insight, but there is power in equations and numbers.  The goal of week 5 is to show how the models of week 3 can be represented quantitatively, so that one can go beyond asking “What?” and ask “How much?”  With equations available, the lectures and questions for this week focus on finding specific numerical results for several examples.Week 6This week’s goal is to introduce the concept and the mathematical definition of dipole sources.  Such sources pair a current source and current sink, separated in a specific orientation by a small distance.  A dipole model allows easy evaluation of many electrode configurations, such as the widely used “bipolar” configuration, often used experimentally to determine the timing of excitation.  More extensive models also allow consideration of action potential repolarization (return to resting potentials) as well as excitation.Week 7As a conclusion to the course, two diverse subjects are considered.  One, the multipole expansion, is used when one has no model of the true origin of observed potentials but still needs to create an “equivalent” model to represent the data.  The other, cardiac excitation, is characterized by large, broad excitation waves.  One sees that an equation for the extracellular potentials has the same components as the expression for a simple cylindrical fiber, translated into a geometrically suitable form.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Bioelectricity:  The Mechanism of Origin of Extracellular Potentials", "price": 0, "instructors": "Roger Barr", "institution_name": ["Duke University"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/extracellular-potentials", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}