{"selfpaced": false, "topic_name": ["Biology"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/molevol\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/molevol-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    molevol-001\n                                                                    molevol-002\n                                                                    molevol-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    This course is about molecular evolution - the evolution of DNA, RNA, and protein molecules. The focus is on computational methods for inferring phylogenetic trees from sequence data, and the course will give an introduction to the fundamental theory and algorithms, while also giving the student hands-on experience with some widely used software tools. Since evolutionary theory is the conceptual foundation of biology (in the words of Theodosius Dobzhansky: \"Nothing in biology makes sense except in the light of evolution\"), what you learn on this course will be relevant for any project you will ever do inside the life sciences. A phylogenetic tree will almost always help you think more clearly about your biological problem. A special emphasis is put on methods that employ explicit models of the evolutionary process (maximum likelihood and Bayesian approaches), and we will explore the role of statistical modeling in molecular evolution, and in science more generally. A mathematical (statistical) model of a biological system can be considered to be a stringently phrased hypothesis about that system, and this way of thinking about models will often be helpful. In addition to model-based methods, you will also learn about other approaches, such as those based on parsimony and genetic distance (e.g., neighbor joining). Often, the evolutionary tree is the result we are interested in - knowing how a set of sequences (or organisms) are related can provide us with important information about the biological problem we are  investigating. For instance, knowing which organisms are most closely related to a newly identified, uncharacterized, pathogenic bacterium will allow you to infer many aspects of its lifestyle, thereby giving you important clues about how to fight it. In other cases, however, inferring the structure of the tree is not the goal: for instance, our main focus may instead be the detection of positions in a protein undergoing positive selection (indicating adaptation) or negative selection (indicating conserved functional importance). However, even in these cases, the underlying phylogenetic tree will be an important part of our hypothesis about (model of) how the proteins have been evolving, and will help in getting the correct answer. Although the study of molecular evolution does require a certain level of mathematical understanding, this course has been designed to be accessible also for students with limited computational background (e.g., students of biology).Topics covered:Brief introduction to evolutionary theory and population genetics.Mechanisms of molecular evolution.Models of substitution.Reconstruction of phylogenetic trees using parsimony, distance based methods, maximum likelihood, and Bayesian techniques.Advanced models of nucleotide substitution (gamma-distributed mutation rates, codon models and analysis of selective pressure).Statistical analysis of biological hypotheses (likelihood ratio tests, Akaike Information Criterion, Bayesian statistics).\n\n                                            Syllabus\n                        Module 1:   Introduction to evolutionary theory and population genetics: models of growth, selection and mutationModule 2:   Neutral mutations and genetic drift. Tree reconstruction by parsimonyModule 3:   Consensus trees. Distance matrix methodsModule 4:   Models of sequence evolution. Likelihood methodsModule 5:   Bayesian inference of phylogenyModule 6:   Testing hypotheses in a phylogenetic context\n                                    ", "end_date": "2014-02-24T00:00:00Z", "title": "Computational Molecular Evolution", "price": 0, "instructors": "Anders Gorm Pedersen", "institution_name": ["Technical University of Denmark (DTU)"], "commitment": "7-9 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/course/molevol", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-01-13T00:00:00Z"}