{"selfpaced": false, "topic_name": ["Biology"], "description": "\n\n                    \n                    \n                    An introduction to dynamical modeling techniques used in contemporary Systems Biology research.\n\nWe take a case-based approach to teach contemporary mathematical modeling\ntechniques. The course is appropriate for advanced undergraduates and beginning graduate students. Lectures provide biological background and describe the development of both classical mathematical models and more recent representations of biological processes. The course will be useful for students who plan to use experimental techniques as their approach in the laboratory and employ computational modeling as a tool to draw deeper understanding of experiments. The course should also be valuable as an introductory overview for students planning to conduct original research in modeling biological systems.\n\nThis course focuses on dynamical modeling techniques used in Systems Biology research.  These techniques are based on biological mechanisms, and simulations with these models generate predictions that can subsequently be tested experimentally. These testable predictions frequently provide novel insight into biological processes. The approaches taught here can be grouped into the following categories: 1) ordinary differential equation-based models, 2) partial differential equation-based models, and 3) stochastic models.\n\n                                            Syllabus\n                        Introduction | Computing with MATLABThe description goes hereIntroduction to Dynamical SystemsThe description goes hereBistability in Biochemical Signaling ModelsThe description goes hereComputational Modeling of the Cell CycleThe description goes hereModeling Electrical SignalingThe description goes hereModeling with Partial Differential EquationsThe description goes hereStochastic ModelingThe description goes here\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Dynamical Modeling Methods for Systems Biology", "price": 0, "instructors": "Eric Sobie", "institution_name": ["Icahn School of Medicine at Mount Sinai"], "commitment": "8-10 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/dynamical-modeling", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-23T00:00:00Z"}