{"selfpaced": true, "topic_name": ["Biology"], "description": "\n\n                    \n                    \n                    Imagine if there were an organ in your body that weighed as much as your brain, that affected your health, your weight, and even your behavior. Wouldn’t you want to know more about it? There is such an organ — the collection of microbes in and on your body, your human microbiome.\n\n                                            Syllabus\n                        Introduction to Microbes and the Human MicrobiomeWelcome Citizen Scientists! We're very pleased to have you join us on an exploration of the human microbiome. This is a fascinating area of study, and we hope you will find this six-module course worthwhile. Each module's content will be presented in similar fashion; our team will introduce topics by way of pre-recorded video lectures interspersed with guest interviews by subject matter experts. Module 1 will provide a broad overview about microbes and their diversity on earth and in the human body.Studying the MicrobiomeIn this module, we will dive into the fundamentals of how we study the human microbiome. We highlight recent advances in microbiome research methods and take you on a tour of the Knight lab. Please keep in mind, that Modules 2 and 3 are meant to provide a glimpse into our world of data generation and analysis. Modules 4, 5, and 6 will be less technical and provide a broad overview of fascinating research on the human microbiome. Stick with us!   Making Sense Out of Microbial DataThis module highlights the basics of generating and analyzing microbiome data. We will also discuss how computational scientists are revolutionizing the development of tools for analyzing large, complex biological data sets and show you some of the cool ways that we visualize data! This module will help you understand data plots in later modules, but do not get discouraged if the material here is too technical, a full understanding is not required to complete the course! The Human Gut Microbiome and Your HealthNow that we've given you some background about the methods we use to analyze microbial data, it's time for us to talk more about recent discoveries in microbiome research. This module will focus on the main factors impacting the gut microbiota as well as the influence of the gut microbiota on nutrition and gut health. This is the fun part, so get excited!Gut Microbe-Host Interactions: Beyond NutritionYou're more than halfway through the course! We hope you've been learning lots of new, exciting things about the human gut microbiota! In this module, we'll shift the focus from nutrition and gut health to the rest of your body. How do your gut microbes and your immune system interact? What about your nervous system? Does the gut microbiota play a role in allergies and stress? What's in the American GutWe will wrap up the course in this module by discussing what's in the American Gut. Rob will walk us through results from the American Gut Project and compare results from Jeff Leach and Michael Pollan. We will also hear from Michael Pollan on the importance of microbiome research and how it has changed the way he thinks about his health and what he eats.  \n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Gut Check: Exploring Your Microbiome", "price": 0, "instructors": "Rob Knight, Jessica Metcalf and Katherine Amato", "institution_name": ["University of Colorado Boulder"], "commitment": "3-5 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/microbiome", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}