{"selfpaced": false, "topic_name": ["Biology"], "description": "\n\n                    \n                    \n                    Do you have questions about sex hormones or menstrual cycles?  This is a crash-course in human reproductive health through fact and biology-based information on a variety of topics.  \"Sex 101\" will cover reproductive anatomy, key biological changes during puberty, sexual biology and contraceptive methods, reproductive disorders, and a special introduction to the exciting field of Oncofertility.  Specific lecture titles are as follows:  1) Reproductive Anatomy &amp; Hormones, 2) Menstrual Cycle, Oocyte Maturation, &amp; Sperm Activation, 3) Sexual Biology, Fertilization, &amp; Contraception, and 4) Reproductive Health &amp; Disorders.\n \nThe objective of this course is to ensure you understand reproductive health and not confuse reproduction with sex (or having sex).  This course was designed with you in mind, and is aimed at providing you with quality information that is meaningful to you and that may be hard to find otherwise.  Reproductive health is an area of knowledge that needs to be demystified.  We have designed this course for you to examine reproduction through a biological and scientific lens addressing these issues in a comfortable and interactive format that will lead to a better understanding of holistic health, long-term.\n\n                                            Syllabus\n                        Anatomy, Development, and HormonesThis module focuses on learning, identifying, and labeling all parts of male and female reproductive anatomy and the function of hormones on development. COURSE GOAL 1: Students will be able to label and analyze the basic functionality of all parts of male and female reproductive anatomy, conceptualize the role of hormones in the interactions between the brain, pituitary, and reproductive tract, and examine the basic functionality of the hormones involved during development and puberty.Menstruation, Oocyte Maturation, and Sperm ActivationThis module articulates the hormonal implications of the menstruation cycle and sperm activation as it relates to both reproductive health and overall health. COURSE GOAL 2: Students will be able to conceptualize the hormonal implications of the menstruation cycle, oocyte maturation, and sperm activation as it relates to both reproductive health and overall health, analyze how the hormones of the pituitary relate to target tissues, examine the mechanisms behind oocyte maturation and meiosis, and illustrate how sperm development leads to modal function.Sex, Sexuality, and ContraceptionThis module outlines the scientific foundations of contraception beyond social norms. COURSE GOAL 3: Students will be able to classify the scientific foundations of male and female sexual biology and contrast differing contraception options through the lens of reproductive function and beyond social norms.Reproductive Health ConcernsThis module spotlights the possibility of infertility in the human body and provides an in-depth understanding upon the biology behind infertility, endometriosis, reproductive diseases, and oncofertility. COURSE GOAL 4: Students will be able to identify the possible causes of infertility in the human body, analyze the effects of reproductive tract disorders, recognize the risks and symptoms of sexually transmitted diseases, and discuss the field of oncofertility in relation to sexual and holistic health.\n                                    ", "end_date": "2015-10-26T00:00:00Z", "title": "Introduction to Reproduction", "price": 0, "instructors": "Teresa K. Woodruff, Ph.D.", "institution_name": ["Northwestern University"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/reproductive-health", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-09-28T00:00:00Z"}