{"selfpaced": false, "topic_name": ["Biology"], "description": "\n\n                    \n                    \n                    An introduction to data integration and statistical methods used in contemporary Systems Biology, Bioinformatics and Systems Pharmacology research. The course covers methods to process raw data from genome-wide mRNA expression studies (microarrays and RNA-seq) including data normalization, differential expression, clustering, enrichment analysis and network construction. The course contains practical tutorials for using tools and setting up pipelines, but it also covers the mathematics behind the methods applied within the tools. The course is mostly appropriate for beginning graduate students and advanced undergraduates majoring in fields such as biology, math, physics, chemistry, computer science, biomedical and electrical engineering. The course should be useful for researchers who encounter large datasets in their own research. The course presents software tools developed by the Ma’ayan Laboratory (http://icahn.mssm.edu/research/labs/maayan-laboratory) from the Icahn School of Medicine at Mount Sinai, but also other freely available data analysis and visualization tools. The ultimate aim of the course is to enable participants to utilize the methods presented in this course for analyzing their own data for their own projects. For those participants that do not work in the field, the course introduces the current research challenges faced in the field of computational systems biology.\n\n                                            Syllabus\n                        Course Overview and IntroductionsThe 'Introduction to Complex Systems' module discusses complex systems and leads to the idea that a cell can be considered a complex system or a complex agent living in a complex environment just like us. The 'Introduction to Biology for Engineers' module provides an introduction to some central topics in cell and molecular biology for those who do not have the background in the field. This is not a comprehensive coverage of cell and molecular biology. The goal is to provide an entry point to motivate those who are interested in this field, coming from other disciplines, to begin studying biology.Topological and Network Evolution ModelsIn the 'Topological and Network Evolution Models' module, we provide several lectures about a historical perspective of network analysis in systems biology. The focus is on in-silico network evolution models. These are simple computational models that, based of few rules, can create networks that have a similar topology to the molecular networks observed in biological systems. Types of Biological NetworksThe 'Types of Biological Networks' module is about the various types of networks that are typically constructed and analyzed in systems biology and systems pharmacology. This lecture ends with the idea of functional association networks (FANs). Following this lecture are lectures that discuss how to construct FANs and how to use these networks for analyzing gene lists.  Data Processing and Identifying Differentially Expressed GenesThis set of lectures in the 'Data Processing and Identifying Differentially Expressed Genes' module first discusses data normalization methods, and then several lectures are devoted to explaining the problem of identifying differentially expressed genes with the focus on understanding the inner workings of a new method developed by the Ma'ayan Laboratory called the Characteristic Direction. Gene Set Enrichment and Network AnalysesIn the 'Gene Set Enrichment and Network Analyses' module the emphasis is on tools developed by the Ma'ayan Laboratory to analyze gene sets. Several tools will be discussed including: Enrichr, GEO2Enrichr, Expression2Kinases and DrugPairSeeker. In addition, one lecture will be devoted to a method we call enrichment vector clustering we developed, and two lectures will describe the popular gene set enrichment analysis (GSEA) method and an improved method we developed called principal angle enrichment analysis (PAEA).Deep Sequencing Data Processing and AnalysisA set of lectures in the 'Deep Sequencing Data Processing and Analysis' module will cover the basic steps and popular pipelines to analyze RNA-seq and ChIP-seq data going from the raw data to gene lists to figures. These lectures also cover UNIX/Linux commands and some programming elements of R, a popular freely available statistical software. Note that since these lectures were developed and recorded during the Fall of 2013, it is possible that there are better tools that should be used now since the field is rapidly advancing.  Principal Component Analysis, Self-Organizing Maps, Network-Based Clustering and Hierarchical ClusteringThis module is devoted to various method of clustering: principal component analysis, self-organizing maps, network-based clustering and hierarchical clustering. The theory behind these methods of analysis are covered in detail, and this is followed by some practical demonstration of the methods for applications using R and MATLAB.Resources for Data IntegrationThe lectures in the 'Resources for Data Integration' module are about the various types of networks that are typically constructed and analyzed in systems biology and systems pharmacology. These lectures start with the idea of functional association networks (FANs). Following this lecture are several lectures that discuss how to construct FANs from various resources and how to use these networks for analyzing gene lists as well as to construct a puzzle that can be used to connect genomic data with phenotypic data. Crowdsourcing: Microtasks and MegatasksThe final set of lectures presents the idea of crowdsourcing. MOOCs provide the opportunity to work together on projects that are difficult to complete alone (microtasks) or compete for implementing the best algorithms to solve hard problems (megatasks). You will have the opportunity to participate in various crowdsourcing projects: microtasks and megatasks. These projects are designed specifically for this course.Final ExamThe final exam consists of multiple choice questions from topics covered in all of modules of the course. Some of the questions may require you to perform some of the analysis methods you learned throughout the course on new datasets. \n                                    ", "end_date": "2016-08-29T00:00:00Z", "title": "Network Analysis in Systems Biology", "price": 0, "instructors": "Avi Ma'ayan", "institution_name": ["Icahn School of Medicine at Mount Sinai"], "commitment": "6-8 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/network-biology", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}