{"selfpaced": false, "topic_name": ["Biology"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    pcd-001\n                                                                    pcd-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    In this\ncourse, you will learn about the conserved, molecular machinery that eliminates\ncells through programmed cell death type I, also referred to as ‘apoptosis’.\nThrough apoptosis many cells are eliminated from our body during development\nand throughout adult life, and deregulated apoptosis can lead to various\ndiseases such as cancer and auto-immune diseases. Rather than just telling you\nabout the molecular machinery of apoptosis and how it works to kill cells, I\nwill walk you through and discuss with you the critical experiments that led to\nthe discovery of the key components of this molecular machinery and the\nmechanisms through which they function. I will also\ndiscuss how apoptosis research can help to develop novel therapeutics\nand consider the questions that remain open in\nthe field.The course\nwill cover the following topics:\n\n1.     \nIntroduction\nto programmed cell death and apoptosis\n\n2.     \nThe\nBCL-2 family of proteins\n\n3.     \nApaf\nproteins\n\n4.     \nCaspases\n\n5.     \nMechanisms\nthat regulate apoptosis\n\n6.     \nNon-apoptotic\nfunctions of components of the central apoptosis machinery\n\n7.     \nDiseases\ncaused by deregulated apoptosis\n\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Programmed cell death", "price": 0, "instructors": "Barbara Conradt", "institution_name": ["Ludwig-Maximilians-Universität München"], "commitment": "2-4 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/course/pcd", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-06-23T00:00:00Z"}