{"selfpaced": false, "topic_name": ["Information Technology"], "description": "\n\n                    \n                    \n                    La complejidad de los problemas emanados de una rápida globalización de la economía así como  los grandes avances en la tecnología de la información (TI) han acelerado la aparición de sucesivas crisis económicas y sociales en las que tanto gobiernos de muchos países como empresas encuentran dificultades para adaptarse a esta nueva situación  y cambiar con agilidad sus modelos de  gobierno y gestión.\nPor otro lado la agresión al medio ambiente y el cambio climático  y  la necesidad de atender los requerimientos  de agentes económicos y sociales reclaman su derecho a desempeñar el rol que les corresponde. Emergen tendencias como la Responsabilidad Social Corporativa, vinculada a procesos de reporte estandarizado, como el que marca Global Reporting Initiative (GRI) y a mejoras en los esquemas de Gobernanza Corporativa, necesarias para armonizar los distintos ecosistemas tanto sociales como empresariales y ambientales garantizando la legítima participación de todas las partes interesadas y equiparando la información generada a la financiera a la hora de tomar decisiones.\nEn este escenario, los activos utilizados tanto por gobiernos como empresas para desarrollar deben ser administrados de manera eficaz y eficiente para incrementar el valor de las organizaciones de manera incremental y continua garantizando principalmente  la sostenibilidad económico financiera de esas organizaciones. Dentro de esos activos, la información y la TI adquieren valor importantísimo para facilitar  las necesidades de transformación de las organizaciones y, especialmente gobernar y gestionar el uso adecuado de la TI tal como señala la norma ISO/IECE 38500.\nEn cualquier caso, la implantación de éstas  tecnologías requiere un cambio profundo en la cultura de las organizaciones, públicas y privadas y la adopción de principios y políticas internas que impidan posibles perjuicios a todas las partes interesadas en el éxito de dichas organizaciones.\nLa aplicación de las distintas normas mencionadas así como  renovación del concepto de Gobernanza Corporativa aplicada a los distintos activos y especialmente a la TI (dirección y control en el uso y gestión de los mismos) es uno de los grandes retos a los que se enfrenta hoy el mundo económico financiero así como la generación de conocimiento e inteligencia para resolver los graves problemas de nuestros días y en el futuro. Esta nueva forma de trabajar hará que las empresas sean más responsables, comprometidas, humanas,  productivas, y más eficaces y eficientes en el liderazgo, formación y aptitud personal así como un uso adecuado de la TI por parte de la organización.\n\n                                    ", "end_date": "2015-08-04T00:00:00Z", "title": "B1156​x: Responsabilidad Social Corporativa y su impacto sobre la Gestión de la Tecnología de la Información", "price": 0, "instructors": "Antonio Fernández Martínez and José Carrillo", "institution_name": ["Open Education Consortium (OEC)"], "commitment": "6 hours", "subject_name": ["Computer Science"], "course_url": "https://www.edx.org/course/responsabilidad-social-corporativa-y-su-oecx-b1156-x", "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["edX"], "start_date": "2015-07-07T00:00:00Z"}