{"selfpaced": true, "topic_name": ["Information Technology"], "description": "\n\n                    \n                    \n                    The internet is now part of our daily life and is accessible on any device. People have become used to the speed and simplicity of consumer apps, and so business users expect the same simplicity from our business software.\r\nSAP Fiori is our new user experience (UX) for SAP software. By applying modern design principles, it completely reinvents the user experience. When combined with the power of the SAP HANA platform, the SAP Fiori UX delivers unmatched responsiveness. Personalized and role-based, the new user experience enables enterprise-wide engagement across lines of business. It provides optimal usability on multiple devices for better business interactions and ease of use.\r\nThis course will introduce you to the fundamentals and latest features of the SAP Fiori UX. You will learn about product installation, configuration, and best practices for extensibility.\r\nCourse Requirements\r\n\r\nBasic understanding of business processes typically addressed in solutions like SAP ERP, SAP CRM, and SAP SCM\r\nBasic programming knowledge including HTML / JavaScript / SAPUI5\r\n\n\n                                            Syllabus\n                        Course Content\r\nWeek 1: SAP Fiori UX Basics\r\nWeek 2: SAP Fiori UX Deployment\r\nWeek 3: SAP Fiori UX Configuration\r\nWeek 4: Securing SAP Fiori UX\r\nWeek 5: SAP UI Tools\r\nWeek 6: Extending SAP Fiori UX\r\nWeek 7: Final Exam\n                                    ", "end_date": "2014-10-21T00:00:00Z", "title": "Introduction to SAP Fiori UX", "price": 0, "instructors": "Jamie Cawley, Elizabeth Thorburn and Prakalp Phadnis", "institution_name": [], "commitment": "4 hours", "subject_name": ["Computer Science"], "course_url": "https://open.sap.com/course/fiori1", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["openSAP"], "start_date": "2014-09-09T00:00:00Z"}