{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Este es el primer curso del Programa Especializado Chino básico para hispanohablantes: lenguaje y cultura empresarial. Este curso sirve como una introducción al idioma chino. En este curso, los aprendices se familiarizarán con los conceptos más básicos del idioma, como el alfabeto Pinyin, los números, los saludos, cómo presentarse, las palabras y frases comunes, conversaciones cotidianas sobre la familia y los gustos, e información cultural acerca de los temas mencionados. No es recomendable saltar cursos porque los tres cursos de este Programa Especializado fueron diseñados para tomarse uno tras otro, ya que integran el conocimiento previo.\n\n                                            Syllabus\n                        Introducción al curso: Cómo dar una primera impresión positivaMódulo I- El Pinyin: Una introducción a la fonética china  ¡Bienvenidos al primer módulo! En este módulo aprenderemos los saludos y despedidas más comunes y el alfabeto Pinyin. Este es el primer paso que tenemos que tomar para aprender el idioma chino. Toda la información que aprendemos aquí se repetirá en los siguientes módulos y cursos de la especialización.Módulo II- ¿Cómo te llamas? ¡Bienvenidos al segundo módulo! Al terminar este módulo ustedes podrán presentarse en chino y decir de donde son. Aquí comenzamos a formar conversaciones básicas. Módulo III- Los números¡Felicidades! Ya llegaron al tercer módulo. Aquí aprendemos los números en chino, algo muy necesario para seguir aprendiendo el idioma.Módulo IV- ¿Cuál es la fecha de hoy? Ya que aprendimos los números, ahora sabemos lo que necesitamos saber para hablar de la fecha en chino. Este módulo nos enseña cómo decir y escribir la fecha. Módulo V- ¡A Conversar! ¡Hěn hǎo! Ya llegaron al ultimo módulo de contenido. Ahora van a poder poner en práctica todo lo que aprendieron en los módulos anteriores. Aquí aprenderemos como llevar conversaciones básicas sobre temas cotidianos, como los deportes y la familia. Módulo VI- Examen final: Cómo dar una primera impresión positiva¡Hěn hǎo! ¡Felicidades! Es hora de tomar el examen final del curso. Al tomar este examen, verán lo mucho que han aprendido y también lo que les falta por practicar. ¡Buena suerte!\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Chino básico: Cómo dar una primera impresión positiva", 
    "price": 0, 
    "instructors": "Kim Chamberlin and Emilia Gracia", 
    "institution_name": [
        "Arizona State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/chino-primera-impresion", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}