{
    "selfpaced": true, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Nowadays, there is an increasing number of people who are interested in Chinese culture and language. And it is useful to know about the language when coming to China for travel or business. This is an ABC Chinese course for beginners, including introduction of phonetics and daily expressions. After taking this class, learners can have a basic understanding of Chinese Mandarin and make basic conversations of daily living such as exchanging personal information, talking about daily arrangements and food, asking about price, introducing the city and the weather, telling your hobbies etc. Selected topics and situations come from real life scenarios and can be used for everyday communications. In addition to the dialogues, the selection of reading materials and practice activities will make the content as rich and varied as possible, in order to stimulate the learners’ interests. This is an elementary course on Chinese speaking. The learners don’t need to study Chinese characters, so it is easier to follow and complete this course.\n\n                                            Syllabus\n                        Who Are You?When we first meet someone, we need to learn about each other. In this module, we are going to learn some ways to introduce yourself, including name, nationality, identity, and discussing your family. We are also going to study Chinese Mandarin phonetics. When Do You Go To School?How do you plan your daily life? In this module, we are going to learn how to describe our daily schedule, including numbers, time, periods, and some corresponding actions. What Do You Like to Eat?Food is our most important need. In this module, we are going to talk about Chinese main courses, fruits, vegetables and meat, as well as drinks. Have you seen or tried any of these Chinese dishes? Maybe you have already learned to say them in Chinese!I Like Shopping!Shopping! Shopping! Some people love to go shopping, while others feel it is a headache. Still, shopping is an essential part of our life. In this module, we are going to learn how to express our color and size preference, how to ask about price, and how to bargain. Do you know what the most popular color is in your country? How about in China?Do You Live in a Big City?Do you live in a big city or a small town? How do you get to work or school every day? In this module, we are going to learn how to give directions and how to speak about transportation. This module is valuable in case you need to talk about directions with a Chinese friend or you need to go somewhere when you are in China.How About the Weather?Weather can influence our daily life and personal health. In this module, we are going to talk about temperature, seasons, and personal health. China is a very big country and the weather can be quite different across regions and seasons; we will learn to talk about all sorts of weather.What is Your Hobby?What do you like to do in your spare time? We have so many choices nowadays and lead such colorful lives. In this module, we are going to talk about weekday pastimes, sports, TV programs, and some other activities related to the internet, reading, music, and travel! \n                                    ", 
    "end_date": "2016-08-03T00:00:00Z", 
    "title": "Chinese for Beginners", 
    "price": 0, 
    "instructors": "Xiaoyu Liu", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/learn-chinese", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-15T00:00:00Z"
}