{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    This course is designed to give students a thorough introduction to early (pre-221 BCE) Chinese thought, its contemporary implications, and the role of religion in human well-being. Important themes to be discussed include the ideal of wu-wei or “effortless action,” the paradox of how one can consciously try not to try, mindfulness techniques and self-cultivation, models of the self and society, rationality versus emotions, trust and human cooperation, and the structure and impact of different spiritual and political ideals.\n\nThis period of Chinese history witnessed the formation of all of the major indigenous schools of Chinese thought (Confucianism, Daoism, Mohism and Legalism), which in turn had an impact on the development of East Asian cultural history that is still felt today. We will also explore parallels with Western philosophical and religious traditions, the relevance of early Chinese thought for contemporary debates in ethics, moral education, and political philosophy, and the manner in which early Chinese models of the self anticipate recent developments in the evolutionary and cognitive sciences.\n\nThis course provides a full university semester’s worth of material broken into two parts. Each part of the course will last 5 weeks, with a week-long break in between. For each part, there will be four weeks worth of new material. The fifth week will be reserved for review and completion of the final exam.\n\nPart 1 introduces the basic philosophical, religious and scientific concepts that will be drawn upon throughout the course, and then goes on to cover early Shang and Zhou religious thought, the Analects of Confucius, the Daodejing (a Daoist text attributed to Laozi), the utilitarian thinker Mozi, the newly discovered and very exciting Guodian texts, and the momentous philosophical changes that occurred in the mid Warring States period.\n\n \n\nSee also:\n\nChinese Thought: Ancient Wisdom Meets Modern Science - Part 2\n\n                                    ", 
    "end_date": "2016-02-29T00:00:00Z", 
    "title": "China300.1x: Chinese Thought: Ancient Wisdom Meets Modern Science - Part 1", 
    "price": 0, 
    "instructors": "Edward Slingerland", 
    "institution_name": [
        "The University of British Columbia"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/chinese-thought-ancient-wisdom-meets-ubcx-china300-1x-0", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-01-25T00:00:00Z"
}