{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    This course presents some important vignettes of a complex, highly diverse India that is also witnessing unprecedented changes since its formal independence in 1947 from Great Britain. The lectures revolve around social dimensions of change, the continuing influence of ancient texts on contemporary India, political democracy, economic transition from the state to the market, gender relations, India's economic globalisation and changing world view.\n\nWhile one of the objectives is to capture the multifaceted process of change, the course also critically examines some of the tensions inherent in these changes. For example, how does gender inequality play itself out in a changing Indian society, how do the modernist conceptions of art entailing market valuation challenge the more socio-centric values found in South India, what are the politics linguistic identities, and how might India address its myriad development challenges such as poverty and unemployment.\n\nNo specific prior knowledge is required. However, it would be helpful if students are aware of the socio political dynamics at play in contemporary India and keep themselves abreast with current affairs and debates in the country to fully appreciate the various dimensions and contours if the subject matter in the course.\n\nThis course is taught in English.\n\n                                            Syllabus\n                        Contemporary India's historyWe begin this course by discussing the history of pre-partition India i.e. before 1947. We will trace the trajectory of British rule from its inception in India and discuss important events like the mutiny of 1857, the formation of the Indian National Congress and the Muslim League, the divide and rule policy of the British, the idea of separate electorates and how it paved the way for partition in the subcontinent. You will be able to appreciate the devastation that partition brought to the region with millions of people killed, displaced and made refugees overnight. We will try to impress upon the fact that such a momentous event in world history, which involved ethnic cleansing in huge numbers, has been almost forgotten or is not remembered often enough; nor are the lessons learnt. The week concludes by discussing how partition still continues to affect community relations, relations between states and the very foundational ideas of the two nations: India and Pakistan.Indian politics 1948-2014This week we will cover the post-independence politics of India from 1948 to 2014. It will discuss the various leaders especially the contribution of Jawaharlal Nehru and Indira Gandhi to Indian polity. You will get an idea about how India went about its task of nation building and the various challenges it confronted along the way. The section will also cover the dominance of the Congress party and the factors that led to its downfall in recent times. The debates about linguistic states, affirmative action, secularism and the changing nature of Indian federalism will be discussed. You should be able to appreciate the reasons as to why, even with all its shortcomings, India remains an exemplar of robust democracy unlike most other post-colonial countries.The long transition of India's economyThis section will look at the trajectory of India's economic development. It has changed from a state-led economic development model to the one where through a series of a reforms the economy has become more pro-business and market-friendly. You will be introduced to the basic features of first and second-generation reforms, the transformation of the economy since India liberalized in 1991 and the challenges of poverty and job creation that still needs to be tackled.India's foreign policyAs India's influence increases in the international system, understanding its foreign policy and its engagement with the rest of the world is critical for students of international relations. This section is designed as a comprehensive review of some of the key issues related to India's word view and its behaviour towards the external world. Apart from taking stock of contemporary thinking and policies of the country, the major thrust would be on India's relations with its neighbours and great powers, its nuclear weapons policy and the ideological foundations of its foreign policy after independence.\nWomen, gender and feminist struggles in IndiaThis week you will be introduced to some of the concerns related to women and the politics of gender in contemporary India. The section will also focus on some of the key issues related to feminist struggle over the last three decades. Not only will it touch upon the achievements of these struggles but also deal with issues related to missing women, low sex-ratio of women compared to men in India, violence against women, the demand for representation in legislative bodes and the struggle for the rights of sexual minorities. The theme of gender justice and how it is articulated in various forums will also form an important part of this section.\nThe Ramayan\tThis week we will discuss one of India's ancient epics - The Ramayana. Here you will not just be introduced to the text but the various Ramayana traditions, which include a wide range of performance traditions, be it in folk theatre, women's Ramayana songs or shadow puppetry. At the core of these traditions is the idea of morality or dharma, which continues to find resonance in contemporary India even though it was written around 500BC. Because there are innumerable interpretations of the Ramayana, often the sacred becomes the source of controversy. But these disagreements often reinforce the relevance of the epic in the daily lives of Indian society.The past in the present: traditional art forms in today's India\tWe will use arts as a lens to look at some of the general transformations in today’s India. The focus in this section will be to negate the modernity/tradition dichotomy and instead argue that traditions in India are constantly changing. These traditions adapt to the prevailing conditions, which present its own complexities. To understand them, specific concepts and tools will be introduced to better explain the realities of contemporary India, which simultaneously remains connected to its ancient past.\n                                    ", 
    "end_date": "2016-07-10T00:00:00Z", 
    "title": "Contemporary India ", 
    "price": 0, 
    "instructors": "Anthony D'Costa, Amitabh Mattoo, Peter Mayer, Ian  Woolford, Devleena  Ghosh, Samuel Parker and Bina Fernandez", 
    "institution_name": [
        "University of Melbourne"
    ], 
    "commitment": "5-7 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/india", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-22T00:00:00Z"
}