{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, you will learn how to better and more successfully engage your ELL(s) and their families in the school and community. You will learn how to engage your ELL student in the classroom setting as well as in various aspects of the school including extracurricular activities and the inner workings of the school and education system.  You will also be introduced to strategies for engaging the families of your ELL students in the school community and the wider community of your city and state.  You will interact with a variety of case studies that highlight teachers, schools, and communities in different cities throughout the United States and the ways in which they successfully engage ELLs and their families.  From sharing their experience, you will have the tools necessary to implement strategies and procedures for engaging your ELLs and their families. \n\nUpon completing this course, you will be able to:\n       * Define the culture of ELLs in K-12 classrooms across the U.S.\n       * Recognize cultural impact on learning and formal education \n       * Assess your school’s engagement of ELLs and their families\n       * Incorporate culturally sensitive techniques to engage ELLs in the classroom and school \n       * Implement strategies for engaging ELLs’ families in the school and larger community  \n       * Design a plan for engagement of ELLs and their families in your school  \n       * Create a checklist for school and community resources for engaging ELLs and \n          their families\n\n                                            Syllabus\n                        Introduction to Key Aspects of Engaging ELLs and their FamiliesWelcome to week 1 of the course!  This is an important module, as it sets the foundation for many of the strategies presented in this course.  We hope that you find the module very informative. By the end of this module, you will be able to define the culture of ELLs in K-12 classrooms across the U.S., recognize cultural impact on learning and formal education, assess your school’s engagement of ELLs and their families, incorporate culturally sensitive techniques to engage ELLs in the classroom and school and implement strategies for engaging ELLs’ families in the school and larger community.  Let's get started! Case Study: The American Dream Academy, Phoenix, AZWelcome to week 2 of the course!  We are thrilled to introduce you to a stellar organization, the American Dream Academy, and the many things that they do to engage families.  By the end of this module, you will be able to implement strategies for reaching out to ELL parents, apply concepts of parental training to your own teaching and school contexts, develop a plan for success for parental involvement to implement in your own classroom and school context, apply concepts of teaching training to your own school context, and devise solutions for parent involvement in your own classroom and school context. Let's get started!Case Study: Longfellow Elementary School, Sheboygan, Wisconsin  Welcome to week 3 of the course!  In this module, we showcase another exciting case study in hopes that you can adapt many of the ideas presented.  By the end of this module, you will be able to integrate culture into classroom practices such as building background knowledge, implement TPR strategies in classroom activities to support ELL engagement, understand the importance of setting clear expectations for learning and classroom behavior, set clear expectations that are sensitive to cultural differences, use bilingual and multicultural strategies to foster a welcoming environment. Let's get started!Case Study: Alhambra High School, Phoenix, AZWelcome to week 4 of the course! We are so excited for this module and to introduce you to Alhambra High School.  We hope that you find this module inspirational and that you are able to adopt and adapt many of the ideas presented.  By the end of this module, you will be able to apply strategies for creating a culturally supportive school environment, connect students to the school community through creating clubs and school-wide activities, implement new strategies for bringing diverse cultures to the school, and use sports as additional opportunities for school engagement.  Let's get started!Community Outreach Welcome to week 5 of the course! In this module, we are going to take you beyond the classroom and look at a variety of ways to engage the family in different aspects of the community.  By the end of this module, you will be able to identify organizations in your community that provide support for families, approach organizations regarding working with your students and their families, and implement online resources and apps in your classroom communication as a method for reaching parents and maintaining parent-teacher partnerships.  Let's get started!Review and AssessmentWelcome to week 6! Congratulations and well done. It is now time to apply the many strategies for Engaging the ELL and their Families in the School and Community to your own teaching context.  By the end of this module, you will be able to synthesize course material, complete the final exam and complete the optional peer review. Good luck!\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Engaging ELLs and Their Families in the School and Community", 
    "price": 0, 
    "instructors": "Ellen Manos and Claire McLaughlin", 
    "institution_name": [
        "Arizona State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/ell-families", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}