{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Students must learn essential knowledge and skills to deliver an impressive English speech or presentation for academic purposes, job hunting, and business occasions. Global perspectives and inter-cultural communication skills are taught here to facilitate most Chinese English learners. \n学习在学术交流、求职、海外留学与商务场景下进行英文演讲与演示所必备的知识与技能，强化中国学生的全球化视角与跨文化沟通技巧。\n\n                                            Syllabus\n                        Week 1. 学习策略 Learning Strategy欢迎学习英语演讲与演示课程！有相当一部分中国学生学了很多年英语，却没办法用英文流利地进行演讲和演示。只要我们掌握好精通英语的四个要素，采用科学的学习方法，搭建良好的内在环境，学好英语演讲其实并不难。Session 1 is a must see for all Chinese students, not necessarily for learners from other countries, the lecturer shared his view on English learning based on his first-hand experience communicating with people with different cultures and teaching to Chinese students at all levels, for the past two decades. The scope, pedagogy, and targets of this course are mentioned here.Week2. 语音语调 Pronunciation and intonation本周着力于让学生理解和熟悉英语国家发音之间的差异，认识中国学生英语口语存在的诸多问题，然后提出快速纠正发音与语调问题的捷径之路。For non-native English learners, the issue of pronunciation and intonation is among foremost task to tackle before they can deliver a good English speech. Here is the shortcut, people who are not confident with their pronunciation cannot miss this.Week3. 中西文化差异与全球化视角Cultural Differences and Global Perspective本周以张宏岩老师竞选巴黎高商学生会主席的演讲为例，分析与总结一篇成功的演讲应具备哪些要素。通过中西文化差异的对比，结合个人故事，提出全球化视角下英语演讲的四个建议。Building up on the case of his personal story, winning presidency of students’ association at a worldwide prestigious MBA school, the lecturer advises on how to put up global perspective in speeches, and how cultural difference affect our speeches. This is among essential parts of this course.Week4. 演讲中的语言技能与非语言技Verbal and non-verbal skills一篇成功的演讲不仅要求演讲者具备良好的语言技能，同时对非语言技能的要求也很高。肢体语言、TONE、身体移动与站姿、手势甚至视觉接触都会影响演讲最终的呈现效果。好的演讲者不仅要熟练掌握演讲如何开始如何起承转合如何结尾等语言技能，也应注重培养自己的非语言技能。The lecturer discusses how verbal and non-verbal communication skills function when we conduct English speeches &amp; presentations. Cases mentioned are from home and abroad. Week5. 积极词汇建设与图表描述Active vocabulary building背了那么多本单词书，一开口还是发现自己词不达意？记下再多的单词，没有转化成积极词汇量还是然并卵啊！本周课程不仅阐述了如何多角度建设积极词汇量，还从大量TED演讲中汲取知识和经验，以经典数据展示为例，帮助同学攻克图表描述的难关。This session deals with the bricks to build up the speech tower, the vocabulary issue. The concept of active vocabulary is advocated and recommendations were given here.Week6. 面试和自我介绍 Interviews &amp; Self Introduction英语水平在正规面试中的重要性不言而喻，可是我一遇到面试就心慌慌怎么办？别怕，张宏岩老师以自己做面试官的经历总结出面试中的四个重要部分以及面试官看重的一些要素。大家只要在面试前准备充足，注意面试中的礼节，采取正确的面试策略，肯定能妥妥儿拿下哈！学完这一节可不要忘了做作业巩固哦~The most common types of English speech would be during an interview, and 95% of Chinese English learners use English to introduce themselves. Both international etiquette and communication strategy are covered here.Week7. 看看外教怎么说 Native expert’s view张宏岩老师邀请美国好友Charles Odendhal 先生为大家上课。Odenhal 先生自98年致力于为中国知名大学和企业包括央企高管做沟通方面的训练。他从母语者角度不仅告诉大家应该如何做一个好的演讲，而且提供了克服演讲中障碍的方法，更有一些关于英语演讲的建议与问答，简直是倾囊相授啊！速速来看！Mr. Charles Odendhal, an experienced lecturer from USA who had been providing communication training to many leading Chinese universities and enterprises, together with executives from SOEs under supervision of the central government. He shared, from a native speaker’s point of view, his own experience teaching a Chinese to make great English speeches and presentations.Week8. 课程总结及后续学习建议 Conclusion and advices课程至此就已接近尾声，本周主要对课程进行一些说明，同时对课程内容要点进行了总结。仅仅学完这门课是不够的，对于后续的学习，张宏岩老师也提出了几点建议，同学们可以继续去完善自己的英语演讲技能。希望大家能从本课程中收获到终生受益的知识，并将其应用到实践当中去。This session reviews the essence of this course, and gives advices for further study. \n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Essentials for English Speeches and Presentations  英语演讲与演示", 
    "price": 0, 
    "instructors": "Hongyan Zhang", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/yingyuyanjiang", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}