{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Do you have an interest in learning a sign language? Do you want to know how to make your community more inclusive? Are you interested in linguistic studies? In this free online course, you will learn the basics of Catalan Sign Language (LSC), the sign language used by the deaf community in Catalonia, and a valuable research area for sign language linguists.\n\nLearn basic Catalan Sign Language\n\nDuring the course, you will practice a lot of “finger gymnastics”. By the end of the course, you will understand common signs and expressions, signed slowly and clearly, that relate to yourself, family life and work, and the immediate environment.\n\nYou will also be able to express yourself in simple terms, ask simple questions about everyday topics, and use expressions and simple phrases to describe well-known places. Finally, you will be able to sign short texts such as a story.\n\nExplore Catalan Sign Language as a natural language of the deaf community\n\nYou will learn about the wider significance of Catalan Sign Language and about the importance of the deaf community having their own language.\n\nAlthough Catalan Sign Language is recognised officially in Catalonia, often the deaf community can seem isolated. By learning about sign language, and the reality of the deaf community, both the hearing and the deaf can put an end to social exclusion.\n\nCatalan Sign Language as an object of linguistic study\n\nWith interest consistently increasing in linguistics and sign language being a compelling area of study, Catalan Sign Language is a valuable research area for the world’s (sign language) linguists.\n\nDuring the course you will examine a variety of Catalan Sign Language characteristics, including basic components of grammar such hand configuration, place of articulation, and movement; morphology, such as concordance and expression of plural; and finally basic syntax, such as word order.\n\n\n                                    ", 
    "end_date": "2016-05-16T00:00:00Z", 
    "title": "Introduction to Catalan Sign Language: Speaking with Your Hands and Hearing with Your Eyes", 
    "price": 0, 
    "instructors": "Josep Quer", 
    "institution_name": [
        "Universitat Pompeu Fabra"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/lsc?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-04-04T00:00:00Z"
}