{
    "selfpaced": true, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Benvenuti e Benvenute! (Welcome!) \n\nIn this language course, you will enhance your Italian language skills, enrich your vocabulary and expand your conversational skills. You will learn how to have exchanges on a variety of topics, and continue your immersion in the Italian culture through unique videos and interviews. You will also become more confident as you continue practicing your reading and writing skills.\n\nThis course offers a variety of tools that will help you learn in different ways:\n\nSituational videos (called Ciak!, which means “clapperboard” in Italian): you will follow eight Italian students in their daily lives and interactions on our campus. What a great way to learn authentic conversational Italian!\n\tDownloadable Podcasts: become a participant in each Ciak! video and practice Italian when and where you want on your portable device!\n\tGrammar charts, with or without audio files: study and review grammar through concise, clear and downloadable pdf files, and practice pronunciation with our embedded audio files.\n\tShort video lessons: as if in a real classroom, learn each new topic with the instructor’s direct guidance.\n\tVideo interviews: learn from various native speakers as they talk about different aspects of Italian culture.\n\tShort “Letture” (readings): practice reading comprehension while learning about Italian culture.\n\tDiscussion board: your chance to communicate (in Italian!) with other students on a variety of suggested topics.\n\tReady to test your skills? Practice and review with a variety of self-correcting activities.\nItalian culture is an integral part of this course. Through our interviews and readings you will learn about:\n\nthe origins of the “made in Italy” in fashion;\n\tItalian Renaissance and Baroque art and poetry;\n\tthe Italian health care system;\n\tshopping for clothes and food in Italy.\nWhether you are a traditional, visual or auditory learner, you will find the tools that best fit your unique way to learn a foreign language.\n\nThis course has been successfully taught in different settings to more than 1,000 students: entirely online to Wellesley College alumnae and students, and as a mix of face-to-face and online instruction at Wellesley College and MIT. We are now proud to open it on edX, confident that your learning experience with this unique online course will be as enriching as it was for the many students who have already taken it.\n\nAfter completing this course, continue learning Italian with Italian Language and Culture: Advanced.\n\nFinally … buon lavoro e buon divertimento! \n\n“This course is really excellent, beautifully thought out. The grammar and the opportunity to repeat the contents of a lesson using different modalities really helps solidify the learning.” – Previous Student\n\n                                    ", 
    "end_date": "2017-01-30T00:00:00Z", 
    "title": "Italian2x: Italian Language and Culture: Intermediate", 
    "price": 0, 
    "instructors": "Daniela Bartalesi-Graf ", 
    "institution_name": [
        "Wellesley College"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/italian-language-culture-intermediate-wellesleyx-italian2x", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-01-25T00:00:00Z"
}