{
    "selfpaced": true, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Benvenuti e Benvenute! (Welcome!)\n\nLearn how to perfect your skills in Italian (speaking, listening, reading and writing), and by the end of this course you will be able to express opinions and hypotheses, and sustain an argument using a variety of registers. You will also expand your vocabulary to include topics beyond everyday conversation.\n\nThis language course offers a variety of tools that will help you learn in different ways:\n\nSituational videos (called Ciak!, which means “clapperboard” in Italian): you will follow eight Italian students in their daily lives and interactions on our campus. What a great way to learn authentic conversational Italian!\n\tDownloadable Podcasts: become a participant in each Ciak! video and practice Italian when and where you want on your portable device!\n\tGrammar charts, with or without audio files: study and review grammar through concise, clear and downloadable pdf files, and practice pronunciation with our embedded audio files.\n\tShort video lessons: as if in a real classroom, learn each new topic with the teacher’s direct guidance.\n\tVideo interviews: learn from various native speakers as they talk about different aspects of Italian culture.\n\tShort “Letture” (readings): practice reading comprehension while learning about aspects of Italian culture.\n\tDiscussion board: your chance to communicate (in Italian!) with other students on a variety of suggested topics.\n\tReady to test your skills? Practice and review with a variety of self-correcting activities.\nItalian culture is also an integral part of this course. Through interviews and readings you will learn about:\n\nthe challenges that the Italian economy is currently facing;\n\tthe origin and nature of the Italian Constitution;\n\tItalian environmental challenges and solutions;\n\tthe significance of Dante’s journey in the Divine Comedy;\n\tthe “Commedia dell’Arte”, an Italian theatrical genre;\n\tItalian opera and its ties to the “Risorgimento;”\n\tthe origins of the Mafia;\n\tthe “Taranta” or “Pizzica”, a traditional style of music and dance from Southern Italy;\n\tthe recent immigration and the Italian citizenship law.\nWhether you are a traditional, visual or auditory learner, you will find the tools that best fit your unique way to learn a foreign language.\n\nThis course has been successfully taught in different settings to more than 1,000 students: entirely online to Wellesley College alumnae and students, and as a mix of face-to-face and online instruction at Wellesley College and MIT. We are now proud to open it on edX, confident that your learning experience with this unique online course will be as enriching as it was for the many students who have already taken it.\n\nBuono studio e buon divertimento!\n\n“So many things!  I loved it!  I really feel that this course exactly met my needs and surpassed my expectations. It was challenging and I learned so much, in contrast to other adult courses which tend not to be demanding or serious enough.”\n\n– Previous Student\n\n                                    ", 
    "end_date": "2017-01-30T00:00:00Z", 
    "title": "Italian3x: Italian Language and Culture: Advanced", 
    "price": 0, 
    "instructors": "Daniela Bartalesi-Graf ", 
    "institution_name": [
        "Wellesley College"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/italian-language-culture-advanced-wellesleyx-italian3x", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-01-25T00:00:00Z"
}