{
    "selfpaced": true, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Benvenuti e Benvenute! (Welcome!)\n\nIn this language course you will learn the four basic skills (speaking, listening, reading and writing) in the context of major themes in Italian culture. By the end of the course you will be able to describe people, events and situations, both in the present and the past, and you will have acquired the necessary vocabulary to communicate about everyday situations.\n\nThis course offers a variety of tools to help you learn “la lingua del sì” in different ways:\n\nSituational videos (called Ciak!, which means “clapperboard” in Italian): you will follow eight Italian students in their daily lives and interactions on our campus. What a great way to learn authentic conversational Italian!\n\tDownloadable Podcasts: become a participant in each Ciak! video and practice Italian when and where you want on your portable device!\n\tGrammar charts, with or without audio files: study and review grammar through concise, clear and downloadable pdf files, and practice pronunciation with our embedded audio files.\n\tShort video lessons: as if in a real classroom, learn each new topic with the instructor’s direct guidance.\n\tVideo interviews: learn from various native speakers as they talk about different aspects of Italian culture.\n\tShort “Letture” (readings): practice reading comprehension while learning about Italian culture.\n\tDiscussion board: your chance to communicate (in Italian!) with other students on a variety of suggested topics.\n\tReady to test your skills? Practice and review with a variety of self-correcting activities.\nItalian culture is also an integral part of this course. Through our interviews and readings you will learn about:\n\ndaily life in a small hill town in Northern Italy;\n\tmajor differences between Italian and American universities;\n\tItalian films that won the Academy Award for Best Foreign Film;\n\tsummer vacations in Italy;\n\tItalian cuisine.\nWhether you are a traditional, visual or auditory learner, you will find the tools that best fit your unique way to learn a foreign language.\n\nThis course has been successfully taught in different settings to more than 1,000 students: entirely online to Wellesley College alumnae and students, and as a mix of face-to-face and online instruction at Wellesley College and MIT. We are now proud to open it on edX, confident that your learning experience with this unique online course will be as enriching as it was for the many students who have already taken it.\n\nLast but not least: as you progress in the course, remember to have fun!\n\nAfter completing this course, continue learning Italian with Italian Language and Culture: Intermediate and Italian Language and Culture: Advanced.\n\nBuon divertimento!\n\n“Thank you for the fantastic course. I am overwhelmingly grateful for the richness and depth of the material and the opportunity to learn and immerse ... I love Italy and the Italian language.” – Previous Student\n\n                                    ", 
    "end_date": "2017-01-30T00:00:00Z", 
    "title": "Italian1x: Italian Language and Culture: Beginner", 
    "price": 0, 
    "instructors": "Daniela Bartalesi-Graf ", 
    "institution_name": [
        "Wellesley College"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/italian-language-culture-beginner-wellesleyx-italian1x", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-01-25T00:00:00Z"
}