{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Nella sconfortante situazione generale in cui versa il patrimonio culturale e ambientale italiano, a rischio per scarsità di risorse e crisi economica, emergono esperienze inedite: iniziative promosse da cittadini appassionati e competenti che hanno ri-funzionalizzato siti, luoghi, saperi e tradizioni, riorganizzando le relazioni comunitarie e il lavoro.Il corso passerà dapprima in rassegna un’analisi del patrimonio culturale abbandonato e degli attuali inadeguati modelli di gestione tradizionali. Successivamente, si presenteranno una serie di casi di successo di storie di innovazione spontanea e necessaria che hanno portato alla rinascita del patrimonio dimenticato in particolare nella dimensione minore del Sud Italia, soffermandoci in particolare sul fenomeno dell’innovazione sociale e sulla sua applicabilità al patrimonio culturale.\r\nLearning Objectives:In questo MOOC illustreremo una serie di storie emblematiche che in questi anni si sono sviluppate nell’Italia del Sud, e che hanno provato con un approccio innovativo ad affrontare la problematica della tutela del patrimonio culturale ed ambientale. Si tratta di casi esemplari di progetti nati senza un supporto istituzionale utili però ad esplorare un fenomeno di crescente interesse che mostra evidenti interventi di innovazione sociale dal basso.  Sulla base di queste esperienze saranno descritte le caratteristiche di un nuovo modello di gestione del patrimonio culturale ed ambientale che viene innescato proprio dalla partecipazione dei cittadini e che si ispira al concetto di Social innovation.Al termine del corso si avranno gli strumenti per: diagnosticare i problemi e le sfide provenienti dal contesto culturale; sviluppare e applicare modelli di sviluppo partecipativi; impiegare metodi e processi interdisciplinari.Lo studio dei casi, inoltre, consentirà, attraverso l’impatto con esperienze reali, l’apprendimento di nozioni per lo sviluppo della capacità di costruire relazioni, coalizioni e sistemi per supportare e sostenere il cambiamento.\n\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "L'innovazione sociale nella gestione del patrimonio culturale", 
    "price": 0, 
    "instructors": "Stefano Consiglio", 
    "institution_name": [
        "University of Naples Federico II"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://platform.europeanmoocs.eu/course__linnovazione_sociale_nella_ge", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "EMMA"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}