{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Formative assessment is an instructional practice to gauge where your students are in their learning by gathering evidence of their learning, assessing the evidence, and planning the next steps in instruction. The Common Core State Standards in English Language Arts and Mathematics, the Next Generation Science Standards, and new English Language Proficiency Standards all include a focus on argumentation, requiring that students construct claims supported by evidence and/or reasoning. In this course, we will explore how formative assessment practices can be targeted in improve student argumentation skills, an essential, cross-disciplinary practice.Participants in this course will use a range of practical tools for gathering and analyzing language samples that show how students currently construct claims supported by evidence and/or reasoning, as well as identifying next steps in students' development. These tools support formative assessment and instructional planning. Focal topics include: articulating claims; linking evidence and/or reasoning to claims; and evaluating evidence and/or reasoning. We will also explore similarities and differences in argumentation across content areas and grade levels. This course will enable teachers to collaborate with other educators and build professional relationships that result in an online community focused on improving students' abilities to engage in argumentation across content areas. This course is offered jointly by Stanford University and Oregon State University.\n\n                                            Syllabus\n                        Session 1: Introduction to the formative assessment process and how to focus on language while practicing formative assessment (October 5 - 18)Session 2: Argumentation, its role in the new standards and associated language demands (October 19- November 1)Session 3: Using the formative assessment process to interpret students' argumentation skills (November 2 - 15)Session 4: Implementing and adjusting instructional strategies to improve student argumentation (November 16 -November 29)\n                                    ", 
    "end_date": "2015-11-30T00:00:00Z", 
    "title": "Learning as Evidence: Improving ELLs’ Argumentation Skills through Formative Assessment Practices", 
    "price": 0, 
    "instructors": "Sara Rutherford-Quach", 
    "institution_name": [
        "Oregon State University", 
        "Stanford University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://novoed.com/osu-stanford-ELL-2015", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2015-10-05T00:00:00Z"
}