{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    In this course you will learn how to design lesson plans around the needs of your ELL students and their language level through the analysis of content language and cognitive demands. You will learn how to align language objectives to the adopted standards of your school and content area.  You will learn how to modify existing course materials as well as develop graphic organizers and languages frames to support ELLs’ access to content.  Analysis of second language acquisition theories will be applied to lesson planning.\n\nUpon completing this course, you will be able to:\n     * Conceptualize theories of second language acquisition as they apply to the planning of lessons through annotation\n     * Assess the linguistic needs of your students using BICS and CALP\n     * Identify content specific vocabulary, grammatical structures, and language functions necessary for a student to succeed in your     \n       classroom \n     * Write language learning outcomes that align to your student’s linguistic and cognitive ability and your school’s adopted   \n       standards \n     * Adapt a lesson plan that accomplishes the learning outcomes outlined in the lesson objectives\n    * Modify materials to support ELLs’ access to content\n    * Use a wide variety of graphic organizer templates and language frames to support ELLs’ access to content\n    * Develop activity types appropriate to the cognitive and linguistic abilities of ELLs\n    * Incorporate community and culture into lesson planning\n\n                                            Syllabus\n                        ELL Language and Communication Skills Across the Curriculum Welcome to week 1! This module is very important as it introduces you to the basics of second language acquisition.  By the end of this module, you will be able to: conceptualize theories of SLA as they apply to ELL students in your mainstream classrooms, assess your student’s language skills and abilities using BICS and CALP, classify vocabulary types specific to your content, identify grammar structures specific to your content, identify language functions specific to your content and strategically pre-plan vocabulary and language functions necessary for lessons in your mainstream classroom. Lots to learn!  Let's get started!ELL Cognitive and Learning SKills Across the Curriculum Welcome to week 2! This week you will continue to work through pre-planning stages of lesson design as you keep in mind your ELLs.  By the end of this module, you will be able to engage cognitive skills of ELLs through the learning of content, develop ELL autonomy by teaching students how to learn, evaluate the affective filter of your ELL students, strategically design classroom environment to reduce affective filter and strategically pre-plan cognitive and learning skills necessary for lessons in your mainstream classroom. Lesson Planning with the ELL in MindWelcome to week 3! We are excited to begin writing and creating the lesson plan and activities to support our students' learning of content and development of language.  By the end of this module, you will be able to write language learning outcomes to support your content learning outcomes, plan/adapt lesson activities that support cognitive and linguistic access for ELLs, identify language demands of existing activities, lessons, textbooks and content and strategically plan lesson objectives and activities in your mainstream classroom with your ELL in mind. Happy Lesson Planning!Materials and Lesson Delivery Welcome to week 4! Now that you have created your lesson, it is time to start thinking about the materials you will need to make sure that the lesson is successful. By the end of this module, you will be able to apply thoughtful criteria for selecting materials in your mainstream classroom (meet input and cognition demands), adapt materials for ELLs using a word level, sentence level and text level analysis, modify existing text to provide linguistic access to your ELLs, create materials to provide linguistic access to your ELLs and strategically select and adapt materials in lesson planning with your ELL in mind. Let's get started!ELL Lesson Planning in Action  Welcome to week 5! This is a unique module in that you will have a chance to see some lesson plans in action.  We will share 3 lesson plans fully developed with the ELL in mind.  By the end of this module, you will be able to: identify key aspects of Second Language Acquisition in 3 fully developed lesson plans, analyze ways to select vocabulary, grammatical structures, language functions, cognitive skills, and learning skills within these 3 model lessons, recognize alignment of learning outcomes to state standards within these 3 model lessons, identify modified texts and materials for ELLs and apply these same concepts to your own lessons, objectives, and materials. Assessment Welcome to week 6! Congratulations and well done. It is now time to apply the many strategies for lesson planning with the ELL in mind to your own teaching context.  By the end of this module, you will be able to synthesize course material, complete the final exam and complete the optional peer review. Good luck!\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Lesson Planning with the ELL in Mind", 
    "price": 0, 
    "instructors": "Ellen Manos and Claire McLaughlin", 
    "institution_name": [
        "Arizona State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/ell-lesson", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}