{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    This free online course will explore multilingual education and how it can impact and improve education and even wider society.\n\nUnderstand why languages matter\n\nOur languages are an essential part of who we are as human beings. They are instruments of communication and are often a source of dignity and of human pride. Our life experiences and views of the world are bound up in our languages. Our sense of self might be strengthened by our ability to speak the language we choose or curtailed by our inability to understand the language that speaks to us. Some scholars even say that the right to speak one’s languages should be established as an essential part of the right to be oneself. They suggest that this language right should be honoured in all forms of communication.\n\nIn this course, you will explore how people’s language practice, and the personal connection people have to the language(s) they speak, provoke important philosophical and pedagogical questions around the ways we form personal relationships, engage in business relations and even view the world around us.\n\nExplore how languages challenge the way we live\n\nEnglish is the language of worldwide communication. Should this change? Should people’s personal language practices influence the way we communicate on a global scale? How might the claim for people’s language rights challenge the language arrangements in our societies? What is gained and what is lost from speaking just one language?\n\nThese are just some of the questions you will consider and during the course; there will be plenty of opportunities for you to share your experiences, so we can learn from each other.\n\nIn summary, during the course you will:\n\n\n  be introduced to different multilingual environments, consider what these mean for learning languages, and encounter some of the latest research in researching for working multilingually;\n  experience and critically evaluate the idea of active citizenship, discovering ways in which language minorities can be empowered through the equal treatment of all languages and cultures;\n  deepen your understanding of other languages and cultures through consideration of language rights, existing educational films and workshops developed through their practices;\n  and address the ways in which the creative and performing arts can help translate meanings and enhance understandings in multilingual environments.\n\n\nYou can follow the team behind this course on Twitter – @UoGMultilingua.\n\n\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Multilingual Learning for a Globalised World", 
    "price": 0, 
    "instructors": "Aneta Marren and Alison Phipps", 
    "institution_name": [
        "University of Glasgow"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/multilingual?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}