{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    En un lugar de la UAM, cuyo nombre merece recordar, habita la España de El Quijote. \nUn espacio en el que su monarquía creó el primer imperio global de la Historia. Un tiempo, entre los siglos XVI y XVII, en el que su sociedad alcanzó la excelencia en las artes y las letras.\nAunque ese esplendor se dio en plenos aires de cambio. Pues España pasó de la hegemonía a la decadencia, de la expansión a la crisis.\nEsta asignatura pretende trazar la historia de aquella época. Entre el Renacimiento y el Barroco su cultura marcó la pauta en Occidente. Las obras literarias -La Celestina, El Lazarillo, etc.- se tradujeron enseguida en las imprentas europeas y americanas. Las ropas marcaron la moda cortesana. La tendencia más fashion era “vestir a la española”. Los tratados militares y políticos fueron estudiados por los enemigos.\nLa acumulación de talentos en la Villa y Corte de Madrid (Cervantes, Lope, Velázquez, etc.), tuvo réplicas en las grandes ciudades de imperio. Pues en Sevilla, Lisboa, Barcelona, Nápoles, México o Lima se multiplicaron academias literarias, estrenos teatrales y fiestas. Una síntesis de pueblos unidos por la lealtad a la Corona y la fe católica.\nEn nuestro recorrido por esa España de El Quijote pasaremos de la campana al reloj y de la geografía fantástica a la real. La sociedad estuvo - Conocer la Historia de España en el Siglo de Oro a través de El Quijote como hilo conductor.\n\nAdentrarnos en la vida cotidiana de los siglos XVI y XVII a través de la sociedad y la cultura.\n\tOfrecer al alumnado las fuentes escritas y visuales para que contemple el tiempo de El Quijote como si viviese en él.\n\tComparar los valores de la España de El Quijote con los actuales para comprender cómo han ido evolucionando a lo largo de la Historia polarizada entre los privilegiados -nobleza y clero- y los pobres y los picaros. El Humanismo fue cultivado en las universidades. La familia, la alimentación, la vivienda, los juegos y las fiestas, protagonizaron la vida cotidiana. \n\nEn el tiempo de El Quijote las luces de los genios literarios y artísticos brillaron sobre las sombras de la Inquisición. Viajemos, pues, a esta excelsa cultura del Siglo de Oro.\n\n                                    ", 
    "end_date": "2015-11-17T00:00:00Z", 
    "title": "Quijote501x: La España de El Quijote", 
    "price": 0, 
    "instructors": "Pedro García Martín", 
    "institution_name": [
        "Universidad Autónoma de Madrid"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/la-espana-de-el-quijote-uamx-quijote501x", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-10-06T00:00:00Z"
}