{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Do you want to speak better English? This course will help you reach that goal. Speak English Professionally: In person, Online and On the Phone will boost your English speaking skills. In this 5 week course, you will learn how to identify and make a strong personal introduction. You will develop and demonstrate the speaking skills for group discussions: how to agree or disagree, how to clarify, restate and summarize. You will review and practice how to give information and respond to requests on the phone. You will study and role play effective interviewing. You will  prepare and give a sales “pitch”, introducing a product or service. Throughout the course, you will change how you speak English and you will become more fluent and accurate when you speak. You will demonstrate  culturally appropriate body language and tone. As you work through the course, you will complete self- and peer-evaluations. Through a combination of lectures, comprehension and vocabulary quizzes, practice and performance, you’ll gain the skills and confidence to communicate well  in English, anywhere in the world.\t\n\nBy the end of this course you will:\n•      Change how you speak English\n•\tImprove your pronunciation and fluency  \n•       Increase your English vocabulary \n•\tIdentify how culture influences your speech\n•\tUse culture to help you speak correctly \n•\tDemonstrate the best body language for different cultural settings\n•\tKnow statements, questions and responses for different settings and situations\n\n                                            Syllabus\n                        Communicate in Person: The Power of Face to Face ConnectionsThrough the lessons this module, you will be able to work on professional conversational vocabulary and proper word stress and intonation. After the final lesson you will be able to present a short \"Elevator Speech.\" Meet and Talk OnlineThis module looks at group discussion situations with the focus on video conferencing. By looking at various scenarios, you will learn key language for group discussion as well as gain some business etiquette.  Powerful Phone TalkIn this module, you will improve language use and pronunciation for phone conversations. Trickier pronunciation distinctions in can/can't and numbers will be the focus for pronunciation.Keys to a Strong InterviewThrough the lessons in this module, you will be able to prepare yourself better for an interview in English. The three lesson will focus on improving your body language, pronunciation for -ed and -s ending words, and a practice interview questions.Put It All Together: PresentationsIn this final module, you will have the chance to put all your newly gained language skills together into a presentation. The two lessons will help you organize and deliver your best presentation.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Speak English Professionally: In Person, Online & On the Phone", 
    "price": 0, 
    "instructors": "Amalia B. Stephens", 
    "institution_name": [
        "Georgia Institute of Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/speak-english-professionally", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}