{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Through a series of engaging metaphors and stories, prospective and current EFL/ESL teachers will identify, summarize, and evaluate 7 basic language learning paradigms.  Learners will be presented information on such foundational principles as motivation, risk taking, two different modes of learning, and balancing the teacher profession.  Learners are also given an understanding of basic techniques founded on those principles, such as teacher talk, looking “ridiculous” in order to lower the affective filter, and networking.   With these foundational principles in mind, ESL/EFL teachers will scrutinize common assumptions about language learning by comparing how they stack up to research-based core principles.\n\n                                            Syllabus\n                        Module 1: Making Meaning ClearThis course introduces learners to the role of a teacher in helping to motivate and properly engage learners.  It begins with a metaphor: language is cake, meaning that language must be presented well in order to be enjoyed (we will actually perform a skit to show this meaning clearly).  This module will demonstrate how a teacher can encourage a student and increase motivation by paying attention to techniques such as improving teacher talk, scaffolding language, and the use of body language to make meaning clear.  All of these skills, while gained over the course of a lifetime as a language teacher, must be considered primary goals from the very beginning.  And all of these skills help a teacher recognize that presentation skills make a difference to learners not only in motivating them, but in allowing them to understand the concepts presented. Module 2: Modes of Learning and InteractionIn this module, learners are introduced to the distinction between learning and acquisition. The distinction is made to help give learners context for the principle that language requires practice. To introduce the importance of practice, the distinction between a focused and diffuse mode of learning demonstrates that students who simply learn through memorizing vocabulary and grammar structures (focused mode) often don’t acquire language structures. On the other hand, teachers who engage students in both a focused and diffuse mode, like a basketball coach with his players, are able to instruct but give time for that instruction to “sink in” through dedicated practice.  Module 3: Taking Risks and Learner StrategiesUsing language learning expert Francois Gouin’s experience of going to Germany and failing to learn German, this module demonstrates the need for learners to understand how a language is learned. Gouin’s experience demonstrates not only the need for a diffuse mode of learning wherein practice is valued, but it also demonstrates the psyche of many second language learners.  Francois, in some sense, was too smart for his own good, relying on techniques for learning material that don’t apply to language use and application.  Students must use techniques and strategies that are proven to help someone acquire language, like those from the good language learner studies. Teachers can facilitate student learning by helping to demonstrate good language learner principles.   Module 4: The Flipped Model of Language LearningWhile it was once considered impossible to be immersed in English outside of an English-speaking country, with the advent of the internet, the world has changed and continues to change significantly. This module presents ways in which to use the internet and other resources to a teacher’s advantage, and helps a teacher recognize their ability to engage students on cell phones, tablets, and computers.  Introduction of the flipped classroom, meaning that learners can engage in focused material (videos, readings, etc) outside the classroom, and then engage in projects, exercises, and discussions within it.Module 5: Avoiding Teacher BurnoutThis module introduces the concept of teacher burnout, and several techniques to avoid it.  The first technique is the creation of a network.  By creating a network of teachers to help you understand your field, you can learn new ideas and have a resource for solving difficult problems.  The second technique, maintaining control of your teaching environment, demonstrates the need for teachers to understand how to best make a difference and avoid the pitfalls of complaining.  Finally, the third technique, finding your core, explains that teachers can, paradoxically, maintain energy by working tirelessly for the principles they most believe in. Module 6: AssessmentThis review of the course guides learners to understand the different metaphors that serve as guides to understanding the foundational principles presented in this course. \n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Teach English Now! Foundational Principles", 
    "price": 0, 
    "instructors": "Dr. Justin Shewell, Andrea Haraway and Dr. Shane Dixon", 
    "institution_name": [
        "Arizona State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/english-principles", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}