{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    What is language? How do we learn meaning in a new language? What is easy and hard about learning another language? And what is the best way to teach other languages?\n\nThis free online course suggests some answers to these questions. It has been developed by the University of Southampton and the British Council, and draws on their exciting joint online course, MA in English Language Teaching.\n\nThe course takes place over four weeks. It will introduce you to some of the latest ideas in research and practice in language learning and teaching. We will:\n\n\n  Explore second language learning and what it means to learn language\n  Consider language classrooms and how teaching affects our language learning\n  Look at the use of technology in teaching, and its benefits and challenges for language learning.\n\n\nFinally, we will investigate the case of English – the most widely learnt and taught language in the world. How has English achieved this position? What are the implications of the spread of English for policy, teaching and other languages?\n\nThe course includes quizzes, activities, discussions and videos filmed around the world. The videos feature experts such as British Council teachers, and staff and students at the University of Southampton.\n\nDuring the course, you will hear different voices sharing their ideas and opinions – and we want to hear yours too. How do you use language in YOUR life? What is YOUR experience of language learning and teaching? Join us – to discuss effective language learning and teaching.\n\n(Course Image ©ivosar/Shutterstock)\n\n\n                                    ", 
    "end_date": "2016-05-02T00:00:00Z", 
    "title": "Understanding Language: Learning and Teaching", 
    "price": 0, 
    "instructors": "Darren Paffey and Sara Pierson", 
    "institution_name": [
        "University of Southampton"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/understanding-language?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-04-04T00:00:00Z"
}