{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    Курс «Зарисовки о Сибири. Город Томск: курс русского языка для иностранцев» ответит на вопросы, которые часто задают иностранцы о Сибири: Чем она богата? Каковы ее природные и климатические условия? Что за люди здесь живут, чем они занимаются? Как устроен сибирский город, сибирская деревня? Какие народности проживают на территории Томска и Томской области? Как поддерживаются национальные традиции? Как сохраняется деревянная архитектура? Кто из томских студентов принимал участие в Олимпийских играх? \n\nКурс может быть интересен \n- иностранным гражданам, которые хотят совершенствовать русский язык;\n- бывшим россиянам, проживающим сейчас за рубежом и интересующимся тем, как живет Сибирь сегодня; \n- преподавателям русского языка как иностранного; \n- иностранным студентам, выбирающим город, в котором хотели бы обучаться на русском языке;\n- российским школьным учителям и выпускникам российских школ.\n\nВ этом курсе слушатели смогут практиковаться в разных видах речевой деятельности на русском языке (аудирование, чтение, письмо); расширить словарный запас, в том числе за счет лексики, которая, как правило, не встречается в распространенных учебных пособиях по русскому языку как иностранному; улучшить грамматические навыки.\n\nПосле завершения курса слушатели смогут применить свои страноведческие знания о Сибири при изучении истории России, лингвострановедения России, русской культуры. Приобретенные знания и навыки будут полезны иностранным гражданам во время путешествий по России.  \n\nThe course will give answers to the questions about Siberia that are frequently asked by foreigners: What is it rich in? What its nature and climate conditions? What people live here and what do they do? How is a Siberian town or a village organized? What nationalities live on the territory of Tomsk and Tomsk region? How national traditions are maintained? How the wooden architecture is being preserved? What Tomsk students took part at the Olympic games?\nThis course will provide learners with an opportunity to practice different types of speech activity in Russian (listening, reading, and writing); to enrich their vocabulary with lexical units that are not typical in manuals “Russian as a foreign language”; to improve their grammar skills.\nOn completing the course the learners will be able to use their knowledge about Siberia in such subjects as the history of Russia, Russian language and area studies, and Russian culture. These skills and knowledge will be useful for foreign citizens who travel around Russia.\n\n                                            Syllabus\n                        Добро пожаловать на курс «Зарисовки о Сибири. Город Томск: курс русского языка для иностранцев»Модуль 1. Томск историческийЛекции первого модуля посвящены истории и современности Томска, центральному проспекту, паркам и главным достопримечательностям города, самым известным людям Томска.Модуль 2. Архитектура ТомскаИз лекций этого модуля вы узнаете, почему Томск так называется, чем славится наш город, какие памятники деревянной и каменной архитектуры охраняются государством, что А.П. Чехов сказал о Томске и многое другое.Модуль 3. Томск многонациональныйВы узнаете о народностях, проживающих в Томской области, о фестивалях национальных культур и необычных городских и региональных праздниках.Модуль 4. Образование и культураЛекции четвёртого модуля посвящены первому университету Сибири, крупнейшей университетской библиотеке Западной Сибири, необычным музеям Томска и театрам, принимавшим на своей сцене всемирно известных артистов.Модуль 5. Томская областьВы узнаете, как пережить сибирские морозы, бывает ли в Томской области лето, чем богата тайга и чем уникальна природа нашего региона,  как живёт сибирская деревня.\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Зарисовки о Сибири. Город Томск: курс русского языка для иностранцев", 
    "price": 0, 
    "instructors": "Нестерова Наталья Георгиевна (Natalya G. Nesterova), Фащанова Светлана Владимировна (Svetlana V. Faschanova) and Грекова Марина Владимировна (Marina V. Grekova)", 
    "institution_name": [
        "Tsinghua University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/zarisovki-o-sibiri", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}