{
    "selfpaced": true, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    В настоящее время русский язык испытывает на себе различного рода влияния Интернет-коммуникации, средств массовой информации, сильное воздействие других языков. Подобные процессы нельзя назвать сугубо положительными: отрицательные стороны у них, безусловно, тоже есть. И это является еще одним важным фактором, обуславливающим необходимость обращения к языковому материалу сегодня и дополнительного его изучения.\nСпецифика курса, который в университетской программе традиционно называется «Русский язык и культура речи», состоит в том, что он является общеобразовательным и повсеместно читается студентам самых разных факультетов. В российских вузах его ежегодно слушают экономисты, юристы, психологи, биологи, информатики, историки, спортсмены…\nВ онлайн-курсе предпринимается попытка дать базовые знания, необходимые для эффективного освоения дисциплины студентами различных направлений и специальностей как российских, так и зарубежных вузов.\nКурс будет интересен студентам любых факультетов и любых курсов (включая магистратуру), иностранным гражданам, изучающим русский язык, школьникам среднего и старшего звена, а также всем желающим повысить уровень владения навыками устной и письменной речи.\nСертификат получают слушатели, набравшие больше 70% (от 71% и выше) от максимально возможного количества баллов.\nПри этом итоговый результат складывается из следующих составляющих: промежуточные тесты дают 70 %, итоговый тест  дает 30 %.\n\n                                            Syllabus\n                        Добро пожаловать на курс «Русский язык как инструмент успешной коммуникации»Зачем нам нужны языковые правила, и кто их выдумывает?Модуль посвящен тому, кто именно устанавливает языковые правила и речевые нормы; какие именно факторы должны учитывать исследователи при квалификации отдельного варианта произношения или написания в качестве нормированного, а также - необычной и примечательной способности языковой нормы сочетать в себе взаимоисключающие признаки, основным из которых является устойчивость / изменчивость. Слушатели узнают, как в литературной форме языка реализуются такие аспекты, как инструментальный, функциональный, этический и эстетический. Лектор расскажет, почему разговорная и просторечная лексика не подчиняется литературной норме, нужно ли с ней бороться, чем обусловлено ее наличие в языковой системе; что такое устаревшая лексика; для чего нужны жаргонизмы и как они появились.Меняющийся язык в меняющемся миреВ лекциях модуля предпринимается попытка сделать обзор основных периодов развития русской языковой системы: от «билингвизма» на Руси до «эпохи языковых потрясений» – двадцатого столетия и наших дней. Модуль содержит рассказ о том, через какие испытания русский язык прошел на протяжении 20-го столетия: реформы графики и орфографии, последовавшие за революцией, жесточайшая цензура 1930-х годов и мощнейшая волна заимствований в конце 20-го века. Интернет-коммуникацияВ лекциях модуля рассказывается о том, что сейчас назрела необходимость корректировки существующей классификации функциональных стилей речи: одна из причин – широкое распространение Интернет-коммуникации. Общение в Интернете и «реальном мире» строится в совершенно различных условиях – а потому и языковые средства, используемые в каждом конкретном случае, могут существенно различаться. Одна из лекций модуля посвящена тому, какие психологические факторы влияют на выбор языков средств в формате Интернет-коммуникации и чего стоит избегать. Вместе со слушателями лектор ищет ответ на вопрос, что же такой Интернет-общение: «эшафот» для языка или всего лишь очередной этап развития языковой системы?Язык СМИ и его влияние на обществоМодуль посвящен анализу конкретных языковых средств, использование которых помогает создателю рекламного текста добиться заявленных целей. Еще одна тема модуля – проблема речевого манипулирования. Что такое манипуляция? Чем она отличается от внушения или насилия?  Зачем может использоваться речевое манипулирование, и как не стать его жертвой? Ответы на эти и другие вопросы, связанные с речевым манипулированием, слушатели ищут вместе с лектором.Заимствованная лексика: нужна ли она языку и в каком количестве?В модуле пойдет речь о том, чем различные виды заимствованных слов отличаются друг от друга: какие заимствования можно назвать «варваризмами», а какие – экзотизмами; или, например, к какому виду заимствований можно отнести названия брендов. Лектором рассмотрены внеязыковые и внутриязыковые причины заимствований и освещен вечный спор архаистов и новаторов. Из материалов модуля слушатели узнают, в какие именно исторические периоды эти споры были особенно горячими и кто из писателей и видных общественных деятелей отстаивал в них различные точки зрения.«Победю» или «побежу»? (Морфологические и фонетические нормы современного русского языка)Лекции модуля посвящены ряду языковых трудностей: проблеме определения рода у несклоняемых заимствованных существительных; правилам, регулирующим образование отдельных форм глагола. Уделяется внимание вопросу о том, почему некоторые глаголы не образуют отдельные личные формы и как можно решить эту проблему. Фонетическая система русского языка сложилась достаточно давно: когда именно это произошло, что с тех пор изменилось и какие закономерности в области постановки ударения и произношения отдельных звуков и сейчас существуют – речь об этом также пойдет в данном модуле.«К слову не пришлось…» (Лексические и фразеологические нормы современного русского языка)Модуль посвящен таким лексическим явлениям, как синонимия и паронимия: говорится о том, что нужно знать о синонимах и паронимах, каких ошибок стоит избегать при их использовании. Еще один предмет обсуждения в модуле – идиомы. Практически в любом языке есть такое явление, как устойчивые выражения, имеющие яркий метафорический смысл. Лектор рассказывает о таких выражениях, бытующих в русском языке.Итоговый модуль курсаВ модуле подводятся итоги курса, освещаются основные тенденции, действующие в современной системе русского языка (демократизация языка, жаргонизация, упрощение и др.)\n                                    ", 
    "end_date": "2015-11-02T00:00:00Z", 
    "title": "Русский язык как инструмент успешной коммуникации", 
    "price": 0, 
    "instructors": "Нина Александровна Агапова (Nina A. Agapova)", 
    "institution_name": [
        "Tomsk State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/russian", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-09-14T00:00:00Z"
}