{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    يهدف هذا المساق لمساعدتك على تعلم اللغة الإنجليزية التي يمكنك استخدامها في الحياة العملية وبصورة فورية. وسيكون التركيز على لغة مهارات المحادثة في المستوى الإبتدائي، وسيتم إيلاء اهتمام خاص للجمل والمصطلحات المفيدة، بالإضافة إلى التركيز على طريقة الفظ الصحيحة.\r\nاستناداً إلى خبرة المجلس الثقافي البريطاني في تعلم وتعليم اللغة الإنجليزية، يعرض المساق فيديوهات قصيرة لمجموعة من المتعلمين الناطقين باللغة العربية مشاركين في دورة لغة إنجليزية لدى المجلس الثقافي البريطاني، وبالتالي، يمكنك الإطلاع على نوعية اللغة التي يتعلمونها المتعلمين. وسيتم تقديم هذه الفيديوهات والتعليق عليها من قبل مدرس لغة إنجليزية خبير من المجلس الثقافي البريطاني. سيقوم المدرس بإلقاء الضوء باللغة العربية على نقاط هامة متعلقة باللغة، وإعطائك نصائح مفيدة. كما ستحظى بالعديد من الفرص لممارسة اللغة من خلال اختبارات سريعة، ومناقشات ومن خلال استخدام برمجيات تم تطويرها خصيصاً لمساعدتك على تذكر كلمات وجمل جديدة.\r\n \r\nالمتطلبات المسبقة\r\nإذا كنت بدأت لتوك في تعلم اللغة الإنجليزية، فإن هذا المساق مناسب لك، حيث أنه يستهدف المبتدئين. ولكن حتى لو كان مستواك أعلى، فإن هذا المساق سيمنحك فرصة لممارسة اللغة وستجد فيه الكثير من النصائح القيمة!\r\n \r\nستتعلم في هذا المساق\r\n\r\nاللغة الإنجليزية للمحادثة التي يمكنك استخدامها في كثير من المواقف في حياتك اليومية مثل تقديم نفسك، والتحدث عن أعمالك الروتينية وخططك المستقبلية.\r\nالمصطلحات الأساسية مثل الأرقام ومعرفة الوقت.\r\nنصائح عن طريقة اللفظ الصحيحة.\r\nأمثلة عن كيفية إختلاف اللغة الإنجليزية عن اللغة العربية، التي من الممكن أن تكون مفيدة لعملية الفهم.\r\nنصائح عن أفضل الطرق والأساليب لدراسة اللغة، لمساعدتك على أن تكون أكثر كفاءة.\r\n\n\n                                    ", 
    "end_date": "2016-06-06T00:00:00Z", 
    "title": "تعلم الإنجليزية: مهارات المحادثة للمبتدئين", 
    "price": 0, 
    "instructors": "Ismail Asamail and Alan Keenan", 
    "institution_name": [
        "British Council"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edraak.org/course/course-v1%3ABritishCouncil%2BEng100%2B2016_Q2/", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Edraak"
    ], 
    "start_date": "2016-05-02T00:00:00Z"
}