{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/pkuacc\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/pkuacc-001/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    pkuacc-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    课程拟分中华文化起源、宗法制度、行政区划制度、职官制度、科举制度，以及岁时节庆、婚丧嫁娶、烹调饮馔、居室园林、书籍形态等专题，介绍古代中国社会的基本制度与总体特征，展现中国古代文化的独特风貌。帮助学员熟悉古代文化常识，理解与把握中国古代文化的总体特色，加深对历史与现实的认识。\n\n                                            Syllabus\n                        第一周 中华文明的肇基（刘玉才）一、中华文明发生的地理环境二、文明的肇基：从聚落到国家三、神话传说的寓意四、中华观念的建构 第二周 中国古代的宗法与家族（刘玉才）一、宗法制度的早期形态二、西周春秋时期的典型宗法制度三、中古时期的强宗大族与门阀制度四、宗法家族制度的重建与演变 第三周 中国古代的礼仪制度（刘萍）一、礼仪的起源二、礼仪的功能三、礼仪制度文献四、礼仪的分类五、古代礼仪举隅 第四周 中国古代的行政区划与历史地理（廖可斌）一、先秦时期行政区划制度的萌芽二、秦汉大一统帝国的郡县二级行政区划制度三、东汉末州郡县三级行政区划制度的形成及在魏晋南北朝的演变四、隋唐五代的行政区划制度：从回归二级制到再回归三级制五、强干弱枝：两宋时期的行政区划制度（含辽西夏金）六、元代的行省制度七、删繁就简：明代的行政区划制度八、清朝的行政区划制度九、中国古代行政区划制度演变的几条规律 第五周 中国古代的职官制度（廖可斌）一、先秦职官制度的确立与发展二、秦汉的三公九卿制三、魏晋南北朝时期官制的演变四、隋唐五代的中央三省六部制和地方官制五、宋朝的中央二府制和地方官制及辽金元官制六、明朝的中央内阁制与地方官制七、清朝的职官制度八、中国古代的官秩与勋爵 第六周  中国古代的科举制度（漆永祥）一、科举制以前的选官制度二、科举考试的程序与内容三、有关考官、考生与考场的各种规定四、科举考试的内容与考题五、科举考试中的作弊现象六、试帖诗、八股文举例七、中国古代科举制度简评 第七周  中国古代的书籍制度（杨海峥）一、书籍的起源二、简牍制度三、卷轴制度四、册页制度 第八周 中国古代的饮食文化(林嵩）一、饮食与礼仪二、饮食与人生三、饮食与政治四、饮食与美 第九周 中国古代的居室与园林（林嵩）一、丰富多彩的古建筑类型二、古代居室与园林的建筑特色三、古代居室与村落内部的功能区划分四、古典园林的分类与造园的简史五、古典园林的空间原则与置景艺术 第十周 中国古代的原始信仰与重要节日（刘萍）一、中国古代的原始信仰二、腊祭与春节三、墓祭与清明节四、端午节及其相关民俗五、祭月与中秋节\n                                    ", 
    "end_date": "2014-12-01T00:00:00Z", 
    "title": "中国古代文化", 
    "price": 0, 
    "instructors": "廖可斌 , 漆永祥 , 刘玉才 , 刘萍 , 杨海峥  and 林嵩 ", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/course/pkuacc", 
    "duration": "11 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-09-15T00:00:00Z"
}