{
    "selfpaced": false, 
    "topic_name": [
        "Language & Culture"
    ], 
    "description": "\n\n                    \n                    \n                    谈到中华传统文化，大家首先想到的莫过于以孔子思想为代表的儒学思想，但中华传统文化绝不止这些；谈到中医药，大家第一印象可能是针灸、按摩，因为她们已经走向全球，但中医药也远不止如此。医学、生物学飞速发展的21世纪，中医药学这一古老学科为什么还有生命力？她与现代医药学有何不同？为什么很多人觉得中医药知识体系不容易学习和掌握？因为：中医药学具有深厚的中华传统文化背景，如果不了解中华传统文化，就难以深入理解中医药学的思想和知识。\n本课程就是希望通过剖析中医药与中华传统文化的密切联系，使大家了解中医药学的中华传统文化的背景，更容易理解中医药的思维特征、思想特色和知识体系。通过本课程的学习，不仅能掌握一些中医药的基本知识、中医药养生的原理和方法，还能从中医药的视角认识中华传统文化的精髓。\n\n                                            Syllabus\n                        绪论什么是中华传统文化？什么是中医药？为何要学习中医药与中华传统文化这门课程？希望大家带着思考进入本模块学习！本章还就课程内容模块的设计进行简要介绍，便于大家按照知识图谱自主学习。\n走近中医药 本模块彭老师将从支持、反对中医药的不同观点入手探讨对中医药产生不同看法的时代背景和历史原因，如针灸如何被国际社会所接受、历次攻击中医药风波等；并从中医药起源、发展脉络进行历史回顾，使学习者对中医药有客观的认识。通过本模块的学习，相信大家对中医药会有更加全面、清晰的认识。阴阳思想漫谈 阴阳思想是存在于宇宙间的普遍规律，中医药学吸收了阴阳思想中合理化的内容，逐渐形成了中医药学的阴阳理论，从而为阴阳思想的传承和发展提供了客观载体。跳出中医药学学科本身，在现代自然科学、社会科学，乃至浩瀚无垠的宇宙中，阴阳思想又带给我们哪些思考？让我们在学习中进行思想的交锋！五行学说探析 从“五方说”、“五材说”发展到人们观察自然，了解社会的一种思维方式的“五行说”，五行学说的演变凝集了千百年来中华民族的智慧。事物、现象间的五行属性关联是怎样的？五行生克制化有何规律？通过本模块的学习，大家不仅能找到以上问题的答案，而且学会从合理性、局限性两方面认识五行学说。更重要的是通过五行学说的分析，大家能够思考如何将五行学说更好地用于健康领域的研究和实践。脏腑经络浅说 &amp; 药性理论解析 脏腑经络理论，药物药性理论是组成中医药理论知识体系的重要部分。脏腑理论与阴阳五行思想有怎样的联系？中医的脏腑和现代医学所称的脏器是否完全一样？经络是世界性科学难题还是子虚乌有？中药的四气五味、升降沉浮、毒性偏性又是怎样的概念？让我们带着思考一起进入本模块的学习吧。\n易文化与中医药 &amp; 儒学思想与中医药古老而神秘的易文化，有人觉得很难理解，有人觉得博大精深，究竟易文化对中医产生了哪些影响呢？儒学思想作为主流思想文化之一，又是如何与中医药学相互渗透、相互影响？让我们跟随彭老师的讲解一起开启中医药的传统文化基因之旅，从文化角度理解中医药知识体系的特征。道文化与中医药 &amp; 佛文化与中医药 在古代著名的医药学家中不乏知名道士，如魏晋时期的王叔和、东晋时期的葛洪、梁代陶弘景、唐代的王冰、孙思邈等，将道文化思想不断融入中医药学；道文化与中医药有着深厚渊源。而作为泊来文化的佛文化是否也对中医药产生了影响呢？让我们共同学习探讨！期末考试 本模块为期末考试，将检测你对目前为止中医药与中华文化中的重点知识的掌握。期末考试的得分将占总分的50％计入最后成绩。\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "中医药与中华传统文化 ", 
    "price": 0, 
    "instructors": "Peng Chongsheng", 
    "institution_name": [
        "Shanghai Jiao Tong University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/zhong-yi-yao-wen-hua", 
    "duration": "8 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}