{"selfpaced": false, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    With the advent of WebGL, it is now possible to develop high-quality, interactive 3D graphics applications, which run natively in web browsers. However, to do this, you need to be proficient in both web development and 3D programming.\n\nStart programming 3D graphics applications for the web\n\nThis free online course will provide web developers, who have  existing knowledge of JavaScript, with the theoretical and practical knowledge to start programming 3D graphics applications for the web.\n\nMost graphics courses start with the very basics. In this course, we take a top-down approach, starting with very high-level scene-editing tools, before drilling down and creating applications with increasing levels of complexity.\n\nLearn to use WebGLStudio and Three.JS to create WebGL applications\n\nThe course is split into five weeks. In the first two weeks, Javi Agenjo will teach you the basics of 3D graphics from a non-programmer’s point of view, explaining concepts such as transformations and materials using a state-of-the-art web tool, WebGLStudio. There will be no programming in these two weeks.\n\nWeeks 3, 4 and 5, however, are 100% programming-based. After showing you how to set up your computer for local development of WebGL applications, Alun Evans will lead you through the process of creating a series of simple scenes using the most common and popular library for creating WebGL applications, Three.JS.\n\nIn the final week, you will be able to load in meshes and textures from external sources, place lights and objects within a scene, and move the camera interactively.\n\n\n\n                                    ", "end_date": "2016-08-08T00:00:00Z", "title": "3D Graphics for Web Developers", "price": 0, "instructors": "Alun Evans", "institution_name": ["Pompeu Fabra University"], "commitment": "6 hours", "subject_name": ["Programming"], "course_url": "http://www.futurelearn.com/courses/3d-graphics-web-programmers?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-07-04T00:00:00Z"}