{"selfpaced": true, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    It's time to dig in and build something big. In this course, we're going to take the tools we've learned, Flask, Peewee, and Python itself, and build a small social network. We'll have user registration, user authentication, strongly hashed passwords, form validation, and more.\r\nWhat you'll learn\r\n\r\nUser registration and authentication\r\nPassword hashing\r\nForm validation\r\nJoins\r\n\n\n                                            Syllabus\n                        Making Strong Users \r\nWe won't get far in our social application with out users. Let's make sure their passwords are stored correctly and strongly, too.\r\nTakin' Names \r\nUsers need a way to sign up and sign in to our site. We'll need to validate their information, create our model instances, and store their session information. Luckily, we have a few handy libraries to do a lot of that for us!\r\nBroadcasting\r\nOur app needs messages posted by the users. Let's give them a model, a form, and the views necessary so they can tell the world what they're up to.\r\nHow to Win Friends\r\nThe final ingredient in any social site is the ability to follow people. We'll need to add a new model, a couple of views, and tweak a template or two. We'll also want to change a query or two to get the full social experience\r\nTacocat Challenge\r\nNow that you've built an app along with me, and another in code challenges, try and build one on your own. You have a full suite of tests to validate your work.\n                                    ", "end_date": null, "title": "Build a Social Network with Flask", "price": 25.0, "instructors": "", "institution_name": [], "commitment": "4-5 hours", "subject_name": ["Programming"], "course_url": "http://treehouse.7eer.net/c/259799/289773/3944", "duration": null, "language_name": ["English"], "provider_name": ["Treehouse"], "start_date": "2016-06-07T00:00:00Z"}