{"selfpaced": true, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    Express is a \"Fast, unopinionated, minimalist web framework for node.\" In this course you'll learn how to build an Express site from scratch!\n\n                                            Syllabus\n                        Getting Started with Express \r\nExpress is the most popular web server for Node.js. Self described as a “Fast, un-opinionated, minimalist web framework for node.js.”, Express is open and flexible, allowing you to write only the code that you need, and nothing more.\r\nDeveloping Express Apps Like a Boss\r\nAs a developer “how” you work is just as important as “what” you are working on. Having the right tools and strategies at your disposable can make the difference in a successful and on time project.\r\nThe Request and Response Objects in Express\r\nThe request an response object house all of the complex information that goes into HTTP requests made to Express, and the HTTP responses that it delivers.\r\nThe request and response objects themselves can appear complex at first. And they are! The reality is that they save you, the developer, tons of time.\r\nIn this stage you'll learn how to use the HTTP request and response objects.\r\nUsing Templates with Express\r\nTemplates are common across all web frameworks and are commonly used in many different kinds of web applications. In this stage, you will learn about the Jade template engine and its syntax.\r\nServing Static Files in Express\r\nStatic files, like JavaScript, CSS, and images, are a central part of any any website. Express comes with a built in middleware to serve static files, suitable for use in development and for sites with smaller amounts of traffic.\r\nDoing more with Express\r\n \r\nIn this stage you will learn some ways you can use Jade syntax to make development easier.\r\nAdditionally, you'll learn how to use the Express generator to quickly set up a new express project.\n                                    ", "end_date": null, "title": "Express Basics", "price": 25.0, "instructors": "", "institution_name": [], "commitment": "3-4 hours", "subject_name": ["Programming"], "course_url": "http://treehouse.7eer.net/c/259799/289742/3944", "duration": null, "language_name": ["English"], "provider_name": ["Treehouse"], "start_date": "2016-06-07T00:00:00Z"}