{"selfpaced": false, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    What you’ll achieve:\n\nIn this project-centered course*, you’ll design, build, and publish a basic website that incorporates text, sound, images, hyperlinks, plug-ins, and social media interactivity. We’ll provide you with step-by-step instructions, exercises, tips, and tools that enable you to set up a domain name, create an attractive layout for your pages, organize your content properly, ensure that your site functions well across different operating systems and on mobile devices, keep your site safe, and finally, let people know your site is online. We’ll even show you how to track your visitors. Throughout the course, you'll engage in collaboration and discussion with other learners through course forums and peer review.\n\nOnce you complete your first website project using Wordpress, you can move on to our optional, extended module that covers more advanced techniques such as using a simple text editor, coding in HTML, CSS, and Javascript, and more.\n\nWhat you’ll need to get started:\n\nThis project-centered course is designed for learners who have little or no prior experience developing a web site. You will need a computer with a stable Internet connection. We’ll use Wordpress to get you started, provide lots of downloadable examples, and guide you through the process of giving and receiving constructive peer-to-peer feedback.\n\n*About Project-Centered Courses: Project-centered courses are designed to help you complete a personally meaningful real-world project, with your instructor and a community of learners with similar goals providing guidance and suggestions along the way. By actively applying new concepts as you learn, you’ll master the course content more efficiently; you’ll also get a head start on using the skills you gain to make positive changes in your life and career. When you complete the course, you’ll have a finished project that you’ll be proud to use and share.\n\n                                            Syllabus\n                        Module 1: Prepping Your SiteIn Module 1 you will learn the mechanics of the internet, and start planning your own site. You'll articulate a purpose for your design and pick fonts and a color scheme to match. We won't use Wordpress yet; next module you will learn how to create your vision on the web.Module 2: Starting to work with WordpressModule 2 contains the bulk of the work for this course. In this module you'll create an outline for your site, set up Wordpress, choose a theme and publish your first page. Then we'll show you how to add links to other pages on the internet.Module 3: Add Media, Social Media and LaunchIn Module 3 you'll add media such as images, videos and sound to your site. You'll also learn how to incorporate social media. Once you're happy with your site, you'll test it on mobile platforms and multiple browsers before you go public and start counting the visitors to your site.Module 4: Go Deeper with Further CustomizationModule 4 contains more resources for you to customize your site, with some information about backend programming such as CSS and HTML. We will be adding more resources as we (and some Coursera web developers) create them.  \n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "How To Create a Website in a Weekend! (Project-Centered Course)", "price": 0, "instructors": "Jennifer Adams and Margaret Schedel", "institution_name": ["State University of New York"], "commitment": "", "subject_name": ["Programming"], "course_url": "https://www.coursera.org/learn/how-to-create-a-website", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}