{"selfpaced": true, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    Get started creating web pages with HTML and CSS, the basic building blocks of web development. HTML, or Hypertext Markup Language, is a standard set of tags you will use to tell the web browser how the content of your web pages and applications are structured. Use CSS, or Cascading Style Sheets, to select HTML tags and tell the browser what your content should look like. Whether you are coding for fun or planning to start a career in web development, learning HTML and CSS is a great place to start. \r\nWhat you'll learn\r\n\r\nDefine HTML and CSS\r\nAdd and change HTML tags\r\nModify CSS attributes\r\nLearn the structural foundation of web pages and applications\r\n\n\n                                            Syllabus\n                        Getting Familiar with HTML and CSS \r\nLearn the basic structure of a web page, how HTML and CSS are used to change the structure and appearance of web pages, and how HTML and CSS fit into the larger world of web development.\r\nHTML: The Structural Foundation of Web Pages and Applications\r\nHTML is a series of tags that tells web browsers how to render, or display, a web page. You will wrap the content in these tags to describe the elements on the page and how they should be structured. Learn some useful and commonly used HTML tags and how to use them to start building your web pages.\r\nMake It Beautiful With CSS\r\nCSS, or Cascading Style Sheets, is a system for selecting HTML tags and defining their appearance. From the text, color and alignment, to the height, width and space between them, learn a few different ways to select and style HTML elements using CSS.\r\nAdding a New Web Page\r\nBy adding a resume page to the example project, you will get a quick and simple introduction to setting up an HTML document and linking a CSS stylesheet.\n                                    ", "end_date": null, "title": "Introduction to HTML and CSS", "price": 25.0, "instructors": "", "institution_name": [], "commitment": "2-3 hours", "subject_name": ["Programming"], "course_url": "http://treehouse.7eer.net/c/259799/289775/3944", "duration": null, "language_name": ["English"], "provider_name": ["Treehouse"], "start_date": "2016-06-07T00:00:00Z"}