{"selfpaced": false, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    The third part of the MOOC series \"Web Engineering\" completes our Web Engineering Specialisation Program:\r\n\r\nWeb Engineering I: Basics of Web Development (level 1 = beginners)\r\nWeb Engineering II: Developing Mobile HTML5 Apps (level 2 = intermediate)\r\nWeb Engineering III: Web Application Quality Assurance (level 3 = advanced)\r\n\r\nIn this part of the course, you will master the maintenance challenges that come with continuously building, testing, and deploying HTML5 apps. In addition, you have the opportunity to particpate in an offshore development project for two weeks in September. This project will prove that you have learnt the tools and skills necessary for a Web professional.\r\nWhat will I learn?\r\nBy the end of this course, you will be able to:\r\n\r\nPrepare virtual environments for developing, testing, and deploying Web apps\r\nKnow how to compile test plans and scripts for performance and browser testing of Web apps\r\nInstall, configure, and use tools for build automation and QA processes\r\n\r\nProvided that you take part in the offshore Scrum development project, you will learn the tools and skills for Web app development in a distributed team in a continuous delivery environment.\r\nWhat do I have to know?\r\nYou must have a profound knowledge of developing Web apps. For the learning objectives of build automation and quality assurance, it is necessary to provide a working Web app of your own. This is either the mash-up app participants developed in Web Engineering II as term project or any meaningful Web app you have developed elsewhere. Your app must be Open Source.\n\n                                    ", "end_date": "2014-09-29T00:00:00Z", "title": "Web Engineering III: Quality Assurance", "price": 0, "instructors": "Klaus Quibeldey-Cirkel", "institution_name": ["Technische Hochschule Mittelhessen"], "commitment": "8 hours", "subject_name": ["Programming"], "course_url": "https://iversity.org/courses/web-engineering-iii-quality-assurance", "duration": "18 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2014-05-26T00:00:00Z"}