{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li><strong>(NEW) Updated for April 2016.  Join 2,000+ viral students.  Here's w</strong><strong>hat they're</strong><strong> saying</strong> about the course:</li></ul>\n\n<p>\"<em>A Must. The content is\nabsolutely phenomenal.  And Matt\nis really passionate in helping his students out. Truly awesome</em>.\"</p>\n\n\n\n\n\n\n\n<p><em>\"</em><em>One of the most\ncomprehensive and detailed courses on Udemy. If you're serious about growing\nyour online presence. This is a must. Matt doesn't just educate you on the\nsubject. [He] also shows you what you need to do and how to do things to hack\nyour online ventures in to growth. The course is worth every minute! Will\nrecommend to anyone who wants to learn.\"</em></p>\n\n\n\n\n\n\n\n<p><em>\"Wow...there's so much information in this course that I'm going to have to watch it again and again...fantastic.</em><em>\"</em><br></p>\n\n\n\n\n\n\n\n<p>In this course, you'll learn to:</p>\n\n\n\n\n\n\n\n<ul><li><em>5x your existing growth and conversion rate<br></em></li><li><em>Add 1,000s of leads and subscribers to your list<br></em></li><li><em>See where your visitors are dropping off and how to fix it<br></em></li><li><em>Bring cart abandoners back to your site and guarantee 10x ROI<br></em></li><li><em>Introduce virality into every aspect of your marketing campaigns<br></em></li><li><em>Price your product or service using 30+ rare techniques<br></em></li><li><em>Optimize the one goldmine on your site you probably pay no attention to<br></em></li><li><em>Create high-converting landing pages and CTA buttons<br></em></li><li><em>Test every element on your site for performance<br></em></li><li><em>Use sales psychology to increase transactions and prices<br></em></li><li><em>Write copy that gets attention, clicks and generates sales<br></em></li><li><em>Use screen recordings, heatmaps and your visitors’ actions to increase profit<br></em></li><li><em>Make your pages load faster and improve your rankings in the search results</em></li></ul>\n\n\n\n\n\n\n\n<p>in addition to all of the ideas and strategies in the course, I’ve included a presentation from Neil Patel, the co-founder of Quicksprout, Kissmetrics and Crazy Egg and $175 in advertising credits.</p>\n\n\n\n\n\n\n\n<p>All of the lessons are <strong>screen recorded in HD 1080p</strong> so you can see everything I mention during the lectures (check out the free preview sections).</p>\n\n\n\n\n\n\n\n<p>And there’s also a checklist at the end of each section with a link to every website you see in the videos.  </p>\n\n\n\n\n\n\n\n<p>I’ll personally be answering any questions you have and I’ll be happy to provide links, resources and <strong>any help I can offer you </strong>in improving your site’s traffic and sales.  </p>\n\n\n\n\n\n\n\n<p>I’ll also be updating the course every month with new tactics and approaches to growth hacking so thatyou’re<strong> always up-to-date.</strong></p>\n\n\n\n\n\n\n\n<p>At this point, you've read the reviews, you know about the bonuses and you've got me on call.</p>\n\n\n\n\n\n\n\n<p><strong>Click Take This Course </strong>at the top right and <strong>5</strong><strong>x your growth and conversion rate</strong>. Every second you wait is just lost traffic and sales!</p>", 
    "end_date": null, 
    "title": "(NEW) The 2016 Complete Growth Hacking & Conversion Course", 
    "price": "25.00", 
    "instructors": "iMarket XL, Matt Jensen", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649056_69f2_13.jpg", 
    "course_url": "https://www.udemy.com/growth-hacking-conversion/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T18:31:15Z"
}