{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Have You Ever Been Frustrated Because You Want To Build Your Email List As A Fiction Author, But You Have No Idea What To Give Away As A Lead Magnet?</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Face it. You can be the best author on the planet. And you can have the coolest books, with the best settings, plots, and characters.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>But if you don't have an awesome lead magnet, then you'll never be able to get a single subscriber.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So Ask Yourself How This Would Feel...</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>How would it feel if you could finally prompt your readers to subscribe, in a totally cool way, all the while building massive rapport and authority with them?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So they would thank you for offering something totally awesome, and even branded yourself, your characters and your books at the same time?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Would that feel good?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">If That's The Case, You'e Going To Love This Course!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So you can brainstorm with me, a grizzled email marketing veteran, about these 10 awesome lead magnet ideas for fiction authors.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So you can finally start to build your list. Even if you've struggled to come up with a cool lead magnet idea before.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So How Much Is This Course Worth?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Well, imagine if you had to pay a lead generation expert, or an email copywriter to help you come up with these lead generation ideas?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>How much would that cost? A few hundred bucks? Or more?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Plus, there's the time aspect of it. Imagine if you had to bang your head against the wall to come up with these ideas... How much would it be worth to skip the headache?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>For that reason, I think you can agree that you're getting in for a mere pittance of its true value!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If any of this makes sense to you, and if it feels good, then I'll see you on the inside!</p>\n\n\n\n\n\n\n\n\n\n<p><strong>At This Point You Have Two Choices...</strong></p>\n\n\n\n\n\n\n\n\n\n<p>You can keep doing what you're doing. Keep writing fiction books, while NOT building your list. But how has that been working for you?</p>\n\n\n\n\n\n\n\n\n\n<p>Your other choice, is to enroll in this course now. So you can finally start building a list  of your fiction readers, so you can finally start taking control of your own destiny as a fiction author.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>Enroll Now So You Can Finally Turn Your Fiction Books Into A Raging River Of Email Subscribers, While Being Totally Cool With Your Readers!</em></strong></p>", 
    "end_date": null, 
    "title": "10 Perfect Lead Magnet Ideas For Fiction Authors", 
    "price": "20.00", 
    "instructors": "Mike DeVincent", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/808512_d552_2.jpg", 
    "course_url": "https://www.udemy.com/10-perfect-lead-magnet-ideas-for-fiction-authors/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-30T20:34:23Z"
}