{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>** Update May 2016 - Now the highest rated conversion optimization course on Udemy! **</p><p>Benefit from the hottest new online marketing technique - conversion rate optimization. Hours of best practices for conversion optimization, web analytics, web usability and A/B testing to quickly boost your website sales or leads - without needing more traffic!</p>\n\n<p>  \t<strong>The results you'll love:</strong> 100's of extra sales or leads from your site per month - converting a much higher percent of your visitors into sales (from your existing traffic).  </p>\n\n<p>  \t<strong>What my new students are already saying:</strong> <em>I found myself actually jumping in, tweaking my web pages! I really like that not only is it lecture content, but also videos of actual websites with the instructor showing what is good and bad about them. This is a course that will be generating revenue for you for years to come! Mark A. Pitman</em></p>\n\n<p>  \t                          ---------------------------------------------------------------------------------------------------------  </p>\n\n<p>  \t<strong>The awesome benefits you get from taking this course:</strong>  </p>\n\n<ul>  \t<li>  \t  \t\t<strong>Much greater sales or </strong><strong>leads from your website and current traffic </strong>- all without having to spend more money on driving new visitors.  \t  \t</li>  \t<li>  \t  \t\t<strong>Significantly higher-conversion rate </strong><strong>for your website</strong>, converting a much bigger percentage of your existing visitors into leads or sales.  \t  \t</li>  \t<li>  \t  \t\t<strong>Visitors raving about your website, </strong>returning in droves to convert and recommending it to their friends.  \t  \t</li>  \t<li>  \t  \t\t<strong>Competitors wondering how your website converts much better than theirs</strong>, taking many of their visitors &amp; customers away  \t  \t</li>  \t<li>  \t  \t\t<strong>Ultimately, much greater online revenue </strong>for your business!  \t  \t</li>  </ul>\n\n<p>  \t<strong>Why this course, and what you will learn:</strong>  </p>\n\n<ul>  \t<li>It's a great course all about conversion rate optimization (CRO) - this is essential to maximize your website sales &amp; profits! </li>  \t<li>I'll show you secrets that high-converting websites do to increase sales &amp; leads, like Amazon and SEOmoz.</li>  \t<li>I'll reveal to you CRO, web analytics, web usability and A/B testing techniques pro's use to quickly boost sales/ leads – for all types of websites.</li>  \t<li>Delivered in 31 days of video lessons stepping you through what you need to become a highly-converting website.</li>  </ul>\n\n<p>  \t<strong>    What makes Rich Page an expert?  </strong>  </p>\n\n<ul>  \t<li>I've helped improve conversions and sales for many 100's of websites over the last 10 years, ranging from Disney and Vodafone's to small ecommerce stores and lead generation sites.</li>  \t<li>I'm the author of two major books on conversion rate optimization - 'Website Optimization: An Hour a Day' and 'Landing Page Optimization' with Tim Ash.</li>  </ul>", 
    "end_date": null, 
    "title": "Boost Website Sales Fast with Conversion Rate Optimization", 
    "price": "50.00", 
    "instructors": "Rich Page", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276062_a977_3.jpg", 
    "course_url": "https://www.udemy.com/cro-learn-the-secrets-of-highly-engaging-converting-websites/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-06T16:10:53Z"
}