{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Este es un curso donde te cuento como empezar a aumentar tus followers en Twitter.  En mi caso tengo un trabajo que me apasiona y que al mismo tiempo me absorve mucho tiempo. Es por ello que solo puedo invertir en formas de<strong style=\"\"> generación de nuevos seguidores que me ocupen poquísimo tiempo.</strong></p><strong style=\"\">Al completar mi curso, los estudiantes serán capaces de:</strong><p style=\"\">- Tener una estrategia para conseguir miles de seguidores en Twitter en un tiempo relativamente corto (de 3 a 4 semanas).</p><p style=\"\">- Conocer herramientas básicas que le ayudarán a implementar el anterior punto.</p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">¿Quién debería seguir este curso? ¿Quién no debería hacerlo?</strong></p><p style=\"\">- Aquellos que quieran tener un alto impacto en su nicho con Twitter deberían seguir este curso. </p><p style=\"\">- Aquellos que quieran tener 20.000 seguidores en Twitter con prácticamente esfuerzo nulo no deberían seguir mi curso.</p><p style=\"\"><br style=\"\"></p><p><strong style=\"\">¿Qué necesitarán saber o hacer los estudiantes antes de empezar el curso?</strong><br style=\"\"></p><p>Los estudiantes necesitan tener una cuenta de Twitter y tener un conocimiento básico de redes sociales.</p><p><br style=\"\"><strong style=\"\"></strong></p>Estoy convencido de que aprenderás en el curso y que lo pasarás bien. Porque al fin y al cabo cuando lo pasas bien aprendes mucho más.<p>No tienes excusa. Recuerda que <strong style=\"\">la acción siempre supera a la no iniciativa</strong>. ¡Nos vemos en el curso! <br style=\"\"></p>", 
    "end_date": null, 
    "title": "Como conseguir 20.000 followers de alta calidad en Twitter", 
    "price": "35.00", 
    "instructors": "Albert Serrano", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/173646_0c7d_4.jpg", 
    "course_url": "https://www.udemy.com/como-conseguir-20000-followers-de-alta-calidad-en-twitter/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-27T04:54:10Z"
}