{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>LAST UPDATE: October 5, 2015</strong>  </p>  <p>  \t<strong>JOIN OVER 1,400 SUCCESSFUL STUDENTS USING MY 7 STEP STRATEGY TO DRIVE HUNDREDS OF THOUSANDS OF VISITORS TO YOUR WEBSITE, EVEN IF IT IS BRAND NEW, WITH ZERO SEO SKILLS!</strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>Here's my promise: </strong>You will make your money back on this course in just 2 weeks!  No BS!  </p>  <p>  \t               In January 2014, I started an eCommerce business with zero SEO experience.  I knew I needed immediate traffic and sales to earn money in order to reinvest.  I decided to take a completely non-convention route, and started selling 5 figures a month without any advertising budget or traffic from Google.  So far this year, I have sold nearly <strong>$85,000 through unconventional strategies discussed in this course.</strong>  </p>  <p>  \t<strong><em>UPDATE: I ENDED 2014 WITH JUST SHY OF $100,000 IN TOTAL SALES!</em></strong>  </p>  <p>  \t                   This course provides a detailed strategy on driving traffic to your new website without a large advertising budget or SEO experience, and then how to convert that traffic in sales.  You do not need ANY technical background to take this course, as the techniques discussed are for people just getting started in eCommerce.  </p>  <p>  \t                   I've shared these tips with many other successful eCommerce entrepreneurs, and based on the success others have seen, decided that there is great value in sharing the strategy.  From taking this course, you WILL create many streams of traffic to your website WITHOUT spending lots of money on advertising.  </p>  <p>  \t                 I enjoy engaging with all students who take this course, and bouncing ideas off other Internet Marketers.  If you sign up for this course, you can communicate with me whenever you'd like 1:1.  If there are topics that you'd like for me to discuss on this course that aren't currently included, please let me know so I can put together a lecture series!  </p>", 
    "end_date": null, 
    "title": "Drive Thousands to Your Website with Zero SEO Knowledge", 
    "price": "25.00", 
    "instructors": "Josh Ludin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276332_afed.jpg", 
    "course_url": "https://www.udemy.com/drive-traffic-to-your-website-with-zero-seo-knowledge/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-07T01:43:46Z"
}