{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Udemy's Flagship Growth Hacking Course! // v3.2</strong> <strong class=\"redactor-inline-converted\">Updated on </strong><strong class=\"redactor-inline-converted\">June 12th, 2016</strong></em></p>\n\n<p>Learn how to use lean analytics, web traffic metrics, digital conversion funnels, LTV &amp; CAC calculations, social media, viral marketing, public relations, SEO, inbound marketing, email marketing, and paid acquisition to grow fast.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">A Digital Marketing Toolkit for the Connected Economy at Your Fingertips</strong></p>\n\n\n\n<p>Learning to think and market like a growth hacker puts you on an even playing field with the big firms in Silicon Valley and once you have these skills, you'll have a knowledge base that enables you to excel as a modern digital marketer. The demand for digital marketing skills continues to increase and when you know how to attract and retain customers through online channels, you'll be a valuable asset to any team.</p>\n\n\n\n<p>This flagship course was developed in partnership with leading instructional designers. You'll apply the concepts as you learn, read about growth hacks, and learn from beautifully-animated learning modules developed by our animation team (read: no boring power point slides here!). </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Complete Digital Marketing Package for Growth Hackers</strong></p>\n\n\n\n<p>This course begins by helping you use key marketing tools like persona development, target market interviewing, and “buying center\" analysis to establish your approach to growth. Then, you'll develop analytical skills that will enable you to understand what's working, where it's working, and what needs to be changed. You'll start with a section on web traffic analysis before moving onto lean analytics. Then you'll develop the ability to design and track digital conversion funnels which, when combined with lifetime customer value (LTV) and customer acquisition cost (CAC), will enable you to find opportunities to bring new customers into your ecosystem on a revenue-positive basis.</p>\n\n\n\n<p>In the second half of the course, you'll develop a user-centric approach to marketing. You'll start with a section on the new social media marketing landscape and then move on to viral marketing and public relations. Then, you'll get a crash course in SEO for online destinations as well as for content marketing so that you can ensure that your content is discoverable on the web. The email marketing section will introduce you to automated email marketing strategies and also develop your ability to use email marketing platforms to manage a group of email list subscribers. The course wraps up with a section on paid acquisition and online advertising so that when you have an advertising budget, you'll know how to use it.</p><p><em class=\"redactor-inline-converted\">Version 3.2 Release Notes:</em></p>\n\n<ul><li>You have an updated study guide that is better synchronized to the lectures and further study resources in the course. Happy learning!</li></ul>\n\n<p><em class=\"redactor-inline-converted\">Version 3.1 Release Notes:</em></p>\n\n<ul><li>We've added a premium tutorial for you in the Google Analytics part of the Growth Hacking Series. In this live event rebroadcast, you'll see how to call specific data from your Google Analytics properties, leverage it to create automatically-updating dashboards, and publish these dashboards to a private site. Think of this as your business or entrepreneurial HQ. For those of you who have board members, investors, or teammates, you can select the people who will have access to these dashboards so that your team can use data to drive good decisions. Enjoy!</li></ul>\n\n<p><em class=\"redactor-inline-converted\">Version 3 Release Notes:</em></p>\n\n<ul><li>Woohoo <strong class=\"redactor-inline-converted\">Growth Hacking 3</strong> is here and the course is better than ever. Using feedback from the Eazl lead users crew, the Udemy learning team, and other student feedback, we've made a whole host of upgrades! The course is now more project-based, so you'll be able to use sections as you need them to achieve outcomes related to your growth objectives. We've also trimmed out some of the more outdated exercises and SideBYSides and replaced them with fresh content. As a part of this upgrade, there are all new intros in the course and it has been totally re-structured. You also have access to a brand new interview with Peter van Sabben that was recorded in Amsterdam in the Winter of 2015. Peter is one of Europe's leading growth hackers and the co-founder of Growth Tribe, the first ever growth hacking program sponsored by a university (the University of Amsterdam) and backed by Facebook. <strong><em>To see a full content upgrade journal, see the final lecture of the course.</em></strong></li></ul>", 
    "end_date": null, 
    "title": "Growth Hacking with Digital Marketing Masterclass (v3.2)", 
    "price": "30.00", 
    "instructors": "Davis Jones, Team  Eazl, Team Eazl, Team Eazl", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496924_8ed7_10.jpg", 
    "course_url": "https://www.udemy.com/growth-hacking-masterclass-become-a-digital-marketing-ninja/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-08T16:56:31Z"
}