{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">JOIN OVER 3,000 SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE</strong></p><p><em style=\"\"><strong style=\"\">Come with me on a journey to build your amazing email list ... in only 2 hours!</strong></em></p><p><strong style=\"\"><em style=\"\">UPDATES: Following the techniques here described, my list has gone up from 50 subscribers to 800 in only 6 months. That&#039;s 14x more subscribers! The best part? It is a self perpetuating machine. Once is set up, you can forget about it!</em></strong></p><p><em style=\"\">Over 3.000 students have already enrolled - and have left over 30 x full 5 Star amazing reviews because it works! Also, the course has been fully updated for May 2015</em></p><p>Have you heard about the power of &quot;<strong style=\"\">Building Your List</strong>&quot;?<strong style=\"\"></strong></p><p>Since I started focusing in Growth Hacking, I have put all my efforts in building a self-perpetuing email list building machine and I am going to teach you what REALLY works.</p><p>My experiments have <em style=\"\">really paid off.. and those that worked are now here revealed.</em><em style=\"\"></em></p><p>I know average <strong style=\"\">+100 new email subscribers every month </strong>in my niche, growth hacking and I want to tell you how I did it! The numbers keep on growing the every month I collect more emails than the month before and that&#039;s fantastic. More Emails, more Money!</p><p><strong style=\"\">OVER 15.000 STUDENTS HAVE ALREADY ENROLLED IN ALL MY GROWTH HACKING COURSES!</strong></p><p>In October 2014 I started with an email list of Zero. Let me tell you how I did it!</p><p>Every single technique which I reveal in this course is <strong style=\"\">easy to put into place in minutes </strong>- and can give you a <strong style=\"\">massive email list in a very short </strong> period of time<strong style=\"\">.</strong><span></span></p><p>I keep on testing more and those that are successful will be added to the course -<strong style=\"\"> at no extra cost for you</strong>! This is a course that will continue to grow for you!<strong style=\"\"></strong><strong style=\"\"></strong></p><p>As well as the Udemy 30 day guarantee, you have my personal promise that you will be <strong style=\"\">happy and delighted </strong>by what you&#039;ll learn in the next 2 hours.</p><p>What this course is not:</p><p><em style=\"\">I do not cover here how to scrape websites and cold email others, as this course is to find legitimate email addresses with the permission and interest of their owners</em></p><p><em style=\"\">If you want my personal experience when building an email list and automating it (remember, I have done that and I do not work on building my list any more) take this course and get ready to learn!</em></p><p><strong style=\"\">Every minute of delay is actually COSTING money ...</strong></p><p><strong style=\"\">Enroll Now!</strong></p>", 
    "end_date": null, 
    "title": "Grow Your E-Mail List w/These 20+ Growth Hacking Strategies!", 
    "price": "50.00", 
    "instructors": "Laura Moreno Cabanillas", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437930_3bf3_4.jpg", 
    "course_url": "https://www.udemy.com/get-emails-20-growth-hacking-activation-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T20:58:43Z"
}