{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t      Growth hacking has been defined many ways. I liked this definition the best. <strong>Growth hacking</strong> is a marketing technique used by many startups which uses creativity and analytical thinking to gain more exposure or sales or whatever your goal is. It&#039;s all about being creative and finding ways to use tools out there to help you reach your goals.  </p>  <p>  \t      We are going to be using these social networks to create actions to interact with others to achieve our goals.  </p>  <ul>  \t<li>About me</li>  \t<li>Reddit</li>  \t<li>Linkedin</li>  \t<li>Twitter</li>  </ul>  <p>  \t      These social networks give us access to a very large amount of people as well as tools to initiate contact and make connections with them. If you don&#039;t know how to use these networks for marketing, you could end up spending hours just talking with people and not directing them to your website. I have felt the <em>pain and difficulty</em> of launching a brand new website and trying to get people to check it out.  </p>  <p>  \t      You will learn in this course techniques like  </p>  <ul>  \t<li>creating a large amount of initial contacts with new people  </li>  \t<li>sending the direct message that converts</li>  \t<li>avoiding being banned from your account</li>  \t<li>posting for marketing</li>  </ul>  <p>  \t      I wanted to give a course that had you guys <strong>immediatley interacting with the social networks </strong>and building your followings. The more people we can contact the better. The best way to learn growth hacking is by doing it and that is what we are going to do.  </p>", 
    "end_date": null, 
    "title": "Growth Hacking With Social Networks", 
    "price": "40.00", 
    "instructors": "Joshua Cavin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309282_1435_5.jpg", 
    "course_url": "https://www.udemy.com/growth-hacking-with-social-networks/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-28T04:58:42Z"
}