{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>Join One of the Web's Leading Professional Development Communities!</strong></em></p>\n\n<p><em>Updated to Version 2.8 on January 15, 2016</em></p>\n\n<p>In this fun, interactive foundation course, you'll learn how to leverage one of Silicon Valley's most interesting marketing exports. <strong>Ideal for entrepreneurs, managers, new digital marketers, and anyone who is new to growth hacking.</strong> After taking the course, you'll know how to be growth-oriented, how to channel this mindset into your organization's broader mission, and how to evaluate the success of digital initiatives.</p>\n\n<p><strong>Fun HD Videos, Expert Interviews, and a Collection of Downloads</strong></p>\n\n<p>You have access to 2+ hours of HD video, complete with a series of concept videos produced in Eazl's design-forward style (read: <em>there are </em><em>no boring slideshows inside!</em>), a series of short tutorials that you can use to leverage the power of Google Analytics, and two interviews with marketing technologists, including an <strong>exclusive interview with James Kenler, the Director of Marketing Operations and Technology for CareerBuilder</strong>. You also have access to a collection of exclusive guides as well as cutting edge research related to user psychology, industry benchmarking, and the origins of Silicon Valley's growth-oriented mindset.</p>\n\n<p><strong>30-Day Money Back Guarantee</strong></p>\n\n<p>    If you aren't satisfied with our work, you have a 30-day, money back guarantee, so there's no risk involved in enrolling. <br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Growth Hacking 101: Traffic Measurement and Google Analytics", 
    "price": "25.00", 
    "instructors": "Reva Minkoff, Davis Jones, Team Eazl, Team Eazl", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431088_b1cc_2.jpg", 
    "course_url": "https://www.udemy.com/silicon-valley-mindset/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T15:42:37Z"
}