{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Learn how to be a Growth Hacker in this comprehensive course on Growth Hacking, Digital and Online Marketing. </strong></p><p>Become a true online marketing professional starting from almost any level of knowledge. It sounds crazy, but by the end of this course, as long as you go through every lesson and do the exercises, you'll be able to offer almost any business some REAL help - enough to earn you more direct business or a healthy consulting fee. In fact, after you complete this course,  you will have earned the right to add \"Growth Hacker\" to your byline or business card! </p><p>You should take this course if you are a business person that wants to do their own online marketing, a seasoned marketing pro that wants to add new skills as a Growth Hacker, or if you're a web designer or blogger that wants to start offering real digital marketing to your services. </p><p><strong>The BEST part of this course could be how you will learn to use Social Media platforms like Facebook, YouTube and LinkedIn to move your pages up the search, and income ladder.</strong></p><p><strong>Marketing Professionals will learn Growth Hacking, including:</strong></p><ul><li>Keys to effective content marketing</li><li>Expert level PPC with Google AdWords and Bing/Yahoo Network</li><li>How to set up Social Media Accounts for attracting, converting and retaining customers</li><li>Best practices for Marketing Automation and EMail marketing</li><li>Lead capture strategies</li><li>Landing page design (and how to maximize CONTENT as a landing page)</li><li>How to use Facebook Groups to rocket growth</li></ul><strong>Business Owners, Web Designers and New Online Marketers will learn Growth Hacking, including:</strong><ul><li>The basics of domains and setting up a WordPress website</li><li>Using email marketing and automation to convert visitors into customers</li><li>Attracting MORE website visitors (and in-person visitors)</li><li>Best, safest search engine marketing and optimization techniques available</li><li>How to set up a YouTube Channel and use video to market, drive visits and retain customers</li><li>How to set up a Facebook Business Page and what to do to have THAT show up in search</li><li>Where you can find up to 30% more visitors -that will never find you otherwise!</li></ul>There is a LOT of ground covered in this course, with about 15 hours of video, and it is a LIVING course, so it will be edited and added to on a regular basis. But don't worry! I promise to present all the information in a clear and understandable format.<p><strong>Here's what you can expect from this Course:</strong></p><p>61 or more Lectures</p><p>Extra Activities with most lectures under the \"Do it Now\" heading</p><p>Both Presentations and Live video demonstrations</p>", 
    "end_date": null, 
    "title": "Growth Hacking: Using Facebook, Google, YouTube for Growth", 
    "price": "20.00", 
    "instructors": "Mark Stephenson", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495360_327e.jpg", 
    "course_url": "https://www.udemy.com/become-a-growth-hacker-learn-digital-marketing-earn-more/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-06T19:56:37Z"
}