{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>OVER 5,800 SUCCESSFUL STUDENTS HAVE ALREADY TAKEN THIS COURSE</strong></p><p>  \t   The biggest mistake many online marketers make is not building their email list from the very start. Building your email list is <strong><em>vital </em></strong>if you want to make money online. Using landing pages can help increase the chances of your website visitors turning into loyal fans and increases the odds of them buying from you in the future.  </p>  <p>  \t   This course will teach you how to use LeadPages to get more of your website visitors to subscribe to your email list which will ultimately <strong><em>make you more money</em></strong>.  </p>  <p>  \t   The simple fact is, it's much easier to double your email opt in conversion rate than it is to double your website traffic. Creating high converting landing pages using LeadPages is both quick and easy and this course walks you through how to use the software on your own website.  </p>  <p>  \t   As part of this course [lecture 4], I've included the <strong>first 3 chapters of my book</strong> <em>'</em>The New Rich<em>'</em> which you have permission to use as your own lead magnet to increase sign ups to your own email marketing list, providing that the content remains unchanged.</p><p><strong>About this course:</strong></p><ul><li><em>Over 5,800 successful students</em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li></ul><p><strong>About the course creator</strong></p><p>David Moore is a serial entrepreneur and online business coach who helps frustrated employees escape the jobs they hate by starting their own freedom business. </p><p>His purpose is to help turn your passion into a thriving business whilst avoiding the same mistakes he did by giving you the expert advice, resources and tools you need to succeed. </p><p>You can have your own WordPress website up and running today, right after going through this course. </p><p><strong>Click the \"take this course\" button, top right, now ... <em>every hour you delay is costing you money</em>...</strong></p>", 
    "end_date": null, 
    "title": "How To Use Leadpages To Grow Your Email List & Bank Balance", 
    "price": "20.00", 
    "instructors": "David Moore", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/246560_50eb_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-leadpages-to-grow-your-email-list/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-19T14:26:03Z"
}