{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t              Have you heard of my &quot;Turbo Traffic Secrets&quot;?<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">This is the ultimate micro step-by-step course in ultra fast traffic generation techniques!<br style=\"\">  \t<br style=\"\">  \t    PLEASE NOTE: I am always adding in new sections and more videos to keep the course updated!</strong>  </p>  <p style=\"\">  \t              I&#039;ve been making an increasing amount of money selling my books and products online since I started to experiment with what REALLY works to generate web traffic.  </p>  <p style=\"\">  \t<em style=\"\">My experiments have really started to paid off ... and those that worked are now revealed here for the very first time.</em>  </p>  <hr style=\"\">  <p style=\"\">  \t              I now can generate over 100,000 visitors to my web page, blog, sales page, ecommerce store, shopify or udemy course page in less than 1 hour! And that&#039;s not just one lucky day! That&#039;s every week, week after week after week.  </p>  <hr style=\"\">  <p style=\"\">  \t              I generated over 100,000 in traffic to my landing page and sold over 200 units of my new eBook in less than 40 minutes by following this course, that&#039;s now a conversion of 0.20% netting me over USD 4,000 in less than 60 minutes.  </p>  <p style=\"\">  \t        Please note I make no guarantees on the conversion, sign ups or amount of money you can make using this system and it would be ludicrous for me to do so. What I am demonstrating is what I do and what has worked for me.  </p>  <p style=\"\">  \t              So, I know these experiments now work - Every single technique which I reveal in this course is easy to put into place in minutes - and could give you instant returns.  </p>  <p style=\"\">  \t              Nothing is kept secret - I reveal all I know ... and as I test even more things, those that are successful are added to the course - at no extra cost to you! This is a course that will continue to grow and grow.  </p>  <p style=\"\">  \t              As well as the Udemy 30 day guarantee, you have my personal promise that you will be impressed and amazed by what you&#039;ll learn in less than an hour.  </p>  <p style=\"\">  \t              Enrol now an learn how to turbo charge your traffic to any website, sales page, udemy course or facbook page!  </p>  <p style=\"\">  \t              Sign up now!  </p>", 
    "end_date": null, 
    "title": "How I got 100K Visitors in 1hr - Super Turbo Traffic Secrets", 
    "price": "20.00", 
    "instructors": "Richard Santoro", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420292_2b8c_3.jpg", 
    "course_url": "https://www.udemy.com/get-100k-visitors-in-1-hour-with-super-turbo-traffic-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T15:47:16Z"
}