{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<em>LATEST: Course Updated On February, 2016 To Include The Following Lectures:</em>  </p>  <ul>  \t<li><em>Case studies of different companies &amp; how they reached 1,000,000 users</em></li>  \t<li><em>How to make cornerstone SEO pages that rank</em></li>  \t<li><em>Lecture on how to write better headlines that increase click-through rates</em></li>  \t<li><em>Full section on how to promote Amazon/Kindle books and become a best seller</em></li>  \t<li><em>SEO strategies to make almost any page rank in top-10</em></li><li><em>Improved audio/video quality for almost all lectures</em></li></ul>    <p>  \t<em>* OVER 5,000 DELIGHTED STUDENTS HAVE TAKEN COURSE</em>  </p>    <p>  \t<strong>Now with OVER 12 hours of tutorials and over 130 lectures!</strong>  </p>  <p>  \t                                                            This course is <strong>designed to make you a great marketer</strong> in a very short amount of time. In the course, you will learn top social media marketing strategies, how to do SEO (search engine optimization), and even some of the effective offline marketing strategies.  </p>  <p>  \t                                                            The course gives you a wealth of information with over 8 hours of video lessons. There are over 90 lessons on various marketing topics.  </p>  <p>  \t                                                            The course is made up of 5 parts. The first part of the course is meant to give you very solid marketing fundamentals. The second part of the course goes over some of the top offline marketing strategies, many of which we can then take and use in our online marketing strategies. The third part of the course goes over top social media marketing strategies. The fourth part of the course covers SEO (search engine optimization). And the fifth part of the course covers unique tutorials for how to market specific products or websites.  </p>  <p>  \t                                          In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with private questions. I answer 99% of questions within 24 hours. I love helping students who take my courses and I look forward to helping you.  </p>  <p>  \t                                                            All advice in this course comes from things I have done personally. So there is no guessing and no theory. I know the ins and outs of every tactic I suggest because I use them all in my own business. Additionally, I am an author of a marketing book on how to reach 1,000,000 people with your marketing efforts. Many of the suggestions in the marketing book are made into lessons in this course. So by the end of this course I am confident that you will be a great marketer!  </p>  <p>  \t                                                            I wish you good luck with your business, and sincerely hope that this course will help you!  </p>  <p>  \t                                                  +++++++++++++++++++++++++++++  </p>  <p>  \t                                                  MONEY BACK GUARANTEE  </p>  <p>  \t<em>The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em>  </p>", 
    "end_date": null, 
    "title": "Marketing strategy to reach 1,000,000 people", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184636_92a8_3.jpg", 
    "course_url": "https://www.udemy.com/marketing-plan-strategy-become-a-great-marketer/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-18T14:30:39Z"
}