{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Aprende a posicionar tu negocio en la primera página de Google para búsquedas localizadas, y consigue así que tu negocio destaque, más posicionamiento de marca y más clientes, entre otras muchas ventajas.</p><p style=\"\"><strong style=\"\">Posiciona tu negocio en la primera página de Google, tras los resultados de pago y justo antes de los resultados orgánicos de Google gracias a Google My Business.</strong></p><ul style=\"\"><li style=\"\">Aprenderás a analizar y posicionar palabras clave.</li><li style=\"\">Verás que cuentas tienes que crear y como configurarlas en tu web.</li><li style=\"\">Conseguirás optimizar los factores internos de tu sitio web (Google Analytics, Herramientas para Webmasters, Sitemap, textos dentro del sitio web...).</li><li style=\"\">Aprenderás a optimizar los factores externos (Citaciones, YouTube, directorios).</li><li style=\"\">Serás capaz de construir y verificar tu ficha de Google My Bussines.</li><li style=\"\">Harás un análisis de tu competencia.</li><li style=\"\">Verás diferentes estrategias para potenciar los factores externos que influirán en tu posicionamiento.</li></ul><p style=\"\"><strong style=\"\">Los resultados de Google My Business se muestran en la primera página de Google.</strong></p><p style=\"\">Google tiene más del 95% de las búsquedas en España, el 97% de los consumidores realiza búsquedas online de empresas locales buscan su teléfono, dirección, etc.</p><p style=\"\">Los resultados de Google My Business se muestran en la primera página de Google para la mayoría de las actividades de negocio cuando van seguidas del nombre de una ciudad o código postal o bien cuando nuestra IP está localizada</p><p style=\"\"><em style=\"\">Por Ejemplo:</em></p><p style=\"\"><em style=\"\">Diseñadores en Albacete, </em><em style=\"\">Rayos Uva en Huelva, </em><em style=\"\">Fotógrafos en Barcelona, </em><em style=\"\">Pilates en Jaén, </em><em style=\"\">Dentista en…, </em><em style=\"\">Fontaneros en …</em></p><p style=\"\">Al hacer las consultas así, Google muestra primero los resultados de pago, si los hay, después aparecerán los resultados de Google My Business.</p><p style=\"\"><strong style=\"\">Contenido y Procedimiento</strong></p><p style=\"\">El curso está compuesto por un total de 36 clases, todas en vídeo, que suman un total de 4 horas y 4 cuestionarios de evaluación que te permitirán evaluar si has comprendido los conocimientos mínimos, de los contenidos del curso.</p><p style=\"\">En él aprenderás a posicionar tu negocio en la primera página de los resultados de búsqueda de Google gracias a Google My Business y al análisis de palabras clave, el cual vas a aprender a realizar, a través de herramientas como Semrush.</p><p style=\"\"><strong style=\"\">Aprenderás a optimizar los factores internos</strong> (Google Analytics, Herramientas de WebMaster (ahora Google Search Console), sitemap, geositemap, optimizar textos dentro de nuestra web), <strong style=\"\">así como los factores externos</strong> (citaciones en Flickr y Panoramio, crear subir y optimizar vídeos en YouTube, directorios más relevantes, análisis de la competencia y estrategías), para asegurar el éxito.</p><p style=\"\">Además, verás como construir tu ficha perfecta para Google My Business y a verificarla.</p><p style=\"\">Dado que es mucha la información que vamos a manejar y a obtener, al comenzar el curso ponemos a tu disposición una plantilla de excel para que la mantengas organizada y localizada siempre que la necesites.</p><p style=\"\">El aprendizaje está dividido en pasos y es importante ir haciendo cada paso, y las tareas en él indicadas, en el mismo orden que se va indicando, e incorporar la información obtenida en tu excel.</p><p style=\"\">Estoy segura de que obtendrás los resultados deseados.</p><p style=\"\"><strong style=\"\">Alcázar Marín Ruiz</strong></p><p style=\"\"><strong style=\"\">Experta en Marketing de La </strong><strong style=\"\">Primera Telecomunicación S.L.</strong></p>", 
    "end_date": null, 
    "title": "Posicionamiento local con Google My Business. SEO", 
    "price": "50.00", 
    "instructors": "- LaPrimera.net", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528420_5aaa_3.jpg", 
    "course_url": "https://www.udemy.com/posiciocinamiento-local-con-google-my-business-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T08:55:01Z"
}