{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Ready to grow? Then let&#039;s skip the hypothetical and get into the tactical. This course will arm you with 19 proven, actionable, and no BS growth hacks to help you grow.</strong>  </p>  <p style=\"\">  \t        I hate the term growth hacker, but I love the concept. The idea that you can grow a business from 0 to thousands of customers without much of a marketing budget is a beautiful thing, and very much the result of growth hacks — free marketing tactics that grow traffic, brand, links, and eventually, a customer base.  </p>  <p style=\"\">  \t        Moz is my fourth startup, and at each one, the same question has kept me up at night: <strong style=\"\">What can we do to expedite growth?</strong> You see, an early-stage company is never lacking time and effort, it&#039;s lacking tactics — tactics that earn customers without relying on a big budget.  </p>  <p style=\"\">  \t<strong style=\"\">  This course was created to change that. To arm you with the tactics you need to grow.</strong>  </p>  <p style=\"\">  \t <strong style=\"\">All of the video lectures, eBooks, and worksheets are download-enabled.</strong> If you have a slow internet connection, or want to take this course with you on your laptop, smartphone or other portable device, sign up and download all the videos and other course materials now.  </p>  <p style=\"\">  \t<strong style=\"\">Time to start growing, s</strong><strong style=\"\">ign up now to get lifetime access to this course. With Udemy&#039;s 30-day money-back guarantee, it&#039;s risk-free.</strong>  </p>", 
    "end_date": null, 
    "title": "Startup Growth Hacking: 19 Actionable and Advanced Tactics", 
    "price": "30.00", 
    "instructors": "Andrew Dumont", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94702_1ae5_11.jpg", 
    "course_url": "https://www.udemy.com/startup-growth-hacking-advanced-tactics/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-19T23:22:15Z"
}