{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tInstead of teaching the &quot;10,000 foot view&quot; of Inbound marketing, we decided to just layout the exact steps to actually DO IT, rather than just learn about it.  </p>  <p>  \tWe say that sincerely, because it is easy to just SELL knowledge that makes students feel like they are learning something. It is a practice we have noticed is so profitable that the internet is filled with NOISY information that keeps people “LEARNING” and NOT DOING.  </p>  <p>  \tPretty much, we decided to take out as much all of the guess work that goes into inbound marketing, by laying out the exact directions on how to do it in the most comprehensive manner.  </p>  <p>  \tIt’s comprehensive because it works with every single industry that we have used it for.  </p>  <p>  \tSimply, if you have ever struggled with blogging, offer creation, getting people to your site, developing relationships with visitors to buy your product, this is the class for you.  </p>  <p>  \tAdditionally, if you have ever been interested in launching a blog, passive income, launching a product, or making money on your passion, this is the class for you.  </p>  <p>  \tThe class is an extremely comprehensive approach to inbound marketing but the things you build within the process saves you so much time in the future for your blog, website, product, or project.  </p>  <p>  \tHow long will this class take you? Depends on who you are:  </p>  <ul style=\"\">  \t<li>You have Absolute Dedication and Curiosity: 1 Week (Straight)  \t<ul style=\"\">  \t\t<li>College Students (who are debating between the 40+ year retirement age)</li>  \t\t<li>Internet Entrepreneurs (who understand the power of a Step-by-Step Process)</li>  \t\t<li>Solo Entrepreneurs (who are serious about launching a company)</li>  \t</ul>  \t</li>  \t<li>You have a job and are trying to learn a new skill (1 month)</li>  \t<li>You do inbound marketing but have projects and workflows in place (1 month)</li>  \t<li>You work in marketing but only want to learn this stuff “for work” (1 month)</li>  </ul>  <p>  \tThe class features the exact workflow we use to  </p>  <ul style=\"\">  \t<li>Learn everything about our industry and product</li>  \t<li>Identify every single important person/ company that can contribute to our company&#039;s growth</li>  \t<li>Determine mathematically, what our audience cares about and how to produce information on it</li>  \t<li>Develop a &quot;conversion path&quot; from our content</li>  \t<li>&quot;Plan and kickstart&quot; Years worth of Campaigns ready for Production</li>  </ul>  <p>  \tWe even are giving the tools we use:  </p>  <ul style=\"\">  \t<li>Worksheets that streamline Brainstorming</li>  \t<li>Worksheets that streamline Decision Making</li>  \t<li>Worksheets that streamline Planning an Infinite amount of Campaigns</li>  \t<li>Worksheets that help you Visualize entire complex Proccesses</li>  \t<li>Spreadsheets that include formulas that streamline our entire research process  \t<ul style=\"\">  \t\t<li>This basically gives you software.</li>  \t</ul>  \t</li>  </ul>  <p>  \tThis course is structured like this:  </p>  <ul style=\"\">  \t<li>Brief Video Lecture (Covering the Minimum you need to actually do Inbound Marketing)</li>  \t<li>Screencasts of the exact step by step you will be doing</li>  \t<li>Worksheets that streamline the step by step processes</li>  \t<li>Google Documents (spreadsheets &amp; documents) to use in every step of the process</li>  </ul>", 
    "end_date": null, 
    "title": "Step-by-Step: 100% Data Backed Inbound Marketing Strategy ", 
    "price": "50.00", 
    "instructors": "Mark Espanol", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420284_735c_8.jpg", 
    "course_url": "https://www.udemy.com/inbound-marketing-bootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T15:36:28Z"
}