{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><strong>**This course is completely updated and tailored to help you achieve great results in 2016! Let's make this year a great one guys**</strong></strong></p><ul>  \t<p>I will offer Skype support to any student who asks for it.<br></p>  </ul>  <p>  \t<em><em><strong>-------------------------------------------------------------------------------------------------------------</strong></em></em>  </p>  <p>  \t<strong><strong>Would you like to learn how to instantly drive crazy amounts of targeted traffic to your website, blog or squeeze page ?</strong></strong>  </p>  <p>  \t                                  Would you like me to teach you the secrets and little known techniques to get this traffic in no time at all ?  </p>  <p>  \t                                   Can you follow the easy instructions I will lay down for you in order to get more visitors than you can handle, using <strong>free methods ?</strong>  </p>  <p>  \t                                   If you answered « yes » to any of the questions above, congratulations. This traffic course is definitely for you.  </p>  <p>  \t<strong><strong>Let me help you !</strong></strong>  </p>  <p>  \t                                  In this course,<strong><strong>I will teach </strong></strong><strong>every step of the process. This course also comes with an ebook to help breeze through the course.</strong>  </p>  <p>  \t                                   Better yet, the learning curve for this course is very short. Watch it once and you'll be ready to go. Monkey sees monkey does.  </p>  <p>  \t                                   ·Do you need/want more visitors, exposure and sales/leads ?  </p>  <p>  \t                                   ·Do you have very low starting capital, or wish to invest as little money as possible?  </p>  <p>  \t                                   ·Are you busy and want to get things done as fast as possible?  </p>  <p>  \t                                   ·Do you want your website to rank higher in search engines ?  </p>  <p>  \t                                  If you answered « yes » to <em><em>these </em></em>questions, <strong><strong>then consider this course to be your blueprint to success.</strong></strong>  </p>  <p>  \t                                  Having a great website, blog or product isn't enough. You need to get it in front of as many eyes as possible, and I can teach you to do so. Traffic will make or break your business.</p>  <p>  \t                                   Upon enrolling, you will get my personal help. I will answer any question that you may have in the member's area, and I also offer Skype support if needed.  </p>  <p>  \t<strong><strong>I would like to remind you that this traffic course comes with a 30 days « no questions asked » money back guarantee. </strong></strong>You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk !  </p>  <p>  \t                                  You can get started driving traffic right after you have taken my course -That means <em><em><strong>TODAY!</strong></em></em>  </p>  <p>  \t                                  Click the \"Take This Course\" button now. That's your first step to building a huge pool of visitors from scratch. Every minute that goes by without action is one<strong><strong> potential customer gone.</strong></strong>  </p>  <p>  \t                                   Cheers!  </p>  <p>  \t                                   Howard  </p>", 
    "end_date": null, 
    "title": "Targeted Traffic By Tonight - 11 Ways To Drive Free Traffic!", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357824_1ef3_4.jpg", 
    "course_url": "https://www.udemy.com/10-fast-easy-ways-to-drive-traffic/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-27T15:31:40Z"
}