{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  &quot;Learn everything you can, whenever you can, from whoever you can! Time  will come when you will be grateful to yourself.&quot; ~ Sarah Caldwell  </p>  <p style=\"\">  </p>  <p style=\"\">  \t          In this course, I&#039;m going to publish <strong style=\"\">the formula of 40 surely awesome startup steroids</strong>, <strong style=\"\">and as a bonus, the secrets of eternal life, too. This course is short, focused, and concise to meet the startup mentality.</strong>  </p>  <p style=\"\">  \t          These methods are all <strong style=\"\">proven, possible ways of the optimization</strong>, so if you really do your job, they can highly increase the number of visitors and the conversion. Moreover, they are mostly automatic, so once you screw them together the machinery will be unstoppable! Growth Hacking techniques must be eventually used by someone at your startup, otherwise you will meet the same fate as several other companies, where even polished and perfected products couldn’t prevent losing hope of growth and success... <strong style=\"\">Because it’s not attending meetups, developing apps, living on pizza or securing a VC what really makes you a Startup, but if you quickly acquire lots and lots of users</strong>. If you grow rapidly, everyone will want to accompany you, and you’ll proceed on your way like a chainsaw in a butter! As long as you maintain growth, you’ll be a rock star. Nothing and no one will hold you back...  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t          In addition, you will <strong style=\"\">also get an</strong> <strong style=\"\">EXCLUSIVE LAW COURSE about the differences, and common myths (and realities!) of the European and American legal system, </strong>especially regarding Startup companies<strong style=\"\">, so you will learn how to protect your Startup and product</strong>, and other intellectual property.  </p>  <p>  \t<strong style=\"\">All of the videos are SUBTITLED in english</strong> to give you a mental handhold and make it easier to trace back and follow, and they are <strong style=\"\">also DOWNLOADABLE in HD Quality! So you can take them with yourself on your notebook, tablet and smartphone.</strong>  </p>  <p>  \t<strong style=\"\">Take this course now, to get a lifetime access, and download the videos today, it&#039;s risk-free! </strong>Your satisfaction is guaranteed, or else you&#039;ll get your money back <strong style=\"\">with Udemy&#039;s  30-day money-back guarantee.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"> </strong>  </p>", 
    "end_date": null, 
    "title": "The Mysterious Growth Hacking & Startup Law Course", 
    "price": "50.00", 
    "instructors": "Roland Zonai", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425264_2df5_3.jpg", 
    "course_url": "https://www.udemy.com/the-mysterious-growth-hacking-startup-law-course/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T20:25:32Z"
}