{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>What separates those who make millions a year to those who make nothing on their website?</p><p>If you have ever wondered what the secret is to increase your income online is then I have the answer for you - the answer to your question is simple...<br></p><p><strong>TRAFFIC! TRAFFIC! TRAFFIC!</strong></p><p>A website without quality traffic will fail. It is not rocket science, it is just plain fact. You can have the best designed website in the world and the best product/service ever, but with no visitors to the site the website is like a dead shop. </p><p>To be consistently making an income on your website, you need people looking at your website and your products/services on it.</p><p><strong>So, if you want to increase your profits from your website, then increase your traffic.</strong></p><p>Now you know just how important website traffic is to your online business, I am going to help you get the traffic you need to start generating income online. Best of all, I'll show you how to get consistent free traffic to your website.</p><p>I have assembled a one of a kind 26 part modules, an intensive online coaching program so you can finally uncover the most profitable methods for promoting your business online.</p><p>This training is going to show you my entire arsenal for driving serious traffic to your websites. You can choose to drive little or massive traffic. The more traffic sources you focus on, the more traffic to your website.</p><p>Ready to drive some traffic?</p><p>To get started click on \"Take this Course\"</p>", 
    "end_date": null, 
    "title": "The Ultimate, Step-by-Step Guide to Free Website Traffic", 
    "price": "20.00", 
    "instructors": "Basim Salim", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660784_351b_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-step-by-step-guide-to-getting-free-website-traffic/", 
    "currency": "USD", 
    "subject_name": [
        "Growth Hacking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T05:14:23Z"
}