{"selfpaced": false, "topic_name": ["Music"], "description": "\n\n                    \n                    \n                    This course is not college students about the composer Johannes Brahms and his last works for piano. This will have the vision and valuable tips from masters of the instrument: Dimitri Bashkirov, Emanuel Krasovsky, Vitaly Margulis, Pavel Gililov, Mihail Voskresensky Joaquin Achúcarro, Galina Eguiazarova, Joaquín Soriano ... In the course we will have so much material theoretical and practical structured into 10 modules of one week each. The first module is an introduction to the historical context of Romanticism, modules 2 and 3 and focus on the figure of Brahms and from the 4th, we get filled with the chosen piece: the Intermezzo no. Less than 2 in the op. 116. The 4 has a more theoretical content, as it focuses on the analysis of the piece and the main technical issues that we will find, and the remaining modules from 5 to 9 correspond to the lectures of five of the aforementioned piano pedagogues.\r\nKnowledge required:\r\nAimed at students and piano enthusiasts who are at least 4 years of regulated or unregulated studies of the instrument. Must have fluency in reading scores and be familiar with the technique and piano performance\n\n                                            Syllabus\n                        Module 0. Presentation\r\nModule 1. Piano music in Romanticism\r\nModule 2. Knowing Brahms and his pianistic legacy\r\nModule 3. Approach to cycle for piano op. 116\r\nModule 4 Study of a selected part. Intermezzo in A minor op. No. 116. 2\r\nModule 5. Interpretive Approach Intermezzo in A minor op. No. 116. 2 master Vitaly Margulis\r\nModule 6. Interpretive Approach Intermezzo in A minor op. No. 116. 2 master Mikhail Voskresensky\r\nModule 7. Interpretive Approach Intermezzo in A minor op. No. 116. 2 master Dimitri Bashkirov\r\nModule 8. Interpretive Approach Intermezzo in A minor op. No. 116. 2 master Emanuel Krasovsky\r\nModule 9. Interpretive Approach Intermezzo in A minor op. No. 116. 2 master Pavel Gililov\n                                    ", "end_date": "2016-06-07T00:00:00Z", "title": "El Romanticismo en el piano: Johannes Brahms", "price": 0, "instructors": "Mercedes Guantes", "institution_name": [], "commitment": "2 hours", "subject_name": ["Art & Design"], "course_url": "https://miriadax.net/web/romanticismo-piano-johannes-brahms-2ed", "duration": "10 weeks", "language_name": ["Others"], "provider_name": ["Miríada X"], "start_date": "2016-03-29T00:00:00Z"}