{"selfpaced": true, "topic_name": ["Music"], "description": "\n\n                    \n                    \n                    Learn and practice the basic principles of running an effective music ensemble rehearsal.  Techniques and strategies are applicable to a variety of ensembles, including bands, orchestras, choirs, and chamber groups.\n\n                                            Syllabus\n                        An Introduction to RehearsingThis week, Module 1, we’ll discuss basic philosophical issues such as: What we do in rehearsals, what skills are needed, and the idea of the conductor as “the composer’s advocate.” I will also introduce the concept of Macro-Micro-Macro, which serves as the overarching principle of rehearsals. Then we will move on to basic conducting technique.Communicating with the EnsembleModule 2 begins with a discussion about repertoire: how to define quality music and how to choose a balanced, musically nourishing program. Building on the topics of Module 1, this week’s conducting technique videos focus on the grammar for starting and stopping pieces. In the rehearsal technique videos, the overarching topic is how to communicate with the ensemble to convey musical intent. Essentially, the idea is to give musical instruction, but there are a range of strategies we must master to be effective in all situations.This week introduces those strategies and organizes them according to modes of instruction, including performance technique, adjectives, analogy, and modeling.Introducing the Rehearsal ToolkitWeek 3’s material begins with more left hand technique, expanding on the concepts introduced in Module 2 and continuing with gestures to show dynamics. The section on rehearsal technique begins with an explanation of the ‘Rehearsal Toolkit,” a collection of ideas, or “tools,” each designed to fix a musical issue. Rehearsal tools are meant to supplement the modes of instruction that were discussed last week. In other words, in addition to using direct vocabulary, modeling, and metaphor and analogy, these tools can elicit musical responses when gesture and words fail. A caveat: all of these approaches depend on the musicians having the technique required to perform the repertoire. This may seem obvious, but the fanciest baton twirl and colorful analogy are meaningless to help, say, a trumpeter, perform staccato if he does not tongue properly and employ good embouchure. Fundamentals must be taught, either in or out of the rehearsal, and the appropriate method depends on the level and age of the musician in the ensemble.Module 3 concludes with multi-purpose tools, including singing and “bopping.” These are the Swiss-Army knives of rehearsal technique, each useful for a variety of issues, from articulation to balance to rhythm. As you acquire the tools discussed in this module, also consider what else you can put in your toolbox. What techniques do you currently use? What tools can you borrow from other musicians? The more options we have in rehearsal the more likely we will be to solve a musical problem.Articulation, Balance, and ToneModule 4 begins with perhaps the most crucial task a conductor undertakes: score study. Score study is the umbrella term for the process of thoroughly learning a score-- not just knowing how to sing the melody or memorizing phrases and meters--but learning every aspect of the music that may come to bear on our ability to interpret, conduct, rehearse, and perform it. Unlike many grammatical aspects of conducting, score study is a time-consuming, immersive activity for which it is normal to develop one’s own process, assuming the end result is a deep understanding of the work.\n\nAfter score study, Module 4 moves back to the grammar of conducting, particularly technique for conducting articulations. Please note that this week also contains a very brief introduction to the three types of fermatas. In Module 5 we’ll cover them in detail. These are topics for which regular practice and self-evaluation will be necessary to develop gestures that are clear to the ensemble and second-nature to the conductor.\n\nFinally, we will return to “The Rehearsal Toolkit” and explore strategies for rehearsing articulation, balance, and tone. This final topic includes a video on using the piano to demonstrate harmonies and other musical features to the ensemble. Particularly in educational settings, it is important for the conductor to do more than treat the ensemble as his personal musical instrument. Instead, find opportunities to lead ensembles to an understanding of the music it is performing, a goal that only score study makes possible.PhrasingModule 5 begins with a discussion about score marking, a topic that is controversial by some ways of thinking. One school of thought suggests that scores should never be marked with cues and other information, since doing so reflects a deficit in score study on the piece. Another school believes that judicious marking enhances our efficiency in rehearsal and allows for better connection with the ensemble. This module also includes detailed explanations of the three types of fermatas that were introduced in Module 4: caesura, release-in-tempo, and continuation. It is worth spending extra time on these techniques, as the skills involved in preparing, sustaining, and releasing each one apply to a variety of conducting situations, including cues, rubato, and accompanimental conducting. For rehearsal strategies and the rehearsal toolkit our topics are phrasing and dynamics. As with many other topics in this class we can only touch the surface in terms of depth, but I hope there will be a few ideas to begin filling your rehearsal toolkit.Accompanimental Conducting and IntonationModule 6 (our final week!) begins with a brief discussion about planning rehearsals, moves to techniques for accompanimental conducting, and then dips into the Rehearsal Toolkit for intonation strategies. The intonation section includes an introduction to overtones, harmonics, and temperaments. These are acoustic concepts for which at least a basic understanding is useful for knowing how to achieve good pitch. It’s a fascinating topic, and a great example of how we can apply science to art. The final few videos cover a miscellanea of rehearsal topics, including protecting one’s ears, the use of a podium, and set-up issues.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Fundamentals of Rehearsing Music Ensembles", "price": 0, "instructors": "Evan Feldman", "institution_name": ["The University of North Carolina at Chapel Hill"], "commitment": "4-6 hours", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/music-ensembles", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}