{"selfpaced": false, "topic_name": ["Music"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                                    &gt; Music\n                                                            \n                            \n                                                \n                    \n                    \n                    Using a simple and enjoyable teaching style, this course introduces the novice listener to the wonders of classical music, from Bach fugues to Mozart symphonies to Puccini operas.\n\n                                            Syllabus\n                        What Is Music?Every day around the world, billions of people listen to music of one sort or another, and millions listen to Western classical music.  Why do we do it?  Because it’s fun?   Because it energizes or relaxes us?   Because it keeps us current, allows us to understand what’s happening in past and popular culture?    The pull of music--especially classical music—has never been explained.   The aim of this course is to do just that:  To explicate the mysteries and beauties of some of Western cultures greatest musical compositions—among them masterpieces of Bach, Mozart, Beethoven, Wagner, and Puccini. We begin with the elements of music, breaking classical musical into its components of pitch, duration, and sound color, allowing us to better understand how music works.   Next, we proceed to the compositions themselves, starting with the Middle Ages and Renaissance, to show how Western music developed in ways unique to the West.  Ultimately, we reach the masters, commencing with Bach. What makes his music great?   Why does it move us? What should we listen for? And so we proceed down through Western musical history, visiting virtually the people who created it and the places where they did so. By the end, we hope all of us have become more human (enriched our personalities) and had a rollicking good time!How Music Works, it's Magic.What is Music? Is music simply the organization of sounds and silences passing through time? Or is it more? Poet Victor Hugo believes music is \"what feelings sound like.\" In this first module, we’ll take apart Hugo’s seemingly simple statement by spending some time asking how and why music induces strong emotions in people across different cultures. We’ll begin with a look at the inner workings of the human ear to determine how our brains process sound waves.  Then, we’ll travel to different parts of the world, comparing and contrasting both traditional and popular Western music with sounds from various regions and cultures. You’ll find that it is both culture and the physics of music that determine why we like the music we like!  From there, we’ll be ready to take a look at the basic elements of musical composition; rhythm, melody, texture, etc. We’ll also learn how classical composers used these elements in some of their most famous works and how modern artists are still using them today. Finally, we will see how the elements of musical composition have evolved over time and how they have been translated to a universal language enjoyed and understood by millions.The Sound of MusicHave you ever wondered what it is that makes music sound sometimes rich and luxurious and sometimes strange and mysterious? Well, you’re in luck because this module, we’ll explore what the nature of simultaneous sounds and textures. We’ll start off with a look at chords, specifically how the three types of triads– tonic, dominant, subdominant– build a foundation upon which a melody can be constructed. Once we understand the rules of musical syntax, we’ll be ready to learn about musical progressions including the three types of cadences.We’ll also look at major and minor triads and how they work. Then, we’ll learn how to hear the bass and focus on the harmony of a song. Finally, I’ll talk you through the four families of musical instruments–brasses, percussions, strings, and woodwinds---and the various musical textures, forms, and styles that they can create.  How exciting!Music Back in the DayWe will cover a thousand years in musical evolution during this modules lectures! We'll start with the Middle Ages taking a look at its functional chants and dance music, then we’ll move to the period of the Renaissance, and finish off by listening to the ornate melodies of opera heard throughout the early Baroque period. From this, you’ll begin to see how advances in musical notation allowed compositions to become both more specific and more complex. These advances are ultimately responsible for focus being shifted away from the performers and towards the composers themselves.Along the way, we’ll highlight some of these musical inventors and innovators, such as Hildegard of Bingen and Johann Pachelbel. We’ll also have the unique opportunity to see (and in some cases even hear) many of the instruments that were popular during these different time periods. This will be a real treat, made possible with help from Yale instructor, Grant Herreid. Many thanks are owed to him!The Baroque EraNovelists, poets, painters, mathematicians, and even geologists talk about \"fugue-like\" structure in their media and disciplines.   But what is a fugue and how did we get it? To find out, we enter the world of Baroque music and famed master of the fugue, Johann Sebastian Bach.     First, we'll get a chance to \"live\" during the Baroque period by taking a detailed look inside the life, career, and even home of Bach-- explore where and how Bach and his family lived, discuss Bach’s music, and talk about the techniques of Baroque music as a whole.      Next, Bach’s music will then be compared and contrasted with that of his exact contemporary and fellow German, George Frideric Handel. One might say that Bach was an idealist and Handel was a realist when it came to music, so we’ll look at how these personality traits informed each composer’s musical style.        Finally, we'll wrap up the module with an introduction to music of the Classical Period, and who better to lead the way than the inimitable Wolfgang Amadeus Mozart?The Classical EraWould you believe that once upon a time, musical compositions were viewed as disposable, one-time-use entertainment?  Could you imagine an orchestra attempting to perform a beautiful piece over the sounds of noisy patrons in a casino? How about a violin being drowned out by a dog loudly barking outside of a café? Well, this was the reality before the turn of the 18th century. It wasn’t until around 1800 that people began to appreciate musical compositions, as they do today. This was the same time we started to see large concert halls created specifically for the purpose of listening to concerts. Not long after, music was seen as something to be elevated and studied, in other words it became, “High Art.” This week, we’ll start by listening to music by Haydn and Mozart, getting our grounding, so to speak, in musical form. As we proceed, we'll also see where and how they lived, compare how they wrote and performed their music, and even look at some of the exact instruments they performed on all those years ago.We’ll spend latter part of the module highlighting two figures that stand at the very heart of Western music.The first is Mozart, a well-dressed, confident, eccentric, and ever brilliant innovator. We’ll explore his music through the lens of three artistic masterpieces: a piano concerto, an opera, and the Requiem mass... We’ll delve into the unique features of the music that make it the gold standard for all music for centuries to come.  Perhaps the high (or low) point arrives  when your instructor is ruthlessness murdered on stage by the feckless Don Giovanni.We’ll then shift over to Beethoven– a passionate, conflicted, and oft-times disheveled genius. His physical appearance may very well have served as the prototype for the stereotypical, “struggling bard,” or “tortured genius.” We’ll study some of his most famous sonatas, including his Moonlight Sonata and then go beyond his music to explore his personal life, including his struggle with deafness and depression.The Bridge From Classical to RomanticIf you could put a soundtrack to the French Revolution, it would surely contain music from Beethoven's \"Heroic\" period, during which, he “brought sound to symphonies.” We’ll see how Beethoven’s incorporation of new instruments, as well as, his creation of a large orchestra, made his symphonies much louder and \"sonically vivid\" than those of his predecessors.  The point of focus here will be a comparison of the music of Beethoven's \"Heroic\" period, represented by his Symphony No. 5,  with that of his \"Late\" period, epitomized by his famous Ode to Joy. We'll also consider Beethoven the man, as revealed through primary source accounts of his life at that time. They paint a picture of a disheveled, wild-looking Beethoven, who lived among filth and clutter and was consumed by his work.  The ultimate question: in what ways might his life of isolation and his hearing disability affected the nature (style) of the great music he created?As we bid aufwiedersehen to Beethoven, we move on to full-blown musical Romanticism. Romantic music, and indeed all romantic art, was known for its idealistic views on love and nature. Occurring roughly from 1820 to 1900, musical Romanticism saw an evolution of musical style as well as a change of venue (place) for musical performance.  In addition to the aristocracy and their royal palaces, a strong middle class arose in Europe during this period.  With the music of the ever-lyrical Franz Schubert, we'll step into the parlor of an upper-middle class home, to experience his domestic chamber music and songs. We’ll finish off the module by asking the question: How do we use musical sound to communicate? A look at program music (instrumental music that uses musical gestures to tell a story) will help us figure this out. After a quick auditory review of the workings of program music (we'll follow Vivaldi on a spring day), we'll watch Hector Berlioz go to hell. More accurately, we’ll follow the sequence of musical gestures he employs to re-create a fantastical tale of pursuit, destruction, damnation.  Having learned our lesson,  we’ll end with a little fun as we try to match themes extracted from various symphonies to the mental images that the composer had in mind.  Do you speak the language of program music fluently? Join us and find out! The Romantic EraModule 8 will begin with a tour of Yale’s extraordinary keyboard collection; perhaps the finest of its kind in the world. We’ll see fully functioning instruments of all shapes and sizes, some dating back to the time of Mozart and before!  We’ll learn the preferred brands and styles of some of the finest pianists of all time, Haydn, Beethoven, Liszt, Chopin, and Schubert to name a few. We’ll even get to hear some of these instruments played by musical educator and concert pianist Robert Blocker.  His performances will help us hear exactly how advances in technology changed the sound and capabilities of pianos during this time period. Our next session this module covers a rather polarizing topic:  Opera. Many people find the Opera too artificial, too long, and sometimes just plain boring; others enjoy nothing more than this glamorous art form. We’ll spend some time making a case for the power and beauty, indeed the magic, of Opera. Maybe, we’ll be able persuade some naysayers along the way.  Because it is impossible to encompass all of Romantic opera in an hour, we'll concentrate on the masterpieces of Verdi and the groundbreaking music dramas of Wagner.   Perhaps the only figure who can reasonably by compared to Beethoven in terms of musical originality and innovation, Wagner changed the face of 19th century music.  We’ll explore Wagner by briefly analyzing his Ring Cycle.  This innovative cycle of librettos, based on Norse mythology, contains some of the most iconic and recognizable music from the period. Wagner's use of \"leitmotifs” made detailed storytelling possible,  with the music even conveying the subconscious thought of singers on stage, a truly revolutionary feat. His work would go on to serve as inspiration for writers and film makers such as Tolkien, Lewis, Lucas, and Martin, not to mention countless composers. In the final lesson of this module, we’ll expand our focus to look at the orchestra as a whole during the Romantic period.  Just 60 years after Mozart led his thirty-five-player orchestra, it was not uncommon to see Wagner and Mahler conducting ensembles with well over 100 members. In addition to increased numbers, the instruments themselves changed. Technological advances, transformed previously one dimensional instruments, such as the French horn, into versatile tools, capable of projecting a completely chromatic melody.  This newfound versatility allowed composers like Brahms and Mahler to experiment with and forever redefine orchestral instrumentation.  Music to the PresentWhen you think of Impressionism, you probably think of paintings, likely the beautiful canvases of Claude Monet. But the emotionally evocative, non-realistic style of Impressionism pervaded all aspects of art. For music, another Claude, this time Debussy, typified the Impressionist movement.  After learning about the sometimes outrageous lives of some of history’s famous composers, it may shock you to hear that Debussy led a rather banal existence, with no depression, psychosis or family tragedy to speak of.  But from an ordinary life can come extraordinary music! We’ll look at three pieces, one each from his early, middle, and late career, to see how Debussy's style shifted away from more goal-oriented Romanticism to the “live in the moment” style that came to define Impressionism. After a brief guitar lesson taught with the help of the talented Solomon Silber, we’ll continue on to the Modernist period. As is well known to all by now, musical style is constantly changing. Sometimes the change is subtle, like the shift from Classical to Romantic music. At other times, however, change crashes like a Tsunami against previous traditions.  This is what we experience as we engage the bracing sounds of Modernism. Beginning in the early 20th century, composers such as Igor Stravinsky and Arnold Schoenberg abandoned traditional melody and scale. Simply put, audiences were, at times, less than receptive to this change. We’ll listen to samples of the music that provoked audience hostility, and discuss what seems to make this music so inaccessible, at times downright unpleasant, for most listeners.We will close this week, and our course, with Postmodernism and Minimalism. We’ll see how composers like Aaron Copland brought orchestral music back to the people by paring it down to its most basic terms. We’ll then hear how artists such as  Philip Glass and John Adams, took this idea and ran with it, composing captivating trance-like movements around the simplest of ideas. \n                                    ", "end_date": "2016-08-22T00:00:00Z", "title": "Introduction to Classical Music", "price": 0, "instructors": "Craig Wright", "institution_name": ["Yale University"], "commitment": "3-5 hours", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/introclassicalmusic", "duration": "9 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}