{"selfpaced": true, "topic_name": ["Music"], "description": "\n\n                    \n                    \n                    Aprende los elementos esenciales necesarios para empezar a tocar la guitarra acústica o eléctrica. Aprenderás un enfoque fácil que te hará tocar rápidamente a través de una combinación de la exploración del instrumento, la técnica de ejecución y la teoría básica de la música.\n\n                                            Syllabus\n                        Bienvenido a Introducción a la GuitarraEn esta primera lección, vamos a tomar las cosas con calma. Nos enfocaremos en cómo elegir la guitarra correcta para ti y qué accesorios son esenciales para cualquier guitarrista.Guitarra Acústica/Eléctrica y los BásicosEsta lección te enseñará los nombres de las partes de la guitarra y te familiarizará con el instrumento.Empezando: Habilidades Fundamentales de la Guitarra¡En esta lección, aprenderás como afinar y empezarás a tocar tu instrumento desde 0! Ten paciencia y recuerda: enfócate en ser minucioso y toca en tiempo al compás del metrónomo. Esto es mucho más importante que tocar velozmente.Los doce semitonos y notación básicaAunque no se necesita ser un experto en teoría musical para tocar la guitarra, es importante saber los componentes básicos de la música. Con este entendimiento, la música  ya no estará  cubierta de misterio o  de complejidad. Esta lección presenta ideas fundamentales de música de una manera divertida y no intimidante.Escalas: Construcción y digitacionesEn esta lección, profundizarás en escalas. No te dejes intimidar. Seguramente has oído hablar o has practicado escalas. Puede haber sido durante las clases de piano. Lo más probable es que no fue muy emocionante. Esperemos que encuentres el acercamiento a las escalas de la lección 4 mucho más fácil e incluso divertido.Acordes: creación de acordes de tríadas y de potenciaEn ésta lección, usarás las habilidades que has adquirido en las lecciones anteriores para construir una armonía. Tocarás ciertas escalas de notas para crear acordes. Vamos a ver por qué los acordes suenan como suenan, cómo construirlos, cómo tocarlos fácilmente en posición abierta, y cómo tocar acordes que puedes mover por todo el puente.Unir todo: La escala pentatónica y las cancionesAhora que tienes la \"ciencia\" de la guitarra en tus dedos, aprenderás un par de canciones. Lo harás usando la melodía (de las escalas) y armonía (de los acordes) que hemos aprendido. También aprenderás la escala esencial para la reproducción de melodías y solos.\n                                    ", "end_date": "2015-11-19T00:00:00Z", "title": "Introducción a la guitarra", "price": 0, "instructors": "Thaddeus Hogarth", "institution_name": ["Berklee College of Music"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/guitarra", "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2015-10-01T00:00:00Z"}