{"selfpaced": false, "topic_name": ["Music"], "description": "\n\n                    \n                    \n                    Learn the basic concepts of improvisation from Gary Burton, one of the most renowned improvisers in the jazz world, including the mental, melodic, and harmonic processes that contribute to the instinctive skills that an improviser puts to use when taking a solo.\n\nWhile many people are fans of jazz and understand that musicians are often “making up” the notes they are playing during a performance, most people—often including musicians, themselves, who are beginning to learn improvising—aren’t clear about what exact processes take place to enable this to happen. The purpose of this course is to introduce the basic concepts of modern improvisation and how to go about mastering the different musical and mental skills involved. \n\nCourse author Gary Burton codifies a sought-after approach to improvisation that has been at the core of Berklee College of Music's curriculum for decades. Students who complete this course will know what to practice and how to practice the various aspects of improvising, in addition to understanding how the improviser spontaneously communicates to the listeners through their musical creations.\n\n                                            Syllabus\n                        Welcome to Jazz ImprovisationWelcome to the course! Here we will cover all the details about the course and what you'll need to know to get the most out of your experience.Improvisation as a LanguageSince everybody who is taking this course starts from a different place in terms of their experience as an improviser, it's important at first to cover some basic material.  We'll begin our journey by exploring the language used by jazz improvisors. Improvisation is analogous to language in many ways. With music, we become fluent when the vocabulary (scales and chords) and grammar (harmonic progressions) are assimilated into conversational content or story (melodic themes and structure) and we no longer have to consciously think about them while we play.The Improviser's VocabularyIn this lesson, we'll explore the improviser's lingo. We'll identify the most common chord scales and the type of harmony they relate to including major, minor, and dominant 7. Making Scale Choices in Real TimeImprovisers must be able to quickly recall chord scales and be able to play around on them fluently. This becomes important when choosing which chord scale to use on a given harmony—another thing we must be able to determine immediately. When a new tune is put in front of you at a session or a rehearsal, there isn't time to take the music home and spend an hour or two working out the correct scales. Improvisers need a quick, mostly intuitive way of making these scale choices in real time as the tune is being played. This week, we'll explore my method for making these quick musical decisions.Harmony for ImprovisersIt is important for an improviser to clearly imply the harmonies when improvising. It is not enough to just play correct notes on each chord. In this lesson we'll examine how the improviser helps the harmonies move. Part of the improviser's job is to help the listener follow the changes as the chords move from one to another. Theme and VariationThis week we will discuss how the improviser develops melodic themes in a solo. As mentioned in week 1, there are natural comparisons between speech and improvising that illustrate how this functions. The most common technique for telling a musical story that engages the listener for the duration of your solo is by using a traditional concept called theme and variation. That is, you introduce a theme—a musical phrase—then repeat it, making variations on it to develop an interesting storyline. A good solo is like an explanation, or a good story. The explanation or story is the content of improvisation.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Jazz Improvisation", "price": 0, "instructors": "Gary Burton", "institution_name": ["Berklee College of Music"], "commitment": "6-8 hours", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/jazz-improvisation", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}