{"selfpaced": true, "topic_name": ["Music"], "description": "\n\n                    \n                    \n                    Ludwig van Beethoven’s 9th Symphony premiered in Vienna in 1824, and continues to be one of the most popular symphonies in the repertoire. The monumental symphony’s size and complexity stretches traditional instrumental forms to the breaking point, and its famous choral finale changed our view of orchestral music forever.\n\nHarvard’s Thomas Forrest Kelly (Morton B. Knafel Professor of Music) guides learners through all four movements of Beethoven’s 9th Symphony, highlighting aspects of symphonic form, describing Beethoven’s composition process, the rehearsals and premiere performance, and the work’s continued relevance today.\n\nYou will learn the basics of musical form and analysis, the genres and styles used and the circumstances of this symphony’s first performance and subsequent history. Learners in this course need not have any prior musical experience.\n\nAdditional First Nights Modules:First Nights: Handel’s Messiah and Baroque Oratorio\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.\n\n                                    ", "end_date": "2016-07-21T00:00:00Z", "title": "MUS24.3x: First Nights: Beethoven’s 9th Symphony and the 19th Century Orchestra", "price": 0, "instructors": "Thomas Forrest Kelly", "institution_name": ["Harvard University"], "commitment": "2-3 hours", "subject_name": ["Art & Design"], "course_url": "https://www.edx.org/course/first-nights-beethovens-9th-symphony-harvardx-mus24-3x", "duration": "28 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-01-07T00:00:00Z"}