{"selfpaced": false, "topic_name": ["Music"], "description": "\n\n                    \n                    \n                    What is a musician’s response to the condition of the world? Do musicians have an obligation and an opportunity to serve the needs of the world with their musicianship?\n \nAt a time of crisis for the classical music profession, with a changing commercial landscape, a shrinking audience base, and a contraction in the number of professional orchestras, how does a young musician construct a career today? Are we looking at a dying art form or a moment of reinvigoration?\n \nIn this course we will develop a response to these questions, and we will explore the notion that the classical musician, the artist, is an important public figure with a critical role to play in society.\n \nThe course will include inquiry into a set of ideas in philosophy of aesthetics; a discussion about freedom, civil society, and ways that art can play a role in readying people for democracy; discussion on philosophy of education as it relates to the question of positive social change; and an exploration of musical and artistic initiatives that have been particularly focused on a positive social impact.\n \nGuiding questions for this course inquiry will include:\n \n      - How can classical music effect social change?\n      - How has music made positive change in communities around the globe?\n      - What can the field of classical music learn from other movements for social change?\n      - How have educators and philosophers thought about the arts and their connection to daily contemporary life?\n \nEach class will explore one critical question through lectures, discussions, interviews, or documentaries.\n\n                                            Syllabus\n                        Welcome to Music and Social ActionExplore resources that provide an overview of the course.What is Art and How Do We Experience It?In this module, we will discuss philosophers John Dewey and Maxine Greene, and their respective views on the possibilities contained within aesthetic experiences. How can aesthetic experience meaningfully contribute to public life? Democracy and the Arts, Part 1How can artistic and aesthetic experiences make a more engaged public? Is there a connection between individual transformative experiences with art and any broader societal impact? What is the role of the artist in a democracy? Democracy and the Arts, Part IIHow have we conceived of the artist's role in American society? What are examples of artists furthering civil society? How do we continually imagine fulfilling the promise of a democracy, embracing Maxine Greene's notion that it is always unfinished?Arts and Urban RenewalHow have the arts been a driving force for change in American cities? What are the potentials and pitfalls when positioning artists in this role? This class will pursue these questions through a series of case studies, including a video tour of arts organizations focused on urban renewal in Providence and New Haven, and the development of Lincoln Center in New York City.20th Century Artists and Social CommitmentThis class will explore examples of artists from the past hundred years who have been committed to making positive contributions to political or social issues of their time. 21st Century Artists and Social CommitmentThis class will involve a discussion with performing musicians and a look at examples of artists and musicians from the past hundred years who have been committed to making positive contributions to political or social issues of their time. Creating Social ActionIn this final lecture, we will discuss traditions of social action, and how artists work toward building civil society.Final Reflection One of the primary goals of this course has been to explore the connections between key concepts from the philosophy of aesthetics, historical examples of musicians who worked toward social action, and contemporary artistic initiatives. This final response is intended to help you consider how these theoretical and historical issues relate to the role of artists and the arts in contemporary life, and how they might apply to your own community and your own involvement with the arts.\n                                    ", "end_date": "2016-08-15T00:00:00Z", "title": "Music and Social Action", "price": 0, "instructors": "Sebastian Ruth", "institution_name": ["Yale University"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/music-and-social-action", "duration": "9 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}