{"selfpaced": false, "topic_name": ["Music"], "description": "\n\n                    \n                    \n                    The piano remains one of the great achievements of musical instrument design and has long served as a primary creative tool for musicians worldwide. Over the last few decades, however, the acoustic piano in all of its glory has been steadily replaced by digital pianos of various shapes and sizes. While an enormous amount is lost in the process, this new instrument presents unprecedented creative and performative possibilities, and the instrument itself remains rife with design potential in ways that the acoustic piano is not.This will be an “artist practicum” course, focusing on the prepared digital piano and the Nostalgic Synchronic Etudes, both created by Dan Trueman. Using the acoustic piano itself as a starting point, we will consider how it might be reinvented digitally and how we might make music with the new instruments that we design. Learners will both code and compose, and will also listen to key relevant pieces from the repertoire. In the process, we will consider a number of crucial subjects—rhythm and meter; tuning, temperament and timbre; interface design; creative coding—and how they impact both composition and performance.\n\n                                            Syllabus\n                        Session 1: The Piano: Design And History keyboard layout, hammers and strings, timbre, overtones; clavichord, harpsichord; the digital piano, sampling—building a digital piano\r\nSession 2: Tuning, Temperament And Tone tuning systems, sonorities, melodies and modulation; sampling and synthesis substitutions; the prepared piano\r\nSession 3: Digitally Preparing The Piano synchronic and nostalgic preparations; rhythm, meter, musical time\r\nSession 4: The Changeable Piano instruments that change as they are played; adaptive and composed tuning; adaptive tempi\r\nSession 5: Composing For (And With) The Prepared Digital Piano The Nostalgic Synchronic Etudes; the Mikroetude Project\n                                    ", "end_date": "2017-01-05T00:00:00Z", "title": "Reinventing the Piano", "price": 0, "instructors": "Dan Trueman", "institution_name": ["Princeton University"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.kadenze.com/courses/reinventing-the-piano/info", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Kadenze"], "start_date": "2016-12-01T00:00:00Z"}