{"selfpaced": false, "topic_name": ["Music"], "description": "\n\n                    \n                    \n                    This course will focus on the historical and cultural background, literary aesthetics, music, and performance of Kunqu, China’s classical opera. After viewing the lecture videos presented by scholars and renowned maestros in the field of Kunqu, students’ understanding and appreciation of Chinese performing arts, classical literature and traditional culture will be enhanced.\n\n                                            Syllabus\n                        An Introduction to the Beauty of Kunqu OperaWelcome to The Beauty of Kunqu Opera! The following lecture videos will give you some ideas of the historical background and characteristics of Kunqu, China’s classical opera that originated more than 600 years ago and blossomed during the late Ming and early Qing dynasties (around 16th – 17th centuries). The introduction is followed by excerpts and analysis of The Peony Pavilion, Kunqu’s masterpiece. The poetic artistry shown in the arias, dialogues and dance movement of the characters exemplifies the aesthetic achievement of Kunqu.The Beauty of Kunqu MusicKunqu means music/song (qu) that originated from the district of Kunshan, Jiangsu province. The word itself shows the fundamental role played by music in this Chinese classical opera. This week, Prof. Lindy Li Mark from the California State University, East Bay will talk about the musical aspect of Kunqu. What are the musical features of Kunqu melodies? What is tune-type and what does a traditional score of Kunqu look like? How is the music of Kunqu different from that of the Western operas? What instruments are used in a Kunqu ensemble? Answers to these questions can be found in the lecture videos.The Art of Kunqu Performance: the Male Role-TypesJust like other genres of Chinese opera, Kunqu has a broad range of role-types, such as male (sheng), female (dan), painted face (jing) and comic (chou). From this week on, legendary performing artists who have devoted their whole lives to Kunqu will talk about the role-types they specialize in and their facial makeup, costume, singing, speaking and movements. In addition, they will demonstrate some of the very important repertoires in Kunqu and share with us the characteristics of each of them. \nThis week, Maestros Yue Meiti and Cai Zhengren will talk about one of the most important role-types of Kunqu, the male role-type. Classical plays such as The Jade Hairpin, The Shepherd, and The Palace of Eternal Life will be introduced as well.The Art of Kunqu Performance: the Female Role-TypeThe female role-type is another prominent role-type of Kunqu and can be divided into a number of subtypes. In this week lively lectures and demonstration by Maestros Zhang Jingxian (mature female), Zhang Jiqing (young noble lady), Liang Guyin (vivacious young female) and Wang Zhiquan (martial female) will show us the charisma of the diversified female characters on the Kunqu stage from Chinese classics such as The Lute, The Peony Pavilion and Journey to the West.The Art of Kunqu Performance: Integration of the Painted Face and Warrior Role-TypesThe colorful and complex facial makeup of the painted face role-type is probably the most noticeable feature in the eyes of the audience. But what does facial makeup mean and how is it done? This week, Maestro Hou Shaokui will unfold the mysteries for us. He will also share with us his portrayal of Lord Guan, a well-known household character based on the most famous Chinese historical novel Romance of the Three Kingdoms. What is more, this unique character combines the essence of both the painted face and warrior role-types.The Art of Kunqu Performance: the Comic Role-TypeWhen appreciating the well written script and the beautiful melody of Kunqu, sometimes audiences just want a good laugh in the theatre. This cannot be done without the contribution of the comic role-type. This week, Maestro Zhang Mingrong will explain the characteristics of the different subtypes of the comic role-type, namely young chou, fu chou and martial/acrobatic chou. From Maestro Zhang’s demonstration we will also see that mastering the comic role-type requires much more skill than just natural talent.The New Aesthetics of Kunqu: Tradition and ModernityDrawing examples from the production of The Peony Pavilion (Young Lover’s Edition) and The Jade Hairpin (New Edition), Prof. Kenneth Hsien-yung Pai will illustrate how Kunqu today can attract the younger generation by adding modern elements in stagecraft while preserving the basic aesthetics of Kunqu.\n                                    ", "end_date": "2016-08-08T00:00:00Z", "title": "The Beauty of Kunqu Opera", "price": 0, "instructors": "Prof. Wei Hua 華瑋, Prof. Kenneth Hsien-yung Pai 白先勇 and Prof. Lindy Li Mark 李林德", "institution_name": ["The Chinese University of Hong Kong"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/kunqu-opera", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}