{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Learn how to apply the proven strategies of menu engineering to make your own successful menu that works for you and your customers. </p>\n\n<p><strong> </strong><strong>Design your own restaurant menu to boost your sales, based on research.</strong></p>\n\n<p>      Apply the basics of menu engineering<br>      (e.g. how to price your menu-items, where to place your best sellers)</p>\n\n<p>      Apply the basics of menu design<br>      (e.g. which fonts to use, which and how many colors)</p>\n\n<p> </p><p><strong>A practical, quick and affordable way to your new menu<br></strong>It's amazing; there is valuable research about menu engineering and where to place items on your menu to sell them more. I think it is a pity that people who can benefit from it, like you, don’t know about it. That is why I designed this course.</p>\n\n<p>The course will help you to design your menu in a way you love it, because we are setting everything up to increase sales of your stars. And your customers love it, because we design to make it easy and fun to choose from your menu.</p>\n\n<p> \n\n  </p>\n\n<p><strong>This course is for…<br></strong>restaurant entrepreneurs who want to improve their menu and in the end their net profit. Who are curious how to achieve more with their menu, but want to do it themselves, without hiring an expensive menu engineer.</p>\n\n<p>You are very busy and your time is valuable. So I kept the course quick and practical; <strong>each video (5 – 10 min) gives you take aways that we apply directly to our menu</strong>: I use my sample menu, you your own menu.</p>\n\n<p> \n\n  </p>\n\n<p><strong>The steps</strong> we take to design your menu for more revenue:<br>You know…</p>\n\n<p>-       how your menu-items score on popularity and margins<br>-       what your stars are<br>-       how many menu-items you will offer and how to do it smart<br>-       where to place your menu-items to get optimal results<br>-       how to price your menu-items in a way that takes the attention to the menu-items itself<br>-       how to present your menu-items irresistibly<br>-       how to design your menu (the basics)<br>-       how to test and measure how your boosted menu worked for you.</p>\n\n<p><br></p><p>When you finish this course and take the steps, you have a boosted menu and the knowledge to keep improving your restaurant menu.</p>\n\n<p> </p>", 
    "end_date": null, 
    "title": "Design your menu for more revenue", 
    "price": "45.00", 
    "instructors": "Linda Even", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802822_49ac_6.jpg", 
    "course_url": "https://www.udemy.com/design-your-menu-for-more-revenue/", 
    "currency": "USD", 
    "subject_name": [
        "Non-Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T12:26:40Z"
}