{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t           My name is Pete Williams and I’ve been running web-based businesses  since I was 17 including Infiniti Telecommunications, On Hold  Advertising, Simply Headsets, Big Ears Headphones and Preneur Group.  </p>  <p>  \t           A few years back, I wrote the international smash hit book <em>How to  Turn Your Million-Dollar Idea Into a Reality</em>, and without blowing my own trumpet too much, I was a regional finalist in the <em>Ernst &amp; Young 2010 Entrepreneur of the Year</em> and a member of <em>SmartCompany&#039;s 30 Under 30.</em>  </p>  <p>  \t           I’m telling you all this, because I think it makes me qualified to  run this exciting program to teach Web-based business owners just like  you. I’m amazed no one has ever thought to teach this before – because it’s  fundamental to running a successful business.  </p>  <h4><strong>“If you don’t use offline techniques to generate new business, you are literally leaving money on the table.”</strong></h4>  <p>  \t           I see so many people obsessed with running an online business and  doing online marketing. So obsessed, they become blinkered and forget  they are actually running a <em>real-world</em> business with only a  single channel to market – the Internet. Whatever you sell, the chances  are you have a bigger a marketplace offline – people who don’t avidly  search Google every day for your services – yet people who would still  buy what you do or what you sell.  </p>  <p>  \t           Have you ever stopped to consider these people, this untapped marketplace and these new and undiscovered channels to market?  </p>  <p>  \t<strong>So what’s Going Analogue all about?</strong>  </p>  <p>  \t<strong></strong>I’m going to take you through a program of 4 modules and show you in step-by-step detail how I’ve exploited offline  techniques to boost traffic to websites, to convert visitors more  effectively, and ultimately to generate more revenue.  </p>  <p>  \t           This course will NOT focus on strategy, fluffy concepts or leave you  hanging with the ‘how to’ details. That’s just not what I’m all about.  We’re going to go deeper than the typical ‘why and what’ that’s covered  in most online courses, and give you the clear ‘how to’ lessons.  </p>  <p>  \t           You’ll receive a series of step-by-step video guides which link  together to form a complete process for offline marketing for your  online business. Each session will contain links to the resources you  need and case studies on how I and others have used these techniques to  deliver results.  </p>  <p>  \t           I’m going to cover Public Relations in the offline world – a step by  step process for getting press coverage, writing effective press  releases, finding the right magazines and journals and ways to come up  with the content. I’m going to explain the best way for you to approach  an editor and a bunch of case studies will underpin everything I talk  through.  </p>  <p>  \t           I’m going to show you the power of Direct Mail. It’s overlooked by so  many, but when you see some of the techniques we’ve been using to drive  traffic to our online businesses, you’ll be amazed at how effective it  can be.  </p>  <p>  \t <em>In fact, you might even find that buying a list of qualified  prospects costs less and converts better then your current AdWords  campaigns.</em>  </p>  <p>  \t           We’re even going to cover how to set-up an offline auto-responder  series using postcards, greeting cards and 3-folds to market your  business – all on auto-pilot.  </p>  <p>  \t<strong>Nice – but I’m not going to have time to implement these techniques – I’m too busy.</strong>  </p>  <p>  \t           All of these techniques sound time consuming don’t they – and I  suspect you’ve not got time to execute these ideas so there’s no point  in learning them – right?  </p>  <p>  \t <em>WRONG!</em>  </p>  <p>  \t           Another reason for developing this program is because I wanted to  share how the implementation of these concepts can become embedded in  your day. Skeptics amongst you won’t believe me! Well – you’ll have to  see for yourself how possible it is to embed these ideas into existing  processes and I’ll show you how we do it in our businesses…  </p>  <p>  \t           I’m going to show you how you can easily   implement systems to use  and leverage what you’re   already doing in your “online marketing” to  reach these offline marketplaces.  </p>  <p>  \t<strong>     How do we deliver this program?</strong>  </p>  <p>  \t         I’ve joined forces with the awesome <a href=\"http://the845club.com/training-video-production\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">training video production</a> folks from The  8.45 Club to bring to you a new style of teaching.  </p>  <p>  \t         You lead a busy life  yes?  </p>  <p>  \t            You have a ton of reports, videos and DVDs sat on a shelf  unwatched yes?  </p>  <p>  \t         Well, this style of teaching is VERY different. Because you don’t have time for fluff, do you?  </p>  <p>  \t         We will deliver <em>bite-sized chunks</em> of seriously  practical, engaging  video, links and other resources for you to follow  up with, into your inbox every 48 hours for the next eight weeks.  </p>  <p>  \t<strong>   What will I get from your program Pete?</strong>  </p>  <ul>  \t<strong></strong>  \t<li>You’ll receive a tonne of exclusive videos broken into 4 complete  modules  and drip-fed into your inbox and personal course homepage over  two months.</li>  \t<li>Each video can be viewed on your iPad or downloaded  for offline  viewing too. In addition, all demonstration videos are available in HD  1280 x 720 so that you can see exactly what I’m getting up to!</li>  \t<li>Modules also have additional resources for you to follow up with.</li>  \t<li>You can ask questions any time you like and they will not go into a  black hole – they will be answered by me and my colleagues, and shared  with everyone going through the course.</li>  </ul>  <p>  \t<strong>Is it iPhone/iPad compatible?</strong>  </p>  <p>  \t<strong></strong>Of  course. In addition to the streaming video, you can download an  iPhone/iPad-compatible H.264 MP4 file to each day’s module. All you need  to do is to download the file into iTunes and sync your iPhone or iPod  device. You can then watch the modules on the move...  </p>  <p>  \t<strong>   Who should sign up to this program?</strong>  </p>  <p>  \t<strong></strong>Let me be honest – this course isn’t for everyone. If you’re just  starting out in online marketing – then do not buy this course.  </p>  <p>  \t         If however you have been running an online business for a few months  or a few years and are interested in exploring new ways of getting more  traffic, more conversions and growing your revenue with new and  innovative ideas competitors in your niche may not have thought of, then  you should definitely think about signing up!  </p>", 
    "end_date": null, 
    "title": "Going Analogue: Offline Marketing for Online Business", 
    "price": "45.00", 
    "instructors": "Pete Williams", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/15592_c2c2_5.jpg", 
    "course_url": "https://www.udemy.com/going-analogue-offline-marketing-for-online-business/", 
    "currency": "USD", 
    "subject_name": [
        "Non-Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-03-27T03:58:55Z"
}