{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tThis course is about learning how to promote your event and the steps involved. You will learn the basic steps involved, involving planning, strategizing, working with your team and developing an ad campaign.  </p>  <p style=\"\">  \t This course is designed for those in a team or committee that is wanting to organize an event, mainly a cultural one and how to promote it. It is so simple and easy to follow. The course is divided into simple sections are there are powerpoint slides so you can follow my lecture. Pause where you need to or repeat so you can re-enforce concepts.  </p>  <p style=\"\">  \t My aim of this course is to give marketing guidance on organizations that wouldn&#039;t normally have the budget or the actual expertise in promoting their event in the best way. It is certainly difficult to promote your event if you don&#039;t know what to do or you are lacking funding.  </p>  <p style=\"\">  \t This affordable course will help you out.  </p>  <p style=\"\">  \t Course content:  </p>  <ul style=\"\">  \t<li style=\"\">Over 30 minutes of video and reference lecture slides</li>  \t<li style=\"\">Slides which are simple and easy to follow.</li>  \t<li style=\"\">Course is divided into sections based on the chronological flow of an actual marketing strategy.</li>  \t<li style=\"\">Access to this course is 24/7. MAC or PC. Use your iphone or Ipad.</li>  </ul>  <p style=\"\">  \t Establish solid foundations to build in your marketing and promotions to launch a successful event.  </p>  <p style=\"\">  \t Materials included are simple to understand and easy to follow videos of over 30 min of content. There is lots of basic marketing material to follow.  </p>  <p style=\"\">  \t You will go from being lost and overwhelmed in terms of what to do first to having a strong idea of how to go about your marketing activities in an organized and efficient manner. Thanks to these lectures you will have a better idea of importantly how to work with your team to ensure a great outcome.  </p>  <p style=\"\">  \t Still not sure? This is the awesome value you will get out of this course.  </p>  <ul style=\"\">  \t<li style=\"\">10 lectures of marketing guides and materials that you may spend $100s for. </li>  \t<li style=\"\">Simple lectures and material which is so easy to follow. Have any questions? Simply ask me and I&#039;ll respond quickly to any questions.</li>  \t<li style=\"\">Great value. Spend over $500 or 1000 for an agency where here you only receive the basic advice you need, at an affordable rate. </li>  </ul>  <p style=\"\">  \t<strong style=\"\">SPECIAL TIP:</strong>  </p>  <p style=\"\">  \tIn terms of special offers of any promo codes of other Udemy courses you will be the first to hear about it. But, order to take advantage of those offers, you need to become a student of this highly affordable course to receive these special one-time promo codes.  </p>  <p style=\"\">  \t<strong style=\"\">I am being very honest with you. You won&#039;t be able to find a more affordable deal like this anywhere else. Over 30 minutes of content that well help you so much and get you up and running with your marketing event. And at just a FRACTION of the cost that you&#039;d normally pay a big advertising agency.</strong>  </p>  <p style=\"\">  \tI guarantee your marketing efforts will be more enhanced if you sign up for this course and put this material into practice.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Scroll up to the top and click on the &quot;</em>Start Learning Now&quot; <em style=\"\">button.</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">PROMOTE YOUR BUSINESS TODAY!</em></strong>  </p>", 
    "end_date": null, 
    "title": "Learn How to Promote Your Event - Basics ", 
    "price": "20.00", 
    "instructors": "Miguel Jose Dominic Ilagan", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240556_21c5_5.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-promote-your-event-basics-101/", 
    "currency": "USD", 
    "subject_name": [
        "Non-Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-10T06:20:43Z"
}