{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t            This course will teach you how to promote your business with offline techniques. I realize that many people are very excited about online marketing strategies like SEO and social media, but there is still quite a bit you can do with offline marketing. In fact, many of the techniques presented in this course are time proven, and work as well as they ever did.  </p>  <p>  \t            In this course you will learn how to get on the radio, how to promote your business (and make extra cash) with events, how to promote your business with business cards, flyers, and much more.  </p>  <p>  \t<strong style=\"\">Paul Graham of Y-Combinator On Unscalable Marketing Strategies</strong>  </p>  <p>  \t  Paul Graham, who is the founder of Y-combinator which is the top start-up incubator in the world, and one of the most influential business people today often talks about how he urges all his start-ups to think about the unscalable marketing strategies early on to build a foundation and relationships. This is partially why this course will be great for you. While some of the strategies here won&#039;t scale, they are rooted in deep fundamentals which will help your business grow long-term.  </p>  <p>  \t<strong style=\"\">Personal Touch</strong>  </p>  <p>  \t            If you have questions about the course, or are wondering whether the course will be right for you, send me a private message on Udemy, and I will help you understand whether this course is right for your particular situation.  </p>  <p>  \t<strong style=\"\">Course Structure</strong>  </p>  <p>  \t            This course will take between 1 and 2 hours to complete. The course is almost all video.  </p>", 
    "end_date": null, 
    "title": "Offline marketing: How to promote a business offline ", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367392_193a_2.jpg", 
    "course_url": "https://www.udemy.com/offline-marketing-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Non-Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T15:51:10Z"
}