{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t    One of the easiest and most cost effective ways to increase the reach and online presence of your local business, your small business or any B to C business is to list your business in the top business directories.  </p>  <p>If your business is NOT LISTED in one of these local businesses directories, you will lose business because Google is now ranking these local business directories ABOVE small business websites.</p>  <p>  \tThe great news is, most of these top directories allow you to add your business to their website for free!  </p>  <p>  \t    Your business will benefit in many different ways:  </p>  <ul>  \t<li>Increased online exposure across a variety of authority websites</li>  \t<li>Increased search engine rankings on Google, Yahoo and Bing </li>  \t<li>Increase in sales and new customers finding your business online </li>  \t<li>Increase in positive reviews across many platforms, which means more business</li>  \t<li>Increase in your business reputation as more positive reviews are posted by customers</li>  \t<li>Increase in valuable backlinks from these authority sites</li>  </ul>  <p>  \t    In this course, you will learn, step-by-step, how to add your business listing across the top 15 business directories, including:  </p>  <ul>  \t<li>Google Places</li>  \t<li>Yahoo  Local</li>  \t<li>Bing Places</li>  \t<li>Yelp</li>  \t<li>Merchant Circle</li>  \t<li>Yellow Pages</li>  \t<li>Super Media</li>  \t<li>CitySearch</li>  \t<li>MapQuest</li>  \t<li>Local</li>  \t<li>Foursquare</li>  \t<li>LinkedIn</li>  \t<li>Angie's List</li>  \t<li>Manta</li>  \t<li>Kudzu</li>  \t<p>  \t\t    and  \t</p>  \t<li>FREE BONUS - Facebook Fan Page!</li>  </ul>  <p>  \t    Discover the benefits of having your business show up on these important business directories.  </p>  <p>  \t    Then, watch as I show you, step-by-step, exactly how to easily add your business listings to each of these important sites.  </p>  <p>  \t    You will generate much higher online exposure for your business, more customers, more sales and more stability in your business.  </p>  <p>  \t    If you are ready for more sales and more customers, then this is the Udemy course for you.  </p>", 
    "end_date": null, 
    "title": "Small Business Traffic From Google Yahoo Yelp Yellow Pages", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145686_a8bc_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-add-your-business-to-the-top-15-business-directories/", 
    "currency": "USD", 
    "subject_name": [
        "Non-Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-11T22:39:30Z"
}