{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Build your Rails portfolio with 8 super cool web applications in Ruby on Rails. Use it to begin seeking jobs as proof of what you can do, or feel confident to launch projects. </strong></p><p>I know the frustration of learning how to code. Trust me. I've been there.</p><p>But how did I go from \"aspiring developer\" to winning hackathons with 150 people and building web applications for a living? Simple. I learned by doing. By building different applications over and over again.</p><p><em>\"Spent over £2k on a Rails course and it wasn't half as good as what this course is offering for free. Ta</em> <em>\" - </em>Lyndon Joseph <br></p><p><em>“This class was simply amazing. I learned a lot and I know how to code now! I'm excited to put in the work to master the new skills I've learned. Thank you.” – Montalis Anglade</em><em> </em> <br></p><p><strong>The </strong><strong>8 app in 30 days course</strong> is THE most comprehensive crash course you'll find in Ruby on Rails, styling/design, and best-practices -- or your money back. You can begin with zero skills and become a fee-earning Rails developer in just 30 days. <br></p><p>Zero-to-launch<strong> 8 TIMES </strong>as you code and own:<strong></strong></p><ol><li><strong>Instagram Web App</strong> replica w/ design</li><li><strong>Tumblr Web App </strong>replica w/ design</li><li><strong>Evernote or Google Doc</strong> - File Storage replica w/ design<strong></strong></li><li><strong>ESPN Fan Forum or Hacker News</strong> replica w/ design</li><li><strong>iMDB (or Broadway Web App)</strong> replica w/ design</li><li><strong>TaskRabbit (or Craigslist)</strong> replica w/ design</li><li><strong>Project Manager replica w/ design</strong> (jobs board) replica w/ design</li><li><strong>Todolist</strong> (productivity app) replica w/ design</li></ol><p>It gets even better!</p><p><strong>Enter to win a the super popular Sublime Text License Giveaway!</strong><br></p><p><em>Sublime Text Editor</em></p><p><strong><em>Worth ~$70!</em></strong></p><p><em> \"Completely hands-on, no-nonsense, Do-It-Yourself Approach adopted from start to finish. This is not just another Ruby on Rails course, its much better than that. Thanks for putting so much into this course, you're the man! \" - Osazeme Usen <br></em></p><p>The best way to absorb unfamiliar concepts is to begin with the large picture in mind and work down to details. This course has been designed to <strong></strong>show you new concepts (variables, loops, conditionals, gems, e.t.c.) <strong>ONLY</strong> AS YOU APPLY THEM and <strong>NEVER</strong> in theory.</p><p>~20 Hours spread over 30 days of clear coding instruction where we will delve into the full process of zero-to-launch!</p><p><strong><em></em></strong><em>Chinese Proverb: \"I listen, I forget; I see, I remember;</em><strong><em> I do, I learn!\"</em></strong></p><p><strong>What else?</strong></p><ul><li>A friendly, informal community to support you every step of the way</li><li>Personal contact with me, the course tutor (yonathan@crashlearner.com)</li><li>Lifetime access to course materials</li><li>Hands-on learning to lock that knowledge in</li><li>A deep understanding of how to code, design and build powerful websites</li></ul><p>I will never leave you hanging!<br></p><p>It doesn't matter how old you are or what you do professionally. I guarantee that ANYONE can benefit from this course, whether it's earning a bit of extra cash on the side, changing career altogether or just the freedom to bring ideas to life.</p><p><strong><em>More from former students have this to say:</em></strong></p><p><em>“Good clear instruction. There are materials floating around online, but Yonathan has put them together in an order that makes sense.” – Jonathan Grove<br></em></p><p><em>“Yonathan's tutorial and style of teaching is really relaxed and to the point. A lot of rails tutorials out there either show you too much or too little. His tutorial was the right mix - focusing on getting stuff up and running really quick.” - Manuel Da Costa</em></p><p>This course is both for students who have no experience in programming at all and also for students who have tried Ruby on Rails in the past but want to take their skills to the next level.</p><p><br></p>", 
    "end_date": null, 
    "title": "8 Beautiful Ruby on Rails Apps in 30 Days & TDD - Immersive ", 
    "price": "30.00", 
    "instructors": "Yonathan Ayenew", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665042_c5b7_5.jpg", 
    "course_url": "https://www.udemy.com/8-beautiful-ruby-on-rails-apps-in-30-days/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T19:19:54Z"
}