{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t                                      Why learn SQL, SQL Server, and Visual Studio? To build applications today, a programmer must know how to combine the power of various technologies together to produce software that is powerful and web based. The focus of this course is SQL through Microsoft SQL Server 2014, but along the way, you also see how to use Microsoft Visual Studio 2013 for Web , and you get to build a real dashboard system powered by SQL, C#, AJAX, CSS, HTML and JQuery. This course uses Web Forms rather than MVC. Any of these skills alone are valuable, but knowing how to combine these skills makes you immediately standout in the job market. Enroll today, and learn how to give yourself a great competitive advantage in the job world.  </p>  <p>  \t                                                                                                1) Learn query writing by using the Microsoft Management Studio  </p>  <p>  \t                                              2) Learn query writing by using the Microsoft Visual Studio Query Editor  </p>  <p>  \t                                              3) Learn how to create database connected web pages using SQL and XML Data Sources  </p>  <p>  \t                  4) Get color PDF's for many of the lessons for easy reference  </p>  <p>  \t                  5) Get PDF's that depict difficult concepts in pictures for improved understanding  </p>  <p>  \t                  6) All in all, there are about 100 PDF's to accompany the video lectures  </p>  <p>  \t                  7) Get 210 questions so you can feel confident you're making true progress  </p>  <p>  \t                  8) Learn the basics of database connecting code using Microsoft's  premier         programming language: C#  </p>  <p>  \t                  9) Get exposure to modern language features like Lag/Lead  </p>  <p>  \t                  10) Build a dashboard system with SQL Server, ASP Web Forms, C# and JQuery  </p>  <p>  \t                                              Given the number of videos, PDF's, variety of teaching methods, quizzes, and a project that is designed to give you a feeling of what to expect in the real world, we're confident this is by far the best deal on this site. Join today, and learn truly valuable skills.  </p>", 
    "end_date": null, 
    "title": "A 13 Hour SQL Server 2014 /ASP.NET/CSS/C#/JQuery Course", 
    "price": "20.00", 
    "instructors": "Tom Owsiak, Jess Nault", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304490_cd74_3.jpg", 
    "course_url": "https://www.udemy.com/learnsqlwithsqlserver2014/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T23:26:43Z"
}