{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">***Lite Edition***</strong>  </p>  <p>  \t              Hello and welcome to this short course on HTML, which is the language of the World Wide Web!  </p>  <p>  \t<strong style=\"\"><u style=\"\">Why Learn HTML?</u></strong>  </p>  <p>  \t              HTML is the language of the Web. In other words, HTML is the computer language on which the web (Internet) is built. Yet, it is simple and easy to learn and its basic rules are easy to pick up and put to use. HTML is a tool, an investment for life, and once you know how to use it, you are limited only by your imagination.  </p>  <p>  \t<strong style=\"\"><u style=\"\">Course Mission:</u></strong>  </p>  <p>  \t              The mission of this short course is to provide a quick and accessible way for you to learn HTML from ground up and also use it as a quick basic reference guide wherever and whenever you want. I hope that this course fills in multiple roles as both a learning tool and a basic reference once you expand your skills.  </p>  <p>  \t<u style=\"\"></u>  </p>  <p>  \t<strong style=\"\"><u style=\"\">Course Rundown (What makes this course different?):</u></strong>  </p>  <p>  \t              Each lecture in this course is independent of the other lectures in the course. That is you do not need to follow a linear learning path, which is to start at the very first lecture and end at the last. Just think of this course as a multipurpose tool – perhaps the Swiss Army Knife of HTML language. That is because, not only can you employ this course to learn HTML from scratch but you can also use it as a basic reference whenever you want to review a certain basic topic in the HTML language. It starts with the basics of HTML and builds up to give you a solid background on the basics of HTML.  </p>  <p>  \t<strong style=\"\"><u style=\"\">Lecture Break-down:</u></strong>  </p>  <p>  \t<em style=\"\">How to write tags in HTML?</em>  </p>  <p>  \t<strong style=\"\"></strong>This lecture will introduce the concept of tags in HTML and will show you how easy it is to write tags in HTML  </p>  <p>  \t<em style=\"\">How to use Windows Notepad Editor to Create HTML Files?</em>  </p>  <p>  \t              Just in case you do not already know how to setup the environment to work with HTML files, this lecture will take your right through to setup Windows Notepad and show you how you can create HTML files  </p>  <p>  \t<em style=\"\">How to structure an HTML document?</em>  </p>  <p>  \t              At the heart of every HTML document are the basic underlying elements that form a webpage. This lecture will introduce you to these elements gradually and get you ready to create your first webpage in HTML  </p>  <p>  \t<em style=\"\">How to create Headings?</em>  </p>  <p>  \t              In this lecture, you will learn how you can create headings on your webpage similar to the headings you see in newspapers, magazines etc.  </p>  <p>  \t<em style=\"\">How to create Paragraphs?</em>  </p>  <p>  \t              Almost 50 - 80% of all of your webpages will contain text and this lecture does the same – it will guide you through to place paragraphs on your webpage  </p>  <p>  \t<em style=\"\">How to insert/embed images? </em>  </p>  <p>  \t              A lot of times you may want to make your webpage look beautiful by adding images to it. This lecture will show you exactly the same – it will walk you through to place images on your webpage  </p>  <p>  \t<strong style=\"\"><u style=\"\">Supplementary Files:</u></strong>  </p>  <p>  \tEach lecture in this course contains additional supplementary files in the supplementary file section, in order for you to understand the concepts better. In case you want to download a zipped folder of these files, kindly send me a message and I will send you a link to download the zipped folder.  </p>  <p>  \t<strong style=\"\"><u style=\"\">Feedback (Please help me to make this course even better!):</u></strong>  </p>  <p>  \tI’m constantly working on to improve this course. Therefore, if you have any feedback you are welcome to send me a message and I will definitely work on to include that in this course.  </p>  <p>  \t<strong style=\"\">Premium Edition:</strong> The premium edition of this course will contain a complete coverage of the entire HTML language. A journey that will start from the very basics of the language and will take you beyond the frontiers of Mastery!  </p>", 
    "end_date": null, 
    "title": "A how to guide in HTML", 
    "price": 0, 
    "instructors": "Syed Mujtaba", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/270976_5e94_11.jpg", 
    "course_url": "https://www.udemy.com/a-how-to-guide-in-html/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-29T13:43:33Z"
}