{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"> Adding to its data management system Microsoft has come up with a new Server, <strong style=\"\">Microsoft SQL Server 2012 </strong>which familiarizes us with the construction and usage of databases in SQL Server platform. This course is the successor of Microsoft SQL Server 2012, a step higher into the administration of the data system. It is an excellent platform for students to build database systems, ensure effective operation of the systems apart from storing, and securing data from any kind of unauthorized access. The course intends to target all data professionals including data analysts and other aspiring professionals who wants to get ready for exam 70-462, also known as <strong style=\"\">Administering Microsoft SQL Server 2012 Databases.</strong>  </p><p style=\"\">Towards the end of this course our participants will have a thorough knowledge on maintaining various databases including the instances, trouble shooting and optimizing apart from data management and contriving high availability and security.</p><p style=\"\">This course is that is the basis for all other SQL Server-related disciplines—<strong style=\"\">Database Development, Database Administration, and Business Intelligence</strong>. The main idea of this course is to make our students cognize <strong style=\"\">SQL Server 2012 databases administration</strong>. You will be comprehending a lot about the various issues and other decisions that are part of SQL Server installation and configuration.</p><p style=\"\">Apart from this as a student you will keen to look into the various operations involved including <strong style=\"\">backup and restore operations</strong> that can be performed. You will also find it both challenging and interesting to learn <strong style=\"\">how databases and database files are moved</strong>. There will also be a discussion on some of the important topics namely, <strong style=\"\">instance, database and object security strategies. S</strong>ome of the high availability technologies will also be discussed as part of the training.</p><p style=\"\">Our training is broken down to 115 lecture sessions that will cover all objectives. As add on, we are also providing demos on other major concepts so that participants understand how the steps learned are implemented in real time.</p>", 
    "end_date": null, 
    "title": "Administering Microsoft SQL Server 2012 Databases - 70-462", 
    "price": "20.00", 
    "instructors": "Compaq learning", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425084_cf4d_2.jpg", 
    "course_url": "https://www.udemy.com/administering-microsoft-sql-server-2012-databases-70-462/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T17:17:57Z"
}