{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>In only three hours you will learn enough javascript to transform from a junior javascript developer into a senior javascript guru.<br></strong></p><p>You will dramatically improve your chances of getting past a technical interview, landing that dream job and earning more money.</p><p>If you are like me you learnt Javascript by just muddling along, seeing what works and learning a thing or two everyday.</p><p>However without a grasp of the <strong>deeper fundamentals</strong> you will hit quite a few head <strong>scratch-y issues</strong>, introduce <strong>bugs</strong>, find it <strong>hard to read and understand</strong> framework and library code and won’t be considered a senior developer.</p><p>This unique course teaches you advanced javascript knowledge through <strong>a series of 20 interview questions</strong>, with regular quiz's on the way through to cement your knowledge. </p><p>***This course covers <strong><em>ES5</em></strong> version of javascript, the only officially supported version in all browsers***</p><p><strong>What are you going to learn?</strong></p><ul><li><strong>Types &amp; Equality</strong>: The different types in JS and how to check if two values are really equal?</li><li><strong>Scopes</strong>: The different scopes a variable can be declared in and how to manipulate those scopes.</li><li><strong>Object Orientation</strong>: How to perform OO in Javascript with both the Prototype Pattern and the Pseudo-Classical/Constructor Pattern.</li><li>Advanced topics in <strong>Networking</strong> such as CORS and JSONP.</li><li>Advanced topics in <strong>Event Handling</strong> such as the different event phases.</li></ul><p><strong>Why an interview format?</strong><br></p><p>I find that it's only when i'm facing an upcoming interview that I get into gear and really make sure I have a deep understanding of what I claim to know.</p><p>I might know the best practice for how to solve a problem, but do I know why?</p><p>Javascript interviews are designed to dig deeper into your knowledge of a subject, see if you are just mimicking what you have read or if you have a proper understanding. </p><p>Also it's <strong>FUN</strong>, what's more satisfying than learning something, then passing a test! </p>", 
    "end_date": null, 
    "title": "Advanced Javascript", 
    "price": "20.00", 
    "instructors": "Asim Hussain", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670034_ce04_4.jpg", 
    "course_url": "https://www.udemy.com/top-javascript-interview-questions-and-answers/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T01:57:14Z"
}