{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>El curso que hemos preparado para ti, te va a ayudar a dominar el framework Angular 2 y te va permitir abordar proyectos grandes desde su creación hasta su puesta en producción. </p>\n\n<p>Siempre utilizando las herramientas mínimas más actuales, necesarias, gratuitas y multiplataforma. Para que el sistema operativo no sea una barrera de entrada para tí, el curso está desarrollado sobre una máquina virtual Lubuntu, que es un sistema fácilmente reproducible en cualquier otro sistema operativo que posea el alumno.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>El curso es un resumen práctico de más de 1.000 horas de tutoriales, cursos online, eventos y libros, la mayor parte de pago y en Inglés. En los vídeos he pretendido ser muy claro y conciso para maximizar el valor de tu tiempo. Todos los vídeos tienen una primera parte de teoría y una segunda parte de aplicación real de los conceptos aprendidos, con distintos ejemplos didácticos que verás cómo implementar paso a paso.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>El curso va destinado a todo tipo de desarrolladores de aplicaciones web, desde profesionales de JavaScript que quieran actualizarse hasta los que siempre han visto JavaScript como un mundo extraño porque están más acostumbrados a lenguajes orientados a objetos como Java o C#. Sobre todo estos últimos descubrirán, que gracias a TypeScript, y a frameworks como Angular 2, el salto al desarrollo Front-End es más fácil que nunca.<br></p>\n\n<p>Recuerda que iré actualizando los materiales, según vaya evolucionando el lenguaje hasta que salga la versión oficial. Mantente atento a los cambios.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Al finalizar el curso estarás preparado para desarrollar tu primera aplicación con Angular 2.</p>", 
    "end_date": null, 
    "title": "Angular 2 - Aprendiendo el framework del futuro", 
    "price": "40.00", 
    "instructors": "Autentia University", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542162_d915_3.jpg", 
    "course_url": "https://www.udemy.com/angular-2/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T11:59:40Z"
}