{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">AngularJS was built to make you a better, more productive and happier developer. It's the framework enabling a new era in rich client side web experiences. <strong>It's the future</strong>.</p><p style=\"\"><strong>This is a hands-on course taught by an experienced AngularJS developer who's built dozens of angular apps for a variety of clients including Google.</strong></p><p style=\"\"><strong>Every lecture in this course ties into real world benefits or applications</strong>, after only the first chapter you'll have the knowledge to add amazing AngularJS features to your current project.</p><p style=\"\">Through a series of real-world examples you will learn the skills needed to build fully functional single page applications in AngularJS.</p><p style=\"\"><strong>Learn battle proven techniques in AngularJS to solve common problems</strong> every web developer faces on a daily basis, such as:-</p><ul><li>Performing form validation with zero lines of code using a third party AngularJS package.</li><li>Showing a beautiful datepicker control using a third party AngularJS package.</li><li>Creating and interacting with bootstrap modals in AngularJS.</li><li>When it comes to Single Page Applications we teach the far more popular and powerful AngularJS uiRouter module instead of the basic core angular routing module.</li><li>Tools, tips and tricks to debugging your AngularJS applications.</li></ul><p style=\"\"><strong>This course is taught hands-on, you learn by doing</strong>. Follow along as we go through two example AngularJS applications the first a simple lowly form which we give super powers the second a complex single page contacts application where you will learn:-</p><ul><li>How to build easily re-usable bits of html &amp; javascript using custom AngularJS directives.</li><li>How to interact with a REST API using ngResource in 5 lines of code.</li><li>Implementing infinite scroll, user feedback with spinners and toast messages.</li><li>As well as much much more….</li></ul><p style=\"\"><strong>You'll learn how to implement functionality that's expected in todays applications in a fraction of the time using AngularJS compared to other frameworks.</strong></p><p style=\"\">----</p><p style=\"\">I envy you I really do. I remember the first time I discovered AngularJS, everything just clicked, I got a warm fuzzy feeling inside and my eyes glazed over. I know because every developer I've introduced AngularJS to since has had the same look in their eyes.</p><p style=\"\">It's perfect for the kinds of problems we have with the web today, everything is moving client side and the javascript portion of our websites are getting more and more complex. </p><p style=\"\">You are here because you know you need something that can handle that complexity, you know that the future is moving to an even more client side experience and you suspect AngularJS might be the solution, and do you know what? You're right… </p>", 
    "end_date": null, 
    "title": "AngularJS: From Zero to Hero", 
    "price": "30.00", 
    "instructors": "Asim Hussain", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543230_6e3a_3.jpg", 
    "course_url": "https://www.udemy.com/angularjs-from-zero-to-hero/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T15:38:46Z"
}