{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>There’s no way around it. If you want to gain a competitive edge in UI/UX design, web development, or anything to do with mobile and desktop web apps, then you need to know Angular JS. Better yet, you need to know Angular 2, the latest version. This Angular 2 crash course will refresh your memory and get you updated on the essentials of the latest version. And if you’re just getting started with Angular JS, don’t worry = this is the perfect introduction too.\n\n  </p>\n\n<p><strong>Get Up to Speed with Angular 2 </strong>\n\n  </p>\n\n\n\n\n\n\n\n<ul><li>Understand Angular 2 and how it can help you as a developer</li><li>Code an Angular 2 project with an online IDE</li><li>Get to grips with Angular 2’s many powerful features</li><li>Improve your UI/UX design and development skills</li><li>Discover what’s new in the latest version of Angular</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Upgrade your Programming Skills </strong>\n\n  </p>\n\n\n\n\n\n\n\n<p>With 71 lectures and 5 hours of content, this Angular 2 online course will give you a thorough understanding of how Angular 2 solutions are designed, administered, and developed. If you’re a web, mobile or service app developer, architect, UI designer, tester or administrator, or if you just want to know how to get Angular 2 projects up and running, then this is the course for you. \n\n  </p>\n\n\n\n\n\n\n\n<p>You don’t need any Angular 1 or UI experience to take this course, although if you’re familiar with creating web UIs with normal JavaScript tools (jQuery, Bootstrap, etc.), or object-oriented scripting languages like Java, C#, Python etc., you’ll already have a head start. \n\n  </p>\n\n\n\n\n\n\n\n<p>The course will begin with an introduction to TypeScript, the Cloud9 IDE and using Angular 2 modules. Then you’ll get stuck into Angular 2’s components, building a UI and binding your data. After that things get a little more challenging with a breakdown of advanced component concepts and component composition. From there you’ll jump into services, web services, and routing before setting up Angular 2 from scratch. \n\n  </p>\n\n\n\n\n\n\n\n<p>By the end of this course you’ll be able to set up and get going on your own Angular 2 projects quickly, easily, and efficiently.\n\n  </p>\n\n\n\n\n\n\n\n<p><strong>About Angular JS</strong>\n\n  </p>\n\n\n\n\n\n\n\n<p>Angular is a development platform for building mobile and desktop web applications. It’s a structural framework that allows you to use HTML as your template language, and is JavaScript based. It has many high-power features like data binding and dependency injection that eliminates huge chunks of coding for the developer, making the process much more efficient and streamlined.  It’s mostly maintained by Google and a wide network of users.  Angular 2 is the latest version of the framework, first released in September 2014.</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Angular 2 Crash Course", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/874166_ee20_4.jpg", 
    "course_url": "https://www.udemy.com/angular-2-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-10T04:25:19Z"
}