{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Learn everything you need to become an Angular 2 expert!</strong></p><p>In this Master Class you will learn all aspects of Angular 2 including ES6 and TypeScript.  You will get three packages in one course!</p><p>You just need to know pure Javascript, CSS and HTML, I will teach you the rest needed for becoming a master in Angular 2.  Additionally, You will be using several IDEs, so, at the end of the class you can decide which is the most suitable for you, specifically we will take a look on WebStorm, Visual Code Studio, Sublime Text and Plunkr.</p><p>This Master Class is a live session of more than 9.5 hours will lots of examples, exercises and professional tips that you won't get in any other documentation available today.  </p><p>Every section is divided in a Theory lesson and a Practical Exercise.  This will help you to understand complex topics like Dependency Injection, RxJS, Routing and at the same time code with me and get the most of every part of Angular 2.</p><p><strong>Why is this Master Class so valuable?</strong></p><ul><li>9.5+ hours of unique content.  This is 15+ GB of videos</li><li>It resumes lots of materials and conferences available in Internet related to Angular 2.          This will save you hundred of hours watching different sources</li><li>Professional tips from practical examples learnt from real experience</li><li>It offers Angular 2, TypeScript and ES6 in one full package!</li><li>This master class goes beyond the basics, you will build full applications that mix all concepts          you need for programming real applications</li><li>Offers comparison between Angular 1 and 2 in the critical sections. This will help you for      upgrading versions</li><li>Every section has a PDF, PPT and the source code. You can use this resources for            practising after watching the course</li><li>I offer personal assistance at any time you need to solve an exercise. Lets Skype!</li></ul><p><strong>Why do I recorded this Master Class?</strong></p><p>As a professional Frontend architect, I started working with Angular 2 since alpha version.  I study all parts of the framework while Angular team has been releasing new versions.  I decided to switch a full Angular 1/Ionic product to Angular 2 and since them my team has been working intensively with Components, Directives, Routing, Http, Services, Styling and more.</p><p>This Master Class is my resume of all possible resources that I have found and used with my team and I consider that this is the most valuable material that I can offer in Internet.</p><p><strong>Continuous Updates of this course:</strong></p><ul><li>This Master Class will have updates every time that Angular 2 release new features</li><li>I will upload all live conferences I do related to Angular 2. This is a big plus, you will learn    from the audience questions too</li></ul><p><strong></strong><strong>Why Angular 2?</strong></p><p>One of the most popular open source JavaScript frameworks in the world of web application development is <strong>AngularJS</strong>. Since its release, it has received an exponential growth of adoption and support.</p><p>Announced at the <strong>ng-conference in October 2014, Angular 2.0</strong> is the new version of Angular.</p><p>For those who thought that it will be just an update… sorry, it is not! <strong>Angular 2</strong> is an entire new framework with breaking changes.</p><p>Faster than Angular 1, <strong>Angular 2</strong> uses natural, easy-to-write syntax. It gives you the tools you need to build apps for desktop, mobile web, Android, and iOS.</p><p>What are you waiting for? Register now and enjoy the course!</p>", 
    "end_date": null, 
    "title": "Angular 2 Master Class with Alejandro Rangel", 
    "price": "30.00", 
    "instructors": "Alejandro Rangel", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/769390_7c69_3.jpg", 
    "course_url": "https://www.udemy.com/angular-2-master-class-with-alejandro-rangel/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-21T08:51:27Z"
}