{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Create modern, scalable and high-speed Web Applications with Angular 2 and NodeJS</strong></p>\n\n<p>Angular 1 and NodeJS, together with ExpressJS (NodeJS Framework) and MongoDB formed the very popular MEAN stack. Now is the time to dive into MEAN 2.0 and replace Angular 1 with Angular 2.</p>\n\n\n\n\n\n<p>Benefit from the many improvements and advantages Angular 2 offers you: Speed, ease of development, highly reactive, awesome support for asynchronous operations, great scalability and more!<br>And combine these advantages with the power of a NodeJS backend!</p>\n\n<p><strong class=\"redactor-inline-converted\">Learn or refresh the Angular 2 Basics!</strong></p>\n\n<p>This course is no Angular 2 course, but it includes detailed explanation of the core concepts used as well as about Angular 2 in general. However, keep in mind that, as this course is no Angular 2 course, having other resources at hand is recommended.</p>\n\n<p><strong class=\"redactor-inline-converted\">In this course, Maximilian, experienced web developer as well as author of two 5-star rated Udemy courses and host of a Coding Channel on YouTube, will take you on a hands-on journey to get you to build your own Angular 2 + NodeJS Applications in no time.</strong></p>\n\n\n\n\n\n<p>This course follows a hands-on approach, which means that the whole course is structured around one big application and the different concepts will be explained detailedly as they are introduced in this application.</p>\n\n\n\n<p>This concept allows you to not get stuck in the theory, but instantly see real implementation examples!</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Hear what students of other courses as well as viewers of my YouTube channel have to say</strong></p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Max has gone through great lengths to create great content and this course has been great. His teaching style covers everything from basic to advanced topics, and his explanations have been thorough on each topic</em></p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Max demonstrates very good knowledge of the subject matter and great enthusiasm in delivering the lectures.</em><br></p>\n\n<p><em>Max does a wonderful job making the core concepts of Angular 2 approachable and accessible.</em><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Hands-on: Build a real application throughout this course</strong></p>\n\n\n\n\n\n<p>I’m convinced that you learn the most while doing it! Therefore, in this course you will build a real application and whilst building it, you will learn, step by step, how to create an Angular 2 frontend and hook it up to a secure and flexible NodeJS backend.<br>Starting off with a basic application, the course project will quickly incorporate user management, authentication, authorization, error handling, frontend and backend routing and much more!</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Specifically, you will learn how to:</strong></p>\n\n\n\n<ul><li>Set up a NodeJS + Express + MongoDB + Angular 2 Application</li><li>Use NodeJS and Express efficiently</li><li>Build reusable Components in Angular 2 and create a reactive User Experience with the Tools provided by Angular 2</li><li>Connect your NodeJS (or any other language!) backend with your Angular 2 App through Angular 2’s Http Service</li><li>Provide appropriate endpoints on your Backend, for your Frontend to consume</li><li>Make your Application more secure by implementing Users and Authentication as well as Authorization</li><li>Handle Errors gracefully</li><li>And much more...!</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Don’t stop at the basics!</strong></p>\n\n\n\n\n\n<p>Do you know those courses which show you a „Hello World“ example and then call it an end? That won’t happen to you in this course. While beginning with a very basic app and basic features, you will quickly be able to incorporate many different routes, subrouting, Observables, Events, Authentication and Authorization, Error Handling and much more into your applications.<br>The best thing is: You’ll learn all that by putting it into practice immediately! No wall of powerpoint slides, no unrealistic mini-examples – this is the real deal!</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Who should take this course?</strong></p>\n\n<ul><li>Basic NodeJS/Express and Angular 2 Experience is required</li><li>You should be familiar with HTML, CSS and JavaScript Basics, too</li><li>MongoDB (+ Mongoose) knowledge is a Plus as MongoDB will be used in this course but won’t be subject of in-depth explanations</li></ul>\n\n\n\n\n\n<p>By the end of this course, you will be able to create your own, awesome NodeJS + Angular 2 Applications!</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">FAQ:</strong><br><em class=\"redactor-inline-converted\">1) Are you writing Angular 2 code in JavaScript or TypeScript?</em><br>TypeScript is the language of choice, since it not only makes development quicker, less error-prone and more fun, but also has the most documentation and resources on the internet (for Angular 2)<br><em class=\"redactor-inline-converted\">2) How much NodeJS and Angular 2 experience should I have?</em><br>You don’t need to be an expert by any means! All important concepts will be refreshed in this course and I will go into detail about the design and coding choices taken in this course. But I won’t start at zero for both languages, neither will I go into detail – for example you won’t get a detailed explanation of NodeJS views and view engines in this course, because we don’t need them (as Angular 2 will the frontend)</p>", 
    "end_date": null, 
    "title": "Angular 2 and NodeJS - The Practical Guide to MEAN Stack 2.0", 
    "price": "20.00", 
    "instructors": "Maximilian Schwarzmüller", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833442_b26e.jpg", 
    "course_url": "https://www.udemy.com/angular-2-and-nodejs-the-practical-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T13:14:50Z"
}