{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>In this Course you'll learn how to build an AngularJS Real Time Application using Firebase and Angular while leveraging great Angular Development best practices.</strong><br></p><p><strong><br></strong></p><p><strong>UPDATED: JAN '16 </strong></p><p><strong>01-2016: Added a new Section </strong>(30+ mins of brand new content)<strong>: </strong><strong>Authentication</strong> and <strong>Authorization</strong> with<strong> AngularJS and Firebase.</strong></p><p><strong>AngularJS </strong>is famous <strong>Javascript </strong>framework developed by <strong>Google</strong> and an increasing number of companies are currently looking for expert <strong>AngularJS Developers</strong>. Mastering AngularJS is a great opportunity that will help you getting a new and better job in the web development industry.</p><p><strong>Reviews</strong><br></p><p><em><strong></strong>\"The best AngularJS course I have seen\", \"Great course, with clear explanation, easy to follow and a lot of content\", \"Teaching and Learning Angular at it's best\", \"This course is simply awesome ... , after taking this course, I became aware of what I'm doing and what I'm coding\".  </em><br></p><p>This <strong>AngularJS course</strong> will teach you how this framework can dramatically  <strong>improve your efficiency</strong>, reduce your coding time and deliver your next project as a <strong>Single Page Application (SPA)</strong>.<br></p><p><strong> </strong>You'll learn how to create <strong>AngularJS directives</strong>, <strong>controllers</strong>, <strong>modules</strong>, how <strong>2-way data binding </strong>works and<strong>,</strong> more important, <strong>how to build an AngularJS Web Application from scratch</strong>. </p><p>You'll learn some of the <strong>best practices</strong> and <strong></strong>how to deal with <strong>common mistakes</strong> that a developer can face when dealing with <strong>AngularJS projects</strong> and you'll dig deeper into the built-in components of this technology.</p><p><strong></strong><strong>AngularJS </strong>is a Javascript framework used to create <strong>Single Page Applications</strong> (SPAs) with a declarative approach. This means that Angular is completely extensible: you can define, for example, your own DSL (Domain Specific Language) and services.</p><p>The framework is developed and maintained by <strong>Google</strong>. At the minute it has more then 1.3K contributors on GitHub and is being used in more than 243.000 live websites (Youtube, IndieGoGo, Aerlingus, Virgin America, Forbes are only a few) and is backed by a wide community (more than 122k questions only on stackoverflow). </p><p>There are plenty between documentation, tutorials, examples and fiddles in additions to discussion groups, specialized sites and forums where you can find inspiration or solutions to common problems.</p><p><strong>Audience</strong></p><p>If you are new to AngularJS, no worries. I will drive you through the main topics and will not assume that you are already familiar with the framework.</p><p>On the other hand, If you  already know AngularJS, you know that it can be as sweet as a rainbow unicorn or as bitter as your worst nightmare: this is why we will teach teach you a few best practices as well as examples of patterns and anti-patterns all over the course, so that you'll learn a more efficient and clear way of coding your NG apps.</p><p><strong>Content and Overview</strong></p><p>In this course you'll find 7+ hours of video content; source code is provided for each lesson and in general there will be 2 downloadable attachments per lesson: the start and final source code; this will let you double check that your changes are correct as long as you proceed throughout each chapter. Links to external resources are also provided where useful. Last but not least, I will support you with each question you might have.</p><p><strong>T</strong><strong>he course is divided in 16 sections,</strong> each one consisting in several videos (more than 63in total) where we will cover the different components of the AngularJS framework.</p><p>By the end of course, you will:</p><ul><li><strong>Learn how to setup AngularJS  and how its architecture is built; (Installation, MVW approach)</strong></li><li><strong>Acquire familiarity with the main AngularJS components: modules, controllers, routing,  2 way data binding, dependency injection, prototypical inheritance, scopes,  filter, directives, services and templates;</strong></li><li><strong> We will talk a lot about forms, user data validation and filtering. You will learn how to implement a robust form with validation, thanks to Angular Forms and its built-in validator. In other words you will learn how to improve the user experience of your application;</strong></li><li><strong>Learn how to use $http to query a webserver and handle promises in a response;</strong></li><li><strong>Be able to build a full Backend Mock to test your application, by using the Angular $HttpBackend service in the NgMock module;.</strong></li><li><strong>We will dedicate some lessons to custom directives: first a simple implementation then we will unveil the secrets of the \"link function\", how to isolate the scope and how to make directives reusable with any application.</strong></li><li><strong>Transform your App into a Real Time application, and learn how to use Firebase and Angular to make updated content available in Real Time on any device.</strong></li><li><strong>Learn how to secure your application by building Authentication and Authorisation functionalities.</strong></li></ul><p><br></p><p><strong>What you will obtain at the end of the course</strong></p><p>At the end of the course you will have a deep understanding of the basic concepts of AngularJS, and you will be ready to start your next project by using this great framework.</p>", 
    "end_date": null, 
    "title": "AngularJS for the Real World - Learn by creating a WebApp", 
    "price": "40.00", 
    "instructors": "Alessandro Russo", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/173888_6558_5.jpg", 
    "course_url": "https://www.udemy.com/angularjs-for-the-real-world-learn-to-create-a-webapp/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-27T14:58:51Z"
}