{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>UPDATE (18 May 2016):</strong> The course is updated to Angular 2 Release Candidate 1.</p>\n\n<p>Angular 2 is the next big thing. It's one of the leading frameworks for building modern, scalable, cross-platform apps. If you want to establish yourself as a front-end or a full-stack developer, you need to learn Angular 2.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In Angular 2 with TypeScript, Mosh, author of six 5-star Udemy courses, takes you on a fun, hands-on and pragmatic journey to master Angular 2. </strong></p>\n\n\n\n\n\n\n\n\n\n<p>More specifically, you'll learn how to:</p>\n\n\n\n\n\n\n\n\n\n<ul><li>Build re-usable components </li><li>Control rendering of HTML </li><li>Format data using pipes</li><li>Implement custom pipes</li><li>Build forms with custom validation</li><li>Use Reactive Extensions and Observables to handle asynchrony</li><li>Consume back-end services and APIs</li><li>Build single page apps (SPA)</li><li>Use dependency injection to write loosely-coupled, testable code</li><li>Resolve common Angular 2 errors </li><li>Write cleaner, more maintainable code </li><li>And much more...</li></ul>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p>If you've taken any of Mosh's courses before, you know what you get. He is very passionate, clear and concise in his teaching. Every section and every lecture has been perfectly thought through to lead you on a <strong class=\"redactor-inline-converted\">step-by-step journey from zero to hero with no fluff whatsoever</strong>. If you're looking for 10+ hours of wasted time on the content you don't need and a rambling instructor, there are other courses you can enrol in.</p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">You'll start building Angular 2 apps within minutes.</strong> Every section includes a few <strong class=\"redactor-inline-converted\">bite</strong>-<strong class=\"redactor-inline-converted\">sized videos</strong>, and concludes with a <strong class=\"redactor-inline-converted\">coding exercise </strong>to help you master what you learn in that section. The last two sections are purely coding exercises. <br></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">At the end of this course, you'll build an application that exhibits many features you find in a lot of real-world applications, </strong>including but not limited to:</p>\n\n\n\n\n\n\n\n\n\n<ul><li>CRUD operations against a backend API </li><li>Form with custom validation</li><li>Dirty tracking </li><li>Master / detail views</li><li>Loading content dynamically</li><li>Showing spinner icons while content is loading </li><li>Filtering</li><li>Paging</li><li>More...</li></ul>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Reviewed by Todd Motto (Google Developer Expert):</strong></p>\n\n\n\n\n\n\n\n<p>Mosh has a fantastic teaching style, and just delivered the best online course I've seen in a long time. Mosh's approach to teaching and guiding makes no assumptions on existing Angular 1.x knowledge, but helps those who have to clarify new concepts. Mosh guides you through critical concepts slowly without skipping over details, and the course is extremely worth investing a few hours in, your understanding of Angular 2 will reach new levels. He fills all the gaps, presents impeccably well and the preparation was top notch, seriously can't recommend the course enough.<br></p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">And here is what other students who have taken this course say:</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\"Great course, even for seasoned developers. I'm a ReactJs developer using this to broaden my horizons!\" -Tyler Markvluwer</p>\n\n\n\n\n\n\n\n\n\n<p>\"Mosh is a great instructor, he is very clear and concise and breaks down his examples into small \"components\" (drum roll please). Having never used Angular before, I'm really impressed at how easy it was to understand the concepts and even managed most of the examples without having to refer back to the lectures and that is in no small part due to Mosh's understanding of Angular and how well he explains everything. If you can't already tell, I'm really impressed Mosh\" -Chris Graham</p>\n\n\n\n\n\n\n\n\n\n<p>\"It's the best angular2 video that i ever seen. It's all well explained and easy to understand. It's not need have angular1 knowledge. I'm happy because i've grown as a developer. Thanks\" -Miguelangel Cabrera</p>\n\n\n\n\n\n\n\n\n\n<p>\"Very good step by step explainations. Focus on \"why\", then \"how\" instead of \"type after me\". Love it!\" -Krysztof Gurniak</p>\n\n\n\n\n\n\n\n\n\n<p>\"As the absolute Angular newbie I was, I can recommend this course 100%.\" -Guillermo Aguyanes</p>\n\n\n\n\n\n\n\n\n\n<p>\"Mosh does a great job at explaining templates, directives, dependency injections and everything else. 10/10 would take his course again.\" -Rob</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p>So, if you're looking for an Angular 2 course with </p>\n\n\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">A passionate coder and instructor who knows his craft</strong></li><li><strong class=\"redactor-inline-converted\">Perfect structure </strong></li><li><strong class=\"redactor-inline-converted\">Balanced mix of theory and practice</strong></li><li><strong class=\"redactor-inline-converted\">Clear, concise and bite-sized videos </strong></li><li><strong class=\"redactor-inline-converted\">Lots of real-world examples and coding exercises</strong></li><li><strong class=\"redactor-inline-converted\">World-class audio / video production</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p>Don't look further. Enrol in the course now and<strong class=\"redactor-inline-converted\"> learn to build real-world apps with Angular 2 with confidence. </strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">FREQUENTLY ASKED QUESTIONS</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">1- Do I need to know Angular 1 before taking this course?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>No! Angular 2 is an entirely new framework and this course assumes no prior knowledge of Angular.</p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">2- Angular 2 is in beta. Will this course be updated?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Certainly, This course will be updated continuously until final version of Angular 2. You'll find updates from beta to final release in the last section of the course.</p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">3- Why is the course with TypeScript? Why not Javascript? </strong></p>\n\n\n\n\n\n\n\n\n\n<p>TypeScript is a superset of Javascript, meaning any valid Javascript code is valid TypeScript. If you can write Javascript code, you can write TypeScript code! So you don't have to learn a new programming language. TypeScript brings many useful features to Javascript that are missing in the current version of Javascript. We get classes, modules, interfaces, properties, constructors, access modifiers (e.g. public/private), IntelliSense and compile-time checking. So, we can catch many programming errors at compile-time. </p>\n\n\n\n\n\n\n\n\n\n<p>Angular 2 is written in TypeScript. Plus, most of their documentation is in TypeScript. And for that reason, TypeScript will be the dominant language in building Angular 2 apps. </p>\n\n\n\n\n\n\n\n\n\n<p>If you've never programmed in TypeScript, don't be afraid. It's very easy to pick up, and you're going to absolutely love it.  </p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">4- Why should I pay for this course when there are lots of free tutorials available?</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>Free tutorials and YouTube videos are free for a reason. They introduce you to a few concepts here and there, but soon you'll find yourself jumping from one tutorial to another to fill the missing gaps. By taking a perfectly-structured course, you'll be confident that you're in good hands, right from the beginning all the way through to the very end. You pay for saving your precious time: the time that you can spend on the things you love. </p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">30-DAY FULL MONEY-BACK GUARANTEE</strong></p>\n\n\n\n\n\n\n\n\n\n<p>This course comes with a 30-day full money-back guarantee. Take the course, watch every lecture, and do the exercises, and if you feel like you haven't gained the confidence to build real-world apps with Angular 2, ask for a full refund within 30 days. <strong class=\"redactor-inline-converted\">All your money back, no questions asked</strong>. </p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">ABOUT YOUR INSTRUCTOR </strong></p>\n\n\n\n\n\n\n\n\n\n<p>Mosh (Moshfegh) Hamedani is a software engineer with 15 years of professional experience, mainly in building web-based applications. He is the author of six 5-star Udemy courses with more than 13,000 students. He is passionate, pragmatic and motivational in his teaching.  </p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">DO YOU WANT TO BUILD APPS WITH ANGULAR 2 WITH CONFIDENCE? </strong></p>\n\n\n\n\n\n\n\n\n\n<p>If you enrol in the course now, you'll start building your Angular 2 apps in only a few minutes. Enrol in the course now and get started. </p>", 
    "end_date": null, 
    "title": "Angular 2 with TypeScript for Beginners: The Pragmatic Guide", 
    "price": "30.00", 
    "instructors": "Mosh Hamedani", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/719002_af70_2.jpg", 
    "course_url": "https://www.udemy.com/angular-2-tutorial-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-07T01:03:20Z"
}