{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tBienvenue sur la page de ce cours complet concernant les langages HTML et CSS (en français). Vous êtes à un clic de changer de vie !  </p>  <p style=\"\">  \tMais rentrons immédiatement dans le vif du sujet : pourquoi devriez-vous apprendre le HTML et le CSS et pourquoi choisir mon cours ?  </p>  <p style=\"\">  \tQue vous soyez un simple passionné du web ou que vous ayez un site web, vous serez obligé un jour ou l&#039;autre d&#039;apprendre les langages HTML et CSS. Pourquoi ? Tout simplement car ils sont à la base de tout projet de développement web et car il n&#039;ont aucun concurrent.  </p>  <p style=\"\">  \tApprendre les langages HTML et CSS, c&#039;est apprendre à créer ou à gérer ses sites et c&#039;est également une clef pour optimiser son référencement et donc son efficacité sur le web.  </p>  <p style=\"\">  \tPourquoi choisir ce cours ? Ce cours est le meilleur moyen pour vous d&#039;apprendre le HTML et le CSS pour différentes raisons.  </p>  <p style=\"\">  \tTout d&#039;abord, il a été créé par un professionnel et surtout par un passionné du web. Ensuite, il est complet, progressif et mis à jour très régulièrement. Enfin, outre les nombreux conseils et astuces donnés tout au long de ce cours, ce cours alterne les apprentissages vidéos, des exemples illustrés et des mises en pratique avec des quizz judicieusement placés afin que vous assimiliez les notions importantes le mieux possible. De plus, des supports PowerPoint et papier vous sont fournis pour un apprentissage optimal.  </p>", 
    "end_date": null, 
    "title": "Apprenez à coder en HTML et en CSS !", 
    "price": "20.00", 
    "instructors": "Pierre Giraud", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/277766_6552_2.jpg", 
    "course_url": "https://www.udemy.com/apprenez-a-coder-en-html-et-en-css/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-09T15:24:07Z"
}