{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">¿Porqué SpringMVC?</strong>  </p>  <p style=\"\">  \t SpringMVC es el framework líder en el desarrollo de aplicaciones web en el mundo Java y una de las profesiones más solicitadas en el mundo empresarial.  </p>  <p style=\"\">  \t Aunque el acercamiento al mundo de Spring puede resultar complejo en un primer momento, h<em style=\"\">ay que diferenciar Springframework de SpringMVC,</em> que aunque son de la misma familia, SpringMVC está orientado a proyectos web.  </p>  <p style=\"\">  \t <strong style=\"\">¿Podré seguir el curso?</strong>  </p>  <p style=\"\">  \t Trabajamos con Java desde el año 1995 y hemos visto todas las tecnologías asociadas y nos hemos centrado el desarrollos de Spring desde el año 2005 y llevamos más de 10 años formando equipos de todas las características, por lo que hemos desarrollado una buena metodología para lograr la máxima audiencia y entendimiento de nuestras clases.  </p>  <p style=\"\">  \t Casi la totalidad del curso consta de videotutoriales en HD explicando en sencillos pasos cada uno de los detalles que puedes ver una y otra vez con buena resolución.  </p>  <p style=\"\">  \t <strong style=\"\">¿Qué diferencia hay con otros cursos?</strong>  </p>  <p style=\"\">  \t La mayoría de los cursos sobre Spring son generalistas y hablan de muchos aspectos superficialmente. Están muy bien para adquirir cultura sobre Springframework, pero no <em style=\"\">para trabajar en un proyecto serio.</em> Nosotros presentamos <strong style=\"\">cursos especializados</strong> que abordan muchos temas en profundidad <strong style=\"\">que no son contados en otros cursos</strong>.  </p>  <p style=\"\">  \t Además proporcionamos una mejora en la calidad. No tendrás que ampliar la pantalla para ver el código. Usamos herramientas que permiten seguir todo el proceso visual que está ocurriendo en los tutoriales.  </p>  <p style=\"\">  \t Nos centramos en el alumno que ve el curso y no solamente en hacer la demostración.  </p>  <p style=\"\">  \t <strong style=\"\"> ¿Qué voy a necesitar?</strong>  </p>  <p style=\"\">  \t Todo está recogido en el curso, aprenderás dónde descargar las herramientas necesarias y configurarlas para que todo funcione bien desde el primer momento. Todo lo que precisas es opensource por lo que no tendrás gastos extra de licencias.  </p>  <p style=\"\">  \t <strong style=\"\">¿Necesito alguna plataforma específica?</strong>  </p>  <p style=\"\">  \t SpringMVC es lenguage Java, así que no necesitarás un sistema operativo específico, Windows, Mac o Linux funcionarán bien.  </p>  <p style=\"\">  \t No obstante te recomendamos que tengas instalado un JDK 1.7  </p>  <p style=\"\">  \t <strong style=\"\">¿Qué metodología se sigue?</strong>  </p>  <p style=\"\">  \t Tras muchos años de experiencia hemos visto que lo que mejor se adapta a los cursos IT es el aprendizaje por repetición, así que podrás seguir paso a paso lo mismo que mostramos, junto a explicaciones de porqué ocurre y posibles variaciones, alternativas o errores.  </p>  <p style=\"\">  \t <strong style=\"\">¿Qué versión de Spring cubre?</strong>  </p>  <p style=\"\">  \t Cubrimos varios aspectos, somos conscientes de que Spring evoluciona muy rápido y así también SpringMVC. También somos conscientes de que no todo el mundo puede usar las últimas versiones, por lo que explicamos cubre desde la última versión 4.x hasta versiones no inferiores a la 3.0.  </p>  <p style=\"\">  \t <strong style=\"\">Contenidos</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Instalación y configuración</li>  \t<li style=\"\">Controladores </li>  \t<li style=\"\">Explicación del protocolo HTTP</li>  \t<li style=\"\">Manejo de peticiones</li>  \t<li style=\"\">Controladores Multiacción</li>  \t<li style=\"\">Manejo de respuestas</li>  \t<li style=\"\">Paso de parámetros</li>  \t<li style=\"\">Servicios REST</li>  \t<li style=\"\">Conversión de tipos</li>  \t<li style=\"\">Conversión de mensajes</li>  \t<li style=\"\">Resolución de vistas</li>  \t<li style=\"\">Manejo de Formularios</li>  \t<li style=\"\">Validación </li>  \t<li style=\"\">Internacionalización</li>  \t<li style=\"\">Estilos y Themes</li>  \t<li style=\"\">Errores y Excepciones</li>  \t<li style=\"\">Buenas prácticas</li>  \t<li style=\"\">Y mucho más...</li>  </ul>", 
    "end_date": null, 
    "title": "Aprende Spring MVC de cero a experto.", 
    "price": "50.00", 
    "instructors": "Dico Training, David Palomar", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/277140_35e1_3.jpg", 
    "course_url": "https://www.udemy.com/aprende-springmvc-de-cero-a-experto/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-08T09:23:26Z"
}