{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Bienvenido al curso <strong>Aprende PHP desde cero con ejercicios prácticos, </strong>vas a <strong>aprender PHP paso a paso mediante los más de 36 ejercicios</strong> que componen este curso.</p>\n\n<p>PHP es uno de los lenguajes de programación del momento, es sin duda el <strong>lenguaje en el lado del servidor más utilizado actualmente</strong> en el desarrollo de aplicaciones web  y cuenta con <strong>múltiples ventajas</strong> con respecto a otros.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>En este curso <strong>aprenderás PHP de forma fácil en un tiempo record</strong>, irás <strong>desde un nivel cero</strong> a un nivel intermedio en este lenguaje. Centrándonos en <strong>las bases fundamentales del lenguaje</strong>, avanzarás en el conocimiento de PHP con ejercicios paso a paso, casi sin darte cuenta habrás aprendido a desarrollar aplicaciones web.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Al finalizar el curso <strong>serás capaz de desarrollar tus propias páginas web dinámicas</strong> con interacción a base de datos con PHP y tendrás la capacidad de seguir profundizando en el aprendizaje del lenguaje.</p>\n\n\n\n<p>Trataremos los <strong>aspectos más importantes del lenguaje</strong>, trabajo con variables, estructuras de control, sesiones, bases de datos, incluso <strong>desarrollaremos una aplicación web de gestión de usuarios</strong> en la que podremos identificarnos, añadir, editar, eliminar usuarios y ver un listado paginado.</p>\n\n\n\n<p>Si quieres <strong>aprender PHP sin dolor</strong>, practicando <strong>poco a poco, de forma fácil y en poco tiempo ¡este es tu curso!</strong></p>\n\n\n\n<p>Échale un vistazo al currículo del curso para ver todos temas que aprenderás.</p><p>Únete al curso y<strong> sin darte cuenta estarás programando con PHP de forma fluida</strong>: ¡¡ Aprende <strong>PHP </strong>!!</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Aprende PHP desde cero con 36 ejercicios prácticos", 
    "price": "20.00", 
    "instructors": "Víctor Robles", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/755462_26c3.jpg", 
    "course_url": "https://www.udemy.com/aprende-php-desde-cero-con-ejercicios-practicos/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-07T23:22:34Z"
}