{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>En este curso estudiaremos los APIS (<strong style=\"\">Application Programming Interface</strong>) con los cuales podremos explotar a fondo la potencialidad de HTML5 para el desarrollo moderno de aplicaciones Web. Aunque existen muchos APIs en HTML5, estudiaremos aquellos que se encuentran implementados en forma estable en los cinco navegadores principales: IE-10, FireFox, Safari, Opera y Chrome.</p><ul style=\"\"><li>El API de <strong style=\"\">geolocalización</strong> es uno de los más utilizados y que está mejor implementado. De forma muy sencilla podemos incluir mapas de Google y muchas más funcionalidad a nuestras páginas web.</li><li>El API de <strong style=\"\">localStorage</strong> sustituye a las actuales cookies en potencia y sencillez. Es por eso que se les llama “superCookies&quot; o “cookies con esteroides&quot;. También tenemos a sus hermanas gemelas, las SessionStorage, que funcionan exactamente igual, sólo duran durante la sesión del navegador.</li><li>Con el API <strong style=\"\">file</strong> podemos manipular los archivos de la computadora del usuario: podemos abrirlos, leerlos, obtener su información entre muchas otras funcionalidades.</li><li>La funcionalidad de Arrastrar y Soltar, o <strong style=\"\">Drag &amp; Drop</strong>, es una de las más antiguas, desarrollada por Microsoft (aunque usted no lo crea) e incorporada a HTML5.</li><li>Los <strong style=\"\">web workers</strong> son rutinas que podemos manejar desde el background del navegador y nos ayudan a procesos que serían muy pesados, desde el punto de vista del navegador.</li><li>El API <strong style=\"\">Offline Web Application</strong> nos permitirá crear aplicaciones fuera de línea, es decir, aplicaciones que funcionen aún si no contamos con conexión de Internet.</li></ul>También estudiaremos dos APIs fundamentales para el diseño de gráficos vectoriales y de mapas de bits:<ul style=\"\"><li><strong style=\"\">SVG</strong> (Scalable Vector Graphics) es un estándar en el manejo de figuras vectoriales. Es una recomendación de la W3C y está basados en una sintaxis de XML.</li><li>Por medio del API <strong style=\"\">CANVAS</strong> podremos hacer dibujos de mapas de bits, así como animaciones y controlar eventos, con lo cual podremos desarrollar incluso juegos y aplicaciones interactivas.</li></ul>Para este curso es esencial que tengas las bases de programación en HTML, CSS y JavaScript.<span></span><p></p>", 
    "end_date": null, 
    "title": "Aprende los APIS de HTML5 sin dolor", 
    "price": "20.00", 
    "instructors": "Francisco Javier Arce Anguiano", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501128_639d.jpg", 
    "course_url": "https://www.udemy.com/aprende-los-apis-de-html5-sin-dolor/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-13T15:23:25Z"
}