{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>O que é jQuery?</strong></p><p>O jQuery é uma biblioteca Javascript criada em 2006 por John Resig, que além de leve e rápida, é <strong>muito fácil de se aprender</strong> e pode ser utilizada e modificada sem nenhum custo.</p><p>O lema do jQuery é \"<strong>write less, do more</strong>\", que traduzindo significa \"<strong>escreva menos, faça mais</strong>\".</p><p><strong><strong>Aprenda Tudo o que Você Precisa Saber Sobre jQuery</strong></strong></p><ul><li>História, definição e sintaxe do jQuery;</li><li>Variáveis e funções;</li><li>Operadores matemáticas e condicionais;</li><strong></strong><li><strong></strong>Seleção e manipulação de elementos HTML;<strong></strong></li><li>Manipulação de classes e CSS;</li><li>Tratamento de eventos;</li><li>Criação de efeitos e animações;</li><li>Requisições AJAX;</li><li>Utilização de plugins.</li></ul><p><br><strong></strong><strong>O que eu irei aprender com esse curso?</strong></p><p>Neste curso você irá aprender todos os <strong>conceitos e fundamentos básicos</strong> do jQuery, tudo de maneira bem fácil e didática.</p><p>Além das aulas em vídeo, você também poderá <strong>acessar o código fonte</strong> do assunto abordado em cada aula e realizar os <strong>testes de revisão</strong> ao final de cada seção.<br></p><p>Iremos começar explicando tudo que você precisa fazer para <strong>começar a utilizar o jQuery</strong> e quais ferramentas nos auxiliarão ao longo do curso.</p><p>Em seguida, criaremos nosso primeiro código jQuery e aprenderemos a utilizar <strong>variáveis</strong> e <strong>criar funções</strong>.</p><p>Veremos também como trabalhar com os <strong>seletores</strong> do jQuery para <strong>manipular elementos</strong> da nossa página e também <strong>manipular seu CSS e classes</strong>. Em seguida, trabalharemos com os principais <strong>eventos</strong> do jQuery.</p><p>Você também irá aprender a criar <strong>efeitos e animações</strong> com jQuery para tornar seus sites muito mais elegantes e dinâmicos.</p><p>Falaremos também sobre <strong>AJAX e JSON</strong> e como utilizá-los de maneira bem fácil através de um <strong>exemplo de busca de endereços por CEP</strong>.<br></p><p>Ao fim do curso, veremos alguns <strong>exemplos práticos de utilização de plugins</strong> jQuery, como <strong>validação de formulários</strong>, <strong>alertas de interação do usuário</strong> e <strong>galeria de imagens</strong>.</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Aprenda jQuery - Escreva menos e faça mais", 
    "price": "20.00", 
    "instructors": "Rafael de Andrade", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654096_a0fe_3.jpg", 
    "course_url": "https://www.udemy.com/aprenda-jquery-escreva-menos-e-faca-mais/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T03:27:08Z"
}