{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Les cuento que este es un curso básico de HTML y está dirigido a personas que tienen deseos de aprender a programar páginas web. TODO programador comienza con HTML y este curso es una oportunidad muy buena para poder iniciarte en el precioso mundo de la programación y diseño web.</p><p>Tu deberías tomar este curso porque en él aprenderás:</p><ul><li>Qué es HTML y JsBin</li><li>La configuración del documento HTML</li><li>Headers y parrafo</li><li>Negrita cursiva subrayado</li><li>Estilos CSS</li><li>Links o Vínculos</li><li>Insertar imágenes<span></span></li><li>Distintos tipos de Listas (numeradas, sin ordenar, listas de destalles)</li><li>Tablas con sus respectivos encabezados, filas y columnas</li><li>Formularios de envío de información y login.</li><li>Integración social con Youtube, Facebook y Twitter</li><li>Por último te enseñaré a incluir JUEGOS en tu página web.</li></ul><p>En lineas generales también estarás capacitado/a para comprender el contenido de un sitio web cualquiera sea este. Entenderás \"qué hay por detrás de una página\". Así como también tendrás herramientas para crear tu propia página web.</p><p><strong>El material de este curso será transmitido mediante videos que hice especialmente para ti... en los que iremos viendo paso a paso la manera en que podemos construir una página web.</strong></p><p><strong>En solo 5 pasos</strong> te mostraré las etiquetas necesarias para armar tu página. Y créeme que no te demorará más de 2 horas capacitarte mediante este curso de HTML.</p><p>Este curso es la manera más simple de aprender HTML. No necesitarás de conocimientos previos ni largas horas de estudio. Con solo tu conexión a Internet podrás realizar TODO. NO es necesario tener software especial instalado en tu sistema.</p><p>Apúntate ahora. Anótate al curso y compártelo con otras personas para que cada vez más puedan disfrutar de los beneficios de diseñar o programar webs</p><p><strong>Es simple y concreto. Sin vueltas y pensado para ti.</strong></p>", 
    "end_date": null, 
    "title": "Aprende HTML en 5 simples pasos", 
    "price": "25.00", 
    "instructors": "Cristian Matías Damián Blanco", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/26070_814e_6.jpg", 
    "course_url": "https://www.udemy.com/aprende-html-en-5-simples-pasos/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-05T11:07:21Z"
}