{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<em style=\"\">  (IMPORTANTE: Si estás interesado en este curso, ponte en contacto conmigo y te enviaré un cupón con un increíble descuento. Luego tú decides si usarlo o no. Sin compromiso, por supuesto)</em><br style=\"\">  </p>  <p>  \t  <strong style=\"\">¿Te haces un lío con todos los lenguajes, las siglas y las palabras extrañas que rodean el diseño de páginas web?¿Te parece que eso son &quot;cosas de informáticos&quot; y que tú nunca vas a llegar a comprenderlo?  </strong></p><strong style=\"\">  </strong><p><strong style=\"\">  \t     ¡¡Pues entonces, bienvenido a este curso de HTML y CSS para no-informáticos!! </strong> </p>  <p>  \t     Este es un curso básico, que empieza desde cero, y que está pensado para gente que, como tú, nunca ha visto nada sobre el diseño de páginas web. O que sí lo ha visto, pero que nunca ha llegado a manejarlo del todo.  </p>  <p>  \t     Pero eso sí, no se trata de un curso de iniciación. Presentamos <strong style=\"\">un curso totalmente completo con el que serás capaz de diseñar sitios web completos y profesionales.</strong> Abordaremos todos los aspectos de la creación y publicación de páginas web, por lo que además de aprender HTML y CSS, también incluimos módulos que nos enseñarán cómo funciona el sistema de internet, cómo subir nuestras páginas ya terminadas a la red, cómo posicionarlas en los buscadores para que aparezcan en las primeras posiciones (el famoso SEO)... En resumen, un ciclo completo con el que seremos capaces no sólo de crear páginas web de aspecto profesional, si no también de subirlas a internet y hacerlas accesibles para cualquier persona del mundo.  </p>  <p>  \t     Y todo ello <strong style=\"\">explicado con sencillez y sin tecnicismos.</strong>  </p>  <p>  \t     No lo dudes, si te apetece aprender de una vez por todas a crear tus propias páginas web, este es tu curso. Y si ya tienes conocimientos básicos de HTML y CSS, este curso te ayudará a refrescar lo que sabes y ordenarlo para sacarle el máximo partido ¡Te espero!  </p>  <p>  \t     (El curso incluye además dos módulos bonus sobre Photoshop y Dreamweaver para crear interesantes efectos avanzados para nuestras páginas de internet, y además un tercer módulo bonus sobre Posicionamiento SEO para que aprendas incluso cómo conseguir que tu página aparezca en los primeros puestos entre los resultados de los motores de búsqueda.)</p><p><strong style=\"\">Un recorrido completo de aprendizaje</strong><br style=\"\"></p><p>Este curso pertenece a una serie de cursos cuyo objetivo es enseñar a crear y diseñar páginas webs de forma fácil, práctica y comprensible para todo el mundo. Está especialmente pensado para quienes nunca han visto nada de este mundo y para facilitar su aprendizaje se divide en tres niveles que componen un itinerario educativo progresivo (del más sencillo al más complejo). La serie completa incluye los siguientes cursos (todos disponibles en Udemy):</p><p>1.- HTML y CSS para no-informáticos</p><p>2.- Aprende jQuery y jQuery UI de forma fácil y práctica</p><p>3.- Añade bases de datos a tus páginas con MYSQL y php (en producción)</p><p>Los alumnos apuntados en cualquiera de los cursos podrán solicitarme descuentos para realizar el resto de cursos.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Aprende Diseño web con HTML y CSS de forma fácil y práctica", 
    "price": "20.00", 
    "instructors": "Antonio Santos", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/150368_b39b_4.jpg", 
    "course_url": "https://www.udemy.com/html-y-css-para-no-informaticos/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-21T21:54:23Z"
}