{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t    El objetivo de este curso es proporcionar una introducción a la accesibilidad web que ofrezca una visión general de los diferentes componentes: contenido, navegación, diseño e interacción. La accesibilidad junto con la usabilidad son los dos componentes principales de la experiencia de usuario (<em style=\"\">user experience</em>).  </p>  <p>  \t<strong style=\"\">Al finalizar el curso serás capaz de crear sitios web accesibles para todos los usuarios, para todos los dispositivos y mejor posicionados.</strong>  </p>  <p>  \tEste curso tiene un enfoque practico. Contiene <strong style=\"\">más de 6 horas de vídeos</strong> y <strong style=\"\">más de 40 ejercicios de tipo test</strong> para evaluar el aprendizaje.  </p>  <p>  \t    Para aprovechar totalmente este curso es necesario estar familiarizado con las tecnologías de desarrollo web actuales, como <strong style=\"\">HTML, CSS, JavaScript y DOM</strong>.  </p>  <p>  \t    El curso contiene numerosos <strong style=\"\">ejemplos reales</strong> de sitios web accesibles y no accesibles.  </p>  <p>  \t    Este curso está dirigido a <strong style=\"\">diseñadores y desarrolladores web</strong> que deseen mejorar la calidad de sus sitios web.  </p>  <p>  \t    Los profesores del curso poseen una amplia experiencia en el desarrollo de sitios web accesibles para todos los usuarios.  </p>", 
    "end_date": null, 
    "title": "Aprende Accesibilidad Web paso a paso", 
    "price": 0, 
    "instructors": "Sergio Luján Mora, Ester Serna Berná, Olga  Carreras, Armando Suárez Cueto, Antonio Ferrández Rodríguez, Cátedra Telefónica Universidad de Alicante", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329654_c1f5.jpg", 
    "course_url": "https://www.udemy.com/aprende-accesibilidad-web-paso-a-paso/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T17:52:14Z"
}