{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>¿<strong style=\"\">Sobre que es el curso</strong>? Veremos como desarrollar un sitio web usando tecnología <strong style=\"\">ASP NET MVC</strong>. El tema a tratar sera desarrollar un sistema de portafolio (hoja de vida profesional).</p><p> En la cual estaremos tocando punto por punto todo los conceptos que conlleva ASP NET MVC.</p><p> ¿<strong style=\"\">Como <strong style=\"\">está </strong>compuesto el curso</strong>?Esta compuesto en 3 partes, en la <strong style=\"\">primera parte </strong>veremos conceptos previos como maquetación usando Bootstrap 3, jQuery y un ejemplo con el Entity Framework. En la <strong style=\"\">segunda parte</strong>, vamos a entender los conceptos de ASP NET MVC haciendo un aplicativo para gestionar alumnos. <strong style=\"\">Finalmente</strong>, comenzaremos con el desarrollo de nuestro proyecto, el cual es el Portafolio Profesional.</p><p>¿<strong style=\"\">Como está estructurado el curso</strong>? Cada clase está compuesta por un video, donde iremos desarrollando nuestros ejemplos y al finalizar la clase, adjunto lo que haya avanzado para que lo puedas descargar en caso que te atrases. Adicionalmente, en algunas clases se adjunta material extra para reforzar el conocimiento.</p><p> ¿<strong style=\"\">Porque tomar el curso</strong>?Porque es un curso que te da una muy buena base para enfocarte en el desarrollo de NET, y es muy problable, que al finalizar el curso te encuentres listo para comenzar a desarrollar tus propios proyectos. ¿Y por que no?, aspirar a un mejor sueldo.</p>", 
    "end_date": null, 
    "title": "ASP NET MVC 5 (C#): Desarrollando un portafolio profesional", 
    "price": "40.00", 
    "instructors": "Eduardo Patiño", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537894_e1b8_3.jpg", 
    "course_url": "https://www.udemy.com/asp-net-mvc-c-creando-un-portafolio-profesional/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T12:25:35Z"
}