{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<h4><strong style=\"\">      Want to learn how to write clean, maintainable, testable Javascript code?  </strong></h4>  <p>  \t                                                                                                  There are many libraries and frameworks to help you structure your Javascript code. BackboneJS is one of them.  </p>  <p>  \t<br style=\"\">  \t                                                                                                  In this course, I&#039;ll take you on a step-by-step journey to learn Backbone from novice to ninja. You&#039;ll learn everything you need to know to build structured and maintainable real-world applications with Backbone.  </p>  <p>  \t<br style=\"\">  \t                                                                                                  You don&#039;t need any prior knowledge of Backbone. Only basic understanding of Javascript and jQuery is enough to take this course.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <h4><strong style=\"\">We start with the big picture </strong></h4>  <p>  \t                                                    You&#039;ll learn the basic building blocks of Backbone and what they are used for. Then, I&#039;ll show you a real-world example of an application built with Backbone and explain how those building blocks work together in action.<br style=\"\">  \t<br style=\"\">  </p>  <h4><strong style=\"\">Then we start learning Backbone.js from scratch</strong></h4>  <p>  \t                                                                                                  Once you get the big picture, we start learning Backbone in a practical, hands-on way from scratch. Lectures are short, concise and up to the point, without wasting your time. I hate courses that waste students&#039; time (with too much rambling) and I&#039;ve done my best to make sure I won&#039;t waste your time in this course! <br style=\"\">  \t<br style=\"\">  </p>  <p>  \t                                                                                                  Each section includes:  </p>  <ul style=\"\">  \t<li><strong style=\"\">An introduction </strong>that tells you what you&#039;re gonna learn</li>  \t<li><strong style=\"\">A few lectures</strong>, each teaching you new concepts, in a step-by-step fashion</li>  \t<li><strong style=\"\">A cheat sheet</strong> for you to quickly review what you&#039;ve learned</li>  \t<li><strong style=\"\">A mini project or assignment </strong>for you to apply what you&#039;ve learned</li>  </ul>  <p>  \t<br style=\"\">  \t<br style=\"\">  </p>  <h4><strong style=\"\">Next we get into the real-world challenges </strong></h4>  <p>  \t                                                                                                  Once we cover the fundamentals of Backbone, then we&#039;ll cover unit testing and modularising the code. You&#039;ll learn the basics of RequireJS and Jasmine.<br style=\"\">  \t<br style=\"\">  </p>  <h4><strong style=\"\">And finally build an application from scratch</strong></h4>  <p>  \t                                                                                                  In the last section, we&#039;ll build an application with Backbone in an iterative way. With every iteration we enhance our app in a baby-step fashion. The before and after source code for each lecture is available for you to download to review or to complete on your own.<br style=\"\">  \t<br style=\"\">  </p>  <h4><strong style=\"\">I&#039;ll share with you other tips to make you a better web developer</strong></h4>  <p>  \t                                                                                                  I&#039;ve been a web developer since 2000. In the last section, I&#039;ll share with you lots of other tips on usability, productivity, clean coding, object-oriented programming, HTML, CSS, a little bit of security and many other things. These supplementary materials help you become a better web developer.<br style=\"\">  \t<br style=\"\">  </p>  <h4><strong style=\"\">I&#039;ll show you many real-world examples</strong></h4>  <p>  \t                                                                                                  Throughout the course I touch on some popular web sites such as Facebook, Twitter, Pinterest, Four Square and Bitly and explain how you can make something like them with Backbone. So, by the end of this course, you&#039;ll have a good and in-depth understanding of Backbone and how to use it in building real-world applications.<br style=\"\">  \t<br style=\"\">  </p>  <h4><strong style=\"\">      What else will you get?  </strong></h4>  <ul style=\"\">  \t<li>Lifetime access to course materials</li>  \t<li>New lectures, tips and tricks, absolutely free</li>  \t<li>Ask me any questions and I&#039;ll help you throughout your learning</li>  </ul>  <h4><strong style=\"\"><br style=\"\">  </strong></h4>  <h4><strong style=\"\">    What my students say:</strong></h4>  <p>  \t<em style=\"\">&quot;Mosh&#039;s course stands out as one of the best online courses I&#039;ve ever taken, whether for Backbone or any other technology. Mosh&#039;s teaching style is unique. He leads the student logically through a progression of understanding in a manner akin to good unit testing.&quot;</em> - David Handel<br style=\"\">  \t<br style=\"\">  \t<em style=\"\">&quot;This is one of the best courses I took o Udemy so far. Mosh is one of the best instructor as it is clear and it&#039;s evident that lessons are well prepared and not improvised. Thanks a lot!&quot; </em>-Andrea Salvatore<br style=\"\">  \t<br style=\"\">  \t<em style=\"\">&quot;Very good course, with crystal clear examples. Mosh is a very professional trainer and a magic developer. Thanks for your good job.&quot;</em>    Antonio Marqués Taltavull  </p>  <h4><strong style=\"\">What&#039;s the risk for you?<br style=\"\">  </strong></h4>  <p>  \t                                                    Absolutely nothing! This course comes with <strong style=\"\">Udemy&#039;s 30-day money-back guarantee</strong>. Just take the course, watch the lectures, practice the assignments and if you&#039;re not happy, ask for a refund. You&#039;ll get all your money back, no questions asked.<br style=\"\">  \t<br style=\"\">  </p>  <h4><strong style=\"\">    So do you want to learn Backbone from scratch and write clean, structured, maintainable and testable Javascript code?</strong></h4>  <p>  \t                                                                                                        Take this course now and let&#039;s get started.  </p>", 
    "end_date": null, 
    "title": "Backbone Tutorial: Learn Backbonejs from Scratch", 
    "price": "20.00", 
    "instructors": "Mosh Hamedani", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306556_2af2_6.jpg", 
    "course_url": "https://www.udemy.com/backbonejs-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-24T03:24:49Z"
}