{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t          This course presents the basic concepts of web application development, the HTTP protocol and introduces Java Servlets, in less than an hour. This is not a hands-on course, neither is this a full course on web development or Servlet and JSP.  </p>  <p>  \t  So, why this course, and how you will benefit from it?  </p>  <p>  \t          If you are interested to know about or learn web development, then this course will work as a first step for you. It will introduce you to the basic concepts of web development that we generally overlook while starting to learn web development. After enjoying the whiteboard narrations here, you will feel at home while taking your favourite hands-on course on web development.  </p>  <p>  \t          If you already are a web developer, but yet to feel confident about it, you might find this course quite useful in strengthening your concepts. When learning web development, most of us overlook the concepts and move quickly to hands-on and to projects. And then we keep coding with a lower confidence until we learn the concepts by experience. So, give less than an hour here, and then see how coding web applications become more interesting.  </p>  <p>  \t          If you are a non-technical or semi-technical project manager, dealing with web based projects, this course could be very useful in introducing you to the subject you deal with, and you would feel more at home with your programmers.  </p>  <p>  \t          Let me tell you that this course is not only for Java guys, but actually the first half of it, in which we discuss the web application basics and the HTTP protocol is equally beneficial to guys from other technologies, for example PHP as well.  </p>", 
    "end_date": null, 
    "title": "Basic Concepts of Web Development, HTTP and Java Servlets", 
    "price": "20.00", 
    "instructors": "Sanjay Patel", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267286_59bc_12.jpg", 
    "course_url": "https://www.udemy.com/web-application-and-java-servlet-concepts/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T11:58:37Z"
}