{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">Behavior Driven Development (BDD) with Ruby on Rails using RSpec and Capybara</em></strong> provides a thorough introduction to using BDD to building web applications using the popular Ruby on Rails framework. <strong style=\"\"><em style=\"\">Why BDD to build web applications?</em></strong> The advantages are numerous, and Feature specs used extensively in BDD read like plain English which allows end users and developers to easily communicate with each other using BDD tools. In addition, it is easy for the end users to write the features themselves. </p><p style=\"\">This course is designed for students who have some Ruby on Rails or web application development experience who want to take their skills to the next level but have no or limited experience in BDD or automated testing.</p><p style=\"\"><strong style=\"\"><em style=\"\">Why should students currently enrolled in the Professional Ruby on Rails Developer or already with some Rails experience take this course?</em></strong></p><p style=\"\">- <strong style=\"\">Behavior Driven Development</strong> is the focus of this course!</p><p style=\"\">- <strong style=\"\">RSpec</strong> and <strong style=\"\">Capybara</strong> experience for automated testing is necessary as a rails developer, covered thoroughly in this course!</p><p style=\"\">- Emulating browser based user behavior to complete a business process from beginning to end, covered thoroughly in this course!</p><p style=\"\">- Big resume booster, knowledge and usage of RSpec and automated testing is very important, most of the Rails community uses this!</p><p style=\"\">- Complete coverage in terms of features, <strong style=\"\">ALL</strong> features are built on basis of automated testing specs, <strong style=\"\"><em style=\"\">not just selective features</em></strong></p><p style=\"\">- Building <strong style=\"\">two complex and functional web apps</strong> including the featured workout web app in 1 course!</p><p style=\"\">Tip: Most rails syntax (not complex) will not be explained, therefore students are expected to know basics like naming conventions and .each method etc. However, <strong style=\"\"><em style=\"\">all features and BDD steps will be explained.</em></strong></p><p style=\"\">Some other key aspects of this course are:</p><p style=\"\">- <strong style=\"\">99</strong> lectures!</p><p style=\"\">- <strong style=\"\">Rails 4.2</strong> using cloud-based IDE</p><p style=\"\">- Working with external javascript libraries for charts and date pickers</p><p style=\"\">- Migrations, one-to-many and many-to-many associations</p><p style=\"\">- much, much more!</p>", 
    "end_date": null, 
    "title": "BDD with Ruby on Rails using RSpec 3 and Capybara", 
    "price": "30.00", 
    "instructors": "Mashrur Hossain, Emmanuel Asante", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531360_06c4.jpg", 
    "course_url": "https://www.udemy.com/rubyonrails-bdd-rspec-capybara/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T15:29:03Z"
}