{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Welcome!</p><p>Course fully updated August 5th 2015</p><p>What this Web development or Web designing course offers:</p><p>This course is about HTML and CSS coding, this course will take you through the essentials of becoming a successful web designer or web developer for extremely cheap!</p><p>To complete the course it can take students as fast as 1 week! There is a possibility of becoming a web developer or web designer. </p><p>This Web Development course is structured with 3 sections:</p><ol><ol><li><strong>Getting Familiar with HTML - </strong>This first section will get students familiar with the concept of html and get to the basics of html coding including text formatting, page formatting and many more things of web development and designing.</li><li><strong>Getting Familiar with CSS - </strong>This second section will give students the ability to create websites which are a combination of HTML and CSS code doing small projects at a time Including many more things of web development and designing.</li><li><strong>Creating Your Own Webpage! - </strong><span>This last section is going to give students the insights of what happens when creating a website, together we will create a website which will be carefully laid out with the right colour combinations and layout and many more things of web development and designing.</span></li></ol></ol><p></p><p>Whether you are a business owner, or already have a website set up, in today's world you will always be in need of a web designer or web developers who can charge you thousands for a job which is not very difficult. This course can easily take students from beginners to master web designers and web developers who will be able to create web pages from a simple notepad software in less than 2 hours (we do that in this course!). So if you want to start your journey as a web developer or web designer then join today!</p>", 
    "end_date": null, 
    "title": "Become a Web Developer", 
    "price": "25.00", 
    "instructors": "Fazal Siddiqui", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450704_df73_4.jpg", 
    "course_url": "https://www.udemy.com/learn-html-css-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T23:09:01Z"
}