{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t      We call this Become a Professional Web Developer not because we think we&#039;re great, but because this is hands down the most in depth course on web development in town.  </p>  <p style=\"\">  \t    This course includes <strong style=\"\">51+ hours of content</strong>! Wow!  </p>  <p style=\"\">  \t      The design and structure of this course follows elite college curriculum. You will begin by learning the basics of each programming language and technology web developers use, and you will be creating real life projects with every new skill you learn so you&#039;re getting the entire finished puzzle instead of just pieces that you have to put together yourself.  </p>  <p style=\"\">  \t<strong style=\"\">      More Than Just the Basics... Much More  </strong>  </p>  <p style=\"\">  \t      Most courses on web development walk you through the skills beginners need, but then require you to learn the skills that make you an employable web developer. This course is different. After you have learned the basics and built real projects for your portfolio, you can move on to hours and hours of continued training at the intermediate and advanced levels for each web development skill you&#039;ve learned.  </p>  <p style=\"\">  \t      Don&#039;t stop when you&#039;re just starting to get good at this, keep learning and enhancing your web development portfolio. New content will be added to this course frequently, so even if you complete the entire course, the next time you log in you&#039;ll have more skills to learn.  </p>  <p style=\"\">  \t<strong style=\"\">      Who Should Take This Course?</strong>  </p>  <p style=\"\">  \t      You should take this course if web development as a profession sounds good to you, or if you&#039;re looking to brush up on your web development skills in any area. There is so much content in this course that even experienced developers will benefit from it.  </p>  <p style=\"\">  \t<strong style=\"\">      What is Covered in This Course?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">HTML/HTML5</li>  \t<li style=\"\">CSS/CSS3</li>  \t<li style=\"\">JavaScript</li>  \t<li style=\"\">Ajax</li>  \t<li style=\"\">jQuery</li>  \t<li style=\"\">JSON</li>  \t<li style=\"\">PHP</li>  \t<li style=\"\">MySQL</li>  \t<li style=\"\">Responsive web design</li>  </ul>  <p style=\"\">  \t      Source codes are included for the entire course so you can learn by running the actual code and modifying it as needed.  </p>", 
    "end_date": null, 
    "title": "Become a Professional Web Developer", 
    "price": "30.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "60 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140238_dd80_2.jpg", 
    "course_url": "https://www.udemy.com/web-development-tutorials/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-01T06:06:38Z"
}