{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t          Many <strong style=\"\">startup non-technical founders are learning how to code</strong> their prototypes to get some quick feedback from potential users and pitch investors.  </p>  <p style=\"\">  \t <strong style=\"\">     However... once you learn how to code, deploying your app can be a challenge. </strong>You need to know how to configure web servers, database servers, automate installation of gems, git repositories synchronization, etc... all just to have your app up and running on the web.  </p>  <p style=\"\">  \t          Luckily we have providers like Heroku that make it extremely easy to get your app deployed in minutes, without configuring any servers at all. These are known as Platform as a Service (PaaS) providers.  </p>  <p style=\"\">  \t <strong style=\"\">   The basic deployment of a Rails app to Heroku is simple and quick</strong>, and most<em style=\"\"> &quot;learn how to code&quot;</em> courses cover it in just a few minutes. But if you chose to stay on Heroku for the long term, you should spend some time understanding how it works and how to optimize your app to get the most out of the resources provided by the platform and how it compares to going directly to cloud providers like Amazon or Rackspace.  </p>  <p style=\"\">  \t <strong style=\"\">   This course covers all you need to know </strong>to get your first basic deployment up and how to gradually expand features and functionalities with the help of ruby gems and Heroku third-party add-ons.  </p>  <p style=\"\">  \t <strong style=\"\">       By getting to know the platform you will:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Reduce costs by understanding that some times it&#039;s not just about &quot;<em style=\"\">adding more dynos!</em>&quot;, but to simply apply basic optimizations to your code.<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">Learn how to get full visibility of your app performance and real time logs so you can debug and fix issues faster.<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">Design your app so that it gets the most out of Heroku&#039;s architectural design.<br style=\"\">  \t<br style=\"\">  \t </li>  \t<li style=\"\">Set a professional deployment architecture with identical staging and production servers so you can test new features before those go live.</li>  </ul>", 
    "end_date": null, 
    "title": "Become a Heroku Rails Ninja: Expert Level Deployment Tools", 
    "price": "50.00", 
    "instructors": "Alejandro Corpeño", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/106178_9e45_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-heroku-rails-ninja/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-15T14:59:10Z"
}