{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Are you looking for becoming a professional web developer and learn the necessary skills to get a highly paying job as a Javascript engineer, but you don’t have anything to start with?</p><p>In 2020 will have over 1.4 million jobs available with salaries reaching the mark of 6 figures year for professional developers. It's a unique opportunity for those who are looking for starting a new career.</p><p>In this course you will learn how to program applications and how to think as a professional software engineer in few weeks.</p><p>This is the most complete Javascript course on Udemy. This course was designed to teach you how to become a Javascript Engineer from zero skills.</p><p>Learn step-by-step from the basic to advanced topics of Javascript. It's a highly interactive course with several videos, hundred of exercises and code challenges to test your skills.</p><p>In the first section of the course you will learn about the history of Javascript and setting up the tools you need to follow the program. The following sections you will dive deep into basic and important concepts of Javascript like data types, operators, statements, functions, arrays, objects and you will take several exercises to test your knowledge. By the middle of the course you will learn several important methods and start with more advanced topics like scopes and prototypes. In the last half of this program you will dive into advanced techniques, develop couple applications, fix bugs and take several challenges.</p><p>You need more than a regular programming language course to become a software engineer.  Acquiring the right mindset is not a trivial task and requires a lot of time, discipline and investment. I've being working for five years with web technologies and developing web applications.</p><p>To create this course I've studied in one of best programming schools in the world, Hack Reactor, and researched through the best materials available now a days. The professional experience combined with thousand hours of studying and research, allowed me to design a curriculum that helps students with no previous experience in programming to be able to master Javascript and acquire the necessary mindset of a professional software developer.</p><p>This is an evolving course and I will constantly update it with new sections and topics. YES, buying this course you will get much more than you are paying for.</p>Are you ready to become a Javascript engineer?", 
    "end_date": null, 
    "title": "Become a Javascript Engineer", 
    "price": "20.00", 
    "instructors": "Elvio Cavalcante", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544552_1355_4.jpg", 
    "course_url": "https://www.udemy.com/learn-javascript-become-software-engineer/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T02:43:57Z"
}