{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong></p><ul><li><em><strong>Over 3.3K satisfied students</strong></em></li><li><em><strong>Course updated on the November 2015.</strong></em></li></ul><p><strong>jQuery</strong></p><p>Learn the essentials you'll need to get started with jQuery, the most popular JavaScript library in use today.</p><p>Do you need jQuery? If you want to add the best awesome Javascript features and animations to sites or apps without the complicated code then YES.</p><ul><li><em>What is jQuery?</em></li></ul><p>jQuery is a fast, small, and feature-rich JavaScript library. It makes things like HTML document traversal and manipulation, event handling, animation, and Ajax much simpler with an easy-to-use API that works across a multitude of browsers. With a combination of versatility and extensibility, jQuery has changed the way that millions of people write JavaScript.</p><p><strong>Joomla</strong></p><p>This course takes a step-by-step approach to building Joomla websites. Each lesson builds upon the previous one, so your wall is solid.</p><p>So whether you're looking to save money by building your own website, or if you're an existing web developer needing to learn Joomla, you are in the right place.</p><p><strong>HTML5 &amp; CSS3</strong></p><p><strong>Want to start making some money from building Websites? Or maybe you're seeking a career change that gives you more free time and flexibility?</strong></p><p>You'll learn how to build your first website within a few days with all the basics of HTML and CSS. Then we expand and add upon that knowledge with more advanced HTML and CSS. Within a few weeks, you'll have a complete knowledge and ability to build startup quality websites. If you want to learn something fast you need to actually do it, and experience it firsthand. That's exactly what we'll do in this course. Through project-based learning, the course will teach you what you need to know in order to create wonderful websites.</p><p>This course teaches everything from scratch, You will learn from basics tags in html and css first and then once you are comfortable with the basic tags which are common in previous version then we will advance to html5 and css3 and learn everything inside.</p><p><strong>Bootstrap</strong></p><p>Bootstrap is the world's most popular mobile ready web development framework for HTML, CSS and JavaScript. Bootstrap is for you if you want to quickly build a super cool website which work across devices and browsers. It is easy to learn and super powerful.</p><p>After this course you will be able to quickly create responsive websites using Bootstrap.</p><p><strong>JavaScript</strong></p><p><strong>&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;COMING SOON&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;</strong></p><p><strong></strong><strong>____________________________________________________________________</strong></p><p><strong>Are you ready to become a full time Web Developer?</strong></p><p><strong>Learn: HTML, CSS, jQuery,Joomla , Bootstrap,Javascript , Databases, and more.<br></strong></p>", 
    "end_date": null, 
    "title": "Become a Certified Web Developer - Beginner to Expert", 
    "price": "50.00", 
    "instructors": "Quentin Wattez", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467426_7e36_8.jpg", 
    "course_url": "https://www.udemy.com/jquery101/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T15:35:37Z"
}