{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">So many times have I been asked &quot;How difficult is it to set up a Blog site?&quot; So I have made a series of short easy to follow videos, that show step by step how to get started. From buying a domain to installing Wordpress, it couldn&#039;t be made more simple.</p><p style=\"\">If you are a complete beginner at website building then you would really benefit from this course.</p><p style=\"\">The course is broken down in to seven short easy to follow videos, so if you are wanting to set up a website for your own blog or for a business this course will get you started.</p><p style=\"\">There is no complicated computer jargon and even things that look complicated are made easy.</p><p style=\"\">At the end of the course you will understand:</p><ul style=\"\"><li style=\"\"> How to set up a &#039;Wordpress&#039; website from start to finish.</li><li style=\"\">Domain (website address) purchase.</li><li style=\"\">Website Hosting.</li><li style=\"\">Wordpress (your website platform) and how to install it on your new site.</li><li style=\"\">Plugins and and how to install some important ones.</li></ul><p style=\"\">If you are looking for an easy way to get a website set up, then this course is for you. If you have experience of buying a domain and hosting plus installing Wordpress, then this is not for you.</p>", 
    "end_date": null, 
    "title": "Beginners guide to setting up a Wordpress Website", 
    "price": "40.00", 
    "instructors": "Paul Lester", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/521976_779f_2.jpg", 
    "course_url": "https://www.udemy.com/beginners-guide-to-setting-up-a-wordpress-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-06T14:21:01Z"
}