{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>Join Over 2,000 Very Happy Bootstrappers!</strong>  </p>  <p>  \t    Bootstrap is the most popular front-end framework on the web today, and people are going nuts over it! Why? Because it's incredibly easy to learn, and because you can save hours of work (or hundreds of dollars in precious development time)!  </p>  <p>  \t    Taking a step-by-step approach, this course will have you learning by doing, and you will become well-acquainted with the Bootstrap framework in very little time!  </p>  <p>  \t<strong>Learn the Most Popular Web Design Framework Quickly and Easily</strong>  </p>  <ul>  \t<li>Responsive web design</li>  \t<li>Attractive sliding carousels</li>  \t<li>Popup &amp; Modal windows</li>  \t<li>Media Queries</li>  \t<li>HTML Form Layout</li>  \t<li>Beautiful Typography</li>  \t<li>Increase development time by 50% or more!</li>  </ul>  <p>  \t    Hundreds of thousands of websites are using Bootstrap to achieve beautiful, unique, and custom layouts. It's time you learn this framework, and hit the ground running!  </p>  <p>  \t<strong>Boost Your Income by Learning Bootstrap</strong>  </p>  <p>  \t    Whether you're self employed, or work at a company — understanding how to develop website layouts with Bootstrap will save you and your company precious development time.  </p>  <p>  \t<strong>Self employed? Look at it this way.</strong>  </p>  <p>  \t    Two self-employed web developers are each hired to build a small website for $1,000. Developer #1 hand codes his website and it takes him 40 hours to complete, effectively making $25/hour. Developer #2 uses Bootstrap to build his website, and it takes him 20 hours, effectively making $50/hour. Which developer do you want to be?  </p>  <p>  \t<strong>Work at a studio?</strong>  </p>  <p>  \t    Bootstrap is a valuable skill. It's fundamental that company employees keep up to date with the latest technologies. An educated employee is an incredibly valuable asset. If you prove to your company that you can build high-quality websites in record time with a framework like Bootstrap, you have negotiating power for a higher salary.  </p>  <p>  \t<strong>Are you an Entrepreneur?</strong>  </p>  <p>  \t    If you're starting a new business, but only have a shoestring budget for your new venture, do yourself a favour and learn to code your company website with Bootstrap. You'll save yourself thousands of dollars, and be grateful you invested in yourself!  </p>  <p>  \t<strong>Invest in your future</strong>  </p>  <p>  \t    With the incredibly valuable skills you will learn in this course, you will make the value of this course back 10x by completing only a single web design job! <em>And it's completely risk-free! If you take this course and don't think it's worth the value you paid — you have 30-days to get a full refund.</em>  </p>  <p>  \t    In 3 - 5 hours of your time, you will build a truly beautiful web page you didn't know you had the ability to do! There is no reason why you shouldn't start right now. Invest in your future, and join me on the other side!  </p>  <p>  \t<strong>Get started today by clicking “Take This Course\".</strong>  </p>  <p>  \t<em>See you on the inside!</em>  </p>", 
    "end_date": null, 
    "title": "Bootstrap Basics: Program Responsive Websites", 
    "price": "25.00", 
    "instructors": "Brad Hussey, Code College", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/53256_d878_9.jpg", 
    "course_url": "https://www.udemy.com/code-responsive-website-twitter-bootstrap/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-10T17:08:21Z"
}