{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Want to be able to create responsive websites or applications fast and easily? Then you need to Bootstrap. </strong><strong style=\"\">This Course is an introduction to Bootstrap Basic Features and How to Use it.</strong><br style=\"\"></p>  <p style=\"\">  \t<strong style=\"\">This course will have you up and running with bootstrap in minutes and will provide you with the knowledge to keep learning more about the framework yourself as you use it.</strong>  </p>  <p style=\"\">  \t                On this crash course you will learn everything you need, to get started using bootstrap. Even though the title states that it is for developers, <strong style=\"\">anybody with some HTML and CSS experience can take this course.</strong> Most videos are short and straight to the point without wasting time in non-valuable material. If you are looking to learn how to implement bootstrap and start using it right away, this is the course for you.  </p>  <p style=\"\">  \t              Building responsive websites is the key for making a great a income in web development. The number of mobile users is growing every second and the market is huge. Prepare yourself for this growing market by getting started with bootstrap.  </p>  <p style=\"\">  \t              Bootstrap is the most popular framework for building responsive websites, and applications. Bootstrap makes it easy to add responsiveness to website and apps. There are thousands of pre-built styles and functions that can be used in your apps or pages within seconds of installing the framework.  </p>  <p style=\"\">  \t<strong style=\"\">Who is this course for?</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"></strong>For new developers who want to start the right path with web development</li>  \t<li style=\"\">For professionals developers who need to update their skills</li>  \t<li style=\"\">For anybody with basic HTML and CSS who wants to make their sites responsive</li>  </ul>  <p style=\"\">  \t<strong style=\"\">What  will you learn?</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"></strong>Yo will find out what bootstrap really is</li>  \t<li style=\"\">How to install bootstrap</li>  \t<li style=\"\">How to use bootstrap</li>  \t<li style=\"\">How to use all the classes</li>  \t<li style=\"\">How to to use Javascript within the framework</li>  \t<li style=\"\">The Famous Grid System</li>  \t<li style=\"\">How to structure your markup for solid responsive foundation</li>  \t<li style=\"\">What are the best code editors to use</li>  \t<li style=\"\">How to customize the framework to get what you need (plugins)</li>  \t<li style=\"\">and lots more......</li>  </ul>", 
    "end_date": null, 
    "title": "Bootstrap 3 Introduction : Create RESPONSIVE Websites Fast", 
    "price": "20.00", 
    "instructors": "Edwin Diaz", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398456_aefd_4.jpg", 
    "course_url": "https://www.udemy.com/bootstrap-3-introduction-make-responsive-websites-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T21:10:31Z"
}