{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>First look at the all new BOOTSTRAP 4. Find out what’s new LEARN Bootstrap 4.\n\n  </p>\n\n<p>This course is designed for those who are familiar with Bootstrap and want to learn Bootstrap 4's newest and greatest features without wasting time going over old features. You will learn the new features by creating a real project. </p>\n\n<p>Twitter Bootstrap has become the most widely used framework for quickly building responsive websites, and they're currently launching Bootstrap 4 to the public. Bootstrap is the most popular HTML, CSS, and Javascript framework for developing responsive, mobile first projects on the web. Designed for everyone, everywhere.Bootstrap makes front-end web development faster and easier. It's made for folks of all skill levels, devices of all shapes, and projects of all sizes.\n\n  </p>\n\n\n\n\n\n<p>One framework, every device. Bootstrap 4 easily and efficiently scales your websites and applications with a single code base, from phones to tablets to desktops with CSS media queries.\n\n  </p>\n\n\n\n\n\n<p>Everything you need to learn about Bootstrap 4 is provided within this course.\n\n  </p>\n\n\n\n\n\n<ul><li>No wasted time watching someone type we get right to the point</li><li>Quick lessons get right to the point</li><li>Fully covered topics with real world examples</li><li>Full HD easy to read source coding</li><li>Bootstrap makes front-end web development faster and easier. It's made for folks of all skill levels, devices of all shapes, and projects of all sizes.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course covers all the components you will need to create your own Bootstrap 4.0 functional website.\n\n  </p>\n\n\n\n\n\n<p>Bootstrap easily and efficiently scales your websites and applications with a single code base, from phones to tablets to desktops with CSS media queries.\n\n  </p>\n\n\n\n\n\n\n\n<p><strong>Course Goals:</strong>\n\n  </p>\n\n\n\n\n\n<p>At the end of the course, you will be able to:\n\n  </p>\n\n\n\n\n\n<ol><li>Learn how to build a website using Bootstrap 4</li><li>Understand new features and functionality in Bootstrap 4</li><li>Implement Bootstrap 4 code</li><li>Design and create your very own Web site</li></ol>", 
    "end_date": null, 
    "title": "Bootstrap 4: Exploring New Features", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/861122_53f3_3.jpg", 
    "course_url": "https://www.udemy.com/bootstrap-40exploring-new-features/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-27T04:32:59Z"
}