{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Bootstrap Learning is very Important Especially Essential Training of Responsive Web Development Complete Course and Creating your Very own Website is very Necessary part of Modern Web Technologies.</p>\n\n<p><strong>As this is the Time of Responsive Designs in Web Development so Why are you Wasting your Time ?</strong></p>\n\n<ul><li><strong>Why Don`t you Guys Start Working with the Most Useful and Flexible Framework to make Your Own Responsive Designs </strong><strong>?</strong></li></ul>\n\n\n\n<p>Well, This is a <strong>Life Saving Opportunity</strong> for all of you to Learn the Bootstrap From A to Z. Start Learning from WHAT IS BOOTSTRAP ? to Creating your own Designs. Bootstrap Provide us almost 96% features of Front End Development by its own. Before Bootstrap :</p>\n\n<ol><li>Our Designs were Non Responsive.</li><li>To make Designs Responsive we had to work with Media Queries Only.</li><li> We had to Write a Bunch of CSS that was a crazy Tough Job.</li></ol>\n\n<p>Bootstrap Gives us Everything from Its Classes. It allows us to write more HTML then CSS. In all of the Lectures of BASICS OF BOOTSTRAP , you will Cover almost every Topic that is necessary for you to know. At the Start of this course you will be Learn <strong>Basics of Bootstrap</strong> :</p>\n\n<ul><li>How to Download Bootstrap</li><li>How to Connect Bootstrap Files with HTML Page</li><li>Forms</li><li>Buttons</li><li>Alerts</li><li>Wells</li><li>Jumbotron</li><li>Tables</li><li>Navigation</li><li>Advance Navigation</li><li>Carousel</li><li>Advance in Carousel</li><li>Typography in Bootstrap</li><li>Images Management through Bootstrap</li><li>Scroll Spy Plugin</li><li>Panels</li><li>Collapsible</li><li>Glyphicons</li></ul>\n\n<p><br></p>\n\n<p>After Learning a Lot of Stuff About these Features you will be able to Make Your Own Beautiful Website in Bootstrap. In <strong>Project we will make</strong> :</p>\n\n<ul><li>One Page Scrolling Navigation Website (Using Scroll Spy Plugin)</li><li>Blog Type Website</li></ul>\n\n<p><strong>Your Home Task will be to Make a Portfolio Website</strong> .</p>\n\n<p>You can Ask Any Question about the Course, Can Show me Your Work for Extra Suggestions at any time without any Hesitation. </p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Bootstrap Essential Training - Create Your Very Own Website", 
    "price": "30.00", 
    "instructors": "Abdul Basit", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/767656_f8fb_3.jpg", 
    "course_url": "https://www.udemy.com/ultimate-bootstrap-basics-course-with-2-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-19T13:59:25Z"
}