{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>UPDATE: </strong><strong>Added for Winter 2015-2016:  </strong>  </p>  <ul><li><strong>PHP Quick Minicourse!</strong></li><li><strong>Q&amp;A Blab - Bootstrap and WordPress HTML and PHP integration and more!</strong></li></ul><p>Get the Bootstrap 3 WordPress Theme course NOW while the price is still low ... just CHECK OUT THE REVIEWS below!<br></p>  <p>Join more than 5000 students who have started the Bootstrap 3 WordPress Theme course ... a HUGE thank you to each and everyone. Do not miss out - TAKE THIS COURSE NOW!  </p>  <p>  \t<strong>======================================================</strong></p>  <p><strong>WordPress and </strong><strong>Bootstrap 3 is like a box of chocolates!</strong></p>  <p>  \t                                Sink your teeth into some amazing and tasty Bootstrap 3 treats. Enjoy the sweet aroma when you crack open the colorful pieces of smooth CSS and HTML goodies.  </p>  <p>  \t                              Delight your guests with an attractive and custom baked website that you magically piece together into a wonderful WordPress theme.  </p>  <p>  \t                          ENLIST NOW in the Develop a Bootstrap 3 WordPress Theme course to inspire your boss and draw in new customers with your stunning skills.  </p>  ======================================================  <p>  \t<strong>An Excellent Course for Bootstrap Combined with WordPress. </strong>  \t                                                 The instructor provides a clear and concise description of his work every step of the way. He demonstrates his knowledgeable coding skills using Notepad++ . The voice and quality of the production were excellent. I thoroughly enjoyed this course and I would recommend this to any developers or designers, beginner and advanced, interested in learning new concepts to further enhance their skills into the inner workings of Bootstrap and WordPress theming.  </p>  <p><em><strong>+Susan Cork</strong></em>  </p>  <p>  \t                                        ======================================================</p><p><strong>Bootstrap 3 is a fantastic framework </strong>for creating websites that <strong>LOOK GREAT</strong> on all internet browsers – from mobile and tablets to desktops.  </p>  <p>  \t<strong>                               WordPress is simply the most popular website creation platform and content management system on the face of the Earth!  </strong>  </p>  <p>  \t                                                                         Bootstrap 3 and WordPress are sizzling <strong>HOT</strong> and <strong>TRENDING</strong> right <strong>NOW</strong> and <strong>FREE</strong> to use :)  </p>  <p>  \t                                          Master developing for the Bootstrap 3 and WordPress Theme platforms and you'll <strong>become the obvious expert</strong> of choice!  </p>  <p>  \t<strong>In this course, I take you by the hand and walk you step-by-step through the slick Bootstrap HTML and CSS framework and help you build your own stunning WordPress Theme from scratch!</strong>  </p>  <p>  \t                                        Learn how to create a WP Theme using Bootstrap 3 ... <strong>Enroll Now!</strong>  </p>  ======================================================<p>  \t<strong>Expert Guidance on Responsive Web Design with WordPress and Bootstrap 3  \t</strong>This course is great in explaining about responsive web design with WordPress and Bootstrap 3. The structure of the course has been <strong>well planned</strong> - each lesson is presented with great clarity in a concise, right to the point manner and the course progresses in a <strong>smooth, logical flow</strong>.  \t                                        From designing the prototype to creating the WordPress theme, this course is about  <strong>as comprehensive as it should be without overwhelming</strong> me with too much information. Thrandur (the instructor) covers each topic with <strong>amazing attention to detail</strong> in an <strong>engaging tone</strong>. Also, working files and external resources are generously provided whenever applicable. What impresses me most are <strong>the insights he shares</strong> based on his own experience ... the practical tips that would  <strong>save me a lot of time</strong> from having to figure it out myself.  \t                                        In a nutshell, if you're looking to learn about responsive web design with WordPress and Bootstrap 3, this course will help you get there effectively.  \t<em>+Michael Lim</em>  </p>  ======================================================<p>  \t<strong>  DISCOVER HOW TO BUILD  </strong>  </p>  <ul>  \t<li>A Wordpress Theme from scratch</li>  \t<li>Use Twitter Bootstrap 3 to create stunning designs</li>  </ul>  <p>  \t                                                                         Develop a Responsive WordPress Theme with Bootstrap 3 takes you stepbystep from getting set up and idea creation to a working theme that you can use or sell to high-paying customers!  </p>  <p>  \t                                                                         If you want to make money creating websites that are easy to make and look amazing on all devices this course is for you.  </p>  <p>  \t                                                                         Get up and running in the best-practice Bootstrap 3 framework and WordPress platform.  </p>  <ul>  \t<li><strong>Full, free lifetime access</strong></li>  \t<li><strong>All future extra lectures and upgrades are always included for free</strong></li>  \t<li><strong>Unconditional Udemy 30 day money-back guarantee ... that's my personal promise of your success!</strong></li>  </ul>  <p>  \t                                                                     ... and much, much more!  </p>  <p>  \t<strong>  ONE FINAL POINT  </strong>  </p>  <p>  \t                                                                     Now you can have your own WordPress Bootstrap 3 Theme up and running today, right after going through this course ... and be earning big soon after that!  </p>  <p>  \t<em>Click the \"take this course\" button, top right, now ... every hour you delay is costing you money.</em>..  </p>  <p>  \t                                                                     Learn first hand how I create a WordPress Theme using Bootstrap 3. Scroll up and   <strong>Enlist Now!</strong>  </p>", 
    "end_date": null, 
    "title": "Bootstrap 3 -> Profitable WordPress Theme Development!", 
    "price": "20.00", 
    "instructors": "Thrandur Arnthorsson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309370_2e64_7.jpg", 
    "course_url": "https://www.udemy.com/bootstrap-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-28T09:16:46Z"
}