{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>**** Free Web Hosting Offered for your peace of Mind****</strong><br></p><p><strong><strong>**** Learn Step by Step with NO Step Skipped****</strong><br></strong></p><p><strong>Are you looking for a Step by Step course that will take you from a complete beginner to mastering HTML5 and CSS3 and building stunning websites from scratch?</strong></p>  <p><strong>Are you looking for a course that will teach you Step by Step how to design, code and publish a Real World Website?</strong></p>  <p><strong>Are you looking for an engaging course, that makes your learning experience fun and exciting while you are acquiring precious skills that will prepare you to becoming one of the most sought after professionals in the web development market?</strong></p>  <p>If you answer yes to any of the questions above, then you have come to the right place.</p>  <p>This course is the “<strong>Golden Introduction to Web Development</strong> “, where you will learn HTML5 and CSS3 using a practical approach: learning by doing.</p>  <p>First of all, you are going to understand the structure of a webpage. Then you will setup your <strong>F</strong><strong>ree Web Hosting</strong> which comes as a <strong>bonus</strong> with this course. After that, you will move to HTML5 and learn the components that build up the skeleton of a webpage; you will cover various concepts to a detailed level: Paragraph, links, forms, iframes, etc. Then, you will move to CSS3 and learn how to add professional decoration and styling to your websites, you will also get introduced to advanced skills like CSS3 transitions and animations.</p>  <p><strong>At the end of the course, you will use your Web Development Skills to build a Mathematics Tutorials Website to a highly professional degree.</strong> You will design it, code it, validate it, and ultimately launch it online and share it with the whole world. </p>  <p>So is this course for you? This course is perfect for anyone with no coding experience, or who knows some HTML and CSS but would like to learn advanced concepts and confidently build full websites from scratch.</p>  <p>Start learning today by clicking the “<strong>Start learning Now</strong>” button.<strong></strong></p>  <p>I hope to see you in the course!</p>", 
    "end_date": null, 
    "title": "Build Real World Websites from Scratch using HTML5 and CSS3", 
    "price": "20.00", 
    "instructors": "Eng Issam Baou", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/701570_9899.jpg", 
    "course_url": "https://www.udemy.com/web-development-html5-css3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-19T15:39:09Z"
}