{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Beginners Guide For Building Money Making Site Up To $4K Monthly</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Join over 6,000 satisfied students learning new skills to improve their lifestyle.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">    Learn to build a website</strong> which can earn enough money to allow you to <strong style=\"\">quit your current job</strong>.  We take you through each strategy showing you how we use it and how much we earn from each program.  These same techniques can then be applied on your site to earn money just the same for you.  Take the first step into the rest of your life.  </p>  <p style=\"\">  \t<strong style=\"\">Never shared before.</strong>  We share our Three Most Profitable Affiliate Programs and how to implement them within your site so they seem natural.  Many viewers turn away from sites which appear to have too many ads.  That's why it's so important to only use these programs when they appear natural.  </p>  <p style=\"\">  \t                  Ultimately this is the <strong style=\"\">blueprint for our iPhonecaptain site</strong>.  It earns enough revenue to allow me to stop teaching.  We normally<strong style=\"\"> earn around $3-$4K per month</strong> or more.  If you include our Youtube earnings it's much more.  If you are interested in earning revenue through Youtube we have a dedicated course on Udemy which teaches you everything you need to know.  It's called Earn $2K Monthly Income: Teacher to Blog Fulltime  </p>", 
    "end_date": null, 
    "title": "Build A Website from Home", 
    "price": 0, 
    "instructors": "Mitch Stevens", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/377094_f302_2.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-guide-for-building-a-website/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-24T16:29:00Z"
}