{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span>With </span><strong>&quot;Developing a Search Engine&quot;</strong><span>, you will learn everything about Search Engines, even if you&#039;ve never build one before!</span>  </p>  <p>  \t                      The full course has <strong> several video lectures</strong>, divided into several chapters. Each chapter will give you a new level of knowledge in Search Engine development. We&#039;ll start from the basics of Search Engine development to more advanced and the most popular algorithms used now a days.  </p>  <p>  \t<strong>&quot;Building a Search Engine&quot;</strong> will give you a new perspective on how the Internet works and after you completed the course you will be able to create your own Search Engine with the latest technology and algorithms. Hope you enjoy!  </p>  <p>  \t<strong>NOTE: </strong>In order to keep you up to date in the world of Search Engine Development all the chapters will be updated regularly with new lectures, projects, quizzes and any changes in future versions of all the programming languages covered on the course.  </p>  <p>  \t<strong>Why Learn Search Engine Development?</strong>  </p>  <p>  \t                     The internet is the fastest and largest platform ever created for humans to learn, communicate, share, or create businesses of any kind, and all of this in just 15 years! It is estimated that in the next 2 or 3 years more than 80%%%% of the companies around the world will become internet dependent which will cause a huge demand for Search Engine developer in this market. As the <strong>World Wide Web</strong> grows Search Engines needs to upgraded proportionally.  </p>  <p>  \t                     Learning Search Engine Development will give you the opportunity to start ahead of other competitors by giving you the knowledge of the most recent web technologies and how to better apply them on your future projects. Knowing Search Engine Development will give you the ability to control and create anything on the web.  </p>  <p>  \t<strong>   How this course will help you to get a Job?</strong>  </p>  <p>  \t                     At present the fastest growing technology in the Internet is Search Engines. Google makes thousands of changes every year and employees larger number of engineers who can make their Search Engine more efficient as the structure of the web is becoming larger and complicated. Other companies are employing Search Engine experts to optimize their websites to appear on top results in Search Engines.  </p>  <p>  \t                     I promise you would have never had such kind of learning experience.  </p>  <p>  \t                     Welcome to <strong>&quot;Building a Search Engine&quot;</strong>  </p>", 
    "end_date": null, 
    "title": "Building a Search Engine", 
    "price": "20.00", 
    "instructors": "QScutter Tutorials", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/96238_8243_4.jpg", 
    "course_url": "https://www.udemy.com/building-a-search-engine/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-23T19:26:54Z"
}