{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Complete web developer guide to creating an amazing fully functional website!</strong></p>\n\n<p>All of the source files and resources needed to create a custom website from scratch are included in this course.  This course is perfect for anyone who wants to learn about website creation.  All of the source code is explained in a step by step easy to follow structure.  Learn to make your own websites, grow your portfolio and more.</p>\n\n\n\n<p>Web development skills are in high demand, this course will teach you how to make websites.   Starting with a blank page, code is added and explained.  Starting with a wireframe we build out the site step by step within this course. <strong> Watch the code come to life!</strong></p>\n\n\n\n<ul><li>Start with a basic HTML5 template which you can use to create any website.</li><li>We show you how to create a content page structure, using a header, container, submenu and footer.  Format your websites using this base structure to create unlimited number of variations.</li><li>Create a NAV bar for website navigation</li><li>Style your HTML to make it look amazing</li><li>Add main content area and submenu for more navigation</li><li>Source files are included, follow along creating your own content.</li><li>Create a footer and your website is ready to go.</li></ul>\n\n\n\n<p>Next steps are also included.  Add simple PHP code to create added functionality such as a contact form.  Make your website multi page ready with PHP headers and footers.  You will be able to create and propagate changes in the heading across as many pages as you like.  We also walk you through how to make your website responsive to be viewed on any screen.</p>\n\n\n\n<p><strong>Complete website development course, create your own version of this website use it in your portfolio.</strong></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Build a website HTML5 CSS3 Beginner Course", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747552_bf30.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-website-html5-css3-beginner-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-31T04:55:28Z"
}