{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Course Is Up To Date As of January 2015</strong>  </p>  <p>  \t        JOIN 1100+ STUDENTS ALREADY TAKING THIS COURSE.<br style=\"\">  </p>  <p>  \t        So you finally decided that you want to create a blog but you don&#039;t  know where to begin. You don&#039;t have the budget ($1500 +) to hire a  professional designer and you need some direction. Creating a quality  blog website with great features can be very costly and extremely time  consuming...until now. In this course, you&#039;ll learn how to build your  blog with Joomla from the ground up.  </p>  <p>  \t<strong style=\"\">Why Create a Blog?</strong>  </p>  <p>  \t        Let&#039;s face it, blogging have completely changed the way that we communicate. The benefit of having your own blog is that it allows you to write about what you&#039;re passionate or interested in. There are people making thousands of dollars a month from their blog just by sharing their favorite recipes, save money when traveling, working from home, etc. When it comes to blogging, there&#039;s no off topic subject because there are thousands or even millions of people who are just as passionate about the things that you want to write about.  </p>  <p>  \t<strong style=\"\">What Will You Learn In This Course?</strong>  </p>  <p>  \t        Setting up a professional blog is very expensive, time consuming and requires way too many variables than most people can handle. This course walks you through step by step and shows you everything you need to do.  </p>  <p>  \t        At the end of the course, you will have a professional blog website that you can not only share with the world, but also make money while doing it.  </p>  <p>  \t<strong style=\"\">Profiting From Your Blog</strong>  </p>  <p>  \t        One of the benefits about having a blog is the ability to generate revenue by selling ad space. You will learn how to sell ad space that could generate hundreds or even thousands of dollars per month.  </p>  <p>  \t<strong style=\"\">Email List Building</strong>  </p>  <p>  \t        Another important ingredient in a blog is the ability to build your opt in list by getting subscribers. You&#039;ll learn how to setup your newsletter subscription so that you can start building your list for free. Doing this on your own will cost you $1,000&#039;s of dollars a year.  </p>  <p>  \t<strong style=\"\">   The Bottom Line</strong>  </p>  <p>  \t        You  will learn step-by-step instructions on how you too, can create an  amazing blog without writing a single line of code. Joomla offers you a  ton of exciting feature that will help you get your blog going.  </p>  <p>  \t<strong style=\"\">How Do I Sign Up?</strong>  </p>  <p>  \t        Signing up is very simple. Just click on the &quot;Take This Course&quot; tab at the top right hand corner of the screen to get started. That&#039;s it!  </p>  <p>  \t        As always, I&#039;m here to answer any of your questions. So feel free to drop me a line anytime.  </p>", 
    "end_date": null, 
    "title": "Build And Monetize Your Blog Website With Joomla In Minutes", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/173276_4d9d_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-blog-website-with-joomla/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-26T15:08:45Z"
}