{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tBased on an example of an online e-commerce chocolate store, this video course helps you learn the concepts of MVC and utilize the rich support of the Spring MVC framework to build dynamic web applications. You start by installing the Spring Tool Suite IDE and creating your first Spring MVC application. Next, you will learn how to integrate the model and business services to add functionality to the application. You then move on to learn about the process of creating a product catalogue and how to develop the user registration page functionality. You will then proceed to create an e-commerce shopping cart that helps users place orders and then implement constraints for the process. Finally, you will learn how to use Freemarker (a template engine for the Java platform) and Apache Tiles (a template composition framework) and design a RESTful API to implement the ordering functionality as a REST web service.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<span><strong style=\"\">Koushik Kothagal </strong>has over 12 years of professional experience working with various server-side technologies and developing web applications. He has worked extensively with Java, Spring, Oracle, and other enterprise technologies. He loves teaching, and when he’s not coding Java, he’s probably teaching it! In his spare time, he runs the tutorial website Java Brains which covers various enterprise Java technologies.</span>  </p>", 
    "end_date": null, 
    "title": "Building Web Applications with Spring MVC", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366608_d4e5_2.jpg", 
    "course_url": "https://www.udemy.com/building-web-applications-with-spring-mvc/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T13:06:21Z"
}