{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tThis video course is a step-by-step guide for creating a high performance server in JavaScript. The course begins with installing Node, to understanding modules and file streams, and setting up a server. The course also teaches you different web application frameworks and explores advanced features such as web sockets and key-value stores.  </p>  <p>  \tThis comprehensive video tutorial will take you from a beginner-level programmer and teach you everything you need to know to get productive with Node. Fundamental concepts are illustrated with brief examples and many sample projects that help grasp the complex functionality in an easy manner.  </p>  <p>  \tWith a primer on modules and npm, you&#039;ll understand how to work with building blocks of Node and publish your own creations. Accelerated development with frameworks like Express will make your app more responsive with caching and real-time communication.  </p>  <p>  \tThis course is an indispensible guide to building a Node app, whether from the ground up or with the help of higher-level frameworks.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<span><strong style=\"\">Joe Stanco</strong> (@JoeStanco) is a frontend developer living in NYC. His fascination with code started with the Tandy “Trash 80” PC—a present for his seventh birthday. He has been programming in JavaScript for 15 years. A versatile developer, he has cultivated expertise in UI design as well as proficiency in backend languages such as Ruby, PHP, and Perl. He holds a BA from Bard College and a certificate in Software Development from Columbia University. Joe currently oversees a team at BuzzFeed tasked with implementing R&amp;D projects and innovative partner integrations for clients like GE and Pepsi. He has worked at a variety of startups throughout his career, including Animoto, ASMALLWORLD, Vonage, and Travelocity. In his free time, he teaches 4th graders how to build robots with Lego Mindstorms for NY Cares. He is also an avid supporter of LISA (Leaders in Software and Art), a digital art salon founded in 2009.</span>  </p>", 
    "end_date": null, 
    "title": "Build a Network Application with Node", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366412_fcc4_2.jpg", 
    "course_url": "https://www.udemy.com/build-a-network-application-with-node/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T07:16:56Z"
}