{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">SELL UNLIMITED PRODUCTS ONLINE. NO MONTHLY FEES. SET SHIPPING RATES. GROW YOUR BUSINESS.</strong>  </p>  <p>  \t----------------------------------------------------------------------------------<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t       Selling online is a big, BIG business. With billions of dollars made  daily, people are always looking for something to buy. Online stores  like eBay and Amazon are making billions of dollars yearly just by  selling products. While most people want to sell online, some don&#039;t  because they can&#039;t afford the high cost ($1500+) of hiring a web  designer/developer to create a website for them. But not to worry.<br style=\"\">  \t<br style=\"\">  \t           This  new course will teach you how ANYONE can setup their own online store  without hiring an expensive designer/developer to create a website for  them. We understand that for most startups small businesses, you don&#039;t  have the $6000+ budget it requires to hire a team to create your online  store. So...we&#039;re going to teach you how to do it yourself.<br style=\"\">  \t<br style=\"\">  \t           If  you&#039;ve always wanted to have your online store but couldn&#039;t because you  couldn&#039;t afford to hire a team to help you create your online store, no  need to worry anymore. After taking this course, you will be able to  create a stunning online store that will leave a &quot;WOW&quot; effect from  everyone who visits your website.<br style=\"\">  \t<br style=\"\">  \t           The best part about all of this  is that, you don&#039;t have to be an expert programmer or write a bunch of  codes. You will be able to create a professional online store that looks  expensive and gets the job done. Some of the features your store will  have includes:  </p>  <ul style=\"\">  \t<li>Multiple currencies and daily update exchanged rate.</li>  \t<li>Multiple languages.</li>  \t<li>Unlimited Categories.</li>  \t<li>Unlimited Manufacturers.</li>  \t<li>Unlimited Products.</li>  \t<li>Product Reviews and Rating.</li>  \t<li>Related Products.</li>  \t<li>Compare Products.</li>  \t<li>Wishlist Products.</li>  \t<li>Unlimited images per products.</li>  \t<li>Multiple sizes for images with automatically resize feature.</li>  \t<li>Products Options (types Select, Radio and Checkbox) with additional price.</li>  \t<li>Multiple Tax Rates</li>  \t<li>Orders, Viewed Products, Purchased Products Reports.</li>  </ul>  <p>  \t<br style=\"\">  \t<strong style=\"\">No Monthly Payments</strong><br style=\"\">  \t           Most store creator charge  you a monthly fee or set a limit on how many products yous store can  have. With this course, you will be able to create your store with  UNLIMITED number of products and ZERO monthly fees.<br style=\"\">  \t<br style=\"\">  \t           These are  only a few of the exiting features that your website will have. Imagine  finally having a full eCommerce website that have the same features as  Amazon; how exciting is that!  </p>", 
    "end_date": null, 
    "title": "Build Your Own Online Store And Sell Unlimited Products FREE", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/133450_e797_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-an-online-store-with-joomla/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-14T05:50:57Z"
}