{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Learn how to Create a Professional E-commerce site in less than 2 hours!!</strong>  </p>  <p>  \t      Most Web Design companies charge<strong style=\"\"> $5,000+</strong> for e-commerce sites because of the quality of design and the current industry cost for most e-commerce sites.  </p>  <p>  \t      By taking this course you will be learning how to develop a <strong style=\"\">professional e-commerce</strong> site without <strong style=\"\">any programming knowledge</strong> at all and in less than 2 hours.  </p>  <p>  \t      This course shows you the<strong style=\"\"> tricks and techniques</strong> that professional web design companies use to develop websites quickly and efficiently and why they are able to charge ridiculously amounts of money.  </p>  <p>  \t<strong style=\"\">Features:</strong>  </p>  <ul style=\"\">  \t<li>Easy to follow, step by step instructions</li>  \t<li>  \t<p>  \t\t  Practical tutorials with the explanation why we do things that way  \t</p>  \t</li>  \t<li>  \t<p>  \t\t  Valuable tips that can save you thousands of dollars.  \t</p>  \t</li>  \t<li>  \t<p>  \t\t  Personal Contact With Me  \t</p>  \t</li>  \t<li>  \t<p>  \t\t  7 Days a Week Support &amp; Help  \t</p>  \t</li>  \t<li>  \t<p>  \t\t  Review of your e-commerce site at the end of the course  \t</p>  \t</li>  </ul>  <p>  \t<strong style=\"\">What will I need for this course?</strong>  </p>  <p>  \t      I will be showing you how to get <strong style=\"\">free and unlimited web hosting</strong> and free domain names to develop your e-commerce site on as well as a free premium e-commerce site.  You will not have to pay for any licensing or other products to complete this course, everything is provided for you.  </p>  <p>  \t <strong style=\"\">My Goal For You:</strong>  </p>  <p>  \t   By the end of this course my goal is for you to understand how to <strong style=\"\">develop &amp; build</strong> a professional e-commerce site.  In this course your learning the secrets of why and how people are able to develop such a professional e-commerce website.  </p>  <p>  \t <strong style=\"\">Problems?</strong>  </p>  <p>  \t If you have problems following any of the lectures, let me know and I&#039;ll try to set up a live <strong style=\"\">Q&amp;A session</strong> to guide you through.  </p>  <p>  \t <strong style=\"\">Need Additional Help?</strong>  </p>  <p>  \t If you are still struggling throughout the course I will personally help you to make sure you complete the course and fully understand everything as well as help you get your<strong style=\"\"> site up and running.</strong>  </p>", 
    "end_date": null, 
    "title": "Build a Professional e-commerce website in less than 2 hours", 
    "price": "20.00", 
    "instructors": "Zachary Matar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/249508_cf21_4.jpg", 
    "course_url": "https://www.udemy.com/build-a-professional-e-commerce-website-in-less-than-2-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-24T16:29:02Z"
}