{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em><strong>UPDATE 15 NOVEMBER 2015: </strong></em></p><p><em></em><strong><em>#1 - We made it! Over 2000+ students have enrolled in our AngularJS course and we have a 5 star rating! We thank every single student &lt;3<br>#2 - We created a private chat room for our students in which they can ask questions to us and other students about the lectures, AngularJS and non-course related topics. Amazing community!</em></strong></p><p>We will build a To Do Web Application which users can visit and use using <strong>AngularJS</strong> like a Professional. You will be able to <strong>Track</strong> your visitors using <strong>Google Analytics</strong> and <strong>Monetize</strong> them using <strong>Google Adsense</strong>! Learn AngularJS to build a To Do App from scratch. </p><p>This course contains currently 6 sections and over 70 lectures!</p><p>In the <strong>first section</strong> we will cover basics and fundamentals of AngularJS and start writing some code to get you warmed up. Then in the <strong>second section</strong> we will use Bower to install AngularJS and all necessary libraries for our project. In the <strong>third section</strong> we will start building our To Do web application from scratch and cover every single detail until we are ready to launch. In the <strong>fourth section</strong> we will make our To Do Application beautiful by adding font, background, logo etc. In the <strong>fifth section </strong>we will integrate Google Analytics and Google Adsense. We will test in real time using Google Analytics Reporting Dashboard. In the <strong>sixth section</strong> we will use Grunt, the JavaScript Task Runner, to run amazing plugins which will help us to polish our project in every detail!</p><p>Once we are through, it will be up to you to provide us with ideas and feedback on how to grow our content. For us it is important that our students get the best out of this course!</p><p>Features covered in AngularJS:<br></p><ul><li>AngularJS Modules</li><li>AngularJS Directives</li><li>AngularJS Controllers</li><li>AngularJS Routing</li><li>AngularJS Local Storage</li><li>AngularJS Factory</li><li>and many more!</li></ul><p>Learn to install and use:</p><ul><li>NPM to install Bower and Grunt</li><li>Bower to install AngularJS and web components</li><li>Grunt to set up tasks</li><li>JSHint to identify errors in your code</li><li>minify to minimize your files</li><li>Uglify to make your code difficult to de-compile</li><li>Google Analytics to track visitors</li><li>Google Adsense to monetize visitors</li></ul><p>AND most importantly we are here to support <strong>YOU</strong>! Once you enrolled we will help you by <strong>answering all your questions and supporting you at any point in the course!</strong> Our purpose is to teach <strong>YOU</strong> how to build great apps and we will guide you! </p><p><strong>Don't just watch and learn, also ask and learn.</strong> </p>", 
    "end_date": null, 
    "title": "Build and Monetize Web Apps by Using AngularJS", 
    "price": "20.00", 
    "instructors": "Arman Eker, Hasan Keklik", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/601296_f980_3.jpg", 
    "course_url": "https://www.udemy.com/build-and-monetize-web-apps-by-using-angularjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-03T11:10:15Z"
}