{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Last Course Update: 12/27/2015.  Now using React 0.14.4 (latest) and React Router 1.0.3 :)</strong></p><p>Mastering React can get you a position in web development or help you build that personal project you've been dreaming of. It's a skill that will put you more in demand in the modern web development industry, especially with the release of Flux and ReactNative.<br></p><p>This course will get you up and running quickly, and teach you the core knowledge you need to deeply understand and build React components.</p><p>We'll start by mastering the fundamentals of React, including JSX, “props\", “state\", and eventing. Source code is provided for each lecture, so you will always stay up-to-date with the course pacing. </p><p>If you are new to React, or if you've been working to learn it but sometimes feel like you still don't quite 'get it', this is the React course for you! To learn React you have to understand it.</p><ul><li>Learn how to use React's custom markup language, JSX, to clean up your Javascript code.</li><li>Learn the process of converting JSX to raw Javascript on the fly in your browser.</li><li>Master the process of breaking down a complex component into many smaller, interchangeable components.</li><li>Grasp the difference between “props\" and “state\" and when to use each.</li><li>Learn how to construct your own automated build process using Gulp and Browserify to automatically prepare your React code for deployment.</li><li>Use Bootstrap to get awesome-looking components.</li></ul><p>I've built the course that I would have wanted to take when I was learning React. A course that explains the concepts and how they're implemented in the best order for you to learn and deeply understand them.</p>", 
    "end_date": null, 
    "title": "Build Web Apps with React JS and Flux", 
    "price": "20.00", 
    "instructors": "Stephen Grider", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/435258_8a75_3.jpg", 
    "course_url": "https://www.udemy.com/learn-and-understand-reactjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-28T22:57:07Z"
}