{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>ReactJS is the powerful JavaScript library created by Facebook to handle user interfaces for web applications. It allows developers to handle the major challenges faced while building user interface for dynamic web applications. It is one of the hottest technology on the block and is essential for any web developer. The react handles only the view of the MVC pattern and can be used together with other back end frameworks such as Angular and Node. You can also use React addons to build non UI parts in react. This technology has been widely used across industry and sites like AirBnB, Imgur and Feedly are actively using it. </p><p>You will learn the following along with course:</p><p><strong>Concepts of front end UI development with ReactJS</strong></p><p><strong>View rendering process and application techniques</strong></p><p><strong>JSX syntax</strong></p><p><strong>JavaScript Concepts</strong></p><p><strong>Virtual DOM</strong></p><p><strong>Application component reusability</strong></p><p><strong>UI Design Concepts</strong></p><p><strong>Use React with backend technologies like NodeJS and ExpressJS</strong></p><p>The course is our attempt to bring together a complete , professional and practical course for any developer who wants to build web apps using ReactJS. Get started and be the ReactJS guru.</p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Build Apps with ReactJS: The Complete Course", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645714_ee8d.jpg", 
    "course_url": "https://www.udemy.com/build-apps-with-reactjs-the-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T11:20:15Z"
}