{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<ul><li> Watch the promo video to see How You Build Your Own Website in only 30 minutes</li><li>Join Over 5,000+ Students Who Have Enrolled In My Udemy Courses!</li><li>Many Five Star Reviews Shows that Students Who Enrolling Are Getting Real Results!</li><li>You receive Lectures and 30 minutes of HD Video Content</li></ul><p>__________________________________________________________________________</p><ul><li>Are You Looking To Build A Professional Looking Website?</li><li>Want To Skip The Enormous Amount of Time it takes Learning How To Code?</li><li>Then This Course if For you!</li></ul><p>__________________________________________________________________________</p>Welcome To Learn How To Build An Website in 30 minutes<p>__________________________________________________________________________</p><p>In this course you will learn how to build your very own professional looking website using Wordpress. Wordpress is \"a free and open source content management system (CSM) based on PHP and MySQL. Wordpress is used by more than 23.3% of the top 10 million websites as of January, 2015\" -Wikipedia</p><p>We show you step by step how you can simply and easily build your very own professional website. We start by setting up our website with A Small Orange. We then move into the installation process and getting comfortable setting up pages in wordpress. We then teach you all of the necessities to building your professional website</p><p>Here is What You Will Learn Throughout Our Entire Course:</p><ul><li>Setting Up Wordpress</li><li>A Complete Guide To Using The Basics of Wordpress and Beyond</li><li>We Then Create A Website Right Before your Eyes</li><li>So Much More!</li></ul><p>__________________________________________________________________________</p><p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards Building your own professional website using Wordpress</p><p>In addition to the Udemy 30-day money back guarantee, you have my personal guarantee that you will love what you learn in this course.</p><p>__________________________________________________________________________</p><p><em>What I can't do in this Course..</em></p><p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em></p><p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p><p><em>__________________________________________________________________________</em></p><p>It's time to take action!</p><p>Click the \"take this course\" button at the top right now!</p><p>See you in the course!</p><p>Sincerely,</p><p>Justin Nifong</p>", 
    "end_date": null, 
    "title": "Build a Website in 30 Minutes", 
    "price": "20.00", 
    "instructors": "Justin Nifong", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642696_d1fc_4.jpg", 
    "course_url": "https://www.udemy.com/30-minute-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T18:40:14Z"
}