{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>   This course is designed to educate and transform you into a\nfast and flexible freelance web developer. </strong><strong>When it comes to freelance web development time is\neverything</strong>. The faster you finish\nyour project, the faster you can work on different projects, thus enabling you\nto make more profit. You will work on the real world project that will greatly help\nyou on your future projects and career. <br>    You will work\nwith <strong>HTML</strong>, <strong>CSS</strong>, and Bootstrap framework. Also learn about FTP, website hosting\nand domain. When it comes to developing websites it is absolutely crucial to know\nthese above mentioned skills.<br>   You will see how easy\nit is to program in HTML and style the website with CSS.<br><strong>   Bootstrap</strong> is\nclearly the world's most admired mobile ready web development framework for\nHTML, CSS and JavaScript. It is free and open-source.  This is what makes it possible for developers\nto build websites that are modern and user friendly in a very short period of\ntime. With dynamic website functionalities.<br>   Bootstrap\nis important to learn due to the advancements of mobile technology. Mobile friendly\nwebsites are a must in today’s society.  <br>   Course\nvideo material covers building navigation menu, the featured website\nlayout, image carousel, gallery that can also function as your portfolio using\nthe tab system. You will build php contact form, collapsible menu, work\nwith ftp, hosting website for free and getting a domain.<br>   While it\nis possible to finish this course in 1 hour and 30 minutes, you can follow the\nlectures on your own phase. Course is structured in an easy to follow manner.<br><strong>Why should you take this course?   <br></strong>   To learn something new\nor improve your skills and reduce the time you spend coding the\nwebsites. After completing this course you will code websites in less than 1\nhour.<br><strong><br></strong></p><p><strong>/*********************************Course Materials********************************/</strong></p><p>Course downloadable files are <strong>attached on introduction video</strong>, while playing introduction click <strong>view resources and download the files</strong>. </p><p><br></p>", 
    "end_date": null, 
    "title": "Build Modern Websites Super Fast", 
    "price": "20.00", 
    "instructors": "Akaki Matcharadze", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780058_dffa_3.jpg", 
    "course_url": "https://www.udemy.com/build-modern-websites-in-1-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T15:23:17Z"
}