{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Hello there! Are you entrepreneurial and yearning to build the next big thing without a developer? Have an idea in your back pocket that you want the world to see? Maybe you don't like current solutions and want to build one on your own but without coding? That's what this course is for - you'll be able to develop your startup through harnessing the power of Bubble and exploring numerous apps that we'll make together. (plus more apps will be made every month!)</p><p><strong class=\"redactor-inline-converted\">What is this course?</strong> If you've ever had a SaaS startup idea of your own that you really wanted to execute but didn't have a developer by your side, then this course enables you to realize how to build it from design to shipment without writing a single line of code.</p>\n\n<p><strong class=\"redactor-inline-converted\">Who's teaching it?</strong> Good question. I've been involved with startups since I was 16. After founding, funding and exiting my own local commerce startup, I learned a thing or two. Currently, as a user experience lead at a well-funded startup and a passionate instructor, I'm helping people build their ideas themselves. </p>\n\n<p><strong class=\"redactor-inline-converted\">Why would I take it?</strong> There is nothing like the feeling that you can build anything. When I started learning web development, I felt overwhelmed by all that I had to learn though I still wanted to. If you're ever felt that way or don't have too much time to invest in learning, then this course will convince you that is very possible to take your ideas and make them into realities.<br></p>\n\n<p><strong class=\"redactor-inline-converted\">What will I do?</strong> Once I get you caught up with a platform called Bubble, I'll show you how you can not only design, but structure, architect and execute your startup ideas. Who knows? You could someday be a millionaire, all because you said <em>yes</em> to learning how to develop your startup without any coding. </p>\n\n<p><strong class=\"redactor-inline-converted\">How much time? </strong>Not much at all. The platform you'll be using makes it easy not only for me to explain to you what things to consider when developing a startup, but also for you to pick things up and get going entirely on your own.<br></p>\n\n<p>What are you waiting for? Starting learning how to build your startup without any coding and tons of more apps with free lifetime updates! Looking forward to seeing you.</p><p>Cheers.</p>", 
    "end_date": null, 
    "title": "Build Your Startup with No Coding (Design, Develop & Ship)", 
    "price": "50.00", 
    "instructors": "Salar Ali", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/862478_cde3_3.jpg", 
    "course_url": "https://www.udemy.com/buildastartup/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-28T21:31:58Z"
}