{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Focus on creating unique and engaging apps on web. <a href=\"https://parse.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Parse SDK</a> takes care of everything else your app needs, from the core of your app to analytics.</strong>  </p>  <p>  \t   The highest degree of learning takes place with your involvement. And  this course is designed to do exactly that. This course introduces you  to the basics of Parse SDK for Javascript. You will need some Web Development knowledge to get started with this course.  </p>  <p>  \t   You&#039;ll be working on the source code along with us, so that you could  get a good grasp on the concepts you will eventually be introduced to.  At the end of this course you&#039;ll be able to <em style=\"\">write</em> and <em style=\"\">deploy</em> AWESOME app using Parse SDK.  </p>  <p>  \t   How is this course designed?  </p>  <ul style=\"\">  \t<li><em style=\"\">Comprehensive</em> - Contains lessons and exercises that enable you to develop real-world web applications using Parse SDK.</li>  \t<li><em style=\"\">Simple &amp; Sequential</em> - To keep complexity at bay, the  course introduces you to independent concepts initially and then reveals  more of the complex stuff.</li>  \t<li><em style=\"\">Hands-on Sessions</em><em style=\"\"> -</em> I guide you through sessions building apps and writing code snippets clearly explaining every line of code.</li>  \t<li><em style=\"\">Elaborate Videos -</em> Learn Parse SDK concepts in a thorough manner, we have made sure that all WHYs and HOWs you need to know are covered.</li>  </ul>  <p>  \t   Welcome to the course <strong style=\"\">&quot;Building Websites Using Parse SDK&quot;</strong>  </p>", 
    "end_date": null, 
    "title": "Building Websites Using Parse SDK", 
    "price": "20.00", 
    "instructors": "QScutter Tutorials", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/180478_9797_2.jpg", 
    "course_url": "https://www.udemy.com/building-websites-using-parse-sdk/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-11T18:05:07Z"
}