{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em><strong>*** The #1 HTML5 and CSS3 course in the official Udemy rankings! ***</strong></em></strong></p>\n\n<p><strong><em><strong>*** Course completely up-to-date for May 2016 ***</strong></em></strong><br></p>\n\n\n\n\n\n<p><em>\"Having gone through other related courses on other platforms, I can say this course is the most practical and readily applicable course on web design and development I have taken. Thanks so much for this course.\" —</em> Bernie Pacis<br></p>\n\n\n\n\n\n<p>Are you looking for the easiest and fastest way to learn how to build your own beautiful websites with HTML5 and CSS3? And how to even make them responsive?</p>\n\n\n\n\n\n<p>Have you taken other HTML and CSS courses, but still wonder how to code a real world website? Then this is exactly the course you are looking for!</p>\n\n\n\n\n\n<p>With the right guidance, HTML, CSS and responsive web design are super easy. Everyone can learn it!</p>\n\n\n\n\n\n<p><strong>That's why I created this course for you: I will teach you step-by-step how to both design and code your own websites using the latest web technologies HTML5, CSS3 and even some jQuery.</strong></p>\n\n\n\n\n\n<p><strong>So why is this course so unique and popular? This course is completely project-based! Together we will build a beautiful and responsive landing page for a fictional company that I made up just for this course. This huge project will teach you all the real-world web design and development skills to build real-world websites.</strong></p>\n\n\n\n\n\n<p>But there is even more! In this course, you will not just learn how to code, but the entire process of building and launching a website. This includes planing, designing, coding, optimizing, and so much more.</p>\n\n\n\n\n\n<p>At the end of the course, you will have a complete, ready-to-launch website that looks great on any computer, tablet and smartphone. You get the entire code and all the images and graphical assets that I designed especially for the course as a free download.<br></p>\n\n\n\n\n\n<p><em><strong>Reviews</strong></em></p>\n\n\n\n\n\n<p><em>\"Most up-to-date design/developer course on Udemy!\" +++ <em>\"Learnt more in my week of doing this course than in an entire year of studying\" +++ </em> \"I have been doing website development for more than twenty years and I still learned from this course\" +++ \"I'm sure that I will be able to build even very complex websites now\" +++ \"Very detailed - shows you the how and why it works\" +++ \"I have learned so freaking much! I love the emphasis he puts on design\" +++ \"Jonas your support and help is second to none\" +++ “The instructor is clear, knowledgeable, and very responsive to questions\" +++ \"Money well spent. The final project looks stunning and the resources Jonas gives are like gold\" +++ \"Newbie to Pro all in one course!\" +++ \"This has been the best course I have EVER purchased on Udemy\" +++ \"I had a great time learning\" +++ \"This course deserve 100 stars! Thank you Jonas!\"</em></p>\n\n\n\n\n\n<p><strong><em>This is what you will learn:</em></strong></p>\n\n\n\n\n\n<p>• Easy-to-follow and hands-on web development with HTML5, CSS3 and some jQuery. </p>\n\n\n\n\n\n<p>• The proven 7 real-world steps from complete scratch to a fully functional and optimized website.</p>\n\n\n\n\n\n<p>• Simple-to-use web design guidelines and tips to make your website stand out from the crowd.</p>\n\n\n\n\n\n<p>• How to get and use amazing images, fonts and icons to make your website shine — all for free.</p>\n\n\n\n\n\n<p>• Responsive web design: learn how to create websites that work beautifully on all screen sizes — a must-have skill in today's mobile world.</p>\n\n\n\n\n\n<p>• How to use jQuery for super cool effects like animations, scroll effects and \"sticky\" navigation.</p>\n\n\n\n\n\n<p>• How to optimize your website for good speed performance and for search engines (SEO).<br></p>\n\n\n\n\n\n<p>• How to launch your website for the world to see it.</p>\n\n\n\n\n\n<p><strong>At the end of the course, you will have such a deep understanding of how HTML5 and CSS3 work together, that you will be able to build any website you can imagine from complete scratch.</strong></p>\n\n\n\n\n\n<p>So, who is this course for? This course is perfect for complete beginners: there is absolutely no coding experience required. This course is also perfect for you if you know some HTML and CSS, but struggle to put together a good-looking website. Or maybe you're a web designer and want to expand your skill set into HTML5 and CSS3? This course is perfect for you, too!</p>\n\n\n\n\n\n<p><strong><em>If you enrol in this course right now, you get:</em></strong></p>\n\n\n\n\n\n<p>• Lifetime access to my HD quality training videos with free updates. No monthly subscription. Learn at your own pace, whenever you want.</p>\n\n\n\n\n\n<p>• All lectures are downloadable to make your learning experience even better.<br></p>\n\n\n\n\n\n<p>• Downloadable code and design assets for the entire project. You can keep this code as a starting point for your own projects!<br></p>\n\n\n\n\n\n<p>• Access to a very active community where I will personally answer all your questions. I will never leave you hanging!</p>\n\n\n\n\n\n<p>• Free access to my e-book \"Best Resources for Web Design and Development with HTML5 &amp; CSS3\".</p>\n\n\n\n\n\n<p><strong>Sounds great? Then start learning today by clicking the “Take This Course\" button right now, and join me in the only HTML and CSS course that you will ever need!</strong><br></p>\n\n\n\n\n\n<p>Don't forget: if you don't get value from this course, you get 100% of your money back within 30 days. There is absolutely no risk for you.</p>\n\n\n\n\n\n<p>See you in the course!</p>", 
    "end_date": null, 
    "title": "Build Responsive Real World Websites with HTML5 and CSS3", 
    "price": "35.00", 
    "instructors": "Jonas Schmedtmann", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437398_46c3_7.jpg", 
    "course_url": "https://www.udemy.com/design-and-develop-a-killer-website-with-html5-and-css3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T10:16:03Z"
}