{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t                   Take this course and start building websites and blogs, using absolutely no coding skills. You no longer need to rely on expensive website developers. You can now do it all your self.</p><p style=\"\">Instructions are communicated in a simple and proven method.</p><p style=\"\"><strong style=\"\"><em style=\"\">Learn this essential skill for only $1.</em></strong></p><p style=\"\"><strong style=\"\"><em style=\"\"></em></strong>Don&#039;t waste your time learning how to code. <strong style=\"\">Some of my students have been able to publish their website live on the internet in as little as 45 minutes after taking this course (with no prior experience in website development).</strong><br style=\"\"></p>  <p style=\"\">There&#039;s over 109 minutes of essential content in this course, as well as insider tips and tricks from my own experience which spans back over many years.<br style=\"\"></p>  <p style=\"\">You will be able to edit your website at anytime you like, for free, and in a couple of minutes. You can also make money out of your website through Advertising. <br style=\"\"></p>  <p style=\"\">  \t <strong style=\"\">            So what are you waiting for? Take this course and see for yourself.</strong> There is no need to spend excessive amounts of time and money on making websites and blogs. Take this $1 course and do it all your self.</p>  <p style=\"\">  \t                             Please leave your feedback on this course and let me know how you went :)  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">Hamza Muhammad has experience building websites for individuals and private organisations using simple and cost effective methods. Hamza brings together all of his past experience in this course to make sure you succeed in making a website or blog using minimal time and resources</em></strong>  </p>", 
    "end_date": null, 
    "title": "Build expert websites and blogs in 45 minutes ", 
    "price": "20.00", 
    "instructors": "Hamza Muhammad", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354240_2a37_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-free-website-with-no-coding-save-1000s/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T04:37:28Z"
}