{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t <span>Building web applications that can manage huge chunks of data consistently is becoming increasingly difficult and this affects the efficiency of your app. Single Page Applications (SPA) solve this issue as its design principles make life easy for data-intensive applications by updating the constant stream of data in the same page, making the application more intuitive for the user.</span>  </p>  <p>  \t Doing this with pure JavaScript is hard. To help with the implementation of single-page applications, Google developed a framework called AngularJS that allows you to build well-structured, easily testable, and maintainable frontend Single Page Applications.  </p>  <p>  \t This course will take you from the very basics of developing rich client-side Single Page Applications (SPA) through a series of practical examples of incremental complexity, including a full review of AngularJS’ built-in features and testability features.  </p>  <p>  \t At the beginning of the course, you will be introduced to the advantages and limitations of AngularJS and its compatibility with SPAs. As we move on, we&#039;ll dive head-first into the application coding, starting from your first application and going all the way from building a to-do list app to a fully featured movie database, understanding every key aspect of the framework in the process. Later on, we&#039;ll focus on reviewing AngularJS&#039; built-in components (directives, filters, and services) including every detail of how to write your own custom components of every kind. And finally, we&#039;ll wrap up with automated testing clearly guiding you on how to write and execute automated tests on AngularJS and introducing best practices on both unit and end-to-end testing.  </p>  <p>  \t Building Single Page Web Apps with AngularJS will take you from zero to hero, covering all important aspects of the framework and preparing you to hit the ground running on any single page application.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<span><strong style=\"\">Raoni Boaventura</strong> is a frontend engineer who has been working with JavaScript and JavaScript frameworks from the very beginning of his career, about 8 years ago. He has a strong academic background, a Computer Science degree, and has worked for several companies and clients around the world, completing a large number of front¬end and full-stack projects. Raoni started working with AngularJS about two years ago, and immediately fell in love with it. Since that time, he not only has been involved with multiple Angular projects with multi-national clients, but has also been an active peer in the AngularJS community, having published key articles and tutorials about the framework.</span>  </p>", 
    "end_date": null, 
    "title": "Building Single Page Web Apps with AngularJS", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425802_0467_2.jpg", 
    "course_url": "https://www.udemy.com/building-single-page-web-apps-with-angularjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T09:57:02Z"
}