{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t This tutorial will show you how to harness the power of the Twitter Bootstrap framework to create a custom responsive website for a fictional client. You will learn how to manage every aspect of building a responsive website from the initial download all the way through the process until you have a finished functioning website.<br style=\"\">  \t <br style=\"\">  \t    This tutorial will show you how to tame the Twitter Bootstrap framework! We will start from the first download and progress until we have a website ready to be published!<br style=\"\">  \t <br style=\"\">  \t    Learning to layout a unique website that will appeal to visitors can be a daunting task. In this course, we will use the Twitter Bootstrap framework to easily create a custom layout that looks great on any device. Using Bootstrap&#039;s unique features, you will learn just how easy it is to create your own site!<br style=\"\">  \t <br style=\"\">  \t    Through <em style=\"\">Building a Responsive Website with Bootstrap</em>, you will gain the knowledge and experience to create your website.<strong style=\"\"></strong>  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<span><strong style=\"\">Brock Nunn </strong>is a frontend web developer from Tulsa, Oklahoma. Brock works full time as a graphic designer at Rovi Corporation. Over the past six years, Brock has taken part in web projects big and small. Self taught, Brock has a passion for teaching others with a simple and personal approach. Brock married his wife in June of 2009. When he is not neck deep in code, Brock enjoys making great food for his family, including his puppy Sugar.</span>  </p>", 
    "end_date": null, 
    "title": "Building a Responsive Website with Bootstrap", 
    "price": "20.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/336384_27c9_2.jpg", 
    "course_url": "https://www.udemy.com/building-a-responsive-website-with-bootstrap/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T09:14:52Z"
}