{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tVaadin is a Java framework designed to build modern web applications that look great, perform well, and make you and your users happy. The programming model in Vaadin is similar to those you might have worked with before, with a focus on your productivity. Thanks to Vaadin, the process of creating a fully-featured application from scratch is simple.<br style=\"\">  \tThis tutorial develops a powerful application from scratch by adding features in small increments, with a rapid feedback cycle, until a complete piece of working software is written. You will get started with a simple “hello world” application generated by a Vaadin plugin to Eclipse. When you know your requirements, you will go on to organise the contents of your software with views and connect navigation to them. The next step is connecting data from a SQL database, followed by improving the look-and-feel of the application. You then learn how to store user information in session data and improve responsiveness by using background threads. Lastly, you will take a look at extending the framework with your own components and add-ons from the commercial Vaadin offering. <br style=\"\">  \tAll in all, the journey from &quot;hello world&quot; to working software should give you a glimpse of how easy it is to develop an outstanding web application with Vaadin.  </p>", 
    "end_date": null, 
    "title": "Building a Rich Internet Application with Vaadin", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400112_cff3_2.jpg", 
    "course_url": "https://www.udemy.com/building-a-rich-internet-application-with-vaadin/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T13:43:29Z"
}