{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>  CREATE LANDING PAGES TO PROMOTE YOUR UDEMY COURSES OR PRODUCTS JUST BY DRAGGING AND DROPPING!</strong>  </p>  <p>  \t  ---------------------------------------------------------------------<br>  \t<strong></strong>  </p>  <p>  \t<em>FINALLY, THE SECRET OF CREATING CLEAN AND RESPONSIVE LANDING PAGES HAS BEEN EXPOSED. NO CODING. JUST DRAG AND DROP AND YOU&#039;RE DONE!</em>  </p>  <p>  \t      The quality of your landing page can make or break your business. That&#039;s why it&#039;s important to use the K.I.S.S (keep it simple silly) principle. A great product with a horrible looking landing page will result in very few sales.  </p>  <p>  \t      If you&#039;re created a product and want to get your visitors attention, then you need to create a landing page that attracts people. Once you&#039;ve done that, you&#039;ve already won half of the battle.  </p>  <p>  \t      THE PROBLEM  </p>  <p>  \t      Your product alone will not always make people buy it. Why? Because before someone buys your product(s) you must first convince them that you have a solution to their problem. Failure to do this, will result in very few or no sales.  </p>  <p>  \t      There are three important ingredient that EVERY landing page needs to have:  </p>  <p>  \t<strong>1. Clean / Responsive Design</strong>  </p>  <p>  \t      Since you have less than 30 seconds to win or loose visitors, you need to make sure that your landing page looks professional. There are no shortcuts.  </p>  <p>  \t      Unfortunately, hiring a graphic and web designer to create one for you will hundreds of dollars. Most startup entrepreneurs can&#039;t afford to pay $300+ for a landing page.  </p>  <p>  \t<strong>2. Clear Message</strong>  </p>  <p>  \t      Once you have a professional design, the next thing you need is to have a clear message about your product or services. Don&#039;t beat around the. Instead, get straight to the point.  </p>  <p>  \t<strong>3. CTA (Call To Action)</strong>  </p>  <p>  \t      Finally, you need to have a call to action that will either get people to buy your product or subscribe to your list. This needs to be visible and above the fold.  </p>  <p>  \t<strong>  THE SOLUTION  </strong>  </p>  <p>  \t      This course is exactly what you have been praying for you. If you have a product or service and you&#039;re convinced that there&#039;s a market for it, I&#039;m going to show you how to create a landing page that will move people to perform whatever action that you desire.  </p>  <p>  \t      Most companies will charge you a monthly fee to create landing pages...but this. I will walk you through step by step on how to<strong> save thousands of dollars by creating it YOURSELF...and WITHOUT writing a single line of code.  </strong>  </p>  <p>  \t<strong>Unlimited Variations</strong>  </p>  <p>  \tThis course teaches you how to create 9 different design variation. However, you can create unlimited variations with a combination of video, text, links, images, etc.<br>  \t<strong></strong>  </p>  <p>  \t<strong>  WHAT&#039;S NEXT?  </strong>  </p>  <p>  \t      You&#039;re only a few seconds away from taking your business to another level. Simple click on the &#039;Take This Course&quot; button at the top right hand side of your screen to get start. It&#039;s that simple.  </p>  <p>  \t      If you are serious about increasing your users retention and conversion rate, then you need to find out the secrets of exactly how to do that!  </p>", 
    "end_date": null, 
    "title": "Build Amazing Landing Pages In Minutes With Joomla NO CODING", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338204_629a_2.jpg", 
    "course_url": "https://www.udemy.com/joomla-drag-drop-build-amazing-landing-pages-in-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T05:08:56Z"
}