{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>There are over 18 million software developers in the world… so why does everyone have a difficult time finding an affordable, capable developer?</p><p>It's simple… most people don't know how to properly hire a remote developer, something that is easy to achieve when you know where and how to look.</p><p>By hiring remote developers, you can instantly lower your operational costs by 50-60% while speeding up project completion times and freeing up your time to focus on building/growing your business.</p><p>I know this first hand from having spent the past 15 years as a developer coding countless websites and managing all types of programmers both in person and remotely. Most importantly, I'm a big believer in the power of a remote workforce; I think it's a huge equalizer that can give regular businesses the power to really compete with the big guys, while spreading around great job opportunities. </p><p>Through my experience, I've learned exactly what to look for in a remote developer, how to screen and interview candidates, how to write an effective job post and most importantly, how to get the right people working on my projects for the right price.</p><p>This course was created to you teach step-by-step everything you need to do in order to hire a high-quality, low cost remote developer within a few days or less. </p><p>More specifically, I'm going to teach you how to:</p><ol><li>Write an effective job description </li><li>Have developers reaching out to you to work on your projects</li><li>Filter out the bad applications, and choose a handful of good candidates quickly</li><li>The difference between passive and active hiring</li><li>What to look for in a remote developer (that most people don't know)</li><li>A trick for your job description that'll help you pre-screen applications quickly</li><li>How to weed out bad candidates, and target in on good talent</li></ol><p>Additional, I'm going to give you:</p><ul><li>Reference slides on different types of developers you might hire</li><li>A pre-written job post template, with placeholders you can tailor to your specific project needs</li><li>Sample variations on this template for different types of developer jobs</li><li>A list of sample screening questions </li><li>Cheat sheets for all the important parts of this course, for easy reference</li></ul><p>AND you'll have access to all the information in this course for life in addition to the extra material that will be released to the course members over the coming months.</p><p>The sooner you try this approach, the sooner I guarantee you'll stop wasting time, effort, energy and money and instead, you'll start achieving your goals and living your dreams.</p><p>REMINDER: This is a risk free purchase with Udemy's 30 day money back guarantee. Just imagine what your business would be like if within 30 days if you had access to the developer of your dreams with a few simple clicks.</p><p>Best,</p><p>Mike Cavaliere</p><p>P.S. Due to the recent launch of this course, the course is currently priced at a discount. I plan to increase the price in the near future so sign up at the current price while you can!</p>", 
    "end_date": null, 
    "title": "Build Websites And Apps By Outsourcing", 
    "price": "20.00", 
    "instructors": "Mike Cavaliere", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545524_4e4d_2.jpg", 
    "course_url": "https://www.udemy.com/outsourcing-development-work/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T14:51:59Z"
}