{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>My story is simple and as you can tell from the promo video, i gave up so many times when i started in web design. I gave up only because i was learning a lot of HTML and CSS but i was creating very poor designs and this was discouraging. The only way i overcame this was when i took a course that taught me how to create a website with HTML5 and CSS3 and most of what i did was to pause the video and type exactly what the instructor had typed. I barely understood anything but the final look of the site and the pressure i got from friends and relatives wanting me to create websites for them after i had shown them what i had done, forced me to learn without ceasing until i could put everything together to become a good web designer/developer. With that experience, i decided to get you up and running with this course by teaching you only the essential parts of HTML5 and CSS3 needed for what we would be building in this project. </p><p>The things we would learn are in the following order:</p><p>1. After introducing you to the course and giving you a feel of how the glass footer looks like, we would talk about how we can install the necessary text editors.</p><p>2. We would learn to install and use some essential sublime Text plugins that would help us to code faster and easier. </p><p>3. We would learn the basics of HTML5</p><p>4. Also we would learn the basics of CSS3</p><p>5. Next we would learn how to create the basic file structure for creating the glass project. </p><p>6. We would then code the HTML part of the glass footer with the knowledge you have gained from the basics of HTML and we would do same for the CSS3 part of the project too. </p><p>7. We would fix bugs that we encountered and that would mark the end of the glass footer. </p><p>8. In the bonus lecture you would get to know the source of the glass footer and also get my contacts. </p><p>upon completion of this course you would have adequate skills necessary to begin building very nice looking HTML5 and CSS3 websites on your own. </p><p>You would also be able to build the same project for clients and make money. </p><p>It would take you just 2 and half hours to complete the course while having a lifetime access to the course. After the course you would have all the skills necessary to build the nicest glass looking footer ever. Trust me, your clients would really be amazed at how well you are good with your designs and your work. <br></p>", 
    "end_date": null, 
    "title": "Build Your First Glass Web App Theme With HTML5 And CSS3", 
    "price": 0, 
    "instructors": "Hini Majesty", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/730264_5d83_2.jpg", 
    "course_url": "https://www.udemy.com/build-your-first-glass-web-app-theme-with-css3-and-html5/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-16T19:08:53Z"
}