{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  This course is designed for all audiences. Whether you are someone who is just getting into forum building, or a savvy forum developer, the course is for those who want to take forums to the next level.  In this course, we&#039;ll go through everything you need to know, in order to build your forum to greater heights like we have.  </p>  <p>  \t            Whether you’re interested in building 1 successful forum, or a network of successful forums, its&#039; jam packed of forum building techniques for entrepreneurs, developers, forum owners and in between.  </p>  <ul style=\"\">  \t<li>Secrets to building forums</li>  \t<li>Making viral forums</li>  \t<li>Promoting your forum faster than everyone else</li>  \t<li>Saving time building forums</li>  \t<li>Starting a forum from scratch</li>  \t<li>What works and doesn&#039;t works</li>  \t<li>7+ years of experience in making forums big</li>  </ul>  <p>  \t            In the Successful Forums Foundation, you will learn how to make a forum from scratch. You will learn how to decisively make wiser decisions in building your forum, install and start your forum, build and grow your forum the right way, and expand your forum as fast as possible using proven techniques that our network of sites has used over the past 6 years.  </p>  <p>  \t            In particular we will use vBulletin as a forum reference, but if you decide to use a different forum or currently run on a different forum platform, the same concepts will apply.  </p>  <p>  \t            By the completion of this online training course, you will be fully versed, and capable of growing a successful forum(s).  </p>  <p>  \t            Learn how to make a forum and earn passive income stream from now!  </p>  <p>  \t            Please contact me if you have any questions, or comments while taking this course.  </p>  <p>  \t            You can reach me at daveaite@gmail.com or comment in our forums.  </p>", 
    "end_date": null, 
    "title": "Build a Successful Forum from Scratch", 
    "price": "50.00", 
    "instructors": "David Ahmad", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33574_1808_11.jpg", 
    "course_url": "https://www.udemy.com/building-successful-forums/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-25T16:59:45Z"
}