{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t   “So freaking awesome. Amazing job man. This is better than codeacademy!&quot; - Josh Hagler, Founder of RoomScapeU.com  </p>  <p>  \t  ----------------  </p>  <p>  \tQUITE POSSIBLY THE FASTEST WAY TO LEARN HOW TO BUILD PROFESSIONAL QUALITY WEBSITES FOR BEGINNERS, NON-PROGRAMMERS AND ENTREPRENEURS  </p>  <p>  \t               So you want to learn how to build websites but you&#039;re not quite sure how.  </p>  <p>  \t               Welllllll, you could do like me and spend months learning every knook and cranny of HTML and CSS before you even put up your first webpage. This could lead to frustration, feelings of being overwhelmed and highly increases the chances that you&#039;ll give up without a site to show for it.  </p>  <p>  \t               OR….. YOU COULD START LEARNING BY DOING AND HAVE YOUR FIRST WEBSITE UP THIS WEEK.  </p>  <p>  \t               If you want to learn something fast you need to jump in and start getting your hands dirty from the beginning.  Have you ever noticed that you don&#039;t really learn something until you actually try to do it, and experience it firsthand?  Well that&#039;s exactly what we&#039;ll do in this course. You&#039;ll learn by building your first website this week.  </p>  <p>  \t           And don&#039;t worry if HTML and CSS or websites in general intimidate you.  Learning to build websites is actually a lot easier than you think...if you are taught correctly. And I&#039;ll be here with you the whole time.  I personally respond to and answer all questions you and other students have.  </p>  <p>  \t           Through project-based learning and leveraging powerful, free tools that exist online, I will teach you what you need to know in order to create rock star sites fast and not get frustrated trying to learn HTML and CSS FOR-EV-ERRRRR (insert Sandlot voice here) without having a site up to show for it.  </p>  <p>  \t               The simple truth is that most courses and instructors out there try to teach you too much too early, don&#039;t teach things in the right order, or sometimes it even seems like they purposefully make the material too hard.  </p>  <p>  \t               With this course I PROMISE YOU that you will learn to build websites and put them online in less than 10 hours of work total.  </p>  <p>  \t <strong style=\"\">    Just look at what students are saying:</strong>  </p>  <p>  \t   &quot;First 7 lessons done and I can actually build something and understand it! First million I make will because you came at the right time! Timing couldn&#039;t of been better.&quot; - Tony Berardi  </p>  <p>  \t   &quot;I managed to build a single page web for one of my clients and got some $ out of it from what I learned in this course.&quot; --Jay Mayu  </p>  <p>  \t           &quot;The course was a great way to learn how to code in HTML and CSS fast and efficiently. I really enjoyed how helpful the instructors were.&quot; - Jonathan Barra  </p>  <p>  \t           &quot;I thought the course was very refreshing, fast paced and exciting. I really enjoyed the hands on aspect of the course where you can change something then and there and you can see the results instantly.&quot; -Jimmy Smith  </p>  <p>  \t           “I&#039;ve seen (almost) all the videos on Bootstrap 2 and 3 which are available on YouTube and I can guarantee that the ones you posted are among the best. I am very grateful for your &quot;little big things&quot; that you&#039;ve taught me.&quot; - Rac Santos  </p>  <p>  \t <strong style=\"\">    What you will learn</strong>  </p>  <p>  \t               - CORE FUNDAMENTALS: I&#039;ll teach you how to use a text-editor and the fundamentals of HTML and CSS so that you can put up any site you want and be ready to experiment with the most-advanced concepts.  </p>  <p>  \t               - RAPID DEVELOPMENT: By learning to use powerful frameworks and tools such as Bootstrap, Font-Awesome, Google Forms and more, you&#039;ll be able to put up sexy, startup quality sites fast  </p>  <p>  \t               - HTML5 &amp; CSS3 to make your site look fresh and new. You&#039;ll learn the rules and practices of the newest languages. No outdated teachings or 1990s looking sites here!  </p>  <p>  \t               - RESPONSIVE DESIGN: Designing for web is no longer for just your computer or laptop. We&#039;ll teach you responsive design so your site looks great on all devices.  </p>  <p>  \t               - NO STAKES PRACTICING: how to use browser tools to play around and see live changes on sites so that you can learn faster and explore the HTML and CSS of the best looking websites  </p>  <p>  \t               - BEAUTIFUL VISUALS: You&#039;ll learn how to include professional style graphics and icons in your site for free  </p>  <p>  \t               - ALL TYPES OF CSS AND HTML YOU WILL USE WHEN BUILDING SITES - links, lists, layouts, images, and many others  </p>  <p>  \t <strong style=\"\">    And I won&#039;t stop where most other courses stop.  I&#039;ll teach you how to quickly get your site live online and for free</strong>  </p>  <p>  \t               - FREE HOSTING: how to save over $100 a year in hosting fees  </p>  <p>  \t               - INSTANT DEPLOYMENT: how to host your site live online QUICKLY  </p>  <p>  \t <strong style=\"\">When you&#039;re done with this course</strong>...  </p>  <p>  \t           HTML and CSS will no longer be a foreign language to you.  Instead you will already have built your first site and have the skills to build many others.  You&#039;ll be a part of the 1% of people that actually know how to build things online and have a life-changing new skill set - the power to code and create.  </p>  <p>  \t           With your new found knowledge of HTML and CSS you&#039;ll be able to separate yourself from others in a job search, follow your passion, explore a new career path, the possibilities are endless.  </p>  <p>  \t <strong style=\"\">So why not sign up today?</strong>  Why not start investing in your future today?  Click the button to start learning now.  </p>", 
    "end_date": null, 
    "title": "Build Your First Website in 1 Week with HTML5 and CSS3", 
    "price": 0, 
    "instructors": "Ryan Bonhardt", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/173548_c3e1_2.jpg", 
    "course_url": "https://www.udemy.com/build-your-first-website-in-1-week/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-26T23:57:27Z"
}