{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>A social networking website (also social networking service or SNS) is a platform where the people can get in contact with others who share similar interests, activities, backgrounds or real-life connections. A social networking service consists of a user individual profile, his or her social links, and a variety of additional services.</p><p>Creating a Social networking website would be harder task, but nowadays it does not require some coding languages, and you can Build your own Social networking platform by using some methods and techniques. So in this course you will be learning to exactly build a professional social networking website and you would be proud off.</p><p><strong>The Functions we will be including in our Social Networking Website will be:</strong></p><ul><li>Private Chat</li><li>Private Mail</li><li>Friend Request</li><li>Public chat (all members on one platform)</li><li>Photos (like, comment, rate)</li><li>Videos (like, comment, rate)</li><li>Forum (Sections &gt; Topic &gt; Reply)</li><li>Groups (invite, block, flag)</li><li>Blog (create, publish, draft, rate, comment)</li></ul><p>So If you are interested in this Social networking course, then Just click \"<strong>Take This Course</strong>\" Button and I will see you inside this course.</p><p><strong><em>NOTE: If you are not happy with the course then you can also get your money back as well!</em></strong><br></p>", 
    "end_date": null, 
    "title": "Build Social Networking website from Scratch", 
    "price": "20.00", 
    "instructors": "Tanzeel Ur Rehman", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551038_1b4b_4.jpg", 
    "course_url": "https://www.udemy.com/social-networking-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T13:41:30Z"
}