{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>==========================================================================</p>\n\n<p><strong>Chart JS the missing manual!</strong></p>\n\n<p>==========================================================================</p>\n\n<p>How would you feel if you could make wonderful charts and data visuals on the fly? Many people would love to create charts for the web. </p>\n\n<p><strong>So what is stopping you? </strong></p>\n\n<p>Learning how to code a chart is very challenging! It takes an expert to make it understandable. Perhaps you are now using Excel but see the potential online, but how can you learn it? </p>\n\n<p>Did you tried all those other documentations about ChartJS? They are too complicated! </p>\n\n<p>When I started out to learn this I was struggling! I know how to make a chart in seconds for Excel but for the web. It just did not work. But I know I needed to learn this because more people read a web page than an Excel sheet. Switched and struggled but eventually made it! </p>\n\n<p><strong>No more! </strong></p>\n\n<p>Eventually, I though this documentation is useless for people who are not know in the field of coding. So this is the reason i created a huge video course about ChartJS and I considered it \"the missing manual\"! </p>\n\n<p><strong>Why? </strong></p>\n\n<p>Well ChartJS does not offer any kind of guidance and support. This course does and I truly wished I had this \"missing manual\" before I started out on ChartJS because it would save me a ton of time. </p>\n\n<p>==========================================================================</p>\n\n<p><strong>What can you expect from this course?</strong></p>\n\n<p>==========================================================================</p>\n\n<p>This course is designed for you if you are planning to make web charts with Chart JS. Big data is heading our way fast! People want to read the data but they do not have the time to read large columns of data. It must be visual. This is the reason why data visualization is a big booming business for the coming future. </p><p>With Chart JS you can create many difference charts and they are highly visual, easy to understand and look stylish. The main reason why you should use Chart JS is because you are planning to create a basic chart with limited interaction and features. </p>\n\n<p><strong>In this course you learn how to create many different charts: </strong></p>\n\n<ol><li>Line chart with Chart JS</li><li>Bar chart with Chart JS</li><li>Stacked bar chart with Chart JS</li><li>Horizontal bar chart with Chart JS</li><li>Radar chart with Chart JS</li><li>Polar chart with Chart JS</li><li>Pie chart with Chart JS</li><li>Doughnut chart with Chart JS</li></ol>\n\n<p>You will learn how to make each of these charts and I will be updating these sections every once and a while. ChartJS is developing quickly with many new features and charts. This course will be your absolute reference course for making every possible chart with ChartJS. <br></p><p>==========================================================================</p>\n\n<p><strong>3 Reason why you will love this course!</strong></p>\n\n<p>==========================================================================</p>\n\n<ol><li>You will truly learn how to make a chart for the web in a easy step to step follow guide. It is in bite size steps which makes it easy to follow even if you are completely new to HTML, CSS and JavaScript. </li><li>This course will always be updated with the latest ChartJS development, there are far more charts than those. </li><li>This course will be you absolute reference sheet for ChartJS. It covers the most important aspects of Chart JS library and makes sure you are ready to start using it to build chart. </li></ol><p><br></p><p>==========================================================================</p>\n\n<p><strong>The main objective of this course</strong></p>\n\n<p>==========================================================================</p><p>Make Chart JS accessable for everyone who wants to learn it. At the end of this course you MUST and WILL be confident that you can create any chart with Chart JS with ease. <br></p><p><br></p><p>It is time to dive in! Start and create your charts for the web! Join this course and make the web a more chart friendly place!</p>", 
    "end_date": null, 
    "title": "Chart JS, the complete guide. ChartJS missing manual.", 
    "price": 0, 
    "instructors": "Nicky Wong", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519596_bd8c_2.jpg", 
    "course_url": "https://www.udemy.com/chart-js/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T21:20:21Z"
}