{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn to create a beautiful dynamic website with \ncontent management system (CMS) in PHP &amp; MySQLi from absolutely \nscratch, this course covers both back-end and front-end web development.\n </p><p><strong>Building a Website &amp; CMS in PHP &amp; MySQLi: </strong></p><p>If\n you want to create a category based news website or any kind of blog \nwebsite in PHP &amp; MySQLi which can be dynamically updated from Admin \nPanel then this course is for you, it will show you step by step how to \ncreate such system using simple PHP functions.</p><p><strong>Some of the Important Topics We'll Cover in This Course: </strong></p><ul><li>Creating the Responsive Website Layout in Bootstrap</li><li>Creating the Responsive Admin Panel in Bootstrap</li><li>Inserting &amp; Displaying the Posts &amp; Categories </li><li>Creating the Commenting System </li><li>Uploading the Whole CMS to Online Server </li></ul><p><strong>Overview &amp; Summary: </strong></p><p>With\n over 15 hours of content and 80+ lectures, this course proudly teaches \nyou creating a complete website and content management system in PHP \n&amp; MySQL from scratch, the course is for absolute beginners who want \nto create a big project in PHP &amp; MySQLi in order to take their web \ndevelopment skills to the next level. This course gives you step by step\n environment to create a dynamic website in PHP, after completing the \ncourse, you'll be able to remember every code that was written during \nthe course. And the source code is also attached to the last lecture of \nthe course. </p><p>If you are looking for a course which can teach you a\n perfect website in simple PHP functions then don't waste your time and \nmoney on the internet, just join the course and you'll be amazed. \nFurthermore, this course will be updated with more features.</p>", 
    "end_date": null, 
    "title": "CMS Website in PHP & MySQLi From Scratch in Urdu and Hindi", 
    "price": "50.00", 
    "instructors": "Muhammad Babar, Uh Tuts", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/755646_bdfd_2.jpg", 
    "course_url": "https://www.udemy.com/cms-in-php-mysql-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T05:30:32Z"
}