{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  Still haven&#039;t had time to learn to code? Does HTML give you a migraine? Are you the type who&#039;s not just into coding? Have you been looking for an easy way to create websites without sacrificing power? If this is you, you&#039;ve found the solution.  </p>  <p style=\"\">  \t<strong style=\"\">Codeless Web Development with Adobe Muse </strong>shows you how to create outstanding looking websites with all the features you&#039;d expect. Instructor John Secor has been creating websites with Adobe Muse for some of the largest—and smallest—companies around. John&#039;s a competent expert with a knack for teaching; you&#039;ll immediately feel comfortable as he shows you all the tools and techniques you&#039;ll need to develop professional style websites.  </p>  <p style=\"\">  \t  After taking this course, you&#039;ll be able to <strong style=\"\">independently create full websites that look great </strong>and function perfectly. And remember, you can do this without writing any code at all.  </p>  <p style=\"\">  \t  This course won&#039;t just show you how to create websites, you will also learn how to create sites targeted to mobile devices like Android, iPhone, and iPad. <strong style=\"\">Mobile web</strong> is critically important since more and more people are accessing the internet through mobile devices.  </p>", 
    "end_date": null, 
    "title": "Codeless Website Development with Adobe Muse", 
    "price": "20.00", 
    "instructors": "LearnToProgram, Inc., John Secor", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402508_5d34.jpg", 
    "course_url": "https://www.udemy.com/codeless-website-development-with-adobe-muse/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-23T21:10:08Z"
}