{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course contains all the knowledge of frameworks in PHP. CodeIgniter is one of the famous frameworks of PHP.</p>\n\n<p>In this course, I’ll introduce you to the advanced world of framework i.e. CodeIgniter. This course contains 17 lectures with 3 hours of complete video training which mean you can be a professional PHP programmer in just 180 minutes. <strong>If you spend 10 minutes a day learning this stuff, then in just 18 days you can see the difference in your programming skills.</strong> I have structured this course from its basic level to intermediate level.</p>\n\n<p>We will start this course with an introduction to CodeIgniter and right after that, I’ll show you how to download and install CodeIgniter for your projects. In section 2, I’ll teach you the basics of CodeIgniter, how it works, what is MVC (Model, View, and Controller). In the next section, we will do some intermediate stuff like using helpers, libraries, creating our custom classes, configuring autoload PHP file and all.</p>\n\n<p><strong>Working on frameworks is a stage when you feel you are good at PHP, and now you need a secure system to enhance your programming skills. This course is for all those programmers who has already worked on PHP and want to learn about frameworks. So a basic knowledge of core PHP is required. </strong></p>\n\n<p>If PHP is your daily work or your passion, or you want to start to learn PHP with its frameworks, this course is for you only. <strong>Take this course and start learning with us. I would provide you complete support, in case you stuck on any step or you feel difficulty on any of the lecture, or you want to know how the following step works or any other issue. </strong>You can post in our discussion area, and I will be there to help you.</p>", 
    "end_date": null, 
    "title": "CodeIgniter - All you need to know in CodeIgniter MVC", 
    "price": "25.00", 
    "instructors": "Ankit Shrivastava, Siddarth Kumar, TweakCoder eLearning Solutions", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/269638_08f4_2.jpg", 
    "course_url": "https://www.udemy.com/codeigniter/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-27T19:15:55Z"
}