{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Work Alongside Me &amp; Learn Exactly How To Code An eCommerce Site &amp; A Landing Page From Scratch</strong> (<span style=\" color:inherit;\">Last Updated: Dec-8<em style=\"\">-</em></span><em style=\"\">2014</em>)  </p>  <h5><br style=\"\">                      Never coded before? No problem. We&#039;ve worked with over <em style=\"\">120,000 students</em> just like you.</h5>  <p>  \t                    Entrepreneurs like you are a rare breed. You create incredible businesses and come up with ideas that change the world.  </p>  <p>  \t                    Technology has made the 21st century, the century of the entrepreneur. Thanks to the power of the internet, you can reach a global audience in minutes.  </p>  <p>  \t                    The question is...do you have the skills to be able to take advantage of this incredible opportunity?  </p>  <p>  \t                    If you’re starting (or have started) a business in today’s tech driven economy, then you’ve got to understand the code that’s driving your business.  </p>  <ul style=\"\">  \t<li>Imagine asking others to create your software but you’ve no idea how it works?</li>  \t<li>Imagine not knowing the time and effort involved in realizing your idea?</li>  \t<li>Imagine having an incredible idea but you don’t have the skills to get it started?</li>  </ul>  <h5>Coding For Entrepreneurs Will Teach You, Step-By-Step, Exactly How To Code An eCommerce Website As Well As A Dynamic Landing Page. Over 120,000 students are currently learning from our courses.</h5>  <p>  \t                    All you have to do is follow along with me in a series of easy-to-follow videos that will teach you everything that’s involved in:  </p>  <p>  \t                    Project #1: Building an eCommerce site: This project will take you through everything from setup to execution…but it won&#039;t stop there. You won’t just be watching these videos...you’ll actually build this site yourself.  </p>  <p>  \t                    Project #2: Launch a Landing Page for your project: In this section you’ll learn how to build a landing page from scratch so you can collect customer DATA through a FORM. You’ll then deploy this to a live server, and be ready to collect your customer’s information so that you can test market your idea to them immediately.  </p>  <p>  \t                    When you’re finished these sections, you’ll understand how huge eCommerce sites like Amazon, Zappos, Groupon &amp; Livingsocial were created.  </p>  <h5>I’m Not Going To Teach You Tons of Coding Languages...</h5>  <p>  \t                    Instead of spending infinity boring you with the intricacies of a multitude of languages, Coding For Entrepreneurs will teach you the exact languages you need to know to launch any type of eCommerce site &amp; build landing pages that convert browsers into buyers.  </p>  <p>  \t                    The best way to learn is by doing - you’ll never learn anything if you sit and watch videos or read a PDF all day. We get you into action and enable you to achieve results immediately.  </p>  <p>  \t                    You’ll become proficient in:  </p>  <ul style=\"\">  \t<li>Python</li>  \t<li>Django</li>  \t<li>HTML</li>  \t<li>CSS</li>  </ul>  <h5>Don’t worry if these look scary...if you can multiply and add numbers then you can code!</h5>  <p>  \t                    Coding is extremely logical. Take Python for example - it reads just like the English language less a couple of odd characters (if it doesn’t now, it will soon):  </p>  <h5>We Put Special Emphasis On Django...Why?</h5>  <p>  \t                    - Django is based in Python <br style=\"\">  \t                    - It’s fast, simple, effective, secure, and ideal for &quot;perfectionists with deadlines&quot;<br style=\"\">  \t                    - Built-In User Login (authentication) System<br style=\"\">  \t                    - Web-based Admin system (built - in)<br style=\"\">  \t                    - Template system that allows basic knowledge of HTML/CSS to design the front-end. <br style=\"\">  \t                    - Growing Community for Help/Advice/Best Practices .... and freelance clients (or jobs).<br style=\"\">  \t                    - Easy to implement &amp; Launch  </p>  <h5>But I’ve Been Told That I Need To Learn C, C#, Objective C and Java?</h5>  <p>  \t                    The truth is that you could learn all of these languages and use them to further enhance your coding.  </p>  <p>  \t                    But why bother?  </p>  <p>  \t                    You’re an entrepreneur, NOT a professional coder. Would you rather learn how to code something quickly and start building your business empire or spend years debugging something that may never launch?  </p>  <p>  \t                    It’s time to take your future into your own hands and learn how to start Coding For Entrepreneurs today!  </p>  <h5>How To Be Ultra Successful With This Class</h5>  <p>  \t                    - Watch the videos and follow me and do exactly as I do<br style=\"\">  \t                    - If you get stuck, rewind and rewatch while copying me again<br style=\"\">  \t                    - If you’re still stuck, ask questions! I WILL respond to you really quickly! <br style=\"\">  \t                    - Months later if you get stuck, come back and watch the videos all over again :) <br style=\"\">  \t                    - Do NOT take notes. Implement what is happening as you see it. <br style=\"\">  \t                    - When finished, repeat the classes. Start fresh. Delete Everything. Do it again<br style=\"\">  \t                    - Repetition is key: it’s like practicing to master a golf swing or a basketball shot <br style=\"\">  \t                    - When you get stuck ASK QUESTIONS - I’ll help you <br style=\"\">  \t                    - Remember that learning this will put you light years ahead of other entrepreneurs  </p>  <p>  \t                    Build a webpage in 10 minutes ** change resolution to 720p  </p>  <p>  \t                    From a student regarding Windows Users:  </p>  <p>  \t                    &quot;The easiest way to take this course in terms of learning is through a Linux VM. On Windows, download Virtualbox and a Linux .iso (e.g. Ubuntu). Once downloaded, open Virtualbox, follow the steps to create a Ubuntu VM, select the .iso from your hard drive, install Ubuntu and you&#039;re good to go with all the commands mentioned in this course. The only extra command I&#039;ve had so far to install pip is &#039;sudo apt-get install python-setuptools&#039;.&quot; -- Harry  </p>  <h5>FAQ (Doubters Read This)</h5>  <p>  \t                    1) I am not technical at all, are you sure I should take this class?There was a time you didn&#039;t know how to read, or write, or speak, or walk, or... I believe you are not technical because you didn&#039;t take the time to learn through the hard times OR because you haven&#039;t even tried. Coding For Entrepreneurs has a growing community to help you through the tough times, the Instructor will help, the Django Community is incredible, and often times a simple web search will solve your problem. Getting help is easier than EVER and often comes for free.  </p>  <p>  \t                    2) Is Django actually that good? It&#039;s the default choice for Instagram, Mozilla, Pinterest, Disqus, and many, many more. Django is lightweight, super flexible, easy to learn, easy to implement. I believe it&#039;s that good.  </p>  <p>  \t                    3) What makes Python a good language for beginners? Python looks closest to the English language next to many other programming languages and therefore is easier to learn. Python uses spaces &quot; &quot; more often than &quot;;&quot; or &quot;$&quot; or &quot;{&quot; or &quot;(&quot; like PHP and Ruby use.  </p>  <p>  \t                    4) I already know PHP (or another language), should I learn Python/Django? There are two schools of thought: 1) Yes because it&#039;s awesome and makes it easy to implemented web-based projects or 2) No because you don&#039;t really need to know more than 1 language. If there is any feeling of desire to learn more, do it.  </p>  <p>  \t                    5) Why don&#039;t I just use Wordpress or another platform? I think this is like asking a chef why he doesn&#039;t follow someone else&#039;s recipe. The other recipe might be fantastic... but it&#039;s still following a recipe. A true chef creates. A cook follows. Using a platform can be great...but to truly innovate, you need to know how to do it yourself.  </p>  <p>  \t6) I see that Django version 1.6 and Python 2.7 is what is used... isn&#039;t Python 3.4 and Django 1.7 out? Why aren&#039;t you using those versions? Yes both are out and both are very solid on their own. There is much debate about Python 2.7 and Python 3.4 as to which to use. Mac and Linux come standard with Python 2.7 so we believe it&#039;s still a solid choice and will remain that way until these major operating systems change what they use. Django 1.7 vs 1.6 (or even 1.5) is virtually the same; especially for a beginner. Once you understand Django, you understand Django. Regardless of the version until Django releases a huge overhaul (which won&#039;t happen anytime soon).  </p>", 
    "end_date": null, 
    "title": "Coding for Entrepreneurs: Learn Python, Django, and More.", 
    "price": "35.00", 
    "instructors": "Justin Mitchel", 
    "commitment": "45 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47963_16fd_8.jpg", 
    "course_url": "https://www.udemy.com/coding-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-30T21:26:27Z"
}