{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Remember when you couldn&#039;t walk? Of course not. Who can?</p><p>Learning to code is much like learning to walk...except it happens much later in life.</p>Never coded before? No problem.<p>Entrepreneurs like you are a rare breed. You create incredible businesses and come up with ideas that change the world.</p><p>Technology has made the 21st century, the century of the entrepreneur. Thanks to the power of the internet, you can reach a global audience in minutes.</p><p>The question is...do you have the skills to be able to take advantage of this incredible opportunity?</p><p>If you&#039;re starting (or have started) a business in today&#039;s tech driven economy, then you&#039;ve got to understand the code that&#039;s driving your business.</p><ul style=\"\"><li>Imagine asking others to create your software but you&#039;ve no idea how it works?</li><li>Imagine not knowing the time and effort involved in realizing your idea?</li><li>Imagine having an incredible idea but you don&#039;t have the skills to get it started?</li></ul>I&#039;m Not Going To Teach You Tons of Coding Languages...<p>Instead of spending infinity boring you with the intricacies of a multitude of languages, Coding For Entrepreneurs will teach you the exact languages you need to know to launch any type of eCommerce site &amp; build landing pages that convert browsers into buyers.</p><p>The <strong style=\"\">best way to learn is by doing</strong> - you&#039;ll never learn anything if you sit and watch videos or read a PDF all day. We get you into action and enable you to achieve results immediately.</p><p>You&#039;ll get in introduction in:</p><ul style=\"\"><li>Python</li><li>Django</li><li>HTML</li><li>CSS</li></ul>Don&#039;t worry if these look scary...if you can multiply and add numbers then you can code!<p>Coding is extremely logical. Take Python for example - it reads just like the English language less a couple of odd characters.</p><p>We Put Special Emphasis On Django...Why?<br style=\"\"></p><strong style=\"\">- Django is based in Python </strong><br style=\"\">- It&#039;s fast, simple, effective, secure, and ideal for &quot;perfectionists with deadlines&quot;<br style=\"\"><strong style=\"\">- Built-In User Login (authentication) System</strong><br style=\"\">- Web-based Admin system (built - in)<br style=\"\"><strong style=\"\">- Template system that allows basic knowledge of HTML/CSS to design the front-end. </strong><br style=\"\">- Growing Community for Help/Advice/Best Practices .... and freelance clients (or jobs).<br style=\"\"><strong style=\"\">- Easy to implement &amp; Launch</strong><br style=\"\">But I&#039;ve Been Told That I Need To Learn C, C#, Objective C and Java?<p>The truth is that you could learn all of these languages and use them to further enhance your coding.</p><p>But why bother?</p><p>You&#039;re an entrepreneur, NOT a professional coder. Would you rather learn how to code something quickly and start building your business empire or spend years debugging something that may never launch?</p><p>It&#039;s time to take your future into your own hands and learn how to start Coding For Entrepreneurs today!</p>How To Be Ultra Successful With This Class<strong style=\"\">- Watch the videos and follow me and do exactly as I do</strong><br style=\"\">- If you get stuck, rewind and rewatch while copying me again<br style=\"\"><strong style=\"\">- If you&#039;re still stuck, ask questions! I WILL respond to you really quickly! </strong><br style=\"\">- Months later if you get stuck, come back and watch the videos all over again :) <br style=\"\"><strong style=\"\">- Do NOT take notes. Implement what is happening as you see it. </strong><br style=\"\">- When finished, repeat the classes. Start fresh. Delete Everything. Do it again<br style=\"\"><strong style=\"\">- Repetition is key: it&#039;s like practicing to master a golf swing or a basketball shot </strong><br style=\"\">- When you get stuck ASK QUESTIONS - I&#039;ll help you <br style=\"\"><strong style=\"\">- Remember that learning this will put you light years ahead of other entrepreneurs</strong><br style=\"\"><p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\">Windows Users</strong>:</p><p>&quot;The easiest way to take this course in terms of learning is through a Linux VM. On Windows, download Virtualbox and a Linux .iso (e.g. Ubuntu). Once downloaded, open Virtualbox, follow the steps to create a Ubuntu VM, select the .iso from your hard drive, install Ubuntu and you&#039;re good to go with all the commands mentioned in this course. The only extra command I&#039;ve had so far to install pip is &#039;sudo apt-get install python-setuptools&#039;.&quot; -- Harry (student)</p>", 
    "end_date": null, 
    "title": "Coding for Entrepreneurs Basic", 
    "price": 0, 
    "instructors": "Justin Mitchel", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59014_6fd8_3.jpg", 
    "course_url": "https://www.udemy.com/coding-for-entrepreneurs-basic/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-08T22:04:12Z"
}