{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Welcome to the simplest introductory guide to learning HTML &amp; CSS!</strong><br></p><p>This course will cover HTML (Hyper Text Markup Language) and CSS (Cascading Style Sheets). </p>\n\n<p>HTML is a tool to provide content and metadata to a web browser. CSS is used to style this content for presentation. These are the technologies that practically every website on the internet uses.</p><p><strong>About the teacher.</strong></p><p>Colin Fruit is a web developer based in San Francisco, California. His Dad first introduced him to coding at the age of 10, when he was shown how to use Python.</p><p>Since that day, Colin has amassed many teaching hours, launched his own projects and continues to build easy to understand modules around a variety of programming languages.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Simple lectures, straight forward exercises.</strong><br>\n\n  </p>\n\n\n\n<p>The course will be taught in a series of eight video lectures, combined with exercises to solidify content learned. Videos are typically about twelve minutes in length, and the following exercises can take between thirty minutes to one hour to complete.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Understand how to read and write basic HTML &amp; CSS.</strong></p>\n\n\n\n<p>After this course, you the student will be justifiably confident in your ability to read and write basic HTML and CSS. </p>\n\n\n\n<p>In today's technical age, a knowledge of websites will give you a tremendous advantage in the job marketplace as well as with your own business aspirations.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn how websites function, position yourself for a new career in web development or understand how to utilise these skills to start your own projects!</strong><br></p>\n\n\n\n<p>Following this course, you will be able to understand exactly what is going on with most of the websites that you visit on a day to day basis. It will be a great start for anyone considering embarking on a career in web development or even someone wanting to build their own online presence.</p>\n\n<p>So, whether an aspiring developer, professional, or just a curious human, this course will be a benefit to you if you're interested in the internet and creating your own webpages.</p>", 
    "end_date": null, 
    "title": "Coding Made Easy: HTML & CSS For Beginners", 
    "price": "20.00", 
    "instructors": "Fred Williams, Colin Fruit", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/864482_b45b_2.jpg", 
    "course_url": "https://www.udemy.com/coding-made-easy-html-css-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-31T09:12:59Z"
}