{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn to create a beautiful dynamic website with content management system (CMS) in PHP &amp; MySQLi from absolutely scratch, this course covers both back-end and front-end web development. </p><p><strong style=\"\">Building a Website &amp; CMS in PHP &amp; MySQLi: </strong></p><p>If you want to create a category based news website or any kind of blog website in PHP &amp; MySQLi which can be dynamically updated from Admin Panel then this course is for you, it will show you step by step how to create such system using simple PHP functions.</p><p><strong style=\"\">Some of the Important Topics We&#039;ll Cover in This Course: </strong></p><ul style=\"\"><li>Creating the Website Layout in CSS3 &amp; HTML5</li><li>Creating the Admin Panel </li><li>Inserting &amp; Displaying the Posts &amp; Categories </li><li>Creating the Commenting System </li><li>Uploading the Whole CMS to Online Server </li></ul><p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\">Overview &amp; Summary: </strong></p><p>With over 12 hours of content and 50+ lectures, this course proudly teaches you creating a complete website and content management system in PHP &amp; MySQL from scratch, the course is for absolute beginners who want to create a big project in PHP &amp; MySQLi in order to take their web development skills to the next level. This course gives you step by step environment to create a dynamic website in PHP, after completing the course, you&#039;ll be able to remember every code that was written during the course. And the source code is also attached to the last lecture of the course. </p><p>If you are looking for a course which can teach you a perfect website in simple PHP functions then don&#039;t waste your time and money on the internet, just join the course and you&#039;ll be amazed. Furthermore, this course will be updated with more features.</p>", 
    "end_date": null, 
    "title": "Complete Website & CMS in PHP & MySQL From Scratch!", 
    "price": "20.00", 
    "instructors": "Abdul Wali", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/98066_a13f_9.jpg", 
    "course_url": "https://www.udemy.com/cms-admin-panel-in-php-mysql/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-26T21:14:59Z"
}