{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In this course we are going to <strong class=\"redactor-inline-converted\">create 5 web development projects in html5 and css3</strong>. You will become a web developer after learning from this course. Y<strong class=\"redactor-inline-converted\">ou will be able to work as a web developer or web designer and start earning money.</strong> If you hear the <strong class=\"redactor-inline-converted\">web development</strong> word first time. Don’t worry i will teach you each and everything from beginner level to advance level in this course. First i will teach you html5 and css3. The html5 and css3 is used to create the layouts of websites. The html5 is just used to link the data in the pages and css3 is used for giving the style. I'm going to teach you both of these languages in one course then we will make 5 web development projects. If you don’t understand anything you will be able to add question in the discussion area.<strong class=\"redactor-inline-converted\"> I will give you 24 hours support and i will answer all of your questions. If you will be stuck at any point i will helpful you. Other wise you will have 30 days money back guarantee.</strong></p>\n\n\n\n<p>First of all this course is for all kind of students both beginners and experts. Because at the first, i will teach the basic html and css including (Html5 and css3) to those students who don't know anything about these languages. Then i will teach you how to create web development projects professionally. I have also provide all of these five project's source code. You can download these projects and follow the code while i am teaching. I will teach all of these five projects by writing and executing code. I will explain everything step by step. So, if you will face any problem in learning projects you can ask question.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What are benefits to take this course?</strong></p>\n\n\n\n\n\n\n\n<ul>  <li>Students will be able to create their own websites\n\n  </li><li>They will have the complete knowledge of html5 and css3\n\n  </li><li>I will build 5 web development projects in front of      them.</li></ul><ul><li><strong>They will get a job as web developer or they will be      able to work independently as web developer to earn money.</strong>\n\n  </li><li>They will also get the websites that we will build in      this course. So they can change the code and follow the code.\n\n  </li><li>I will help them to develop their websites. If they      stuck at any point. I will help them.</li><li>They can ask any question in discussion area or they      can message me and i will help them.\n\n  </li><li>They have the content of 118 videos of 24 hours\n\n  </li><li>They will know how to develop beautiful and awesome      websites.\n\n </li></ul>\n\n\n\n\n\n<p> <strong class=\"redactor-inline-converted\"> </strong></p>\n\n\n\n\n\n\n\n\n\n<p>Here are some reviews from my previous course of html5 and css3.</p>\n\n\n\n\n\n<p>\" This is the best course for someone who begin in the Web Development area. It will allow you to master properly HTML5 and CSS3. The Professor is a Great Teacher !!! Now I'm very confident to continue my journey in order to Become a Front End Developer !!! \" - steve kuzanwa</p>\n\n\n\n\n\n\n\n<p>\" The course is well taught, topics are covered reasonably by examples and the instructor is very active which is great to see.this is an excellent course on web development. The instructor demonstrates how to design a website using professional techniques. He shows the proper way to design site. He has put in the extra effort to make this a great course. The course starts with the basics and continues to advanced features and functionality. I highly recommend this course! \" - Finely collin</p>\n\n\n\n\n\n\n\n<p>These were some feedback that are on my previous course. These reviews show how I teach and my students are satisfied. If you will not satisfied with my course you can refund your money. I hope you will enjoy this course. Thanks</p>", 
    "end_date": null, 
    "title": "Complete HTML5 and CSS3 Course + 5 Web Development Projects", 
    "price": "20.00", 
    "instructors": "Usman Raoof, Fahad Chaudhry", 
    "commitment": "24.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/789324_564a_2.jpg", 
    "course_url": "https://www.udemy.com/creating-5-web-development-projects-in-html5-and-css3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T06:57:09Z"
}