{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Installing any site on cloud server is no easy task. A single Wordpress site needs number of software not only installed, but configured together to function. A main reason why people like to stay away from cloud server. But situation has changed now. This course helps you to deploy optimized Wordpress, PHP &amp; HTML site on cloud server <em>in minutes</em>. No prior experience is needed. </p><p><em>All lectures will soon be equipped with subtitles.</em></p><p><strong>You know well, some day you have to migrate to cloud server or VPS, then why not today?</strong></p><p>Expand your technical knowledge with us and serve best browsing speed, reliability etc to visitors of your website/blog.</p><p><strong>Install or migrate your Wordpress site on cloud and save money on expensive Wordpress managed hosting.</strong></p><p>Get rid of slow shared hosting and don't fall for business tactics like Wordpress managed hosting. Cloud hosting is getting cheaper day by day and with AWS, it is free for one year. Migrate your Wordpress from shared server to cloud server with zero down time.</p><p><strong>Improve SEO and get your website on first page of Google.</strong></p><p>Dedicated ip address ensures your site gets added into trusted lists of search engine bots.</p><p><strong>Run your mail server and send millions of mails, newsletters via free AWS instance at zero cost.</strong></p><p>Learn to deploy and configure mail server so that your mails, newsletters never ever get flagged as spam.</p><p><strong>Contents and Overview </strong></p><p>In over 3 hours of content including 26 lectures and 22 pdf files (equivalent to <strong>e-book</strong>), this course covers all necessary steps to install Wordpress site, PHP site and HTML site on Nginx server. </p><p>Starting with the basics of Linux server, this course will guide you through installation of Ubuntu server, DNS management, installation of Webserver software Nginx, installation of mail server software Dovecot, installation of Wordpress sites and Migration of Wordpress sites with <strong>zero downtime</strong>.</p><p>You will learn to install and configure following softwares</p><ul><li>Nginx</li><li>MySQL</li><li>PHP</li><li>Postfix (A Mail transfer agent)</li><li>WP-CLI (Command line interface for WordPress)</li><li>Roundcube</li><li>FastCGI</li><li>OPcache</li><li>SpamAssassin</li><li>etc</li></ul><p>You will learn to deploy following types of websites.</p><ul><li>Standard Wordpress site </li><li>Wordpress site with nginx fast-cgi cache</li><li>Wordpress site with nginx redis cache</li><li>Wordpress site with HHVM</li><li>Wordpress site with page speed</li><li>Multi site Wordpress with subdirectory</li><li>Multi site Wordpress with subdomain</li><li>PHP sites with MySQL database</li><li>HTML sites</li></ul><p>You will also learn to install and configure</p><ul><li>UFW (Uncomplicated Firewall)</li><li>DKIM (Domain Keys Identified Mail)</li><li>DDoS (Distributed Denial of Service) Protection</li></ul><p>Student completing this course will have knowledge to install wordpress, PHP and html sites from scratch on Ubuntu server.</p>", 
    "end_date": null, 
    "title": "Complete guide to install Wordpress, PHP on Cloud,AWS or VPS", 
    "price": "25.00", 
    "instructors": "Mr. Dhiraj Rahul", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/697798_8d28_3.jpg", 
    "course_url": "https://www.udemy.com/a-complete-guide-to-install-wordpress-php-on-cloud-server-aws-or-vps/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T03:53:49Z"
}