{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Do you want to learn how to program and build robust Websites using the latest technologies? </p><p>I'll teach you step by step from the absolute basics to the more advanced patters used by seasoned professionals.  You will become an expert <strong>ASP NET MVC C# Web Developer</strong>, take your career to the next level and learn how the top developers can <strong>demand bigger salaries</strong>!  </p><p>Freelance &amp; contract developers can make upwards of $500 a day, and the demand is increasing each year.</p><p>Whether you are completely new to software development, or have already learnt the basics, my course will walk you through everything you need to know to become world class</p>  <p><strong><b>H</b>ere's what some students have have been saying:</strong>  </p>  <p>  \t  'A very good course on MVC, after taking some MVC courses here in Udemy, I subscribed this one, helps me to gain more clarity inside the MVC process'  </p>  <p>  \t  'I now see what I've been missing!  This is certainly one of the best courses I've watched/read about ASP NET!'  </p>  <p>  \t  'I've run through a through a few tutorials and blog posts whilst learning MVC, and I never knew about the ideas discussed in this course, or thought they were beyond be ay my beginner level.'  </p>  <p>  \t                       Do you want to learn how professional developers build best in class websites using ASP NET MVC?</p>  <p>  \t<em><strong>  Senior developers can earn in excess of $100k a year</strong></em> - one of the key differences they demonstrate is the ability to quickly write extensible code and get involved in the architecture process.  </p>  <p>  \t                       This course will teach you how enterprise class developers create 'Best in Class' software, and how these principals will help you create software easier, faster and be less prone to bugs.  </p>  <p>I will teach you the basics of software development, move onto Object Orientated Programming (OOP) and introduce the 7 SOLID Principles and modern day patterns that adhere to them such as Dependency Injection, MVC, Abstraction and Inheritance. </p><p>Through this course you will implement</p>  <ul>  \t<li>An ASP NET MVC e-commerce site.</li><li>Object Orientated Programming (OOP)</li>  \t<li>Layered Architecture</li>  \t<li>Repository Pattern</li>  \t<li>Entity Framework</li>  \t<li>Dependency Injection</li>  \t<li>Modules</li>  \t<li>Partial Views</li><li>And more!</li></ul>  <p>  \t                       And of course, being part of Udemy you get:  </p>  <ul>  \t<li>FREE lifetime access to this course</li>  \t<li>ALL future lectures and upgrades (of which there will be many!) included for free</li>  \t<li>Udemy's Unconditional 30 day money back guarantee - so there's NO risk</li>  </ul>", 
    "end_date": null, 
    "title": "Complete ASP NET MVC Web Development - Newbie to Ninja!", 
    "price": "20.00", 
    "instructors": "Brett Hargreaves", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/328476_3125_4.jpg", 
    "course_url": "https://www.udemy.com/better-web-development-pro-techniques-for-success/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T19:43:55Z"
}