{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>The Complete Python Web Developer Course</em> will lead you down a path of understanding and skill that may well, with work and patience, result in an income boost or a career change.<br></p><p>It is a one-stop-shop covering everything you need to start having ideas and creating Python web applications that engage visitors and provide them with value. In addition, I’ll always be available to help you further your learning and explore more avenues for success.</p><p><strong>What do you have to do?</strong></p><p>You’ll have immediate access to 8 carefully designed sections, each teaching and guiding you into creating a web application using Python: your challenge. I’ve created thorough, extensive, but easy to follow content which you’ll easily understand and absorb.</p><p>I recommend taking your time, as software development doesn’t happen overnight. Each section should take approximately one week, including developing the weekly challenge, reading around the subject, and practising further.</p><ul><li>The course starts with the basics, including Python fundamentals, programming, and user interaction.</li><li>Then we will move onto how the internet works, making web requests and parsing webpages to get data from them using Python.</li><li>Now that you’ll have all the knowledge required, we’ll introduce our database of choice, MongoDB, and then proceed into creating our first Python web application: a blog where users can register and publish posts.</li><li>Then we will create a fantastic application to notify you when prices of items in online stores go down; a really useful web app!</li><li>After, we will be creating a more complex application using everything we know, to allow teachers and students to register, create courses, send notifications, and interact with one another.</li><li>Finally, we will explore creating a social network, the challenges it presents, and how we could solve them.</li></ul><p>During all this, we’ll be learning about deploying our application, making it performing so it can scale to thousands of users, and usability and security issues.</p><p>Over the entire course you will learn:</p><ul><li>Python</li><li>HTML</li><li>CSS</li><li>Responsive Design with Bootstrap</li><li>JavaScript</li><li>jQuery</li><li>MongoDB</li><li>Linux (UNIX)</li><li>APIs (both creating them and interacting with them)</li><li>Deployments to Heroku and DigitalOcean</li></ul><p>What else will you get?</p><ul><li>A friendly community to support you at all times</li><li>Personal contact with me: I’m always available to answer questions and help out</li><li>Lifetime access to course materials, even as more are released (and they are, very often!)</li><li>Hands-on learning to ensure you’re absorbing everything</li><li>A true understanding of the concepts of software development, design, and operations</li></ul><p>By the time you’re done with the course you’ll have a fantastic set of fundamentals and extensive knowledge of Python, which will allow you to easily continue learning and developing more and more advanced and engaging web applications.</p><p>It doesn’t matter how old you are or what you do professionally. I guarantee that ANYONE can benefit from learning development and Python, but especially web application development.</p><p>Note the course is extremely new, and content is being continuously added. Although it is already very extensive, not all 8 apps are available yet. The last couple ones are being recorded at this moment and will be coming over the next couple weeks. After that, more apps will be added over time, and thus might end up spanning more than 8 apps.</p><p>So <em>what are you waiting for</em>? <strong>Sign up now</strong>, and I’ll see you on the inside!</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Complete Python Web Course: Build 8 Python Web Apps", 
    "price": "30.00", 
    "instructors": "Jose Salvatierra", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631128_2efb_4.jpg", 
    "course_url": "https://www.udemy.com/the-complete-python-web-course-learn-by-building-8-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T09:37:02Z"
}