{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In this course you are going to learn <strong class=\"redactor-inline-converted\">complete jquery from beginner to advance level things including ajax</strong>. JQuery is the frame work of javascript. In jquery you can do many things in easy way that is hard in javascript. you can say that jquery is easy way to learn javascript.Any one can take this course who want to learn jquery. <strong class=\"redactor-inline-converted\">But you must have the knowledge of html and css. If you have not any knowledge of javascript. Don't worry i will teach you each and everything. you can still take this course.</strong></p>\n\n<p>First of all you will learn the <strong class=\"redactor-inline-converted\">basic things of jquery</strong> and then i will teach you <strong class=\"redactor-inline-converted\">jquery selectors, events, effects etc</strong>. After this you will learn how to use jquery with html and css.Then you will learn jquery traversing. Then i will code some small practical programs that we are using in web and softwares. After this you will learn the new technology ajax. After ajax, i will teach you how to make plugins. Then the final thing jquery user interface. In which i will teach you how to handle user interface with jquery. I will teach each and everything by coding examples not from slides or pdfs. <strong class=\"redactor-inline-converted\">you will also have the access to practice files so you can practice the code.</strong>If you will face any problem in your code. You can also share the code and i will make it correct.</p>\n\n<p>If you have any problem during learning this course. <strong>You can ask the question at any time and i will answer that question</strong>. I will clear your all queries. If you will ask a question 100 times. I will answer it 100 times.<strong class=\"redactor-inline-converted\">If you will feel that this course doesn't worth your money. you can refund your money within 30 days after taking this course.</strong></p>", 
    "end_date": null, 
    "title": "Complete JQuery Developer Course - Beginner to Pro", 
    "price": "20.00", 
    "instructors": "Fahad Chaudhry, Usman Raoof", 
    "commitment": "22.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/877124_7c00.jpg", 
    "course_url": "https://www.udemy.com/complete-jquery-developer-course-beginner-to-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-13T19:38:33Z"
}