{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Wordpress vs Concrete5 Functionality</p>  <p>Both Wordpress and Concrete5 administrations are fairly easy  to use. Once you login, you have a dashboard with various menu items with  options for you to add media, plugins or functionality, and add pages, blog,  etc... One of the real differences for users is the pages area of Concrete5.  When adding content to a page you are working directly on the page design, so  you can see what you are doing while doing it. In Wordpress, you are behind the  scenes, so to see the changes in Wordpress, you must launch a preview page.</p>  <p>Both programs have incredible SEO data entry areas making  each a powerfully rich SEO website. Making sure to add keywords to images and  textual content as well as a proper title and description will help the search  engines place your content correctly and then others will find you.</p>  <p>Both can be custom designed so your site is an original,  looking just how you want it and you still have that all important CMS to  update and add content yourself.</p>  <p>So, why choose one over the other?</p>  <p>I would say that if you are planning to have extensive  galleries (photographers, artists, designers, etc...) or a product website with  nested, nested products, Concrete5 is the greatest application for this. It&#039;s  so WYSIWYG (what you see is what you get). Wordpress can create galleries, but  not as complex as categories to sub categories, to sub sub and so on...</p>  <p>Concrete5 also has tons of add ons just like Wordpress, so  you can add a blog also.</p>  <p>Wordpress has a ton of themes available, Concrete5 not as  many, but if you&#039;re going to hire a designer for a custom theme anyway, this is  not an issue.</p>  <p>Concrete5 has a CMS that is very clear and there is nothing  confusing about it. </p>  <p>Wordpress baffles and intimidates some people, I know because  people are always asking me questions about the settings, plugins,  functionality and more.</p>  <p>Try it out!</p>  ", 
    "end_date": null, 
    "title": "Concrete5 CMS - Powerful and Easy ", 
    "price": "35.00", 
    "instructors": "Susan Newman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/54945_32be_5.jpg", 
    "course_url": "https://www.udemy.com/cms-concrete5/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-18T18:50:10Z"
}