{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Se lancer dans la conception de son site internet est excitant, un beau défi... mais trop souvent, on se lance dans cette aventure mal préparé. La grande force de cette formation, c'est de vous accompagner tout au long du processus, du début, avec la préparation du matériel jusqu'à la fin, la mise en ligne du site.</p>Pour construire un site Internet, il faut :<ul><li>Réfléchir à la structure et au contenu</li><li>Créer et/ou rédiger le contenu</li><li>Rapatrier tous les éléments visuels et les préparer correctement pour l'intégration</li><li>Intégrer le contenu en tenant compte des notions d'indexation auprès des engins de recherche (SEO)</li></ul><p><strong>Bref, construire son site Internet en 2 heures ou en 5 minutes, ça n'existe simplement pas.</strong></p><p>Il est à noter que cette formation est modulaire, ce qui veut dire qu'une fois votre site terminé, vous choisissez les modules extras dont vous avez besoin sur votre site.</p><p>Lors de cette formation, vous apprendrez entre autre :</p><ul><li>à vous procurer votre nom de domaine et votre compte d'hébergement</li><li>à utiliser un logiciel ftp</li><li>à préparer votre matériel de façon adéquate</li><li>à utiliser l'outil Wordpress</li><li>à créer du contenu de qualité</li><li>à maximiser vos chances avec les engins de recherche (SEO)</li></ul>", 
    "end_date": null, 
    "title": "Construisez votre site Internet - portfolio avec Wordpress", 
    "price": "20.00", 
    "instructors": "Charles Kalos", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397970_03b7_3.jpg", 
    "course_url": "https://www.udemy.com/construisez-votre-site-internet-portfolio-avec-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T12:23:04Z"
}