{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"> Coding for Entrepreneurs CORE is a comprehensive guide to help you build better projects</strong>. Updated August 17 2015</p>  <p style=\"\">  \t      This course is designed as a compliment to all <strong style=\"\">Coding For Entrepreneurs Projects</strong> and will help you better understand Django, Bootstrap, Python, jQuery, and more.  </p>  <p style=\"\">  \t    We have worked with over <strong style=\"\">100,000 students worldwide</strong> and it allows us to continually improve our content and our ability to help entrepreneurs build better projects.  </p>  <p style=\"\">  \t    You can be anything you want to be. This has always been true but even more so now thanks to incredible people working hard around the world to both learn and teach. We strive to help you become a better entrepreneur by helping you better understand the fundamentals of the technology that is changing all of our lives for the better.  </p>  <p style=\"\">  \t    Anything that can be automated, will be. Who is going to be doing the automating? Who will be designing the systems? Who will be rebuilding the systems? Who will be managing the systems?  </p>  <p style=\"\">  \t    It&#039;s an incredible time to be an entrepreneur. Join us, we&#039;d like to work with you to improve our skills together.  </p>  <p style=\"\">  \t    Cheers,  </p>  <p style=\"\">  \t    Justin Mitchel  \t    Founder  \t    Coding For Entrepreneurs  </p>", 
    "end_date": null, 
    "title": "Core: A Web App Reference Guide for Django, Python, and More", 
    "price": "45.00", 
    "instructors": "Justin Mitchel", 
    "commitment": "26 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/186096_6b71_14.jpg", 
    "course_url": "https://www.udemy.com/coding-for-entrepreneurs-core/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-20T22:13:36Z"
}