{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t              <img src=\"http://i1381.photobucket.com/albums/ah239/imujash/Uncategorized_2_zps098ddffb.jpg\" alt=\"HTML5 is the future of the the entire web. An investment in the future.\" style=\" max-width:100%;\"></p>  <p><img src=\"http://i1381.photobucket.com/albums/ah239/imujash/UC01-Landing_Page_04_zps2e1a76ff.jpg\" width=\"530\" height=\"44\" alt=\"Course Highlights\" style=\" max-width:100%;\"></p>  <ul style=\"\">    <li>Learn to setup the environment to work with HTML5 documents</li>    <li>Dive-in to create your first webpage using the new HTML5 markup</li>    <li>Understand the HTML tags and how to use them properly</li>    <li>Learn to document your work</li>    <li>Learn to create section heading on your webpage</li>    <li>Apply text formatting to paragraphs on your webpage</li>    <li>Learn to insert special characters</li>    <li>Make text subscript and superscript</li>    <li>Learn to create tables on your webpages</li>    <li>Learn to insert beautiful images on your webpages to make them look attractive </li>    <li>Use hyperlinks to link to other pages and files on your webpage</li>    <li>Learn to create lists on your webpages</li>    <li><strong style=\"\">Lifetime Course Support</strong></li>    <li><strong style=\"\">Regular Course Update</strong></li>  </ul>  <p><img src=\"http://i1381.photobucket.com/albums/ah239/imujash/UC01-Landing_Page_03_zps2533e28c.jpg\" width=\"530\" height=\"300\" alt=\"Testimonials\" style=\" max-width:100%;\"></p>  <p><img src=\"http://i1381.photobucket.com/albums/ah239/imujash/UC01-Landing_Page_05_zps60bd7fe3.jpg\" width=\"530\" height=\"44\" alt=\"Why learn HTML5?\" style=\" max-width:100%;\"></p>  <p>  \t                    Earlier it was just HTML, and then came XHTML, HTML 4.0 etc. And now it is HTML 5 the current language of the World Wide Web (Internet) and a language on which nearly all websites will be based-on in future.  </p>  <p>  \t                    HTML 5 is simple, clean, fun and the easiest language to learn. All the new technologies in HTML 5 enable web developers to create websites that are smarter, faster and more secure than they have ever been before. So, whether you want to create websites just for personal use, business use or if you want to enter the world of web-development, think no farther. HTML 5 is the right tool to get started with and its basic rules are simple and easy to pick up, it’s an investment for lifetime, and once you know how to put it to use, you are only limited by your imagination.  </p>  <p><img src=\"http://i1381.photobucket.com/albums/ah239/imujash/UC01-Landing_Page_06_zpsb4a5712e.jpg\" width=\"530\" height=\"44\" alt=\"Course Mission\" style=\" max-width:100%;\"></p>  <p>  \t                    The mission of this course is to provide a quick and accessible way for you to learn and understand the core concepts in HTML 5, so that you can get started in programming for the web (Internet) using HTML 5. This course does not assume that you have any prior experience with any programming language or building any websites. Therefore, in this course you will learn the core concepts in HTML 5 from the ground up. I hope that this course provides hands on introduction to the core concepts in HTML 5 and fills in multiple roles as both a learning tool and a reference once you expand your skillset.  </p>  <p><img src=\"http://i1381.photobucket.com/albums/ah239/imujash/UC01-Landing_Page_07_zps644f19ca.jpg\" width=\"530\" height=\"44\" alt=\"Supplementary Files:\" style=\" max-width:100%;\"></p>  <p>  \t                    Each lecture in this course contains additional supplementary files in the supplementary file section, in order for you to understand the concepts better. It also contains example codes, figures and lecture keyword documents. In case you want to download a zipped folder of these files, kindly send me a message and I will send you a link to download the zipped folder.  </p>  <p><img src=\"http://i1381.photobucket.com/albums/ah239/imujash/UC01-Landing_Page_08_zps294d3eb6.jpg\" width=\"530\" height=\"44\" alt=\"Feedback\" style=\" max-width:100%;\"></p>  <p>  \t                    I’m constantly working on to improve this course. Therefore, if you have any feedback you are welcome to send me a message and I will definitely work on to include that in this course.  </p>", 
    "end_date": null, 
    "title": "Core Concepts in HTML 5", 
    "price": "50.00", 
    "instructors": "Syed Mujtaba", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/253246_070e_19.jpg", 
    "course_url": "https://www.udemy.com/core-concepts-in-html-5/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-30T15:34:04Z"
}