{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>Join 2,700+ Students Enrolled In This Course</strong>  </p>  <p>  \t        ACCORDING TO RESEARCH, ONLINE TEACHING IS THE #1 BUSINESS TO START BECAUSE PEOPLE ARE ALWAYS LOOKING TO LEARN A NEW SKILL OR IMPROVE ON WHAT THEY ALREADY KNOW!  </p>  <p>  \t          This is your opportunity to reach some of them with your own online school website.  </p>  <p>  \t            If you've ever wanted to teach online or start your own online school, this course is what you've been waiting for. It teaches you step by step everything you need to know about creating an online school website...saving you THOUSANDS of dollars from having someone create it for you.  </p>  <p>  \t            Everyone is an expert at something. There's something you can do that others would love to learn how to do...regardless of what it is. If you've always wanted to share your knowledge with the world and make money while doing it, then this course is an answer to your prayers.  </p>  <p>  \t            Here are some of the features of this course:  </p><p><strong>Teachers Commission (NEW)</strong></p><p>Set and manage the percentage of commission you want your teachers to earn.</p>  <p>  \t<strong>Course Creation Made Easy</strong>  \t          No need to spend hours writing codes. Create courses in a snap and publish them for the whole world to see.  </p>  <p>  \t<strong>Table of Content</strong>  \t          Create a table of content for your courses just by using the drag and drop interface.  </p>  <p>  \t<strong>Lessons Creation</strong>  \t          Add lessons to your learning modules with media, text, files, links and more.  </p>  <p>  \t<strong>Front-End Teacher Interface</strong>  \t          Your teachers can prepare whole courses themselves, letting you focus on managing your website.  </p>  <p>  \t<strong>Certificates</strong>  \t          Giving your students certificates validates your courses and helps them get jobs. You can set the parameter on how students earn their certificates.  </p>  <p>  \t<strong>Forum &amp; Comments</strong>  \t          Students can comment on lessons &amp; ask questions on the forum.  </p>  <p>  \t<strong>Make Money Instantly</strong>  \t          Create subscription plans for days/months/year or create unlimited access to all or specific courses.  </p>  <p>  \t<strong>Promo Codes</strong>  \t          Increase your number of students by creating promo codes.  </p>  <p>  \t          The average cost to create an online school website will cost you $1,000's of dollars. But now, you can get started for less than a fraction of the cost. Trust me, this will save you so much money that you could invest in other things.  </p>  <p>  \t<strong>How do I sign up?</strong>  </p>  <p>  \t          Click on the, \"Take this course\" button at the top right hand corner of this page. It takes only a few seconds to sign up.  </p>", 
    "end_date": null, 
    "title": "Create Your Own Successful Online School To Sell Courses", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348920_b03e_4.jpg", 
    "course_url": "https://www.udemy.com/create-an-online-school-website-with-joomla/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T02:27:30Z"
}