{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>De qué trata el curso?</strong><br></p><p>En breve, este curso consiste de 20 clases de videos que lo guiarán por el proceso de crear sitios web o blogs paso a paso. No se necesita ningún conocimiento previo ya que el curso empieza desde cero. Es un curso completo donde usted encontrará toda la información necesaria.</p><p>El curso es de aprender y actuar, todo lo que aprende en las clases lo debería aplicar ahí mismo en su propio sitio. <strong>Así <em>al final del curso ya tendrá su propio sitio web desarrollado.</em></strong><strong></strong></p><p><strong>Que tipo de sitios web puede crear con este curso?</strong></p><p>En este curso vamos a trabajar con un sistema que se llama ‘WordPress’. Este sistema tiene muchas opciones y extensiones disponibles para personalizar el sitio a su propio gusto. Por esa razón, WordPress le permite crear <strong><em>cualquier tipo de sitio web</em></strong> – puede ser un blog, sitios de negocios, portafolios, tienda en línea etc.</p><p><strong>Cuanto tiempo se tardará en completar el curso?</strong></p><p>La duración total del curso es de menos de 2 horas. El tiempo necesario para completarlo depende de cada persona y el proyecto que tiene pero le recomendamos aplicar todo lo que aprende ahí mismo en su propio sitio para qué al final del curso ya tenga su propio sitio web desarrollado. <br></p><p><strong>Por qué apuntarse a este curso?</strong></p><p>Es un curso muy completo dónde se encuentra toda la información necesaria para crear sitios web de manera fácil y eficaz sin complicarse la vida. Al principio del curso también lo guiaremos \bpor la compra del hosting y dominio para que el sitio sea 100% suyo y para que tenga todas las opciones para personalizarlo a su propio gusto. </p><p>L<strong></strong>a habilidad que va a adquirir durante este curso <strong><em>le servirá el resto de su vida</em></strong>. </p>", 
    "end_date": null, 
    "title": "Crea tu Primer Sitio Web con Wordpress de manera Fácil", 
    "price": "20.00", 
    "instructors": "Leonardo Klemans", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/627966_91a4_3.jpg", 
    "course_url": "https://www.udemy.com/crea-tu-primer-sitio-web/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T13:47:02Z"
}