{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Pasaremos un archivo PSD a HTML5 utilizando el editor Brackets y su poderoso componente Extract para agilizar el trabajo y el tiempo de entrega.</p>\n\n<p>Requisitos para seguir el curso a la perfección:</p>\n\n\n\n\n\n\n\n\n\n<p>Tener un amplio conocimiento del lenguaje de marcado html5, saber como aplicar estilos, con los diferentes selectores de CSS, conocer la sintaxis básica de Javascript, y saber como utilizar la librería de jQuery, todo esto de un 40 a 60% del conocimiento.<br><br>En caso de no tener noción o conocimiento por debajo del 20% de estos lenguajes.</p>\n\n\n\n\n\n\n\n<p>Te invito a que mires, analices y te inscribas en mi otro curso, el cual detallo paso a paso, los múltiples de lenguajes de programación como Html5, Css3, Javascript, jQuery, PHP, MySQL, WORDPRESS, donde crearemos plataformas con PHP, MySQL, jQuery, con diferentes tipos de roles, les dejo el enlace para que lo vean y puedan mirar el itinerario, más de 370 clases y 91 horas de puro conocimiento y ejercicios. también tiene incluido este curso de PSD a html5 con bootstrap 4.</p>\n\n\n\n\n\n\n\n\n\n<p>Enlace del curso: Visita mi perfil, y allí encontraras el curso llamado \"Desarrollo web desde cero paso a paso\".</p>\n\n\n\n\n\n\n\n<p>Así que te invito a que te analices y mires que curso es el que necesitas. para tu proceso de aprendizaje y desarrollo en este grandioso mundo de la programación.</p>\n\n\n\n\n\n\n\n\n\n<p>Te espero!</p>", 
    "end_date": null, 
    "title": "Creando Sitio web desde cero (DE PSD a HTML5, Bootstrap 4)", 
    "price": "20.00", 
    "instructors": "Gilbert Rodríguez", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/836518_e73a.jpg", 
    "course_url": "https://www.udemy.com/creando-sitio-web-desde-cero-de-psd-a-html5-bootstrap-4/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-01T05:36:45Z"
}