{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Wishlist Member is a Wordpress plugin that makes it easy for you to create a fully functioning membership site.  A membership site is one that allows your visitors to subscribe (for free or a paid subscription) to access your content.<br style=\"\"></p><p>Membership sites offer you a great way to make an online income.  Either charge a one-off payment for access to your content, or charge a recurring monthly or annual fee.  The choice is yours.  Add in a forum and you have a community of people, all interested in your content.</p><p>If you would like to create a membership site, then this course will show you how.  I&#039;ve been using Wishlist Member since 2011, and in this course, I&#039;ll use all of that experience to teach you how to use this plugin to setup a membership site.  </p><p><strong style=\"\">In the course I&#039;ll plan out a demonstration membership site, and then you get to watch over-my-shoulder as I build the membership site from scratch.</strong><br style=\"\"></p><p>In this course you will learn:</p><ul style=\"\"><li style=\"\">What membership sites are, and why they are a good way to make an income online.</li><li style=\"\">How to plan out your membership site.</li><li style=\"\">How to install and configure Wishlist Member.</li><li style=\"\">How to create content and then protect it so that only those members who should have access, actually do.  You will learn a few different ways to protect your content.</li><li style=\"\">How to show a teasers to non-members to encourage them to subscribe.</li><li style=\"\">How to use shortcodes to personalize your member content.</li><li style=\"\">How to use Mergecodes for additional control over content protection.</li><li style=\"\">How to create multiple levels within your membership site, so you can effectively run multiple courses from a single Wishlist installation.</li><li style=\"\">Customizing the experience for multiple membership levels, so each member feels special.</li><li style=\"\">How to setup drip-fed (sequential) content so that you control how quickly members get access to various content.</li><li style=\"\">How to integrate Paypal and/or Clickbank to take payments from your members.</li><li style=\"\">How to integrate a forum into your member area using a free Wordpress plugin.  A forum can help you build a community on your site.  When people feel like part of a community, they are more likely to stick around.</li></ul><p><strong style=\"\">Course Requirements</strong></p><ol style=\"\"><li style=\"\">A basic understanding of Wordpress (how to create posts and pages).</li><li style=\"\">Wishlist Member plugin.</li></ol><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Create a Membership Site with Wishlist Member & Wordpress", 
    "price": "20.00", 
    "instructors": "Andrew Williams", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455680_f01e_4.jpg", 
    "course_url": "https://www.udemy.com/create-a-membership-site-with-wishlist-member/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T12:29:37Z"
}