{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This step-by-step course will teach you how to <strong>create </strong>your <strong class=\"redactor-inline-converted\">own plugin</strong> for <strong class=\"redactor-inline-converted\">WordPress </strong>. When you are finished with the course you will know how to create a fully functional Plugin that is created with <strong class=\"redactor-inline-converted\">PHP</strong>, HTML, CSS and <strong>AJAX </strong>and uses data we get from the New York Times using an <strong class=\"redactor-inline-converted\">API</strong>!</p>\n\n<p>Over 2 hours of video in which you will learn everything you need to know to get you started with creating plugins. I will tot only teach how to create a plugin but also what to do and what not to do. But there is more. We are working with an Application Programming Interface (API). With that API we fetch real time data from the New York Times and show that on our website. With the techniques you learn, you can build your own plugin, with an admin page, front-end widget or shortcodes. You can even get data from other API's out there, like Twitter or Facebook. I know the whole idea of creating a plugin can be overwhelming, do do not hesitate to contact me, i will make sure I guide you and help you. If you are not pleased with the content, you can ask for a <strong class=\"redactor-inline-converted\">100% refund</strong>, no questions asked.<br></p>\n\n\n\n<p>For this course you will need a basic understanding of HTML, CSS and PHP. This course will not teach you how to write PHP but how to create a WordPress plugin with PHP. </p>", 
    "end_date": null, 
    "title": "Create WordPress Plugins", 
    "price": "20.00", 
    "instructors": "Patrick Gerrits", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792703_a918_2.jpg", 
    "course_url": "https://www.udemy.com/create-wordpress-plugins/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T18:38:31Z"
}