{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Now you can create your own coupon website and share your affiliate links, discount codes, activation links, etc. If you're part of multiple affiliate programs, this is the perfect course for you because it will show you how to build a complete website where others can also promote their affiliate links.</p><p>Main features</p><p><strong>Front-end:</strong></p><ul><li>Support Bootstrap 2 and Bootstrap 3.</li><li>Menu item for listing all coupons, coupons in specific categories.</li><li>Menu item for listing all categories and merchants in them.</li><li>Menu item for listing all merchants.</li><li>Menu item for search page.</li><li>Coupons from featured merchants or featured coupons can be displayed on the top of coupon list.</li><li>Merchant's management area, where merchant edits profile and manages coupons.</li><li>Integrate with Akeeba Subscription, only active merchant can access \nmanagement area, when merchant's subscription expires his/her account is\n deactivated so he/she can't access this area any more, unless he/she \nextends the subscription in Akeeba Subscription.</li><li>Merchant can upload his/her own logo image.</li><li>Merchant can create, edit and delete his/her own coupons.</li><li>Registration form for user to sign up as a merchant.</li><li>Facebook, Twitter and Google+ sharing for coupon and merchant.</li><li>Coupon detail page.</li><li>Support Joomla!'s access control. Coupon can be configured to \navailable to a specific user group, this give you ability to deliver \nspecial coupons to special users, for example, users who pay for monthly\n fee to have access to special offers.</li><li>Merchant registration settings inherit from Users component's settings.</li><li>Merchant logo upload settings inherit from Media component's settings.</li><li>User feedback for working coupon and not working coupon.</li><li>Ask user for how much user saves (for example $50, 10€) and what user purchases if coupon works.</li><li>Ask user for the reason why coupon doesn't work.</li><li>User can post comment for coupon.</li><li>Print coupon or download coupon image (for printable coupon only).</li></ul><p><strong>Back-end:</strong></p><ul><li>Manage category, merchant, coupon.</li><li>Manage where coupon images and logo images are stored.</li><li>Enable or disable Facebook, Twitter and Google+ buttons.</li><li>Enable or disable coupon detail page.</li><li>Control where users can get offers, in coupon listing page or in coupon detail page.</li><li>Manage users's votes.</li><li>Manage users's comments.</li><li>Ability to setup custom reasons for not working coupons.</li><li>Ability to setup currencies for asking how much user saves.</li></ul>", 
    "end_date": null, 
    "title": "Create a Coupon Website To Promote Your Affiliate Products", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/643130_317b_2.jpg", 
    "course_url": "https://www.udemy.com/create-a-coupon-website-to-promote-your-affiliate-products-with-joomla/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-17T07:10:36Z"
}