{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">CREATING YOUR OWN WEBSITE IS RIDICULOUSLY EASY!</strong>  </p>  <p style=\"\">  \t    Want to create your own website but have no idea where to actually start? This course will take you through, step-by-step, the entire process of creating your website. From the fundamental aspects of your back end, to your final product and design, upon completion of this course you will know exactly what it is you need to do in order to take your business to a new level online.  </p>  <p style=\"\">  \t<strong style=\"\">  What you&#039;ll get with the course:  </strong>  </p>  <ul style=\"\">  \t<li style=\"\">7 Lectures covering every step involved in creating your own site.</li>  \t<li style=\"\">A Free Report - &quot;The 7 Most Common Fatal Mistakes Made By Budding Online Startups Just Like You&quot;</li>  \t<li style=\"\">A printable checklist - takes you through every step you need to do in order to get your site online.</li>  \t<li style=\"\">A Resources report on the different options for web hosting providers and the benefits of each.</li>  \t<li style=\"\">These materials are provided with Lecture 2.</li>  </ul>  <p style=\"\">  \t        The course goes through a method that involves simple, quick, cheap, effective steps that will let you create your online presence. Using a platform called WordPress, I will teach you how to create a website that can be used as a blog, online store or simply an information site.  </p>  <p style=\"\">  \t<strong style=\"\">BUT I HAVEN&#039;T GOT ANY EXPERIENCE...</strong>  </p>  <p style=\"\">  \t        You do not need any prior experience or knowledge about this subject, the course is fully comprehensive and explanatory. There is no coding required.  </p>  <p style=\"\">  \t        I will provide you with the tools you need to be successful online. All you will need is your computer, a passion for your business and a willingness to learn. The course is structured in an easy, step-by-step approach and will allow you to complete the necessary steps between each lecture.  </p>  <p style=\"\">  \t        It is so unnecessary to pay thousands of dollars for a website to be made. I can create a website from scratch with only $60, and you can too.  </p>  <p style=\"\">  \t        Don&#039;t let some random freelance web developer make your business site. If you&#039;re like me, you&#039;ll want to have control over every aspect of your development and design process, and love learning the background behind certain processes. If so, this is the perfect course for you.  </p>  <p style=\"\">  \t      The course also includes a Free Report &quot;The 7 Most Common Fatal Mistakes Made by Budding Online Startups Just Like You&quot;.  </p>  <p style=\"\">  \t        I only wish there was a course like this when I created my first website.  </p>", 
    "end_date": null, 
    "title": "Create Your Own Website From Scratch using WordPress", 
    "price": "45.00", 
    "instructors": "Evan Dowsett", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295291_1463_3.jpg", 
    "course_url": "https://www.udemy.com/create-your-own-website-from-scratch-using-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-06T15:31:04Z"
}