{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Excellent Course!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">&quot;Everything that you have to know about how to create a web site in a simple and easy way&quot; 5 Star from <span style=\"\">Ricardo Celis</span></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Awesome course for the newbie!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">This is an excellent course for anyone with no prior knowledge. Khalid walks the beginner step by step through the process. Once you complete this course, you will have a beautiful site and business ready to roll! 5 Stars from <span style=\"\">Mindy Squillace </span></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><span style=\"\">and many more..</span></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Course Published: January, 2015</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Last Updated: January, 2015</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Did you ever create a website? If NO then this is the best course for you. </strong>  </p>  <p style=\"\">  \t            As the name suggests, this course is all about how to create websites. There is a <strong style=\"\">small </strong>difference in this course than other courses that you see. This is a practical course. I am doing everything live in this course for you. From buying a domain to managing a hosting account, from setting up scripts to modifying tools, you will learn everything here in a live project with me.  </p>  <p style=\"\">  \t<strong style=\"\">Note: I will cover both the free methods and the paid (original) methods of creating a website so if you don&#039;t want to invest in hosting, you don&#039;t have to. </strong>  </p>  <p style=\"\">  \t<strong style=\"\">What Will Be Your Benefit:</strong>  </p>  <p style=\"\">  \t            I can guaranty that after you finish this course, you will be able to create websites on any niche you want without anyone&#039;s help. From eCommerce to the President&#039;s website, you will be able to create everything if you finish this course.  </p>  <p style=\"\">  \t<strong style=\"\">What are Your Added Benefits:</strong>  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\"></strong>You will learn how to earn with your website from Internet (A Full Guide on Setting Up Advertisements)</li>  \t<li style=\"\">You will learn how to work as a freelance Web Developer (A Full Guide on setting up and finding jobs on web development niche)</li>  \t<li style=\"\">You can even start your web development business after you are done with this course. </li>  </ol>  <p style=\"\">  \t<strong style=\"\">How Long Will It Take To Complete This Course? </strong>  </p>  <p style=\"\">  \t            It should not take more than 1-2 weeks to complete this course. I am describing everything in the easiest possible way for you and if you do things with me, there is no way that you will take more than 2 weeks to finish this course.  </p>  <p style=\"\">  \t            This is a pure video based course. I explained everything via video.  </p>  <p style=\"\">  \t            Finally, the last question: <strong style=\"\">Why should you take this course? </strong>  </p>  <p style=\"\">  \t<strong style=\"\">You should take this course for these reasons: </strong>  </p>  <ul style=\"\">  \t<li style=\"\">First of all, you will learn how to create and operate websites. The whole process. </li>  \t<li style=\"\"><strong style=\"\"></strong>You will be able to start your career as a freelance web developer (WordPress) if you take this course</li>  \t<li style=\"\">You will be able to create websites on any niche you want. May be you can start a web-development company in your country finishing this course</li>  \t<li style=\"\">You can easily find jobs on this niche as web developers are always demanded by different companies. </li>  </ul>  <p style=\"\">  \t<strong style=\"\">Billions of websites are created everyday and the world is getting more and more digital in every second. Be a part of this journey. Learn how to be a part of this journey with me. You will not regret it. </strong>  </p>", 
    "end_date": null, 
    "title": "Create a Professional Website Without Programming/Coding", 
    "price": "20.00", 
    "instructors": "Khalid Farhan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374590_bfb3_3.jpg", 
    "course_url": "https://www.udemy.com/create-professional-websites/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T18:42:05Z"
}