{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "  <p>  \t<strong>OVER 340 SUCCESSFUL STUDENTS HAVE LEARNED HOW TO CREATE A FORUM WITH THIS COURSE!</strong>  </p>  <p>  \t<strong>The Power Of a Forum</strong>  \t  \t                     Forums are some of the MOST POPULAR methods people use to drive traffic online. People spent a ton of time on forums looking for answer or to get help with something.  \t  \t<strong>Seize The Opportunity</strong>  \t                     This courses teaches you step by step how to create your own forum without coding. After completing this course, you will be able to create a forum fast and easy. You can create the forum for your clients or monetize it by selling ad space....the choice is yours!  </p>  <p>  \t               Here some of the AMAZING things you'll learn in this course:  \t  \t<strong>      WYSIWYG Editor</strong>  \t             Compose your questions or post replies with the built-in text editors, TinyMCE, JCE Editor, RedactorJS and many more! Add some fun into your text with BBCodes, too.  \t  \t<strong>  Remote Publishing</strong>  \t                 Even if you are away from your computer, you can still post by emailing to a pre-defined email address in your forum where it fetches your posts from the mailbox and automatically post in the discussions for you.  \t  \t<strong>  Attachments</strong>  \t                 Make your posts interesting by inserting images, PDFs and videos into discussions. It will also make reading posts easily understood.  \t  \t<strong>  Favorite Posts</strong>  \t                 You can keep the best posts above the rest by setting them into favorites. It works like a bookmark for posts.  \t  \t<strong>  Code Syntax</strong>  \t                 Advanced users can customize posts by adding in special codes into the discussions.  \t  \t<strong>  URL Tagging</strong>  \t                 You can attach URLs that are relevant to the forum to better cross-refer your posts.  \t  \t<strong>Tagging</strong>  \t                 Tag your discussions with relevant keywords for future reference and easy searchability.  \t  \t<strong>  Location Services</strong>  \t                 Share and tag the location of your discussions with images of maps, powered by Google Maps.  \t  \t<strong>  User Roles</strong>  \t                 Assign users to a specific group and limit what they can see or do.  \t  \t<strong>  Badges &amp; Points</strong>  \t                 Award user badges and points based on their interaction and involvement in the forum.  </p>  <p>  \t  \t<strong>What's Next?</strong>  \t                     Click \"take this course\" button, top right, now...that's it!  </p>", 
    "end_date": null, 
    "title": "Create a Forum Website That Will Help People Find Answers", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107768_71e2_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-membership-forum-website-with-joomla/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-19T04:18:24Z"
}