{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Thanks for landing here, it's so great to see you! My name is Alex and I'm going to help you get on the internet.</p><p>Websites can be expensive to have made. Cutting costs is a primary goal of any business. The less money you need to spend, the more money you have. A website can cost a lot of money for some businesses, ranging hundreds to thousands of dollars and more. I'm here to save you that money. Whether you are a business or someone who just wants a website.<br></p><p><strong>Create a FREE website in under 30 minutes with hosting and a domain</strong><br></p><p>The requirements for this course have never been easier! All you need is a computer and the internet, and it won't take more than 30 minutes of your time.</p><ul><li>In this course you will learn right from signing up for your own hosting to installing web platform Wordpress on your hosting, then building your website using Wordpress. And finally finish off with forwarding a free domain to your site.</li><li>The course is structured as follow along computer screen lectures. So you might find it easiest to have two windows open and follow me along as you are creating your website.</li></ul><p>Your website is an important part of your business, and I'm going to make sure you get online.<br></p><p>Join me and let's get you or your idea on the internet!</p>", 
    "end_date": null, 
    "title": "Create a Website with Free Hosting and Domain in 30 Minutes", 
    "price": "20.00", 
    "instructors": "Alex Canton", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741910_df57_2.jpg", 
    "course_url": "https://www.udemy.com/create-a-website-with-free-hosting-and-domain-in-30-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T07:22:32Z"
}