{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">New to self publishing and need an author website?</strong>  </p>  <p style=\"\">  \t   This course will walk you step-by-step, through the details of creating a complete, professional, <em style=\"\">responsive </em>website and it&#039;s a LOT easier than you might think.  </p>  <p style=\"\">  \t You will learn how to:  </p>  <ul style=\"\">  \t<li style=\"\">Set up your webserver / hosting site</li>  \t<li style=\"\">Set up your Wordpress installation</li>  \t<li style=\"\">Operate the &quot;backend&quot; of your new website</li>  \t<li style=\"\">Create the page framework necessary for your site</li>  \t<li style=\"\">Setup basic options for a professional installation</li>  \t<li style=\"\">Install new responsive website themes to change the look and feel of the site</li>  \t<li style=\"\">Customize themes to suit your needs</li>  \t<li style=\"\">Create your site content and post blog entries</li>  \t<li style=\"\">Build a beautiful sliding home page banner to showcase your book(s)</li>  \t<li style=\"\">Upload your own graphics</li>  \t<li style=\"\">Create a secure contact form</li>  \t<li style=\"\">Create an email signup form</li>  </ul>  <p style=\"\">  \t   You <em style=\"\">can</em> create a really nice site with very little effort and even less money!  I have created dozens of websites on many platforms and have created this course to teach to independent authors, like myself, the most <em style=\"\">effective</em> method of creating a great author website.  </p>  <p style=\"\">  \t In over ten years of web development I have found WordPress to be the most powerful and easy-to-use platform out there and it is continually getting better with each update.  </p>  <p style=\"\">  \t   Whether you want a blog that you can post articles to directly from your iPhone or Android, or if you want just a static informational website, this course will cover it.  We&#039;ll discuss what kind of content you should provide, as an author and how best to provide it.  I&#039;ll give you a simple way to collect email addresses of your fans so that you can contact them with future news.  </p>  <p style=\"\">  \t   I hope you enjoy the course - please contact me with any questions!  </p>  <p style=\"\">  \t   Tim Johnson  </p>  <p style=\"\">  \t P.S. - I&#039;ve also included a great electronic text book to help you leverage your list of email subscribers most effectively.  </p>", 
    "end_date": null, 
    "title": "Create a Responsive Author Website with NO Prior Experience", 
    "price": "20.00", 
    "instructors": "Tim Johnson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235636_81cc_5.jpg", 
    "course_url": "https://www.udemy.com/create-an-author-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T15:23:46Z"
}