{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t      Un semplice corso per imparare step by step ad<strong> installare WordPress</strong> ed utilizzarlo al meglio per creare un sito web per la tua attività. Nessuna paura anche se non sei un mago del pc con questo corso potrai iniziare a creare il tuo sito o blog in soli 30 minuti!  </p>  <p>  \t    Non sono necessarie conoscenze pregresse ed il corso è accessibile per tutti, basta avere un computer ed una connessione ad internet oltre alla voglia di imparare!  </p>  <p>  \t    Partiremo da vedere cos&#039;è un CMS e cos&#039;è WordPress in lezioni passo passo il cui obiettivo è guidarvi a FARE.  </p>  <p>  \t  Il secondo passo sarà scaricare ed installare WordPress su un server, creando il database e connettendolo.  </p>  <p>  \t  Passeremo quindi a creare pagine articoli e menù dopo aver scelto un tema adeguato alle esigenze e gusti.  </p>  <p>  \t  In poco sarà possibile creare il proprio sito ed iniziare a gestirlo, questo corso si rivolge soprattutto a chi inizia e non ha esperienza con i CMS ma vuole con facilità e poco tempo creare il proprio sito web o blog.  </p>  <p>  \tIl motivo per cui questo corso è stato realizzato è legato al fatto che molte persone vogliono iniziare a installare WordPress (o altri CMS come Joomla o Drupal) ma poi si perdono tra la documentazione ufficiale o tra i tecnicismi ed abbandonano la loro idea iniziale. Per evitare il dropout è necessario un corso che, come questo, spieghi tutto con calma mostrando come fare passo passo.  </p>  <p>  \tL’obiettivo non è quello di formare dei perfetti Webdesigner ma di dare l’opportunità di entrare nel mondo di WordPress provando e testando con un approccio basato sull’azione e non sulla sola teoria.  </p>  <p>  \tAlla fine del corso lo studente avrà installato WordPress e sarà in possesso delle nozioni di base che poi potrà approfondire documentandosi autonomamente, avendo acquisito la conoscenza di base indispensabile per iniziare.  </p>", 
    "end_date": null, 
    "title": "Creare un sito WordPress partendo da zero", 
    "price": 0, 
    "instructors": "Matteo Medugno", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327474_3c5a_2.jpg", 
    "course_url": "https://www.udemy.com/creare-un-sito-wordpress-in-30-minuti/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-26T10:24:19Z"
}