{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Do you have images you want to showcase on your website in a clean, responsive and attractive way but just don&#039;t know how to? Now you can! This course teaches you how to create stunning showcases to share your images with the world.</p><p>Images play a major role in how users interact with your website. The way you present images on your website will determine if people stay or leave. It&#039;s important that create something that allows you to upload unlimited images just by dragging and dropping in a professional way.</p><p><strong style=\"\">Features:</strong></p><strong style=\"\"> Multiple Image Sources </strong><p>You can choose to show images from multiple sources</p><strong style=\"\"> Multiple Gallery Themes </strong><p>JSN ImageShow allows you to use various themes for the gallery</p><strong style=\"\"> Multiple Presentation </strong><p>Show image gallery by all means available in Joomla! components, modules and plugins, multiple galleries on single page</p><strong style=\"\"> Drag-n-Drop Management </strong><p>You can choose desired images from the album then drag them into the showlist</p><strong style=\"\"> Mobile Ready </strong><p>Special built-in responsive gallery optimized for modern mobile devices iPhone, iPad, Android and Windows mobile-based</p><strong style=\"\"> Joomla! 3.x Support </strong><p>JSN ImageShow is now compatible with Joomla! 3.x</p><p>You can also import images from multiple social platforms including:</p> <ul style=\"\"><li>Facebook</li><li>Instagram</li><li>Joom Gallery</li><li>Phoca Gallery</li><li>ImageShack</li><li>Picasa</li><li>Flickr</li></ul> <p>So if you want to make your images more appealing and interesting, this course will show you how to do that.</p>", 
    "end_date": null, 
    "title": "Create Stunning Website Slideshows with JSN Imageshow", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616386_62b4_4.jpg", 
    "course_url": "https://www.udemy.com/create-stunning-website-slideshows-with-jsn-image-show/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T04:21:14Z"
}