{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t        Charge your clients <strong>more money</strong> by being able to create a WordPress website exactly to their requirements.  </p>  <p>  \t        This Responsive Website Design course will enable you to create a Responsive Website for a business using the Genesis theme framework on the WordPress platform.  </p>  <p>  \t        WordPress is the most ubiquitous CMS (Content Management System) on the internet today. It provides you with a fairly well-optimised web system. However, combining WordPress with the premium Genesis theme ensures an entirely future-proof, perfectly optimized and responsive web design.  </p>    <p>  \t        After you have finished the Responsive Website Design course you will have learned how to:  </p>  <p>  \t        ·  Layout a website visual in Photoshop and present it to your client  </p>  <p>  \t        ·  Install WordPress locally on your computer to ensure faster development  </p>  <p>  \t        ·  Set up a website using WordPress on a host's server  </p>  <p>  \t        ·  Upload a local site to a remote site  </p>  <p>  \t        ·  Create an \"Under Construction\" page to display during online development  </p>  <p>  \t        ·  Set up the logo and top navigation menu with drop-downs  </p>  <p>  \t        ·  Set up a blog on it's own separate page  </p>  <p>  \t        ·  Change the website's text, use different fonts and create beautiful web typography  </p>  <p>  \t        ·  Add content and images to the website's pages and the blog's posts  </p>  <p>  \t        ·  Create and style up new sidebar widgets  </p>  <p>  \t        ·  Add social media (Twitter, Facebook, LinkedIn, etc.) profile links and icons  </p>  <p>  \t        ·  Create page templates  </p>  <p>  \t        ·  Add and style a jQuery slider  </p>  <p>  \t        ·  Use CSS media queries to ensure the responsive design of the site works correctly on all browsers and all possible devices (phones, iPods, iPads, tablets, laptops, etc.)  </p>  <p>  \t        ·  Design and layout a blog archive page with featured image thumbnails  </p>  <p>  \t        ·  Create a contact page with a contact form  </p>  <p>  \t        ·  Create an email subscription list and sidebar form with incentive to join  </p>  <p>  \t        ·  Display a \"favicon\" for your site for the browsers's address bars (as well as for iPod Touch, iPads and iPhones)  </p>  <p>  \t        ·  Plus much more!  </p>  <p>I would say that 35-45% of the course is Genesis-specific so I would advise anyone taking this course to have the Genesis theme framework (which is only $59.99).<br></p>  <p>  \t        This Responsive Website Design course is ideal for anyone wishing to create a website. I have gone into everything in great detail so there's no need to worry if you have very little knowledge of WordPress, HTML, CSS and/or PHP. Similarly, if you are already a web designer this course will teach you How to Make a Responsive Website by digging into the theme's code to enable you to get a WordPress site looking and acting exactly how you want it to.  </p>  <p>  \t        The course would be particularly useful for people who wish to run their own web design business as you would be able to charge four-figure fees for creating a bespoke business website like this.  </p>", 
    "end_date": null, 
    "title": "Creating a Business Website with a Responsive Design", 
    "price": "30.00", 
    "instructors": "Rob Cubbon", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41356_eba6_9.jpg", 
    "course_url": "https://www.udemy.com/creating-a-business-website-with-a-responsive-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-12T17:49:07Z"
}