{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Amazon is one of the most successful websites in the world; it's also the #6 website most popular website in the world. Amazon generated $29 billion dollars in 2014 with a net profit of $240 million dollars! That's a ton of money. There are several reasons why Amazon is so successful but one of the reason why they're so successful is because they allow anyone to sell or buy products on their website.</p><p>This course teaches you step by step instructions on how you too, can build your empire just like Jeff Bezo (Amazon founder). You don't have to be a coder and won't be writing any codes in this course. You'll see how simple and easy it is for anyone to launch their own successful multi vendor store that allows anyone to sell their product(s) directly on your website.</p><p>Here are some of the amazing features your store will have:</p><p><strong>Multi Store Support</strong></p><p>\t\t\t\t\t\t\tA seller/vendor can create more than 1 stores on the site. Admin can control the number of stores a seller/vendor can create by setting a limit on them. For example, the same Vendor can have a Flower Store as well as a Clothing store on your site.</p><p><strong>Tax Configuration</strong></p><p>\t\t\t\t\t\t\tTaxation being one of the most important factors while purchasing a product, special attention has been given to this feature to make it up to the mark. Zones can be created  to group the countries and regions with similar taxation rules. Taxation profiles can be created to club multiple taxes charged on a product. Making this a perfect taxation feature.</p><p><strong>Shipping Configuration</strong></p><p>\t\t\t\t\t\t\tWhen it comes to online shopping shipping plays a key role in it. Shipping for both single and multi-vendor modes. Setting up zones is mandatory. Shipping methods can be selected based on the shipping provider. Creating shipping profiles to combine multiple shipping methods making it easier for the store owner keep a track.</p><p><strong>Optional Shipping</strong></p><p>Don’t need Shipping for your products? Just disable it in the backend! As simple as that!</p><p><strong>Support For Multiple Payment Gateways</strong></p><ul><li>2Checkout</li><li>Alpha User Points</li><li>Authorizenet</li><li>JomSocial Points</li><li>EasySocial Points</li><li>Linkpoint</li><li>Pay By Check</li><li>Pay By Purchase Order</li><li>Paypal</li><li>Paypal - Adaptive Payment</li><li>Payu India (Credit Card/Debit Card/Net Banking)</li></ul><p><strong>Automate Payouts in your Marketplace with Paypal Adaptive Payments Support</strong></p><p>Quick2Cart features \nPaypal Adaptive payments integration which takes the pain of having to \ndo manual payouts out of the equation. With Adaptive payments, the fees \nand the vendor payment is instantly split when the buyer makes the \npayment.</p><p><strong>Multiple Product Attributes</strong></p><p>Define any number of \nproduct attributes with positive/negative price impact. Get greater \nflexibility in defining products. Eg : Size, Color, Storage Capacity \netc. </p><p><strong>Stock Management</strong></p><p>- Ability to specify in stock quantities for products and automatically subtract quantities on successful sales.<br>\n- Out of stock shipping support optionally lets you buy a product in an out of stock situation.</p><p><strong>Minimum and Maximum Order Quantity</strong></p><p>\t\t\t\t\t\t\tThe user can control the quantities per product by optionally setting minimum and maximum order quantities per product.</p><p>If you've always wanted to build your own multi vendor store, this course teaches you step by step how to do that.</p>", 
    "end_date": null, 
    "title": "Create a Multivendor Marketplace Website Like Amazon", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631970_be32_3.jpg", 
    "course_url": "https://www.udemy.com/create-a-buy-and-sell-website-like-amazon-with-joomla/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T03:32:50Z"
}