{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t    Charge your clients <strong style=\"\">much more money</strong> by creating a WordPress website exactly to their requirements.  </p>  <p style=\"\">  \t        Create a custom responsive WordPress website for a client using the Genesis theme framework on the WordPress platform.  </p>  <p style=\"\">  \t           WordPress provides you with a fairly well-optimised web system. However, combining WordPress with the premium Genesis theme ($59.95) ensures an entirely future-proof, perfectly optimized and responsive web design with the latest CSS3 and HTML5 with Schema mark-up.  </p>  <p style=\"\">  \t  The course shows you everything – from the basics to fairly advanced HTML and CSS tweaking of the child theme.  </p>  <p style=\"\">  \t           After you have finished this course you will have learned how to:  </p>  <p style=\"\">  \t           ·  Set up a WordPress website on a host&#039;s server (both the manual and &quot;one-click&quot; methods)  </p>  <p style=\"\">  \t           ·  Create a custom &quot;Under Construction&quot; page to display during online development  </p>  <p style=\"\">  \t           ·  Set up the logo and top navigation menu with drop-downs  </p>  <p style=\"\">  \t           ·  Set up a blog on it&#039;s own separate page  </p>  <p style=\"\">  \t           ·  Set up social media profile link widgets and understand widgets in general  </p>  <p style=\"\">  \t           ·  Add content and images to the website&#039;s pages and the blog posts  </p>  <p style=\"\">  \t           ·  Create and style up new sidebar widgets  </p>  <p style=\"\">  \t           ·  Two ways of adding and editing an image slider with overlaid text  </p>  <p style=\"\">  \t           ·  Use CSS media queries to ensure the site displays correctly on all browsers and all possible devices (phones, iPods, iPads, tablets, laptops, etc.) – completely understand responsive design  </p>  <p style=\"\">  \t           ·  Create a contact page with a contact form  </p>  <p style=\"\">  \t           ·  Create an email subscription list and sidebar form with incentive to join – the most important tactic of internet marketing  </p>  <p style=\"\">  \t           ·  Display a &quot;favicon&quot; for your site for the browsers&#039;s address bars (as well as for iPod Touch, iPads and iPhones)  </p>  <p style=\"\">  \t           ·  Display a higher resolution logo for retina screens  </p>  <p style=\"\">  \t           ·  Plus much more!  </p>  <p style=\"\">  \t      I would advise anyone taking this course to have the Genesis theme framework although it isn&#039;t 100% necessary.  </p>  <p style=\"\">  \t           This course is ideal for anyone wishing to create a website for themselves or other businesses – for which you could charge $3000+. I have gone into everything in great detail so there&#039;s no need to worry if you have very little knowledge of WordPress, HTML, CSS and/or PHP.  </p>  <p style=\"\">  \t           The course would be particularly useful for people who wish to run their own web design business as you would be able to charge four-figure fees for creating a bespoke website like this.  </p>", 
    "end_date": null, 
    "title": "Create A Custom Responsive WordPress Website For A Client", 
    "price": "30.00", 
    "instructors": "Rob Cubbon", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/159760_2167_3.jpg", 
    "course_url": "https://www.udemy.com/create-custom-responsive-wordpress-website-client/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-07T13:02:37Z"
}