{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>NEW course Nov. 2015!</p><p>HTML is the core of the internet, knowing how HTML works is essential to understanding how to add content online.   CSS positions and controls the HTML making it stand out.<br></p><p><strong>Learn to create your own website from scratch in 1 hour!!!</strong></p><p><strong>Perfect for anyone who wants to understand how to use HTML and CSS.  We create a website from scratch.  Starting with a blank page we add HTML and CSS to create a complete website.</strong></p><p>This course is designed to be easy to follow along, its encouraged to practice the code being presented through out the course. Resources, source code, and everything you need to learn to make websites is provided. Start with simple HTML structure as we explain how it integrates with CSS.<br></p><p>This step by step course shows you the code you need to know to accomplish making websites.<br></p><p>Learn about web design and its core concepts and much more.....</p><p>We walk you through step by step with detailed explanations of code and more.<br></p><ul><li>quick lessons get right to the point</li><li>fully covered topics with real world examples</li><li>source files downloadable to work along</li><li>challenges and lessons and code samples</li><li>code snippets</li><li>Links to top resources to save time</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li><li>quick response support to students</li><li>regular discussions</li></ul><p>We teach you the latest techniques and tools to use in order to create amazing web content. Everything you need to know is included in this course. Learn at your own pace, lifetime access to this course.</p>", 
    "end_date": null, 
    "title": "Create a Website from Scratch using HTML CSS step by step", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/682484_83a2.jpg", 
    "course_url": "https://www.udemy.com/create-a-website-from-scratch-using-html-css-in-1-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-27T16:05:38Z"
}