{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course is a <strong>free Lite </strong>version of my full course on how to create a beautiful website in WordPress using the premium Divi Theme. If you want to learn more in depth on how to do this or even want the premium theme for free, please check out the final lectures in this course. </p><p>Ever wondering how those beautiful website out there are created? Do all your competitors or fellow business owners use fancy and expensive agency to do that? The answer is no. </p><p>WordPress provides you with all you need to create a stunning business website. Themes are around for many years now but every day more people use these themes. With a theme you get a professional, well supported and fully functional website design with lots of extras. With these theme you can create a professional looking website on your own.</p><p>In this course i will show you how to create a beautiful home page in a very short time. The home page is the most important part of the website, because that is your first impression!</p><p>WordPress is a classical CMS (Content Management System) that has been around for ages. With WordPress you can create a lot more that just a Blog. We can create business pages, online applications and online stores. The big companies in the world start using WordPress. Due to its opensource character and its many extension possibilities you can do almost everything in WordPress. <br></p><p>Themes expand the possibilities of WordPress on the look&amp;feel axis. With a theme you cane customize the look and feel, and most themes offer extra functionality as well. For example contact forms, banners, sliders or other cool looking features for your website. </p><p>Get enrolled today and take advantage of this unique deal. Udemy offers you a 30 day money back guarantee, no questions asked. </p>", 
    "end_date": null, 
    "title": "Create a business website with Wordpress - Lite Edition", 
    "price": 0, 
    "instructors": "Patrick Gerrits", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794704_fa92_2.jpg", 
    "course_url": "https://www.udemy.com/business-website-wordpress-lite/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T13:25:33Z"
}