{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Crea tu propia API RESTful con Lumen 5 desde cero y paso a paso</strong></p><p><strong>¡Este curso posee soporte para las versiones más recienets de Lumen. Lumen 5.1 y 5.2!</strong></p><p>  \t                          En este curso aprende a desarrollar una API RESTful profesional y completamente funcional, usando Lumen, el micro-framework, basado en Laravel.</p><p><strong><em>Lumen </em>es un micro-framework para <em>PHP </em>basado en <em>Laravel</em>. </strong><strong>Uniendo las características más resaltadas de Laravel en una versión mucho más liviana y rápida.</strong></p><p><em><strong></strong></em><em><em><strong>¿Por qué Lumen?</strong></em></em></p><p><em>Lumen </em>posee las mejores características de <em>Laravel </em>en una entrega mucho más <em><strong>liviana </strong></em>y <em><strong>ágil</strong></em>, sin dejar de ser <strong>expresivo, intuitivo, potente</strong> y sobre todo <strong>sencillo</strong>.</p><p>Con <em>Lumen </em>conseguirás que tu API soporte por lo menos mil doscientas (1200) peticiones en un rango de 10 segundo, con 10 peticiones simultáneas en cada uno de esos segundos. Esa gran velocidad lo hace el candidato perfecto para implementar una API RESTful en él.</p><p>Millones de programadores de <em>PHP </em>usan <em>Laravel </em>y todos concuerdan con la increíble facilidad y agilidad que <em>Lumen </em>proporciona para los proyectos web, lo cual incluye <em>APIs RESTful</em> por supuesto, así que <strong>no te quedes atrás.</strong></p><p>En Lumen para PHP se han incluido nuevos conceptos y facilidades, similares a las de Laravel, permitiendo conseguir crear micro-servicios de manera ágil, liviana pero muy potente.</p><p>Durante el curso, aprenderás todo sobre la nueva estructura y los nuevos conceptos.</p>  <p>  \t<strong>Aprenderás esto en Lumen y para tu API RESTful:</strong>  </p>  <ul>  \t<li>Principales diferencias y facilidades de <strong>Lumen </strong>respecto a <strong>Laravel</strong></li><li>Creación de un entorno de desarrollo con <strong>Homestead</strong></li><li>Interacción con las máquinas virtuales de Vagrant</li><li>Configuración de <strong>Homestead </strong>con <strong>Vagrant </strong>y sitios virtuales</li><li>Configuración y uso del editor de código Sublime Text 3</li><li>Uso de <strong>PHP artisan</strong> para creación de código</li>  \t<li><strong>Middlewares </strong>globales y middlewares por rutas</li><li>Creación de <strong>modelos</strong></li><li>Relaciones de <strong>uno a muchos</strong> entre modelos (1:N)</li><li>Relaciones de <strong>muchos a muchos</strong> entre modelos (N:N)</li><li>Tablas intermediarias o <strong>pivote</strong></li>  \t<li>Controladores de peticiones</li>  \t<li>Validación de peticiones</li>  \t<li>Controladores de recursos</li>  \t<li>Controladores <strong>REST</strong></li>  \t<li>Manejo y control de excepciones y errores</li>  \t<li><strong>Migraciones </strong>(creación automática de bases de datos)</li>  \t<li><strong>Seeds </strong>(Inserción automática en bases de datos)</li><li><strong>Factories</strong>, para crear datos de prueba</li><li>Creación de un servidor de <strong>OAuth 2</strong></li><li>Generación de <strong>access_token</strong></li><li>Protección de recursos con <strong>access token</strong></li><li>Restricción de acceso por medio de access token</li><li>Optimización del framework para producción</li><li>Interacción con la base de datos por medio de <strong>Eloquent</strong></li><li>Mucho, mucho más.</li>  </ul>  <p>Durante el curso crearás una  <em>API RESTful desde cero</em>, siguiendo la arquitectura <em>REST </em>y la construcción adecuada de URLs para identificar acciones y recursos usando los controladores para recursos de Lumen.</p>  <p>  \t              Exprime al máximo las características de tus herramientas de trabajo (<em>Sublime Text 3, Git shell, Lumen, Composer, PHP artisan</em>) y mejora tu productividad para un desarrollo ágil.  </p>  <p>Aprenderás a desarrollar  un proyecto local en <strong><em>Windows</em> </strong>con <strong>Homestead</strong>, cómo interactuar con la máquina virtual de <strong>Vagrant</strong>, con el sistema oprtativo <strong>Ubuntu </strong>por medio de una conexión <strong>ssh</strong>.<em></em></p>  <p>Verás cómo usar <em>Lumen</em><em> </em>por medio de la consola de <em><strong>PHP artisan</strong></em> para construir de manera muy ágil una <em>API RESTful</em> que responda a métodos de <em>HTTP </em>(<em>GET, POST, PUT, PATCH y DELETE</em>), también a poblar la base de datos y construir su estructura de manera automatizada.</p>  <p>  \t<strong>¡Y no termina ahí!</strong> Tendrás acceso de <em>por vida</em> a las <em>clases adicionales </em>que agregaré constantemente al curso.  </p>  <p>Al finalizar este curso serás capaz de desarrollar tu propia API RESTful con Lumen y PHP de una manera rápida y simple, explotando al máximo las facilidades proporcionadas por este framework para la correcta y adecuada implementación de tus proyectos web</p><p><strong>No esperes más</strong> para ser experto en PHP y RESTful. Únete al curso y nos vemos en clases</p>", 
    "end_date": null, 
    "title": "Crea Veloces APIs RESTful con Lumen y Homestead de Laravel", 
    "price": "20.00", 
    "instructors": "JuanD MeGon", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545634_e233_4.jpg", 
    "course_url": "https://www.udemy.com/api-restful-lumen-homestead-laravel/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T16:09:32Z"
}