{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t Are you still waiting for that perfect technical co-founder to build the product of your dreams? If that’s the case then this course is for you!  </p>  <p style=\"\">  \t My name is Tiago and I welcome you to the “Create and deploy a web app in 3 hours”. At the end of lectures you will have the skill to deploy your Ruby on Rails Application and at the same time drive thousands of users to your website through Facebook Integration<br style=\"\">  \t <br style=\"\">  \t After leaving college with a Computer Science Degree I have worked in a multitude of startups gaining experience in User Interface and Experience Design Growth Hacking and my true north Ruby on Rails.<br style=\"\">  \t Today I have my own web development company where with the help of my team we craft beautiful web applications for other startups and even incubators.<br style=\"\">  \t <br style=\"\">  \t Why should you take this course you ask? First of all a Ruby on Rails Programmer is very hard to find these days and learning the skill through a real life web application is the best way to go.<br style=\"\">  \t <br style=\"\">  \t Second of all in this course the app you’ll be building uses Facebook Connect which is today the easiest and the most popular way of funnelling more users.<br style=\"\">  \t <br style=\"\">  \t Also we’ll be working with Facebook’s Graph API making the sky the limit in regards to your<br style=\"\">  \t creativity.<br style=\"\">  \t <br style=\"\">  \t And last but not least you’ll be able to deploy this app in little more than 3 hours. This is a huge confidence boost and specially important when you want to test the market fast.<br style=\"\">  \t <br style=\"\">  \t As a bonus I’ll be teaching you the latest trends when it comes to design.<br style=\"\">  \t <br style=\"\">  \t We’ll use Bootstrap as a foundation but also applying flat design to make your app look awesome right<br style=\"\">  \t from the start.<br style=\"\">  \t <br style=\"\">  \t With this course you’ll get:<br style=\"\">  \t   * 3 hours of video<br style=\"\">  \t   * An asciicast with all lecture notes <br style=\"\">  \t   * The full repository of your finished app. <br style=\"\">  \t   * And you’ll have my back if you get stuck on<br style=\"\">  \t     anything.<br style=\"\">  \t <br style=\"\">  \t Join me and let’s make a fricking cool website!  </p>", 
    "end_date": null, 
    "title": "Create and Deploy a Web App in 3 Hours", 
    "price": "20.00", 
    "instructors": "Tiago Martins", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/125162_7302_9.jpg", 
    "course_url": "https://www.udemy.com/create-and-deploy-a-web-app-in-3-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-25T16:05:08Z"
}