{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Tutti abbiamo milioni di idee ogni giorno. Il trucco sta nel testarle velocemente senza sprecare risorse.<br></p><p>Una Landing Page ci permette di andare online per testare e validare la nostra idea sul mercato secondo gli approcci Lean Startup.</p><p>Con questo potrai imparare a programmare da zero in modo da creare una landing page efficace ed andare online con il tuo primo sito web in poche ore.</p><p>Inoltre andremo ad applicare i principi base di web design e utilizzare gli strumenti disponibili online per creare un design moderno e aumentare la user experience della tua Landing Page.</p><p>Obiettivo di una Landing Page è quello di ricevere le prime iscrizioni e di attirare traffico sul nostro sito per testare e validare velocemente il problema che stiamo risolvendo con la nostra idea. Per questo motivo in questo corso andremo ad applicare alcunetattiche di marketing per ottimizzare il nostro sito ed iniziare ad attrarre traffico.</p><hr><p>Contenuti del corso:</p><ul><li>Imparare le basi della programmazione HTML</li><li>Utilizzare un template Materialize di Google</li><li>Applicare le basi di CSS per arricchire il design</li><li>Realizzare un sito responsive per essere compatible con cellulari e tablet</li><li>Introduzione a SEO e Metatags</li><li>Integrare APIs</li><li>Applicare Google Analytics per misurare il traffico</li><li>Integrare MailChimp per collezionare email di interesse</li><li>Applicare SumoMe per lo sharing sui social networks</li><li>Utilizzare GitHub come host e andare online</li><li>Integrare TypeForm per validare l'idea</li></ul><hr><p>Perché dovresti fare questo corso?</p><p>Il primo compito di una StartUp è costruire un prodotto che le persone vogliano acquistare. Per questo secondo l'approccio Lean è consigliabile costruire una prima demo di ciò che abbiamo in testa, per aiutare i potenziali clienti a visualizzare la soluzione che vogliamo proporre ai loro problemi e permetterci di orientarci verso ciò che vale davvero la pena sviluppare! Apprendere le basi della programmazione ti permetterà di inseguire tale obiettivo in maniera semplice e divertente.</p><hr><p>Quali requisiti servono per capirne i contenuti?</p><p>Nessuno! Programmare una Landing Page è semplice e permette di apprendere velocemente le basi dei linguaggi di programmazione più in voga. Ti servirà solo avere un qualsiasi tipo di computer (Mac, Windows, Linux...) su cui installare i programmi gratuiti che ti verranno segnalati all'interno delle lezioni.</p><hr><p>Che aspetti dunque? Apprendi le basi del Lean Approach e inizia a trasformare la tua idea in una StartUp!</p>", 
    "end_date": null, 
    "title": "Creare una landing page", 
    "price": 0, 
    "instructors": "Daniele Ugolini", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/584604_f46c.jpg", 
    "course_url": "https://www.udemy.com/creare-una-landing-page/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-16T16:03:34Z"
}