{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Let me get straight to the point!</p><p style=\"\">I've been creating Joomla CMS websites since 2008.  One of the features I wish Joomla had was the ability to create basic or complex websites just by dragging and dropping. Well, now there is a way to create STUNNING websites WITHOUT coding just by dragging and dropping. This is a game change and a must have for non coders who want to create professional and clean websites but just don't have the time to learn HTML, PHP, CSS, and other programming languages.</p><p style=\"\"><strong style=\"\">WHO'S THIS FOR?</strong></p><p style=\"\">Non Coders - If you're not a coder and don't have the time to learn how to code to create professional websites, with this course, you don't EVER have to worry about that. You'll still be able to create better looking websites than some pro's.</p><p style=\"\">Passive Income - Once you see how SIMPLE and EASY it is to create pages, you may decide to start a side gig by creating landing pages or websites for others. The average price for a professional landing page is about $250. However, the most designers take days to create them....until now. You'll learn how to build a top notch landing page in minutes NOT days.</p><p style=\"\">Personal - You can also work on your personal stuff like setting up a landing page for your fishing business, or create a gallery to share your vacation pictures with friends. It's very simple to do, trust me!</p><p style=\"\">Sell Them - You can even decide to create custom landing pages and sell them. If you're a creative person and love to design things, this is a great way for you to create stunning websites or layouts and sell. You can sell your designs for as little or as much as you want...the choice is YOURS!</p><p style=\"\"><strong style=\"\">SO HOW CAN THIS BE DONE?</strong></p><p style=\"\">Using the latest technology, you'll be able drag and drop ANYTHING on to your page. It's yours and you can design it anyway you like.</p><p style=\"\">With 40+ addons to choose from, you'll have EVERYTHING you'll ever need to create any type of website or layout at your finger tips. </p><p style=\"\"><strong style=\"\">HERE ARE JUST A FEW OF THE AWESOME FEATURES:</strong><br style=\"\"></p><p style=\"\"><strong style=\"\">Responsive</strong> - Fully responsive layout that scales to fit any screen size from a narrow smartphone to a large desktop screen.</p><p style=\"\"><strong style=\"\">Highly CustomizaBLE</strong> - Substantial number of unique pages or content element can be built also using it with custom css classes.</p><p style=\"\"><strong style=\"\">Multimedia Integration</strong> - Insert videos from youtube / vimeo and mp3, ogg music files with player inside page layout.</p><p style=\"\"><strong style=\"\">Custom Addons</strong> - Create your own add-ons and easily use inside component to improve list of available features.</p><p style=\"\"><strong style=\"\">Built-in Animations</strong> - Use built-in animated effects (fade, flip, rotate, zoom, bounce), with custom duration and delay for columns.</p><p style=\"\"><strong style=\"\">Open Graph</strong> - Enables any page to become a rich object in a social graph, helping you decide what will be shown on Facebook.</p><p style=\"\"><strong style=\"\">Page Templates</strong> - Built-in templates (About Us, Corporate, Our Team, Pricing Table) in Pro version gives you more functionality.</p><p style=\"\"><strong style=\"\">THE BOTTOM LINE</strong></p><p style=\"\">If you want to save time and money on your website projects, then this course will show you how to do that. Why pay someone else thousands or dollars when you can do it yourself!</p><strong style=\"\">30 DAYS 100% MONEY BACK GUARANTEE:</strong> You can try this course for 30 FULL DAYS and if you don't like it for whatever reason, Udemy will refund your back back...no questions asked. So you have absolutely NOTHING to loose.<p style=\"\"><strong style=\"\">HOW TO SIGN UP</strong><br style=\"\">It's very easy to sign up, just click on the TAKE THIS COURSE button at the top of the screen. Signing up only take a few seconds.</p><br style=\"\">", 
    "end_date": null, 
    "title": "Create Unlimited Website Layouts With SP Page Builder Pro", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600476_6d93_2.jpg", 
    "course_url": "https://www.udemy.com/create-unlimited-website-layouts-with-sp-page-builder-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T14:52:00Z"
}