{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Curso de Diseño Web para principiantes</strong>  </p>  <p style=\"\">  \t¿Te gustaría aprender a crear sitios web pero te sientes un poco asustado o confundido por el código?  </p>  <p style=\"\">  \tPues… ¿Sabes qué?  </p>  <p style=\"\">  \tLas 2 lenguajes más importantes dentro del diseño web, que son HTML y CSS, realmente son muy fáciles de aprender!  </p>  <p style=\"\">  \tSólo necesitas que alguien te lo explique de la forma correcta.  </p>  <p style=\"\">  \t<strong style=\"\">Y allí es donde entro yo.</strong>  </p>  <p style=\"\">  \tMi nombre es Cristian Carrera y diseñador y programador web desde hace mas de 10 años.  </p>  <p style=\"\">  \tTiempo atrás yo era como tú, no tenía idea de código HTML ni CSS...<br style=\"\">  \t Pensaba: &quot;¿Por qué los sitios web tienen que ser construidos con ese código tan complicado!&quot;  </p>  <p style=\"\">  \tComencé a estudiar estos lenguajes y me di cuenta que realmente son muy simples. De verdad!  </p>  <p style=\"\">  \t<strong style=\"\">Por eso me decidí a enseñarlos!</strong>  </p>  <p style=\"\">  \tPienso que la forma más efectiva de aprender cualquier lenguaje de programación es meterse de lleno practicando y practicando. Es por eso que este es un curso teórico/práctico.  </p>  <p style=\"\">  \tEn este curso te guiaré paso a paso para ayudarte a que pases de ser un principiante a un diseñador de páginas web con todas las herramientas necesarias para comenzar la codificación de sus propios sitios web, ya sea personales o profesionales.  </p>  <p style=\"\">  \t<strong style=\"\">No se requiere experiencia</strong>  </p>  <p style=\"\">  \tA lo largo del curso, vamos a construir una página web de forma profesional maquetando en HTML y CSS, partiendo de un diseño en formato PSD.  </p>  <p style=\"\">  \t<strong style=\"\">¿Qué estás esperando?</strong>  </p>  <p style=\"\">  \tSé que este curso te proporcionará un gran valor, y te daré un conjunto de habilidades que seguramente cambiarán tu vida.  </p>  <p style=\"\">  \tTe propongo que lo hagamos juntos!  </p>  <p style=\"\">  \t<strong style=\"\">¿Que haremos en el curso?</strong>  </p>  <p style=\"\">  \t  Este curso son 6 hs de video donde te llevo de la mano por todo el proceso de maquetación, desde el diseño PSD en Photoshop, hasta la codificación en HTML y CSS, pasando por la organización del proyecto, el recorte y exportado de imágenes y la escritura del código. Y todo esto, con un proyecto concreto y en tiempo real.  </p>  <p style=\"\">  \t  En este curso en video, te mostraré yo mismo como realizo la maquetación completa de una página web desde un PSD a HTML, resolviendo cada uno de los elementos que se presentan.  </p>  <p style=\"\">  \t  Con el curso aprenderás:  </p>  <ul style=\"\">  \t<li style=\"\">Como analizar tu proyecto para tomar decisiones correctas</li>  \t<li style=\"\">Como dividir efectivamente las partes del documento</li>  \t<li style=\"\">Como optimizar al máximo el tiempo de desarrollo</li>  \t<li style=\"\">Como preparar y optimizar las carpetas del proyecto</li>  \t<li style=\"\">Como escribir correctamente código HTML 100% compatible entre avegadores</li>  \t<li style=\"\">Como manejar textos, títulos, párrafos , listas y DIVs</li>  \t<li style=\"\">Como crear y aplicar estilos a tus elementos del documento por medio de CSS</li>  \t<li style=\"\">Como crear fondos de página infinitos, adaptables a diferentes resoluciones</li>  \t<li style=\"\">Como combinar fondos degradé con imágenes</li>  \t<li style=\"\">Como recortar, optimizar y exportar correctamente la imágenes el documento</li>  \t<li style=\"\">Como generar la estructura principal del documento HTML</li>  \t<li style=\"\">Como pasar las secciones del diseño al HTML con medidas exactas</li>  \t<li style=\"\">Como ubicar perfectamente los elementos en el documento</li>  \t<li style=\"\">Como adaptar el documento a las diferentes resoluciones de pantalla</li>  \t<li style=\"\">Como volcar los contenidos de texto a tu estructura HTML (utilización de etiquetas)</li>  \t<li style=\"\">Como dar formato a los textos para igualar al diseño original</li>  \t<li style=\"\">Como generar correctamente los menús por medio de las listas</li>  \t<li style=\"\">Como volcar efectivamente los contenidos gráficos</li>  \t<li style=\"\">Como optimizar el código para los buscadores (textos, títulos e imágenes)</li>  \t<li style=\"\">Como trabajar con las etiquetas META para posicionamiento SEO</li>  </ul>  <p style=\"\">  \t  Puedes visitar mi perfil y ver mis otros cursos para continuar avanzando en tu formación:  </p>  <p style=\"\">  \t<a href=\"https://www.udemy.com/u/cristiancarrera/\" rel=\"nofollow noreferrer\" target=\"_blank\" class=\"external-link\" style=\"\">https://www.udemy.com/u/cristiancarrera/</a><strong style=\"\"><br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Crea un sitio web desde cero con HTML y CSS  (psd a html)", 
    "price": "50.00", 
    "instructors": "Cristian Carrera", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47008_496a_12.jpg", 
    "course_url": "https://www.udemy.com/psd-a-html-paso-a-paso/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-22T19:27:16Z"
}