{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>UPDATED June 7th, 2015 - </strong>Now Includes full download of this FULLY FUNCTIONAL website + DB + Web App located at<strong> http : // info lims . com</strong></p>\n\n<p><strong>What is this course about?</strong><br></p>\n\n<p>This course is about Oracle's APEX framework which allows you to create modern, fully-functional web applications using nothing more than your browser.  Applications in APEX are configured and not coded.  But don't let that fool you.  APEX is modern and allows for advanced web programming if you want to get your hands dirty.  In this course we dive into the basics and intermediate level of APEX configuration.  There is no heavy coding in this course.  We use configuration and drag-and-drop in this course to get some pretty advanced functionality.</p>\n\n<p><strong>What terminology would your audience expect to find in this course?</strong></p>\n\n<p>We cover all of APEX's terminology (Don't worry if you are not familiar)</p>\n\n<p>Table, Sequences, Workspace, Page, Page Designer, Application Builder, SQL Workshop, Exporting, Importing, Interactive Reports, Regions, Items, Buttons, Select Lists, List Managers, Template Options, Icon Classes, Shared Components, Authentication Schemes, Theme Roller, Dynamic Actions, Application Rollback, Team Development Module, Packaged Apps, Page Processes, Branching, Page Redirection, SQL, Query Builder, and so much more</p>\n\n<p>We also cover some web and database terminology (Would help to have a basic understanding)</p>\n\n<p>HTML, h1, h2, div, SQL, Select, From, Where</p>\n\n<p><strong>What kind of material are included?</strong></p>\n\n<p>The format for this course is watch and follow along.  You are given two options for following along:</p>\n\n<p>Request your own Oracle Workspace and follow along (Free)</p>\n\n<p>Install your own instance of Oracle XE and APEX (Free) on your Windows machine</p>\n\n<p>Both options are free.  The student is expected to complete all of the same exercises in the video.</p>\n\n<p><strong>How long will the course take to complete?</strong></p>\n\n<p>The student should expect to dedicate 8 or more hours to complete the course.</p>\n\n<p><strong>How is this course structured?</strong></p>\n\n<p>Watch and follow along.  I take you from beginning to end with this course video series.  I will occasionally ask you to pause the video and complete a task to test your skills.</p>\n\n<p><strong>Why take this course?</strong></p>\n\n<p>There is nothing like seeing a developer in action and watching them build from beginning to end.  You can try and use a book or blog tutorial to get your knowledge about APEX.  But the experience with those formats could end up leaving you stuck.  APEX is the future of web application development.  If you think visually and would prefer to configure an application rather than get stuck in the weeds with code, take this course and get started on your next web app. </p>", 
    "end_date": null, 
    "title": "Create Complete Web Applications easily with APEX 5", 
    "price": "25.00", 
    "instructors": "Andrew Vega", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552594_1ca1_7.jpg", 
    "course_url": "https://www.udemy.com/create-web-apps-with-apex-5/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T16:58:04Z"
}