{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Este no es un tutorial, <strong>es el único curso bien estructurado y planeado</strong> para que aprendas <strong>CSS de inicio a fin </strong>para que generes interfaces gráficas sin dolor. <strong>¿Te interesa el desarrollo Web en serio?</strong><br></p>  <p>  \t                  Maquetarás <strong>5 sitios Web reales </strong>y con <strong>diseños profesionales </strong>usando <strong>HTML5</strong> y <strong>CSS3</strong>, <strong>¡nada de diseños antiestéticos!</strong> Aprende a crear <strong>mega menús</strong>, <strong>sistemas de retícula</strong>, crear <strong>diálogos y ventanas</strong>, usar <strong>imágenes SVG</strong>, incrustar y crear <strong>fuentes especiales</strong> y cientos de <strong>tips </strong>geniales.  </p>    <p>  \t                                                                                           Trabajaremos de una manera progresiva, bien guiada <strong>¡</strong><strong>y en español!</strong>, para que tu aprendizaje fluya correctamente. Crearás <strong>proyectos desde HTML</strong> hasta la maquetación gráfica con CSS; para esto, he desarrollado un programa con los siguientes tipos de contenidos:  </p>  <ol>  \t<li><strong>Presentaciones</strong> en que mostraré y discutiremos los fundamentos teóricos y prácticos que requerirás.</li>  \t<li><strong>Demostraciones </strong><strong>en video</strong> en las cuales tomaremos un <strong>editor en la nube</strong> y nos pondremos a programar.</li>  \t<li><strong>Proyectos:</strong> Demostraciones especiales en las que desarrollaremos sitios Web de diferentes estilos y formas.</li>  \t<li><strong>Ejercicios </strong>en los que trabajarás en solitario para conseguir objetivos específicos y pongas tus conocimientos en práctica.</li>  \t<li><strong>Exámenes: </strong>Uno de diagnóstico y 3 de seguimiento, para que verifiques que los conceptos hayan sido captados.</li>  \t<li><strong>Descargas:</strong> Tendrás acceso a aproximadamente <strong>136</strong> archivos comprimidos <strong>ZIP </strong>con los archivos y <strong>código fuente</strong> de los proyectos, <strong>13 </strong>archivos <strong>PDF</strong> con las <strong>presentaciones </strong>mostradas en las clases y <strong>73 </strong>archivos de <strong>audio </strong>con la pista de cada uno de los vídeos.</li>  </ol>  <p>  \t                                                                                         Sé que apreciarás el trabajo y empeño para la creación del programa de trabajo, porque <strong>está creado para ti</strong>, para que cuando crees un sitio Web lo puedas hacer fácilmente y <strong>sin dolor</strong>.  </p>", 
    "end_date": null, 
    "title": "CSS desde cero: Desarrollo Web/HTML/CSS3 para profesionales", 
    "price": "50.00", 
    "instructors": "Josué E. Pizano", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/294400_960f_19.jpg", 
    "course_url": "https://www.udemy.com/css-desde-cero/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-05T06:21:00Z"
}