{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Are you someone</strong> who has been working with Wordpress and want to take your sites to the next level by changing their look and their style?</p><p>Or maybe you’re frustrated because you want to make changes but you can’t figure out how to do it.</p><p>Maybe you’ve tried to make your website look better, and you’ve done the best you can but you keep <strong>getting stuck</strong>.</p><p>If you don’t learn this, I’m sorry to say that that frustration doesn’t go away! And as frustrating as it is now, imagine what you’ll feel like a month or a year from now when you STILL DON’T KNOW how to make your website look better quickly and easily.</p>\n<p><strong>I KNOW how that frustration feels</strong>, I’ve been there, and I know how annoying it can be to know what kind of changes you want to make, but then not know HOW to make them. But I’ve learned the <strong>RIGHT way to style websites</strong>, and it’s called CSS, and that’s what I want to teach you today.</p>\n<p>Take a look at this example of how a simple boring form can be easily and quickly transformed into something mobile friendly and responsive! I’ll walk you through exactly how to do this and other things like it in this course.</p>\n<p>Also, imagine what it will feel like to be able to look behind the scenes of any Wordpress website you visit and see how THEY styled it, and then be able to model that styling for your own website!</p><p><strong>Imagine using code that makes your website look so much better the INSTANT you add it.</strong></p><p>And what will you feel like when you can take a boring theme and injecting it with life and your own personality, quickly and easily using CSS.</p><p>This course is the complete guide to beginner css and it is the exact tool you NEED in order to style your Wordpress website.</p>\n<p>WHEN YOU join this course TODAY, you get <strong>lifetime access</strong>. Not only that: this course will be super helpful to you now AND in the future whenever you have a question about CSS. <strong>It’s easy to ask any questions at any time and I’ll be right there with you</strong>, answering them. </p><p><strong>Take this course NOW</strong> and I’ll see YOU on the other side!</p>", 
    "end_date": null, 
    "title": "CSS Tutorial For Beginners: Style Your Wordpress Templates", 
    "price": "35.00", 
    "instructors": "Eddie Makes", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/742712_3645_7.jpg", 
    "course_url": "https://www.udemy.com/css-tutorial-for-beginners-style-your-wordpress-templates/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T20:28:44Z"
}