{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Bienvenido al <strong>curso de Zend Framework 2</strong>, vas a aprender <strong>cómo utilizar cada\nuna de las partes del framework</strong> de forma fácil y rápida.<br></p>\n\n<p>Al finalizar el curso <strong>serás capaz de desarrollar tus propias\naplicaciones</strong> web completas con Zend Framework 2 o modificar las de otros.</p>\n\n<p>Este curso <strong>está diseñado para ser el más completo que existe</strong> y que no te\nquedes con dudas. Está diseñado para que <strong>realmente aprendas a programar </strong>con\nframeworks de PHP y más concretamente con Zend Framework 2.</p>\n\n<p>\n\nSe tratan <strong>desde  los aspectos más básicos</strong>\ny sencillos <strong>hasta los más avanzados</strong>, por tanto <strong>pueden seguirlo novatos en el desarrollo</strong> web con PHP o gente con experiencia en este.</p>\n\n<p>Durante las casi <strong>8 horas</strong> que dura el curso <strong>verás numerosos ejemplos prácticos</strong>\nque <strong>acelerarán tu aprendizaje</strong>, además de <strong>un ejemplo completo para unir\ntodas las piezas del puzzle</strong> y desarrollar una aplicación que liste, guarde,\nedite y elimine contenido, incluirá paginación, formulario de login, rutas\npersonalizadas, etc. </p>\n\n<p>Todo esto desarrollado con las herramientas que nos brinda Zend Framework 2\ny <strong>utilizando los mejores estándares</strong> y metodologías recomendadas oficialmente.</p>\n\n<p>Échale un vistazo al currículo del curso para ver todos temas que aprenderás.</p>\n\n<p><strong>Únete al curso y sube de nivel: ¡¡ Aprende Zend Framework 2 ¡!!</strong></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Curso de Zend Framework 2 - Desarrollo web avanzado con PHP", 
    "price": "40.00", 
    "instructors": "Víctor Robles", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639082_edc8_4.jpg", 
    "course_url": "https://www.udemy.com/curso-de-zend-framework-2-aprende-facil-y-rapido/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T10:06:02Z"
}