{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>O conceito de compra coletiva é quando um grupo de consumidores se reúne e usa uma velha regra de mercado, a que afirma ser a melhor tática agrupar várias pessoas para alcançar o menor preço possível com um produto ou estabelecimento.</p><p>O site de compra coletiva tem como função negociar com as empresas a oferta que será oferecida e divulgá-la para seus usuários.</p><p>Eles funcionam da seguinte maneira: após fazer um acordo com uma empresa, os grupos disponibilizam em seus sites um produto ou serviço que aquela empresa oferece, por um desconto expressivo de até 90%. A oferta fica no ar por um curto período de tempo, de geralmente 24 a 48 horas, e para validá-la é necessário que um número mínimo de compradores seja atingido.</p><p>Com este curso, pessoas experientes ou leigas, poderão desenvolver sua Loja Online de compras coletivas, disponibilizar meios de pagamento como cartão de crédito, boleto bancário, depósito, transferência e lucrar significativamente com a modalidade de vendas online que é febre no mundo todo.</p><p>Ao término do curso, você estará apto a desenvolver um site profissional com essas características.</p><p>Nesse treinamento enfatizamos a instalação, customização básica e administração do site de forma objetiva e o sistema é disponibilizado junto com os arquivos do curso sem custos extras.</p>", 
    "end_date": null, 
    "title": "Curso Criando sites de compras coletivas", 
    "price": "50.00", 
    "instructors": "MX Cursos", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793816_c0ef_2.jpg", 
    "course_url": "https://www.udemy.com/curso-criando-sites-de-compras-coletivas/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T16:52:33Z"
}