{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Hello everyone!</p>\n\n<p>My name is Ahmad Gneady. I'm the author of AppGini, a program that makes it trivially easy for anyone with a PC to create powerful and great-looking web database applications for their work. Since 2003, thousands of users have used AppGini to create applications to manage inventory, payrolls, human resources, real estate, sales, invoicing, projects and tasks, community activities, and .. well, you name it.</p>\n\n<p>All the above and much more can be done without writing a single line of code by using AppGini. However, AppGini offers the ability to customize the generated code by using hooks. And this is what this course is about.<br></p>\n\n<p>I prepared this course for power users of AppGini, who'd like to add more functionality to their applications by writing custom code. Through 4.5 hours of video, we'll finish 30 practical examples, featuring more than  500 lines of code, that cover the most common hook questions I receive from users. You'll learn how to:</p>\n\n<ul><li>customize the login page,</li></ul>\n\n<ul><li>add links to the main page and show the count of records,</li></ul>\n\n<ul><li>organize long forms into tabs or change their layout,</li></ul>\n\n<ul><li>change the filters page to look more friendly and efficient,</li></ul>\n\n<ul><li>add custom buttons to forms to extend their functionality,</li></ul>\n\n<ul><li>create invoices and similar report types,</li></ul>\n\n<ul><li>add validation rules to forms to enforce business rules,</li></ul>\n\n<ul><li>perform calculations on the fly,</li></ul>\n\n<ul><li>and automatically update an order total field as items get added to the order.</li></ul>\n\n<p>I'll cover many common cases with detailed code .. all the code will be explained in a clear easy-to-follow pace so that you can write your own code afterwards. Moreover, I'll continue adding more and more lectures to expand the course and include additional cases. By signing up now, you'll also get all future lectures for free.<br></p>", 
    "end_date": null, 
    "title": "Customizing AppGini web applications", 
    "price": "50.00", 
    "instructors": "Ahmad Gneady", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520478_7469_3.jpg", 
    "course_url": "https://www.udemy.com/customizing-appgini-web-applications/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T16:23:12Z"
}