{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t                 AngularJS does exactly what it says on the box - it extends HTML to what it should be for web applications. It allows users to create applications quickly with great architecture backing it up and provides testing support, which shouldn&#039;t be underestimated. AngularJS also has a great community surrounding it, justifying its popularity.  </p>  <p>  \tGulp and NodeJS are technologies that make the life of any frontend developer easier by allowing them to automate tedious tasks. Think of SASS compilation, minifying your code, and so on, all happening automatically, and at the speed of light using our build system in Gulp.  </p>  <p>  \tHeroku is a cloud application platform that allows us to easily deploy our application to the web and scale it according to our needs. Heroku allows us to focus on writing code instead of worrying about server infrastructure.  </p>  <p>  \tAngularJS makes developing frontend web applications a breeze, while Gulp and Node provide an optimized and stable production version to deploy on Heroku, making application development hassle free.  </p>  <p>  \tDeploying AngularJS is aimed at providing best practices and the most modern tooling methods available for creating and deploying an AngularJS application. Not only will your applications be simple and elegant, the development and deployment will also be blazingly fast.  </p>  <p>  \tWe start by outlining the application idea, then developing it, and finally deploying our app to Heroku. Before we begin, we’ll prepare our development environment and our build system. After everything is up and running, we’ll get started by constructing the supporting services that form the skeleton of our application. Then, we use those services to flesh out the app. Later, we make sure our application is optimized for production, and we deploy it to Heroku.<br style=\"\">  \t                 This video course will help you develop and deploy your AngularJS applications in a short but sweet, no-nonsense approach.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<strong style=\"\">Thomas Tuts</strong> is a web developer who is completely in love with  JavaScript, HTML, build systems, and AngularJS. He gets a great sense of  joy when he’s helping people out with their code or mentoring them. He  is an active AngularJS community member on the #angularjs IRC channel,  usually hanging out to help people when he can.  </p>", 
    "end_date": null, 
    "title": "Deploying AngularJS", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/423248_5568_2.jpg", 
    "course_url": "https://www.udemy.com/deploying-angularjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-16T12:20:31Z"
}