{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>¿Ya sabes programar en Java y quieres aplicar esos conocimientos para programar aplicaciones web dinámicas?. ¿Estas cansado de buscar en Internet un curso que te enseñe paso a paso como crear una aplicación web real con tecnologías Java EE?</p>\n\n<p>Bienvenido al curso<strong class=\"redactor-inline-converted\"> \"Desarrollo de aplicaciones web con Java EE - Servelts y JSP\"</strong>, el curso en el que aprenderás a utilizar tecnologías de Java del lado del servidor como lo son los Java Servlets, Java Server Page, Expression Language y JSTL para crear aplicaciones web dinámicas utilizando el patrón de diseño MVC mejor conocido como <strong class=\"redactor-inline-converted\">M</strong>odelo <strong class=\"redactor-inline-converted\">V</strong>ista <strong class=\"redactor-inline-converted\">C</strong>ontrolador.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">¿Qué incluye el curso?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Más de 6 hrs de clases en video donde se explica paso a paso los diferentes temas.</li><li>Las clases donde se explican los diferentes conceptos son apoyadas con diapositivas para reforzar más el aprendizaje.</li><li>En las clases de programación se proporciona todo el código fuente para que lo puedas utilizar como base para tus propios proyectos.</li><li>1 proyecto real el cual será desarrollado paso a paso para poner en práctica todos los conceptos aprendidos durante el curso.</li><li>Soporte por parte del instructor para preguntas o dudas relacionadas con temas del curso, las cuales serán respondidas en menos de 48 Hrs.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">¿Porqué estoy compartiendo este curso?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>En mi primer trabajo como desarrollador de software me pidieron desarrollar una aplicación web con Java. En aquel tiempo no había mucha documentación que me ayudara a avanzar rápido con el desarrollo de esta aplicación. Me hubiera ayudado muchísimo un curso como este que te estoy compartiendo, sobre todo por como esta estructurado.  El curso te explica todos los conceptos que pudieras necesitar en un futuro para crear cualquier tipo de aplicación web con Java. Por eso estoy compartiendo este curso, para que tu avances más rápido.</p>\n\n\n\n<p><strong>No esperes más, comienza a aplicar los conocimientos que ya tienes de Java para crear aplicaciones web dinámicas.</strong></p>\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Desarrollo de aplicaciones web con Java EE - Servlets y JSP", 
    "price": "35.00", 
    "instructors": "IVAN ELISEO TINAJERO DIAZ", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/781696_3718_5.jpg", 
    "course_url": "https://www.udemy.com/java-servlets-jsp/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-04T00:53:49Z"
}