{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  ¿<strong style=\"\">Sobre que es el curso</strong>?<br style=\"\">  \t       Veremos como desarrollar un sitio web usando tecnología <strong style=\"\">CSS3, HTML5 Y JQUERY</strong>. El tema a tratar sera desarrollar una web para un gimnasio.  </p>  <p>  \t      En el cual estaremos hablando punto por punto los diversos  temas que requiere el desarrollo de una web de este tipo, como: css3, javascript, html 5, responsive design entre otros.  </p>  <p>  \t       ¿<strong style=\"\">Como esta compuesto el curso</strong>?<br style=\"\">  \t        Por videos prácticos y material de ayuda, también al finalizar el curso  podremos descargar el aplicativo completo el cual les servirá para  tender y reforzar lo que han aprendido durante el transcurso de  enseñanza.  </p>  <p>  \t      ¿<strong style=\"\">Como esta estructurado el curso</strong>?<br style=\"\">  \t       El curso se encuentra diseñado de una manera bastante práctica/teoríca  donde las dos trabajan a la par, la mayoría de las clases tiene material de descarga para que puedan poner en práctica.  </p>  <p>  \t       ¿<strong style=\"\">Porque tomar el curso</strong>?<br style=\"\">  \t      Por que es  ideal para entrar este mundo y competir con lo que demanda el mercado actual.  </p>  <p>  \t  Aquí no venimos a jugar, aqui venimos a trabajar. Saldremos con un perfil ideal para conseguir nuestro primero trabajo o ser más competitivo en este.  </p>", 
    "end_date": null, 
    "title": "Desarrollo Web: aprende CSS3, jQuery, Html 5 y más", 
    "price": "20.00", 
    "instructors": "Eduardo Patiño", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312298_1c1d_3.jpg", 
    "course_url": "https://www.udemy.com/crea-sitio-webs-modernos-con-css3-jquery-html5-y-mas/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-02T17:17:31Z"
}