{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Hoy en día es importante tener prescencia en internet, pero que sea continua. ¿Esto que significa? que tu contenido este disponible en cualquier dimensión de pantalla. Desarrolla paginas web con la ayuda de HMTL5, CSS3 y Bootstrap 3. De esta manera es muy posible hacer páginas web a velocidad relampago. Si tienes la inquietud de aprender el código HTML5, CSS3 y la poderosa plataforma Bootstraps 3, para elaborar tus propias páginas que tengan las características de ajustabilidad a toda dimensión de pantalla, este curso es para tí. </p><p>¿Quizas quieres hacer una página personal o para la empresa donde trabajas o talvez tienes una página web diseñada por alguien mas? No te preguntas cosas como: </p><ul style=\"\"><li>¿puedo darle mas vistosidad a mi página actual?</li><li>¿habra manera de hacerlo yo mismo?</li><li>¿que tanto tiempo sería necesario para emplear esos cambios?</li></ul><p>Este curso esta dirigido a desarrolladores de páginas web y para aquellos que quieren tener el conocimiento de poder utilizar el código de una manera organizada.</p><p>¿Que puedes esperar?</p><ul style=\"\"><li>Es un curso para principiantes donde no es indispensable saber de los lenguages HTML5 ni CSS3, pero el solo hecho de tener nociones los ayudará</li><li>Hay un total de 35 videos donde se explica paso a paso como funciona el código.</li><li>La totalidad de este material se puede ver en una sola sesión aunque es recomendable una semana para obtener el mayor beneficio.</li><li>Al finalizar el curso podrás crear páginas web ajustables a toda dimensión de pantalla de manera fácil y rápida.</li><li>Tus costos por creacion de páginas web para uso personal o el de tu una empresa se eliminarán</li><li>O si lo prefieres, empieza una nueva etapa como desarrollador de páginas web.</li><li>Tendrás la capacidad de entender el código que empleaste a tu página y modificarla hasta que este a tu gusto.</li></ul>", 
    "end_date": null, 
    "title": "Desarrollo Web Rapido - HTML5,  CSS3 y Bootstrap 3", 
    "price": "30.00", 
    "instructors": "Alfredo Lopez Ganador Premio #Innovación Udemy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470440_3a83_3.jpg", 
    "course_url": "https://www.udemy.com/creando-paginas-web-con-html5-css3-y-bootstrap-3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T02:57:05Z"
}