{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>GET 50% OFF! Use \"UDEMY10\" as your code for half price classes. Limited offer!</strong></p>\n\n<p>In today’s world it is becoming more and more competitive. Getting a simple edge over others may just increase your chance at success! When it comes to HTML and CSS, the languages are quite simple. For anyone looking to either enter the website development field for work-related purposes, or for personal growth, you have come to the right starting point.  </p>\n\n<p>  \t  HTML and CSS are two of the most basic and fundamental coding languages to any website. From small websites to more complex creations, you will find HTML and CSS.  </p>\n\n\n\n<p>  \t  “Developing Your First Website” takes you on a step-by-journey from your first line of code, right through to your completed and functioning website! The course covers:  </p>\n\n\n\n<ul>  \t<li>HTML Foundations</li>  \t<li>CSS Foundations</li>  \t<li>CSS Selectors (incl. grouping)</li>  \t<li>User Interface Improvements</li>  \t<li>Debugging Tips</li>  \t<li>Confidence to build your own functioning website, unassisted!</li>  </ul>\n\n\n\n<p>  \t  The course is structured in a way that allows you time to be introduced to terms and ideas before we begin to incorporate them into our work. This course will offer you the privilege to learn HTML, and combining it with the fundamentals of CSS, the two go hand-in-hand, and you can walk away with the expertise to create your own functioning webpage, and can view it through your internet browser, such as Safari or Chrome - even upload it for the world to see!!  </p>\n\n\n\n<p>  \t  I look forward to helping you learn and develop yourself further.  </p>\n\n\n\n<p>  \t  See you in Class 1 very soon!!  </p>", 
    "end_date": null, 
    "title": "Developing Your First Website (HTML and CSS)", 
    "price": "20.00", 
    "instructors": "Daniel Devo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314896_d81c_11.jpg", 
    "course_url": "https://www.udemy.com/developyourfirstwebsite/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T08:50:12Z"
}