{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Have you considered software development as a career? Are you going to add app development skills to your resume? Perhaps you have an idea that would make an awesome app? Maybe you just want to see what app development is like?</p>\n\n<p>If you'd like to try your hand at app development this short program is for you. In about an hour, you'll build your first application guided by master instructor Mark Lassoff.</p>\n\n<p>The project is simple: Build an app that translates English into \"Yoda speak.\" You remember Yoda, right? Star Wars' elder, green, Jedi, father-figure to Luke Skywalker? Yoda had a particular way of talking and you'll build an app that takes English-language text and returns the Yoda-version of that text. And, you'll learn a lot about app development along the way.</p>\n\n<p>You'll go step-by-step through the app building process. Don't worry if you can't code and don't understand the syntax. The idea is to learn the <em>process</em> of app development. See if you like it. You can learn all the languages, techniques and tools for app development later. Here, the idea is to build your first app and get that success under your belt.</p>\n\n<p>You'll start off by viewing a demonstration of the app and learning about the underlying technology. You'll then learn which free tools are used to build the app and download and install those tools. You'll learn about HTML5, Javascript and CSS-- the languages used to build this app and actually write code with the instructor's careful guidance. You'll test the app and make it run in your own web browser. It's an exciting process which will help you build confidence and get ready for study of more advanced app development for mobile or web.</p>", 
    "end_date": null, 
    "title": "Develop Your First App in an Hour", 
    "price": "20.00", 
    "instructors": "LearnToProgram, Inc., Mark Lassoff", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796010_4954.jpg", 
    "course_url": "https://www.udemy.com/develop-your-first-app-in-an-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T17:17:15Z"
}