{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tUse the powerful platform of Bootstrap 3 to build and design your own responsive website.</p><p>In the Develop Responsive Websites with Bootstrap 3 course, we will walk you through the popular Bootstrap HTML and CSS framework. Bootstrap helps build websites that look beautiful on mobile, tablet, and desktop browsers.  </p>  <p>  \tDevelop Responsive Websites with Bootstrap 3 covers a wide range of use cases from simple marketing websites, to web application UI's to dynamic websites using a CSS pre-processor that builds Bootstrap on the fly.  </p>  <p>  \t<strong>What You Will Learn</strong>  </p>  <p>  \tIn the course, you will learn about various stylized components of Bootstrap 3 including Navbars, Buttons, Panels, Images, Accordions, Modal dialog boxes and the like, while building two demonstration web sites. You will also learn about the underlying architecture including the layout grid, responsive techniques, typography, and utility functions for layout, hardcopy print and screen readers.  </p>  <p>  \t<strong>Projects</strong>  </p>  <p>  \t  By the end of this course you will have created a beautifully designed responsive website for your portfolio. After taking the course and creating the project website, you will be able to take what you've learned and create virtually any other type of website on the web today.  </p>  <p>  \tYou will also create your own custom web application UI.  </p>  <p>  \t<strong>Bootstrap Customization</strong>  </p>  <p>  \tCustomization of Bootstrap is introduced in simple CSS overrides, expanded upon with 3rd-party Javascript functions (for high-resolution Retina images), and developed finally in the creation of your own Bootstrap template. You will also learn about CSS debugging techniques which are helpful in customizing Bootstrap with its CSS pre-processor language LESS. In the last two lessons, you will create a dynamic version of one of the demo websites with a NodeJS server and on-demand compiled Bootstrap LESS. Example code is provided for each lesson.  </p>  <p>  \t<strong>Pre-Requsites</strong>  </p>  <p>  \t  Pre-requisites are some HTML and CSS familiarity, and basic web concepts. Javascript knowledge is helpful. </p>", 
    "end_date": null, 
    "title": "Develop Responsive Websites with Bootstrap 3", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/193012_62e5_3.jpg", 
    "course_url": "https://www.udemy.com/develop-responsive-websites-with-bootstrap-3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-02T20:51:37Z"
}