{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Aprende a crear páginas web <strong class=\"redactor-inline-converted\">desde cero y de forma sencilla</strong> con los lenguajes más modernos del momento. En este curso aprenderás:</p>\n\n<ul><li><em class=\"redactor-inline-converted\">HTML5 y CSS3</em></li><li><em>Responsive Design y Mobile First</em></li><li><em>Posicionamiento SEO</em></li><li><em>Diseño y Usabilidad</em></li><li><em class=\"redactor-inline-converted\">Animaciones CSS sin flash (ya está obsoleto)</em></li><li><em class=\"redactor-inline-converted\">Metodología de Trabajo Profesional</em></li><li><em>Nuevas Tendencias</em></li></ul>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Te animo a que veas cualquiera de las clases que estén accesibles antes de comprar el curso y seguro que desearás ver el resto del curso</em></strong></p>\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>A lo largo del curso tendrás varias horas de <strong class=\"redactor-inline-converted\">ejemplos prácticos</strong> para que captes bien el sentido de cada concepto y sepas aplicarlo en tus propios proyectos. </p>\n\n\n\n\n\n\n\n<p>Tendrás varios <strong class=\"redactor-inline-converted\">ejercicios </strong>en archivos pdf descargables, así como el código de los ejemplos mostrados en los videos. El curso está estructurado de forma modular, así que<em class=\"redactor-inline-converted\"> tú decides en qué orden ver las secciones</em>, sin necesidad de seguir una secuencia obligatoria. Tienes <strong class=\"redactor-inline-converted\">más de 30 horas de videos</strong> que irán aumentando con el tiempo, ya que esté curso estará en <strong class=\"redactor-inline-converted\">constante renovación y ampliación.</strong></p>\n\n\n\n\n\n\n\n<p>Además te transmitiré mi experiencia para que seas un profesional del diseño web. Al final este curso <strong class=\"redactor-inline-converted\">serás capaz de crear una página moderna y atractiva sin ningún problema</strong> :)</p>\n\n\n\n\n\n<p>Permíteme explicarte por qué debes tomar este curso:</p>\n\n\n\n\n\n<p>Tengo más de 10 años de experiencia tanto como profesor, como tambien Analista-Programador. El formato de mis videos es muy <strong class=\"redactor-inline-converted\">didáctico y ameno</strong>, no es como la gran mayoría de cursos en la que te limitas a observar una pantalla y a escuchar una voz de fondo. En mi caso me verás a mí insertado dentro del pantalla, <em class=\"redactor-inline-converted\">como si estuviera frente a tí </em>explicándote cada punto relacionado con el Diseño Web. Te acompañaré desde el principio, haciendo ejercicios juntos y ayudándote con tus dudas.</p>\n\n\n\n<p><br></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">La importancia de saber HTML5 y CSS3</strong></li></ul>\n\n\n\n\n\n<p>Si quieres estar realmente actualizado, debes saber los nuevos lenguajes con los que se diseña la web, es decir HTML5 y CSS3, pero esto <em class=\"redactor-inline-converted\">no es solo conocer las nuevas etiquetas, implica mucho más</em>. En este curso entenderás <strong class=\"redactor-inline-converted\">cómo y cuándo utilizar cada lenguaje</strong>.</p>\n\n\n\n<p><br></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">¿Por qué es tan importante Responsive Design? ¿Y Mobile First?</strong></li></ul>\n\n\n\n\n\n<p>Aun así, <strong class=\"redactor-inline-converted\">no es suficiente con saber las versiones más modernas de HTML y CSS</strong>, es fundamental saber hacer diseños actualizados a las nuevas tendencias. Es decir, <strong class=\"redactor-inline-converted\">Responsive Design y Mobile First</strong>, para que tu página se adapte a cada pantalla de cada dispositivo desde la que se visite. <em class=\"redactor-inline-converted\">Nadie puede decir que es un verdadero profesional si en los tiempos en los que estamos no es capaz de crear sitios webs totalmente adaptables a dispositivos móviles.</em></p>\n\n\n\n<p><br></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">¿Realmente importa el Diseño de mi página?</strong></li></ul>\n\n\n\n\n\n<p>¿Crees que con todo lo dicho hasta ahora es suficiente? NO!!! <em class=\"redactor-inline-converted\">Tu página solo tendrá éxito si su diseño es atractivo y la experiencia del usuario al navegar en ella es realmente agradable y cómoda</em>. También en este curso aprenderás <strong class=\"redactor-inline-converted\">los principios fundamentales de Diseño y Usabilidad</strong>, para garantizar una buena experiencia de usuario.</p>\n\n\n\n<p><br></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">¿Hay algo más que deba aprender para diferenciarme del resto?</strong></li></ul>\n\n\n\n\n\n<p>¿Y ahora? ¿Ya serías un verdadero profesional con todo lo mencionado? TAMPOCO!! <em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">¿De qué sirve tener la mejor página del mundo, la más bella, linda y preciosa... si nadie la visita porque no aparece en los resultados de búsqueda de Google?</strong></em> En este curso también aprenderás <strong class=\"redactor-inline-converted\">técnicas de posicionamiento SEO</strong> para que el código que escribas, el diseño de tu web, los factores externos y el comportamiento de los usuarios hagan <strong class=\"redactor-inline-converted\">que tu página suba puestos</strong> en los resultados que proporcionan los motores de búsqueda como Google, Yahoo!, Bing, etc. De ese modo <strong class=\"redactor-inline-converted\">estarás por encima de la competencia</strong>. Sólo de ese modo, podrás decir que todo el esfuerzo que hiciste en crear tu página mereció la pena porque la gente la está encontrando y la está usando.</p>\n\n\n\n<p>Normalmente los cursos de diseño web no contienen un apartado de SEO. En este caso tendrás unas 6 horas!!! <em class=\"redactor-inline-converted\">Todo un curso completo de las técnicas SEO más importantes!</em></p>\n\n\n\n<p><br></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">¿Crees que lograr esto es casualidad?</strong></li></ul>\n\n\n\n<p>Nada de lo mencionado anteriormente es casualidad. Para lograr esos resultados es necesario seguir una <strong class=\"redactor-inline-converted\">Metodología de Trabajo Profesional.</strong> En este curso te enseñaré que etapas debes seguir paso a paso desde el principio hasta el final para que tu sitio web sea de gran calidad en cada uno de los puntos mencionados</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Un Curso Diferente y en Constante Renovacion</strong></p>\n\n\n\n<p>Además de todo lo dicho, en este curso encontrarás contenido único en la red, cómo por ejemplo una amplia sección dedicada a crear animaciones con CSS. <strong class=\"redactor-inline-converted\">Flash ya está muerto, todos los sabemos, pero... ¿te enseñaron a crear animaciones con CSS? </strong>Pues...adivínalo !! Exacto !! En este curso también hay un apartado dedicado a las animaciones, un apartado MUY extenso de unas 6 horas. Empezando por efectos sencillos pero muy agradables y pasando por animaciones intermedias hasta llegar a las animaciones más avanzadas en 3 dimensiones, <strong class=\"redactor-inline-converted\">aprenderás a crear cualquier animación que te propongas</strong> :)</p>\n\n\n\n<p>Y lo mejor es que<strong class=\"redactor-inline-converted\"> las nuevas tendencias</strong> que se vayan imponiendo en el mundo del diseño web <strong class=\"redactor-inline-converted\">se explicarán en este curso</strong>. Para que no te quedes desactualizado.</p>\n\n\n\n<p>¿Verdad que es genial? Pues<em><strong> lo mejor de todo es que está a tu alcance. </strong></em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Compra el curso</strong> y disfruta de todo lo que te está esperando. </p>\n\n\n\n<p>Nos vemos!</p>\n\n\n\n<p>José Javier Villena<br>\n\n</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Diseño Web Desde Cero a Avanzado - Curso Completo +30h", 
    "price": "50.00", 
    "instructors": "Jose Javier Villena", 
    "commitment": "31.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/809410_4666_6.jpg", 
    "course_url": "https://www.udemy.com/diseno-web-desde-cero/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-31T19:08:05Z"
}