{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>En este curso aprenderás a desarrollar páginas responsivas por medio de la poderosa herramienta de las cajas flexibles o flex-box. Nos basaremos en la especificación más reciente de la W3C de 2014 de las \"flex-box\". Analizaremos desde las bases de este esquema, que nos permitirá hacer formatos o <strong><em>layouts</em></strong>, así como la forma de alinearlos vertical u horizontalmente, centrarlas, cambiar el orden de las cajas internas o ítems flexibles, así como las propiedades para \"estirarlas\", rotarlas y adaptarse de forma natual, las cajas internas al contenedor flexible.</p><p>Haremos  ejemplos de páginas responsivas iniciando desde cero, hasta llenarlas de contenido. Realizaremos una galería responsiva con diferentes imágenes, que se adaptarán al tamaño del dispositivo, adaptándose tanto a tabletas como a teléfonos inteligentes. También haremos un ejemplo de cómo animar a las cajas flexibles por medio de las propiedades de transición de los estilos en cascada nivel tres. Por último codificaremos un menú horizontal con cajas flexibles, que cambiará su orientación a vertical cuando se visualice en pantallas pequeñas, como la de los teléfonos, donde es complicado los menús largos.</p><p>Para que puedas aprovechar este curso, es necesario que tengas conocimientos mínimos de HTML y CSS. También es deseable que conozcas HTML5 y CSS3, aunque no es indispensable.</p><p>Para tomar este curso necesitas un editor de código como SublimeText. Brackets, Aptana o Dreamweaver y un navegador moderno, así como muchas ganas de aprender.<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Diseño responsivo con cajas flexibles CSS3", 
    "price": "20.00", 
    "instructors": "Francisco Javier Arce Anguiano", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691192_b686_3.jpg", 
    "course_url": "https://www.udemy.com/diseno-responsivo-con-cajas-flexibles-css3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T17:13:15Z"
}