{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>Come join me as we create our first scalable Django application ... in only 3 hours!</em></p><p><em>Django is used by some of the largest websites on the internet, including Instagram, Pinterest, and Disqus— serving multiple <strong>billion </strong><strong>page views</strong>, and <strong>unique visitors</strong> a month on Django stacks.</em><br></p><p>I've loved working with Django these last couple years and would now like to help you join the club by walking you through the official tutorial<strong>, for free</strong>!</p><p><em>What this course is not:</em></p><p><em>I do not cover programming fundamentals or python syntax. You do not need to be an expert by any means but you should be comfortable with the basics of at least one programming </em><em>language so that we can focus on Django and not programming in general. (You can take this course if you're new to programming but expect to look up some of the basics on your own as this will not be covered.)</em></p><p><em>I may not be able to \"look at your code\" and \"tell you what's wrong\". I will if I can, but keep in mind that this course is free and I may not be able to spend too much time debugging your code. </em></p><p><em>If you're looking for advanced topics, you may want to download the source code of this course first and see if you could produce it on your own.</em></p><p>But, if you want to add Django to your tool belt - remember it's used on some of the busiest sites on the net - and you haven't yet taken the official tutorial, you need to download this course this minute.</p><p>Stop DELAYING and try Django!</p>", 
    "end_date": null, 
    "title": "Django Tutorial: Build Your First App Fast & Free! ", 
    "price": "20.00", 
    "instructors": "BlueApple Courses", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581256_d1dc_10.jpg", 
    "course_url": "https://www.udemy.com/create-your-first-django-website-fast-free/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T15:20:05Z"
}