{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In this course, you'll learn how to build a simple, custom website from scratch. Not a template-based site that will look like everyone else's. You'll build your website from nothing… in raw code, the way you want, then take it live on the Web.</p><p>You're going to learn a lot about HTML and CSS, the languages of content and design in web development. You won't be a professional web developer at the end of this course. You will have built a rock solid foundation in HTML and CSS. And, if you decide you want to learn more, you'll be well prepared to tackle more advanced web development courses.</p><p>If developing some simple websites for yourself and your friends is all you want, you'll learn all you need from this course. You'll also learn about some resources that will help you further develop your skills on your own.</p><p>You won't need to buy any special software. You'll use free tools that I'll guide you through setting up. The only cost will be an affordable web hosting service to take your site live on the Web. I'll help you with that too, when the time comes.</p><p>And when you're done, you'll have a custom website that you built yourself, live on the Web, sharing what you have to say with the world.</p><p>Let's get started.</p><p>Topics Include:</p><ul><li>Setting up a plain text editor for web development.</li><li>The structure of HTML.</li><li>Structuring written content.</li><li>Adding images.</li><li>Embedding videos, maps, and other third-party content.</li><li>Linking to internal and external pages.</li><li>Creating lists and tables.</li><li>Styling content with CSS.</li><li>Designing pages for readability and visual appeal.</li><li>Customizing fonts and text.</li><li>Registering your website domain name.</li><li>Setting up a web hosting service.</li><li>Uploading your site and taking it live on the Web.</li></ul>", 
    "end_date": null, 
    "title": "Do-It-Yourself Website Development", 
    "price": "20.00", 
    "instructors": "Thomas Bell, Jamie Allen", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600710_0395.jpg", 
    "course_url": "https://www.udemy.com/do-it-yourself-website-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T18:46:14Z"
}