{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Docker is a tool that allows you to develop software faster, more reliably, and with less fuss! Backed by the likes of Red Hat, Microsoft, and VMWare, this is one of the fastest-adopted technologies ever seen, and it can help you work more effectively.</p><p>Docker for Web Developers will take you on a journey from a Docker novice to master. With the aid of step-by-step videos, you will use Docker to win at 2048, contribute to a real web development project in minutes, and learn the tricky art of container orchestration. By the end of this video course, you&#039;ll be ready for anything Docker can throw at you!</p><p>This video course puts you in the position of an engineer who knows nothing about Docker but needs to learn it fast. With realistic examples, you will work and play with Docker and get progressively experienced as the course advances.</p><p>Throughout this video course we will cover a lot of ground, including building your own images, using the Docker Hub workflow to turbocharge development, sharing your work with others, running your work in production environments, and ensuring that everything works smoothly.</p><p>By the end of this course, you will have all the tools you need to make Docker useful for you and your business, and you will learn how you can leverage Docker in a web development workflow.</p><p><strong style=\"\"><strong style=\"\">About the Author</strong></strong></p><p><strong style=\"\">Ian Miell</strong> is a software engineer who has worked on some of the world&#039;s busiest e-commerce systems for over a decade, writing their code and keeping them running. He maintains a technical blog and ShutIt, a tool used to build complex Docker containers.</p>", 
    "end_date": null, 
    "title": "Docker for Web Developers", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506966_0233_2.jpg", 
    "course_url": "https://www.udemy.com/docker-for-web-developers/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T09:48:08Z"
}