{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">About Drupal</strong></p>\n\n<p>Drupal is a powerful tool that is backed by a passionate community. You've made an excellent choice in deciding to have a look at Drupal!</p>\n\n<p><strong class=\"redactor-inline-converted\">Start Your Drupal Journey Like a Guru and Learn How to Tap Into All the Resources at Your Disposal!</strong>  </p>\n\n<p><em>The first step in your research process is to install Drupal. You will also connect yourself with Drupal's passionate community.</em><br></p>\n\n<ul>  \t<li>Establish yourself as Drupal's newest community member.</li>  \t<li>Launch yourself on a trajectory of success.</li>  \t<li>Avail yourself of all the resources that are available to help you in your quest for Drupal mastery.</li>  </ul>\n\n<p>  \t<strong class=\"redactor-inline-converted\">                                      Install Drupal in the environment of your choosing</strong>  </p>\n\n<p>  \t    You will learn about five different options to install Drupal, including three no cost options.  </p>\n\n<p><strong class=\"redactor-inline-converted\">Learn the proper foundation from the get-go</strong></p>\n\n<p>The \"<em>Understanding the Drupal Way</em>\" section ensures that you will use Drupal in the way that it is intended to be used so that you will build sites that are easy to maintain, easy to extend and easy to upgrade.</p><p><strong>Start using your Drupal site</strong></p><p>The best way to learn Drupal is to do Drupal. Work your way through the sections that show you some of the nuts and bolts of Drupal and then proceed to actually building a simple Drupal site.</p>\n\n<p><strong class=\"redactor-inline-converted\">Get started now and get ready to harness all the power that Drupal puts under your control!</strong><br></p>", 
    "end_date": null, 
    "title": "Drupal for Beginners", 
    "price": "20.00", 
    "instructors": "Marc Isaacson", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368786_9fcb_8.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-drupal-for-total-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T12:38:45Z"
}