{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Over de cursus</strong></p><p>In deze cursus gaan we alle stappen bij langs die nodig zijn om je eerste (Wordpress) website te maken!</p><p>Stap voor stap zul je leren hoe je een domeinnaam registreert, hosting registreert, een wordpress website upload en zullen we elke optie van Wordpress bij langsgaan. </p><p><strong>Voor wie is deze cursus bedoeld?</strong></p><p>Deze cursus is bedoeld voor mensen die onervaren zijn Wordpress of zelfs onervaren zijn met het bouwen van wat voor soort website dan ook. Wordpress is de beste keuze om daarmee te beginnen. Deze cursus is bedoeld om de absolute beginner zijn eerste professionele website te laten creëren.</p><p><strong>Wat zijn de vereisten? (benodigdheden/voorkennis)</strong></p><p>Voor deze cursus is geen voorkennis van Wordpress benodigd, aangezien we alles zullen gaan behandelen in de cursus.</p><p><strong>Wat krijg ik in deze cursus?</strong></p><ul>\n<li>Een volledig begrip van Wordpress en de werking ervan.</li>\n<li>Meer dan 31 lessen en meer dan 2 uur aan content!</li>\n<li>Een wordpress website</li>\n<li>Weten hoe je Wordpress moet configureren voor de beste resultaten!</li>\n<li>Begrip van plugins en thema’s en hoe je deze moet installeren</li>\n<li>Beschermen van je website tegen hackers en spammers</li>\n<li>Bouwen van websites voor bedrijven of diensten</li>\n<li>Bouwen van een website die ondersteunt wordt door mobiele apparaten.</li></ul>", 
    "end_date": null, 
    "title": "Dutch: Wordpress voor Beginners", 
    "price": "20.00", 
    "instructors": "Nick Browns", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688268_6c3e_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-voor-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T20:34:11Z"
}