{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn everything you need to create stunning websites from start to finish, using some of the simplest yet powerful tools available.</p><p><br><strong>Discover how to Create Websites in a Quick, Easy and Enjoyable way.</strong></p><ul><li>Learn how websites are created</li><li>Discover the necessary ingredients to create a site</li><li>Publish your own website</li><li>Gain control over your site</li><li>Learn powerful drag and drop tools to create web pages</li><li>Develop an understanding of Responsive Web Design</li></ul><p><strong><br>Clarity in the process of building websites</strong><br><br>You’ll be guided through the process of building an incredible website. You will discover simple intuitive tools that enable you to create webpages with no need for any coding.</p><p><br>You’ll set up your site and create content with ease. All major areas are explained thoroughly and give you a good understanding of the process.</p><p><br>This course is designed to give you the background information you need to understand the whole process. Every step of the way is clearly shown so you can follow along at your own pace.</p><p><br>Starting with buying a domain name and setting up a hosting account you will be walked through how to create your own unique email addresses before installing Wordpress on your site. Then you will have a guided tour of Wordpress so you are comfortable with the many tools you have at your disposal.</p><p><br>You will be shown how to purchase and install the Monstroid Wordpress theme and discover the incredible control you gain over the look, feel and functionality of your site.</p><p>You then get fully aquainted with the MotoPress Content Editor which gives you a very fast and easy way to layout content for your site.</p><p><br>You will learn about the important topic of responsive web design and be shown how to incorporate it into your design.</p><p><br>Upon course completion you will have a new found confidence in web development and have the tools necessary to create successful websites for yourself or others.</p>", 
    "end_date": null, 
    "title": "Easy Website Building: Learn Using Wordpress & Monstroid", 
    "price": "25.00", 
    "instructors": "Craig Gallacher", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711050_6bb9.jpg", 
    "course_url": "https://www.udemy.com/easy-website-building/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T19:04:43Z"
}