{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>***First of all, the couse is like a live course, in development, it is not a course, that someone finishes and puts the videos to site. Web just develop our site week by week.</p><p>The project is already finished in Turkish language, now we have decided to record them in English, Turkish version took 250 hours to finish, i guess the English version will be more than 50 hours, so join now with a reasonable price<br></p><p>This course will show you how to design and program an ecommerce web site from scratch using PHP MySQL and Bootstrap</p><p>We just start from zero, and we develop our site together, really practice, and learning new style of programming</p><p>We will use our system, it looks like MVC structure but it is not, we will use function and our class for the site, the site will have own SEO system. We will have pretty urls</p><p>We will not only desing front end we will also design administrator panel using bootstrap template, our site will be competible with mobile devices, becouse of we use bootstrap library.</p><p>We plan to use Semantic library in administration area.</p><p>I will develop course step by step, you can join the course and learn step by step, you may contact me to get the project files if i dont put them in the curriculum<br></p><p>This topic was recorded in Turkish language, it took 2 years and 250hours, now we decided to record the project in English to share world what we achieved.</p><p>We hope you will learn many new things from our course.</p><p>Happy learning</p>", 
    "end_date": null, 
    "title": "Ecommerce Web Site Using PHP MySQL Boostrap", 
    "price": "20.00", 
    "instructors": "Davud Resul", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635542_0936.jpg", 
    "course_url": "https://www.udemy.com/full-ecommerce-web-site-using-php-mysql-boostrap/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T04:09:41Z"
}