{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This is a <strong>step by step</strong> course which will teach you from the very beginning to create a complete website. This course targets students who know nothing about web development and makes them web developers. After you are done with this course, you will be able to do these things: </p><ul><li>Start your career as a web developer</li><li>Start your online business</li><li>Will have complete understanding on how to work on websites</li></ul><p>And guess what? You don't need to learn any programming language to build professional websites if you follow this course. </p><p>If you follow this course and can't build a website on your own, i will be happy to refund you. </p><p>If you notice the time duration, then you will find out that this course only has 17 lectures with 16 video. Do you know the reason behind that? The reason is simple. I don't want you to know about boring definitions about webhost, domain and similar terms. I want you to build things and thus, i did it with you in the course. </p><p>I built an eCommerce website from scratch step by step in this course and i can guaranty you that you can do the same.</p><p>If you have interest in digital stores, it is the best time to learn because the world is getting more and more digital.</p><p>See you in the group discussions.   </p>", 
    "end_date": null, 
    "title": "eCommerce: Create Your Own eCommerce Site Without Any Coding", 
    "price": "20.00", 
    "instructors": "Khalid Farhan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619528_7e7e_3.jpg", 
    "course_url": "https://www.udemy.com/create-ecommerce-website-using-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T17:31:34Z"
}