{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">During this Learn HTML, CSS and HTML5 essentials course, you&#039;ll discover necessary elements behind becoming a web developer.</p><p style=\"\">The objective of this “crash course&quot; is to take someone who is a “mouse and keyboard&quot; user and teach them the essentials of web development by teaching HTML, CSS and some HTML5. </p><p style=\"\">This is a fundamental course for learning HTML and it does not assume that participants have prior knowledge.</p><p style=\"\">By the end of the HTML, CSS and HTML5 essentials course, you will know the essentials for creating your first website.</p><p style=\"\">If you are unaware of the new the features and tags that HTML5 offers, HTML5 essentials course is a course intended for you. This insightful and fast paced overview will help you quickly discover exactly what makes HTML5, the 5<sup style=\"\">th</sup> revision of HTML, such an important standard to learn.</p><p style=\"\">This course will assist you to:</p><ul style=\"\"><li style=\"\">Discover the differences between HTML4 and HTML5, as your trainer makes revealing side-by-side comparisons.</li><li style=\"\">Find out the different elements and attributes of the tags used in HTML5</li><li style=\"\">Learn about the support HTML5 offers for the latest multimedia.</li></ul><p style=\"\">Tutorials include the new &lt;video&gt;, &lt;audio&gt; and &lt;canvas&gt; elements, as well as the integration of scalable vector graphics (SVG) content and MathML for mathematical formulas.<span style=\"\"></span></p>", 
    "end_date": null, 
    "title": "Essential HTML, CSS & HTML5 Training", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470412_d348.jpg", 
    "course_url": "https://www.udemy.com/essential-html-css-html5-training/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T02:16:35Z"
}