{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>The Essential JavaScript, JQuery and AngularJS Training Bundle </strong>consists of 3 essential training courses to teach you the essentials for each topic<strong>.</strong></p><p><strong>Courses included with this bundle:</strong><strong></strong></p><p><strong>Learn JavaScript for Beginners<br></strong><strong></strong>Learn the essentials you'll need to get started with JavaScript, which is a popular programming language used to make web pages interactive. </p><p> During this course, your instructor will introduce you to executing basic JavaScript programs. You will discover the basics of the language (syntax, strings, data types), and you will understand using loops and conditional statements, and working with arrays. Additionally, this course instructs how to use various functions including scope, callback, return and anonymous functions. </p><p> Learn JavaScript for Beginners also teaches about the importance of JavaScript objects and the properties associated with objects. You will also learn details regarding the Document Object Model (DOM), a programming interface that can be accessed by JavaScript. </p><p> By the end of this course, you will be confident on the fundamentals needed to effectively program in JavaScript. </p><p><strong>jQuery Crash Course</strong><br>Learn the essentials you'll need to get started with jQuery, the most popular JavaScript library in use today. </p><p> During this two-hour crash course, your instructor will introduce you to the basics of the jQuery syntax. </p><p> Learn about jQuery selectors, one of the most important parts of the jQuery library, and how to manipulate the Document Object Model (DOM). Discover how jQuery events can be used to register behaviors that take effect when the user interacts with the web browser. </p><p> You will also learn how to use jQuery to traverse and filter the DOM, which is used to help find HTML elements. </p><p> Learn advanced topics, including how to capture mouse events using the jQuery UI framework and some of the popular jQuery plugins used to extend the power of jQuery. </p><p> By the end of this course, you will be confident in your knowledge of the fundamentals needed to effectively use jQuery. </p><strong>Angular Crash Course for Beginners</strong><p>Learn the essentials you'll need to get started with AngularJS, a popular open-source web application framework maintained by Google. During this two-hour introductory course, your instructor will introduce you to the basics of AngularJS. </p><p>The course is designed for individuals and web development professionals that need to understand the fundamentals of AngularJS.</p><p>Learn about data binding, controllers and creating simple apps, along with additional ways to control the data of AngularJS applications with multiple rows of data and scope binding.</p><p>Discover how to use CRUD (Create, Read, Update, Delete) capabilities via scope binding.</p><p>Learn advanced topics, including using Angular in IDE projects, the Angular HTTP service, using custom directives, and combining binding, validation, and directives.</p><p>By the end of this course, you will be confident in your knowledge of the fundamentals needed to effectively use AngularJS. </p><strong></strong><p>All of our videos are high-definition videos, therefore, they are <strong>best viewed with the HD setting on</strong>, and the videos enlarged.</p>", 
    "end_date": null, 
    "title": "Essential JavaScript, jQuery and AngularJS Training", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531290_b109.jpg", 
    "course_url": "https://www.udemy.com/essential-javascript-jquery-angularjs-training/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T13:58:37Z"
}