{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tIn questo corso affrontiamo lo studio di uno dei componenti per Joomla denominati CCK (Content Construction Kit) e cioè K2. Si tratta di una estensione con cui possiamo realizzare ottimi contenuti di Joomla arricchendoli con gallerie immagini, commenti, sezioni blog, sezioni collaborative ed altro. </p><p>Siamo soliti creare con Joomla i vari contenuti come articoli, categorie, ma non possiamo realizzare ottime gallerie immagini, non possiamo implementare naturalmente un sistema di condivisione e di commenti e un&#039;ottima sezione blog. Con K2 lo possiamo fare e noi impareremo dal corso proprio a realizzare tutto ciò.  </p><p><strong style=\"\">Hai sempre voluto includere campi aggiuntivi alle categorie Joomla o agli articoli?</strong></p><p><strong style=\"\">Hai sempre desiderato creare blog, magazine, portali in cui far scrivere i tuoi collaboratori?</strong></p><p><strong style=\"\">Hai sempre desiderato consentire agli utenti iscritti di commentare, condividere, scrivere recensioni sugli articoli?</strong></p><p><strong style=\"\">Hai sempre voluto realizzare gallerie immagini oppure ridimensionare correttamente le immagini di anteprima degli articoli?</strong></p><p><strong style=\"\"><br style=\"\"></strong></p><p>Se hai risposto in modo affermativo anche ad una sola di queste domande allora sei capitato nel corso giusto. </p><p>Con K2 potrai realizzare tutto questo e noi siamo qui per aiutarti a farlo attraverso i nostri dodici video della durata totale di un&#039;ora e tre quarti. </p><p><strong style=\"\">Che tipo di contenuti avrete?</strong></p><p>Questo corso, nel nostro spirito, è costituito totalmente da video perchè riteniamo che i video siano subito esplicativi. </p><p><strong style=\"\">Che terminologia è usata nel corso?</strong></p><p>Il corso affronta i vari argomenti con un linguaggio semplice e diretto, non sono richieste competenze specifiche</p><p><strong style=\"\">In quanto tempo completerete il corso?</strong></p><p>Il corso è strutturato in 12 video ed in totale sono circa 140 minuti. </p><p><strong style=\"\">Obiettivi di apprendimento</strong></p><ul style=\"\"><li style=\"\">installare e configurare k2</li><li style=\"\">creare gruppi campi aggiuntivi</li><li style=\"\">creare campi aggiuntivi</li><li style=\"\">importare contenuti joomla esistenti</li><li style=\"\">creare articoli</li><li style=\"\">creare categorie</li><li style=\"\">creare un gruppo k2</li><li style=\"\">creare una voce di menu che mostra la lista categorie</li><li style=\"\">creare una voce di menu che mostra un articolo in particolare</li><li style=\"\">creare una voce di menu che mostra una lista di articoli da una o più categorie</li><li style=\"\">pubblicare un modulo che mostra una lista utenti</li><li style=\"\">pubblicare un modulo che mostra gli ultimi commenti</li></ul>", 
    "end_date": null, 
    "title": "Estendi la potenza di Joomla con K2", 
    "price": "20.00", 
    "instructors": "antonio mercurio", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424266_7147_2.jpg", 
    "course_url": "https://www.udemy.com/corso-k2/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-16T20:40:47Z"
}