{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Introducing <strong style=\"\">Laravel</strong>, a standout <strong style=\"\">PHP</strong> framework that helps developers build standout applications. What is Laravel? It&#039;s a popular PHP framework similar to CakePHP or CodeIgniter. It offers all of the standard MVC capabilities and provides features targeted specifically at designers. In this course, I shows you how to install Laravel and Composer its dependencies manager and start creating pages with Laravel&#039;s powerful syntax and flexible HTML views. I&#039;ll also show how to use the Blade templating system, which will be a big help in the next chapter, when you build your first Laravel app a user authentication app. Last, you&#039;ll check your app and see how Laravel code holds up in testing.</p><p style=\"\">Topics include:</p><ul style=\"\"><li style=\"\">Installing Larave</li> <li style=\"\">Handle routing requests</li> <li style=\"\">Filter routes, and apply controllers</li> <li style=\"\">Outputting code and working with Laravel&#039;s advanced templating engine, Blade</li> <li style=\"\">Integrate a functional database with Schema Builder</li> <li style=\"\">Query data with Eloquent ORM, and keep your schema up to date with migrations.</li></ul><p style=\"\">All of these tutorials culminate in the final chapters, where you&#039;ll learn how to build your first app and deploy it on the web.</p><p style=\"\">I will issue hands-on practice challenges along the way to help you test your knowledge. Challenges are quick activities that give you a hands-on opportunity to practice and master what you&#039;re learning. I&#039;ll start each challenge by describing your core objectives for the activity. If a challenge involves using any sample files, I&#039;ll tell you where to find them. I&#039;ll also give you a rough estimate of how much time it took me to complete the challenge.</p><p style=\"\">Actually, the information in this course is ultimately intended to be applied to your own web apps. All you need is your desire to use the techniques I teach you to build your own application. I am going to cover everything about Laravel and I will be happy to create more videos if any new features will be added to Laravel in the future.</p>", 
    "end_date": null, 
    "title": "Everything About Laravel 5.1", 
    "price": "20.00", 
    "instructors": "Hassan Azimi", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582272_f615.jpg", 
    "course_url": "https://www.udemy.com/everything-about-laravel/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T15:59:58Z"
}