{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t      If you are considering a career in programming C# is one language that should be topmost on your study list.  </p>  <p>  \t<p>  \t\t<hr>  \t\t<p>  \t\t\t<em>&quot;Explained everything perfectly&quot;</em>        - <span style=\" color:rgb(53, 53, 53); \">Blake Williams</span>  \t\t</p>  <hr/>  \t\t<p>  \t\t\t<p>  \t\t\t\t<p>  \t\t\t\t\t<p>  \t\t\t\t\t\t      Microsoft revamped its development platform back in 2002 creating a brand new, state of the art programming system called .NET. On the same day that .NET was unleashed Microsoft also introduced its newest programming language, C#.   Today, many years later, C# is indisputably the top language in the .NET ecosystem.    It is used by millions of programmers in corporations across the globe and yet finds itself equally at home in startups and personal development studios.    While other language rise and fall in popularity C# maintains a constant presence at the top of the language charts.    The C# team is constantly improving the language, bringing us new tools like LINQ (Language Integrated Queries).    Take this course to get a peek as some of the newest C# features.  \t\t\t\t\t</p>  \t\t\t\t\t<p>  \t\t\t\t\t\t<p>  \t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t      What can you create with C#?  The possibilities are endless. It&#039;s a perfect fit for building large scale business applications and ASP.NET websites.    It&#039;s used in creating SharePoint applications and is also used for making Office add-ins.    If you have dreams of being a game programmer C# is the primary language for XNA Studio; the programming environment for making PC and XBOX 360 games.    It&#039;ll craft rich UI apps using Silverlight or Windows Presentation Foundation and it makes mobile apps for Windows Phone.   It can even be used to program embedded systems, electronics and robots.    C# is your gateway to a huge set of application types so sign up today and start building your own programs.  \t\t\t\t\t\t\t\t</p>", 
    "end_date": null, 
    "title": "Explore the Fundamentals of C# Programming", 
    "price": "25.00", 
    "instructors": "Walt Ritscher", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8744_fb05_5.jpg", 
    "course_url": "https://www.udemy.com/c-explorations-phase-one/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-07-26T03:00:50Z"
}