{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  If you want to learn Facebook application development completely from the start and ground-up , then this is the course for you. It is a perfect course for beginners to start out with the best. In this course you will learn the best and innovative way to learn Facebook application development. Unlike other courses in the market, this course doesn&#039;t focus on quantity but quality with innovation. The course contents are simple and clear and will give you a good understanding scenario of Facebook application development  </p>  <p style=\"\">  \tIn the current era of technology , if you want to earn money and want to be successful , then you can join this course which would help you to learn all the techniques and methods that are required to build an app for Facebook and then you would be able to earn money on the app you have created.  </p>  <p style=\"\">  \t<strong style=\"\">    This course contains how you can setup and configure a free way to create Facebook application unlike in other courses in the market which always show you the premium way of creating Facebook apps.  </strong>  </p>  <p style=\"\">  \t    This course would introduce you to <strong style=\"\">Open Graph API</strong> , which is the core part of Facebook application development and would teach you how to access Facebook <strong style=\"\">user&#039;s data via Open Graph of Facebook  </strong>  </p>  <p style=\"\">  \t<strong style=\"\">    FQL</strong> is introduced in this course , which helps you out to select <strong style=\"\">user&#039;s data</strong> from <strong style=\"\">Facebook database</strong> and in this course it has been taught perfectly with examples.  </p>  <p style=\"\">  \t    So don&#039;t think too much, you can always refund your money, if you don&#039;t like this course . Don&#039;t miss the chance and grab it.  </p>", 
    "end_date": null, 
    "title": "Facebook Application Development completely from scratch", 
    "price": "20.00", 
    "instructors": "Karim Baidar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260520_1468_4.jpg", 
    "course_url": "https://www.udemy.com/facebook-application-development-completely-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-13T13:36:42Z"
}