{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Significantly <strong style=\"\">cut theme development time down</strong> and supply your clients with a more professional product. By using the workflow taught in this course you will be able to charge more for your themes while taking less time to develop them. <strong style=\"\">Profit through productivity.</strong></p><p>This course details significant time savers, including how to <strong style=\"\">skip setting up a server</strong> on your computer and eliminate the need to upload files &amp; databases manually to your website host when the site is ready to launch. You&#039;ll be <strong style=\"\">working directly on your website</strong> host so your client can preview your work and begin entering content if/when you choose to show them the address, which will bring the launch date (and pay day) forward.</p><p>What makes this workflow truly unique is that you can <strong style=\"\">keep the benefits</strong> of working with files that are on your own computer. This course also teaches you how to set up powerful  essentials including <strong style=\"\">live reload</strong> and the basics of <strong style=\"\">version control</strong>, plus how to mirror files to your computer for faster loading, code completion, searching and more.</p><p>We will also cover <strong style=\"\">rapid HTML coding</strong> with the likes of Emmet, code templates and <strong style=\"\">Twitter Bootstrap</strong>. We&#039;ll implement Bootstrap the way it is intended to be used: in conjunction with LESS and other technologies which will allow you to have forms, breadcrumbs, alerts &amp; more <strong style=\"\">styled in seconds</strong> without any need to edit the HTML of your chosen CMS. All of which will be mobile friendly and compatible across modern browsers.</p><p>It is a complete workflow and we&#039;ll go over the tools of the trade and how they piece together. As an added bonus <strong style=\"\">every tool featured in this course is free</strong> for you to go ahead and download.</p><p>Browse the course curriculum to get an idea of what you&#039;re in for. You should get a lot of value out of this course.</p>", 
    "end_date": null, 
    "title": "Faster Theme Development: Profit Through Productivity", 
    "price": "20.00", 
    "instructors": "Anthony Felton", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542694_5fd3_5.jpg", 
    "course_url": "https://www.udemy.com/faster-theme-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T00:20:36Z"
}