{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course is a <strong class=\"redactor-inline-converted\">hands-on workshop</strong> aimed at beginners who want to learn to quickly build modern, responsive website for hobbies, home business or personal use.</p>\n\n<p>It's all based on WordPress and there is <strong class=\"redactor-inline-converted\"><em>no experience necessary</em></strong> to start creating professional websites fast.  </p>\n\n\n\n\n\n\n\n\n\n<p>The course concentrates on utilizing specially developed website templates to create a framework to build on, so early on you'll have a website up and running that can then be adapted to your needs.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>We will use a <strong class=\"redactor-inline-converted\">full version of WordPress</strong>, not the free blogging service.  This means you will need a hosted service, which will be covered in the first few lectures.</p>\n\n\n\n\n\n\n\n<p>After the introductory videos, there are a series of <strong>'live example'</strong> screen-based walk-through videos that take a step-by-step approach to creating fully working websites with the templates.</p>\n\n\n\n\n\n\n\n<p>Included is a resource pack with 3 different website templates that are designed to be easily modified to make your own professional website. I'll walk you through customizing your site to make it your own unique piece of the web.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Next we move into the marketing side of things and look at niche-markets, affiliate marketing and how to use the tools provided to 'monetize' your site.  For many lectures there are further resources provided online.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Finally we wrap it up by covering how to develop a long-term strategy for your site, how to get noticed by the search engines, and how to choose domain names and hosting services.</p>\n\n\n\n\n\n<p>You also get full access to an online resource that gives extra information on the main stages of building your website.</p><p>This course is about much more than simply building a website, it's about helping you discover the possibilities for yourself both professionally and personally.<br></p>", 
    "end_date": null, 
    "title": "Fast WordPress: Easy-Build Websites for Hobby or Home Biz", 
    "price": "30.00", 
    "instructors": "Craig Pennell", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786054_95a8_5.jpg", 
    "course_url": "https://www.udemy.com/fast-wordpress-websites-for-hobby-or-home-business/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T11:55:11Z"
}