{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\">- What is this course all about?</strong>  </p><p style=\"\">  \t                                Front End Development is a trending <strong style=\"\">job</strong>, engaging, well paid and full of challenges and wonders.  </p>  <p style=\"\">  \t<strong style=\"\">This course will teach you the skills to kickstart a career in Front End Development, assuming no previous knowledge of any of the topics presented.</strong>  </p><p style=\"\"><strong style=\"\">NOTE: </strong>a basic knowledge of how to use your computer and run programs is assumed.</p>  <p style=\"\">  \t<strong style=\"\">This course is all about helping you changing your career path (or creating a new one) and acquire the necessary skills to jump into the job market as soon as possible.</strong>  </p>  <p style=\"\">  \tAre you tired of courses teaching you skills that you cannot easily convert into a salary ? If so, this is the course for you.  </p>  <p style=\"\">  \t                                      Front End Development is an area of Web Development that includes all of the skills required to create the visual and interactive part of a Website. It&#039;s a complex mix of skills and technologies and one of the most fast growing and well paid IT sectors of the moment.  </p>  <p style=\"\">  \t                                      A Front End Developer is the link between the graphic designer, responsible for creating the visual design of a Web Application and the Backend Developer responsible for creating the computational logic behind the application. The Front End Developer brings the application to life creating rich, compelling experiences and allowing the user to interact with the data behind the application.  </p>  <p style=\"\">  \t                                      This <strong style=\"\">comprehensive course</strong> is aimed at students with no previous experience with Web Development or programming at all;  </p>  <strong style=\"\"> - What will I learn taking this course?</strong>  <p style=\"\">  \t                                We&#039;ll touch on all the foundational topics that form the toolbelt of a professional Front End Developer:  </p>  <ul style=\"\">  \t<li>Semantic HTML </li>  \t<li>CSS</li>  \t<li>Responsive Web Development</li>  \t<li>Javascript, Ajax and a dash of jQuery</li>  \t<li>Backbone.js!</li>  \t<li>The art of Unit Testing (brownie points during an Interview!)</li>  </ul>  <p style=\"\">  \t                                We&#039;ll learn by doing, building projects and adding functionalities over time, as our knowledge expands.  </p>  <strong style=\"\"> - What will I get from this course?</strong>  <p style=\"\">  \t<strong style=\"\">    By the end of the course</strong>, you&#039;ll have all the tools and practical knowledge necessary to build visually rich Single page Web applications, try your luck with job interviews and kickstart your career as a Front End Developer!  </p>", 
    "end_date": null, 
    "title": "Foundations of Front-End Web Development", 
    "price": "50.00", 
    "instructors": "Davide Molin", 
    "commitment": "20.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311538_d31f_3.jpg", 
    "course_url": "https://www.udemy.com/foundations-of-front-end-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T14:45:54Z"
}