{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In  this course we aim to help you understand Meteor Javascript by teaching you regular javascript first. So by breaking down the core fundamentals of javascript and helping you learn to write code we then open you up to meteor js. We start you out by showing you important aspects that is needed for javascript development  and then moves on to the Object Orientation aspect and then to meteor javascript. We cover javascripts hardest elements and try to make it more understandable and easier for you to use. </p><p>Those who want to learn javascript and meteor javascript should take this course. Here is how we teach you. </p><p><strong>We use</strong></p><ul><li><strong>L</strong>ectures</li><li>Hands On Assignments</li><li>Quizzes</li></ul><p>We use these methods to give you a university type setting and feel it is the best way for us to teach you these skills. With Lectures we go over the details of javascript and explain how things work and should be done. In Hands On Assignments we give you homework which helps push it into your mind and stay there. And in Quizzes we makes sure the knowledge has absorbed. We try to give you a University setting with out the high cost of a University.</p><p><strong>What are the requirements? </strong></p><ul><li>Nothing is pre required, We go over everything with you and cover everything you need to know about javascript. </li></ul><p><strong>What am I going to get from this course? </strong></p><ul><li>Over 30  lectures and Tons of content!</li><li>You will be able to efficiently write and understand JavaScript or meteor js</li><li>You will be on your way to becoming a great web developer</li></ul><p><strong>What is the target audience? </strong></p><ul><li>Anyone who wants a strong understand of JavaScript and meteor javascript</li><li>Anyone who does not think they can do it.</li><li>Anyone who enjoys the challenge of learning something new.</li></ul>", 
    "end_date": null, 
    "title": "Full Meteor Javascript : From Basic to Meteor Javascript", 
    "price": "20.00", 
    "instructors": "University of Geeks", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/686644_e162_2.jpg", 
    "course_url": "https://www.udemy.com/a-creatives-guide-to-javascript-mastering-the-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T02:42:35Z"
}