{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em>OBSERVE: For now the course is free on Udemy, since it is under development.</em></strong></p><p><strong>This course is about building web apps by learning web engineering and Python programming at the same time. We will be using a framework called Web2py which was created to make learning programming easy and enjoyable. But Web2py has also become a popular framework because it has turned out to be fast, scalable and that it allows for extreme developer productivity. </strong></p><p></p><p>My personal love for Web2py grew from the fact that I literally became ten times more productive compared to when I was trying to get my head around another popular but really hard to learn framework called Django. I hope you will feel the same taking this course.</p><p>This course uses a heavy mix of videos, short texts to reinforce what you already have seen in the videos and a lot of quizzes to keep your brain attention on where it should be: learning. </p><p>I assume you know nothing about programming or building websites, but that you have a hunger to start building stuff online, and you can't wait to get your first app online today.</p><p>Many courses take a dictionary approach to teaching programming throwing a book with commands out of context. This course is not one of them. We all know that learning things out of context has a bad smell and doesn't result in competence.</p><p>This course is thus built around mini-projects resulting in small apps that we connect to each other. We will focus on the stuff most courses forget, such as engineering principles and writing good code. This means learning to analyse problems, rapid design process, writing automated tests and writing code that is easy to maintain and much much more. </p><p>You should take this course if you are interested in getting started with developing apps online. See you in class!</p>", 
    "end_date": null, 
    "title": "Fun and creative web engineering with Python and Web2py", 
    "price": 0, 
    "instructors": "Mika Sjöman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394832_c3cf_2.jpg", 
    "course_url": "https://www.udemy.com/web-engineering-with-python-and-web2py/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-15T13:32:41Z"
}