{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Create Websites become a Web designer Complete course start to finish.</p><p><strong>Step by Step learning how to build a website from scratch!  We provide links to all the best resources and everything you need to build websites.</strong></p><ul><li><strong>Make money online creating websites</strong></li><li><strong>start your own business</strong></li><li><strong>save money create your own websites</strong></li></ul><p>This course is designed to help you learn to make websites, we start with the basics and concepts that you need to know to launch your own web business or create your own websites.  </p><p><strong>We demonstrate how to use HTML and CSS together to bring your web code to life.   Use HTML and CSS to create web templates that can be sold to make extra income.</strong></p><p>Everything you need to learn about creating websites is provided within this course.<br></p><ul><li>no wasted time watching someone type</li><li>quick lessons get right to the point</li><li>fully covered topics with real world examples</li><li>source files downloadable to work along</li><li>challenges and lessons</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li><li>quick response support to students</li><li>regular discussions</li></ul><div>We show you how to start with nothing and begin to create websites.  Picking your web editor and HTML5 boiler plates.   Best web design tools and resources.  How to answer client questions and what you should ask clients before beginning.   How to set the groundwork to begin the web design process.  Picking a domain and hosting.  SEO best practices and google webmaster guidelines.  How to design with mobile in mind.  Full web design process including wire frames and navigation planning.</div><div>We walk you through HTML and CSS and how to code.  Lots of examples and practice exercises.</div>", 
    "end_date": null, 
    "title": "Get started Creating Websites Everything you need provided", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/574876_fd08.jpg", 
    "course_url": "https://www.udemy.com/get-started-creating-websites-everything-you-need-provided/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-05T18:44:32Z"
}