{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  This course, the first of many on computational math, takes you on a beginner&#039;s tour through the IPython Notebook, a powerful tool for mixing code, models, text, plots, graphics and a lot more. We&#039;ll look at getting started with running a notebook server on the cloud, familiarizing oneself with the Notebook UI, as well as running code in it, taking advantage of IPython&#039;s rich magic functions, as well as its powerful display library.  </p>  <p style=\"\">  \tThe course includes about 5 videos, along with two quizzes, towards the end of the course. Further, since the course is about using the notebook, all course content consumers will get free accounts on MathHarbor for running notebook servers on the cloud - no strings attached.  </p>  <p style=\"\">  \tThe course should take approximately 3-4 hours to complete, depending on the time individual students might put into experimenting and playing with the notebook, while working on a module. The first section is about how the notebook works, and a tour through its user interface. The second section goes deeper, and talks about various magic functions available in the notebook, to do all sorts of things - timing code execution, running code in other interpreters, and so on - as well as a tour of the rich display system offered, which allows you to mix models, code, as well as rich media like plots, images, videos, audio and a lot more, in the notebook. The last video talks about the various things you can use the notebook for, as well as a short walkthrough of other math modeling tools and packages which can be used with the notebook, and which we intend to do future courses on.  </p>  <p style=\"\">  \tIf you&#039;re a programmer looking for a more intuitive environment to use, or a math nerd looking for a powerful medium to use for working on your models, this course should be a great jumping board. It&#039;ll help you quickly get started with the notebook, and let you rapidly move on to using it in a more serious manner.  </p>", 
    "end_date": null, 
    "title": "Getting started with the IPython Notebook", 
    "price": 0, 
    "instructors": "Rudraksh MK", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/190102_26c4_4.jpg", 
    "course_url": "https://www.udemy.com/get-started-with-the-ipython-notebook/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-28T04:49:02Z"
}