{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>LATEST COURSE UPDATE: JAN 2016</p><p>Are you struggling with your sound recording? This is the course for you... it’s actually two courses in one – why?</p>  <p>Because this course offers a two way approach. </p>  <p>If you need great results fast you can follow the Fast Path. This Fast Path is like painting by numbers. You get all the figures and settings and you are ready to go. If you can follow all the mentioned steps and equipment recommendations exactly then you are ready and start working on your course. </p>  <p>The second path – the Knowledge Path – is intended for those of you who cannot follow the fast path settings exactly, may it be because of different equipment or due to other roadblocks. The Knowledge Path enables you to troubleshoot your audio equipment, adapt software settings to your needs and suggests changes to your recording environment to achieve the intended result. </p>  <p>You will get:</p>  <ul><li>Fast-Path: Exact Settings, Hardware recommendations, Tips &amp; Tricks</li><li>Learn how to record and process great sound</li><li>Troubleshoot and know exactly where to look when things go wrong</li><li>Get confidence in sound recording and processing</li><li>Learn how to exactly measure your audio for correct loudness and eliminate guesswork</li></ul>          <p>This course will also enable you to make informed decisions about your equipment like software, plugins, microphones, amplifiers or audio interfaces and not to forget your recording room settings.</p><p>See you in the course.</p><p>Cheers Rene</p>", 
    "end_date": null, 
    "title": "Great Audio Recording & Processing for Course Creation", 
    "price": "20.00", 
    "instructors": "René Steiner", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/584522_0daa_3.jpg", 
    "course_url": "https://www.udemy.com/professional-audio-recording-processing-for-course-creation/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-16T14:03:47Z"
}