{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>If you want to cut through the indirect crap and just go head first into building an <strong>AngularJS app</strong> then this course will take you there.<br></p><p><strong>Hit the ground running with AngularJS</strong> is broken down into <strong>12 modules</strong> with each module ending with a <strong>real world</strong> application exercise.</p><p><strong>Initial App Skeleton</strong></p><p>\tBe able to define a module, create a basic app skeleton work with controllers and learn about controller scope</p><p><strong>Filters</strong></p><p>\tBe able to utilize built in Angular filters as well as create custom filters, learn about ng-model, ng-repeat, ng-change as well</p><p><strong>Directives</strong></p><p>\tCreating custom directives, directive types, content transclusion, and passing custom attribute data into directives</p><p><strong>Routing</strong></p><p>\tLearning how to do routing, ng-view directive, the routeProvider service, route controllers and organizing your app for route views</p><p><strong>Services</strong></p><p>\tWhy services are important, debugging in general, controllers, and refactoring for service usage</p><p><strong>AJAX/HTTP</strong></p><p>\tUtilizing the http service to grab server side content, and error handling of failed http responses</p><p>I've dropped the money into learning angular through reading too many crappy angularjs books and taking an excellent angularjs bootcamp and have had an angularjs mentor who is a google developer expert, and also I have real world experience of building AngularJS applications for big corporations. So I created this course to share my knowledge of Angular and bridge the learning gap in as short time as possible.</p><p><strong>Benefits of this course</strong></p><p>I've kept the fluff talk at a minimum in the videos, and have crafted some exericses that will really get you to apply what I've covered within the videos. so if you go through the course and complete the exercises you will see tremendous growth in a short period of time</p><p>after completing the course you will be able to create a single page app with good enough folder and file organization as well as code organization.</p><p>ok so that's enough talking, I can go into detail of what I can cover or you can look at the course outline and decide for yourself. You don't need any pre-requisite knowledge aside from being able to watch the videos and working on the exercises.</p><p>So let's get started building an AngularJS application as quickly as we can!</p><p><strong>What are the requirements?</strong></p><ol><li>A browser and a text editor</li><li>Basic HTML and Javascript knowledge</li></ol><p>Extra stuff below:</p><p>The course should take roughly a day to a few days to complete, depending on how quickly you can move.<br></p><p>I have created a ton of exercises after each chapter so you can apply and retain what has been covered in the videos. </p><p>The videos are shot at high resolution with crystal clear sound and are best experienced at full resolution.</p><p>You should take this course if you want to jump start your AngularJS career.</p><p><strong>Bonus</strong></p><p>I will be constantly iterating the course over time and adding new chapters on more advanced topics, so if you take this course today you will automatically have access to the new upcoming content.</p>", 
    "end_date": null, 
    "title": "Hit the ground running with AngularJS with Dion Yang", 
    "price": "20.00", 
    "instructors": "Dion Yang", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669536_20bf.jpg", 
    "course_url": "https://www.udemy.com/hit-the-ground-running-with-angularjs-with-dion-yang/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T11:05:45Z"
}