{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em><em><em>Setting up servers for your business or startup can be a tedious and expensive process, particularly when you're just starting out or switching to a new platform. <em><em><em>Amazon Web Services </em></em></em>is incredible but you can still feel like you're becoming an accidental System Administrator trying to set everything up correctly. However, with the <strong>right instructions</strong>, you can get up and running in a few hours--saving you time, money, and a headache. </em></em></em></p><p>This course will walk you through Amazon's Web Services, with a focus on setting up Django and leveraging their Free Tier to keep your project free (for low-bandwidth uses for one year). We'll start with the very basics of launching and configuring Django on EC2, discussing different ways to connect to your system while keeping it secure, we'll progress to fine tuning your system with fast and efficient content delivery, and finally we'll dive into all the ways that you can scale your system on this incredibly elastic platform. <br></p><p><em>A quick note: Amazon Web Services is used by some of the largest websites on the internet, including Netflix and Yelp, as it's extremely scalable, but, it's also a favorite of many entrepreneurs and VC's who know to take advantage of their Free Tier. It's just a great deal.</em></p><p><em>What this course is:</em><br></p><p><em>An easy-to-understand walkthrough on how to host Django using Amazon Web Services which covers: launching a Django-ready server in minutes or optionally launching a \"plain\" Ubuntu server and configuring Django + dependencies manually (see below for server details), setting up and enhancing security, using FTP &amp; SSH to transfer over project files (a sample project is included) securely, serving static (CSS/JS/Image) files from a Django server and leveraging Cloud Storage (S3 and CloudFront CDN) to make your site faster, <em>setting your project up for production, </em>upgrading your instance for immediate performance increases, adding more instances and load balancing them, separating and vertically scaling your database, automatic scaling with cloud monitoring, deploying automatically with Beanstalk, and more. I</em><em>f you're not happy after taking the course, you will absolutely get your money back. </em></p><p><em>(Server Configuration Details: Ubuntu Linux 14.04 with <em>Apache, Mod_WSGI, MySQL &amp; Django -- but you can easily switch to Nginx/PostgreSQL, if preferred)</em></em></p><p><em>What this course is not:</em></p><p><em><em>Amazon has a very wide range (hundreds) of features. If you are looking for help on a particular AWS feature, view the curriculum below to make sure that it's covered. We cover many features but cannot claim to cover everything.</em><br></em></p><p><em>You do not need your own Django project as this course provides a sample for you, however the focus is on hosting and configuring Django not creating projects. If creating Django projects from scratch is an interest, consider downloading my (free) course \"Create Your First Django Website - Fast &amp; Free\" as supplementary to this course.</em></p><p><em>Every single question that is raised in the discussion panel is responded to, but this may not be the best resource to diagnose your server issues. Keep in mind that Amazon offers all kinds of support that is available 24x7.</em></p><p>I've enjoyed working with Django and AWS these last couple years -- it's what I use for my business -- and I would now like to help more people take advantage of this great offer and incredibly scalable stack.<br></p><p>If you want to save yourself some time, money, and, possibly a headache, use this guide to speed up the process of understanding this powerful, scalable platform - remember, Amazon hosts everyone - from the busiest sites on the net, to startups on the Free Tier. </p><p>Click the enroll button to get started. </p>", 
    "end_date": null, 
    "title": "Hosting Django: Amazon Web Services (AWS) Fundamentals", 
    "price": "25.00", 
    "instructors": "BlueApple Courses", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537282_566d_4.jpg", 
    "course_url": "https://www.udemy.com/django-tutorial-amazon-web-services/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-25T18:26:30Z"
}