{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn how to set up a WordPress website from scratch in 30 minutes. We've cut out the fluff, so that you only learn what's most essential, as quickly as possible.</p> <p>With WordPress, you can make a business website to create an online presence, generate leads, or even sell products. You can also make a site for your personal brand to showcase your experience, work, and accomplishments. Last but not least, WordPress is the ideal platform for creating a blog. WordPress makes it easy to add and edit blog posts from multiple authors, complete with images, videos, audio, and other media.</p> <p>You'll learn exactly what you need to know to get your website live on the internet, step by step, from start to finish. No coding and no experience required.</p> <p>This includes the following topics:</p> <ul><li>What you need to create a website</li><li>What is a domain name</li><li>How to register a domain name</li><li>What is web hosting</li><li>How to get and set up the cheapest web hosting</li><li>What is WordPress</li><li>How to install WordPress</li><li>What is a subdomain</li><li>How to create a subdomain to use as a development site</li></ul> <p>You don't need a computer science degree and you don't need to pay a developer thousands of dollars to create a website. </p> <p>With WordPress you can create a beautiful, powerful website without writing code, and this course doesn't require any coding whatsoever. But what if you want to learn how to code? This course is still for you.</p> <p>The hardest part is getting started and that's exactly what you'll learn to do in this course. You'll learn what you need to get started like registering a domain and setting up web hosting. You'll also learn why you need those things and how to get them set up.</p> <p>Once you have a WordPress site up and running, it's a great way to start playing around with a real website as you learn more and more about web development. Many people start with WordPress and learn HTML, CSS, and even PHP as they tweak their WordPress site.</p> <p>Learn by doing. Let's go get started.</p>", 
    "end_date": null, 
    "title": "How to Set Up a Self-Hosted Wordpress Website in 30 Minutes", 
    "price": 0, 
    "instructors": "Hoku Ho", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599532_3a0b.jpg", 
    "course_url": "https://www.udemy.com/how-to-set-up-a-wordpress-website-custom-domain-in-30-mins/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T16:46:52Z"
}