{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tThis course is designed for busy small business owners or bloggers who ALREADY have a (self-hosted) WordPress website or blog created by someone else (or who have just a simple theme installed).  </p>  <p style=\"\">  \tIf you’re sick of struggling with your WordPress website or blog, or tired of having to contact your web designer to make changes that should be simple, this course is for you!  </p>  <p style=\"\">  \tTake this course if:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t·You’re tired of trying to wrangle WordPress  \t</p>  \t<p style=\"\">  \t\t·You’re tired of contacting your designer for help with every little thing  \t</p>  \t<p style=\"\">  \t\t·You already have a WordPress website set up and running, but just need to learn how to manage it  \t</p>  \t<p style=\"\">  \t\t·You don’t have time to Google, search, and wade through conflicting answers about how to make edits to your website  \t</p>  \t<p style=\"\">  \t\t·You want more freedom to do what you want, when you want, with your own website  \t</p>  </ul>  <p style=\"\">  \tIn this course you will learn the basics of updating and maintaining your WordPress website or blog. We won&#039;t cover coding or graphic design--just WordPress basics.  </p>  <p style=\"\">  \tLearn how to manage your own WordPress website quickly and easily through the use of screencasts. And go back over course material whenever you need a refresher!  </p>  <p style=\"\">  \tThis course will cover:  </p>  <p style=\"\">  \t·Logging into WordPress  </p>  <p style=\"\">  \t·Navigating the admin dashboard  </p>  <p style=\"\">  \t·Inserting and editing posts and pages  </p>  <p style=\"\">  \t·The difference between posts and pages  </p>  <p style=\"\">  \t·The difference between categories and tags  </p>  <p style=\"\">  \t·Editing and creating menus  </p>  <p style=\"\">  \t·Using widgets  </p>  <p style=\"\">  \t·Installing plugins  </p>  <p style=\"\">  \t·Inserting image galleries  </p>  <p style=\"\">  \t·And more!  </p>  <p style=\"\">  \tSo say “goodbye” to being dependent on someone else to manage your website, and say “hello” to the freedom of making the changes you want, when you want!  </p>  <p style=\"\">  \tHaving trouble? Feel free to ask questions in the course “Discussion” and I’ll do my best to help out. Please keep in mind that this course covers the BASICS only, so if something falls outside of the scope of the course, I’ll only be able to try to redirect you to an appropriate source.  </p>  <p style=\"\">  \tNote: Although the demo site in this video uses the Genesis Framework, it is not required to take this course (though I do recommend it!).  </p>", 
    "end_date": null, 
    "title": "How to easily Manage your WordPress Website", 
    "price": "20.00", 
    "instructors": "Erin Flynn", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/169144_adc0_2.jpg", 
    "course_url": "https://www.udemy.com/manage-wordpress-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-20T15:29:16Z"
}