{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t      Did you know that <strong style=\"\"><u style=\"\">the easiest and quickest way to create an automated online business that produces consistent and reliable recurring income</u></strong> is to start your own paid membership site?  </p>  <p style=\"\">  \t      A membership site is any site that contains material that can be accessed only by its members.  </p>  <p style=\"\">  \t      With membership sites, your customer gets well acquainted with who you are and the quality of the information and content you put out. So, as long as you provide great content, loyal fans will always return for more products.  </p>  <p style=\"\">  \t      Fixed-term membership sites run in a manner where you’ve setup X amount of weeks or months of products in advance. Thus, when a customer comes to your site, they buy and the system you’ve setup delivers everything automatically.  </p>  <p style=\"\">  \t      In other words there’s less technical setup, and less maintenance.  </p>  <p style=\"\">  \t      How would you like that?  </p>  <ul style=\"\">  \t<li style=\"\">With my videos,      you will learn how to setup the system, but there is a lot less technical      setup than traditional membership sites.</li>  \t<li style=\"\">Once they are      setup, they are hands free and can run on autopilot. You will need to      answer your support emails, but if done correctly you can lower them too.</li>  \t<li style=\"\">In the end, you      have a higher converting list of customers who, most importantly, trust      you.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">With that said, you can put it all in action and start creating your profit-pulling automated membership machine today, and avoid the mistakes that cost me thousands of dollars and hours of time – just by watching this video series.</strong>  </p>  <p style=\"\">  \tThe course has 10 videos with a total of 1.5 hours of content. I would suggest you watch all the videos before attempting to follow step by step.  </p>", 
    "end_date": null, 
    "title": "How to set up an automated membership website machine", 
    "price": "20.00", 
    "instructors": "Gilbert Lopez", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276820_6938_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-set-up-an-automated-membership-website-machine/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-07T20:08:27Z"
}