{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>EVERYTHING YOU NEED TO BUILD AN EXCELLENT DIRECTORY WEBSITE WITH FULL CONTROL OVER WHAT USERS CAN SUBMIT.</strong>  </p>  <p>  \t    ------------------------------------------------------------------------------------------------------  </p>  <p>  \t  Business are always looking for online directories to submit their business, products, etc. This is a multi-million dollar industry and it continues to grow.  </p>  <p>  \t  This courses teaches you how to build your own business directory from the ground up WITHOUT being a coding expert. All you do is follow along my step by step instruction to get it done. It&#039;s as simple as watching my screen and copying what I do.  </p>  <p>  \t  Once your directory site is up, you have two options:  </p>  <p>  \t<strong>Option 1 - Make it free</strong>  </p>  <p>  \t  People can submit their listings on your website for absolutely nothing.  </p>  <p>  \t<strong>Option 2 - Charge a fee</strong>  </p>  <p>  \t  Charge a small...or large fee for people to submit their listing on your website.  </p>  <p>  \t  Hiring a web designer to create a directory website like the one you&#039;re going to learn how to create will easily cost you $1,000&#039;s of dollars. You can use that money to spend on something else.  </p>  <p>  \t<strong>Features Includes:</strong>  </p>  <p>  \t<strong>Unlimited custom fields and forms</strong>  </p>  <p>  \t    You will be able to create custom fields and form type for any type of listing you want to create.  </p>  <p>  \t<br>  \t<strong>Monetize your website</strong>  </p>  <p>  \t    Make money by charging people a fee to submit their listing on your site.  </p>  <p>  \t<br>  \t<strong>Reports, ratings &amp; reviews</strong>  </p>  <p>  \t    Users will be able to write reviews, report fraudulent posts, and rate all entries.  </p>  <p>  \t<br>  \t<strong>Extensive configuration options</strong>  </p>  <p>  \t    The ability to configure the options are endless. You can do some amazing configuration without having to write a bunch of codes.  </p>  <p>  \t    Set up emails that will be sent when the entry has been submitted, published, unpublished or deleted.  </p>  <p>  \t<br>  \t<strong>And so much more</strong>  </p>  <p>  \t    At the end of this course, you will be able to create a full functioning classifieds website. You can make it local or global. The choice is yours.  </p>  <p>  \t<strong>How do I sign up?</strong>  </p>  <p>  \t    Click on the &#039;Take this course&quot; button at the top corner of this page...that&#039;s it!  </p>", 
    "end_date": null, 
    "title": "How To Create a Business Directory Website With Joomla", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333148_a65a_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-business-directory-website-with-joomla/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-01T01:27:25Z"
}