{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">An online community is a great place for people with the same interest to share their thought, experiences and stories with each other. This course will teach you how to build a social network that would allow your members to make friendship connections, to send messages to each other, to share ideas and statuses on a site-wide activity stream, and you will also learn how to create niche-related  groups to make your network even more interesting. You don&#039;t need to have any former experience with Wordpress and/or Buddypress, which are the platforms we will use in this course, since i show you how to use them. </p><p style=\"\"><strong style=\"\">Course Structure</strong></p><p style=\"\">The course is built in a &quot;Learn by Watching&quot; way, which is my favourite way of teaching and learning. I simply show you where i click and how i do everything on my screen, so you can see and imitate in your own system. </p><p style=\"\">The course will take about 2 hours to complete and i suggest you watch it on a tablet if you own one, so you can put it besides your computer while you work on your community website. </p><p style=\"\">Here are the steps we will go through in this course:</p><ul style=\"\"><li style=\"\">Website hosting - you will need one to get your platform online</li><li style=\"\">Wordpress installation</li><li style=\"\">Adding Wordpress (free) theme</li><li style=\"\">Learn Wordpress basics - content, menus, theme options, plugins, widgets</li><li style=\"\">Buddypress installation and configuration</li><li style=\"\">Network components and how to work with them</li></ul><p style=\"\"><span style=\"\"><strong style=\"\">What kind of network will i learn to build</strong></span></p><p style=\"\">The network you will build depends on your needs. I will give you all the tools you can use in order to create a network with the most possibilities Buddypress can provide, and it&#039;s yours to take what you need from it. You can build a public community for anyone to join. You can build a secret community for specific people with restricted content to make sure it stays private. You can build a half-public half-private community with the help of groups - where you can decide which ones are public, which ones are restricted and which ones are even hidden from a guest viewer.</p>I will teach you how to work with every component of Buddypress, and you can decide which one you need and want to use. If you don&#039;t want to let your members create friendship connections - you can deactivate this option. If you don&#039;t need groups - don&#039;t use them. If you don&#039;t want your members to be able to communicate through private messages - just don&#039;t allow it. Buddypress is such a flexible platform that you can really fit it to your needs and even change your configurations with a click of a button later on if you decide you want to add/remove a specific component.<p style=\"\"><span style=\"\"><strong style=\"\">Who should take this course?</strong></span></p><ul style=\"\"><li style=\"\">Anyone looking for people with a common interest to talk and share thoughts with</li><li style=\"\">Bloggers who want to take their blog to a new level and start an online community where they can engage with their readers</li><li style=\"\">Families who want to keep in touch in a special way - by creating a private family online community where they can share photos, videos and experiences with each other</li><li style=\"\">Businesses who want to raise credibility and connections with their customers by creating a warm space where they can keep in touch with them and talk a bout their products/services</li><li style=\"\">Promoters of a specific product who want to promote it in a unique way and create a social network around it</li><li style=\"\">Group of parents who want to create a convenient place where they can discuss about their children&#039;s activities for example - a community for a sport team, a class, etc.</li><li style=\"\">Group of friends who want to share more than words with each other by creating a (private) online community where they can communicate</li></ul><p style=\"\"><span style=\"\"></span></p><strong style=\"\">Additional Costs</strong>The only additional cost you might have (unless you already have a hosting account) is to the hosting provider. The costs vary from 4$-12$ per month depending on the company, and you should do your research about which provider would fit your website needs the most. In the course you will see how i sign up with one of the hosting companies and get a free domain for the first year.You might also be interested in getting a premium Wordpress theme, but that is not a necessity - the theme we will work with in this course is free and is good enough to keep it this way and to create a beautiful website and network.", 
    "end_date": null, 
    "title": "How to Create a Social Network For a Niche-Related Community", 
    "price": "30.00", 
    "instructors": "Maya Bielik", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524248_afa2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-social-network/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-09T15:35:06Z"
}