{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>If you want to create a video blog to promote your existing videos, or if you’d like to start vlogging and build an audience, this is the course for you.</p><p>We’ll build an actual video blog website step by step, from start to finish. You’ll learn how to get your website live on the internet and how to customize it with WordPress. No experience and no coding is required.</p><ul><li>The website we’ll build will have the following features:</li><li>Parallax header with custom image, site title, and tagline</li><li>Pinterest style, grid layout</li><li>Embedded YouTube videos</li><li>Social share buttons</li><li>Comment forms</li><li>Custom footer</li><li>Beautiful hover animations</li><li>Customizable colors with unlimited options</li><li>‘Follow Us’ widget with icons and links to profiles for Facebook, Twitter, Google Plus, Instagram, Dribble, Vimeo, Linkedin, Youtube, Flickr, Pinterest, Tumblr, Foursquare, Behance</li><li>Custom favicon (site icon)</li><li>Custom domain name</li><li>Unlimited bandwidth web hosting</li><li>Responsive web design, so it will look good on any screen size, tablet, or mobile phone</li><li>Custom Navigation bar</li><li>Page/post featured images</li><li>Categorized posts</li><li>Blog sidebar widgets with search bar, recent posts, and categories</li></ul><p>Don’t have a programming background? No worries, we’ll start from scratch. You’ll learn how to register a domain name, set up web hosting, and install WordPress (in other words, everything you need to get your site live on the internet). Then we’ll start customizing the site with WordPress. You’ll be able to quickly and easily add content and customize the design. All without writing code. </p><p>We’ll be using the Alizee WordPress theme, which is well designed, easy to use, and completely free. This theme is also very flexible, so it can be used for just about any type of blog or portfolio website.</p><p>We’ve cut out the fluff so that you can get your website online as quickly as possible and grow your audience. Now go get started!</p>", 
    "end_date": null, 
    "title": "How to Make a Video Blog Website From Scratch w/ Wordpress ", 
    "price": 0, 
    "instructors": "Hoku Ho", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646056_bc66.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-video-blog-website/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T17:41:34Z"
}