{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  This course will take <strong>anyone</strong>, even those with minimal experience, and show them how to set up their <strong>business email system</strong> and develop a <strong>professional looking website</strong> fast using easy to follow and simplified processes, <strong>best tools and solutions</strong> available, all <strong>without having to learn how to program</strong>.  </p>  <p>  \t  Avoid the pitfalls and use best of breed, tried and tested methods from a professional with years of experience.</p><p><strong>Save hours of time</strong> in launching your business and <strong>avoid significant development expenses</strong> by doing it yourself, without requiring any prior experience and <strong>no code</strong><strong> required</strong>!</p><p>Learn how to:</p><ul><li>Buy and configure your very own Domain Name</li>  \t<li>Create a scalable and secure email solution for your business that is set and forget</li><li>Learn how to configure you email on computer and mobile phones so you can access emails and calendars wherever you are</li>  \t<li>Setup dedicated website hosting that is fast, secure and cheaper than other shared hosting services and one that will also allow you to scale up as your business grows</li>  \t<li>Set up your  very own clean, professional looking website and customise it for your business</li>  \t<li>Launch your website and start building sales leads and generting an income online</li>  </ul>", 
    "end_date": null, 
    "title": "How to Build your Business Website and Email the fast way!", 
    "price": "20.00", 
    "instructors": "Luke Purcell", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/300506_1c22_4.jpg", 
    "course_url": "https://www.udemy.com/scalable-online-business-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-15T09:47:07Z"
}