{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn how to create a beautiful, portfolio website, in just one hour. This course is great for photographers, graphic designers, or anyone else who wants to showcase their work online, and acquire new clients.</p><p>We’ll create an actual portfolio website using WordPress. You’ll see how everything is done, step by step, from start to finish. No experience and no coding required.</p><p>The site will include the following features:</p><ul><li>image posts</li><li>photo galleries</li><li>about me page</li><li>frequently asked questions page</li><li>get in touch (contact me) page</li><li>contact form </li><li>responsive image lightbox</li><li>search bar</li><li>category pages for images and posts</li><li>one tap call button on mobile</li><li>one tap email button on mobile</li></ul><p>In addition, the website is completely responsive, so it'll look good on any screen, tablet, or smartphone.</p><p>Never built a website before? Don’t have computer science degree? No worries, we’ll start from absolute zero. You’ll learn how to register a domain name, set up web hosting, and install WordPress (in other words, everything you need to get your site live on the internet). This course is a great intro to WordPress, and since we’ll build with WordPress, you won’t need to know html, css, javascript, php, ruby… you get the idea. </p><p>WordPress is perfect for building a portfolio website. You’ll be able to get the site up and running quickly, adding content is a cinch, and you can maintain everything on the site on your own. We’ll be using Fukasawa WordPress theme, which is incredibly beautiful, easy to use, and best of all… it’s completely free! </p><p>If you want to display your photography, graphics, designs, or any other work on your own custom website, then this is the course for you. We’ve cut out the fluff, so that you can get your portfolio website online as quickly is possible. Now go get started!</p>", 
    "end_date": null, 
    "title": "How to Make an Online Portfolio Website from Scratch ", 
    "price": 0, 
    "instructors": "Hoku Ho", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628222_90b1_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-portfolio-website-photographers-designers/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T19:38:49Z"
}