{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t      This course forms part of our Wonderful World of WordPress series and in this specific course we take you on a journey that details step-by-step everything you need to do to get your own WordPress site up and running in no time.  </p>  <p>  \t    Most people who try to create a WordPress site get discouraged and give up. This is simply because they do not have the proper guidance and, therefore, they feel overwhelmed by the process.  </p>  <p>  \t<strong style=\"\">FINALLY MASTER WORDPRESS LIKE A PRO AND LEAVE THOSE FRUSTRATIONS BEHIND ONCE FOR ALL!</strong>  </p>  <p>  \t<strong style=\"\"> </strong>The shortcut strategies we teach to you in this course takes you by the hand and leads you through the WordPress creation process step-by-simple-step - all you have to do is follow along and, at the end, you will have your very own WordPress site!  </p>  <p>  \tFor those of you interested in <strong style=\"\">creating your own WordPress blog</strong>, we have included a <strong style=\"\">special bonus section</strong> containing an <strong style=\"\">instructional guide</strong>, <strong style=\"\">activity workbook</strong>, <strong style=\"\">eBook</strong> and <strong style=\"\">cheatsheet</strong> - all of which will help you to get your WordPress Blog up in a flash.  </p>  <p>  \t<strong style=\"\">What are you waiting for? Come on in and explore the Wonderful World of WordPress with MindMekka!</strong>  </p>", 
    "end_date": null, 
    "title": "How to Build Your Own Website with WordPress: A Step-by-Step Guide ", 
    "price": "40.00", 
    "instructors": "MindMekka ®", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416282_8796_4.jpg", 
    "course_url": "https://www.udemy.com/build-your-own-website-with-wordpress-a-step-by-step-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T04:53:32Z"
}