{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Video is  the most powerful communication tool; it’s the fastest way to share knowledge  and information.</p><p style=\"\">Now all companies  can adopt easily this technology using Open Source Video Solutions like&nbsp;<a href=\"http://www.kaltura.org/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Kaltura</a>.&nbsp;Kaltura is a powerful video streaming solution which supports Flash  &amp; HTML 5 sharing.</p><p style=\"\">In this  video course you’ll learn how to setup your own video streaming server behind  your corporate firewall.</p><p style=\"\">You’ll be  able to embed the videos into your Intranet website just like you do with  Youtube or Vimeo sites but keeping the content under your control.</p><p style=\"\">                </p><p style=\"\">We’re going  to setup a new VMware Virtual Machine, install Kaltura Open Source version and  configure it for store and stream videos.&nbsp;</p><p style=\"\">We&#039;ll install another Ubuntu server with WordPress and an specific template for sharing videos (very similar to Youtube) and will publish the videos uploaded to Kaltura into this server.</p><p style=\"\">The combination of these both technologies is like having an own corporate Youtube in your company where share videos with meetings, manuals, procedures, presentations but always keeping the knowledge behind your firewalls.</p><p style=\"\">We are going to follow all the process from  the beginning until finish creating a video and uploading it to kaltura up  to embedding it into a WordPress post.</p><p style=\"\">After the course you&#039;ll be able to adopt this technology just like some bigger companies are doing.</p><div style=\"\"><div style=\"\"><div style=\"\"><div style=\"\"><div style=\"\"><div style=\"\"><div style=\"\"><div style=\"\"><div style=\"\"><div style=\"\"></div></div></div></div></div></div></div></div></div></div>  ", 
    "end_date": null, 
    "title": "How to create your own Intranet Video Streaming Server", 
    "price": "25.00", 
    "instructors": "Alberto Sanz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61337_d97c_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-your-own-intranet-video-streaming-server/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-21T16:38:28Z"
}