{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>OVER 4,000 SUCCESSFUL STUDENTS HAVE ALREADY TAKEN THIS COURSE</strong>  </p>  <p>  \t                                                              Over the last 6 years, I've spent thousands of pounds having custom websites designed and built. These days you can get a professional looking website that does everything you need without breaking the bank. I now use WordPress for all of my websites as I've found it to be the most versatile platform available.  </p>  <p>  \t                                  At the end of the course, you will be able to quickly create your own WordPress website which will enable you to take your business online and reach potential customers anywhere on the planet.  </p>  <p>  \t<strong>              This course is for you if:  </strong>  </p>  <ul>  \t<li>You want to learn how to quickly set up a WordPress website that enables you to build an online audience</li>  \t<li>You want to start an online business</li>  \t<li>You want to use content marketing to attract new customers</li>  \t<li>You are interested in making money online (e.g. through affiliate marketing)</li>  \t<li>You have a bricks and mortar business &amp; would like to do business online</li>  </ul>  <p>  \t                                          If you'd like to be able to create your own WordPress website without having to pay a developer hundreds or possibly thousands of dollars, this course is for you.  </p>  <p>  \t<strong>About this course:</strong>  </p>  <ul>  \t<li><em>Over 4,000 successful students</em></li>  \t<li><em>Full, free lifetime access</em></li>  \t<li><em>All future extra lectures and upgrades are always included for free</em></li>  \t<li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li>  </ul>  <p>  \t<strong>About the course creator</strong>  </p>  <p>  \t                                                                            David Moore is a serial entrepreneur and online business coach who helps frustrated employees escape the jobs they hate by starting their own freedom business.  </p>  <p>  \t                                                                            His purpose is to help turn your passion into a thriving business whilst avoiding the same mistakes he did by giving you the expert advice, resources and tools you need to succeed.  </p>  <p>  \t                                                                            You can have your own WordPress website up and running today, right after going through this course.  </p>  <p>  \t<strong>  Click the \"take this course\" button, top right, now ... <em>every hour you delay is costing you money</em>...  </strong>  </p>  <p>  \t                                                                            David Moore  </p>", 
    "end_date": null, 
    "title": "How To Create A WordPress Website Without Paying A Developer", 
    "price": "25.00", 
    "instructors": "David Moore", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320798_03d9.jpg", 
    "course_url": "https://www.udemy.com/wordpress-website-in-under-one-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-16T10:44:16Z"
}