{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>If you want to create a beautiful website to find more clients for your agency or freelance business, this is the course for you. </p><p>We’ll build an actual single page, portfolio website together, step by step, from start to finish.</p><p>You’ll learn how to get your website live on the internet and how to customize it with WordPress. No experience and no coding is required.</p><p>The website we’ll build will have the following features:<br></p><ul><li>Call-to-action header with beautiful image, text, and button</li><li>Simple contact form</li><li>Display email, phone, and dress contact info</li><li>‘What We Do’ section</li><li>‘Our Skills’ section</li><li>‘Recent Works’ section with image, logo, and link to project</li><li>Page for portfolio item with image gallery</li><li>Video blog posts</li><li>Blog sidebar widgets with contact info, recent posts, and search bar</li><li>Embedded YouTube videos</li><li>Page/post featured image</li><li>Testimonials section with photo, name, and quote</li><li>Custom footer</li><li>Parallax scrolling</li><li>Single page, freelance/agency theme</li><li>‘About Me’ widget</li><li>‘Follow Us’ widget with icons and links to profiles for Twitter, Facebook, Pinterest, YouTube, Google Plus, Dribbble, Tumblr, Instagram</li><li>Custom favicon (site icon)</li><li>Custom domain name</li><li>Unlimited bandwidth web hosting</li><li>Responsive web design, so it will look good on any screen size or mobile phone</li><li>Custom Navigation bar</li><li>Anchor links that jump to specific areas of the page</li></ul><p>Don’t have a programming background? No worries, we’ll start from scratch. You’ll learn how to register a domain name, set up web hosting, and install WordPress (in other words, everything you need to get your site live on the internet).</p><p>Then we’ll start customizing the site with WordPress. You’ll be able to quickly and easily add content and customize the design. All without writing code. We’ll be using the Pixova WordPress theme, which is well designed, easy to use, and completely free.</p><p>We’ve cut out the fluff so that you can get your website online as quickly as possible and start attracting new clients. Now go get started!</p><p><br><br></p>", 
    "end_date": null, 
    "title": "How to Make a Single Page Website for Freelancers & Agencies", 
    "price": 0, 
    "instructors": "Hoku Ho", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639654_d61b.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-portfolio-website-for-freelancers-agencies/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T20:38:03Z"
}