{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>NOTE: Over <strong>3</strong><strong>,000 paying students</strong> have enrolled in this course <strong>in the first 4 days </strong>and have already left <strong>glowing reviews</strong>!</em><br></p><p><em><em><em>Course fully updated 13th February 2016</em></em><br></em></p><p>***************************************************************************************</p><p>Never made a website? In that case, this course is designed especially for you. I'll show you how to create <strong>your own website</strong> with the <strong>WordPress</strong> platform. The process of creating a website with wordpress is not complicated, and one might even say that it’s simple, because you don’t need any programming language, such as HTML, CSS, Javascript, etc. In this course I will show you how to create a website without any knowledge of coding. I'll show you step by step what to do to create your first own website within a few hours. </p><p><strong>In this course you will learn:</strong></p>  <p>• What is wordpress</p>  <p>• How to create a free website</p>  <p>• Where to buy your own domain and web hosting</p>  <p>• How to synchronize the domain with hosting, so the website works properly</p>  <p>• How to personalize the website to your needs</p>  <p>• How to add eye-friendly content to the website</p>  <p>• To add pictures and videos to posts</p>  <p>• How to manage users on your website</p>  <p>• Where to download for free, or buy very nice wordpress themes, from which your website will become very attractive to users</p>  <p>• How to upload an existing themes to the website</p>  <p>• What are widgets and why they are used</p>  <p>• How to create a navigation menu that will make it easier to navigate through your website</p>  <p>• What are plugins and what they are usedfor</p>  <p>• What are tags and categories, how to create and manage them</p>  <p>• How to create pages \"About us\" and \"Contact us\"</p>  <p>• How to analyze traffic on your website</p>  <p>• What is SEO, and  youwill learn the basic issues related to the positioning of websites</p>  <p>If you run a <strong>small business</strong>, or if you’re an owner of a <strong>big company</strong>, it is in the twenty-first century. That is, in the Internet age, so you must have a website. If for some reason you don’t have one, then you lose a <strong>lot of money</strong>. Nowadays, people look for everything online, and you’re not there. Think about that! Buy this course today and Multiply your earnings. </p>  <p>If you want to create a private website or blog, this course will also be useful to you. Running a website is a huge dose of adrenaline, fun, plus you can <strong>make</strong> some <strong>money</strong>. If you buy this course I will provide you with 24/7 assistance. If while watching this course, or after seeing it you have any questions, I will try to answer all of them as soon as possible. This course is subject to <strong>satisfaction guarantee</strong> and a <strong>3</strong><strong>0 day money back guarantee</strong>. If for some reason this you don’t like this course, I will give you back your money, no explanation necessary. As you can see, you risk nothing by buying this course, so what are you waiting for? Press Take This Course, and I'll see you soon inside.</p>", 
    "end_date": null, 
    "title": "How to Create a Website Within a few Hours - WordPress 2016", 
    "price": "20.00", 
    "instructors": "Greg Lata", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/752432_a3cc_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-website-wordpress-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-04T16:15:52Z"
}