{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>DO YOU WANT BUILD A COMMUNITY FORUM EASILY?<br></strong><strong>LEARNING THE LAST VERSION OF SIMPLE MACHINES FORUM 2</strong><strong>?<br></strong><strong>AND YOU DO NOT KNOW HOW TO DO IT?</strong></p>  <p>  \t <em>JOIN THIS COURSE AND MAKE YOUR PROFESSIONAL FORUM WEBSITE FROM SCRATCH!</em>  </p>  <p>  \t                Simple Machines Forum 2 — SMF in short — is a <strong>professional package </strong>that  allows you to create your own <strong>forum </strong>with many powerful features for you as well as your <strong>community </strong>within minutes. <em>SMF is an open-source project.</em> You don't need any experience to take this course.  </p>  <p>  \t                    Throughout the course, we'll be building a handful of <strong>complete forum website step-by-step</strong>, personal or professional, and be transformed from a total beginner to a confident webmaster: I think you'll be excited to learn!  </p>  <p>  \t<strong>BUILDING CUSTOM FORUM SITE WITH SMF FROM SCRATCH </strong>course allows you to learn at your pace without spending entire days at a time away from the office or your college. This course includes basic introductory lessons to <em>Simple Machine Forum</em> package. You learn <strong>commands </strong>and <strong>techniques </strong>for creating a <strong>New board</strong>, <strong>Adding new Members</strong>, create <strong>Categories</strong>, <strong>Permissions</strong>, <strong>Smileys</strong>, <strong>Subcategory</strong>, and more with easy. You will become familiar with the <em>Admin Panel</em>, Theme customization, Adding Logo to your site, create the homepage, Managing your website, insert a Slogan and Avatar, <em>creating a great community</em>! <em>Your professional Forum</em>.  </p>  <p>  \t                    Why pay hundreds of dollars for build a Community Forum when you can receive with this course: high quality, interactive video, web-based Forum training at a fraction of the cost?  </p>  <p>  \t<em>The course is presented via an intuitive, easy-to-use interface, allowing you to learn at your own pace.</em>  </p>  <p>  \t<strong> ARE YOU READY TO LEARN THE LAST SMF SOFTWARE? AND BUILD A PROFESSIONAL COMMUNITY FORUM NOW!!</strong>  </p>  <p>  \t  \t<strong> The course package:</strong>  </p>  <p>  \t                    - 17 video tutorials (about 3.20 hours total) <br>  \t                    - 1 exercise tutorials: step by step, how create your community forum online <br>  \t                    - Videos available, 24 hours on 24 <br>  \t                    - Learn when you want (every day or week-end) <br>  \t                    - Build a Professional Forum Website!  </p>  <p>  \t  \t<strong> The course outline:</strong>  </p>  <p>  \t                   - Introduction To SMF  \t                   - Features  \t                   - Lets Get Started  \t        - Admin Panel: categories, boards...  \t        - Themes and Layout Settings  \t        - Advanced Options  \t        - Exercise: build a community website \"Computer Technology\"  </p>", 
    "end_date": null, 
    "title": "How to Build Your Forum from Scratch", 
    "price": "20.00", 
    "instructors": "JobboJ Courses", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299546_13fb_2.jpg", 
    "course_url": "https://www.udemy.com/building-a-custom-community-forum-with-smf-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T09:28:06Z"
}