{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  This course takes you through the entire process of building a Joomla-powered website. Although the focus is naturally on Joomla, other important topics are also covered including <strong style=\"\">how a website works</strong> and <strong style=\"\">website planning</strong>.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Build a Joomla Website From Scratch </em></strong>was originally produced in 2010 and this latest version contains the same material that has been presented in workshops at a cost of up to $400 per student. This online version is fantastic value and teaches you everything you need to build a typical website. <strong style=\"\">A workbook is included.</strong>  </p>  <p style=\"\">  \t  Your teacher is Richard Pearce who has been working with computers since 1983. He went online when bulletin boards were popular and migrated to the Internet in 1993. Richard stumbled across Joomla in its early days and started teaching it in 2008. Since then, tens of thousands have watched various versions of Richard&#039;s courses that demonstrate how to build a Joomla Website the right way, the first time.  </p>  <p style=\"\">  \t  If you have ever considered building your own website or if you would like to start a new career by becoming a web developer, then this course is for you.  </p>  <p style=\"\">  \t<strong style=\"\">For Joomla version 3</strong>  </p>", 
    "end_date": null, 
    "title": "How to Build a Joomla 3 Website from Scratch", 
    "price": "50.00", 
    "instructors": "Richard Pearce", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/80142_a65d_2.jpg", 
    "course_url": "https://www.udemy.com/build-a-joomla-3-website-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-17T21:22:47Z"
}