{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em><em><strong>**Course price reduced to $9 until the end of July** </strong>Will return to normal price 8/1/15</em></em></p><p><em><em><strong>UPDATED June 2015</strong>: </em><em>Case Study with 6 lectures added with Wordpress &amp; PayPal guides</em></em></p><p><strong><em>Join over 800 students who enrolled in the first 2 days!</em></strong></p><p><strong><strong>About this course:</strong></strong></p><ul><li>Free lifetime access to all course content</li><li>Added lectures and updates will also be free</li><li>Udemy <strong>30 day money-back guarantee</strong> if you don't find the course valuable</li><li>Nothing is required to take this course - complete beginners are perfect</li><li>You can get my book about<em> How To Start a Business Online</em> completely free</li><li><em>I've created dozens of websites myself </em>- <strong>now you can too!</strong></li></ul><strong></strong><p><strong>What you will gain from taking this course</strong></p><p>This course will show you how to find and register your very own unique domain name and setup a web hosting account. It will also guide you through the process of creating your first web page. You will also learn how to edit web pages using different methods, and manage your files on your hosting account and your local computer.</p><ul><li>38 lectures and more than 3 hours of content</li><li>List of useful links and resources</li><li>Step-by-step guides</li><li>The tools you need to be successful</li><li>Live example pages and templates </li><li>Case Study for one website to tie it all together</li></ul><span></span><p><strong>You don't need to know anything about domains, hosting, HTML, CSS, or Jquery</strong></p><p>We will start at the beginning and go through the process step-by-step. The course is structured in a logical way so you can follow along with each lecture and end up with your own website that is hosted online and located at your personal domain name.</p><p><strong>After taking this course you will be able to:</strong></p><ul><li>Register a domain name</li><li>Set up a web hosting account</li><li>Create a basic web page</li><li>Edit a web page using different methods</li><li>Monetize a website with Affiliate Links</li><li>Upload a web page to a hosting account</li><li>Understand other options for getting a ready-made website platform</li><li>Understand options for eCommerce and Blogs</li><li>Install WordPress on a website</li><li>Find out about more advanced topics</li><li>Put a PayPal button on a website</li></ul><p><strong>Why should you take this course?</strong></p><p>You should take this course if you are new to websites and want a simple, straightforward guide to getting started. This is also a perfect course for people who had someone else create their website but now you're stuck because you want to make simple edits and changes but don't know how to.</p><p><strong>Course Structure:</strong></p><ol><li>How to find and register a unique domain name</li><li>Simple instructions for setting up a hosting account for less than $49/year</li><li>Tutorial on pointing a domain name to a separate hosting account</li><li>Options for purchasing a combined domain + hosting solution</li><li>Step-by-step guide to create your first basic web page using different methods</li><li>How to edit web pages right on your hosting account or from your computer</li><li>Instructions for uploading files to your hosting account</li><li>Options for when you may not want to create your own website</li><li>A look into more advanced topics</li><li>Case Study that ties all the sections together</li></ol><span></span><p><strong>Who Shouldn't Take This Course</strong></p><p>Advanced web developers, or other people who have repeated experience registering domain names, setting up hosting accounts, and creating or editing web pages.</p><p><strong>About Me</strong></p><p>I started building websites over 14 years ago when I went to college for Computer Technology. Since then I have been designing and developing sites for friends, family and business clients. At times it has been my full-time job, and other times I have been more of a part-time consultant. My work has ranged from simple, static websites for individuals and small businesses up to complicated web applications for Universities. Because my work has been so diverse there is a good chance I will be able to relate to your situation and quickly be able to answer any questions that you have.</p><p><strong>Why I made this course</strong></p><p><em>1. To Show You How to Edit and Manage Your Existing Site</em></p><p>One reason I created this course is because I know quite a few folks who decided it was time to give their small business an online storefront and because they had no idea about the basic steps required to set up a website they spent a LOT OF MONEY at web design firms only to be stuck with a site they didn't know how to edit or manage. And my clients have complained to me that their hosting companies are constantly UPPING THEIR FEES but they don't know how to set up a different account.</p><p><em>2. To Explain When You Should Use an Existing Platform</em></p><p>Other people aren't sure if they need to use and eCommerce platform like Shopify or a blogging platform like Wordpress. So I wanted to explain when you should use them.</p><p><em>3. To Walk You Through the Nuts and Bolts of Setting Up Your First Website</em></p><p>And lastly, some of my clients and friends just want to set up a simple website but they just don't know where to start. There are many tutorials about how to code, but you really have to dig through boring help files to understand the nuts and bolts of setting everything up.</p><p><strong>This course is created for you and intended to be a valuable resource</strong></p><p>I will be available to answer any questions and even add additional content and lectures as needed.</p><p><strong>Supplemental material</strong></p><p>The course also has a comprehensive links to help you navigate through the ins and outs of setting up your website. Additionally the course will demonstrate the tools and services I use so you know how they work.</p><p><strong>Bonus material</strong></p><p>I recently published a book that goes beyond this course and discusses how to get your business started online and what it will take to be profitable. </p><p>THE COURSE INCLUDES A WAY FOR YOU TO GET THIS BOOK FOR FREE!</p><p><strong>Curriculum Overview</strong></p><p>1. <em>How to find and register a unique domain name:</em> </p><p>There are a lot of options out there for where to register your domain. Which one should you use? How does it work? What is the science behind domain names? <strong>I answer all these questions in this lecture, and when we are done you will be able to register your own domain name quickly and cheaply.</strong></p><p>2. <em>Simple instructions for setting up a hosting account for less than $49/year</em>: </p><p>It is really hard to narrow down which hosting company to use, and even if you look at review lists of Best Hosting Companies it is hard to pick a winner. Then you try to set up an account and get a lot of nasty up-selling and confusing price structures. Later you find out the discounted prices at some companies go way up after the first year and you end up spending more year over year than you would have elsewhere! <strong>I will help you sort through the confusion and give you some tips on how to avoid all the up-selling and price changes, and I show you some companies that provide great service at good prices with less pressure.</strong></p><p>3. <em>Tutorial on pointing a domain name to a separate hosting account:</em> </p><p>If you purchase a domain and hosting service from separate companies (I'll show you how and why you might want to) you have to connect them. <strong>I'll show you how to do it in no time!</strong></p><p>4. Options for purchasing a combined domain + hosting solution: </p><p>If you want to save money during your first year, you can get a free domain with your hosting service. <strong>I'll quickly walk you through the process.</strong></p><p>5. <em>Step-by-step guide to create your first basic web page using different methods</em>: </p><p>We won't go in to depth on how to write code, many people on Udemy have done that quite well. <strong>But I will show you how to create a basic web page, and more importantly I will show you where to find FREE help resources and examples, even a free sandbox, that will help you learn more and more on your own.</strong></p><p>6. <em>How to edit web pages right on your hosting account or from your computer:</em> </p><p>This is designed specifically for folks who had someone else build them a website, but now every time they want to make an edit they have to call up the web design company. Even if it's just to change one word! That's outrageous. <strong>I will show you how you can do it yourself.</strong></p><p>7. <em>Instructions for uploading files to your hosting account:</em> Want to build webpages on your computer? <strong>I'll show you how to get them online and show you how to use a free tool that makes it a breeze.</strong></p><p>8. <em>Options for when you may not want to create your own website:</em> </p><p>Sometimes it makes more sense to use a full-service platform that has professional templates and packages so you don't have to create your own web pages.<strong> I'll discuss my favorite ones and tell you when and when not to use them. </strong>(Even if you are already planning to go this route you may want to take this course because it will still be helpful to know how to register your own unique domain name) </p><p>9. <em>A look into more advanced topics:</em> </p><p>Curious about whether you can actually make a sophisticated, professional website from scratch? <strong>You can and I'll show you some examples to whet your appetite.</strong></p><p>10. <em>Case Study that ties all the sections together:</em></p><p>In the Case Study we will actually purchase a domain name, set up hosting for the domain, link it to our hosting account. Then we will create a basic web page (NO CODE) for the website and view it live online. Later we will go back and edit that same web page, add pictures to it, put an Amazon Affiliate Link on it, embed a YouTube video on it and perform basic text and font edits. Lastly we will install WordPress and put a PayPal button on the site.</p><p>REGISTER YOUR DOMAIN BEFORE SOMEBODY ELSE DOES:</p><p><strong>You can scroll right up to the top and click Take This Course to get started setting up your website today!</strong></p><p>If you read this far, you've accomplished a lot already - I hope to see you in the course.</p><p>-Andrew Tye</p>", 
    "end_date": null, 
    "title": "How to Register a Domain, Set Up Hosting, and Edit Web Pages", 
    "price": "20.00", 
    "instructors": "Andrew Tye", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505780_0ad6_3.jpg", 
    "course_url": "https://www.udemy.com/register-domain-setup-hosting-create-web-page/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T03:50:10Z"
}