{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><b><i>WordPress Speed &amp; Security Optimisation: Turn Your WordPress Site into a Speed &amp; Security Powerhouse to boost SEO, improve site user experience, and increase your sales.</i></b></p><p>In this course, you will learn how to optimise your WordPress site in two crucial areas:</p><p><i>1.</i><i>Site Speed</i></p><p><i></i><i>2.</i><i>Site Security</i></p><p><b>Part I: WordPress Site Speed Optimisation</b></p><p>No matter what type of website you have, or what the primary purpose of that website is, the time it takes for your site and pages to load is a crucial and determining factor in your success. Here's why:</p><p><b>1. Google likes sites that are built for speed</b></p><p>Page speed is taken into consideration as a ranking factor in Google's algorithm for desktop and mobile sites.</p><p><b>2. Most web users have an uncompromising need for speed</b></p><p>Take a moment and reflect on your own behaviour when surfing the web. How long do you wait for a page to load before jumping ship? Not sure? Well, according to recent studies it could be as little as 2 seconds, with a maximum of 4 seconds for the more indulgent.</p><p>Page speed directly impacts every imaginable facet of your website and, therefore, it also indirectly impacts on your business performance. Faster load times have been shown to increase and improve search rankings, organic traffic, page views, conversions, user experience and site revenue. In short, a faster site attracts more customers and has them leaving with a smile, and what equals more customers who are more satisfied? Increased profits for your business.</p><p>This course will teach you everything you need to know to make your site lightning fast:</p><p>- Which tools to use for testing website speed and how to use them</p><p>- Detailed instructions that walk you step-by-step through the process of installing plugins that lead to massive speed increases.</p><p>- How to optimise your homepage, media files and database</p><p><b>Part II: WordPress Security Optimization</b></p><p>Most WordPress users are blissfully unaware of how vulnerable they are to hackers and just how many WordPress sites get hacked on a daily basis.</p><p>Without boring you with the gory details, suffice it to say that if you have a WordPress site you need to make it a priority to ensure that your site security is efficient and up to date.</p><p>In this course, you will learn a <b>variety of methods</b> you can employ to <b>optimise your WordPress site's security</b>, and the best news is that <i>each of these actions can be completed in five minutes or less!</i></p><p><b>Enroll in this course and let's make your WordPress site shine. Let's make it WordPress Platinum!</b></p>", 
    "end_date": null, 
    "title": "How to Optimise Your WordPress Website's Speed & Security to Improve SEO & User Experience", 
    "price": "30.00", 
    "instructors": "MindMekka ®", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425910_ec27_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-your-wordpress-site-blazing-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T13:16:43Z"
}