{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><br style=\"\"></p><p>In this course, hosted by Jack Carr,<strong style=\"\"> someone who knows what its like to learn from online video tutorials</strong>, you will learn HTML and CSS, this will include everything you need to create a professional level static website. We strive to really make you understand the core concepts behind the language.</p><p>&nbsp; <br style=\"\">We believe that if you truly understand what you are reading, you will be able to learn at a much quicker pace and implement the knowledge and skills much easier. We make sure to guide you through at a good pace. Being a native English speaker, you will be able to understand exactly what is going on.<br style=\"\"><br style=\"\">In this competitive and always increasing online world, knowing HTML and CSS will give you the <strong style=\"\">head start on the competition</strong>. Knowing how to build your very own beautiful websites will open many doors and lines of income.<br style=\"\"><br style=\"\">There is an &nbsp;instructor on hand almost 24/7 to answer all of your questions. We do this is a full time job so we are always available on facebook too. We truly believe that if we go above and beyond we can change the lives of those around us.<br style=\"\"><br style=\"\">There is truly <strong style=\"\">no better way to learn HTML and CSS</strong>. We offer one of the <strong style=\"\">most comprehensive HTML and CSS courses online at one of the best prices.</strong> We believe that if you buy a video course&nbsp;that&#039;s&nbsp;what you should receive. <strong style=\"\">That is why our courses are 100% video</strong>. No slides to confuse you.<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "HTML and CSS Beginner Guide", 
    "price": "45.00", 
    "instructors": "Jack Carr", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/30901_fb91_3.jpg", 
    "course_url": "https://www.udemy.com/htmlcss-from-zero-to-hero/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-29T15:38:48Z"
}