{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>HTML + JavaScript + CSS</strong></p><p><strong>Não importa qual é a linguagem de backend que você vai usar (java, php, asp), dominar html é essencial para quer quer ser um desenvolvedor web.<br></strong></p><p>Para você criar site precisa aprender HTML. Entre definitivamente para o mundo de desenvolvimento web. Curso Webdesigner, criação de Sites com HTML, DHTML, javascript e CSS + dreamweaver cs4. São 145 videoaulas.<br></p>\n<p><strong><br>Veja aqui um pouco do que você vai aprender:</strong><br></p><ul><li>Dominar html + javascript + css</li><li>Conhecer todas as TAGS</li><li>Usar CSS - Cascading Style Sheets, que são as folhas de Estilo</li><li>Criar e gerenciar formulários</li><li>Usar as camadas DIV, assim poderá colocar textos e imagens onde quiser dentro da tela</li><li>Criar formulários completos como cadastro de Clientes</li><li>Domine JavaScript em 30 arquivos exemplo</li><li>Aprenda a fazer uma calculadora completa com HTML puro</li><li>Aprenda a criar menus horizontais, verticais e circular.</li><li>Você irá primeiramente aprender todos os códigos a mão, e depois aprenderá usando o dreamweaver cs4, uma das melhores e mais usadas ferramentas para criar de sites, facilitando e agilizando muito o processo de criação de páginas web.</li><li>Aprenda a montar formulários completos, validação de campo, máscaras nos campos... enfim tudo o que você precisa saber para montar seus formulários que são tão importantes para os desenvolvedores web. Tudo ensinado passo a passo</li><li>Aprenda a montar textos em 3d usando camadas (DIV)</li><li>Enfim, verá como criar sites completos</li></ul><p><strong>HTML</strong></p><p>Aprenda a criar no braço uma página web usando apenas as tags. Veja algumas as tags que vai aprender a usar: &lt;html&gt; &lt;head&gt; &lt;title&gt; &lt;meta&gt; &lt;body&gt;  &lt;b&gt;  &lt;font&gt;  &lt;p&gt;  &lt;h1, h2, h3, h4, h5, h6&gt;  &lt;div&gt; &lt;form&gt;  &lt;input&gt;  &lt;table&gt;  &lt;frame&gt;<span></span> </p><p><strong>Cadastro de Clientes:</strong></p><p>Aprenda a montar formulários completos, validação de campos, inserir máscaras nos campos, enfim, tudo o que você precisa para saber para criar seus formulários completos, que depois poderão ser usados para inserir dados no banco, listar, pesquisar etc</p><p><strong>Dreamweaver:</strong></p><p>Você irá primeiramente aprender a criar todos os códigos na mão (no braço), e depois aprenderá a fazer usando a ferramente Dreamweaver, uma das melhores e mais usadas ferramentas para criação de sites, agilizando e facilitando a criação e páginas web.</p>", 
    "end_date": null, 
    "title": "HTML javascript css - crie páginas para internet", 
    "price": "30.00", 
    "instructors": "Neri Neitzke", 
    "commitment": "20 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632454_7b6e.jpg", 
    "course_url": "https://www.udemy.com/html-javascript-css-crie-paginas-para-internet/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T14:45:12Z"
}