{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn HTML, The first coding language you need to know to succeed in web development, because it' easy to understand and easy to code</p><p><strong>Build a Good and Strong foundation in HTML, With the Complete HTML Developer Course.</strong></p><ul><li>HTML Environment</li><li>HTML Tags</li><li>HTML Attributes</li><li>HTML Skills</li></ul><p><strong>A Powerful Skill at Your Fingertips </strong><br>Learning the fundamentals of HTML puts a powerful and very useful tool at your fingertips. HTML is easy to learn, has excellent documentation, and it's the base of web development.</p><p>HTML development are awesome, and being able to learn HTML will give you a strong background to learn other web and app development programming languages.</p><p><strong>Content and Overview </strong><br><br>Suitable for beginning Developers, through this course of 28 lectures and 1.5 hours of content, you’ll learn all of the HTML Skills and establish a strong understanding of the concept behind Web Development. Each Section closes with a challenge, putting your new learned skills into practical use immediately.</p><p>Starting with the installation of the best code editor in the market, this course will take you through HTML Tags, Attributes, Elements, and how to use them.</p><p>With these HTML skills you learned, you will be hungry to learn other web development languages that leads you to become a successful web developer.</p><p>If you really want to learn HTML, This Complete HTML Course is for you to develop your skills more than others.</p>", 
    "end_date": null, 
    "title": "HTML Complete Course - Beginner to Expert", 
    "price": 0, 
    "instructors": "Frank Jeff", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766592_66ac_4.jpg", 
    "course_url": "https://www.udemy.com/the-complete-html-developer-course/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T14:44:36Z"
}