{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn how to build a responsive website from scratch!</p><p>I'm an instructor at Steer - code school based in London. At Steer, we believe in project-based learning and design-led programming courses. This course is suitable for complete beginners to code.</p><p>On the course I’ll lead you through each step needed to create beautiful, bespoke websites of your own.</p><p>You’ll build a single column site that'll introduce you to the basics of HTML. Together we’ll look at elements like html, head, body &amp; section, and work out where each of these should be used to correctly structure your content.</p><p>Once we’ve covered all of that we'll move on to CSS, looking at selectors, classes, properties and more.</p><p>Finally we'll look at making your site responsive - showing you how to make sites look good across different screen sizes.</p><p>By the end of this course you'll have a beautiful food-blog style site which you can use as a template for your own projects. This course will ensure you have all the knowledge you need to take your first steps as a web developer.</p><p>What am I going to get from this course?</p><ul><li>65 lectures and over 3.5 hours of video content!</li><li>Learn how to make beautiful websites using HTML &amp; CSS.</li><li>Tried-and-tested methods of teaching and accelerated learning.</li><li>Get access to our exercise files &amp; specially created assets.</li><li>Help from our instructors, whenever you need it.</li></ul>", 
    "end_date": null, 
    "title": "HTML & CSS for beginners: Build your first website", 
    "price": "50.00", 
    "instructors": "Steer Systems Ltd", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692082_d8cf.jpg", 
    "course_url": "https://www.udemy.com/steer-html-css-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T15:25:33Z"
}