{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">A Certificate of Completion will be provided to all students after completing this course.</em>  </p>  <p style=\"\">  \t<strong style=\"\">    In this course, you will learn basic web development concepts and skills that will allow you to build simple website, modify existing, you will learn HTML, this will include everything you need to create a professional level Website  </strong>  </p>  <p style=\"\">  \t        ______________________________________________________________________  </p>  <p style=\"\">  \t<strong style=\"\">    In this Vedio Session we took all the Basic Elements of HTML and we tried make u a Complete web developer with this Vedio. After Completion of the Session you can make your own Static Website.  </strong>  </p>  <p style=\"\">  \t            A Web Browser can read HTML files and Compose them into visible or audible web pages. The Browser does not display the HTML tags, but uses them to interpret the content of the page. HTML uses special bits of Programming language called &quot;tags&quot; to let the browser know how a Webpage should look. The tags usually come in pairs: an opening tag to tell the browser when to start doing something, and an ending tag to tell the browser when to stop doing something. There are many different kinds of tags, and each one has a different purpose.  </p>  <p style=\"\">  \t        ________________________________________________________________________  </p>  <p style=\"\">  \t<strong style=\"\">Step-by-step HTML </strong>a for Absolute Beginners is a comprehensive and friendly course designed for beginners with NO previous coding or programming experience.  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">HTML (HyperText Markup Language) are the building blocks of the web. If you&#039;ve ever looked at a website, you&#039;ve seen HTML in action!</em></li>  </ul>  <p style=\"\">  \t            Whether you want to make changes to your website&#039;s template, create new webpages from scratch, or just understand what you&#039;re doing when you cut-and-paste embed codes from sites like YouTube or SlideShare — understanding HTML and  makes it possible.  </p>  <p style=\"\">  \t            The course provides step-by-step Walk-through and Coding demos that you&#039;re encouraged to code along with to enhance the learning process. By the end of the course you&#039;ll understand how all of the coding pieces fit together and be able to apply this knowledge to building your own custom Web applications.  </p>  <p style=\"\">  \t            Web browsers can also refer to Cascading Style Sheets to define the look and layout of text and other material.  </p>  <p style=\"\">  \t            _______________________________________________________________________  </p>  <p style=\"\">  \t<strong style=\"\">      WHAT&#039;S INCLUDED?  </strong>  </p>  <p style=\"\">  \t            This course includes lifetime access to 4 hours of step-by-step videos.  </p>  <p style=\"\">  \t            A verifiable &quot;Certificate of Completion&quot; is also presented to all students who complete this course.  </p>  <p style=\"\">  \t            ________________________________________________________________________  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">CAN I ASK QUESTIONS AND GET HELP?  </strong>  </p>  <ul style=\"\">  \t<li style=\"\">Yes, please! You can post your questions and discuss problems in the course dashboard. You can also contact me personally. I love hearing from student.      </li>  </ul>  <p style=\"\">  \t            So why not sign up today? Why not start investing in your future today? Click the button to start learning now.  </p>", 
    "end_date": null, 
    "title": "HTML For Beginners to Advance", 
    "price": "20.00", 
    "instructors": "Kishan Jainani", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364520_3015_4.jpg", 
    "course_url": "https://www.udemy.com/html-for-beginners-to-advance/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-06T08:46:04Z"
}