{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p></p><p></p><h5>Who Should Take This Course</h5><p></p><p>This class is perfect for anyone with a great website idea or just an interest in learning how to code. This is a beginner-level class so if you have basic computer literacy and an internet connection, you&#039;re all set. Learn at your own pace.&nbsp;</p><p>You&#039;ll leave this class with the skills to create your very own stylish, professional, and responsive website.</p><p></p><h5>What You Will Learn</h5><p>Made lovingly with HTML5 &amp; CSS3,<br></p><p></p><ul><li>Site planning<br></li><li>Text formatting</li><li>Lists, Forms, Tables, and Links</li><li>Embedding audio and video</li><li>Styling and page layouts</li><li>Responsive layouts for mobile devices via media queries</li><li>Organization and professional workflow</li><li>Publishing your site using FTP</li><li>Best practices</li><li>Search engine optimization.</li></ul><p><strong>Video Lectures</strong><br></p><p>Lectures consist of 56 videos ranging from&nbsp;6 - 40min in length, covering slides, and follow along example code exercises&nbsp;(totaling 11 hours worth throughout the entire course).&nbsp;You also will have access to over 16 hours of prerecorded office hours videos Q &amp; A where I answer common questions and show additional bonus exercises, share books, and demonstrate debugging on students issues.</p><p><strong>Code Challenges</strong></p><p>Code Challenges are opportunities for you to put what you&#039;ve learned to practice by coding on your own or in small groups.&nbsp;A continuous project will be built out of the code challenges adding more to your site project with each challenge; allowing you to&nbsp;develop your own website start to finish in just 4 weeks.&nbsp;</p><p><a href=\"http://jonathangrover.com/teaching/students/sksh-html-css/site-mobile/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Here is the continuous exercise website I will teach you to build during the class</a>&nbsp;</p><p><strong>Handouts and Resources</strong></p><p>You will be provided with extensive handouts and suggested reference materials to continue your learning even after the course.</p><p></p><h5>What People Are Saying</h5><p></p><p>“It&#039;s really from zero to hero - you are certainly able to set up your basic webpage. Can&#039;t wait for the follow up class. Thank you Jonathan for your great teaching.&quot; -Stephan Kardos</p><p>“Great teacher and a great class, I totally recommend it. Learned to built a website from 0 to 100. Its a good starting point if you want to master web programming. After the 4 weeks I can look at web code and not feel scared. ” -Mark Henninger</p><p>“Jonathan is a GREAT teacher. He really knows his stuff and unlike most techies he has great people skills and knows how to teach!... Walking into this class I had zero knowledge of HTML and CSS. I tried using WordPress to create my site with no success. I now am enjoying this so much I want to get good at it and hopefully someday do this on the side for some extra cash!” -Dan Norcott</p><p>“This class was amazing. I have struggled to learn HTML and CSS for many years, but he was able to break it down into simple tutorials that allowed me to progress slowly. The videos are easy to understand and follow at your own pace, and the activities give you a chance to put what you learned to practice. I highly recommend this course or any future courses that Jonathan teaches. ” -Hannah Tran</p><p>&quot;Jonathan goes at a nice pace and allows you to understand things very easily. I recommend his classes to anyone. I knew nothing of the subject material when I signed up for his class and feel very good about it now.” -Ben Terry</p><p>“Such good classes and great, thorough explanations! Loved the lectures!” -Christine McSchneider</p><p>“Html/Css from scratch in 30 days is the best online course in learning html/css coding. I built my website&nbsp;www.ponyprintpress.com&nbsp;in 30 days! ... ” -Sandra Relf</p><p>“This has been one of the best class I&#039;ve ever taken in my life. I learned from the basics to the advanced. Each class is very enjoyable, and very well organized, I have learned a lot... The teacher is a true expert. I look forward to enroll in new classes from him. Thank you very much Jonathan. You are the best!” -Javier Hurtado</p><p></p><p></p>  ", 
    "end_date": null, 
    "title": "HTML & CSS From Scratch in 30 Days", 
    "price": "50.00", 
    "instructors": "Jonathan Grover", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50587_f92a_5.jpg", 
    "course_url": "https://www.udemy.com/html5-css3-responsive/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-19T23:37:42Z"
}