{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Course fully updated and November 15!</strong> <strong></strong><em>Now includes support for CSS Flexbox and the Picture element.</em></p><p>Over 2200 students already enrolled with a average rating of 5 star!</p><p>Sign up now <strong>risk free</strong>: comes with a 30 day Udemy backed money back guarantee!</p><p>....................................................................................................................................................</p><p>  \tLearn how to build websites from scratch using the essential ingredients, HTML and CSS.  </p>  <p>  \t          By the end of this course you will have the confidence and ability to create beautiful, functional websites. This course is project based so you be jumping into building your first website in no time. Don't worry if you have little or no experience, I will take it easy and try to clearly explain what we are doing and learn as we build.  </p>  <p>  \t          I believe this is the best way to learn, you will be able to apply what you are learning to a real project and instantly see the results.  </p>  <p>  \t      What <em>you</em> will be building:  </p>  <ul>  \t<li><strong>Project 1-</strong></li>  </ul>  <p>  \t          Begin by creating static recipe website from scratch, learn the fundamentals of HTML &amp; CSS by hand coding your first website.  </p>  <ul>  \t<li><strong>Project 2-</strong></li>  </ul>  <p>  \t          Building on the skills you have learned, we will now step it up by creating a fully responsive College website, again from scratch which looks great on any device. You will learn new techniques such as media queries and how to set different size images to different size devices to improve download times and image quality.  </p>  <ul>  \t<li><strong>Project 3-</strong></li>  </ul>  <p>  \t          You should now have a good understanding of how websites are build after building 2 websites from scratch. We will now move on to use the popular Bootstrap framework, this will allow us to build great looking, responsive websites <em>faster</em> and <em>easier</em>. You will be introduced to many of Bootstraps great features as we build the third and final project, a hotel website.  </p>  <p>  \t    This final website will be packed with great features such as drop down navigation bars, glyphicons, a sliding carousel and a mobile first grid system.  </p>  <p>  \t    This course is ideal if you want to save money and build a website for personal use, for your business, or maybe you want to launch a new career.  </p>", 
    "end_date": null, 
    "title": "HTML & CSS for beginners: Build 3 projects from scratch", 
    "price": "20.00", 
    "instructors": "Chris Dixon", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380092_d93c_7.jpg", 
    "course_url": "https://www.udemy.com/learn-html-css-by-building-3-real-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T16:21:52Z"
}