{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Every website you visit at a basic level is constructed with HTML and CSS. So these two languages are the first and most essential languages you will want to learn and begin with for web development. This course will teach you all the essentials of HTML and CSS. You will learn all about HTML tags, elements, and HTML structure. You will also learn about how to edit the HTML document as well as create HTML web forms. This course uses the latest concepts in HTML5. We will then move on to CSS and how to style your web pages.  We will then wrap up the course with a full CSS layout tutorial.</p><p>I firmly believe it is important to understand the core concepts to any language.  And so this course will stress concepts first and foremost.</p><p>In this HTML and CSS Tutorial for Beginners course, you will learn how to make high-quality, well structured and thoroughly impressive web sites.  You will also gain a strong understanding of CSS concepts that will allow you to code your website exactly the way you want it to look.  So in every sense this is a comprehensive HTML and CSS course. This HTML and CSS Tutorial for Beginners is perfect for both beginners and web designers who want to freshen up their skills.</p><p>Watch hours of engaging video lectures, and study all the code examples that will be provided.  With this course, you will become fully competent in CSS and master beginning web site design!</p>", 
    "end_date": null, 
    "title": "HTML and CSS Tutorial for beginners", 
    "price": "20.00", 
    "instructors": "Ernest Jones", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539660_27d6_7.jpg", 
    "course_url": "https://www.udemy.com/html-tutorial-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T00:25:58Z"
}