{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">If you have any queries or need a discount please contact us at <em style=\"\">admin@qscutter.com</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">You will learn everything about web worker within an hour. </em></strong>  </p>  <p>  \t       One of the many design goals of the JavaScript language was to keep it single-threaded and, by extension, simple. Though I must admit that, given the idiosyncrasies of the language constructs, it is anything but simple! But what we mean by being “single-threaded” is that there is only one thread of control in JavaScript; yes, sadly, your JavaScript engine can do only one thing at a time.  </p>  <p>  \t       Now, doesn’t that sound too restrictive to make use of multi-core processors lying idle on your machine? HTML5 promises to change all of that.  </p>  <p>  \t <strong style=\"\">As envisioned by WHATWG, web workers are relatively heavy-weight. They are expected to be long-lived, have a high start-up performance cost, and a high per-instance memory cost.</strong>  </p>  <p>  \t      With <strong style=\"\">&quot;HTML5 - Background Processes with Web Workers in Depth&quot;</strong>, you will learn everything about Web Workers, even if you&#039;ve never build one before!  </p>  <p>  \t      The full course has <strong style=\"\">several video lectures</strong>, divided into several chapters. Each chapter will give you a new level of knowledge in Web Workers. We&#039;ll start from the basics of Web Workers development to more advanced and the most popular API used now a days.  </p>  <p>  \t<strong style=\"\">NOTE: </strong>In order to keep you up to date in the world of Web Workers all the chapters will be updated regularly with new lectures, projects, quizzes and any changes in future versions of all the programming languages covered on the course.  </p>  <p>  \t<strong style=\"\">Enroll now and start learning.</strong>  </p>", 
    "end_date": null, 
    "title": "HTML5 - Background Processes with Web Workers in Depth", 
    "price": "20.00", 
    "instructors": "QScutter Tutorials", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/137018_625e_7.jpg", 
    "course_url": "https://www.udemy.com/html5-background-processes-with-web-workers-in-depth/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-23T09:29:42Z"
}