{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Do you want to learn web development? You’re at the right place; this course is for complete beginners who don’t know developing web pages. <strong>I created this class with a newbie mindset so that all beginners could learn from complete scratch.</strong></p>\n\n<p>I've divided the course into two parts, first is, HTML and the other is CSS. So we will start this course from and HTML where we will learn how to write tags and how things work in HTML web development. <strong>We will learn about major tags that we use in all the web pages. We will get to create lists, tables, text formatting, images and much more in this section of HTML.</strong></p>\n\n<p>After completing the HTML part, we will move to the CSS part which requires knowledge of HTML also. As we have already gained concepts of HTML, we can freely move to CSS. Okay, now in CSS we will start the section with an introduction part. <strong>I will teach you how to write CSS and how to embed them in your HTML document in different ways. I will teach you how to write properties; I will introduce you to the divs, ids and classes in this section. </strong>We will write all the possible major properties of CSS. I will teach you all the concepts from basic level to an intermediate level, like color codes and shorthand in margins and padding. So ultimately, you’re going to learn a lot from this course. <strong>Moreover, I am here to help you and to provide you an extra support to make your learning easier.</strong></p>\n\n<p>Enroll now and I see you inside..!</p>", 
    "end_date": null, 
    "title": "HTML & CSS : Develop web pages in HTML & CSS", 
    "price": "25.00", 
    "instructors": "Ankit Shrivastava, TweakCoder eLearning Solutions, Siddarth Kumar", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609992_0d3f_2.jpg", 
    "course_url": "https://www.udemy.com/html-and-css-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-12T14:38:48Z"
}