{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">HTML5 CSS3 : la porte d&#039;entrée du web professionnel</strong><br style=\"\"></p><p style=\"\">HTML et CSS sont la base du web, et leur maitrise est désormais demandée pour tous les métiers du secteur, que l&#039;on soit graphiste, développeur, rédacteur, blogueur, chargé de marketing, community manager...<br style=\"\"></p><p style=\"\">Même s&#039;il est accessible à tous, ce cours a pour objectif d&#039;acquérir des <em style=\"\"></em>connaissances solides sur le <strong style=\"\"></strong>HTML5 et CSS3<em style=\"\"><strong style=\"\"></strong></em> pour être autonome, et savoir réaliser le travail d&#039;un <strong style=\"\"></strong>intégrateur professionnel : <em style=\"\">transformer une maquette Photoshop en page HTML &amp; CSS</em>.</p><p style=\"\"><strong style=\"\">Une formation HTML5 CSS3 professionnelle</strong></p><p style=\"\">Il ne s&#039;agit pas d&#039;un simple tutoriel : ce cours est la version numérique d&#039;une vraie formation professionnelle, parmi celles que je dispense depuis plusieurs années à des centaines de personnes dans les principaux centres de formation à Paris. Avec les avantages supplémentaires de pouvoir aller à votre rythme, et de consulter le cours et les ressources à tout moment.</p><p style=\"\"><strong style=\"\">Méthodologie HTML CSS complète</strong></p><p>Il est facile de trouver sur le web des ressources sur le HTML CSS. Pourtant, beaucoup de personnes, même des développeurs expérimentés dans un milieu professionnel depuis plusieurs années, bidouillent et tâtonnent quand il s&#039;agit de CSS. Ce cours développe une vraie méthodologie de travail, claire et réutilisable en toutes circonstances.</p><p><strong style=\"\">Fondamentaux HTML CSS et cas pratique à partir d&#039;une maquette Photoshop</strong></p><p>Le cours aborde d&#039;abord les fondamentaux, qui permettent d&#039;être autonome quels que soient le projet et les outils utilisés, en mélangeant théorie et pratique, à travers un projet simple.</p><p>Puis, fort de la méthodologie développée, le cours finit par un cas pratique réel, tel qu&#039;il se produit en entreprise : une maquette Photoshop, cette fois très graphique, attrayante et visuelle, mais avec la structure plus complexe d&#039;un véritable site web, vous sera donnée, et il faudra l&#039;intégrer en HTML et CSS.</p><p><strong style=\"\">Mise à jour HTML5 CSS3 en continu</strong></p><p>Ce cours permet aussi de se mettre à jour avec les nouveautés HTML5 CSS3 en continu : de nouvelles leçons sur les nouvelles fonctionnalités sont ajoutées au fur et à mesure qu&#039;elles deviennent supportées par les principaux navigateurs. <br style=\"\"></p><p><strong style=\"\">Exercices HTML5 CSS3 corrigés et quizz</strong></p><p>Tous les fichiers finaux du projet et du cas pratique sont évidemment fournis.</p><p>Des questionnaires permettent de vérifier régulièrement l&#039;acquisition des connaissances.</p><p><strong style=\"\">Formation HTML5 CSS3 en Français</strong></p><p>Il y a déjà suffisamment de notions à intégrer sans rajouter en plus la difficulté d&#039;une autre langue. L&#039;intégralité de la formation est en Français.</p><p><strong style=\"\">Certificat de formation HTML5 CSS3</strong></p><p>A la fin du cours, Udemy vous délivrera un certificat, attestant que vous avez suivi cette formation, que vous pourrez facilement mettre en lien dans votre CV en ligne ainsi que sur les réseaux sociaux professionnels comme Viadeo et LinkedIn.<br style=\"\"></p><p><strong style=\"\">Questions et accompagnement</strong></p><p>Je suis là pour vous aider ! Comme dans une vraie formation, vous pouvez me poser vos questions sur le cours dans l&#039;espace de discussion prévu à cet effet, j&#039;y répondrai sans faute.</p>", 
    "end_date": null, 
    "title": "HTML5 CSS3 & responsive design : formation professionnelle", 
    "price": "50.00", 
    "instructors": "Cyrille Tuzi", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418144_ea3b_2.jpg", 
    "course_url": "https://www.udemy.com/formation-html-css/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T10:08:03Z"
}