{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Finally you know...</strong></p><p><strong>This is Where You Start Your Development Career</strong></p>\n\n<p>HTML5 is the scaffolding that lies beneath almost every contemporary application.</p>\n\n<p>There was a time when only web designers needed to know HTML5 well. However, it's now a universal skill that every developer needs. Strong HTML5 provides a strong foundation for apps. It also allows you to correctly develop content that appears on web sites, in mobile apps and even digital signage.</p>\n\n<p><strong>How do you learn to create strong HTML5 code that can be easily maintained?</strong></p>\n\n<p>That's what we're here to talk about...</p>\n\n<p><strong>FACT: HTML5 is the First Language You Need to Know\n\n</strong><strong>(...and an important part of web and mobile developers' daily work)</strong></p>\n\n<p>We get the question all the time: <em>I want to become a developer, but I don't know where to start.</em></p>\n\n<p>We don't have to sell you on the idea of becoming a developer. If you're you here, you already know it's one of the most lucrative (and fastest growing) career tracks out there. It's HTML5 that allows you to get your foot in the door. HTML5 developers:</p>\n\n<ul><li>Create the scaffolding for content display for web sites, mobile sites and many mobile applications.</li><li>Mark up web content so it can be distributed across multiple platforms</li><li>Work in large scale digital publishing to create flexible content</li><li>Combine HTML5 skills with other digital skill sets to become web and mobile developers</li></ul>\n\n<p>In other other words, <strong>HTML5 development skills are critical to all developers</strong>. HTML5 is the foundation to almost any development process.</p>\n\n<p>That's why business, design studios, development shops and other organizations need HTML5 developers.</p>\n\n<p>But there's a problem. Most people who learned HTML, learned it in school 12 years ago and have no idea that they're doing.</p>\n\n<p>That's how you separate yourself from the pack.</p>\n\n<p>As a <em>Certified HTML5 Specialist</em>, you are qualified to build, maintain and edit HTML5 documents. You'll be able to help development teams build strong foundations, manage digital content or use HTML5 as a foundation for a strong developer skill set.\n</p>\n\n<p>In this certification program you will learn:</p>\n\n<ul><li>How to create a <strong>proper HTML5 scaffolding</strong> for the type of application that you’re creating. How should HTML5 differ for web and mobile applications?</li><li>How to <strong>correctly markup text</strong> so that it is sized properly across the variety of screen sizes and densities used by consumers</li><li>How to properly<strong> integrate code written in CSS and PHP</strong> as external or internal code listings.</li><li>How to select the most efficient tools and environments for <strong>HTML5 authoring and testing</strong>.</li><li>Understand how to<strong> upload content to a web server</strong> for public consumption. You’ll also cover how to set up a test server environment locally.</li><li>How to create <strong>internal and external links</strong> within HTML5 documents.</li><li><strong>Creating Meta Tags</strong> that are properly designed for optimal display on Google and other search engines.</li><li>Strategically use<strong> HTML5 comments</strong> to document your code.</li><li>A unique strategy to use HTML5 comments to <strong>debug code and quickly find errors</strong>.</li><li>How to<strong> create list based content</strong> using ordered lists, unordered lists and custom list bullets for custom branding</li><li>How to<strong> display images</strong> and how to <strong>properly optimize images</strong> for display on web and mobile devices.</li><li>An infrequently used strategy to <strong>boost your Search Engine Optimization value</strong> using images</li><li>How to <strong>create beautiful information tables</strong> that are easy to both create and read</li><li>How to <strong>use the hexadecimal color system</strong> and apply hexadecimal colors to elements in your HTML5</li><li>How to <strong>create usable, functional forms</strong> to gather data from your users</li><li>How to secure your forms to <strong>avoid security issues with your forms\n</strong></li><li>How to<strong> integrate multimedia elements</strong> such as audio, video and animations into your HTML5 content.</li><li>A unique technique for laying out our page that will <strong>make complex designs easy to markup and manage</strong></li><li>How to<strong> embed iFrame content</strong> from outside sources and make it fit seamlessly into your HTML5 page</li><li>A great strategy for correctly <strong>converting Photoshop documents to HTML5\n</strong></li><li>The <strong>best HTML5 frameworks</strong> to save you time and provide an entry point for new projects</li></ul>\n\n<p>In summary, certified HTML5 specialists are experts who are able to correctly construct rich digital documents that can appear anywhere on the web, mobile or as part of a larger application. They are able to understand how HTML5 fits into the larger context of web and mobile development and work in serious development environments.</p>", 
    "end_date": null, 
    "title": "HTML5 Specialist: Comprehensive HTML5 Training", 
    "price": "50.00", 
    "instructors": "LearnToProgram, Inc.", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/876850_3e9c.jpg", 
    "course_url": "https://www.udemy.com/html5-specialist/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-13T15:17:52Z"
}