{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t    HTML is the core technology for building websites. Today, with HTML5 opening  the Internet to new levels of rich content and dynamic interactivity, developers  are looking for information to learn and utilize HTML5. <em style=\"\">HTML5 24-Hour  Trainer</em> provides that information, giving new and aspiring web developers  the knowledge they need to achieve early success when building websites. A unique package including an eBook with video instruction.  </p>  <ul style=\"\">  \t<li>Covers the most basic aspects of a web page, including a brief introduction  to Cascading Style Sheets (CSS) </li>  \t<li>Provides lessons that are backed up by professionally created training  videos and interactive content to fully illustrate the dynamic nature of HTML5  and the Internet, while also providing a full learning experience </li>  \t<li>Combines easy-to-follow lessons with expertly crafted training videos to  provide you with both written and interactive instruction for learning HTML5  </li>  </ul>  <p>  \t   The eBook written by bestselling author Joseph Lowery and with video course content created by  well-known multimedia and eLearning producer Mark Fletcher, <em style=\"\">HTML5 24-Hour  Trainer</em> brings the new features of HTML5 and the Internet to life unlike any  other resource.  </p>  <p>  \tVisit www.wrox.com and www.wiley.com  </p>", 
    "end_date": null, 
    "title": "HTML5 24-hr Trainer ", 
    "price": "45.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/153720_07f1_6.jpg", 
    "course_url": "https://www.udemy.com/html5-24-hr-trainer/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-27T20:30:45Z"
}