{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>***Quizzes, Practice Exercises and 7 Unique Location-Aware Applications are Included***</strong><br></p>\n\n<p><strong>**Last Updated on 23rd May 2016: A new update lecture added to Weather Forecast project**</strong><br></p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------<br></p>\n\n<p>Do you want to <strong>track the location</strong> <strong>of your site's visitors, </strong>that is<strong> to </strong><strong>identify from where your site gets traffic</strong>? Do you want to <strong>mark the location(s) of your local business in a map on your website</strong>? Do you want to <strong>develop location-aware or GPS applications</strong>? Do you want to <strong>learn HTML5 and JavaScript in depth</strong>? Then, join this 100% hands-on course and start developing unique location-aware or GPS applications.</p>\n\n<p><strong>Geolocation</strong> continues to be <strong>a hot topic</strong> especially in the smartphone sector. You can do many wonderful things if you are able to track the location of a person. </p>\n\n<ol><li>It would be great if you could know whether your daughter has reached her school safely. </li><li>It would be useful if you could find the actual route to an unknown place. </li><li>It would be cool if you could locate a restaurant or a hospital in an unknown place. </li></ol>\n\n<p>Isn't it? All these are possible with geolocation. In today's competitive world, businesses try to improve their service making the best use of geolocation information. This in turn increases the demand for location aware applications.</p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n<p>Janice Hageman says</p>\n\n<p>\"<strong>HTML Geolocation</strong></p>\n\n<p><strong>The course was very informative, starting out with basic information and then building to more complex information. </strong>It will definitely help with some map-related projects I am working on<strong>. Contained a lot of examples.</strong>\"</p>\n\n<p>Keira D says</p>\n\n<p>\"<strong>Insightful, well-thought-out course - recommended</strong></p>\n\n<p><strong>I recommend this course to anyone trying to develop an in depth knowledge on this topic. </strong>I regularly take many online courses from multiple sources, and<strong> I evaluate this course as one of the most insightful one I have come across! The materials are systematically structured, and the instructor literally takes you from basics to the details. There are examples and hands-on exercises, which I found extremely helpful. Instructor's understanding of the subject is really impressive. Also, I see that the instructor is very responsive on the discussion forum. Great work. Recommended.</strong>\"</p>\n\n<p>Trent says</p>\n\n<p>\"<strong>Great Course</strong></p>\n\n<p><strong>Everything is presented in a very clear way. It is very easy to follow along. I recommend this course for anyone interested in Geolocation and Google Maps.</strong>\"</p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n<p>The <strong>Course Structure</strong> is as follows:</p>\n\n<p>We first look at the HTML5 geolocation API including how geolocation works and how to get location information for a point of time and also for a period of time. As you proceed with this course, you will learn how to use the following APIs along with HTML5 Geolocation API to make your applications really magical.</p>\n\n\n\n<ol><li><strong>Google Maps API</strong></li><li><strong>Google Places API</strong></li><li><strong>Google Directions API</strong> </li></ol>\n\n<p>This course teaches you how to come up with really useful and unique <strong>location-aware applications (GPS- based applications)</strong> using HTML5 Geolocation API. You would <strong>develop 6 location-aware applications as part of this course that too from SCRATCH</strong>. The happy news is that <strong>you can use these applications while traveling (if you have a mobile device with GPS)</strong>. </p>\n\n<p>By the end of this course, you would have the following web applications developed from scratch.</p>\n\n<ol><li><strong>Where Am I?</strong> that displays the location information in a text message and also in a map.</li><li><strong>Weather Forecast</strong> that displays the local weather information to the user.</li><li><strong>Distance Calculator</strong> that calculates the distance between the current location and specified destination</li><li><strong>How to Reach?</strong> displays the route from the current location to the specified destination</li><li><strong>Find Around Me</strong> displays nearby restaurants, ATMs etc to the user</li><li><strong>Postcode Finder</strong> displays the postcode of the user and allows the user to get the postcode of the address entered</li><li><strong>Store Locator</strong> displays different stores details in a map fetching details from the database</li></ol>\n\n<p>Each application is <strong>developed from SCRATCH</strong> which makes it easier even for beginners to follow.  You will also get a list of application ideas that you can use to develop your own location-aware applications.</p>\n\n<p><strong>So, what are you waiting for?? Join this wonderful course NOW and let's get started !!!</strong><br></p>", 
    "end_date": null, 
    "title": "HTML5 Geolocation in Depth:Build 7 HTML5 Geolocation Apps", 
    "price": "25.00", 
    "instructors": "Crypters Infotech", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/258886_2230_3.jpg", 
    "course_url": "https://www.udemy.com/html5-geolocation-in-depth-build-location-aware-applications/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-10T10:02:18Z"
}