{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Do you have a desire to build websites for your current or future career, your business, or just for fun? This course will show you a rich mixture of web design and web development using some of the industries best practices. What is truly unique is that the explanation is made very simple and is based on lessons taught at a college post-graduate program. The instructors have been teaching web development since 1995 and have a lot of experience in teaching people how to go from a \"newbie\" to a professional. This is the ultimate course taught by qualified faculty showing you how they mastered and built each file, with the most current technology. </p><p style=\"\">This course includes:</p><ol><li>A companion handbook corresponding to each chapter with detailed best practices, tips and take-aways - an easy reference guide for your professional development.</li><li>A Badge certifying and crediting your completing and understanding of the web development content in this course</li><li>A donation to Literacy &amp; Breakfast Club of Canada </li><li>Over 8 hours of video content</li><li>All code files and resources to use in your projects</li><li>Quizzes testing your knowledge of the content</li><li>Add these skills and projects to your portfolio!</li></ol>", 
    "end_date": null, 
    "title": "HTML5 Core Fundamentals for Aspiring Professional Developers", 
    "price": "30.00", 
    "instructors": "Phil Cowcill, Krista Hildner", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496884_ff6c_2.jpg", 
    "course_url": "https://www.udemy.com/html5-fundamentals-for-aspiring-professional-developers/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-08T16:10:11Z"
}