{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Welcome to the complete web development training that includes full video series of HTML, CSS, and JavaScript. HTML, CSS, and JavaScript are the major languages that you must know to create static and dynamic web pages. This course will take you from no experience to professional in web development.</p>\n\n<p><strong>I have created this course with a proper mindset so that you could learn each and every concept from scratch. Each concept is explained in a very detailed manner with live examples on screen, and I tried my best in making this learning much easier. </strong></p>\n\n<p>I have divided this course into three parts for HTML, CSS, and JavaScript. We will start this course from HTML where you will come to know about tags, attributes, and other kinds of stuff. After completing HTML part, we have CSS with lots of videos that would teach you CSS in very details. We have separate videos for each property that we have in CSS so that you could get most of the course. Then comes the JavaScript part, so in this section, you will learn about scripting and how we make interactivity on dynamic web pages. Along with complete learning, <strong>I am here to provide you a full support on all possible platforms so that I could remove all your doubts as soon as they approach you. You will learn a lot more things in this course.</strong></p>\n\n<p><strong>Enroll now, and I see you inside.</strong></p>", 
    "end_date": null, 
    "title": "HTML CSS JavaScript : Complete web development bundle", 
    "price": "30.00", 
    "instructors": "Ankit Shrivastava, TweakCoder eLearning Solutions, Siddarth Kumar", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673420_5279_2.jpg", 
    "course_url": "https://www.udemy.com/html-css-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T15:22:13Z"
}