{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Have you ever wondered how you could get that magnificent idea from your brain onto the web? You see so many great websites (and a couple of not so great ones), and you can&#039;t help but think, &quot;I could do that!&quot;</p><p style=\"\">If so, then this course is perfect for you. Instead of drilling down with lots of useless snippets and complicated examples, this course will focus on <strong style=\"\">functional application</strong> that you can <strong style=\"\">use right away</strong>.</p><p style=\"\">You will learn how to code a website from scratch, in a structure that will make it easy to apply Responsive Design styles to. You will also learn how to use basic PHP snippets to make updating common parts of your website easier than a traditional static website.</p><p style=\"\">This course includes all the following, and more:</p><ul style=\"\"><li style=\"\">HTML Fundamentals</li><li style=\"\">CSS Fundamentals</li><li style=\"\">Basic PHP Introduction</li><li style=\"\">Font Usage and Google Font Substitution</li><li style=\"\">Website Testing</li><li style=\"\">Responsive Design and Media Queries</li><li style=\"\">Troubleshooting and Error checking Guidelines</li><li style=\"\">74 Lectures, File downloads, and 15 hours of content</li></ul><p style=\"\">The best part about this course is that it makes no assumptions on your skill level. If you know nothing, or a whole lot of something, you&#039;ll find techniques in this course that you can apply to your next project. All of the material used in this course is <strong style=\"\">real world application</strong>. All of the examples used are based off the structure you will be learning, so it&#039;s been proven to work in production</p><p style=\"\">If this sounds right for you and you&#039;re ready to get started, just click the <em style=\"\"><strong style=\"\">Take This Course</strong></em> button to the right and we&#039;ll begin!</p>", 
    "end_date": null, 
    "title": "HTML and CSS: A Guide to Web Design", 
    "price": "20.00", 
    "instructors": "James Rogers", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516790_8586_3.jpg", 
    "course_url": "https://www.udemy.com/html-and-css-a-guide-to-web-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T08:22:59Z"
}