{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tThere isn&#039;t a web site out there-- whether it be WhiteHouse.gov, IBM.com or the site for your local high school-- that isn&#039;t written in <strong style=\"\">HTML</strong>. If you do any level of web development-- from editing pages on a Wordpress site to designing original pages from scratch, understanding and being able to code in <strong style=\"\">HTML</strong> and <strong style=\"\">CSS</strong> can <strong style=\"\">give you a level of control, and power over your designs that you&#039;ve never experienced before.</strong> This course helps you learn HTML and CSS (versions 4.01 and XHTML) as well as <strong style=\"\">prepares you for the future with coverage of HTML5.</strong>  </p>  <p style=\"\">  \tIn this course, designed, authored and hosted by master trainer Mark Lassoff, you will learn HTML and CSS, including everything you need to create a creative, quality and professional web site. Almost four hours of video instruction in punctuated lab exercises where you apply the very skills taught in the course. With an instructor available to answer your questions, and course with both wide coverage of HTML and CSS topics and deep discussion of those topics, there is no better or faster way to learn HTML and CSS for Beginners!  </p>  <p style=\"\">  \tWhen you&#039;ve completed the course, become a certified developer by passing LearnToProgram&#039;s Certified HTML Developer exam. Certified developers are listed on the LearnToProgram web site and sent a printed certificate, digital badges and other materials relating to their certified status.  </p>", 
    "end_date": null, 
    "title": "HTML Tutorial: HTML & CSS for Beginners", 
    "price": "30.00", 
    "instructors": "LearnToProgram, Inc., Mark Lassoff", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8325_0f72_14.jpg", 
    "course_url": "https://www.udemy.com/learn-html5/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-06-28T08:27:39Z"
}