{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Are you looking for an efficient introduction in to HTML5?   Have you tried other HTML5 courses and found them too complex?  Do you need just the basics of HTML5 to use with Wordpress or other content management system?  <em>Are you looking for an introduction that is truly for beginners?</em></p><p>If you're thinking \"Yes! That's me!\" then HTML5 for Beginning Beginners is for you.  HTML5 isn't just for web developers-- It's part of modern digital literacy and you need to know it yesterday!</p><p>This course is designed to be comprehensive and efficient.  Using years of HTML5 development experience, we've included the details that are most important to those who work with HTML5 every day-- and we don't get distracted with lots of extras.</p><p>This course includes:</p><ul><li>Over two dozen instructor videos</li><li>Seven activities to help you learn</li><li>Suggested solution to all activities</li><li>The full book <strong>HTML5 for Beginning Beginners</strong></li></ul><p>This course is great for all types of learners.  If you learn best by watching demonstrations, this HTML5 for Beginning Beginners includes dozens of informative videos.  If you like a text book, we've included the full color edition of HTML5 for Beginning Beginners eBook.  If you learn by doing you'll find the seven course activities very helpful.</p><p>This course is structured to help you retain all the information covered.  We want you to be productive with HTML5 the minute you complete this course.  And you will be--  as each individual skill is demonstrated, explained at length in the book and then simulated in the course activity.</p><p>Over a half million people have enrolled in LearnToProgram courses worldwide-- Over 250,000 on Udemy alone. Enroll today and join a community that learns with the best.</p>", 
    "end_date": null, 
    "title": "HTML5 for Beginning Beginners", 
    "price": "20.00", 
    "instructors": "LearnToProgram, Inc., Instructor Andrew Snyder-Spak", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858894_eaf5.jpg", 
    "course_url": "https://www.udemy.com/html5-for-beginning-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T18:59:42Z"
}