{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  HTML adds markup to standard text. HTML stands for &quot;<strong>Hyper Text Markup Language</strong>&quot;. This language is used for creating and visually representing a website and/or webpage. HTML is the main language used to create webpages/websites which is why this language should be learned before any other.  </p>  <p>  \t   Anyone can learn this language with handwork and dedication, this is not a hard language to acquire. No prior programming experience is required.  </p>  <p>  \t  This course welcomes anyone of all ages and experience. Within this course you will find out what text editors and web browsers can be used. Also, you will learn the most used tags in HTML, with a taste of HTML5 in Day 3. Additional resources will be in the course and I am allowing students to ask me to post any additional lessons in this course that they&#039;d like to learn <strong><em>for free</em></strong>, and quizzes will be at the end of each section.  </p>  <p>  \tThis course is structured for you to learn in three days that way you can move on to other programming languages for web development. However, that does not mean it is required to be done in three days. You have lifetime access to these videos and can pace yourself however you&#039;d like too!  </p>  <p>  \t<strong>  What You Will Be Learning</strong>  </p>  <ul>  \t<li><strong></strong>Finding the right text editor for yourself</li>  \t<li>Choosing a great web browser</li>  \t<li>How to create a webpage</li>  \t<li>The <em>most </em><strong>used html tags.</strong></li>  \t<li><strong>A <em>taste</em> </strong>of <strong>HTML5</strong></li>  \t<li><strong></strong>How to implement comments in your code</li>  </ul>  <p>  \t  Take this course amazing HTML course, and start learning HTML!  </p>", 
    "end_date": null, 
    "title": "HTML: Beginners Guide", 
    "price": "20.00", 
    "instructors": "Brianna Flemings", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354128_a59c_3.jpg", 
    "course_url": "https://www.udemy.com/learn-html-in-three-days/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-22T23:46:17Z"
}