{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Do you want to learn how to create websites? Not sure where to start?<br><br>This step by step course will help you learn to code fast with an instructor that cares about his students.<br><br>In this course, we will start from basic tags, writing methodology, styling web pages, creating tables and much more. I'll explain why the code we write looks the way it does. I'll point out the simple patterns in the code, so you can learn more quickly and with more confidence.</p>\n\n<p><strong><br>I have structured this course in such a way that a newbie with no coding experience could learn at their pace. We will start this course with the introduction of HTML 4, then we will learn some basic tags in HTML that usually use in most of the web pages, then you have a separate section of formatting where you will learn how we format our content on web pages. After that, we will move towards list items where you will learn how to create lists and menus. Then I'll teach you how to build tables in HTML with all possible tags and attributes that we have in HTML. And the last section is on images where we will play with pictures.</strong><br><br>This course comes with an unconditional 30-day Udemy money-backed guarantee. Try out this course for 30 days and see for yourself if my approach to learning HTML is right for you. If you're not 100% satisfied with this course, just request a full refund within 30 days — no conditions, no questions asked!</p>\n\n<p><br><strong>It is a very condensed 1-hour tutorial that will show you how to code in HTML. Enroll to begin your journey to be a web development master. I'm confident you'll LOVE this course, and I'm excited to help you learn. Enroll now and you can start building your web page using HTML today! </strong><br></p>", 
    "end_date": null, 
    "title": "HTML - Learn HTML in 8 steps", 
    "price": "20.00", 
    "instructors": "Ankit Shrivastava, TweakCoder eLearning Solutions", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446710_53e0_3.jpg", 
    "course_url": "https://www.udemy.com/learn-html-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T18:06:02Z"
}