{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Apsveicu, ka esi nonācis tik tālu! Ja reiz Tu lasi šo, tad noteikti interesējies par mājaslapu izstrādi.</p><p>Šajā video kursā Tu apgūsi visu nepieciešamo, lai veidotu savas mājaslapas. Mēs strādāsim ar HTML un CSS valodām, uzsvaru liekot uz vārdu Mēs. Es saprotu cik garlaicīgi ir strādāt pēc grāmatām un garlaicīgas teorijas. </p><p>Tāpēc šis video kurss ir bāzēts uz projektu. Ar to es domāju, ka <strong style=\"\">nebūs nekādu garu lekciju stāstot par to, kādos gadījumos ir jālieto viens elements un kādos gadījumos nevar lietot otru</strong>. Nē, nē, nē. 21. Gadsimtā vairs nav nepieciešamības pēc tik garlaicīgām mācībām. Mēs ķersimies uzreiz vērsim pie ragiem. </p><p>Visas lekcijas ir ierakstītas pa taisno no ekrāna. Tas nozīmē, ka Tu redzēsi, kā es rakstu mājaslapas kodu no paša sākuma. Rakstot šo kodu paralēli es stāstīšu ko nozīmē katrs elements un ko tas dod. </p><p><strong style=\"\">Sekojot līdzi kursam un darot visu, ko es daru Tu ne tikai būsi redzējis un dzirdējis kā veidot mājaslapas, bet pats arī būsi izveidojis jau gatavu un modernu mājaslapu ar, kuru varēsi paspīdēt saviem draugiem, vecākiem vai priekšniekam.</strong> </p><p><strong style=\"\">Mēs soli pa solim iesim cauri katram mājaslapas izstrādes posmam. </strong>Pats labākais izmantojot šīs video lekcijas ir tas, ka ja kaut, ko līdz galam nesaproti, Tu vari lekciju noskatīties vēl vienu reizi vai arī uzdot jautājumu diskusiju panelī un<strong style=\"\"> es palīdzēšu atrisināt jebkādas aizķeršanās.</strong> </p><p>Neviens cits seminārs, neviens cits „Bootcamps” nepiedāvā to apmeklēt vēl vienu reizi, ja neesi kaut, ko sapratis, kā arī instruktori nepalīdzēs Tev atrisināt tavus sarežģījumus pēc kursa beigām. Bet piesakoties šim kursam <strong style=\"\">Tu to varēsi skatīties jebkurā vietā un jebkurā laikā un tik reizes cik būs nepieciešams.</strong> </p><p><strong style=\"\">TĀTAD, KO TU IEGŪSTI PIESAKOTIES ŠIM KURSAM</strong></p> <ul style=\"\"><li><strong style=\"\">Lekciju kursu, kurā Mēs izstrādāsim mājaslapu izdomātam uzņēmumam</strong><strong style=\"\"></strong></li> <li>Apmācības, kas notiek „soli – pa – solim” veidā<strong style=\"\"></strong></li> <li>Iemācīsies, kā izstrādāt responsīvu mājaslapu. (Tādu, kas izskatīsies labi gan uz datora, gan telefona)<strong style=\"\"></strong></li><li>Viss ir izstāstīts <strong style=\"\">skaidrā Latviešu valodā</strong></li> <li>Iegūsi nepieciešamās HTML un CSS zināšanas, lai veidotu arī citas mājaslapas<strong style=\"\"></strong></li> <li>Mēs pat apskatīsim un pielietosim nedaudz jQuery valodu. <strong style=\"\"></strong></li> <li>Kā strādāt ar „Brackets” – vienu no labākajiem bezmaksas koda redaktoriem<strong style=\"\"></strong></li> <li>Kā augšupielādēt mājaslapu tā, lai visi to var redzēt<strong style=\"\"></strong></li> <li><strong style=\"\">Mūža pieeju šim lekciju kursam</strong><strong style=\"\"></strong></li> <li>Palīdzību, ja kādā no posmiem, kaut, kas šķiet nesaprotams, vai vienkārši nestrādā<strong style=\"\"></strong></li></ul> <p><strong style=\"\">BONUSI</strong></p><p>Neskaitot visas augstāk minētās priekšrocības, vēl papildus es esmu iekļāvis failu ar dažādiem linkiem, kas noderēs, lai atrastu bezmaksas attēlus. </p><p>Kā arī, šis lekciju kurss tiks papildināts ar jaunām lekcijām, lai Tu varētu papildināt savas zināšanas vēl vairāk. </p><p>Es esmu pilnīgi ieinteresēts, lai Tu apgūtu pēc iespējas vairāk zināšanu, kuras Tev tālāk noderēs dzīvē. </p><p><strong style=\"\">Negaidi vairs ilgāk šī ir Tava iespēja paplašināt savas karjeras iespējas! PIESAKIES TAGAD.</strong></p> P.S. Visticamāk šī kursa cena drīzumā pacelsies līdz 150€. <strong style=\"\">  </strong>", 
    "end_date": null, 
    "title": "Iemācies veidot modernas mājaslapas", 
    "price": "45.00", 
    "instructors": "Kārlis Šēns", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544394_ee25_3.jpg", 
    "course_url": "https://www.udemy.com/ka-izveidot-majaslapu/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T21:30:38Z"
}