{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>One of the most problematic things about learning Web Development is that <strong>Teachers tend to only cover just enough</strong> to get you through. This course is about learning Web Development and obtaining a <strong>full understanding of all three languages</strong>. I take a more direct approach, teaching you nearly all of the syntax and helping you understand why they exist by delving into some of the history about Web Development, and then I reinforce this with <strong>quizzes after every 5 videos</strong> along with <strong>several Code-Along Projects</strong>. </p><p>Each video is so simplified that there is no need to constantly check for the code in the downloads page. Each Part is a full list of Syntax from W3C, the makers of HTML5 and CSS3, so that almost <strong>No Syntax is missed</strong>. We go over each one and I give you the simplified explanation of what the syntax does and how to use it or why it is used.</p><p>As my Students from <em>Learn The Quickest Way for Writing a Book that I use</em> can tell you, <strong>I take students seriously</strong>. I respond within a day and, if it's a problem I think other students may have, I create an entire video just for that one problem.</p><p>This course will be included inside of each bigger language that I cover, Ruby, C#, Python, and Nodejs. If you have taken multiple Web Development courses and some of the information just doesn't seem to stick, then this is likely <strong>the perfect course for you</strong>. So, c'mon and join me in learning how to develop websites from scratch!</p>", 
    "end_date": null, 
    "title": "In Depth Web Development Made Easy", 
    "price": "20.00", 
    "instructors": "Tommy Mertell, Muhammad Uzair Khalid", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615920_4c65_7.jpg", 
    "course_url": "https://www.udemy.com/in-depth-web-development-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-18T15:49:06Z"
}