{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Do you want to master WordPress?</strong> Then you have to work with WordPress</p>  <p> In this course, I'll show you how to install WordPress on your computer so that it's easier to build sites for WordPress without relying on an external web host or an Internet connection. </p>  <p>Whether you are a beginner wanting to learn the ins and outs of WordPress, a budding designer or developer looking for themes and plugins, or an advanced developer building a production environment, installing and running WordPress on your own computer is a crucial first step. In this course</p>  <p>I'll start by showing you where to get WAMP and how to install it and configure WAMP and WordPress,It will make a lot easier to experiment with  WordPress. So let's get cracking with Installing and Running WordPress WAMP. This course is for all novices to expert who wants to install wordpress on local computer this is based on WWH concept means What? Why? And How? Will tell what to do why to do and how to do so there will be no confusion <strong>Have your LOCALHOST setup in 5 minutes using WAMP.</strong>Because WAMP is installed on your computer, you don't need Internet access to use your WordPress site. This also means the site is only accessible from your computer--that is unless you've decided to make your computer a public web host-- something I don't recommend you do. The true benefit of having WordPress running on WAMP, on your Windows computer is that you can work with the files directly, and you don't have to keep uploading and downloading them to and from your web server. They're all there ready for you to work with and experiment with.</p>  <p>Now that you know what WAMP is and how it works, let's get started. </p>", 
    "end_date": null, 
    "title": "Install Wordpress On Your Computer Step By Step From Scratch", 
    "price": "20.00", 
    "instructors": "Rajendra Upadhyaya", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594944_9d9a_6.jpg", 
    "course_url": "https://www.udemy.com/install-wordpress-on-your-computer-step-by-step-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T12:47:00Z"
}