{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>LEARN HOW TO CODE IN JUST 2 WEEKS!</strong></p><p><strong><em>PRICE REDUCTION! With Udemy's new pricing structure right around the corner, this course is now just $49 :)</em></strong></p><p><strong><em>Find out why students are saying this is the best Ruby course they've ever taken!</em></strong></p><p>* Latest Update: January, 16th 2016</p><p><strong>Many people who try to switch to coding as a career don't make it. And you want to know the number 1 reason employers tell me? Its because <em>they don't understand the basics</em>.</strong></p><p><em>You can become a coder.</em> While it may seem like a totally foreign language, once you understand some of the underlying principles its actually quite easy - and fun!</p><p>Ruby is a fantastically powerful language used by startups and top companies like Airbnb and Twitter. And Unlike languages like Java, C# or Swift, it is relatively easy to learn. But let me tell you: as someone who has worked for years as a professional programmer and hired dozens of coders myself, understanding the basics is critical.</p><p>My Newbie to Ruby course if the first part of a series on becoming a professional programmer. It lays the foundations for web development using Ruby on Rails and will set you on a life changing career path. <strong>If you try to do Rails without knowing Ruby you will most likely fail.</strong></p><p><em><strong>Understanding Through Exercises &amp; Drills</strong></em></p><p>The course follows a simple pattern. I introduce a concept, give you an exercise and then go through the exercise in detail so that you can solidify your understanding. I also have dozens of additional drills with solutions to help you hone your skills.</p><p><strong><em>Complete in 2 weeks</em></strong></p><p>The course is broken up into 12 sections and you should be able to get through 1 section per evening if you're doing this part time. So all up you'll need about 2 weeks.</p><p><strong>The Course will Cover</strong></p><ul><li>Methods</li><li>Predicates and Conditionals</li><li>Looping</li><li>Input and Output</li><li>Objects and Classes</li><li>Arrays, Hashes and other Data Structures</li><li>Math and much more</li></ul><span></span><p>Get your coding career off to a flying start with my Newbie to Ruby course.</p><p>There has never been a better time to switch your career!</p>", 
    "end_date": null, 
    "title": "Introduction to Coding with Ruby", 
    "price": "20.00", 
    "instructors": "Dan Draper", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543090_9b99_3.jpg", 
    "course_url": "https://www.udemy.com/newbie-to-ruby/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T12:47:13Z"
}