{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>En el Curso de Introducción a APEX 5.0, \nel alumno desarrollará una aplicación web desde cero. Cada clase le \notorga al estudiante un nuevo nivel de conocimiento en el Desarrollo de \nAplicaciones Web con Oracle Application Express (APEX).</p>\n\n<p>Se\n inicia desde lo más básico con la descarga e instalación del entorno de\n desarrollo local y la creación de informes y formularios por medio de \nlos asistentes para continuar avanzando en complejidad tanto en la \npersonalización de los Informes Interactivos con estilos CSS y consultas\n SQL personalizadas como en la utilización de plugins, imágenes, \ngráficos, reportes, desarrollo de asistentes propios y la creación de la\n página de Dashboard que concentrará toda la información de la \naplicación demo.</p>\n\n<p>Con el curso de \nformación de Oracle APEX 5.0 con una duración de un poco más de 5 horas \nde instrucción el estudiante podrá descubrir cómo desarrollar con \nfacilidad y rapidez una aplicación web utilizando Oracle Application \nExpress.</p>\n\n<p>Se encuentra impartido en \nclases organizadas de tal manera que el estudiante pueda crear una \naplicación web demo para la Gestión de Libros y Autores DESDE CERO y \ndisponga de las herramientas básicas para la creación de sus propias \naplicaciones web con Oracle Application Express.</p>\n\n<p>Oracle\n APEX es una herramienta para el desarrollo de aplicaciones web \nproductivas de forma rápida y segura, que se ejecuta en una base de \ndatos Oracle. Esta herramienta está destinada tanto a usuarios como a \ndesarrolladores. Para los usuarios que tienen limitada o ninguna \nexperiencia en programación APEX les permite crear fácilmente informes, \nformularios y cargar los datos desde hojas de cálculo y archivos de \ntexto a la base de datos. También permite a los desarrolladores \nconstruir rápidamente formularios, informes y desarrollos menos \ncomplejos de aplicaciones web centradas en una base de datos. El entorno\n de desarrollo de APEX es completamente web y permite a los \ndesarrolladores concentrarse en las características y funcionalidades de\n las aplicaciones, es decir la lógica del negocio y no en los detalles \nrelacionados con la interfaz.</p>", 
    "end_date": null, 
    "title": "Introducción a Oracle APEX 5.0", 
    "price": "50.00", 
    "instructors": "Clarisa Maman Orfali", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/883398_cf56.jpg", 
    "course_url": "https://www.udemy.com/introduccion-a-oracle-apex-5/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-20T18:10:50Z"
}