{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Web developers today are looking to create reusable workflows and development tools in JavaScript that will dramatically streamline development. Grunt helps you achieve that and more. In addition to being able to run custom commands easily, Grunt makes your web development experience very rewarding by reacting whenever a file is changed and performs the actions needed.</p><p style=\"\">This course will help in all aspects of development, from writing better code to deploying compact production packages.</p><p style=\"\">You&#039;ll start with a simple Grunt file and move on to building a fully functional workflow and deployment system. You&#039;ll learn how to deal with simple tasks such as renaming, moving, and combining files, before moving on to more complex activities such as creating concise and compact deployment packages. You&#039;ll learn how to create a basic file then build upon it by adding modules to achieve various levels of automation that were previously difficult to attain. Next, you&#039;ll learn to use a range of plugins to achieve concatenation, image minification, and create responsive images. Before we reach the end, you will learn to compile many types of languages and then will test your code using multiple testing frameworks such as JSLint, PhantomJS, and Behat. Finally, you&#039;ll be introduced to some advanced uses of Grunt involving custom command-line commands you want to use.</p><p style=\"\">Once you are done with this course, developing workflows will be a breeze for you.</p><p style=\"\"><strong style=\"\">About the Author</strong></p><p style=\"\"><strong style=\"\">Daniel Linn</strong> has been into technology since 1992 when his father brought a modem home from his work at the cable companies for testing and he saw his first rollover image. His career has spanned all aspects of the software development life cycle, and over that time he&#039;s fulfilled many different roles including Designer, Developer, Project Manager, Database Admin, and Front End Architect, with some Dev Ops thrown in from time to time. He is currently the Director of Development at Metal Toad, a Portland-based technology consulting firm specializing in mobile, desktop, and web applications and solutions.</p>", 
    "end_date": null, 
    "title": "Introducing Grunt: The JavaScript Task Runner", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546710_9c14_2.jpg", 
    "course_url": "https://www.udemy.com/introducing-grunt-the-javascript-task-runner/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T13:46:24Z"
}