{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This is Volume 3 of a 3 part series, <strong class=\"redactor-inline-converted\">Introducing AngularJS</strong>. We recommend that you view these volumes in sequential order so that you can follow along with our author <strong>Mathieu Chauvinc </strong>from start to finish. You can find other volumes in this series on Udemy by following the links below:</p>\n\n<p>Volume 1: Introducing AngularJS-Volume 1<br>Volume 2: Introducing AngularJS-Volume 2</p><p>AngularJS is a Google-backed JavaScript framework that simplifies the development of single-page applications and other web page JavaScript widgets. It is one of several modern frameworks that are revolutionizing web development by bringing a fresh, more professional orientation to application building. Developers will love working with the framework, which allows them to focus their time on actual logic, instead of having to deal with repetitive tasks such as rendering and event binding.<br></p>\n\n<p>Introducing AngularJS will show you how to build a complete application in a very short time, yet without cutting corners that would be detrimental to code quality. We will take you through a concrete application, a movie library app, one step at a time, in order to introduce the concepts behind all the moving parts of an AngularJS application.</p>\n\n<p>We will start by quickly scaffolding an entire application's structure using Yeoman. This will lay the foundations of our application in a well-structured manner. Then we'll focus on displaying data and allowing the user to interact with the application, and how can Angular help us handle rendering and events binding, so we can focus more on the app logic itself. We'll peek into templates and controllers, and will see how Angular's declarative nature makes it obvious which element is in charge of which functionality.</p>\n\n<p>We will then introduce a second view to the application, and show how to handle routing between the two views, including reading parameters from the URL and how we can very quickly create new routes with the companion tool Yeoman.</p>\n\n<p>You will also learn how to load data from an API using AJAX, both from the same server as the app, as well as from an external source. Finally, we will close by introducing services that are Angular data-layer singleton objects as well as building a client-side data persistence using LocalStorage.</p>\n\n<p>Introducing AngularJS will guide you through all the aspects of an Angular application, start-to-finish, view logic to data layer and persistence. You will learn how Angular makes developers lives easier by taking care of rendering and event handling, giving you more time to focus on what you love: the actual logic of the app. With Yeoman, you will also guarantee the quick creation of new views, routes, and controllers, without ever having to create a file manually.</p>\n\n<p><strong class=\"redactor-inline-converted\">About the Author</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Mathieu Chauvinc</strong> is a Managing Director at Red Ape Solutions and has made Angular the company's weapon of choice in building complex single-page applications and neat hybrid mobile apps. He has been involved in web technologies for over a decade, from Django to Node, SQL to NoSQL, Mootools to Angular, continuously trying to keep the right balance between the excitement of new frameworks and the stability of proven ones. He always has a special place in his heart for Python and Django.</p>\n\n<p>He holds a Master's degree in Engineering from the German University Karlsruhe and a Master's degree in Engineering from the French ENSAM (Paris). Despite an engineering background, he has always had a passion for knowledge sharing, which has followed him to this day. He regularly conducts corporate or free training on various I.T. topics in his adoptive country of Malaysia.</p>", 
    "end_date": null, 
    "title": "Introducing AngularJS", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546492_cddb_2.jpg", 
    "course_url": "https://www.udemy.com/introducing-angularjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T08:52:33Z"
}