{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">HTML is everywhere </strong>and more and its more important than ever.   Its not only for web developers, having knowledge of HTML and how it works is beneficial in most careers.   </p>\n\n<p><strong class=\"redactor-inline-converted\">HyperText Markup Language</strong>, commonly abbreviated as HTML, is the standard markup language used to create web pages. Along with CSS, and JavaScript, <strong>HTML is a cornerstone technology</strong> used to create web pages as well as to create user interfaces for mobile and web applications.</p>\n\n\n\n\n\n<p>Taught by an instructor with over 15 years of real world web development experience. This course has everything you need to learn how write HTML code from scratch.<br></p>\n\n\n\n\n\n<p>Fast paced get to the point training, to learn about creating websites and using HTML code.  </p>\n\n\n\n\n\n<p>By the end of the course you will have the skills and know how to apply HTML to make a real website.   </p>\n\n\n\n\n\n<p>I am here to help you learn how to create your own websites and ready to answer any questions you may have.</p>\n\n\n\n\n\n\n\n<p>Learning how to apply HTML to design web content will help to separate you from the crowd.</p>\n\n\n\n\n\n\n\n<p>Want to know more, what are you waiting for take the first step.  Join now to start learning how you too can write your own <strong class=\"redactor-inline-converted\">HTML code today.</strong></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "introduction to HTML Course", 
    "price": 0, 
    "instructors": "Laurence Svekis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/803074_e760.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-html-course/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T18:07:10Z"
}