{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  Learn Introductory JavaScript with this video course from TeachUcomp, Inc. Mastering Introductory JavaScript Made Easy features 128 video lessons with 6 hours of instruction. Watch, listen and learn as your expert instructor guides you through each lesson step-by-step. During this media-rich learning experience, you will see each function performed just as if your instructor were there with you. Reinforce your learning with the text of our printable classroom instruction manual, additional images and practice exercises. You will learn the JavaScript language from scratch, while exploring all of the techniques to add the various elements to your website.  </p>  <p style=\"\">  \t  The purpose of this course is to educate the student in the basic language skills necessary to use JavaScript. There are many resources available on the Internet that allow you to download code and place it into your HTML document or JavaScript code file. However, it is important to first understand the underlying language and components of JavaScript to be able to alter the code to work in your desired application, and easily troubleshoot any errors that may occur.  </p>  <p style=\"\">  \t  Whether you are looking to add interactivity to your website, control how a browser acts or alter your HTML document’s content, it is a good idea to have a firm grasp of the basics of JavaScript.  </p>  <p style=\"\">  \t  We begin this course by discussing the basic components and structure of JavaScript as well as learning the terminology. Then, we’ll advance through topics to cover some more advanced concepts and uses for JavaScript. If you are completely new to JavaScript, or just need a refresher, this course will empower you with the knowledge and skills necessary to be a proficient user of JavaScript. We have incorporated years of classroom training experience and teaching techniques to develop an easy-to-use course that you can customize to meet your personal learning needs. Simply launch the easy-to-use interface, click to start a video lesson or open the manual and you’re on your way to mastering JavaScript.  </p>", 
    "end_date": null, 
    "title": "Introductory JavaScript Made Easy Training Tutorial", 
    "price": "20.00", 
    "instructors": "TeachUcomp, Inc.", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/316704_47de_2.jpg", 
    "course_url": "https://www.udemy.com/introductory-javascript-made-easy-training-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-09T16:42:34Z"
}