{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">As the internet becomes more of an application platform, the need to develop more feature-rich and immersive applications grows! Dart is a fantastic class-based, object-oriented language that pushes back on the idea that JavaScript should have a monopoly on web application development. It can be used both server side (dartVM) and client side (web browser) to build any application from a simple script to a full-blown 3D web game.</p><p style=\"\">Introducing Dart is a joyride of game programming where the user harnesses the power of the Dart programming language. The techniques shown in these videos can easily be applied and expanded upon to create any kind of interactive web application.</p><p style=\"\">We begin by learning how to install the Dart development environment, and how to get started using the Dart Editor. We then walk through building our game step-by-step until we are left with a fully functional game called “Dart Worm”.</p><p style=\"\">At the first step you will be introduced to the Dart SDK and the Dart editor software. This will provide the environment where we will design and develop our main project. Then you will learn how to use Dart to access the elements on a web page (called the DOM). Once these elements are accessed you will be shown how to manipulate them by calling methods, and how to add and remove elements from the DOM dynamically.</p><p style=\"\">As we move on we will be covering specific Dart classes that will help us bring the different components of our game to life. We will learn how to animate our game, keep score, and present the user with controls. Eventually, we will be putting everything we learned together and building our final game.</p><p style=\"\">When you have completed these videos, you will have all of the tools necessary to build and deploy a fully functional web application using the Dart programming language.</p><p style=\"\"><strong style=\"\">About The Author</strong></p><p style=\"\"><strong style=\"\">James Slocum </strong>is a Software Developer for TelVue, and an adjunct Computer Science professor at Mercer County Community College. He studied Computer Engineering and Computer Science at the New Jersey Institute of Technology, graduating in 2008. His first article about Dart was featured in the March 2013 (#227) issue of Linux Journal.</p>", 
    "end_date": null, 
    "title": "Introducing Dart", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/575568_85b8_2.jpg", 
    "course_url": "https://www.udemy.com/introducing-dart/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-06T10:56:33Z"
}