{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tThis course provides instruction through video lectures and materials which will teach (you) the student how to program in Java from the very basic level to an intermediate level of programming.  The intent is to aid anyone who is struggling in learning how to program and would like to see practical examples and demonstrations.  This course is not affiliated with any university and will not provide answers to any homework assignments for any reason.  Topics covered will include but not be limited to:  </p>  <ol style=\"\">  \t<li>Syntax and commands</li>  \t<li>Creating variables</li>  \t<li>Creating methods</li>  \t<li>Working with files</li>  \t<li>Exception handling</li>  \t<li>Creating Classes</li>  \t<li>Object-Oriented programming basics</li>  \t<li>Basic Unit Testing</li>  \t<li>Graphics and GUI programming</li>  </ol>  <p>  \tIn the end, this course is a stand-alone course, however it would be a huge aid to the online student who is taking a self-directed course, an individual who is trying to learn how to program, or even a high school student looking to get a head start on computer science material they might encounter in college.  The material is organized in a start-to-finish fashion, building on knowledge with each section, so it is best to proceed through each section in order.  Each section should amount to about a week worth of learning, lining up with most popular online course formats.  Additionally, the course works hard to build practical knowledge that will help a student excel in their coursework, and also builds a strong foundation for a start to a career in programming for anyone looking to learn!  </p>  <ol style=\"\">  </ol>  <p>  \tAs an added bonus, several useful programs are built throughout this course, and the end result of the course includes full source code for a working Sudoku game, amongst other programs, such as card game score calculators and basics physics formula calculation programs.  </p>", 
    "end_date": null, 
    "title": "Introduction to Java Programming for Online Learners", 
    "price": "20.00", 
    "instructors": "Brian Gorman", 
    "commitment": "21 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/12975_4998_6.jpg", 
    "course_url": "https://www.udemy.com/learning-to-program-in-java-a-supplement-for-online-academic-learners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-01-23T16:03:14Z"
}