{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>ACTUALIZACIÓN 2016-04: El curso ha sido actualizado para Symfony 2.8 LTS</em></p>\n\n<p>  \t      Este curso es una introducción al desarrollo web con <strong>Symfony</strong>, el framework para PHP más completo del mercado.<strong></strong></p>\n\n\n\n\n\n\n\n<p>  \t      Está basado en vídeos donde podrás seguir la creación desde cero y paso a paso de una aplicación web completa: un <strong>blog</strong>, incluyendo su área de administración.  </p>\n\n\n\n\n\n\n\n<p>  \t      La duración total es de <strong>4 horas</strong>, pero si quieres practicar mientras aprendes te llevará más tiempo, lo cual <strong>recomiendo</strong>.  </p>\n\n\n\n\n\n\n\n<p>  \t      El curso está estructurado de forma general en:  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>Preparación del <strong>entorno de desarrollo</strong></li>  \t<li>Generación del <strong>bundle principal</strong> donde irá la parte pública (frontend)</li>  \t<li>Generación del <strong>bundle del modelo</strong>, donde irá la lógica de negocio (interacción con la base de datos)</li>  \t<li>Generación del <strong>bundle de administración</strong>, para gestionar los posts y autores (backend o backoffice)</li>  \t<li>Refactorización del código para modularizar y organizarlo mejor, usando la flexibilidad del <strong>contenedor de dependencias</strong></li>  \t<li>Hacer uso de las URLs para seleccionar el <strong>idioma</strong></li>  </ul>\n\n\n\n\n\n\n\n<p>  \t      Durante todo el curso se hará hincapié en el desarrollo guiado por pruebas, usando el estándar de la industria: <strong>PHPUnit</strong>.  </p>\n\n\n\n<p>Además la aplicación resultante está en GitHub para su consulta, podrás encontrarla en la última lección (puedes consultarla incluso si no te has inscrito al curso). Usa etiquetas de git para que puedas ver cómo queda el código al final de cada lección.</p>\n\n\n\n\n\n\n\n<p>  \t      Si eres un <strong>desarrollador de PHP</strong> con curiosidad por los frameworks y quieres pasar al siguiente nivel, o bien ya conoces Symfony u otro framework y quieres repasar y profundizar, <strong>este es tu curso</strong>. Una introducción que te sumergirá en la creación de una aplicación de forma amena y directa, haciendo uso de las <strong>buenas prácticas</strong>.  </p>\n\n\n\n\n\n\n\n<p>  \t    Una vez inscrito en el curso <strong>responderé las dudas que te vayan surgiendo</strong> respecto al temario.  </p>", 
    "end_date": null, 
    "title": "Introducción al desarrollo web con Symfony2", 
    "price": "30.00", 
    "instructors": "David Morales", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/125082_1fd7_8.jpg", 
    "course_url": "https://www.udemy.com/introduccion-al-desarrollo-web-con-symfony2/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-25T13:01:28Z"
}