{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Are you considering web development as a career?  Do you simply want to learn to create your own web sites but don&#039;t know where to start?  Does the world of programming fascinate you?  Are you curious about &quot;what it takes&quot; to be a web developer.  </p>  <p>  \t  Join master instructor, Mark Lassoff, for this fast paced, short course designed to introduce you to the world of web development. You&#039;ll be introduced to three of the primary languages used for web development.  </p>  <p>  \t<strong style=\"\">Exposure to Three Major Programming Languages</strong><br style=\"\">  \t<strong style=\"\"></strong>First, Mark will introduce you to HTML5, HyperText Markup Language, used to contain the content elements of web and mobile sites.  Next, you&#039;ll be introduced to CSS, Cascading StyleSheet Language, used to add design and style to web presentations.  Finally, Mark will introduce you to Javascript, one of the most important and fastest growing languages used today.  </p>  <p>  \t<strong style=\"\">Dynamic Course Design</strong><br style=\"\">  \t  This course is designed to give you a preview of what professional web development work is like.  You&#039;ll use some of the same languages and techniques used by professional web developers every day.  With fascinating, fast paced lectures, code samples, and challenging lab exercises (solutions provided) you&#039;ll gain a sense of what it&#039;s like to work in the web development field.  </p>  <p>  \t  Thousands have learned web development and programming from Mark Lassoff.  Join <strong style=\"\">Introduction for Web Development</strong> today and start your path towards mastering this exciting and challenging field.  </p>", 
    "end_date": null, 
    "title": "Introduction to Web Development", 
    "price": "20.00", 
    "instructors": "LearnToProgram, Inc., Mark Lassoff", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/99986_6cb4_9.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-web-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-01T14:21:29Z"
}