{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Save your precious time</strong> by buying this course. You will learn how to program in JavaScript in a fast and easy way!</p><p>The total length of the JavaScript course is<strong> over 12 hours</strong>! <strong>You will learn theory</strong> and <strong>y</strong><strong>ou will also gain lots of practice.</strong> During the course,<strong> I will explain to you how to write </strong><strong>real-life applications, </strong>like galleries with thumbnails, image sliders, etc<strong>.</strong></p><p>I will do everything so that you <strong>understand JavaScript. </strong>After this course, you will always understand the code you are writing. You will understand all concepts and create your own applications!</p><p><strong>After my course, you can become a front-end develope</strong><strong>r.</strong> <strong>J</strong><strong>avaScript is a very demanded language by employers.</strong></p><p>The course is <strong>designed for the people who don't have any knowledge about programming or want to truly understand JavaScript</strong>. It doesn't matter if you have never written any programs or you have no idea about programming... After my course, all this will change.<strong> You will bust the myth that programming is a difficult thing only for the few!</strong></p><p>  \t                          <em>JavaScript</em> will bring life to your website.</p>  <p>  \t                        By life, I mean inter-active, animated elements like:  </p>  <ul>  \t<li>tooltips</li>  \t<li>image sliders</li>  \t<li>forms with pre-validation</li>  \t<li>slided panels</li>  \t<li>galleries with thumbnails</li>  \t<li>menus</li>  \t<li>and many more</li>  </ul><p><strong>Learn JavaScript </strong>in order to <strong>improve the user experience on your website, </strong>which will result in<strong> more visitors and sales, </strong>because happy visitors = a better reputation for your website.</p><span></span><strong>JavaScript gives your website additional functionalitie</strong><strong>s</strong> that can be executed on the user's computer without re-connecting to the server. This allows you to do things that you cannot do with only HTML. Because of this, the <strong>user interface becomes more friendly and more inter-active</strong><p><em>Javascript</em> is a programming language used for creating dynamic action on your website. If you want to remove/change/add content to your website dynamically, you must know JavaScript.</p><p>After this course, <strong>you will know JavaScript perfectly.</strong> This is <strong>t</strong><strong>he most organised course about JavaScript from Beginner to Expert on the whole Internet.</strong> <strong>I will take you step by step from theory to practical examples, like image sliders and animation.</strong> </p>  <p>Understanding JavaScript syntax well will allow you to also understand jQuery framework better. jQuery framework is a big library of useful JavaScript functions that allows you to write less code while doing much more.</p><p>What's more is that JavaScript is required to understand AJAX which lets you load content on your website without reloading the whole website.</p>  <p>  \t  As a front-end developer you have to know HTML, CSS and JavaScript perfectly.</p><p>In addition to this, I'm <strong>adding two BONUS sections </strong>about<strong> Debugging and Best practises </strong>for developing clean, easy to maintain and well-performing code in JavaScript.</p><p><strong>JavaScript is necessary for becoming a front-end developer.</strong> Imagine a situation where you have a clock on your website. You would need to request a new value from the server every second in order to update this clock. With JavaScript, everything runs on the user side without re-connecting to the server. Imagine a situation where the clock would need to reset each second. Your webpage would just constantly reload to update the content, destroying the user experience. <strong>With JavaScript you can update the content without reloading the webpage. </strong>What's more is that there are advanced libraries for JavaScript, like AJAX, that allow you to connect to the database and retrieve information without reloading the website. To sum up JavaScript 'runs' on the web-browser of the visitor of your website.</p><p><strong>I give you 100% satisfaction. </strong>If you do not like my course, <strong>you can request a full refund up to 30 days. </strong>Remember that if you have any questions regarding topics covered in the course <strong>please feel free to ask. </strong><em>I'm always happy to help!</em></p><ul><li><em>Over 12,000 people from around the world have enrolled in my courses</em></li><li><em>My courses are updated if needed</em></li></ul><em></em><em></em><p><strong>Please check out free lessons before buying! See for yourself the great quality of the course and enjoy it!</strong></p>", 
    "end_date": null, 
    "title": "JavaScript from Beginner to Expert", 
    "price": "35.00", 
    "instructors": "Arkadiusz Włodarczyk", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426196_3cb8_2.jpg", 
    "course_url": "https://www.udemy.com/javascript-from-beginner-to-expert-bring-life-to-your-site/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T19:16:27Z"
}