{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>One of the best ways to learn is to <strong>work on a project</strong>.  We start with a blank page and build the application step by step.  <strong>All of the source files are included.</strong><span></span></p><p>Do you want to<strong> learn JavaScript working</strong> on a real project?  </p><p>We show you how to use JavaScript to create an interactive game, everything from creating the game board to messaging, text, timers, and game setup.</p><p>We build this game in bootstrap, show you the HTML CSS and JavaScript.</p><p>Learn to Create your own JavaScript GAME!!!</p><p>Within this course we show you how to add JavaScript functionality when building out projects and use JavaScript to achieve your goals. </p><p>We have designed this course to optimize practicing JavaScript coding.</p><ul><li>CODE SAMPLES INCLUDED!!</li><li>PRACTICE EXERCISES</li><li>CODE EXPLANATIONS</li><li>CODE IMPLEMENTATIONS</li></ul><p>Try the code after each video lesson. PDF copy and paste code that we use within the course and TRY FOR YOURSELF.</p><p>Everything you need to learn about JavaScript is provided within this course.<br></p><ul><li>quick lessons get right to the point</li><li>source files downloadable to work along</li><li>challenges and lessons</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li></ul><p>Learn how Javascript works and it's fundamental concepts when it comes to creating games and interactive projects. Learn to build your own Javascript code to make your own JavaSCript memory game</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "JavaScript project Learn to create a memory Game and more", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628430_d393.jpg", 
    "course_url": "https://www.udemy.com/javascript-project-learn-to-create-a-memory-game-and-more/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T00:36:55Z"
}