{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>JavaScript is one of the Hottest skills to know for 2016!</strong></p><p>In this course we teach you the core fundamental skills that you need to know in order to apply JavaScript to your webpages.  Understanding the core coding options allows you to develop a solid base to build even more complex JavaScript.  </p><p>JavaScript is an excellent gateway to learning scripting languages, its perfect for beginners. Learn how to use JavaScript Step by Step.  JavaScript can be fun to work with and really help bring your web concepts to life.</p><p>I've created hundreds of websites and have over 15 years real world web development experience.  This is a course that outlines key areas that anyone starting out with JavaScript should learn.  Build a solid foundation for future web development.</p><p>JavaScript allows your web pages to interact with your visitors, creating dynamic customized interactions.   React to user actions bringing your web content to the next level.</p><p>In this course you will learn to....</p><ul><li>Create your first JavaScript code - its easy I promise.</li><li>learn how to add JavaScript to your web pages</li><li>Better understand the structure of JavaScript</li><li>Key JavaScript components like Functions, Arrays, Objects, Loops and conditionals and how to apply them in code</li><li>Web development skills to the next level</li><li>JavaScript Core functionality learn about using Math, Strings, literals identifiers  and more.  </li></ul><p><strong>Experience what can be possible with JavaScript.  Learn to create your own immersive web experiences with JavaScript.  Make interactive websites.</strong><br></p><p><strong>Let's start Coding JavaSCript </strong></p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "JavaScript Basics for Beginners Introduction to coding", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/760752_1c18.jpg", 
    "course_url": "https://www.udemy.com/learn-javascript-for-beginners-introduction-to-coding-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-12T16:35:45Z"
}