{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong></p><p><strong></strong><strong></strong><strong></strong><strong></strong></p><p>São 105 videoaulas, 6 gigabytes em arquivos. Use Table DefaultTableModel, Transporte projetos entre Eclipse e NetBens, DAO (Data Access Object), filtrar dados no JTable. Com esse curso vais aprender tudo o que precisa para dominar Java para Desktop.</p><ul><li>Aprenda criar CRUD`s completos usando MVC (Model View Controller), Design Pattern (Factory e DAO), JTable (cores, imagens com ações), Login de acesso com MVC,</li></ul><p>Aprenda criar CRUD`s completos usando MVC (Model View Controller), Design Pattern (Factory e DAO), JTable (cores, imagens com ações), Login de acesso com MVC, São 105 videoaulas, 6 gigabytes em arquivos. Use Table DefaultTableModel, Transporte projetos entre Eclipse e NetBens, DAO (Data Access Object), filtrar dados no JTable. Com esse curso vais aprender tudo o que precisa para dominar Java para Desktop.</p>Quais são os pré-requisitos deste curso?<ul><li>Pré-requisito: Conhecer bem Java SE ou ter os outros cursos de Java SE do professor Neri (Javas SE I, Java SE II e Java SE III).</li></ul>O que serei capaz de fazer depois deste curso?<ul><li>Mais de 105 aulas e 14.5 horas de conteúdo!</li><li>Criar CRUD (gravar, alterar, excluir, pesquisar) usando MVC (Model View Controller)</li><li>Design Pattern (Factory e DAO)</li><li>JTable (cores, imagens com ações)</li><li>Login de acesso com MVC</li></ul>Qual é o público alvo?<ul><li>Alunos que queiram aperfeiçoar seus conhecimentos em Java</li></ul>", 
    "end_date": null, 
    "title": "Java para Web IV MVC Design Pattern Factory DAO", 
    "price": "30.00", 
    "instructors": "Neri Neitzke", 
    "commitment": "23.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632436_01d9.jpg", 
    "course_url": "https://www.udemy.com/java-para-web-iv-mvc-design-pattern-factory-dao/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T14:41:06Z"
}