{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tTake this Javascript training course and start learning Javascript today.<br style=\"\">  \t<br style=\"\">  \t &quot;As a business guy I have no place in programming.&quot; Ten years ago you could have gotten away with that statement. Today you say that to your colleagues and they scoff at you before they go back to their computers to fix real problems and do real work.<br style=\"\">  \t <br style=\"\">  \tIf you want to do something useful start by learning Javascript . In these days when the browser is central to all computer use knowing &quot;the language of the browser&quot; is the most important step. A few years ago Javascript  potential was uncertain and many programmers considered it useless. These days however competent programmers have identified Javascript  real potential and uses and it has gone from a toy language to the main language of the browser. It has become one of the most useful languages of this era. Every developer needs at least a basic understanding of Javascript. A developer who knows Javascript is the rockstar of the company and is in constant demand by employers. Our online Javascript  </p>  <p style=\"\">  \tcourse will get you started by teaching all the essential aspects of coding in Javascript. So... what&#039;s it gonna be? Do you want to supercharge your career and be in constant demand by employers? Do you want to learn how to create dynamic and innovative Javascript documents? Start programming today with our Javascript course for Beginners training and take control of your career.  </p>", 
    "end_date": null, 
    "title": "Javascript for Beginners", 
    "price": "25.00", 
    "instructors": "LearnToProgram, Inc.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8324_fa84_13.jpg", 
    "course_url": "https://www.udemy.com/beginning-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-06-28T08:26:18Z"
}