{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Brand new JavaScript course! - June 2016</strong></p>\n\n<p><strong class=\"redactor-inline-converted\"></strong><strong>Already nearly one thousand students have begun to learn JavaScript in one week since this course was released - with 94% of those reviews rated four or five stars!</strong></p>\n\n\n\n\n\n\n\n<p>JavaScript the Basics is your one stop course to enter into the language of JavaScript. We are going to start from scratch and build up our understanding of the world's most popular programming language together. </p>\n\n\n\n\n\n\n\n<p>View JavaScript in action with <strong class=\"redactor-inline-converted\">whiteboard videos</strong> optimized for viewing on your smartphone. This is truly a course that you can engage with no matter where you are. Take your JavaScript eduction on the go! With whiteboard videos you get to visualize what JavaScript does under the hood. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You can practice JavaScript in your web browser! Take advantage of <strong class=\"redactor-inline-converted\">Google Chrome developer tools</strong> to put the JavaScript you have learned during our whiteboard lesson into practice with further examples and challenges. This is our JavaScript playground.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Learning JavaScript is like learning a language. This course won't make a false promise of saying you will master JavaScript overnight. However, this course will immerse you into the world's most popular programming language. </p>\n\n<p>In just one day we will introduce you to:</p>\n\n<ul><li>JavaScript Syntax</li><li>JavaScript Building Blocks</li><li>JavaScript Best Practices</li></ul>\n\n<p>You'll finish this course with an understanding of JavaScript that will let you take a deeper dive into the language and possibly launch you into a new career as a JavaScript web developer.</p>\n\n<p>Learning a new language can be difficult and even feel intimidating. JavaScript the Basics makes the the learning process feel accessible and welcoming!</p>\n\n<p>Our JavaScript content will grow with its students. As you give your feedback I'm looking to turn your questions into more content about the JavaScript language! </p>\n\n\n\n<p>Since its release we have already doubled our content with more about JavaScript: objects, arrays, functions and regular expressions.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will expand weekly! Get it now and check back often for updates!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "JavaScript the Basics - JavaScript for Beginners", 
    "price": "20.00", 
    "instructors": "Robert Merrill", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/860812_f16e_13.jpg", 
    "course_url": "https://www.udemy.com/javascript-the-basics-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-26T18:24:53Z"
}