{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Nearly every interactive website you visit is using JavaScript.  It has become the the default coding language of the internet.  If you want to move beyond creating simple static web pages, it is essential to understand the basics of JavaScript. This course will teach you all the essentials of the JavaScript language. You will learn all about JavaScript variables, functions, conditionals and many more items.  You will also learn about how to use the DOM or Document Object Model.  When it comes to the JavaScript, nothing is more important than understanding the DOM if you want to understand how to use JavaScript effectively.  So we will spend several videos examining how JavaScript works with the DOM.</p><p>I firmly believe it is important to understand the core concepts to any language. And so, as always, I will stress concepts first and foremost.</p><p>In this JavaScript Beginners course, I will teach you all the main concepts of JavaScript.. Once you understand how to use JavaScript, it will be much easier for you to learn other scripting tools such as JQuery and Angular JS.  That is because the basic concepts to scripting languages are all very simialr.  This will put you on the road to creating highly interactive web pages that respond to users.  </p><p>Watch hours of engaging video lectures, and study all the code examples that will be provided. With this course, you will become fully competent in JavaScript!</p>", 
    "end_date": null, 
    "title": "JavaScript for Beginners", 
    "price": "20.00", 
    "instructors": "Ernest Jones", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786728_3682.jpg", 
    "course_url": "https://www.udemy.com/javascript-for-beginners-f/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-09T00:24:24Z"
}