{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Course is made exclusively on Udemy!!  </strong></p><p><strong>JavaScript is powerful, and the DOM really demonstrates this!</strong></p><p>Learn <strong>web development </strong>using<strong> JavaScript.</strong> JavaScript is an essential part of creating websites learn the building blocks of web development with JavaScript programming.  The DOM can be used to create interactive content for your web pages.</p><p><strong>Understanding the DOM is an excellent starting point for jQuery.</strong></p><p><strong>Learn the underlying technology to all of the JavaScript frameworks such as jQuery.</strong></p><p><strong>JavaScript for beginners to JavaScript advanced users, this course also includes lots of coding examples. This course will show you how to Master JavaScript, learning dynamic web design using JavaScript. JavaScript is a crucial part to become a Complete Web Developer</strong></p><p><strong>No wasted time, straight to the point teaching.   Our method of teaching is </strong></p><ul><li><strong>Course has over 31 Source files</strong></li><li><strong>Links to online code editor with file content</strong></li><li><strong>No wasted time watching someone type code</strong></li><li><strong>straight to the point cover all topics directly with examples</strong></li><li><strong>challenges within the course to test your knowledge of the topic</strong></li><li><strong>Quizzes</strong></li><li><strong>30 day money back guarantee</strong></li><li><strong>Downloadable PDF web developer resources FREE</strong></li></ul><p>1st -  VISUAL watch with explanations about the topic.2nd - TRY try the code yourself we provide all the source code used in the course.3rd - CHALLENGE we test you on what you have learned try to solve our challenges.4th -  VISUAL we show you how we solve the challenges.5th - Repeat as needed.</p><p>Knowing how it works from the ground up will help you learn JavaScript frameworks better. </p><p>This course is designed to cover core aspects of JavaScript and cover the<strong>  Document Object Model (DOM).</strong></p><p>JavaScript is Dynamic executed at run-time when the browser loads.  This allows JavaScript to create awesome interaction with the user.  If you want to build interactive web content you need to know JavaScript. </p><p>DOM is the API which JavaScript uses to interact with the objects on the webpage.  The DOM can be used to access and manipulate HTML content.  This course will focus on the JavaScript code that makes this happen.</p><p><strong>JavaScript for beginners</strong> to <strong>JavaScript advanced </strong>users, this course also includes lots of coding examples.  This course will show you how to<strong> Master JavaScript</strong>, learning <strong>dynamic web design using JavaScript</strong>.  JavaScript is a crucial part to become a <strong>Complete Web Developer.</strong>  Learn and<strong> master JavaScript from Scratch</strong>. Check out our other <strong>JavaScript courses</strong> to learn even more<strong> advanced JavaScript</strong> included with our of <strong>web developer </strong>courses.  <strong>Comprehensive JavaScript Programming</strong>, learn by making and working with examples.  Build dynamic websites with JavaScript.</p><ul><li>javascript web</li><li>javascript design</li><li>javascript complete</li><li>javascript for programmers</li><li>javascript tutorial</li><li>javascript basics</li></ul><p>This course is perfect whether you are an <strong>Absolute Beginner</strong>, who wants to learn about <strong>JavaScript Programming </strong>or whether you are a web developer who wants to learn more about <strong>JavaScript.</strong>   </p><strong></strong>", 
    "end_date": null, 
    "title": "JavaScript DOM Dynamic Web interactive content Boot Camp", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560990_dacc_3.jpg", 
    "course_url": "https://www.udemy.com/javascript-dom-dynamic-web-interactive-content-boot-camp/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T22:53:55Z"
}