{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p id=\"test\" style=\"\">  \t <strong style=\"\">JavaScript is the scripting language of the Web.</strong>  </p>  <p style=\"\">  \tIn a <strong style=\"\">prototyping language</strong> every object is an instance of a class. What that means is that objects can be defined and developed on the fly to suit a particular use, rather than having to build out specific classes to handle a specific need. This opens the door for very rapid and flexible development as well as a wide array of possible design patterns that would not be possible in more <strong style=\"\">structured languages</strong>. The ability to prototype also allows seamless extension of existing classes, even built in ones.  </p>  <p style=\"\">  \t<strong style=\"\">JavaScript</strong> is interpreted by the browser and over time (most) browsers have adapted to giving power users enough freedom to look under the hood and see or even change the JavaScript that&#039;s running behind your favorite sites. Pressing F12 on most browsers will open the <strong style=\"\">console</strong> which can let you talk directly to the JavaScript and explore it from a top down perspective. In addition to this, many talented developers have created their own publicly available and free tools that make working with JavaScript even <strong style=\"\">easier</strong>.  </p>  <p style=\"\">  \tUsing these tools makes it very easy to<strong style=\"\"> debug your JavaScript</strong> too. Any error you run into can be traced back to the exact place it occurred in the browser console or in FireBug. You can place breakpoints in the page code in order to debug the code using traditional methodologies, or simply unit test the bits in the console until the part that isn&#039;t working becomes happily apparent.  </p>  <p style=\"\">  \tWhile <strong style=\"\">JavaScript </strong>is probably not the first language that comes to mind when talking about O.O.P. (<strong style=\"\">object oriented programming</strong>), it is absolutely able to make use of Object Oriented Design Patterns and principles.  </p>  <p style=\"\">  \tJavaScript may have had humble beginnings, but has grown astronomically over the last decade in scope and application. It is fully supported by all modern browsers and works seamlessly with HTML/DHTML, CSS3 and background services via AJAX. Take a look at its growing popularity compared to other popular languages.  </p>  <p id=\"test\" style=\"\">  \t<strong style=\"\">Why this course?</strong>  </p>  <ul style=\"\">  \t <strong style=\"\">  \t<li style=\"\">Complete demonstration on specified concept</li>  \t<li style=\"\">Source Code is available for Download</li>  \t<li style=\"\">Lab Exercises</li>  \t<li style=\"\">Easy to understand</li>  \t</strong>  </ul>  <p style=\"\">  \t    Upon completion of this course, you&#039;ll be able to -  </p>  <ul style=\"\">  \t <strong style=\"\">  \t<li style=\"\">Write your own Web-Application for your website</li>  \t<li style=\"\">Code your own Objects </li>  \t<li style=\"\">Will have, In depth understanding of JavaScript code.</li>  \t</strong>  </ul>", 
    "end_date": null, 
    "title": "JavaScript - Start Developing Applications in 2 Hours.", 
    "price": "25.00", 
    "instructors": "Gautam Devaraj", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65238_a1fa_15.jpg", 
    "course_url": "https://www.udemy.com/javascript-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-13T06:50:53Z"
}