{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">*** Learn, Test, Practice and Implement JavaScript ***</strong><br></p>\n\n<p><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">*** Lots of JavaScript Examples, Quizzes, Exercises, Hands-On Practices and JavaScript Projects ***</strong><br></strong></p>\n\n<p>Just learning the concepts of a new programming language is not at all going to help you. After understanding the basics of a programming language, you should have the chance to <strong class=\"redactor-inline-converted\">test your understanding, code it yourself, practice it and finally apply your skills to develop real-world projects.</strong></p>\n\n<p>This course <strong class=\"redactor-inline-converted\">Practical JavaScript: JavaScript Basics</strong> helps you not only learn the basics of JavaScript, but also learn how to <strong class=\"redactor-inline-converted\">apply your JavaScript knowledge to come up with really unique web applications.</strong></p>\n\n<p>Unlike most of the other JavaScript courses available online, <strong class=\"redactor-inline-converted\">this course focuses more on practice.</strong> This course is structured in such a way that as a student, you get the maximum coding experience which will boost your confidence to write JavaScript code on your own.</p>\n\n<p>The whole course is structured in such a way that you get the chance not only to <strong class=\"redactor-inline-converted\">learn JavaScript concepts</strong>, but also to <strong class=\"redactor-inline-converted\">test your knowledge</strong>, <strong class=\"redactor-inline-converted\">practice what you have learned</strong> and <strong class=\"redactor-inline-converted\">implement applications</strong>.</p>\n\n<p>In the first section <strong class=\"redactor-inline-converted\">Learn JavaScript (<strong class=\"redactor-inline-converted\">JavaScript</strong> Basics)</strong>, you will learn the <strong class=\"redactor-inline-converted\">b</strong><strong class=\"redactor-inline-converted\">asics of JavaScript</strong> you need to know. This section follows a <strong class=\"redactor-inline-converted\">Problem-Solution approach</strong>. You will find the solution to a specific problem in each lecture. In this section, you will learn <strong class=\"redactor-inline-converted\">how to setup the JavaScript development environment, where and how to write your JavaScript code, how to use JavaScript variables and arrays to store data, how to use functions to make your code reusable, how to make decisions with conditional statements, how to repeat a task with loops and how to perform different operations.</strong></p>\n\n<p>Once you understand the basics, next is the <strong class=\"redactor-inline-converted\">Quiz time</strong>. You can <strong class=\"redactor-inline-converted\">test your understanding with a number of quizzes</strong> available in the <strong class=\"redactor-inline-converted\">Test Your Understanding (Quizzes)</strong> section.  If you get many wrong answers and also if there is anything you don't understand, please revisit the corresponding lecture in the JavaScript Basics section before proceeding to the Exercises section.</p>\n\n<p>Once you are thorough with the basics, proceed to the <strong class=\"redactor-inline-converted\">Code it Yourself (Exercises)</strong> section to try the exercises. <strong class=\"redactor-inline-converted\">A number of simple exercises are given that cover all the points explained in the JavaScript Basics section</strong>. Try each exercise on your own and once your are done, download the resource file and check whether your solution is correct.</p>\n\n<p>By completing these sections, you will be confident enough to write your own JavaScript code. So, it will be easy for you to practice JavaScript. The <strong class=\"redactor-inline-converted\">Practice JavaScript (Hands-On Practices)</strong> section offers a number of practices that you will find useful while programming. </p>\n\n<p>The last section is <strong class=\"redactor-inline-converted\">Let's Develop (JavaScript Projects)</strong>. You will <strong class=\"redactor-inline-converted\">develop</strong> a couple of <strong class=\"redactor-inline-converted\">real-world JavaScript projects from scratch. </strong>The projects available as of now are</p>\n\n<ol><li><strong class=\"redactor-inline-converted\">BMI Calculator</strong></li><li><strong class=\"redactor-inline-converted\">Country Trivia</strong></li><li><strong class=\"redactor-inline-converted\">Quote of the Day</strong></li><li><strong>Digital Clock</strong></li></ol>\n\n<p>As the section title says, this sections is going to boost your confidence to develop more JavaScript projects.</p>\n\n<p>This course <strong class=\"redactor-inline-converted\">will be updated frequently</strong> with more lectures, exercises, hands-on practices and JavaScript projects.</p>\n\n<p>So what are you waiting for? <strong class=\"redactor-inline-converted\">Join this 100% Practical JavaScript course and be a smart JavaScript developer.</strong></p>", 
    "end_date": null, 
    "title": "JavaScript Basics: Build 4 JavaScript Basic Projects", 
    "price": "20.00", 
    "instructors": "Crypters Infotech", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641236_a835_3.jpg", 
    "course_url": "https://www.udemy.com/practical-javascript-javascript-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T09:58:21Z"
}