{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Take your web design/development skills to the next level by learning Javascript!</strong></p><p>Javascript is one of the most in demand programming languages today. This course will take you from zero knowledge to confidently adding interactivity to websites and building standalone applications.</p><p>Javascript is here to stay, it is built into and runs in all the major browsers and is the default scripting language for the web. </p><p><em><strong>By learning Javascript you will have the power to add features and interactivity to websites, build large scale full stack applications and create games using one programming language!</strong></em></p><p>As you go through the course we will include many mini challenges to test what you have learned in the section. This is your chance to get writing code and reinforce what you have learned by building mini projects.</p><p>The goal of this course is to give you a good understanding of Javascript fundamentals, and equip you with the skills and confidence to move on and build your own creations.</p><p>By the end of the course you will have the skills and confidence to take on the full project where we will build a business card application.</p><p>Learning Javascript is essential for any web developer. Go ahead and take the next step and learn one of the most popular programming languages today!</p>", 
    "end_date": null, 
    "title": "Javascript: Gentle Introduction for Beginners", 
    "price": "20.00", 
    "instructors": "Chris Dixon", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692980_c597_3.jpg", 
    "course_url": "https://www.udemy.com/javascript-introduction-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T13:31:44Z"
}