{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Que tal você aprender  a criar sistemas completos desde o login até os cadastros, consultas e relatórios ?? São 156 Vídeo aulas de programação java para web. Aprenda a criar páginas para web usando o tomcat. Veja como integrar codigos java (jsp) com html. Veja como manipular um banco de dados (postgreSQL) com jsp. </p><p>Veja alguns itens que você vai aprender:</p><ul><li>Baixar e instalar  o TomCat</li><li>Usar  servidor Apache Tomcat</li><li>Trabalhar com o banco de dados postgresql</li><li>Introduzir ao HTML e suas principais tags</li><li>Conhecer o JSP</li><li>Criar tela login jsp</li><li>Carregar o driver jdbc orgpostgresqlDriver</li><li>Criar a Página Principal jsp com Frames</li><li>Criar formulários completos de CRUD (alterar, excluir, pesquisar, inserir)</li><li>Visualizando e imprimindo dados</li></ul><p>Esse curso é a porta de abertura para todos aqueles que querem entrar para o fantástico mundo de desenvolvimento web. Mesmo que você não conheça HTML, JavaScript e CSS, não tem problema, pois esse curso da uma introdução nesse conteúdo também.</p><p>Depois é mostrado o JSP e como integrar ele com as tags HTML. E um sistema web precisa interagir com banco de dados, é aí que entra o PostgreSQL. Você verã como criar uma tela de login, criar um menu principal que irá chamar os demais formulários de cadastros. Você vai gostar desse curso. E não esquecendo que depois desse curso vem o Java para web II, III e IV. </p>", 
    "end_date": null, 
    "title": "Java para Web I - html, jsp, tomcat, postgresql", 
    "price": "30.00", 
    "instructors": "Neri Neitzke", 
    "commitment": "18.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606434_187c.jpg", 
    "course_url": "https://www.udemy.com/java-para-web-i-html-jsp-tomcat-postgresql/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T23:37:03Z"
}