{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t                            Javascript is the language that modern developers need to know, and know well. Truly knowing Javascript will get you a job, and enable you to build quality web and server applications.  </p>  <p>  \t<em style=\"\">NOTE: This course includes information on ECMAScript 6 (ES6) the next version of Javascript!</em>  </p>  <p>  \t                              In this course you will gain a deep understanding of Javascript, <strong style=\"\">learn how Javascript works under the hood</strong>, and how that knowledge helps you avoid common pitfalls and <em style=\"\"><strong style=\"\">drastically improve your ability to debug problems</strong></em>. You will find clarity in the parts that others, even experienced coders, may find weird, odd, and at times incomprehensible. You&#039;ll learn the beauty and deceptive power of this language that is at the forefront of modern software development today.  </p>  <p>  \t                              This course will cover such advanced concepts as <strong style=\"\">objects and object literals, function expressions, prototypical inheritance, functional programming, scope chains, function constructors (plus new ES6 features), immediately invoked function expressions (IIFEs), call, apply, bind, and more</strong>.</p>  <p>We&#039;ll take <strong style=\"\">a deep dive into the source code of popular frameworks</strong> such as jQuery and Underscore to see how you can use your understanding of Javascript to learn (and borrow) from other&#039;s good code.  </p><p>Finally, you&#039;ll learn the foundations of how to <strong style=\"\">build your own Javascript framework or library</strong>.<br style=\"\"></p><p>What you&#039;ll learn in this course will <strong style=\"\">make you a better Javascript developer, and improve your abilities in AngularJS, NodeJS, jQuery, React, Ember, MongoDB, and all other Javascript-based technologies!</strong></p><p>Learn to love Javascript, and code in it well.</p>  <p>  \t<em style=\"\">Note: In this course you&#039;ll also get downloadable source code. You will often be provided with &#039;starter&#039; code, giving you the base for you to start writing your code, and &#039;finished&#039; code to compare your code to.</em>  </p>", 
    "end_date": null, 
    "title": "JavaScript: Understanding the Weird Parts", 
    "price": "35.00", 
    "instructors": "Anthony Alicea", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364426_2991_5.jpg", 
    "course_url": "https://www.udemy.com/understand-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-06T03:59:18Z"
}