{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "  <p>  \t                   Starting today you can create your own website using Joomla with absolutely <strong>no experience whatsoever</strong>.  </p>  <p>  \t                   In this course <strong>I \"take you by the hand\" and \"behind the scenes\"</strong> to show you exactly how everything in Joomla works. No fancy terminology or complex methods used here. Just exactly what you need to know to set-up a fully functioning website.  </p>  <p>  \t                   This course does not teach you any code and we don't even look at any code because it is not needed to create a fully functional website with all the features you are looking for.  </p>    <p>  \t<strong>IMPORTANT #1:</strong>  </p>  <p>  \t                   This course does NOT teach you any code and we don't even look at any code because it is not needed to create a fully functional website with all the features you are looking for.  </p>    <p>  \t<strong>IMPORTANT #2:</strong>  </p>  <p>  \t                   I am confident you will be able to create a website using Joomla without any experience or any coding. <strong>I promise you can succeed </strong>with this if you follow each of the lessons I have created for you.  </p>  <p>I make myself available so you will have access to me if you have questions or need feedback along the way. You're not in this alone!  </p>    <p>  \t<strong>WHAT YOU'LL GAIN FROM TAKING THIS COURSE:</strong>  </p>  <ul>  \t<li><strong>Keep thousands of $$ in your pocket</strong> by setting up your own site</li>  \t<li><strong>Save time</strong> by learning everything you need to know about Joomla without having to spend countless hours learning how to code.</li>  \t<li>Learn how to add new functionality to your website and <strong>forget paying someone else</strong> to do it for you.</li>  \t<li><strong>Save time</strong> by managing updates yourself and not having to wait on a developer to do it for you.</li>  \t<li><strong>Start earning money tomorrow</strong> by creating Joomla websites for clients.</li>  \t<li>Contact with the instructor who is always around for questions and feedback.</li>  </ul>    <p>  \t<strong>DON'T LOSE ANY MORE TIME OR MONEY...ENROLL NOW</strong>  </p>  <p>  \t                   Every moment you delay is <strong>c</strong><strong>osting you in time and money.</strong> Get your website online today and be ready for business tomorrow!  </p>", 
    "end_date": null, 
    "title": "Joomla: Create a Joomla Website This Weekend With NO CODING!", 
    "price": 0, 
    "instructors": "Christine Maisel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297390_4d2e_4.jpg", 
    "course_url": "https://www.udemy.com/joomla-create-a-joomla-website-this-weekend-with-no-coding/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T22:30:18Z"
}