{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>NEW course Nov. 2015!</strong></p><p> jQuery is an incredibly powerful JavaScript Library that is used on MILLIONS of website.  It makes DOM access, EVENTS and AJAX easier to access.   With just a few lines of code <strong>JQuery can transform your website added amazing dynamic effects and interactive content.</strong><br></p><p><strong>Write less, do more</strong><strong>.</strong><span><strong> </strong>This step by step course shows you the code you need to know to accomplish <strong>rapid web development with jQuery.</strong><br></span></p><p>Learn Step by Step how to code using jquery. We cover all the core fundamental concepts of jquery that you need to know in order to effectively use jquery on your websites.</p><p>Learn about these JQuery code concepts and much more.....<br></p><ul><li>Setup jquery</li><li>Coding jQuery</li><li>jQuery Selectors</li><li>jQuery Events</li><li>jQuery Attributes and CSS</li><li>jQuery Manipulation</li><li>jQuery Traversing</li><li>jQuery Effects</li><li>jQuery AJAX</li></ul><p>Learn  jQuery with our Step by Step training, we show you how to create dynamic interaction on your web pages. Learn to use  jQuery to create better user interaction experiences on web pages. Understand the structure of  jQuery code and how to apply it. Learn at your own pace resources are included, source code and everything you need to practice and learn  jQuery. We show you useful examples of  jQuery Code snippets and explain the development process.</p><ul><li><strong>DOM manipulation</strong> </li><li><strong>Event handling</strong></li><li><strong>Animations</strong></li><li><strong>AJAX technology</strong><strong></strong></li></ul><p>Knowing how to apply jQuery is an excellent skill to have.  jQuery is everywhere and by the end of this course you will have what you need to use it on your own webpages.<br></p><p>We walk you through step by step with detailed explanations of code and more. We add and update a webpage from scratch adding  jQuery to bring it to life.</p><ul><li>practice with coding exercises</li><li>quick lessons get right to the point</li><li>fully covered topics with real world examples</li><li>source files downloadable to work along</li><li>challenges and lessons and code samples</li><li>code snippets</li><li>Links to top resources to save time</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li><li>quick response support to students</li><li>regular discussions</li></ul><p>We teach you the latest techniques and tools to use in order to create amazing web content. Everything you need to know is included in this course. Learn at your own pace, lifetime access to this course.</p><p>We show you how to write  jQuery code, easy to learn. Our tutorials are easy to follow and effective in teaching  jQuery.</p>", 
    "end_date": null, 
    "title": "JQuery Essentials core training for Dynamic Interactive web", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669270_2dec_3.jpg", 
    "course_url": "https://www.udemy.com/jquery-essentials-core-training-for-dynamic-interactive-web/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T03:00:21Z"
}