{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  Learn the essentials you&#039;ll need to get started with jQuery, the most popular JavaScript library in use today.  </p>  <p style=\"\">  \t  During this two-hour crash course, your instructor will introduce you to the basics of the jQuery syntax.  </p>  <p style=\"\">  \t  Learn about jQuery selectors, one of the most important parts of the jQuery library, and how to manipulate the Document Object Model (DOM). Discover how jQuery events can be used to register behaviors that take effect when the user interacts with the web browser.  </p>  <p style=\"\">  \t  You will also learn how to use jQuery to traverse and filter the DOM, which is used to help find HTML elements.  </p>  <p style=\"\">  \t  Learn advanced topics, including how to capture mouse events using the jQuery UI framework and some of the popular jQuery plugins used to extend the power of jQuery.  </p>  <p style=\"\">  \t  By the end of this course, you will be confident in your knowledge of the fundamentals needed to effectively use jQuery.  </p>  <p style=\"\">  \t<strong style=\"\">This course includes:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Demo files</li>  \t<li style=\"\">An optional quiz to test what you&#039;ve learned</li>  \t<li style=\"\">Certificate of completion</li></ul><p style=\"\">All of our videos are high-definition videos, therefore, they are <strong style=\"\">best viewed with the HD setting on</strong>, and the videos enlarged.</p><ul style=\"\">  \t  </ul>", 
    "end_date": null, 
    "title": "jQuery Crash Course: Learn the Essentials of jQuery Fast", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/379722_2736_3.jpg", 
    "course_url": "https://www.udemy.com/learn-jquery-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T05:55:04Z"
}