{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>COURSE UP TO DATE AS OF MARCH 2016.....</strong></p>\n\n<p><strong>ADD NICE FEATURES TO WEBSITES OR APPS EASILY......</strong></p>\n\n<p><strong>Over 1,100 Students taking this course already.........</strong></p>\n\n<p><strong>This jQuery for beginner's tutorial or course</strong> will teach you what jQuery is and how to start using it to create animations and advance features for your websites or applications.</p>\n\n<p><strong>jQuery is all around u</strong><strong>s</strong>, everywhere you see a slider, photo gallery, navigation menu, special effects, pop up boxes with photos or videos with plugins like lightbox or prettyphoto or anywhere you see nice animations on any website, jQuery its there.</p>\n\n<p><strong>Do you need jQuery?</strong> If you want to add the best awesome Javascript features and animations to sites or apps without the complicated code then YES.</p>\n\n<p>If you are new to web development and don't know Javascript or have very little knowledge then this jQuery tutorial / course is for you.</p>\n\n<p><strong>Here is what my students think about me and my courses......</strong></p>\n\n<p><em>Fantastic cource once again!!</em></p>\n\n<p>Edwin you are the best teacher, thank you so much!! Guys don't think just enroll to this course and you will love it like i do! I cant wait for more courses on PHP from you my best teacher.</p>\n\n<p><em>Best course I've taken on Udemy!!</em></p>\n\n<p>I'm an absolute beginner in Javascript. I had started other courses on Udemy but got lost early on due to the instructor not being able to clearly explain what they're teaching. As a result I became discouraged thinking I just don't get Javascript. Well I have just completed this course (the first course I've actually seen through to the end) and I feel a lot more confident now. The teacher (Edwin) is what makes this course enjoyable. He explains the content so clearly and gives good simple examples, which we then build upon as the course progresses. His encouraging, cheerful and down-to-earth approach make for the perfect learning environment. He also responded to my questions very quickly. I can't recommend this course highly enough!! It's perfect for the beginner to build a good solid foundation to then move onto move advanced courses. **Take this course you won't be disappointed** :)</p>\n\n<p><em>Excellent Class</em></p>\n\n<p>This class provides a very good introduction to the basic concepts and building blocks of javascript.</p>\n\n<p>The instructor, Edwin, is very engaging and enthusiastic about the subject which makes the class very enjoyable.</p>\n\n<p>I would highly recommend this class for anyone just stating out in javascript.</p>\n\n<p><em>It's magic</em></p>\n\n<p>Hi , I finished this tutorial successfully . The way of teaching was really good and understandable . The main plus point of this course is the syllabus . Yo have focused on very important topics for a beginner so it will be easy for him to jump to advance level easily with little bit of practice . thank you</p>\n\n<p><strong>My Promise</strong></p>\n\n<p>I will do my best to teach you jQuery and to answer your questions promptly.</p>\n\n<p>If you spend anything on this jQuery Course Tutorial, your money will be multiplied over and over again.</p>\n\n<p>jQuery helps make website and apps alive with all the animations and advance features with simplicity. This course will help set you apart from the rest of designers and developers that don't know jQuery.</p>\n\n<p><strong>100% Money Back if you don't like it</strong></p>\n\n<p><strong>Don't like this jQuery Course?</strong> If for some reason you don't like the course within 30 days, Udemy will return your money and no hard feelings from me.</p>\n\n<p><strong>Are you still reading? What are you waiting for? Join now and learn jQuery the easy way.</strong></p>", 
    "end_date": null, 
    "title": "jQuery for Beginners - Create Website Animations Easily ", 
    "price": "20.00", 
    "instructors": "Edwin Diaz", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452684_61fb_3.jpg", 
    "course_url": "https://www.udemy.com/jquery-for-beginners-fundamentals-training-tutorial-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T23:43:54Z"
}