{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  jQuery UI training is made easy in this video, with step-by-step  examples, useful tips, and quick tricks. This course breaks down complex  tasks into bite-sized chunks, making it the best resource for you to  use if you want to start using jQuery UI. Learn how to save hundreds of  hours in development using jQuery UI&#039;s awesome components.  </p>  <p style=\"\">  \t  Even in the HTML 5 world of today, there are many oft used components  and functionalities that still aren&#039;t part of a browser out of the box;  this library is the critical solution, which will save you hundreds of  hours while building highly sophisticated components for your  applications. We&#039;ll cover the basics, and then build our first component  – the datePicker - and we&#039;ll customize its characteristics. We&#039;ll  discuss the ThemeRoller application for quickly skinning components, and  the dialog component in all its detail. You&#039;ll also learn how to  discover component features on your own, how to listen in on variables  and changes, as well as how to trigger and listen to events. We&#039;ll then  kick it up a notch with jQuery UI&#039;s drag-and-drop capabilities and build  a working example that uses all of these features. We&#039;ll use components  effectively, examine event properties in detail, and even clean up our  code to make it more presentable. We&#039;ll wrap up by demonstrating as many  of jQuery UI&#039;s essential and popular components as we can, followed by a  brief course recap and summary.  </p>  <p style=\"\">  </p>  <h4><strong style=\"\">About the Author</strong></h4>  <p>  \t<strong style=\"\">Ben Fhala</strong> discovered his passion for data visualization six  years ago while he was working at Parsons in New York, in their data  visualization department, PIIM. He is the owner of the online video  training school, and an Adobe ACP. He enjoys spending most  of his time learning and teaching and has a love for visual programming  and visualization in general. Ben has had the honor of developing  applications for members of the US Congress, Prime Ministers, and  Presidents around the world.  </p>  <p style=\"\">  \t  He has built many interactive experiences for companies such as  Target, AT&amp;T, Crayola, Marriott, Neutrogena, and Nokia. He has  technically directed many award-winning projects and has been part of  teams that have won three Agency of the Year awards. Among Ben&#039;s  publications are Packt’s HTML5 Graphing and Data Visualization Cookbook.  </p>", 
    "end_date": null, 
    "title": "jQuery UI Development ", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392864_4008_4.jpg", 
    "course_url": "https://www.udemy.com/jquery-ui-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T09:44:40Z"
}