{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Aprende a crear juegos móviles similares al famoso y galardonado Plants vs Zombies, desde cero y con las tecnologías que ya conoces: HTML, CSS y JavaScript.</strong>  </p>  <p>  \tEn este curso desarrollaremos un juego llamado <strong style=\"\">Veggies vs Zombies</strong>, similar al conocido Plants vs Zombies. Defiende tu hogar de los zombies utilizando divertidas plantas con distintos poderes.  </p>  <p>  \tEn el curso utilizaremos la librería HTML5 Quintus, la cual permite crear juegos 2D para todas las plataformas. Lo mejor de desarrollar juegos con HTML5 es que los únicos requerimientos de software son un navegador, un editor de código y un localhost.  </p>  <p>  \tTemáticas cubiertas en el curso:  </p>  <ul style=\"\">  \t<li>Intro al mundo de los juegos en HTML5.</li>  \t<li>Crear juegos que se ajustan a la resolución de la pantalla del dispositivo.</li>  \t<li>Escenas, escenarios, sprites.</li>  \t<li>Conceptos de juegos 2D como detección de colisiones y física.</li>  \t<li>Cómo cargar niveles desde archivos JSON.</li>  \t<li>Juegos multi-niveles.</li>  \t<li>Los juegos con sonido son memorables.</li>  \t<li>Cómo combinar todos los elementos para crear un demo sencillo y a la vez muy adictivo!</li>  </ul>  <p>  \tEl autor del curso es <strong style=\"\">Pablo Farías Navarro</strong>, desarrollador y emprendedor de Chile. Founder de <strong style=\"\">ZENVA</strong> y creador de una veintena de cursos online, Pablo se especializa en el desarrollo web y móvil con <strong style=\"\">HTML5</strong>. Pablo es además el creador de los blogs de tecnología <strong style=\"\">GameDev Academy</strong>, <strong style=\"\">HTML5 Hive</strong> y <strong style=\"\">De Idea A App</strong>.  </p>", 
    "end_date": null, 
    "title": "Juegos Móviles con HTML5 - Veggies vs Zombies", 
    "price": "20.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/205722_4bf5_2.jpg", 
    "course_url": "https://www.udemy.com/juegos-html5/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-26T23:58:00Z"
}