{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p></p><p><strong><strong></strong></strong></p><div><div><div><div><div><div><h5><p><strong><em>Reading for parents</em></strong></p></h5><p>Do your kids spend too much time on the computer, phone or tablet? Don&#039;t you wish they could do something more productive? Why not get them to learn a life long valuable skill that will lead them into a career that pays 2 times the national average?</p><p>Programming is the new math. T<em>he average computer programmer makes&nbsp;</em><strong><em>78k a year&nbsp;</em></strong>and there will always be a need for programmers. The only problem is that all of the educational courses are not tailored towards the learning styles of children. Most of the documentation is geared towards people over 18.&nbsp;</p><p>This course shows kids how to code by adapting the material to their learning styles. There are animated lectures, informative screencasts and tests.&nbsp;</p><p>This course is not only fun for kids to watch and listen, it is interactive and fun. More and more people are learning to code so do you want your kids to not have the same opportunities as others? This course offers your kids a competitive advantage.&nbsp;</p><p>Employers look for technical skills and applicants that can code are more attractive to hire. Even if the job isn&#039;t technical it always helps to have that technical&nbsp;knowledge&nbsp;to communicate with the technical team. Personally, I like to hire people with programming skills. If they are artists, video editors, or social media marketers, I generally prefer to hire people with programming experience.&nbsp;</p><p><strong>About me, the instructor</strong></p><p>My name is John Bura and I have run the software company Mammoth Interactive. We have had a ton of sales on our software which includes XBOX 360, iPad and iPhone games. On top of this I have been teaching people full time since I was 17. With the combination of teaching experience and real world experience, I have a&nbsp;truly&nbsp;unique experience that you can&#039;t find anywhere else. The&nbsp;knowledge&nbsp;I give out is from first hand&nbsp;knowledge&nbsp;of the industry and years of teaching experience.&nbsp;</p><p>Thank you for considering to purchase my course. Even if you choose to not buy it I wish you and your family a happy road to success.&nbsp;</p></div></div></div></div></div></div>", 
    "end_date": null, 
    "title": "Kids Coding - Beginner HTML", 
    "price": "20.00", 
    "instructors": "John Bura", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65492_33e5_5.jpg", 
    "course_url": "https://www.udemy.com/kids-coding-beginner-html/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-15T03:04:31Z"
}