{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>Not: Grup(3,4,5,... kişilik) halindeki alımlara özel indirimimiz vardır. Bunun dışında özel indirim talebinde bulunmak isteyenler ( Maddi durum, Öğrenci, Ödeme Sorunu vs. durumdakiler) veya kredi kartı ile ödeme sorunu olanlar <em>ercanayhan@outlook.com </em>adresinden mail ile veya udemy üzerinden mesaj ile </strong><strong>bana ulaşabilirler. </strong><strong>_____________________________________________________________________________</strong><br><strong></strong></p>\n\n<p><strong></strong>Başarılı kariyer yapmak mı istiyorsunuz? Yazılım ile para kazanmak mı istiyorsunuz? ya da Web geliştirici nasıl olunur diye merak mı ediyorsunuz?</p>\n\n<p>Şuan doğru yere geldiniz ve bu komple web geliştirici kursu geliştirici olma yolunda sizin motivasyonunuzu arttıracaktır. </p>\n\n<p>Komple web geliştirici kursu internet üzerinde araştırma yaparsanız; <strong>T</strong><strong>ürkiye'de internet üzerinden geliştirici olmayı sağlayan ilk kurs</strong> olduğunu, <strong>kaynak olarak en sade</strong> ve <strong>detaylı kurs </strong>olduğunu, <strong>kurumsal şirket veya özel sektörde karşılaşacağınız mimari yapıyı anlatan kurs</strong> olduğunu görmüş olacaksınız.</p>\n\n<p>Komple web geliştirici kursu, adım adım web geliştirici olmak için ince elenip sık dokunan konular ile 8 hafta içinde sizin web geliştirici olmanızı hedefler.<strong></strong></p>\n\n<p>Kurs bitiminde ekmek kazanacağınız bir meslek edinmiş olacak, hem ön yüz geliştirici(<strong>Front-end</strong>), hem de arka yüz geliştirici(<strong>Back-end</strong>) olabileceksiniz. </p>\n\n<p>Özenle hazırlanmış Komple web geliştirici kursunda; <strong><em>Ercan Ayhan</em> </strong>olarak Y<em>azılım Uzmanlığı</em> ve <em>Yazılım Takım Liderliği</em> yapana kadar geçtiğim adımlara dayanarak hazırladığım bu kursta <strong>toplamda 120 sayfa ön hazırlık sunumu</strong>, <strong>79 test sorusu</strong>, <strong>Asp Net Mvc ve JavaScript ile Galeri uygulamas</strong><strong>ı</strong>, <strong>Kurumsal mimari kullanarak Asp Net Mvc ve JavaScript ile yapılmış proje</strong> <strong>ve kaynak kodlar </strong>ve yapılmış diğer  web site tasarımları ile uygulamalar ile geliştirici olmanızı sağlamayı bu kursun temel hedefi olarak planladım.</p>\n\n<p>Hızlı ve eğlenceli olarak, kimin zaman hatalar ile boğuşacağımız, kimi zaman çileden çıkacağımız ya da bilgisayarı parçalamak isteyeceğimizin geleceği günlerden web geliştirici olacağınız günlere kadar geçen zamanda mutlu sonla geliştirici olmanızı hedefliyoruz.</p>\n\n<p>Kendinize güveniyorsanız, yazılım geliştirmeyi bir paraya dönüştürmek istiyorsanız komple web geliştirici kursu ile web geliştirici olmaya hazır mısınız ?</p>\n\n<p>Sizin <strong>ne pahalı kitaplar almanıza</strong> gerek var, <strong>ne pahalı eğitimlere kayıt olmanıza </strong>gerek var, <strong>ne youtube üzerinde karman çorman eğitim aramanıza</strong> gerek var. Bir Web Geliştiricisi ya da yazılım geliştiricisi olmak için her şey Komple Web geliştirici kursunda anlatılmaktadır ve size destek olmak için buradayız.</p>\n\n<p>Kurs ile birlikte her türlü sorularınızı anlamadığınız konuları eğitim aldığınız sayfamız üzerinden sorabilir, direk olarak bize danışabilirsiniz.</p>\n\n<p><strong>Kaç yaşında olduğunuzun</strong>, <strong>hangi bölümü okuduğunuzun</strong>, <strong>ne mezunu olduğunuzun yada olmadığınızın</strong> <strong><em>bir önemi yoktur</em></strong>. Şirketler iş yapan eleman ister.</p>\n\n<p>Hayatınızı değiştirmek istiyorsanız Komple Web Geliştirici kursunu almanız yeterli.</p>\n\n<p>Komple Web Geliştirici Kursu ile <strong>Alabileceğiniz Unvanlar</strong>;</p>\n\n<ul><li><strong>Web Geliştirici</strong></li><li><strong>Yazılım Uzmanı</strong></li><li><strong>Yazılım Geliştirici</strong></li><li><strong>.Net Yazılım Uzmanı</strong></li><li><strong>Asp .Net Geliştirici</strong></li></ul>", 
    "end_date": null, 
    "title": "Komple Web Geliştirici Kursu : Front-end ve Back-end Kodlama", 
    "price": "50.00", 
    "instructors": "Ercan Ayhan", 
    "commitment": "47.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528818_7ce9_2.jpg", 
    "course_url": "https://www.udemy.com/komple-web-gelistirici-kursu/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T18:32:59Z"
}