{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Testimonials</strong></p><em style=\"\"></em><p style=\"\">This course is based on the bestselling book &quot;OAuth 2.0: Getting Started in Web-API Security&quot;. Before I tell you what is presented in the course, just read, what the audience thinks about the book.</p><p style=\"\"><em style=\"\">Excellent review of the underlying components of OAuth, and the methods of deploying and using it. Love the sequence diagrams. The explanations of the differences between the pattern use cases is most helpful.</em></p><p style=\"\">***** 5 Stars by A. on April 22, 2015</p><em style=\"\"><span style=\"\"></span></em><p style=\"\"><em style=\"\"></em>Great Book: <em style=\"\">A clear explanation of OAuth and its authentication flows. It provided great descriptions of the OpenId Connect and SAML2 extensions.</em></p><p style=\"\">***** 5 Stars by Donald E. L. on March 2, 2015</p><em style=\"\"><span style=\"\"></span></em><p style=\"\"><em style=\"\">Brief explanation of OAuth but clear and straightforward.</em></p><p style=\"\">***** 5 Stars by G. S. on February 12, 2015</p><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Updates</strong></p><p style=\"\"><strong style=\"\">2015-07-30</strong> Added Lecture on OAuth with Paypal</p><p style=\"\"><strong style=\"\">2015-07-28</strong> Added Lecture on OAuth with Google and LinkedIn</p><p style=\"\"><strong style=\"\">2015-07-25</strong> Added Lecture on OAuth with Facebook</p><p style=\"\"></p><p style=\"\"><strong style=\"\">This course is for you...</strong></p><p style=\"\">if you want to improve your market value as a Software Engineer and Security Expert. Imagine what could happen to your professional career if you could add API Security and OAuth skills to your CV!  </p>  <p style=\"\">  \tAPI Security experts and engineers who understand OAuth are in HIGH DEMAND, as companies expand their digital business. Plenty of opportunities are waiting for anyone who has the right skills.</p><p style=\"\"><strong style=\"\">Do you want to write best-selling iPhone and Android apps?</strong></p><p style=\"\">The most popular mobile apps integrate with popular social APIs of Google, LinkedIn, Facebook, Paypal and many more. If this is a well known fact, why do app developers not just do it? </p><p style=\"\">Many app developers are afraid of complicated OAuth integrations. Security is in fact the biggest hurdle for most mobile app developers. </p><p style=\"\">With the knowledge gained in this course you can use the secret of best app developers out there and finally integrate your app with social APIs.</p>  <p style=\"\">  \t<strong style=\"\">Do you want to start out on your own, as an entrepreneur, consultant or freelancer? </strong>  </p>  <p style=\"\">  \tKnowing API Security and OAuth allows you to realize the big vision  of your company in the field of mobile apps, cloud apps and web APIs, such as Google, Paypal and LinkedIn.</p>  <p style=\"\">  \t<strong style=\"\">Do you want to build exciting solutions with the next generation technology?</strong>  </p>  <p style=\"\">  \tWhether you are a web developer, mobile developer or API developer, an architect or embedded developer for the Internet of Things, today you need to know OAuth to build state of the art solutions.</p>  <p style=\"\">  \t<strong style=\"\">What does this course offer?</strong></p><p style=\"\">This course offers an introduction to API Security with OAuth 2.0. In 3 hours you will gain an overview of the capabilities of OAuth. You will learn the core concepts of OAuth. You will get to know all 4 OAuth flows that are used in cloud solutions and mobile apps.</p><p style=\"\">If you have tried to read the official OAuth specification, you may get the impression that OAuth is complex. This course explains OAuth in simple terms. The four OAuth flows are visualized graphically using sequence diagrams. The diagrams are then animated so you get to know the interactions step by step and see the big picture of the various OAuth interactions. This high-level overview is complemented with rich set of example requests and responses and an explanation of the technical details.</p><p style=\"\"><strong style=\"\">Who should take this course?</strong></p><p style=\"\">You believe OAuth is complicated? OAuth may seem complex with flows and redirects going back and forth. This course will give you clarity by introducing the seemingly complicated material by many illustrations. These illustrations clearly show all the involved interaction parties and the messages they exchange.</p><p style=\"\">You want to learn the OAuth concepts efficiently? This course uses many animated diagrams and sequence diagrams. A good diagram says more than 1000 words.</p><p style=\"\">You want to use OAuth in your mobile app? If you want to access resources that are protected by OAuth, you need to get a token first, before you can access the resource. For this, you need to understand the OAuth flows and the dependencies between the steps of the flows.</p><p style=\"\">You want to use OAuth to protect your APIs? OAuth is perfectly suited to protect your APIs. You can learn which OAuth endpoints need to be provided and which checks need to be made within the protected APIs.</p>", 
    "end_date": null, 
    "title": "Learn OAuth 2.0 - Get started as an API Security Expert", 
    "price": "35.00", 
    "instructors": "Matthias Biehl", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380582_0396_6.jpg", 
    "course_url": "https://www.udemy.com/learn-oauth-2/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-30T04:26:52Z"
}