{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Ajax is a web technology that used to do stuff without page refresh like you see on Facebook or many other websites. This course is about creating a very interactive sign up system using JQuery with ajax and PHP.</p><p>We will start by first setting up the development environment and then creating the structure of our sign up system. Then we will Connect JQuery library with our Application and create some external files and then we will start the main part and that is the validation of our sign up system. After validation we will simply insert all the values in our database using ajax post request.</p><p>After the huge success of my first Ajax course I decided to create some more ajax courses, This is the second Ajax course and after this more are coming. Following is what students are saying about my first Ajax course.</p><p>\"Content is comprehensive enough for beginners. Easy to understand explanation. Clears basic concepts of Ajax.\"  <strong>-</strong> <strong>Sanket Kulkarni</strong></p><p><strong></strong><span>\"Great course, highly recommended, well explanation.<span>\"<strong> - Nguyen Dinh Luan</strong><strong></strong></span></span></p><p>And you can see more feedback by the happy students if you want by going to my first Ajax Course. I hope you will definitely enjoy this course. Looking forward to see you in the course. Thanks </p>", 
    "end_date": null, 
    "title": "Learn to create sign up system using JQuery, Ajax and PHP", 
    "price": "20.00", 
    "instructors": "Usman Raoof", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761768_3786_3.jpg", 
    "course_url": "https://www.udemy.com/create-sign-up-system-using-jquery-ajax-and-php/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T21:38:53Z"
}