{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Hey there, welcome to <strong>learn css and css 3 from scratch</strong>. We understand that looks in <strong>web development</strong> matters a lot. If you need to impress a user, a web page should look awesome and then only user might test the functionality of that website. </p>\n\n\n\n<p>If you want to make your webpage look awesome, <strong>CSS</strong> is one stop that you need to make for sure. CSS or <strong>cascading style sheet</strong> allows you to modify the content of web page and makes sure that everything looks elegant, clean and sharp on every device. It might be your <strong>mobile phones, tablets or big desktop screens</strong>. </p>\n\n\n\n<p>Usually courses like to take CSS just casually and teach them as a side bar with HTML. But this is not the case with this course. We are taking CSS very seriously and hence a dedicated <strong>6-hour content</strong>, which will grow in future.</p>\n\n\n\n<p>We will start the course by installing proper tools require to write faster CSS. Then we will give you exercise files and each exercise file will help you to understand a new concept. We will take <strong>backgrounds, colors, ID’s and Classes, Box models along with text properties. </strong>Further we will explore <strong>Selectors</strong> in depth so that you can edit any template easily. Further we will move towards, <strong>CSS 3</strong> and look at <strong>2-D and 3-D transformations</strong> of objects. We will cover the responsive designs and media queries. And finally we will refer some books and online resource to learn in future.</p>\n\n\n\n<p>Want to upgrade your <strong>web development skills</strong> or want to design a website that looks great on different devices; this course has got all covered.  We have done great <strong>research</strong> to make sure that content is in full sequence so that students learns and also completes the course. You won’t feel bore in the course, that our guarantee. </p>\n\n\n\n<p> <strong>So, enough of talking and lets launch an editor and write some great CSS code. Join the course and see you inside.</strong></p>", 
    "end_date": null, 
    "title": "Learn CSS and CSS 3 from scratch", 
    "price": "50.00", 
    "instructors": "Igneus Technologies", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780742_c385_4.jpg", 
    "course_url": "https://www.udemy.com/learn-css-and-css-3-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-03T04:49:15Z"
}