{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t This course is aimed towards complete beginners who want to set up their own website. If you are a complete newbie then you have come to the right place. This is the first basic course you can do to get started with your website. This course starts with a quick refresher on the website components and then quickly help you understand the concepts behind all the technicalities.  </p>  <p>  \t After this course you will be able to get a web hosting space and domain name for your self and will be able to run you website with any help. You will learn all about email set up, cpanel and FTP. You will also get a quick little course on HTML and CSS.  </p>  <p>  \t This course will also teach you how to set up your WordPress website or Blog. You will learn to set up Joomla and Magneto eCommerce websites. All in all this course will provide you all the tools and techniques you will need to get started on the web.  </p>  <p>  \t Course Highlights  </p>  <ul>  \t<li>Detail discussion on all aspects of website setup and management</li>  \t<li>Does not assume any programming knowledge</li>  \t<li>Covers WordPress, Joomla and Magneto</li>  \t<li>Learn all about web hosting and Domain name system</li>  \t<li>Be a complete Webmaster in just 3 hours </li>  </ul>  <p>  \t Get yourself a live website with this quick and easy course.  </p>", 
    "end_date": null, 
    "title": "Learn to Setup Websites from Scratch", 
    "price": 0, 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/197828_4f33_4.jpg", 
    "course_url": "https://www.udemy.com/learn-to-setup-websites-from-scratch/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-12T06:56:16Z"
}