{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">PHP is an object oriented general purpose language suitable for a wide variety of tasks. In this course, we&#039;ll learn how to use PHP as a server-side scripting language for use in web development.</p><p style=\"\"><strong style=\"\">The course consists of four units:</strong> </p><p style=\"\"><strong style=\"\">Unit 1:  </strong>covers basic syntax, variables, and language features such as loops and decision constructs. We&#039;ll also learn how to download and install PHP as a part of the XAMPP distribution so it can be used in the context of a web server running on your local computer.</p><p style=\"\"><strong style=\"\">Unit 2:</strong> PHP&#039;s object oriented features will be learned, along with basic function syntax and scoping rules. We&#039;ll also talk about some useful string functions. </p><p style=\"\"><span style=\"\"></span><strong style=\"\">Unit 3:</strong> Associative arrays will be discussed in Unit 3. Arrays are the key to understanding the mechanism of sending and receiving data via the request mechanism in PHP. We&#039;ll learn how to work with data via REQUEST, GET, and POST, and we&#039;ll also cover some important server variables exposed by PHP.</p><p style=\"\"><strong style=\"\">Unit 4:</strong> teaches how to integrate MySQL databases with PHP. The concentration here is on the PHP communication with MySQL using the mysqli class in an object oriented style. If you need a refresher on the MySQL, Checkout out MySQL course.</p><p style=\"\">I hope you enjoy the course, and I look forward to working with you!</p>", 
    "end_date": null, 
    "title": "Learn PHP Programming for Absolute Beginners", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573716_d21e.jpg", 
    "course_url": "https://www.udemy.com/learn-php-programming-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T17:13:43Z"
}