{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Closures, prototypes, JSON, the DOM, selectors, inheritance in CSS and in Javascript, and first class functions - that's what this course is about.</p><p>This is <strong>not</strong> a course on Javascript frameworks - its about <strong>solid, fundamental HTML, CSS and Javascript</strong>. You'll be surprised by how much more you can get done on your web pages once you learn these technologies <strong>the right way</strong>.<strong></strong></p><p><strong></strong></p><p><strong>What do we mean by that?</strong></p><ul><li>Relatively <strong>few folks formally learn HTML, CSS or Javascript</strong>, because its quite easy to get stuff done in these technologies in a \"quick-and-dirty way\".</li></ul><ul><li>That \"quick-and-dirty\" way of learning and doing leads to problems over time, because <strong>Javascript and CSS are actually quite complex</strong>, so it is easy to do things the wrong way</li></ul><ul><li>This course will help, because it has 75 examples, 20 in HTML/CSS and 55 in Javascript. Each is self-contained, has its source code attached, and gets across a simple, specific use-case. <strong>Each example is simple, but not simplistic.</strong></li></ul><p><strong>What's Included:</strong><br></p><ul><li><strong>Basic HTML:</strong> Folks stopped counting HTML as a language worth formally learning sometime in the 90s, but this is only partially justified. It always helps to have strong basics.</li></ul><ul><li><strong>CSS:</strong> Cascading Stylesheets are incredibly powerful, and incredibly hard to use - until you know how they really work. Once you understand inheritance and selection in CSS, it will all make a lot more sense.</li></ul><ul><li><strong>Javascript</strong> is a full-fledged, powerful and complicated language. Its really important to learn Javascript formally, because it is just so different from most other languages you would have encountered. For instance - Javascript has objects and inheritance but no classes.<strong></strong></li></ul><ul><li><strong>Closures</strong> in Javascript are a rather mind-bending concept - functions that \"remember\" how the world looked when they were created.</li></ul><ul><li><strong>Prototypes</strong> are Javascript's way of doing inheritance, and its very different from the C++/Java way of doing it.</li></ul><ul><li><strong>JSON</strong> is not conceptually difficult to use, but it is incredibly important, and you should understand why - because its the glue between backends written in Java or other traditional languages, and front-ends written in Javascript</li></ul><ul><li><strong>The Document-Object-Model</strong> is what ties Javascript back to HTML and CSS. Together with JSON, the DOM ties it all together from server to skin.</li></ul><p><strong>Talk to us!</strong></p><ul><li>Mail us about anything - <strong>anything!</strong> - and we will always reply :-)</li></ul>", 
    "end_date": null, 
    "title": "Learn By Example: The Foundations of HTML, CSS & Javascript", 
    "price": "20.00", 
    "instructors": "Loony Corn", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/773824_00c4.jpg", 
    "course_url": "https://www.udemy.com/learn-by-example-html-css-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-25T11:04:25Z"
}