{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Note: this course is still being actively developed</strong>. </p><p>More content will be added in the coming months. Because of this, the price has been adjusted accordingly (I will be raising the cost of the course as more content is added). Take advantage of the early-bird price while you can and get in on free content updates as they come out.<br></p><p>HTML is the very first language every web developer should master. It is the very basis that everything else builds off. Since web sites are comprised of several coding languages , many instructors tend to rush through HTML as fast as possible to get to the more exciting material-- this is a costly mistake for new developers! In this course, we give HTML the sole attention that it deserves.</p><p><strong>What you can expect to learn</strong><br></p><ul><li>HTML's Role: I will teach you where HTML fits in the scheme of things.</li><li>HTML Essentials: I will show you the fundamental parts of HTML that are practiced the vast majority of the time.</li><li>HTML Concepts: Not only will I teach you what to do, but I will also explain why.</li><li>Best Practices: I will teach you effective techniques that carry over into real-world applications</li><li>Pitfalls: I will illustrate common pitfalls and how to avoid them.</li></ul><p><br></p><p>We will learn HTML the proper way-- starting from the basics and moving on up.<br></p><p>The course will start out with what HTML is and isn't and where it fits in the scope of things. We will then go over each of the principal features of HTML. By the end of the program, you will have a solid understanding of HTML and be able to create bulletproof HTML code.</p>", 
    "end_date": null, 
    "title": "Learn Effective HTML in No Time!", 
    "price": "40.00", 
    "instructors": "Sean Raborg", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392526_8053_2.jpg", 
    "course_url": "https://www.udemy.com/learn-effective-html-in-no-time/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-12T23:15:42Z"
}