{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Learn and build a modern flat responsive website in Photoshop and bootstrap and start your own theme development business by making website for the themeforest and wrapbootstrap marketplaces.</p><p style=\"\">This course teaches you how to code as you build a professional and nice looking website from scratch, so you never feel like you are in class.</p><p style=\"\">We have bought together all the professional procedures that are accepted for building bootstrap sites into an unique project based course.</p><p style=\"\"><strong style=\"\">Winning the Heart, Mind, and Loyalty of Your Customers</strong></p><p style=\"\">Today, business is not about just taking an order. You have to nurture a win-win relationship and focus on making the customers or clients feel so important and special that they will not only want your product or service, but will recommend others to you</p><p style=\"\"><strong style=\"\">Learn to build your skills to the next level and start earning real money</strong></p><ul style=\"\"><li style=\"\">Learn to use wire framing tools, Adobe Photoshop, Bootstrap framework, HTML5, CSS3 and jQuery.</li><li style=\"\">Build professional website and earn real money from the web.</li><li style=\"\">Make a web developer career online in the marketplaces like themeforest and wrapbootstrap</li></ul><p style=\"\"><span style=\"\"></span></p><p style=\"\"><strong style=\"\">Course Description</strong></p><p style=\"\">Modern web design approach need a practical knowledge of the tools and features of Adobe Photoshop and Twitter bootstrap. This course, intended for beginners and experienced designers alike, will show you how to use Photoshop to design web pages, custom graphics and more that excite end users and impress clients.</p><p style=\"\"><strong style=\"\">So what you will learn in this course?</strong></p><ul style=\"\"><li style=\"\">Right tools Needed to compete in the modern web development environment.</li><li style=\"\">A lots of free educational stuffs.</li><li style=\"\">Choosing the right fonts And colors.</li><li style=\"\">How to wire framing the layout.</li><li style=\"\">Designing the complete site in Photoshop.</li><li style=\"\">How to make a jQuery based amazing background slider.</li><li style=\"\">How to make a static image background in Photoshop as well as in HTML5 and CSS3.</li><li style=\"\">How to make animated skills bar in HTML5, CSS3 and jQuery.</li><li style=\"\">How to make use of animated hover effects.</li><li style=\"\">How to make a team section with the help of owl-carousel jQuery plugin.</li><li style=\"\">How to implement a parallax effect inside the website.</li><li style=\"\">How to use jQuery for super cool effects like animations, scroll effects and sticky navigation.</li><li style=\"\">How to implement a Nivo Lightbox to design a great portfolio section.</li><li style=\"\">How to implement snazzy map in your website.</li><li style=\"\">How to make use of wow JavaScript plugin and animation in your website.</li><li style=\"\">How to upload your site to the top marketplaces like themeforest and wrapbootstrap.</li></ul><p style=\"\">At the end of the course, you will have such a deep understanding of how to make a beautiful with a content rich website in Bootstrap, HTML, CSS and jQuery that you will be able to build any website you can imagine from complete scratch.</p><p style=\"\"><strong style=\"\">So, who is this course for?</strong></p><p style=\"\">This course is perfect for complete beginners: there is absolutely no coding experience required. This course is also perfect for an intermediate level developers Or maybe you're a web designer and want to expand your skill set into HTML5 and CSS3? This course is perfect for you, too!</p><p style=\"\"><strong style=\"\">What are the requirements?</strong><br style=\"\"></p><ul style=\"\"><li style=\"\">Wire framing tool, Adobe Photoshop 1170 Grid System ( there is a lecture on tools you are going to use).</li><li style=\"\">A little bit knowledge of HTML and CSS.</li><li style=\"\">Any computer will do — Windows, OSX or Linux</li><li style=\"\">Passion to learn exciting new skills</li></ul><p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong><br style=\"\"></p><ul style=\"\"><li style=\"\">Learn how to plan your website and make use of wire framing tools..</li><li style=\"\">Learn how to work inside the grid system by understanding baseline and vertical grids.</li><li style=\"\">Learn about the free useful resources present on the web about web designing to move your skills to the next level.</li><li style=\"\">.Learn to design pixel-perfect flat designs website with 1170 bootstrap grid system.</li><li style=\"\">Learn how to use a twitter bootstrap in a modern web development environment.</li><li style=\"\">Learn simple-to-use web design guidelines and tips to make your website outstanding.</li><li style=\"\">Learn how to implement advance jQuery based background slider in your website.</li><li style=\"\">Learn how to make skill bar jQuery effect in a website.</li><li style=\"\">Learn how to implement an advance sticky navigation in your website.</li><li style=\"\">Learn how make an awesome hover based portfolio section in a website.</li><li style=\"\">Learn how to convert a pixel perfect PSD to a fully functional HTML5, CSS3 and jQuery based modern website.</li><li style=\"\">Learn responsive web design by creating a website thats works fine across all devices.</li><li style=\"\">Learn how to apply a parallax effect in your website.</li><li style=\"\">Learn how to make use of JavaScript plugin and other css plugin to animate your website.</li><li style=\"\">Learn how to implement a modern snazzy map in your website.</li><li style=\"\">By the end of the course you will be able to build your own good looking website from the very scratch and apply the concepts, ideas and skills learned here to your own projects and start your web development carrier.</li></ul><p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p style=\"\"><strong style=\"\">What is the target audience?</strong></p><ul style=\"\"><li style=\"\">People who want to earn money from marketplaces like themeforest, wrapbootstrap, codegrape, mojotheme etc.</li><li style=\"\">Complete beginners who want to learn how to build a professional, beautiful and responsive website.</li><li style=\"\">Web designers who want improve their skills to the next level and learn flat web design concept.</li><li style=\"\">Web designer who want to learn something new in the modern web design environment.</li></ul>", 
    "end_date": null, 
    "title": "Learn & build a modern responsive website for themeforest", 
    "price": "20.00", 
    "instructors": "Tariq Ahmad", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532412_7003_4.jpg", 
    "course_url": "https://www.udemy.com/learn-build-a-modern-responsive-website-for-themeforest/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T18:53:56Z"
}