{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>In first section</strong>,I have made complete bootstrap 3 basics essential tags course for you,so you could easily understand bootstrap and could use it in making any kind of responsive theme.This section is constituted on 44 videos lectures which describe everything about bootstrap and in second section I have also made a theme with bootstrap for you.</p>\n\n<p><strong>I have made this multi purposes single page theme in the second section of this course</strong> by purely using HTML5.0 tags and CSS3 properties with the assistance of bootstrap frame work to make it complete responsive.Often people use bootstrap for this purpose and the good thing of the usage of bootstrap kinds of frame work is that students can easily make any kind of theme responsive without indulging themselves in any complicated issues. Therefore I have made this theme to make the students fully expert over all the essential HTM5.0 tags,CSS3 properties and bootstrap frame work.So I am very hopeful that after joining this course and learning it, you will get a good control over making any kind of advance level responsive layout with the assistance of bootstrap.This section is constituted on 77 videos and 13 hours long. I have focused to make the students fully experts in the usage of all the essential HTML5.0 tags, CSS 3 properties and bootstrap,so you could learn their usage very well.</p>", 
    "end_date": null, 
    "title": "Learn Bootstrap3 With Multi Purposes Single Page Layout", 
    "price": "20.00", 
    "instructors": "Mohammad Tahir Ahmed", 
    "commitment": "21 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764076_65e5_2.jpg", 
    "course_url": "https://www.udemy.com/single-page-layout-with-bootstrap/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T06:36:36Z"
}