{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">The purpose of this course is to give you the fundamental knowledge of real-time web and how to implement it using Microsoft&#039;s suspiciously easy to use library Signal R and probably to make you fall in love with it.</p><p style=\"\"><strong style=\"\">Why take this course?</strong></p><p style=\"\">You should take this course if you&#039;re a professional(or student) with some coding experience in the past but lack understanding of what is real-time web and why it is so important to have in your app. You will learn how to implement a real-time web functionality in your app using Microsoft&#039;s library SignalR. </p><p style=\"\">Sections 1, 2 and 3 contain very useful information about HTTP protocol inner workings and the difference from TCP Socket connections and anybody can benefit from them - regardless whether they&#039;re familiar with C#.Net or not.</p><p style=\"\"><strong style=\"\">Practice beats theory</strong></p><p style=\"\">A lot of courses tend to pile up theory ahead of the real code, this course is going take a minimum theory first approach.</p><p style=\"\">You will learn essentials of real-time web and will start implementing it in your application in under 20 minutes.</p><p style=\"\"><strong style=\"\">We value your time</strong></p><p style=\"\">Your time is precious, so instead of repeating one thing in 4 different ways, we will keep it straight to the point - all videos tend to include only the information that you are going to benefit from - no small talk. </p><p style=\"\"><strong style=\"\">Open Source Project</strong></p><p style=\"\">All source code shown in this course is also made available as a Git repository through GitHub. Students can create their own branches, and push changes back for community benefit.</p>", 
    "end_date": null, 
    "title": "Learn SignalR: Make a Full Featured Chat App From Scratch", 
    "price": "40.00", 
    "instructors": "D.  Penev", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512146_214c_5.jpg", 
    "course_url": "https://www.udemy.com/learn-signalr-make-a-full-featured-chat-app-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T19:43:33Z"
}