{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t              Learn Ruby on Rails by following this project-based tutorial!  </p>  <br style=\"\" />  <p style=\"\">  \t                I strongly believe that the best way to learn to code is by building something from scratch. Code snippets and books are great, but you truly learn when you are doing. This course will show you how to build a classifieds website, starting at the &quot;rails new&quot; command. You will get a basic understanding of the MVC structure of Rails, a general grasp of Ruby, and have something to show for it in the end! Oh, no scaffolds here. When I say scratch, it truly is from scratch!  </p>  <br style=\"\" />  <p style=\"\">  \t                The course will not be covering installation of Ruby/Rails. There are many fantastic tutorials that walk you through those steps. The focus here is to get your hands dirty and dive straight into the code.  </p>  <p style=\"\">  \t            I will not be covering HTML/CSS, which is why I&#039;ve provided the markup and styling for you in separate files! Please download them so you can follow along and add them to your project.  </p>  <br style=\"\" />  <p style=\"\">  \t            TDD/BDD will also not be covered. While these are fantastic conventions when working on a production-level application, the value cannot be appreciated if you&#039;re new to programming. It adds unnecessary complexity and the goal is to learn Ruby/Rails, which is why this course will not be covering testing.  </p>", 
    "end_date": null, 
    "title": "Learn Ruby on Rails - Build a Craigslist Clone", 
    "price": "25.00", 
    "instructors": "Jay Lee", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341638_b140_2.jpg", 
    "course_url": "https://www.udemy.com/ruby-on-rails-build-a-craigslist-clone/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T19:17:16Z"
}