{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>ONE COURSE TO RULE THEM ALL- Eduonix brings you an unique and innovative course which will help you learn the top ten popular PHP frameworks.  It will help you learn why a particular framework is suited for a project. It will provide you the complete perspective across all of them and will help you choose the best framework for your project.</p>    <p>Each framework comes with its own set of benefits and features. If you are new to coding and haven’t yet determined which framework fits your developing style, then this course is perfect for you.</p>  <p>Our PHP framework tutorial covers 10 of the most popular frameworks that are available. These frameworks come with different features that make it stand out amongst the other frameworks. Not only will we go over each framework and its features, but we will also use the framework to create an application for some hands-on experience.</p>    <p>In this course, we will cover the following frameworks:</p>    <ul><li>Learn how to create a <strong>Patient Manager</strong> using the <strong>CakePHP</strong> framework</li><li>Design a <strong>Job Board</strong> using the <strong>Yii2</strong> framework</li><li>Create an <strong>Event Calendar</strong> with the <strong>Symfony</strong> framework</li><li>Build a <strong>Sparkup</strong> <strong>CMS</strong> using the <strong>Codeigniter </strong>framework</li><li>Learn how to design a <strong>Photo Gallery</strong> with the <strong>Laravel</strong> framework</li><li>Create a <strong>Knowledgebase</strong> using <strong>Zend</strong> framework</li><li>Create a <strong>RESTful API</strong> using <strong>Slim</strong> framework</li><li>Make a <strong>FreshIdeas Idea Diary</strong> using the <strong>Nette</strong> framework</li><li>Design a <strong>Weblink</strong> <strong>Manager</strong> with the <strong>PHPixie </strong>framework</li><li>Create an <strong>Albumshelf</strong> with the <strong>FuelPHP</strong> framework</li></ul>                      <p>We have managed to pack lot of good stuff and cool development techniques in one complete course. With so much knowledge and information in one course, what are you waiting for? Enroll now and find out which framework will help you create the next big project..</p>", 
    "end_date": null, 
    "title": "Learn Top Ten PHP FrameWorks By Building Projects", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "17.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/740762_71f3.jpg", 
    "course_url": "https://www.udemy.com/learn-top-ten-php-frameworks-by-building-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T08:51:44Z"
}