{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In this course you will learn how to create animations and transitions in CSS3 and Javascript. The easy to follow along tutorials will have you animating in no time.</p><p><strong style=\"\">Master the art of adding animation to your websites and pick the right tools for the job.</strong></p><ul style=\"\"><li style=\"\">Create animations and transitions using CSS3</li><li style=\"\">Learn the building blocks of how animation works in Javascript</li><li style=\"\">See how different techniques can add life to your animations</li><li style=\"\">Leverage animation frameworks that take care of the hard work and let you animate quickly.</li><li style=\"\">Follow along with the included source code<br style=\"\"><br style=\"\"><br style=\"\"><strong style=\"\">We&#039;ll learn the basics of animating all the way through complex sequenced animations</strong><strong style=\"\">.</strong><br style=\"\"><br style=\"\">You&#039;ll learn how to use CSS3 syntax to create quick and smooth animations without needing javascript. Next I&#039;ll show you the building blocks of animating in javascript using setInterval and requestAnimationFrame in the canvas. Then you will learn how to leverage jQuery&#039;s animation methods, events, and properties to get animating quickly.  Last but not least we&#039;ll cover GSAP (Greensock animation platform) where you&#039;ll learn the basics all the way through complex sequenced animations.  This course comes complete with working code samples so you can work along side the instructor and modify to create your own animations. The full course can be completed in just over 2 hours.<br style=\"\"></li></ul>", 
    "end_date": null, 
    "title": "Learn animation using CSS3, Javascript and HTML5", 
    "price": "25.00", 
    "instructors": "Matt Wallace", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378924_97a3_3.jpg", 
    "course_url": "https://www.udemy.com/animating-css-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-28T03:30:32Z"
}