{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t                This course will guide you through building a real-world web application using NodeJS, Express, and MongoDB.  </p>  <p style=\"\">  \tYou’ll  start with using the Jade template library and Bootstrap framework to  create clean and maintainable code for your app. You will then see how  to put MongoDB to work, store data for your app, and incorporate  best-practices such as modularization. You’ll go beyond the basics to  include authentication, test-driven-development, and powerful  time-saving tools to get the app ready for deploying. You will also  explore CSS preprocessors and create RESTful services that make the best  of MVC libraries and add that extra edge to your app.  </p>  <p style=\"\">  \tAfter completing this series, you’ll be ready to start building and deploying web applications of your own.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p style=\"\">  \t<strong style=\"\">Matthew Nuzum</strong> has been developing web applications since 1999 and worked  for several start-ups including Canonical, makers of Ubuntu, as well as  Fortune 500 companies. He has a passion for helping others learn new  technologies and has written numerous tutorials and help documents as  well as running a web-focused user group based in his hometown of Des  Moines.  </p>", 
    "end_date": null, 
    "title": "Learning Express Web Application Development", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/423286_0d88_2.jpg", 
    "course_url": "https://www.udemy.com/learning-express-web-application-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-16T13:19:27Z"
}