{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Not : Projenin kaynak kodları Ders:68 içerisine zip olarak eklenmiştir indirip kodlardan takip edebilirsiniz</p><p>Not: The project source code is added in Ders:68 , you are downloaded it</p><p>Enjoy and happy coding<br></p><p>Bu kurs Laravel 5 ile istediğiniz kadar dili admin panelden ekleyebileceğiniz ve bu dillerin translate işlemlerini html kodlara hiç dokunmadan sadece admin panel içerisinden yapabileceğiniz, tamamen otomasyon olarak düzenlenmiş bir admin panel projesi oluşturmayı hedeflemiştir.</p><p>Kursu birebir olarak uyguladığınızda arapça rusça gibi doğu dilleri dahil olmak üzere dünyada konuşulup yazılabilen tüm dilleri panelinizden ekleyebilir ve translate edebilirsiniz.</p><p>Bu kursu webmaster olan yada olmayı hedefleyen ve web teknolojileri geliştiren başlangıç, orta ve ileri seviyedeki tüm öğrenciler almalıdır, çünkü şu anda bu eğitimin bir benzeri yada bu konuyu bu kadar net ve derinlemesine inceleyen başka bir kaynak pek bulunmamaktadır.</p><p>Kursu tamalayabilmeniz için gereken materyaller kaynak olarak kursa eklenmiştir indirip kullanabilir, benimle beraber ilerleyebilirsiniz.</p><p>Kursun süresi yaklaşık 20 saat civarı olarak düşünülmektedir.</p><p>Bu kursta, laravel'e yada php ye yeni başlamış olan öğrenciler göz önünde bulundurularak her detay en ince ayrıntısına kadar anlatılmıştır, geliştirme makinanızın ayarlarını nasıl yapacağınız ise gorselsoft com sitemizde ücretsiz dersler halinde yayındadır, bu şekilde makina ayarlarınızı da sorunsuzca yapabileceksiniz.</p><p>Eğer siz de translation işlemlerini tam otomatik olarak yapacağınız web projeleri ile müşterilerinizi memnun etmek ve daha fazla kazanç elde etmek istiyorsanız bu kursu atlamamalı muhakkak almalısınız</p><p>Bu kursa bedel olarak ne kadar ödemiş olursanız olun, öğreneceklerinizle yüzlerce katını kazanma şansınız olacak çeşitli pluginleri entegre ederken kullandığımız global yöntemlerle class mantığınızı geliştirecek ve spagetti php kodlama alışkanlığınız varsa bunlardan kurtulmuş olacaksınız.Kısacası bu kursu aldığınıza asla pişman olmayacaksınız...<br></p>", 
    "end_date": null, 
    "title": "Learning Multi Language Admin Panel with Laravel 5", 
    "price": "20.00", 
    "instructors": "Muhammed Ravullu", 
    "commitment": "18 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628764_c1e6_6.jpg", 
    "course_url": "https://www.udemy.com/learning-multi-language-admin-panel-with-laravel-5/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T11:59:46Z"
}