{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">  Bootstrap</strong> is the world&#039;s most popular mobile ready web development framework for HTML, CSS and JavaScript. Bootstrap is for you if you want to quickly build a super cool website which work across devices and browsers. It is easy to learn and super powerful.  </p>  <p>  \t          We have bought together all the best practices of building bootstrap sites into an unique project based course which will teach you all the nuances of web development while building real world bootstrap projects. The projects cover generic development process and are diverse enough to cover a very wide variety of websites.  The projects covered in the course are  </p>  <p>  \t<strong style=\"\">Photo App Sales Website</strong> : A simple project to get you started. It will help you quickly master the basic bootstrap structures and you will be quickly up and running on your first bootstrap website.  </p>  <p>  \t<strong style=\"\">Portfolio Resume using SASS</strong> - Learn to use SASS along with Bootstrap for this next project. Learn about Grid Systems, List Styling and Progress Bar Components in this course.  </p>  <p>  \t<strong style=\"\">Social Network Template</strong> - This will be a fairly complex project with multiple bootstrap components. You will learn about Nested grids, Button Groups, Gallery plugin and Responsive Media Queries.  </p>  <p>  \t<strong style=\"\">Agency Landing page</strong> - This project develops a landing page using LESS. LESS is a CSS preprocessor. You will also learn Jumbotron showcase,Scroll Down Effect and Font Awesome Icons.  </p>  <p>  \t<strong style=\"\">Photo Gallery</strong> - You will learn to create a Photo gallery display using components such as Grid UI and Tab Widget. You will also learn the use of Bootstrap Image Carousel and Photo Lightbox Jquery Plugin.  </p>  <p>  \t<strong style=\"\">CMS Admin Template</strong> - Learn to build an Admin template for a content management system. You will learn the use of Bootstrap Table Classes,Glyphicons, Breadcrums and Button Groups  </p>  <p>  \t<strong style=\"\">Web hosting Company Website</strong> - This project will teach you Bootstrap Components such as  Bootswatch UI tools, Content carousel, Stack icons and stylish fonts.  </p>  <p>  \t<strong style=\"\">E-commerce Template </strong>- Learn to build a front end of an E-commerce website. Learn components such as Tab Widget, Product Grid and Custom header.  </p>  <p>  \t<strong style=\"\">Business Bootstrap Theme</strong> - Learn to use animation in your website with animate css. Also learn to optimize your site for mobile with this amazing project.  </p>  <p>  \t<strong style=\"\">Blog Website</strong> - Learn to build the front end of the blog with components such as Dropdown menu, Contact form, Carousel Thumbnails &amp; Grid View.  </p>  <p>  \t<br style=\"\">  </p>  <p>  \t      With all this projects under your back you can build almost anything with Bootstrap. So click that Enroll button and see you on the other side.  </p>", 
    "end_date": null, 
    "title": "Learn  Bootstrap Development By Building 10 Projects", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427530_d0e0_2.jpg", 
    "course_url": "https://www.udemy.com/learn-bootstrap-development-by-building-10-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T07:59:09Z"
}