{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Join Over 11,698 Students and Sign Up to one of My Courses Today!</strong><br></p><p><strong>Last Updated: February 20th, 2016.</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Have you always wanted to become an online web developer or JavaScript developer? With all the different programming languages out there it can be hard to find one to start off with yet alone find a good course that will show you how to learn the language effectively. </p><p>Because of all this I put together a JavaScript basics course that will show you as a complete beginner how to begin creating programs using JavaScript. This course is created for anyone brand new to web development, or simply for those who know HTML, CSS, or any other programming language but have never worked with JavaScript before.</p><p>My goal with this course is to make the best resource for learning JavaScript online, PERIOD. Because there is so much to learn, I will be continually adding new content to the course as well as updating older lectures to get rid of outdated content.</p><p>If you always wanted to get into programming then this course is right for you! Let's take a look at what you will learn throughout this course:</p><ol><li><strong>An Introductory To Working With JavaScript</strong></li><li><strong>The syntax and basics</strong></li><li><strong>Working with Variables </strong></li><li><strong>Understand how Strings and Numbers Work</strong></li><li><strong>Using conditional statements to create multiple outcomes in your programs</strong></li><li><strong>Creating and working with functions to make your programs even more powerful.</strong></li><li><strong>Working With Loops in JavaScript</strong></li><li><strong>Understand How Arrays Function</strong></li><li><strong>Everything you need to know in order to get started with JavaScript development.</strong></li></ol><p>If you join the course now you will get LIFETIME access, that's right even when I update the course and add new content you will still get all the new content for FREE.</p><p>Since this course is new on Udemy the price will be low, I will be slowly raising the price however so grab it now while its still cheap!</p><p><br></p>", 
    "end_date": null, 
    "title": "Learn How To Become a JavaScript Developer from Scratch", 
    "price": "20.00", 
    "instructors": "Robin Haney", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607218_a05a_3.jpg", 
    "course_url": "https://www.udemy.com/the_complete_javascript_course_for_beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T19:12:19Z"
}