{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<h5 style=\"\">A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p style=\"\">CSS powers the visual side of the internet, and anyone looking for a real understanding of web design must know what it can do and how it works. This Learning CSS3 Tutorial Course simplifies the&nbsp; standard of cascading style sheets into its most basic elements, and then gradually advances to help you gain a well-rounded understanding to creating layouts and stylistic elements for the web. This beginner-friend CSS3 training course is led by expert Geoff Blake, who draws from his background as a designer to help you see how various graphical elements and settings can work together to form a complete user experience. Because the training is built around CSS3, you&#039;ll also learn features that are specific to the newest standard of the style sheets protocol. Get ready to learn layout, layering, typography and special effects in this unique and engaging 8-hour course.</p>  <p style=\"\">&nbsp;</p>  <p style=\"\"><strong style=\"\">What You Will Learn</strong></p>  <p style=\"\">-How to create complete website layouts using Cascading Style Sheets (CSS) according to best-practice professional standards.</p>  <p style=\"\">-How to manipulate and modify onscreen graphical elements within a site, including text, menus, lists, borders, and graphics.</p>  <p style=\"\">-How to enhance a website&#039;s appearance with subtle special effects such as drop-shadows and transparency.</p>  <p style=\"\">-How to use CSS in conjunction with standard HTML to develop and enhance pages and sites.</p>  <p style=\"\">&nbsp;</p>  <p style=\"\"><strong style=\"\">Who Should Take This Course</strong></p>  <p style=\"\">-Anyone who wants more control over the visual appearance of their current websites or ones they are planning to build. No experience is needed.</p>  <p style=\"\">-Anyone who wants to know how HTML and CSS work together on modern pages and sites.</p>  <p style=\"\">-Anyone who has tried working with CSS but found it difficult in the past.</p>  <p style=\"\">&nbsp;</p>  <p style=\"\"><strong style=\"\">What People Are Saying</strong></p>  <p style=\"\"><em style=\"\">&quot;I knew some basic HTML but my layouts were flat and boring.&nbsp; Now that I understand layers and CSS it&#039;s a whole different ballgame. Thank you Geoff!&quot;</em></p>  <p style=\"\">-Marty Self</p>  <p style=\"\"><em style=\"\">&quot;Coming from a graphics background, these videos helped me learn how to create artwork suited for the web...and even better, how to place them on my site for maximum effect.&quot;</em></p>  <p style=\"\">-Roy Ramirez</p>  <p style=\"\"><em style=\"\">&quot;Loved the section on special effects and transparency...web design CAN be fun.&quot;</em></p>  <p style=\"\">-Jennifer Blockman</p>", 
    "end_date": null, 
    "title": "Learning CSS3 - A Comprehensive Tutorial For Web Developers", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/18448_4dfd_12.jpg", 
    "course_url": "https://www.udemy.com/learning-css3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-23T20:29:09Z"
}