{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>The fastest way to create websites with Wordpress</strong></p><p>This course is designed to understand wordpress at max and help you to create amazing websites with it.</p><p>Do you know that we are in internet age? It's almost an obligation have a website at this</p><p>time.</p><p>Why? It's because thousand of people at this age are looking for professionals maybe with your skills and you. Are you appear in Google?</p><p>The biggest products are in ideas yet, do you want to be the next big thing? Let me help you with that.</p><p>A lot of websites at this time are created with wordpress, websites like: </p><ol><li>Spotify. </li><li>ElPais.</li><li>TechCrunch.</li><li>People Magazine.</li><li>BBC,</li><li> RollingStones.</li></ol><p>All of those websites are created with wordpress and all of them have millions of visitors monthly.</p><p>This course is totally designed to those people who want to create a website but doesn't know nothing about programming, I will show you that you don't need to be an expert programmer to know how to create amazing things.</p><p>Don't worry because I will teach you also some little things of HTML to you can take advantage of the amazing things that Wordpress give to us.</p><p>What do you need to take this course? You just need your computer and be motivated to learn al the things that I have to teach you.</p><p>As a gift for enroll in this course, I will give you more than 20 stunning templates for your new Wordpress Website.</p><p>So what are you waiting? Your time is now.</p>", 
    "end_date": null, 
    "title": "Learn How to Create Fast Websites With Wordpress.", 
    "price": "20.00", 
    "instructors": "Jonathan A. García", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/575924_fb79_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-create-fast-websites-with-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-06T18:05:33Z"
}