{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><em><strong>Important Note: Price will be increased after September. Grab your free and discounted coupon before oct starts</strong></em></p><p style=\"\">You might have come across so many freelance platforms that has their own features and procedures to work with. And it might take you days to understand each of these platforms. This courses answers the following questions:  </p><ol><li><strong>How does the people per hour platform  work ?</strong></li><li><strong>Everything about the dashboard of People Per hour</strong></li><li><strong>Buying and selling your services as a freelancer</strong></li><li><strong>New concept of making hourlies</strong></li><li><strong>How to write client specific proposal</strong></li><li><strong>How can you win the clients again</strong></li><li><strong>Negotiating and Questioning Terms</strong></li><li><strong>Price and Rates</strong></li><li><strong>How to increase your level in people per hour</strong></li></ol><p style=\"\"><em><strong>This course introduces you the basics of understanding how you can become a freelancer even if you dont have any skill</strong></em>. It provides the details of where you need to start . This step by step procedure will make you understand the whole setup in just 30 minutes.</p><p style=\"\">After going through this course not only will you be ablE to understand the whole platform but also <strong><em><u>EARN MONEY ONLINE AT HOME AS A FREELANCER AT ANYTIME , ANYWHERE.</u></em></strong></p><p style=\"\">The courses includes details about the links that you need to check , where you need to learn a skill, how can you practice them and than work over a proper profile to start freelancing in various platforms. </p><p style=\"\"><strong><em>Free slides are given to all students who enroll in the course.</em></strong> </p>", 
    "end_date": null, 
    "title": "Learn to Freelance with People Per hour  (URDU)", 
    "price": "20.00", 
    "instructors": "Marjan Khan", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/603408_92e5_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-freelance-with-people-per-hour-in-30-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-05T16:42:21Z"
}