{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Get to learn the latest architecture and design pattern for developing UI for scalable web apps. When you are developing a fairly complex app you will reach the limit of MVC very soon and <strong>Flux </strong>is a complete rethink of the architecture created from ground up for handling massively scalable apps. </p><p>The power behind the architecture is its one way data flow. It uses two powerful constructs one is the <strong><em>Action creator</em></strong> and the other being the<strong> singleton </strong><em><strong>dispatcher</strong></em>. They work together to maintain the unidirectional data flow even when the number of views becomes very large. The flux architecture allows for features such as Enforced synchronization between dispatchers and handlers, no cascading actions and semantically descriptive actions. This is a great new technology for all the web developers who struggle with complexities of MVC as their app grow in popularity.</p><p>The course aims to provide a one stop training manual for developing apps using this new architecture.  You will start with the basic concepts behind this popular technology and follow it up with a detail section on React which compliments this architecture. You will then learn about the flux components such as Action creators, Dispatchers and Stores. You will learn to set up the programming environment and go through the popular tools. You will finally build a complete web app using the Flux Architecture and its associated technologies. </p><p>After completing the course you will be able to: </p><p><strong>Rethink your web app architecture on the concepts learned all through this course</strong></p><p><strong>Build professional Apps using Flux architecture</strong></p><p><strong>Have a conceptual understanding of the Flux way of doing things</strong></p><p><strong>Use ReactJs and Flux together in your application</strong></p><p><br></p><p>So get started and start building your next app using Flux.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Learn Facebook Flux Architecture for Web Applications", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655298_dad2.jpg", 
    "course_url": "https://www.udemy.com/learn-facebook-flux-architecture-for-web-applications/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T07:24:38Z"
}