{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>We understand <em>first-hand</em> how frustrating it can be trying to learn how to use new technologies in a short amount of time. And because mastering a new skill isn't usually easy, we decided to do something about that by breaking this course down into <strong>easily consumable bite-sized chunks</strong> that make the concepts not only <strong>super clear</strong>, but also <strong>really memorable</strong> - <strong>pretty quickly</strong>. </p><p>Instead of just showing you how to \"paint by numbers\", like most courses do, <strong>we'll be showing you why the code works like it does</strong> so you'll be able to actually take that knowledge and apply it anywhere.</p><p>That means you'll be able to <strong>do awesome things</strong> like being able to <strong>bootstrap your business</strong>, <strong>market on a shoestring budget</strong>, or just <strong>learn a highly marketable skill</strong> to boost your resume or CV - all in about about 3 hours!</p><p><span></span>Over the course of these easy to follow, bite-sized video lectures you'll gain a strong foundation in <strong>responsive web design</strong>, <strong>wireframing</strong>, <strong>HTML5 </strong>and <strong>CSS3</strong> – even if you've never tackled any of these topics before.</p><p>We'll walk you through it, <em>step-by-step</em>, as you create your own 100% custom landing page, that's <strong>search engine friendly</strong> and whose <strong>content and layout is completely under your control</strong>. And because we take the time and care to explain to you not just “the how\" but also “the why\" behind the code, you'll finish with a really deep understanding of how to apply what you've learned with us to any project you take on in the future.</p>", 
    "end_date": null, 
    "title": "Learn HTML5 & CSS3 in 3 Hours: A Responsive Webpage Tutorial", 
    "price": "25.00", 
    "instructors": "HackStack.io Tutorials, Petr Kout, James York", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/548216_ff1e_2.jpg", 
    "course_url": "https://www.udemy.com/hackstackio-learn-html5-css3-responsive-webpage-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-07T19:01:48Z"
}