{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>** Course updated new bonus articles about building custom directives **<br></p><p>Please note that this course covers version 1.x of AngularJS.<br></p><p>There are many Angular courses on the Web now. Which one should you take? If you're looking to <strong>dive deeper into custom Angular directives</strong> and want to learn from a developer/instructor with over <strong>15 years of experience</strong> who has also been awarded the <strong>Angular Google Developer Expert</strong> (GDE) award <strong>from Google</strong> then this is the course for you! Dan also created the popular <strong>AngularJS in 60-ish Minutes</strong> video on YouTube (over 1 million views) so if you enjoyed that then you'll love this course!<br></p><p>  \t                         Are you interested in learning how to take your AngularJS skills to the next level? Have you been confused by terms like <strong>tranclusion</strong>, <strong>isolate scope</strong>, <strong>interpolation</strong>, local scope properties, and more? Have you wanted to build custom directives but didn't know where to start? Look no further than the <strong>Learn to Build</strong> <strong>AngularJS Custom Directives</strong> course by Dan Wahlin!  </p>  <p>  \t                         Throughout this course you'll be provided with a step-by-step look at the process of creating <strong>custom directives</strong> and cover key concepts that you need to know to <strong>take your AngularJS skills to the next level</strong>. Topics such as the <strong>$compile service</strong>, the <strong>directive definition object</strong> (DDO), the<strong> link() function</strong>, <strong>isolate scope</strong>, controller integration, transclusion, working with the <strong>$interpolate service</strong>, <strong>$asyncValidators</strong>, and much more are covered as well as techniques for structuring AngularJS directive code.  </p>  <p>  \t                 In addition to expert instruction by Angular Google Developer Expert (GDE) Dan Wahlin you'll also be provided with <strong>hands-on code samples</strong> that you can <strong>follow along </strong>with at <strong>your own pace</strong>. Just pause or rewind the video if you need to see the code again or jump right to the end solution that's provided if you'd like. <strong>Begin and end code is provided</strong> so that you can maximize your learning and become an expert in building directives!  \t  \t                The modules covered in the course include:  </p>  <ul>  \t<li>Getting Started with Directives</li>  \t<li>Shared and Isolate Scope</li>  \t<li>The Link Function</li>  \t<li>Using Controllers</li><li>Bonus Content - Custom Directives in Action and More</li><li>Bonus Content: Articles on Building Custom Directives</li>  </ul>  <p>  \t                Many additional details are provided throughout the modules including coverage of the <strong>$parse</strong> and <strong>$interpolate services</strong>, how <strong>controllers</strong> and the <strong>link function</strong> can be used in concert, why and how to use transclusion to merge custom content, pros and cons of available coding approaches for custom directives, techniques for <strong>passing parameter data to functions</strong> when using <strong>local scope properties</strong>, and much, much more.  </p>", 
    "end_date": null, 
    "title": "Learn to Build AngularJS Custom Directives with Dan Wahlin", 
    "price": "30.00", 
    "instructors": "Dan Wahlin", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420652_c7e0_3.jpg", 
    "course_url": "https://www.udemy.com/angularjs-custom-directives/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T23:05:19Z"
}