{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><span></span>In this course you will learn how to create responsive websites in HTML5 and CSS3. We will create a complete website from start to finish and will make it responsive. If you are just a beginner and wondering why you need to learn responsive website then here's why, large majority of people surf internet on their smart phones and tablets and if your website is not flexible with the resolution of their devices then they are not gonna like it and your website will give then a very bad user experience, your website may look better on the desktop but on smart phones it will look good. So, now you got the idea why you need to learn responsive web design, here are some key advantages of responsive web design:</p><ul><li>Super Flexible websites</li><li>Excellent user experience</li><li>Recommended by Google (Better for SEO)</li><li>Cost effective</li><li>Easy to manage</li></ul><p>So those were the key advantages of responsive web design. This course covers everything you need to build responsive websites with minimum with effort. In the first section of the course I will introduce you to responsive web design and will explain some more advantages of responsive web design and then in the second section we will start creating our website from scratch and will apply styles to all the elements. Third section is all about the responsiveness and we will make everything responsive and I will also show you how you can create your logo very easily. In the second last video of the third section we will create a very awesome and responsive contact form. The source code of the website in available in the last lecture and you can download it anytime.</p><p>So that's all we will be doing in the course, now what are you waiting for? just click on take this course button and enroll in.</p>", 
    "end_date": null, 
    "title": "Learn to create awesome responsive website in HTML5 and CSS3", 
    "price": "20.00", 
    "instructors": "Usman Raoof", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833792_5f04_2.jpg", 
    "course_url": "https://www.udemy.com/responsive-web-design-start-to-finish/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T19:24:31Z"
}