{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course is about creating a blog in WordPress and and applying different settings to make it look awesome! The best thing about this course is I will also cover how you can optimize your blog for SEO and get a lot of visitors to your blog.</p><p>We will start with setting up WordPress and applying our cool blog theme and then we will start working on our menu, posts, pages and categories and after that I'll cover theme settings in depth and we will customize every inch of our blog, If you are a beginner then after taking this course you will be a WordPress master. At the end I'll show you how you can optimize your skills to make money. The main things that are covered in this course are:</p><p><strong>1. Setting up WordPress and applying blog theme</strong></p><p><strong>2. Customizing theme and making it eye catching</strong></p><p><strong>3. Creating posts, pages and categories</strong></p><p><strong>4. Applying different SEO Techniques to make our blog visible in the eyes of Google</strong></p><p><strong>5. How to make Money with the skills you learned in this course </strong></p><p>and after all this you will be a WordPress machine. The good thing is if you will not be satisfied after taking this course then you can take a full refund and no question will be asked. </p>", 
    "end_date": null, 
    "title": "Learn to Create your own blog - step by step", 
    "price": "20.00", 
    "instructors": "Usman Raoof", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679158_60c8_7.jpg", 
    "course_url": "https://www.udemy.com/learn-to-create-an-amazing-wordpress-blog-start-to-finish/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T07:39:20Z"
}