{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Coding for browsers becomes a whole lot easier with latest version of the ECMAScript programming language. The most popular programming language gets a new version!\n\n  </p>\n\n<p>ECMA International finally introduced the latest version of JavaScript, dubbed the ES2015. ES2015 is the sixth edition of the language offering fancy new features over the preceding versions.\n\n  </p>\n\n\n\n<p>The latest versions brings with it much awaited changes such as new syntax for writing more complex applications, new modules, classes, iterators, loops, expressions, arrow functions, etc. It even includes new python-styled generators and generator expressions. \n\n  </p>\n\n\n\n<p>The idea behind the release of the new version is to simplify the process of creating more complex applications and websites, allowing for more futuristic technologies to take place now. \n\n  </p>\n\n\n\n<p><strong>Itching to try out the latest version of JavaScript? Here’s what you need – this course!</strong>\n\n  </p>\n\n\n\n<p>Our ‘Learn To Build Apps With ECMAScript ES2015’ course has been created in collaboration with an instructor that has over 12 years of experience coding for web side and client side scripts, including being an expert in JavaScript and all related technologies.\n\n  </p>\n\n\n\n<p>The course will break down all new features and syntax of the ECMAScript or ES2015, for short. It will cover concepts such as the fundamentals of JavaScript (standard on all JavaScript versions), Object-oriented programming, objects &amp; classes, variables, arrays, loops, functions, modules, data flows, etc.\n\n  </p>\n\n\n\n<p>Additionally, you will also learn other related JavaScript technologies such as Node.JS, Data Flow, Babel/Traceur, etc.\n\n  </p>\n\n\n\n<p>The tutorial will start with the general fundamentals of ES2015, after which the student will be lead into understanding the features and concepts that the new version offers. After covering the features in detail, the student will then create a functional project using everything that they have learned. \n\n  </p>\n\n\n\n<p>You learn the latest version of JavaScript and everything related including history, background, declarations, classes, Let and Const, templates, strings, new methods, data structures, iterators, functions (generator functions, arrow functions), promises, and so much more. In addition to all of this, you will also build a complete project from scratch and learn how to use ES2015 in a practical setting.\n\n  So, let’s get started on learning the future language of web development.</p>", 
    "end_date": null, 
    "title": "Learn To Build Apps With ECMAScript ES2015", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/828876_2096.jpg", 
    "course_url": "https://www.udemy.com/learn-to-build-apps-with-ecmascript-es2015/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-22T06:01:10Z"
}