{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t        Projects in Ruby On Rails is for developers  looking to upgrade their ruby and rails skills. This course is not for  beginners and will be more suited to professionals who have already done  some Ruby coding. If you are new to Ruby on Rails you can try our  introductory course&quot; Learn Ruby on Rails from Scratch.  </p>  <p>  \t         The course has been taught primarily in Linux. We have included  tutorials to help you get started in Windows but we suggest you use some  flavour of Linux for this course. You can use virtual OS if required.  This course also assumes you know SQL and  as we have used it in all the  examples.  The following projects have been selected  and created in the course. It will not only help you understand the core  concepts of ROR but will also teach you the best of development  practices.  </p>  <p>  \t<strong>Project Details</strong>  </p>  <p>  \t<strong>Book Store </strong>-  The first project is a simple book stock application. You will learn to  install the Rails and MySQL and will build the app step by step adding  controllers, views and models. By the end of it you will have pretty  good idea to build yourself a similar stock keeping web app in ROR.  </p>  <p>  \t<strong>Blogging System </strong>-  Learn to make a complete blog management system like WordPress in Ruby on  Rails. Learn to design your App from ground up using the MVC  architecture . You will learn smart ruby coding techniques in this  project.  </p>  <p>  \t<strong>Image Gallery</strong> - Learn to create  image gallery with optimal image storage and retrieval mechanism. This  simple yet fun project will build further on your knowledge and will  teach you professional rail development methodologies.  </p>  <p>  \t<strong>Shopping Cart</strong>  - A web development course is incomplete without a shopping cart  project. You will learn the basic cart development process and you can  extend the code to build your own online stores. We have used the Spree system for this project.  </p>  <p>  \t<strong>    Content Management System</strong>  - This is the most complex of the project tackled in the course. This  project is a robust content management tool similar to many commercial  applications. It will refresh all the techniques and processes learn in  this course.  </p>  <p>  \t        If you successfully build and improve on  the projects covered in this course you will be able to undertake and  complete any project in ROR. So come aboard be be the Rails Ninja..  </p>", 
    "end_date": null, 
    "title": "Learn Ruby on Rails By Building Projects", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340362_154d_3.jpg", 
    "course_url": "https://www.udemy.com/learn-ruby-on-rails-building-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T08:24:30Z"
}