{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Get up to speed with the building blocks of Angular 2. New \ntechnologies and new patterns are emerging on a daily basis. Coding for \nthe front end is extremely demanding, but at the same time more \ninteresting and challenging than ever before. This highly dynamic \necosystem provides huge possibilities to create awesome things.</p>\n\n<p>Learning Angular 2 Directives helps you get on track by introducing \nyou to Google’s brand new Angular 2 web framework. In this video course,\n you will be guided through the various steps in building real-world \nAngular 2 components.</p>\n\n\n\n\n\n<p>We will start by setting up a modern development environment with \nTypeScript and ES2015 support, and you'll gain an initial understanding \nof what components are about, how to build them, and how they differ \nfrom the directives. We then focus on applying new concepts while \nbuilding a fictitious dashboard application for a home automation \nsystem.</p>\n\n\n\n\n\n<p>We'll guide you through the process of building reusable Angular 2 \ncomponents. You will learn about HTML rendering templates, see how to \nestablish a data flow between different components, and even find out \nhow to integrate external libraries. But not only that, we will also \nfocus on how to make our components production-ready and maintainable by\n applying automated unit and end-to-end testing techniques. As a bonus, \nyou will discover how to bring your Angular 2 components to other \nenvironments such as the server side and mobile devices.</p>\n\n\n\n\n\n<p>Learning Angular 2 Directives is your go-to guide when building successful Angular 2 components.</p>\n\n<p><strong class=\"redactor-inline-converted\">About The Author</strong></p>\n\n<p><strong>Juri Strumpflohner</strong> is a passionate web developer, tech lead, and architect, and is currently focusing on frontend technologies. He has over 6 years of experience in developing JavaScript single page applications with various frameworks, most lately with Angular 1.x and 2.0.</p>", 
    "end_date": null, 
    "title": "Learning Angular 2 Directives", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/861212_9a29_2.jpg", 
    "course_url": "https://www.udemy.com/learning-angular-2-directives/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-27T06:59:50Z"
}