{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Dart is a new open source programming language for the web. Developed\n by Google, Dart is gaining popularity and has a steadily growing \ncommunity. It is a single language for both client and server that can \nbe used to build large-scale web, server, and mobile applications. Stop \nsolving new challenges with the same old tools—let Dart show you a whole\n new way!</p>\n\n<p>This course, by looking at the language features and beyond, gives \nyou the knowledge to create the next great web application that your \nusers need. Ever wondered how to write a great application, like Slack, \nGmail, Facebook, Pinterest, Twitter, and so on? This course will guide \nyou into the wonderful world of web development with the dartlang \nprogramming language. Throughout the course, you will get a more mature \nsense of how to build a great application and see all the facets that \nare needed to reach that goal.</p>\n\n\n\n\n\n<p>This course takes us from basic programming knowledge to \nunderstanding how to manage and build a full-stack web application. We \nwill cover the important language features of Dart with some advanced \nfeatures such as mixins and the null aware operator. Later on, you'll \nsee how to use unit tests, work with browser APIs, and set up of a web \nserver. Finally, we will take a look at Angular 2, a great front-end \nframework also built by the employers of Google.</p>\n\n\n\n\n\n<p>This course provides you with everything you need to know to start or enhance your career in web development.</p>\n\n<p><strong class=\"redactor-inline-converted\">About The Author</strong></p>\n\n<p><strong>Joris Hermans</strong> is a Senior Software Developer with more than \n10 years in programming for the web. He has worked for an online \ndirectory company who create web applications that get traffic hits of \nmore than a million page views a week. He has a lot of experience in \nbuilding large-scale web applications. He is also a proud member of the \ndartlang community and therefore he created a lot of open source \npackages in dartlang, one of which is dart force, a real-time web \nframework. </p>", 
    "end_date": null, 
    "title": "Learning Dart: Become more productive with Dart", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/861298_55a4_2.jpg", 
    "course_url": "https://www.udemy.com/learning-dart/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-27T09:56:47Z"
}