{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Are you a designer or &quot;skinner&quot; that wants to integrate things like tabs, accordion, or a datepicker into your UI but *don&#039;t* want to learn jQuery or javascript?  Then this is the course for you!!  </p>  <p>  \t  This course will guide you through:  </p>  <ul style=\"\">  \t<li>How to install jQuery UI</li>  \t<li>Exactly what snippets you need to copy and paste for each widget to work</li>  \t<li>The pattern to follow in your HTML for each widget</li>  \t<li>How you can move existing HTML content into the format for the widget</li>  </ul>  <p>  \t  Plus you will get:  </p>  <ul style=\"\">  \t<li>An awesome static HTML &amp; CSS website with a really cool look and feel that is for you to keep and use. This will give you a chance to try out each demonstration in the same website you are watching me work in.</li>  \t<li>Quizzes to test your knowledge on each widget</li>  \t<li>Additionally, the finished product that we create in this course is available to download.</li>  </ul>  <p>  \t<img src=\"https://udemy-images.s3.amazonaws.com/redactor/legacy/images/article/2013-06-24_20-30-20__jqueryuiend.PNG\" style=\" max-width:100%;\">  </p>  <p>  \t   Don’t know JavaScript? That’s okay. You can use jQuery UI Widgets with little or no experience with JavaScript. Don’t know jQuery? That’s okay too. As long as you know HTML and CSS, jQuery UI provides simple snippets that can be easily integrated into your code.  </p>  <p>  \t   In this course you will learn everything you need to know to integrate the jQuery UI Widgets into your HTML to provide a rich user experience on your website. Join me, Marie Taylor, and learn how to use jQuery UI Widgets today!  </p>", 
    "end_date": null, 
    "title": "Learn to Use jQuery UI Widgets", 
    "price": 0, 
    "instructors": "Marie Taylor", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/60792_2681_6.jpg", 
    "course_url": "https://www.udemy.com/learn-to-use-jquery-ui-widgets/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-18T21:07:25Z"
}