{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>XML stands for extensible markup language used to store and transport data. It was created to make it easier to share information across multiple platforms.</p><p>In this beginner's course you will learn the basics from creating XML syntax to a full XML document structure.<br>XML is a popular data exchange format used in a variety of places like web development, Databases and legacy systems. XML in a way acts as a bridge <br>in data exchange or interpretation.  If you have data in say a very old legacy system that you want to transfer or make available in a more<br>modern system you can use XML to translate the data so both systems can talk to each other. XML unlike HTML allows you to define your own tags thus giving you the freedom and flexibility to design your document<br>structure to suit your purpose. If you have a basic understanding of HTML and CSS XML will be easier to learn but the course is also easy and basic enough to learn.</p>\n\nThe lectures in this course include:<br><ul><li>What is XML</li><li>syntax</li><li>Root Element</li><li>Custom Tags</li><li>Nested Elements</li><li>XML Document Structure</li><li>XML Comments</li></ul>\n\n<p>This is a video based course and designed with the absolute beginner in mind. By the end of this course you will be able to create your very own basic XML document with custom tags and elements.<br>I look forward to welcoming you to the course.</p>\n\n<p>Thank You</p>", 
    "end_date": null, 
    "title": "Learn XML From Scratch: Absolute beginner course", 
    "price": "20.00", 
    "instructors": "Skill Tree", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802236_d5ef_3.jpg", 
    "course_url": "https://www.udemy.com/learn-xml-from-scratch-absolute-beginner-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T20:49:01Z"
}