{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Bring your web pages to life with <strong>user Interaction</strong>.  <strong>Create Dynamic responses </strong>using JavaScript.   Web visitors are expecting more, and that's interaction with the content.</p>\n\n<p><strong>JavaScript opens the doors to being able to create amazing effects and being able to deliver that expected experience.</strong></p>\n\n\n\n<p>I'm a JavaScript developer, having worked on and created hundreds of websites.  I'm going to show you how to use JavaScript to access your web page content and make it dynamic.</p>\n\n\n\n<p>This course is designed for<strong> beginners </strong>who want to see <strong>real world examples</strong>.  I show you how you can use JavaScript and your imagination to make amazing things online.  All of the source code is included.   I also share resources that are used in the course.  Tips, and coding methods are also included.</p>\n\n\n\n<p>In this course you will learn to make three <strong>projects from scratch,</strong> using JavaScript to create useful code snippets that can be reused in the real world.</p>\n\n\n\n<p>Topics that are covered include Functions.  <strong>Introduction to functions</strong>, how JavaScript compiles your code and the difference between declaration functions and expressions. Functions are so important to understand when it comes to creating interaction.  They save time and can accelerate your development process.  Using user input and accessing it in JavaScript.  Once you get content into JavaScript you can then apply your logic to output endless possibilities.</p>\n\n\n\n<p>The DOM, document object model is available and accessible using JavaScript.  The DOM opens up full access to anything that the browser is able to present.  Learning how to use the DOM brings your JavaScript to the next level.  Accessing the DOM makes it easy to do. Learn how to access various elements, any piece of content within your webpage.   Event listeners are exactly what you need to add that user interaction.  There are many options with event listeners, and when used with the values you get from the web content you can really bring your content to life.   </p>\n\n\n\n<p>We cover how to list out objects, arrays and loops.   How to update HTML and Text on your webpage dynamically.   Using Math in JavaScript allows you to make calculations and even create random values.   </p>\n\n\n\n<p>Next we show you how to access your HTML styling and manipulate it.  Bring CSS styling together with JavaScript, changing the look of your web content customized for each user. Add cool effects for your users.</p>\n\n\n\n<p>DOM and accessing HTML element attributes. In this project understanding how to dynamically use JavaScript to create elements in HTML, update attribute content, and .append new elements into your HTML code.  We teach you how to create a dynamic shopping list, where you can add items and even click to remove those newly created elements.   </p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Learn JavaScript Dynamic Interactive Projects for Beginners", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/760306_cabf.jpg", 
    "course_url": "https://www.udemy.com/learn-javascript-dynamic-interactive-projects-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-12T02:56:39Z"
}