{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>One of the most powerful server-scripting languages requires an equally powerful course to help break down the tricky concepts of Object Oriented PHP in a step by step manner to help you master OOP PHP.</p>    <p>Don’t just be good at PHP, instead be a ninja by learning how objects and classes combine to form simple, brilliant software. Leave behind old complicated courses and opt for the course that gets your hand dirty by not only teaching you the theoretical aspects of OOP PHP, but also gets you ready for the physical aspects as well.</p>    <p>Here’s how object oriented programming blends with PHP to create something simple and beautiful.       </p>    <p>The idea behind object oriented programming or OOP is that it revolves around objects instead of actions. So, instead of manipulating the logic behind the object to change something, you instead manipulate the object itself. Let’s make it simpler – in OOP PHP, similar items can be clubbed as one object. This means codes that are similar are placed in one object. So, in case you wanted to change the items or modify them in any manner – you can simply modify or call the object (this will change or call everything that is under this object). You can also add subclasses, which share the characteristics of the object. This helps when you constantly require calling certain classes for modification.</p>    <p>This course was designed to simplify the process of understanding OOP PHP in the easiest and most accurate manner. The OOP PHP tutorial breaks down the basics of PHP coding, how it works with OOP and even how to combine both to effectively create a website.</p>    <p>The course starts by covering simple concepts such as classes, objects, methods, properties, MVC, MySQL, Data Abstraction, Data Binding, etc. Following the fundamentals, you’ll then progress on to more advanced topics before you can use everything you’ve learned to create a functional website with OOP PHP.</p>    Here’s a course that simplifies your life and teaches you one of the greatest paradigm changes made to the powerful PHP language. So, enroll now and see how OOP PHP can change your life.", 
    "end_date": null, 
    "title": "Learn Object Oriented PHP By Building a Complete Website", 
    "price": 0, 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/772618_cdee_5.jpg", 
    "course_url": "https://www.udemy.com/learn-object-oriented-php-by-building-a-complete-website/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-24T06:16:11Z"
}