{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Welcome to our introductory course to using <strong>JSON JavaScript object notation</strong></p><p><strong>Learn to use AJAX to connect and bring JSON data into your JavaScript!</strong></p><p> it's a lightweight data interchange format that is quickly becoming the default format for data exchange on internet today!</p><p> JSON is extremely popular in web applications because it's lightweight, designed to be  language of independent and easy to read and write transfer data easily between server and client.</p><p><strong>JSON is lightweight, language independent and easy to read and write</strong></p><p>JSON is better than XML and more popular!</p><p>This course covers creating and using JSON</p><p> the course of instructor has over 15 years of web development experience and will show you how to use JSON.  Experienced using JSON within many applications its a preferred way to exchange data between applications.  You'll see why Jason is so popular.</p><p>When you start using JSON you are never going to look back.</p><p><strong>Easily exchange data between client and server applications.</strong></p><p>JSON Course covers everything from start to finish to get you using JSON quickly!</p><ul><li>Learn the basics of JSON </li><li>JSON structure data of delivery</li><li>basics of JavaScript object data</li><li>using Json data in your HTML pages</li><li>object data from JSON</li><li>Learn how to access external files</li><li>output object data and return data</li><li>Access return data</li><li>the of looping return data</li><li>creating Dynamic PHP JSON</li><li>contact access to PHP Json files</li><li>and a whole lot more</li></ul><p><strong>JSON is a easy to use and built for storing and exchanging data.</strong></p><p> Everything you need to get started using JSON is included but then this course.</p><p>Resources, source files and top links are also included.</p><p>Let's get ready to learn JSON and AJAX</p>", 
    "end_date": null, 
    "title": "Learn to use JSON", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/788514_3fd3_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-use-json/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T14:58:41Z"
}