{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Hi,thanks for signing in my course.</p><p>So Do you code with PHP language or own a website?If so this course is perfect for you!</p><p>Keep Your PHP Website Safe and Secure With Simple, Practical Techniques that Anyone Can Implement.<br></p><p>The Open Web Application Security Project has released a useful document that lists what they consider are the Top 10 security vulnerabilities in MOST PHP web applications.</p><p>PHP language grows very quickly rather than engineered. It very easy and universal to write insecure PHP applications. If you want to safely use the PHP language and writing secure PHP applications , you need to know all of its pitfalls.</p><p>And if you're site is compromised, it could be contributing to this problem!</p><p>Having your site compromised could result in:</p><ul><li>Loss of income</li><li>Damage to your reputation</li><li>Stolen data or information</li></ul><p>That's not even considering the cost and effort required to clean up a security problem.</p><p>PHP Security doesn't have to be that hard. With just some simple understanding of the risks and steps that you can take to mitigate them, you can prevent over 99% of all potential attacks.</p><p>This course will help you put those numbers in your favour!</p><p>Students will start by learning about the most common forms of PHP Website attack.And then We will tell you what the consequences can be if your website is not well protected. You will move into studying the filtering and validation functions in PHP, and why you need to take advantage of them. We will teach you some skills how you can protect your website against the OWASP vulnerabilities and how to protect file uploads. Finally, this Course will teach you how to protect against SQL,Mail and File injection attacks, and covers topics such as database escaping, using prepared statements, and protecting a MySQL database.<br><br>In this course,we will teach you many skills on how to avoid these vulnerabilities and protect your PHP web applications. <br></p><p>Let's get started.</p><p><span></span></p>", 
    "end_date": null, 
    "title": "Learn PHP Security With OWASP Top 10", 
    "price": "35.00", 
    "instructors": "Dream Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777260_7164.jpg", 
    "course_url": "https://www.udemy.com/learn-php-security-with-owasp-top-10/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T01:11:38Z"
}