{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">HTML5 </strong>is the latest evolution of web technology, encompassing decades of research and development. It has matured to the point that<strong style=\"\"> it can be used to create stunning, responsive and truly interactive websites, apps and games</strong>. Plus, anything written in HTML5 is <strong style=\"\">inherently cross-platform</strong>, so becoming proficient in the use of HTML5 is immeasurably valuable to you as a web, app, or game developer.</p><p style=\"\">This HTML5 introductory course teaches you all the fundamentals of working with the three cardinal technologies of the modern web: <strong style=\"\">HTML</strong>, <strong style=\"\">CSS </strong>and <strong style=\"\">JavaScript</strong>. By the end of the course, you will:</p><ul style=\"\"><li style=\"\">Understand and be able to use all of the most important and frequently used HTML tags.</li><li style=\"\">Have a working knowledge of CSS.</li><li style=\"\">Be able to use JavaScript to create dynamic content, interactivity and functionality on your web pages and sites.</li><li style=\"\">Be able to implement form validation using JavaScript</li></ul><p>There really is <strong style=\"\">no quicker way to learn these 3 core technologies of the web (which constitute HTML5)</strong>, so why wait, sign up and start learning today -- you won&#039;t regret it!</p>", 
    "end_date": null, 
    "title": "Learn HTML5, CSS and JavaScript Basics from Scratch", 
    "price": "20.00", 
    "instructors": "Richard Sneyd", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450332_23ab_4.jpg", 
    "course_url": "https://www.udemy.com/learn-html5-css-and-javascript-basics-from-scratch-build-websites-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T14:40:52Z"
}