{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<h5>A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p>HTML5 is the breakthrough update to web development standards that  allows more control over website content and creativity, including the use of  complex animation, video and audio. This HTML 5 Tutorial Course will help you  understand basic web development techniques and standards, starting from  scratch and showcasing the many powerful multimedia features the latest  revision brings to the table. Veteran design professional and technology  trainer John Ulliman starts with the basics of learning HTML5 that any beginner  will need to know and gradually progresses through working with images, layout,  interactive forms and high quality video. In addition to graphic design and  code considerations, John also looks at SEO, hosting and best practices that  will ensure your websites&#039; cross-platform compatibility and long-term success.  With 66 lessons and accessible sample code, you&#039;ll learn a wide range of skills  you can immediately use with your existing site or a completely new one.</p><h5>What You Will Learn</h5><p>●&nbsp;  Core principles of HTML and CSS required to build a  functional website with no prior experience.</p><p>●&nbsp;  New enhancements and capabilities unique to HTML5 that  allow impressive visual effects and multimedia playback options.</p><p>●&nbsp;  Layout and design principles that ensure a positive user experience  and encourage site interactivity</p><p>●&nbsp;  How to create flexible, compatible site code that adheres  to professional standards.</p><h5>Who Should Take This Course</h5><p>●&nbsp;  Anyone who wants to create their first website the right  way, using the latest coding standards and layout techniques.</p><p>●&nbsp;  Anyone interested in learning HTML5 to update or upgrade  their current website to meet HTML 5 standards and capabilities.</p><p>●&nbsp;  Anyone looking to design sites that offer rich media and  interactivity experiences to users on mobile devices as well as computers.</p><h5>What People Are Saying</h5><p><em style=\"\">&quot;While I made a  site with WordPress in the past I wasn&#039;t happy with the lack of  control...knowing the code has actually made things easier. Thanks!&quot; ~C  Watkins</em></p><p><em style=\"\">&quot;Was definitely  glad this course had info on CSS as well as HTML...now I understand how a good  layout makes all the difference.&quot; ~Pete Farrell</em></p><p>                                                    </p><p><em style=\"\">&quot;I absolutely  love that I can have streaming video on my page without Flash...simple and  effective...thanks very much.&quot; ~P.J. Tancibok</em></p>  ", 
    "end_date": null, 
    "title": "Learn HTML5 At Your Own Pace. Ideal for Beginners", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/14571_3e04_8.jpg", 
    "course_url": "https://www.udemy.com/learning-html5/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-02-28T00:31:06Z"
}