{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"><strong style=\"\">Learn </strong><strong style=\"\">To  Program JavaScript </strong>(<em style=\"\">i<em style=\"\">n  ten easy steps</em></em>)&nbsp;is suitable for&nbsp;<em style=\"\">beginner&nbsp;</em>programmers.  Step-by-step it explains how to write JavaScript code to run in a web browser  on Windows, Linux or Mac OS X.</p>    <p style=\"\"><strong style=\"\">JavaScript </strong>is the language of the web. If  you need to program web sites to run on desktop computers or mobile devices,  you have to know JavaScript.</p>  <p style=\"\">This  course explains all you need to know in order to write JavaScript and make  sense of other people&rsquo;s JavaScript code. Every step of the way you can follow  along with ready-to-run code in in short, easy-to-understand JavaScript  programs.</p>    <p style=\"\">You  will begin by learning the core features of programming &ndash; variables, functions  and data types. You will move on to learn about specific capabilities of  JavaScript &ndash; how to use it to automate web pages, hide email addresses, swap  stylesheets interactively; how to load XML data to create so-called AJAX  applications, how to animate images and use some of the drawing capabilities of  HTML5.</p>  <p style=\"\">The  sample projects are all provided ready for you to download, run and modify. The  course also includes a course eBook, <strong style=\"\">The  Little Book Of JavaScript</strong>, that provides even more information on the  topics being discussed.</p>    <p style=\"\">The course instructor,<em style=\"\">Huw  Collingbourne</em>, is Director of Technology with SapphireSteel  Software, a company that specialises in Visual Studio development tools for  professional programmers. Founder of&nbsp;<a href=\"http://www.bitwisecourses.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Bitwise Courses</a>&nbsp;&nbsp;&ndash; producers of multimedia instruction  courses &ndash; Huw is one of the top-selling programming instructors on Udemy,.</p>    <p style=\"\"><strong style=\"\">Learn </strong><strong style=\"\">To  Program JavaScript </strong>(<em style=\"\">i<em style=\"\">n  ten easy steps</em></em>)&nbsp;is  the fastest and simplest way to learn to program web pages like a pro.</p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Learn To Program JavaScript (in ten easy steps)", 
    "price": "20.00", 
    "instructors": "Huw Collingbourne", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37684_d762_9.jpg", 
    "course_url": "https://www.udemy.com/learn-to-program-javascript-in-ten-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-23T10:49:29Z"
}