{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><p style=\"\">In this training course, expert Infiniteskills teaches you the basics of programming with JavaScript, the worlds most used programming language. The tutorial is designed for the absolute beginner - no prior JavaScript programming experience is required in order to get the most out of this video training.</p><p style=\"\">You will start with learning what programming is, and specifically, what JavaScript is, how it it used, and its limitations. You will discover variables and data types, and how to take input and create output. The course covers conditions, loops, arrays, sorting, functions, paramaters and debugging. You will even learn advanced concepts such as OOP, string manipulations, regular expressions and other programming patterns. Because JavaScript is so tightly integrated with browsers, you will also learn some HTML5, CSS, DOM (Document Object Model) programming, event handling and how it all works together!</p><p style=\"\">By the conclusion of this JavaScript programming tutorial, you will have an in-depth grasp of the capability of JavaScript, and you will understand how to create and deploy solid JavaScript programs for your website projects. Working files are included to allow you to work alongside the author using the same files that references throughout the training course.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Learning JavaScript Programming Tutorial. A Definitive Guide", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/30318_8c66_10.jpg", 
    "course_url": "https://www.udemy.com/programming-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-22T11:39:19Z"
}