{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The increasing importance of smartphones has resulted in a high demand for responsive websites and apps that work on smartphones and tablets of all sizes. The surge in smartphones and tablets have paved the way for many developers to display their creative side with these apps and websites.</p><p>However, creating a responsive website is not exactly the easiest task. It requires learning numerous languages for different platforms and also having to constantly duplicate and modify the coding based on the browser or platform on which the website is going to be displayed.</p><p>This frustration has been the force behind the development of <strong>jQuery Mobile.</strong></p><p>jQuery Mobile, created by the jQuery Project, is a JavaScript library that eliminates the need for developers to code in different languages for different platforms. Instead, it works by creating a seamless viewing experience using the easiest coding language out there (jQuery), no matter which platform.</p><p><strong>JQuery Mobile is a platform that allows developers to create responsive websites and apps that can work on a variety of smartphones and tablets, drastically reducing the amount of coding required to achieve cross-platform compatibility.</strong></p><p>Here’s your chance to compete with the big coders and stand out from the crowd. Develop responsive apps and websites using jQuery at half the time, so you can focus on what really matters – your creativity.</p><p>Our course has been designed by experts to help you master jQuery Mobile. The jQuery Mobile tutorial will start from the very beginning, covering basic concepts and progressing to more advanced concepts. The hands-on jQuery mobile course will teach you how to efficiently use the most flexible front-end framework to help you design mobile-friendly and seamless websites.</p><p>The course will cover topics such as <strong>basic jQuery, HTML5 docs, jQuery in mobile browsers, jQuery Mobile styling, navigation and transitions, jQuery lists and buttons. Forms, Layouts, Event handlers,</strong> and so much more. At the end of this course, you will also create a fully-functional project to get some practical experience.</p><p>Additionally, this is also your chance to learn the brand new jQuery Themeroller for Mobile. A theme customizer that allows you to easily design your webpage as well as change its colors and themes with a few simple clicks.</p><p>With so much to learn, what are you waiting for? Enroll now and let’s create websites at the drop of a hat!</p>", 
    "end_date": null, 
    "title": "Learn jQuery Mobile from Scratch ", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758190_6c33.jpg", 
    "course_url": "https://www.udemy.com/learn-jquery-mobile-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T10:05:37Z"
}