{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Includes information on the next version - AngularJS 2.0!</strong></p>  <p>  \t                                                                                                                                                                                                                                                                                                                                                                                                        Knowing AngularJS can get you a job or improve the one you have. It's a skill that will put you more in demand in the modern web development industry, and make your web software life easier, that's why it's so popular and backed by Google.  </p>  <p>  \t                                                                                                                                                                                                This course will get you up and running quickly, and teach you the core knowledge you need to deeply understand and build AngularJS applications - and we'll build a single page application along the way<em>.</em>  </p>  <p>  \t                                                                                                                                                                                            We'll design <em><strong>custom services</strong></em><strong>, </strong>build <em><strong>custom directives</strong></em>, understand <strong><em>two-way binding</em></strong>, design a weather forecast app as a <strong><em>single page application</em></strong>, and <strong>lots more</strong>. Both starter and finished source code is provided as we go.  </p>    <p>  \t<em><strong>Reviews</strong></em>  </p>  <p>  \t<em>\"Best course I have ever seen\"</em>  \t<em>\"Best intro to AngularJS on Udemy\"  \t</em><em>\"</em><em>A fresh way of teaching AngularJS\"  \t</em><em>\"One of the best courses on Udemy that i took if not the best\"  \t</em><em>\"Best teacher I have had on the internet by far\"  \t</em><em>\"I...have taken lots of angular courses and I think this is the best one so far\"  \t</em><em>\"The best teaching style I've seen so far\"</em>  </p>    <p>  \t                                                                                                                                                                        If you are new to AngularJS, or if you've been working to learn it but sometimes feel like you still don't quite 'get it', this is the AngularJS course for you! <strong>To learn AngularJS you have to understand it.</strong>  </p>  <p>  \t                                                                                                                                                                                                                                                                                                                                                                      I've built the course that I would have wanted to take when I was learning AngularJS. A course that explains the concepts and how they're implemented in the best order for you to learn and deeply understand them.  </p>  <p>  \t                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  In this course you will:  </p>  <ul>  \t<li><strong>Learn how AngularJS works, covering subjects like <em>directives, </em><em>dependency injection, two way data binding, the digest loop, watchers</em>, and more.</strong></li>  \t<li><strong>Learn fundamental Javascript and HTML principles that are used by AngularJS, such as <em>custom attributes, loosely typed arrays, the hash, and the event loop</em>.</strong></li>  \t<li><strong>Code <em>custom services</em>.</strong></li>  \t<li><strong>Design <em>custom directives</em>, understanding concepts like <em>compile, link, and scope</em>.</strong></li>  \t<li><strong>Build a <em>single page application</em> using AngularJS.</strong></li>  \t<li><strong>Keep up with the latest on the next version of <em>AngularJS 2.0</em>!</strong></li>  </ul>  <p>  \t                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            AngularJS doesn't have to be hard to learn. The biggest mistake most coding tutorials make is expecting someone to learn simply by imitating others' code. Real world situations are never exactly like the tutorial.  </p>  <p>  \t                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            I believe the best way to learn is to understand how a tool works and what it does for you, look at examples, and then try it yourself. That's how this course is built, with the goal to help you both <strong>learn </strong>and <strong>understand </strong>AngularJS.  </p>  <p>  \t<em>Note: In this course you'll also get <strong>downloadable source code</strong>. You will often be provided with 'starter' code, giving you the base for you to start writing your code, and 'finished' code to compare your code to.</em></p>", 
    "end_date": null, 
    "title": "Learn and Understand AngularJS", 
    "price": "30.00", 
    "instructors": "Anthony Alicea", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289230_1056_16.jpg", 
    "course_url": "https://www.udemy.com/learn-angularjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-27T23:57:52Z"
}