{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t          This course is designed to take you from knowing absolutely nothing of the web and websites to knowing all the ins and outs of web development and even a little more.  </p>  <p>  \t    We will be handling some basic start offs to the web and tools to use, then we will plunge into HTML and CSS, starting from scratch. After you have mastered HTML and CSS we will handle more dynamic stuff like CSS3, <strong style=\"\">how to create responsive websites</strong> and also some <strong style=\"\">tips and tricks to SEO</strong>. We will do all of this in just 10 hours of content!  </p>  <p>  \t    The content will not only include video tutorials but also nicely designed info graphs to help you learn better. I will also give you the source code of each assignment and on completion a certificate with a coupon to &quot;how to design websites&quot; tutorial. So if you want to become a web developer and create awesome websites to sell to clients and make money, then sign right up! (note as time goes on i will add extra videos to help you grow more in the industry at no extra cost)  </p>  <p>  \t      Easily Learn How To Create Dynamic Websites With HTML and CSS  </p>  <ul style=\"\">  \t<li>Learn how the web works and what tools web developers use</li>  \t<li>Easily learn what HTML is and how to code it</li>  \t<li>Easily learn what CSS is, how is works and how to code it</li>  \t<li>Understand what is responsive websites</li>  \t<li>Learn how to create responsive websites</li>  \t<li>Learn what SEO is and techniques to use</li>  </ul>  <p>  \t    After completing my course you will not only be able to create dynamic, responsive working websites but you will have the full understanding to web development. This will enable you and path your way to learn further into other more complex languages like Javascript and Jquery.  </p>  <p>  \t    HTML and CSS is after all the most important languages and also the foundation to web development.  </p>", 
    "end_date": null, 
    "title": "Learn how to create dynamic websites with just HTML and CSS", 
    "price": "25.00", 
    "instructors": "Bernard Myburgh", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355624_ac61_2.jpg", 
    "course_url": "https://www.udemy.com/learn-html-and-css-from-scratch-bonus-responsive-websites/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T21:25:39Z"
}