{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\">Start becoming a technical marketer right now.</strong><br style=\"\"></p><ul style=\"\"><li>Start writing and interacting with other people&#039;s code on your computer</li><li>Start sharing code with other marketers or your company using Git and Github</li><li>Start talking about web technology on the same level of developers</li></ul><p>This course is going to cover a variety of basic areas that are core to you becoming a technical marketer. If you want to start hacking together clever solutions to problems or start talking more intelligently about technology, this is your launch point. This is your foundation to keep learning on your own and through other technical marketing courses.<br style=\"\"></p><p><strong style=\"\">In this course, you will:</strong></p><ul style=\"\"><li>Learn how web tech works so you can talk about it more intelligently with developers</li><li>Learn how apps, software, and programs are built</li><li>Learn how a site like Facebook works on the backend</li><li>Learn how to navigate your computer using text entry in the Terminal</li><li>Learn how to access common programming languages like Python</li><li>Learn how to add new libraries and functionality to your system</li><li>Learn how to share and download code using Git and Github</li><li>Learn to be a more technical marketer</li></ul><p>As a bonus, you&#039;ll also receive a free copy of our eBook, &quot;Become a Technical Marketer&quot;</p><p>Once enrolled, you will have access to this course for the rest of your life. You will always be able to come back to this class to review material or to learn new material. Try this course for yourself and see how quickly and easily you can develop some basic programming skills and understanding.</p>", 
    "end_date": null, 
    "title": "Learn the Basics of Programming for Marketers", 
    "price": "20.00", 
    "instructors": "Justin Mares, Nathaniel Eliason", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460056_0d85_4.jpg", 
    "course_url": "https://www.udemy.com/basic-programming-for-marketers/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-26T21:35:53Z"
}