{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>What is the course about?</strong></p><p>The course is about <strong>WordPress theme development</strong> using Pinegrow WP a desktop app for Windows, Mac and Linux that lets you build responsive websites faster with live multi-page editing, CSS styling and smart components for Bootstrap, Foundation, AngularJS and build WordPress themes on a totally innovative way.</p><p><strong>Keywords</strong></p><p>WordPress, theme, HTML, Bootstrap, development, design, PHP</p><p><strong>What kind of materials are included?</strong></p><p>Videos only</p><p><strong>How long the course take to complete?</strong></p><p>About 2 hours to watch all the videos and 1 week to master all the techniques, depending on the initial knowledge.</p><p><strong>Why take this course?</strong></p><p>To experiment an innovative way of creating WordPress themes</p><p><strong>How is the course structured?</strong></p><p>In this course, you will <strong>learn</strong> :</p><ol><li>How to create a basic WordPress theme in less than 20 minutes</li><li>How to create a basic WordPress theme structure</li><li>How to create a standard WordPress theme structure including header and footer</li><li>How to activate your theme in WordPress</li><li>How to include site title, site description and links in your templates</li><li>How to import HTML content from WordPress into your HTML template</li><li>How to add navigation menus</li><li>How to prepare your content to create a WordPress Loop</li><li>How to create a WordPress Loop</li><li>How to create and use sidebars and widgets</li><li>How to create the most common WordPress templates files</li><li>How to create the SEARCH template</li><li>How to create the SINGLE template</li><li>How to create a screenshot for your WordPress theme</li><li>How to include links in your templates</li><li>How to use the Master Page feature in Pinegrow</li><li>How to make your theme ready for Jetpack plugin</li><li>How to create WordPress Customizer ready components</li></ol>", 
    "end_date": null, 
    "title": "Learn how to create a WordPress theme using Pinegrow", 
    "price": 0, 
    "instructors": "ARNOUD Emmanuel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563668_a4d4_5.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-create-a-wordpress-theme-using-pinegrow/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T13:45:44Z"
}