{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>HTML and CSS are the easiest and most important languages for a new learner to get skills in a short time. Both the languages will help you in this course to create, design and code website quickly, easily and with confidence, if you are keen to develop the webpage.<br></p><p>By practicing given steps and following our step by step approach, you will get your desired skills.</p><ul><li>HTML Basic to Advance</li><li>All Tags That Can Be Used In a Web Page.</li><li>Coding an HTML Page</li><li>Parent/Child Structure</li><li>CSS Basics to Advance</li><li>ID Selectors</li><li>Class Selectors</li><li>Descendant Selectors</li><li>Styling all Tags and Elements in a Web Page.</li><li>Use of Images, links, lists and much more............................</li></ul><p>In the modern age, the web has made the world a global village.There are millions of websites and all the websites are basically made up of two the most important languages.HTML and CSS. Hundred of programming languages are used to make the website and web applications, but the two most important to learn from them are HTML and CSS.</p><p>In fact, even people who plan on allowing someone else to build their website should have basic concepts of both HTML and CSS. In this way, you can analyze the hidden things behind the scenes to make the improvement on your own website without having to always rely on others.</p><p>Contents:</p><p>Initially, This course consists of 69 lectures and approximately 4 hours of content.From beginning to end you will grasp the basic and advanced concepts of HTML and CSS. This course is designed in such a way that it binds you to practice and do code.code and code and at the end you will be able to design and code a website without any assistance. Further, for any assistance and guidance, we are always here to help you.</p><p>Overview:<br></p><p>You will start learning all about HTML and CSS from beginning. You have to get the complete understanding of what HTML and CSS and what they do. During the course, you’ll build several web pages and websites that take what it is that you’ve learned and apply it to real-world exercises to help cement the skills.<br></p><p>Everyone from beginners, IT professionals, programmers, web designers to business owners can benefit from learning HTML and CSS.Learn to begin building your own static web page. If you plan on becoming a web programmer or a web designer yourself, HTML and CSS are the first two languages you’ll need to learn. In fact, HTML is required for anyone that wants to get into web development industry from any angle.</p>", 
    "end_date": null, 
    "title": "Learn and Earn with HTML & CSS", 
    "price": "20.00", 
    "instructors": "Khawar Zaman Software Engineer, Muhammad Imran Abbasi", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/704732_f530_3.jpg", 
    "course_url": "https://www.udemy.com/learn-and-earn-with-html-css/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-23T12:53:19Z"
}