{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Turn your ordinary data into extra ordinary using D3js. What is D3js? Well it is the answer to all you data presentation needs. It is a vast JavaScript library that allows users to easily make data visualizations. The open source JavaScript library allows users to apply any pre-built data visualizations and create interactive graphics in common web browsers. It uses the widely implemented SVG, HTML5, and CSS standards.</p>  <p>Our D3js course follows a structured and practical approach to understanding D3js and the philosophy behind it. The course breaks down complex concepts and makes it easier to understand and master D3js. With topics such as Frontend Development, D3 Library, JQuery, Data Visualization, JSON, Array &amp; Objects, SVG – Scalable Vector Graphics, Transitions, Data Scaling, Data Binding, and Data Display this course offers a complete training program.  </p>  <p>The course comes with detailed explanations along with many easy to understand coding examples.</p>  <p>The course will cover: </p>  <p><strong>Getting Started with D3 – Set up your system and start building D3 apps. </strong></p>  <p><strong>Basic Selecting &amp; Binding – Learn all about the selection and the Binding tools.</strong></p>  <p><strong>SVG – Understand the concepts behind Scalar Graphics library. </strong></p>  <p><strong>Using Scales Transitions &amp; Display – Learn to perform complex tasks for scale transition and Display. </strong></p>  <p><strong>Scatterplot Project – Put your ideas to action by building a real world project.</strong></p>  Get started and learn this powerful technology from ground up.  Learn using project based pedagogy and start developing powerful applications using D3js", 
    "end_date": null, 
    "title": "Learn to Build Web Apps using D3JS", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680180_ebd6.jpg", 
    "course_url": "https://www.udemy.com/learn-to-build-web-apps-using-d3js/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T04:42:13Z"
}