{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn to develop great web applications using one of the most popular open source PHP framework. <strong>Laravel </strong>has become one of the hottest frameworks and a sought after skill for PHP developers. Its clean and elegant syntax coupled with the powerful toolkit makes it an ideal choice for modern web developers. This powerful technology boast of features such as clean routing, elegant queue library,  ORM ,simple authentication and a large developer community. </p><p>You will learn to program using the latest Laravel version and will go through all the underlying concepts which make this framework so cool. This course has been designed to provide a practical training in Laravel and will take you from a newbie to an expert developer in no time.</p><p>The course will help you learn:</p><p><strong>How to use Laravel for your web applications?</strong></p><p><strong>How to Migrate your App to MVC compliant framework?</strong></p><p><strong>How to use the Modular Packaging System?</strong></p><p><strong>How to use the ORM and the Query Builder?</strong></p><p><strong>Concepts behind restful controllers?</strong></p><p><strong>How to use templating engine?</strong></p><p><strong>How to work with Routes and Controllers?</strong></p><p>Learn all this and create a full fledged working web application along the course to assimilate all your concepts. If you want to learn Laravel just join us and start developing from today. </p><p><br></p>", 
    "end_date": null, 
    "title": "Learn to Build Web Apps using Laravel Framework", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661878_126c.jpg", 
    "course_url": "https://www.udemy.com/learn-to-build-web-apps-using-laravel-framework/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T08:46:39Z"
}