{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In this course you'll learn the basics of <strong class=\"redactor-inline-converted\">HTML</strong>, <strong class=\"redactor-inline-converted\">CSS </strong>and <strong class=\"redactor-inline-converted\">responsive web design</strong>. Throughout the course, you'll be building a <strong class=\"redactor-inline-converted\">professional looking company website</strong>, designed for both desktop computer and mobile phones.</p>\n\n<p>This is a complete re-make of our hugely popular course created in 2013 and taken by over 40,000 students “Programming for Entrepreneurs - HTML and CSS”.</p>\n\n\n\n\n\n<p>Why is learning HTML so important?</p>\n\n<p>1. Learning HTML and CSS are good first steps on the road to become a software developer. A rewarding and high demand profession in the innovation economy.</p>\n\n<p>2. If you are not interested in becoming a professional coder, this course will help you improve your communication skills and understanding software developers.</p>\n\n<p>3. <strong class=\"redactor-inline-converted\">It's fun</strong>. To me, there are few things more rewarding than being able to create my own websites, mobile apps and games.</p>\n\n\n\n\n\n<p><strong>What you will learn in this course:</strong></p><ul><li>How to create a stunning, responsive company website</li><li>Understanding the role of HTML and CSS in web development</li><li>HTML tags to make sleek static web pages with links and images</li><li>Creating forms, the most popular way to capture user input on the web</li><li>HTML lists</li><li>Display your data with tables</li><li>Selecting and modifying elements with CSS</li><li>Arrange your content with the CSS Box Model</li><li>Typography and Google Fonts to make professional websites</li><li>Responsive web design principles to create a responsive page</li></ul><br>", 
    "end_date": null, 
    "title": "Learn to Code in HTML and CSS - 2016 Edition", 
    "price": "20.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/857270_5861.jpg", 
    "course_url": "https://www.udemy.com/learn-to-code-in-html-and-css/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-23T07:49:11Z"
}