{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"></strong></p><p><em>LATEST Updated: Tuesday, June 21, 2016</em></p>\n\n<p><strong class=\"redactor-inline-converted\">Do you have a business and don’t have a website? If your answer is yes, it’s almost as if your business doesn’t exist at all. </strong><br></p>\n\n\n\n<p>Having a website means customers are always able to find you anytime, 24/7. even at weekends and evenings your business is still accessible. It offers the customer convenience as they are able to access the information they need in the comfort of their own home, with no added pressure to buy. In general, it is much easier to click a few buttons online than to make the trip to a physical store to hunt someone down for information. It also prevents little annoyances such as waiting in queues.<br></p>\n\n\n\n<p>You may already think of owning a website for your business but you haven't because you don't have money to pay someone to do it for you, or don't have experience to do it yourself. </p>\n\n\n\n<p>If you search on the internet for \"custom website design\" you will find companies offering to create and design a website for $400 to $2000 just to have a website online without having the ability to update, change your website design even. <br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Web Development Solution</strong> - A super easy and simple drag and drop way to design a professional website. This course will show you how to use an awesome online website builder to design the most professional looking site possible, even a 12 years old can use this tool to create awesome websites. <br></p>\n\n\n\n<p>you will learn everything you need to build amazing, responsive websites that can be browsed through computers, mobile phones, tablets without losing the beauty of the page, You can do all these things in minutes with this simple website creator.<br></p>\n\n<p><br></p>\n\n<p><strong>The best part of taking this course!</strong></p>\n\n<p>You can even start building websites for others and start generating more money.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Is this course for me?</strong><br></p>\n\n\n\n\n\n\n\n<p>Do you have your own business, course, event, or whatever that doesn't have a website yet and you don't know where you can start? <strong class=\"redactor-inline-converted\">This is the course for you. </strong>At the conclusion of the course, you will have a <strong class=\"redactor-inline-converted\">functional </strong>and <strong class=\"redactor-inline-converted\">friendly</strong> website with <strong class=\"redactor-inline-converted\">NO CODING REQUIRED. </strong>I strongly encourage you to at least try it!</p>\n\n\n\n\n\n\n\n<p>If you find that it's not for you, there is a 30-day money back guarantee, :) </p>\n\n\n\n\n\n<h4>What is the target audience?</h4>\n\n\n\n\n\n<ul><li>Non-technical, never-made-a-website before people</li><li>The course is not suited to experts who want to work with HTML, Javascript etc.</li><li>Anyone who wants to develop their own website in order to to sell a product, sell an e-book, or get your business online</li></ul>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Learn To Build A Professional Website In One Night! - Weebly", 
    "price": "20.00", 
    "instructors": "Ali Mourchid", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/849206_cf13_4.jpg", 
    "course_url": "https://www.udemy.com/build-a-professional-website-for-free-in-one-night/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T18:11:19Z"
}