{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn the basics of HTML5 and CSS3 along with practical project examples i.e creating a complete responsive website using HTMl5 &amp; CSS3. </p><p><strong>Learn to code in HTML5 &amp; CSS3</strong> </p><p>The main goal of this course is to code easily in HTML5 &amp; CSS3 with practical examples, the basics includes some of the following: </p><ul><li>HTML5 Semantic Tags </li><li>HTML5 Layout Structure </li><li>HTML5 Basic Tags </li><li>HTML New Attributes </li><li>CSS3 Properties </li></ul><p>You'll also learn building real time projects in this course including a complete responsive website in HTML5 &amp; CSS3. </p><p><strong>Course Content Overview </strong></p><p>This course is suitable for both beginners and intermediate users who want to master HTML5 and CSS3. With over 66 lectures and 7 hours of content, this course will go through the very basics of HTML5 new tags and CSS3 properties, and at the end, you'll learn how to build a complete project using the simple tags you learned from the basics. Those who want to become familiar with modern day web development &amp; web designing techniques using HTML5 &amp; CSS3, they can get advantage of this course. </p><p>In addition to the content of this course, we'll also give you support throughout the course, if you have any question during learning the course then you can easily ask that in the discussion forum, and we'll be there to answer you as soon as possible.</p><p><br></p><p><strong><em></em></strong></p>", 
    "end_date": null, 
    "title": "Learn HTML5 & CSS3 to Build Responsive Websites", 
    "price": "20.00", 
    "instructors": "Abdul Wali, Shahzaib Kamal", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635260_20a9_2.jpg", 
    "course_url": "https://www.udemy.com/html5-css3-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T21:01:53Z"
}