{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Do you already know PHP and you're developing a website that needs <strong>user registration and login</strong>? By taking this course you'll learn how to develop a system <strong>from scratch</strong> where users can<strong> sign-up for a new account</strong>, <strong>login</strong>, and be provided with <strong>personalised content</strong>.</p>\n\n<p>This course will teach you how to add the following features to your PHP website or web application:</p>\n\n<ul><li>User sign-up, including account activation by email</li><li>Login and logout</li><li>Protecting content for logged-in users only</li><li>\"Remember me\" functionality: remember the login even after closing the browser</li><li>Secure password reset: let the users reset their own passwords when they forget them</li><li>User administration: create, view, edit and delete users.</li></ul>\n\n<p><br></p>\n\n<p>Additional lectures include improving the usability of the site with new <strong>HTML5</strong> and <strong>JavaScript</strong> techniques.</p>\n\n<p>Taught by experienced web application developer and online educator <strong>Dave Hollingworth</strong>, this course takes you <strong>in easy steps</strong> through the <strong>entire process</strong> of creating a website that includes user authentication. This course will take you step by step through the project until all the principles have been covered.<br></p>\n\n<p><strong>All the source code</strong> is <strong>included</strong> with the lectures, with clear comments in the code and all the guidance you need to create your own user authentication system.</p>\n\n<p><em>This popular course has been <strong>completely rewritten </strong>and<strong> re-published in </strong></em><em><strong>April 2015</strong>, replacing <strong>every lecture</strong> and adding <strong>over 20 brand new ones</strong>, with improved, <strong>more secure</strong> source code, and an <strong>entirely new user administration area</strong>.</em></p>", 
    "end_date": null, 
    "title": "Login and Registration from Scratch with PHP and MySQL", 
    "price": "20.00", 
    "instructors": "Dave Hollingworth", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25615_0f83_10.jpg", 
    "course_url": "https://www.udemy.com/authentication-from-scratch-with-php-and-mysql/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-29T09:54:27Z"
}