{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<em style=\"\">A Certificate of Completion will be provided to all students after completing this course.</em>  </p>  <p>  \t<strong style=\"\">In this Vedio Session we took all the Basic Elements of HTML and CSS. and we tried make u a Complete web developer with this Vedio. After Completion of the Session you can make your own Static Website.</strong>  </p>  <p>  \t    ______________________________________________________________________  </p>  <p>  \t                  A Web Browser can read HTML files and Compose them into visible or audible web pages. The Browser does not display the HTML tags, but uses them to interpret the content of the page. HTML uses special bits of Programming language called &quot;tags&quot; to let the browser know how a Webpage should look. The tags usually come in pairs: an opening tag to tell the browser when to start doing something, and an ending tag to tell the browser when to stop doing something. There are many different kinds of tags, and each one has a different purpose.  </p>  <p>  \t    ______________________________________________________________________  </p>  <p>  \t                  Web browsers can also refer to Cascading Style Sheets (CSS) to define the look and layout of text and other Material.  </p>  <p>  \t                  HyperText Markup Language is a markup language that web browsers use to interpret and compose text, images and other material into visual or audible web pages. Default Characteristics for every item of HTML markup are defined in the Browser, and these characteristics can be altered or enhanced by the web page designer&#039;s Additional use of CSS. Cascading Style Sheets (CSS) and JavaScript can be included in HTML code. CSS is used to change how a webpage looks. JavaScript is used to add features to Webpages and make them more Interactive.  </p>  <p>  \t                  The id attribute provides a Document-Wide unique identifier for an Element. This is used to identify the element so that Stylesheets can alter its Presentational properties, and scripts may alter, animate or delete its Contents or presentation.  </p>  <p>  \t                  The class attribute provides a way of Classifying similar Elements. This can be used for semantic or presentation purposes. For example, an HTML document might semantically use the designation class=&quot;notation&quot; to indicate that all elements with this class value are subordinate to the main text of the Document.  </p>  <p>  \t    ______________________________________________________________________  </p>  <p>  \t                  The course provides step-by-step Walk-through and Coding demos that you&#039;re encouraged to code along with to enhance the learning process. By the end of the course you&#039;ll understand how all of the coding pieces fit together and be<strong style=\"\"> able to apply this knowledge to building your own custom Web applications.  </strong>  </p>  <p>  \t<strong style=\"\">  Web browsers can also refer to Cascading Style Sheets to define the look and layout of text and other material.  </strong>  </p>", 
    "end_date": null, 
    "title": "Make  a Website from Scratch with  HTML & CSS", 
    "price": "20.00", 
    "instructors": "Kishan Jainani", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311718_da4d_16.jpg", 
    "course_url": "https://www.udemy.com/build-a-website-with-the-help-of-html5-css3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T18:46:34Z"
}