{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span>There are no words to explain how important this class is. If you are ever going to only take 1 class in web development then this is the class you want to take. Wordpress is revolutionary, its a trend setter, its the future, its the stuff that all those developers are using that you are paying to work for you. This is your opportunity to understand this phenomenal technology. You will never see the internet the same way.</span>  </p>  <p>  \tTake advantage of this opportunity to change your perspective for life. The internet is the gift of this generation; take advantage of it and don’t let this opportunity go to waste. Knowing Wordpress will give you access to one of the strongest tools of our times. Don’t let this opportunity go to waste. What you learn in this class will change your perspective of the internet for ever.  </p>  <p>  \tDon’t you want to have better control over your internet experience? Don’t you want to be the master of your own internet destiny? Have you ever found yourself wanting to make a website but not knowing what you need to do?  </p>  <p>  \tIn 100 years from now Wordpress will be remembered as one of the most significant achievements of mankind right next to the Moon Landing. Wordpress has empowered the individual to have a real presence and a voice on the internet.  </p>  <p>  \tWith Wordpress you make your own website.  </p>  <p>  \tWordpress is currently used by The New York Times, CNN, Forbes, Reuters, GM, UPS, Ebay, Sony, Best Buy, The Rolling Stones, Jay-Z, Katy Perry, MP3.com, IZOD, Kineda, StyleWatch, Mashable and Time Magazine just to name a few notable users.  </p>  <p>  \tIf you have ever felt the slightest bit of impairment as a result of not knowing how to make a website then this right here is your opportunity to shine on and get the skinny on how to make your own website. Take this class and stop paying other programmers to make your websites for you. This class is the equivalent of the Red pill from the Matrix.  </p>  <p>  \tNo prior programming experience or knowledge required. This class is outstanding! Its the best class you can ever take. Learn how to make a website with WordPress. WordPress has revolutionized business and this class offers the opportunity to learn Wordpress.  </p>", 
    "end_date": null, 
    "title": "Make a professional website - 30 Day Guarantee. Discounted!", 
    "price": "20.00", 
    "instructors": "Startup Saturdays", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/241590_65b4_3.jpg", 
    "course_url": "https://www.udemy.com/make-your-own-business-website-beginner-and-intermediate/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-11T18:13:36Z"
}