{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span>As a musician, I learned how to create websites out of pure necessity. I am not a professional programmer - </span><em style=\"\">I learned through trial and error and studying on my own what works and what doesn&#039;t work</em><span>. I&#039;ve now written hundreds of websites for artists, musicians, bands, galleries, and other organizations.</span>  </p>  <p>  \tIn 2009 I created this class, &quot;Web Design for Artists&quot; as a class I teacher in-person around my area. The class has been very successful, and I&#039;m really excited to bring it to an online platform. My goal with this class is simple: I want all musicians to have a website, be able to manage their website, and to never, ever, have to pay someone to do it for them.  </p>  <p>  \tThis is a hands-on class: I am going to make a website for myself during this class, and walk you through every step. Nearly every video is a &quot;walk through&quot; on how to do something. And because I&#039;m not a technical web designer, we won&#039;t get bogged down with any abstract terminology - only what we need. Lets dive in!  </p>  <p>  \t<em style=\"\">Praise for other classes by J. Anthony Allen</em>  </p>  <ul style=\"\">  \t<em style=\"\"><em style=\"\">  \t<li><em style=\"\">&quot;Dr Allen does it again with his music theory for electronic musicians series. This course really opened up everything I learned from the 1st section and now I understand more about the composition side of things for music. I highly highly recommend this course to anyone!!! Really opened my eyes to many things I wasn&#039;t aware of.&quot; </em></li>  \t<em style=\"\"><em style=\"\">  \t<li>&quot;The Best Teacher ever, who make you understand the in &amp; out Music Theory by all mean without giving what you don&#039;t want to know.&quot; </li>  \t<li>&quot;I have never had any formal training in music at all. Trying to learn all the notes and how everything translated was a serious challenge. After going thru this class, Dr. J has totally brought down the barriers. The content was very useful and was easy to grasp for me.&quot;</li>  \t</em></em></em></em>  </ul>", 
    "end_date": null, 
    "title": "Making Band Websites: Promoting and Selling Your Music", 
    "price": "20.00", 
    "instructors": "Jason Allen", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337150_c2f1.jpg", 
    "course_url": "https://www.udemy.com/web-design-for-musicians/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-06T02:31:00Z"
}