{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Welcome to my Malibu Surf Code School Series. </p><p style=\"\">This series of courses were created with the beginning programmer in mind. All of these courses were designed for those who have no experience with this material at all.</p><p style=\"\">In this course you&#039;ll learn how to use JavaScript to make your website more interactive, score a job as a beginning JavaScript programmer, create games, mobile apps, and much much more.</p><p style=\"\">Not only is the growth of web development becoming more widespread, especially in the marketplace, the only restrictions of the application of these skills is the limits of your imagination.</p><p style=\"\">So whether you want to build your own website to make it more interactive, build mobile apps and games, or make sure the marketplace will always see your value, learning this skill is a MUST.</p><p style=\"\">This course will give a basic understanding of the JavaScript fundamentals that will more than prepare you for a job as a beginning JavaScript developer.</p><p style=\"\">JavaScript is a fun language. You might not have ever heard of a &quot;fun&quot; programming language, but it turns out JavaScript is one of the easiest, if not THE EASIEST, programming languages to learn out there.</p><p style=\"\">JavaScript lets you break a lot of the rules of programming. Even if you don&#039;t write everything perfectly, a lot of times it will still work. </p><p style=\"\">So let&#039;s get coding and have some fun!</p><p style=\"\">Martin </p>", 
    "end_date": null, 
    "title": "Malibu Surf Code School: Intro To JavaScript", 
    "price": "20.00", 
    "instructors": "Martin Kenny", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553760_b37f_3.jpg", 
    "course_url": "https://www.udemy.com/malibu-surf-code-school-intro-to-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-13T22:09:16Z"
}