{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Welcome to my new California CodeRush Intro Series.</p><p style=\"\">In this series of introductory courses you will be learning the fundamentals of programming languages starting with HTML, CSS, and JavaScript all the way up to the more sophisticated Ruby and even Python.</p><p style=\"\">The purpose of this California CodeRush Intro Series is to whet your appetite for the vast riches and abundance of opportunity that come from building a solid foundation of web development understanding and from there progressing into even greater triumphs of the wealth and treasures that this series will provide.</p><p style=\"\">The first course in this series is the intro to HTML course where you will get your feet wet and learn to conquer your fear of coding while familiarizing yourself with some of the basic features and overwhelming new horizons that this skill opens for you.</p><p style=\"\">From there, we will move to the next stepping stone, CSS. CSS is where we begin to sift through the mud and find those shiny nuggets of gold. The CSS introductory course is where the skills from our understanding of HTML start to pay dividends.</p><p style=\"\">Next, it&#039;s time to separate the wheat from the chaff with my introductory to JavaScript course. Here, we&#039;ll go into depth on a tremendously valuable programming language that may seem daunting at first, until we realize that it was created and completed in a matter of 10 days!</p><p style=\"\">The mining continues as we delve deeper into the hidden treasure trove of Ruby and even take down the ferocious beast, Python, that lies deep within the cavernous lair of Silicon Valley atop its mountainous hoard of abundant riches.</p><p style=\"\">So grab your pickax and head west in my new California CodeRush Intro Series.</p><p style=\"\">The California Valley is still full of gold and it&#039;s your time to get your share!</p>", 
    "end_date": null, 
    "title": "Malibu Surf Code School: Intro To CSS", 
    "price": "20.00", 
    "instructors": "Martin Kenny", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552194_85b3_7.jpg", 
    "course_url": "https://www.udemy.com/malibu-surf-code-school-intro-to-css/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T01:55:44Z"
}