{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t      Mastering technology is a must today if you want to remain relevant. It is very easy to forget and fall behind because technology moves so quickly. This course has a lot of tips that is constantly being added to. The best part is that you get life time access to these courses. This means you pay once and never have to pay again.  </p>  <p>  \t      This is one of the best deals in online education. Very few courses will give you unlimited access to the course. Learning how to use Photoshop, Illustrator and learning how to code is very important and can help you make more money. If you can combine these skills you can make even more money. Mastering technology is a great way to change careers or move ahead.  </p>  <p>  \t      There are more people who are technologically Literate than technologically literate. Knowing just how to command technology a little bit can dramatically improve your life.  </p>  <p>  \t      Here is a little bit about Mammoth Interactive  </p>  <p>  \t      Mammoth Interactive is a company that was formed in 2008 by John Bura. Mammoth Interactive has produced games for the iPhone, iPad, XBOX 360 and more. Their games have been sponsored by highly esteemed companies such as Nickelodeon.  </p>  <p>  \t      Mammoth Interactive has a long history of providing support to other developers. Mammoth Interactive has been contracted to produce epic soundtracks, addicting levels, rock solid programming  and business development.  </p>  <p>  \tJohn has been programming since 1997 and teaching since 2002. John brings a unique perspective with his years of experience of teaching and real word experience running a software company. Since November of 2011 Mammoth Interactive has sold over 400k worth of education courses around the world. The courses have been featured on many websites such as Venture Beat, Expert Dojo, Cult of Mac, Macgams,  and many more.  </p>", 
    "end_date": null, 
    "title": "Mammoth Interactive's Skillfeed videos", 
    "price": "20.00", 
    "instructors": "John Bura", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289584_f870_3.jpg", 
    "course_url": "https://www.udemy.com/mammoth-interactive-skillfeed-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-28T14:42:41Z"
}