{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>**Course materials are last updated on November 22nd, 2014- Over 500 students enrolled already in the first couple of weeks** Available for $25 for a limited time Post Cyber Monday Offer.</strong>  </p>  <p>  \t            Our expert instructor and developer, Karlien demonstrates all the basic and advanced concepts of web development in this course. Also, she shares the secret techniques of HTML and CSS to make you an expert. Just like our other popular and award-winning courses, this course includes lot of preview videos for you to get an advanced idea of the materials. HTML stands for HyperText Markup Language and it has been the mother of markup languages to create baseline structure and contents for websites. HTML targets browser-based software applications for design. HTML code structure includes pair of tags. Web browsers typically read html documents and convert them into visible web elements for users. HTML closely works with Cascading Style Sheets (CSS) for customizing the look and feel of web contents. The process of inventing this amazing language started in the 1980s by physicist Tim Berners-Lee. Lee created the first coding of HTML in the 1990s. HTML also helps us to interpret and compose text, images and other material on web pages. No one can step into Website Design without the knowledge of HTML. HTML training and HTML tutorial videos are vastly available since it is a mandatory skill for web designers, but it has been difficult to find free HTML training videos that discuss all basic and secret recipes from scratch. Also, we often make HTML concepts sound boring and difficult. As a result, new comers may lose interest in web design from the beginning of their learning. A professional web design course often costs us a fortune. Erudeversity is committed to make it easier for everyone. Our set of HTML tutorials and free html training videos discuss basic and advanced HTML concepts from scratch and we like to keep the doors open for everyone without any fee! No matter where you come from, getting into the web design industry don’t have to cost a fortune anymore. All you need is a little bit of passion to learn web design. By the end of the HTML videos, you will become a master in basic website design. Now everyone can learn the required HTML concepts including Addressing web pages, HTML writing platform, overview of notepad++, writing first line of HTML code, proclaiming headings, adding paragraphs, color and formatting, adding images to your web page, inserting background images, Adding link, craeting submit forms, adding multimedia/sound on web page. We also discussed the CSS concepts for customizing the look and feel of the web pages. At the end, we walk you through the process of publishing your first web page. So what are you waiting for? Get started and become a website developer from scratch and master web development techniques to reach the top level of success in this industry.  </p>", 
    "end_date": null, 
    "title": "Master Website Development From Scratch Using HTML & CSS", 
    "price": "20.00", 
    "instructors": "QAEversity .", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343050_4d9b_3.jpg", 
    "course_url": "https://www.udemy.com/become-master-in-web-development-from-scratch-using-htmlcss/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T08:24:50Z"
}