{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Web\n development is moving fast and to keep up to mark, you need a \ntechnology stack that is . The MEAN stack includes MongoDb, Express, \nAngular, and Node.js. These tools provide a rich environment to build \nadvanced web applications in a short space of time. All the pieces of \nthe MEAN stack are practically tried and tested in large and small-scale\n organizations.</p>\n\n<p>Mastering\n MEAN Web Development will guide you through all the necessary pieces to\n build a web app from start to finish. We will discuss the concepts and \nmethods in depth, and shine light on how and why we use each piece of \nthe MEAN stack.</p>\n\n\n\n\n\n\n\n<p>We’ll\n begin by learning how to use Webpack and Babel to assemble our \nfrontend. We’ll see how to leverage many of the new features in \nAngular2. We’ll create a RESTful API built with Node.js and MongoDB.</p>\n\n\n\n\n\n\n\n<p>Along\n the way, we’ll touch up on best practices used to create, manage, and \ndeploy web applications to production. Your skills and understanding of \nJavaScript will increase as you add web sockets, models, and other \nessential elements to your web application.</p>\n\n\n\n\n\n\n\n<p>Mastering MEAN Web Development will cover all the topics you need to create your own web apps for organizations, small or big.</p>\n\n<p><strong>About The Author</strong></p><p><strong>Shane A. Stillwell</strong> is a full stack web developer specializing\n in MEAN stack web development. He has been a developer for over 15 \nyears. Shane has a knack for cutting edge technology and uses it to make\n development faster, easier, and most importantly, fun.</p>\n\n\n\n<p>Shane has built a wide variety of applications from mobile apps to \nlarge scale Angular and React web apps, to small hobby projects. Shane \nspeaks and writes on full stack development hoping to help bring cutting\n edge technology closer to anyone with a desire to learn.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Mastering MEAN Web Development: Expert Full Stack JavaScript", 
    "price": "50.00", 
    "instructors": "Packt Publishing", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/870066_fe11_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-mean-web-development-expert-full-stack-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-06T09:31:16Z"
}