{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>As the language of the web, JavaScript is used prolifically by developers building new applications every day. However, some developers still lack the knowledge about how to write things in a simpler, clearer and more maintainable way. Design patterns are proven solutions to common development problems, and can boost code quality and application maintainability, as well as improve developer efficiency. </p><p>Mastering JavaScript Design Patterns demonstrates how to apply design patterns in real life situations, whether that's for new, or already existing projects. It will help you to make your applications more flexible, perform better, and easier to maintain.</p><p>We’ll begin by building a simple music player application, and then we’ll build and add more and more functionality to our music player application. We’ll also cover different ways to modularize the application.</p><p>In the next two sections we’ll build a server and will load data from it. We’ll cover different techniques for caching, fallbacks, optimizing memory consumption and deferred actions.</p><p>In the last section we’ll cover code maintainability improvement techniques by using less known, yet powerful JavaScript techniques.</p><p><strong>About The Author<br></strong></p><p><strong>Alexandr Truhin (bumbu) </strong>is a proponent of open web and robust solutions. His engineering background is based on desktop, back-end and front-end web applications where most recent years he’s using JavaScript to build fast and reach web applications.</p><p>His passion is improving and passing knowledge which has been doing by teaching in University, writing blog posts, mentoring other developers and contributing to open source community.</p>", 
    "end_date": null, 
    "title": "Mastering JavaScript Design Patterns: Building Better Apps", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634766_731d_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-javascript-design-patterns-building-better-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T11:58:27Z"
}