{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Building a website or mobile app using modern technologies can be a daunting task. Choosing and installing the tools alone can take hours of frustration, and code might not be very efficient. But with the MEAN stack at your aid, you can make the most of JavaScript to create websites and apps that are high in performance, unbeaten in quality, and easy on you. </p><p>Mastering MEAN Web Development gives you a start-to-finish solution for using modern technologies, writing high quality code, and deploying a live website with the MEAN stack.</p><p>This video course uses the mean-seed Yeoman generator to equip you with all the modern tools and workflows. It shows you the best practices of using Angular directives and writing automated tests right from the start. You will first see how to get a scaffolded out functioning website and then add in custom code and tests to make it go live. You will then learn how to go further with GruntJS commands to build and test your application. With this course, you will learn the three core frontend languages (HTML, CSS, and JavaScript) and dive into some more tricky topics to successfully build a full stack application complete with a database layer, backend server, and frontend client.</p><p>By the end of this course, you will be building websites that look good and perform great in no time.</p><p><strong style=\"\">About the Author</strong></p><p><strong style=\"\">Luke Madera</strong> has over 7 years of experience building modern websites and cross-platform mobile applications for both freelance contract work and various startups. He specializes in full stack JavaScript and the MEAN stack. He wrote generator-mean-seed, which is the third most popular MEAN Yeoman generator. Luke is passionate about leadership, entrepreneurship, health and fitness, the outdoors, adventures, playing all kinds of sports and games, and cooking.</p><p>I&#039;d like to thank my family for all their love, support, and guidance. My mom for always pushing me and believing in me, my dad for helping teach me to code and being my mentor, and my brother for working alongside me to build modern websites, and especially for his work on the MEAN stack.</p>", 
    "end_date": null, 
    "title": "Mastering MEAN Web Development", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507846_2854_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-mean-web-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T06:28:03Z"
}