{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>You might have heard about such rapidly-growing-in-popularity technologies as NodeJS or the M.E.A.N. stack (MongoDB, ExpressJS, AngularJS and NodeJS). The brilliance of NodeJS is its fast performance and the ability to leverage JavaScript on the server. That's right! Developers can use one language for the browser and the server code. Even more so, they can use JavaScript for the database layer with MongoDB. Therefore, the full stack JavaScript becomes a new standard for web development.</p><p>With NodeJS being a low-level platform, it is not a framework by itself. This leads us to a problem of how we can organize code, parse requests, send back responses, use template engines, implement authentication, validation, and connect to databases among other things <strong>without solving those problems by ourselves? </strong></p><p><strong>For many years, NodeJS developers' choice of web framework is ExpressJS.</strong></p><p>After taking this course, you can start mastering ExpressJS by building RESTful APIs for your single-page applications (powered by AngularJS, ReactJS, BackboneJS or any other front-end framework). With ExpressJS, developers can easily organize their code (middleware pattern), add more functionality (npm modules) and configure the server (configuration over convention). </p><p>Moreover, Express is mature and very stable so that it's a default choice for small companies and large enterprises. Even more advanced frameworks, like Sails or Loopback, extend ExpressJS (i.e., they depend on Express). Therefore, <strong>learning ExpressJS first is a valuable investment,</strong> because you can apply the same skills and existing ExpressJS middleware to more advanced frameworks.</p><p>This course comes with series of lectures and practicum. The benefits of ExpressWorks course and practicum (ExpressWorks the automated workshop) include:</p><ul><li>Get the basic understanding how Express works</li><li>Build a few straightforward apps which introduce the core concepts</li><li>Become confident enough to start building your own REST APIs for SPAs</li><li>Become proficient enough to develop traditional web apps (server-side rendering)</li><li>Spent time coding, not watching boring videos with hands-on automated workshop</li><li>See the real code from the real large application built with ExpressJS, MongoDB/Mongoose, and BackboneJS — HackHall.</li></ul><p>This course is brought to you by Azat Mardan, the author of Practical Node, <strong>Pro Express</strong>, React Quickly, Full Stack JavaScript, <strong>Express API Reference</strong> and other JavaScript/Node books.</p>", 
    "end_date": null, 
    "title": "Master ExpressJS to Build Web Apps with NodeJS&JavaScript", 
    "price": "20.00", 
    "instructors": "Azat Mardan", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/637974_481c_2.jpg", 
    "course_url": "https://www.udemy.com/expressjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-12T07:27:12Z"
}