{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Our expert instructor and developer, Karlien demonstrates all the basic and advanced concepts of web development in this course. Also, she shares the secret techniques of HTML and CSS to make you an expert. Just like our other popular and award-winning courses, this course includes lot of preview videos for you to get an advanced idea of the materials. HTML stands for HyperText Markup Language and it has been the mother of markup languages to create baseline structure and contents for websites. HTML targets browser-based software applications for design. HTML code structure includes pair of tags. Web browsers typically read html documents and convert them into visible web elements for users. HTML closely works with Cascading Style Sheets (CSS) for customizing the look and feel of web contents. The process of inventing this amazing language started in the 1980s by physicist Tim Berners-Lee. Lee created the first coding of HTML in the 1990s. HTML also helps us to interpret and compose text, images and other material on web pages. No one can step into Website Design without the knowledge of HTML. HTML training and HTML tutorial videos are vastly available since it is a mandatory skill for web designers, but it has been difficult to find free HTML training videos that discuss all basic and secret recipes from scratch. Also, we often make HTML concepts sound boring and difficult. As a result, new comers may lose interest in web design from the beginning of their learning. A professional web design course often costs us a fortune. Erudeversity is committed to make it easier for everyone. Our set of HTML tutorials and free html training videos discuss basic and advanced HTML concepts from scratch and we like to keep the doors open for everyone without any fee! No matter where you come from, getting into the web design industry don’t have to cost a fortune anymore. All you need is a little bit of passion to learn web design. By the end of the HTML videos, you will become a master in basic website design. Now everyone can learn the required HTML concepts including Addressing web pages, HTML writing platform, overview of notepad++, writing first line of HTML code, proclaiming headings, adding paragraphs, color and formatting, adding images to your web page, inserting background images, Adding link, craeting submit forms, adding multimedia/sound on web page. We also discussed the CSS concepts for customizing the look and feel of the web pages. At the end, we walk you through the process of publishing your first web page. So what are you waiting for? Get started and become a website developer from scratch and master web development techniques to reach the top level of success in this industry.</span>  </p>  <p style=\"\">  \tहमारे विशेषज्ञ प्रशिक्षक और डेवलपर, Karlien इस कोर्स में वेब विकास के सभी बुनियादी और उन्नत अवधारणाओं को दर्शाता है। इसके अलावा, वह आप एक विशेषज्ञ बनाने के लिए एचटीएमएल और सीएसएस का रहस्य तकनीक के शेयरों। आप सामग्री का एक उन्नत विचार प्राप्त करने के लिए बस हमारे अन्य लोकप्रिय और पुरस्कार जीतने पाठ्यक्रमों की तरह, इस पाठ्यक्रम पूर्वावलोकन वीडियो का बहुत कुछ शामिल है। एचटीएमएल हाइपरटेक्स्ट मार्कअप लैंग्वेज के लिए खड़ा है और यह वेबसाइटों के लिए आधारभूत संरचना और सामग्री बनाने के लिए मार्कअप भाषाओं की जननी रही है। डिजाइन के लिए HTML लक्ष्य ब्राउज़र आधारित सॉफ्टवेयर अनुप्रयोगों। एचटीएमएल कोड संरचना टैग की जोड़ी भी शामिल है। वेब ब्राउज़र को आम तौर पर HTML दस्तावेजों को पढ़ने और उपयोगकर्ताओं के लिए दिखाई दे वेब तत्व में कन्वर्ट। एचटीएमएल बारीकी से वेब सामग्री के रंगरूप अनुकूलित करने के लिए व्यापक स्टाइल शीट (सीएसएस) के साथ काम करता है। इस अद्भुत भाषा की खोज करने की प्रक्रिया भौतिक विज्ञानी टिम बर्नर्स-ली ने 1980 के दशक में शुरू हुई। ली ने 1990 के दशक में HTML के पहले कोडिंग बनाया। एचटीएमएल भी व्याख्या और वेब पन्नों पर पाठ, छवियों और अन्य सामग्री की रचना करने के लिए हमें मदद करता है। कोई भी HTML के ज्ञान के बिना वेबसाइट डिजाइन में कदम कर सकते हैं। यह वेब डिजाइनरों के लिए एक अनिवार्य कौशल है क्योंकि एचटीएमएल प्रशिक्षण और HTML ट्यूटोरियल वीडियो बेहद उपलब्ध हैं, लेकिन यह खरोंच से सभी बुनियादी और गुप्त व्यंजनों के बारे में चर्चा है कि मुफ्त HTML प्रशिक्षण वीडियो खोजने के लिए मुश्किल हो गया है। इसके अलावा, हम अक्सर एचटीएमएल अवधारणाओं उबाऊ और कठिन ध्वनि करना। नतीजतन, नए comers उनके सीखने की शुरुआत से वेब डिजाइन में रुचि खो सकता है। एक पेशेवर वेब डिजाइन पाठ्यक्रम अक्सर हमें एक भाग्य खर्च होती है। Erudeversity हर किसी के लिए यह आसान बनाने के लिए प्रतिबद्ध है। एचटीएमएल ट्यूटोरियल और मुक्त HTML प्रशिक्षण वीडियो के हमारे सेट खरोंच से बुनियादी और उन्नत HTML अवधारणाओं पर चर्चा और हम किसी भी शुल्क के बिना हर किसी के लिए दरवाजे खुले रखने के लिए पसंद है! आप वेब डिजाइन उद्योग में हो रही है, कहाँ से आते हैं कोई फर्क नहीं पड़ता अब और एक भाग्य लागत की जरूरत नहीं है। आप सभी की जरूरत जुनून का एक छोटा सा वेब डिजाइन सीखना है। एचटीएमएल वीडियो के अंत तक, आप बुनियादी वेबसाइट डिजाइन में एक मास्टर बन जाएगा। अब हर कोई अपने वेब पेज पर छवियों को जोड़ने पृष्ठभूमि छवियों डालने, जोड़ना, को संबोधित वेब पेज, एचटीएमएल लेखन मंच, नोटपैड का अवलोकन ++ एचटीएमएल कोड की पहली पंक्ति लिख, प्रचार शीर्षकों, पैराग्राफ, रंग और स्वरूपण जोड़ने सहित आवश्यक एचटीएमएल अवधारणाओं सीख सकते हैं लिंक, craeting वेब पेज पर मल्टीमीडिया / ध्वनि जोड़ने, प्रपत्र जमा करें। हम यह भी वेब पृष्ठों के रंगरूप अनुकूलित करने के लिए सीएसएस अवधारणाओं पर चर्चा की। अंत में, हम अपना पहला वेब पेज प्रकाशित करने की प्रक्रिया के माध्यम से चलना। तो क्या तुम्हारे लिए इंतज़ार कर रहे हैं? आरंभ करने के लिए और इस उद्योग में सफलता के शीर्ष स्तर तक पहुँचने के लिए खरोंच और गुरु वेब विकास तकनीक से एक वेबसाइट डेवलपर बन जाते हैं।  </p>", 
    "end_date": null, 
    "title": "Master Website Development Using HTML & CSS-Hindi (हिंदी)", 
    "price": 0, 
    "instructors": "Erudeversity Video Library", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378990_0354.jpg", 
    "course_url": "https://www.udemy.com/master-website-development-using-html-css-hindi/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-28T06:55:27Z"
}