{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Mastering Django Web Development shows you how to use advanced concepts to help you build professional grade Django applications.</p><p>We start off by learning how class-based views work so that you can fully benefit from this powerful, but often poorly understood feature. We’ll then create custom middleware which will help us better organize frequently used code. </p><p>Have you ever wanted to build a complete REST API? We’ll do just that, starting out with a basic read-only API and then adding key-based authentication to allow the full range of CRUD functionality. We’ll also utilize model managers and the Q method so that we can make it easier to get the data we need to our views and clients.</p><p>For the finishing touches, we’ll dive into the details of caching, to improve our application performance, and then add custom management commands to help us automate routine tasks.</p><p>By the end of this video course, you will emerge a Django expert.</p><p><strong>About The Authors</strong></p><p><strong>Kevin Veroneau</strong> is a very active Python and Django developer who has worked for many start-ups, has an active Python blog, and has worked on a magnitude of Python projects over the years.<br></p><p><strong>Matthew Nuzum</strong> has been developing web applications since 1999 and has worked for several start-ups including Canonical, the makers of Ubuntu, as well as Fortune 500 companies. He has a passion for helping others learn new technologies and has written numerous tutorials and help documents as well as running a web-focused user group based in his hometown of Des Moines.<span><br></span></p>", 
    "end_date": null, 
    "title": "Mastering Django Web Development", 
    "price": "20.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/755802_ce00_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-django-web-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T09:58:07Z"
}