{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Windows Communication Foundation (WCF), which was released as part of the .NET Framework (3.0 and 3.5), is a platform developers can use to build Service-Oriented Applications.</p><p>This course provides developers with a thorough knowledge in developing WCF Services using C#.</p><p>In this course by development expert Kameswara Sarma Uppuluri, you'll learn essential concepts that you need to know to get started building WCF Services using C#.</p><p>This course provides step-by-step walk-throughs and coding demos that you're encouraged to code along with to enhance the learning process.</p><p>This course is broken down into 13 Modules with each module providing source code so that you can follow along with Kameswara Sarma Uppuluri. Some of the modules can be seen in the below list.</p><p>Section 1 :\nDeveloping a Simple WCF Service Application</p><p>Section 2 :\nDeveloping and Hosting a WCF Service Onto IIS</p><p>Section 3 :\nLearn How to Self Host a Service</p><p>Section 4 :\nLearn How to Self Host Multiple WCF Services</p><p>Section 5 :\nLearn How to Self Host a WCF Service Using Config Files</p><p>Section 6:\nLearn How to Host a WCF Service Using Windows Services</p><p>Section 7 :\nLearn How to Self Host a WCF Service Using a Service Reference</p><p>Section 8 :\nLearn How to Host a WCF Service Using WAS</p><p>Section 9 : Learning Message Exchange Patterns of WCF</p>  <p>Section 10 : Learn How to Implement Exception Handling for WCF Services</p>  <p>Section 11 : Learn How to Implement Session Management in WCF Services</p>  <p>Section 12 : Learn How to Implement Transactions in WCF Services</p>  <p>Section 13 :Learn to Implement Session Management and Transactions together in WCF Services</p>", 
    "end_date": null, 
    "title": "Master WCF 4.0 From Scratch Using C#", 
    "price": "30.00", 
    "instructors": "Kameswara Uppuluri", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676554_d431_3.jpg", 
    "course_url": "https://www.udemy.com/masterwcf/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T16:31:59Z"
}