{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Der Weg zur guten Website muss nicht schwer sein! Mit dieser Anleitung per Video meistern Sie die ersten Schritte spielend. Webexpertin Ricarda Kiel zeigt, wie Sie eine Website Klick für Klick erstellen, und Sie machen einfach alles direkt am eigenen Rechner nach. Sie erstellen das Grundgerüst, gestalten dann Texte und Schriften, binden Bilder und Videos ein und erzeugen Kontaktformulare – alles besonders einsteigergerecht und verständlich erklärt. Dabei lernen Sie jede Menge Werkzeuge kennen, die das Website-Basteln zum Vergnügen machen. So klicken Sie sich zu Ihrer eigenen Website und lernen obendrein noch eine Menge über HTML und CSS!</p><p style=\"\">- Kein Vorwissen nötig! – Machen Sie einfach direkt mit!</p><p style=\"\">- Lernen Sie, wie Sie blitzschnell Webseiten erstellen, die richtig gut aussehen!</p><p style=\"\">- Wirkungsvolle Texte schreiben, Bilder einbinden, Navigationsmenüs erstellen</p><p style=\"\">- Mit Workshops zu den Baukastensystemen »Jimdo« und »Squarespace«</p><p style=\"\">Ricarda Kiel ist Webdesignerin, Bloggerin und Beraterin. Mit ihrem Projekt »Die gute Webseite« bietet sie unerfahrenen Anwendern einen leichten Weg zur eigenen Website. Dieses Projekt hat ihr auch den Spitznamen »Website-Hebamme« eingebracht. Ihre Kunden sind hochzufrieden, besonders hervorgehoben wird, dass ihre Kurse Spaß machen, sehr zielführend sind und ohne Technik-Kauderwelsch auskommen.</p>", 
    "end_date": null, 
    "title": "Meine eigene Website - Schritt für Schritt zum Webauftritt", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535360_89a3.jpg", 
    "course_url": "https://www.udemy.com/meine-eigene-website-schritt-fur-schritt-zum-webauftritt/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T18:27:18Z"
}