{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Willkommen zu diesem WordPress Shop Tutorial auf Deutsch. </p>\n\n<p>Die Anfangsfrage bei einem Shop ist häufig: Welches ist das richtige System für mich? </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Wir haben eine Antwort:</strong> Es gibt viele Systeme, die das richtige System sein KÖNNEN, dann häufig aber doch für bestimmte Zwecke das falsche sind. Bei WooCommerce ist das anders! Da WordPress einen Marketshare von rund 30% aller CMS-Betriebenen gibt es eine Vielzahl an Lösungen und Dokumentationen rund um das System. Mit WordPress ist ALLES möglich. <strong class=\"redactor-inline-converted\">Wir haben schon die kompliziertesten Lösungen im Bereich WooCommerce umgesetzt! Also: Keine Angst vor WooCommerce. </strong>Angst sollte man eher vor beispielsweise französischer und deutscher Konkurrenz (z. B. Prestashop &amp; Shopware) haben. Diese Systeme sind lediglich mit einem erheblichen Anteil an Expertise und Kosten an den eigenen Bedarf anzupassen. Man stößt schnell an Grenzen. Welche viel Zeit und Geld kosten! Das heißt nicht, dass diese Systeme partu schlecht sind! Aus unseren Augen: nicht für den Laien zu empfehlen! Nur wenn eine Agentur die System-Pflege übernimmt und auch die Produktpflege als eigene Verantwortung übernimmt <strong class=\"redactor-inline-converted\">und</strong> (um mit der Zeit zu schwimmen) auch Innovationen implementiert, sind auch solche Systeme als Ecommerce Lösung zu empfehlen. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Kosten für einen WooCommerce WordPress Shop</strong>: Mit WooCommerce muss ein Shop nicht viel kosten. Trotzdem hat WordPress einen immensen Funktionsumfang. Lässt man einen WooCommerce Shop an eine Agentur auslagen gehen die Kosten bei ca. 1500 € los (ganz ganz einfache Shops). Aufhören tut es bei ungefähr 50.000 € auf ein Jahr gerechnet: Erstellung des Shops, Pflegekosten (angenommen wird ein normaler Shop, bei Produktintensiven Shops und Extraleistungen geht es natürlich auch hier unendlich nach oben mit den Kosten) . Ihr seht also, dass sich Kosten für Shop-Systeme extrem unterscheiden können. Baut Ihre euren Shop also selber, indem ihr unsere Video-Tutorials baut könnt Ihr extrem viel Geld einsparen und dieses in den weiteren Vertrieb, bzw. die Produktion eurer Produkte oder eure Dienstaleistung stecken. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Achtung</strong>: viele Shop Maintainer oder Anfragende für einen Shop vergessen, dass bei JEDEM Shop System Updates erforderlich sind. Regelmäßig. Diese müssen sich irgendwie finanzieren. Je nach dem wie groß der Shop ist, sollte man  20 € (kleiner Shop) bis 1000 €  <strong class=\"redactor-inline-converted\">Pflegekosten pro Monat</strong> rechnen, die man für Entwickler bezahlt. Ihr seht, es geht hier wieder um sehr unterschiedliche Summen. <strong>Wird Pflege regelmäßig berücksichtigt, sinken die durchschnittlichen Kosten!</strong>  Auch diese Kosten müssen auf Dauer durch den Shop finanziert und von Anfang an eingeplant werden. Wir haben schon oft beobachtet, dass sich Shop-Betreiber ein Angebot für die Erstellung eines Shops machen lassen aber nicht für die Pflege! Macht man die Pflege selber (eine hohe Verantwortung) oder gar überhaupt nicht, kann es dazu kommen, dass Shops gehackt werden, extrem langsam werden etc. etc. All diese Faktoren sorgen für einen \"Wertverfall\" und ein Shop verkauft ab diesem Punkt auch im seltensten Fall performant (d. h. die Verkäufe bleiben aus.) Google beispielsweise erkennt einen gahackten Shop und dieser erscheint nicht mehr, bzw. sehr schlecht in der Google Suche. Eine gute Nachricht: Meist steigen Pflegeaufwänder mit der Zahl der Produkte und der Zahl der Verkäufe (Verantwortung steigt). D. h. Wenn ihr viel für die Pflege bezahlt könnt ihr euch Updates auch leisten. Wenn ihr allerdings wenig verkauft, können z.B. 500 € für einen bestimmten Monat für Updates von einem guten Entwickler schon mal weh tun :( Aber auch das bekommt man hin!</p>\n\n\n\n<p>In diesem Kurs wird ein real existierender Wordpress Shop für Tee live aufgebaut. Dieser Shop für chinesischen Tee wird unter der Marke Teelicious geführt und ist online dauerhaft zugänglich. Ihr könnte in diesem Kurs die Erstellung jedes Details nachvollziehen und in eurem eigenen Wordpress Shop nachbauen. Natürlich könnt Ihr auch eigenen chinesischen Tee bei Teelicious kaufen. Schaut doch mal vorbei. :)</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Dieser Kurs wird von Jonas Schindler und Malte Helmhold in Kooperation angeboten. Die beiden Autoren pflegen beide YouTube Kanäle auf Deutsch (beide) und Englisch (Jonas) und beantworten hierfür täglich Fragen zum Thema WordPress und vor allem auch WooCommerce. Zur Zeit pflegen die beiden eine beträchtliche Menge an WooCommerce Shops. <br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Wir wünschen viel Spaß, Erfolg und Verkauf mit eurem neuen WooCommerce Wordpress Shop!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>euer Team, </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Jonas &amp; Malte</p>", 
    "end_date": null, 
    "title": "Mit WooCommerce einen erfolgreichen Wordpress Shop erstellen", 
    "price": "50.00", 
    "instructors": "Jonas Schindler, WordPress, SEO & Programimerung Malte Helmhold", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654994_b080_3.jpg", 
    "course_url": "https://www.udemy.com/mit-woocommerce-einen-erfolgreichen-wordpress-shop-erstellen/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T21:57:40Z"
}