{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Learn how to build a website using Object Oriented Programming techniques in just 2 hours.</strong>  </p>  <p style=\"\">  \tConfused about OOP? I explain everything in plain English with step by step instructions, so you are never left behind.  </p>  <p style=\"\">  \tEverything you need is provided - I even throw in free web hosting for the duration of the course, so you don&#039;t need to install server software on your computer.  </p>  <p style=\"\">  \tThis course focuses on the practicalities of object oriented programming - why would you need it, and how can you get a website up and running as quickly as possible.  </p>  <p style=\"\">  \tThe syntax is covered quickly and clearly - OOP is often seen as mysterious but it doesn&#039;t have to be!  </p>  <p style=\"\">  \tIt will allow you to build your own sites and manage those built with OOP structures, such as Wordpress sites.  </p>  <p style=\"\">  \tOOP is a widely used development process, so if you want to be a developer, this is a great place to start.  </p>  <p style=\"\">  \tI run <a href=\"https://www.udemy.com/complete-web-developer-course/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">The Complete Web Developer Course</a>, and so have plenty of experience taking people from no knowledge to expert in a short time.  </p>  <p style=\"\">  \tI look forward to working with you!  </p>", 
    "end_date": null, 
    "title": "Object Oriented Programming (OOP) in PHP - Build An OOP Site", 
    "price": "20.00", 
    "instructors": "Rob Percival", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242574_14f9_5.jpg", 
    "course_url": "https://www.udemy.com/object-oriented-programming-in-php/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-13T06:40:49Z"
}