{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">HELLO WELCOME to this course on Recipes in Orchard CMS</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Did you know how Recipes in Orchard can make Creating, Managing and maintaining your websites created using Orchard easier, simpler and quicker too?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Did you know that you can create websites using Orchard on a Production Server within a few minutes using Recipes?</strong>  </p>  <p style=\"\">  \t          Orchard simplifies the process of setting up a new website by letting you use website recipes. A recipe is an XML file that contains the start up configuration for an Orchard website. When you start Orchard for the first time, you can select a recipe that best matches the type of site you want to set up.  </p>  <p style=\"\">  \t          For example, if you want your website to be a blog, you can select the Blog recipe, and much of the configuration work will be done for you.  </p>  <p style=\"\">  \t          You can create your own recipes and customize the process of setting a website and configuring Orchard features. Recipes can also instruct Orchard to download and install modules and themes from the Orchard Gallery during website setup.  </p>  <p style=\"\">  \t          This course describes  </p>  <ul style=\"\">  \t<li>How to use recipes</li>  \t<li>How to create custom recipes</li>  \t<li>Export or Import Recipes and</li>  \t<li>How to create a new website using a Custom Recipe.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Before you join this course I would like to introduce myself to you.</strong>  </p>  <p style=\"\">  \t          My name is Abhishek Luv and I&#039;m from Mumbai, India. I&#039;m an Orchard Dojo trainer and a contributor to the official Orchard CMS documentation website and I have created numerous courses and tutorial videos on orchard. I&#039;m also the founder of Orchard Beginner. Now, orchard beginner is and will be the one-stop place where you can get started with Orchard CMS , but orchard beginner is still in its initial stage and it will build up pretty soon. And I&#039;m also the founder of the Orchard CMS India community.</p>  <p style=\"\">  \t          Thank You!  </p>", 
    "end_date": null, 
    "title": "Orchard CMS Tutorial : Recipes In Orchard CMS", 
    "price": 0, 
    "instructors": "Abhishek Luv, Orchard Beginner", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/248644_9117_4.jpg", 
    "course_url": "https://www.udemy.com/orchard-cms-tutorial-recipes-in-orchard-cms/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-23T10:30:25Z"
}