{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Hello Welcome to this course on “Orchard CMS for Absolute Beginners”.</strong>  </p>  <p>  \t<strong style=\"\">Are you confused, frustrated or intimidated about how to begin or get started with Orchard CMS? If your answer to this question is YES, then this course is for YOU!</strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">NOTE : Orchard 1.9 Tutorials (In Progress)</strong>  </p>  <p>  \t<strong style=\"\">What is this course about?</strong>  </p>  <p>  \t              Orchard CMS for Absolute Beginners is a course about the latest open-source .NET Content Management System which is written in ASP.NET platform using the ASP.NET MVC framework.  </p>  <p>  \t<strong style=\"\">What are the course requirements?</strong>  </p>  <p>  \t              In order to get started with this course you will need to install the following things on your computer  </p>  <ul style=\"\">  \t<li>Microsoft WebMatrix 3</li>  \t<li>SQL Server 2012 Express</li>  \t<li>Visual Studio 2012 or higher (Including free express editions)</li>  \t<li>Download Orchard CMS source and web project from CodePlex</li>  \t<li>IIS 7.5/ 8 / 8.1</li>  \t<li>Any web browser</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">How will you benefit from this course?</strong>  </p>  <p>  \t              You will get a good working knowledge of Orchard CMS and its admin panel and how to use Orchard CMS as an advanced user.  </p>  <p>  \t              After completing this course you will be able to download Orchard, Install it locally and remotely on a live web server, use the Orchard admin panel very efficiently, Install new themes and modules from the gallery, create pages, blogs and pretty much everything that a content manager will do to manage his content using Orchard CMS.  </p>  <p>  \t<strong style=\"\">What things you will be learning in this course?</strong>  </p>  <ul style=\"\">  \t<li>Getting started with Orchard CMS</li>  \t<li>Learn how to Install Orchard CMS on your local IIIS</li>  \t<li>Learn about all the Orchard CMS Terminologies</li>  \t<li>Learn how to use the Orchard CMS Admin Panel</li>  \t<li>Learn how to host an Orchard CMS website on to a live web server</li>  \t<li>Learn how to use the Built-In Modules &amp; feature in Orchard CMS</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">Before you join this course I would like to introduce myself to you.</strong>  </p>  <p>  \t              My name is Abhishek Luv and I’m from Mumbai, India. I’m an Orchard Dojo trainer and a contributor to the official orchard cms documentation website and I have created numerous courses and tutorial videos on orchard. I’m also the founder of Orchard Beginner. Now, orchard beginner is and will be the one-stop place where you can get started with orchard cms , but orchard beginner is still in its initial stage and it will build up pretty soon. And I’m also the founder of the orchard cms india community.  </p>  <p>  \t<strong style=\"\">I hope that I have convinced you to join this course. Join Now.</strong>  </p>  <p>  \t              Thank You!  </p>", 
    "end_date": null, 
    "title": "Orchard CMS Tutorial for Absolute Beginners", 
    "price": 0, 
    "instructors": "Abhishek Luv, Orchard Beginner", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/117672_8942_10.jpg", 
    "course_url": "https://www.udemy.com/orchard-cms-for-absolute-beginners/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-10T05:10:18Z"
}