{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">LATEST COURSE ON PDO RELEASED ON 18/05/2016</strong></p>\n\n<p>This course teaches PHP Data Objects (PDO), one of the available API for connecting to databases within PHP. PDO is an object oriented extension which was introduced with PHP 5.1, taking advantage of several features introduced into PHP at that time. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this step by step course both beginners and experienced web developers will gain a comprehensive understanding of the modern PDO extension and how it can be used to create scalable database driven application.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This PHP with PDO course uses MySQL database to teach PDO concept and finally you learn how to build a basic task list using the concepts that has been taught in the course. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">My Approach </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course I use simple examples that can be easily understood to illustrate concepts and build upon it. \n\n  </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">See What Students are saying </strong><br></p>\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"This was perfect for my skill level as an advanced beginner to lower intermediate PHP developer. Terry wastes no time, and the whole course is packed with great information. I also really like the Material Design CSS and JS used in the course, since I had never used it before. I am very appreciative of this knowledge I gained, and plan to go through the whole thing again, and use it as a reference later</em>.\" - <strong class=\"redactor-inline-converted\">Collin Stubblefield</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\"<em class=\"redactor-inline-converted\">Managed to complete making a PDO tasklist! very helpful! the content is well put together! understood some core concept of PHP PDO! overall highly recommended! keep making more videos! If you can make a shopping cart! for tutorial basis! thanks!</em>\" -<strong>Brian Gichohi</strong></p>\n\n\n\n\n\n\n\n<p>\"<em class=\"redactor-inline-converted\">The instructor is clear and engaging also knowledgeable and passionate about the course. The course is well taught by the instructor</em>\" - <strong class=\"redactor-inline-converted\">Abimbola Makinwa</strong></p>\n\n\n\n\n\n\n\n\n\n<p> </p>\n\n\n\n\n\n\n\n<p><em>\"Terry is a great teacher.  He goes the extra mile to ensure student satisfaction.  He even offers to remotely connect to your machine to help out if your code is not working the way it should.  Thanks ever so much.</em>\" - <strong class=\"redactor-inline-converted\">Sahid Camara</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Timely Support!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you ever encounter any problem why taking this course, don't worry I am always here to help and guide you through. \n\n  <strong class=\"redactor-inline-converted\">Enroll today</strong> and get the skills and knowledge you need to succeed as a PHP developer. Every minute you let by is money and opportunity that are passing you by.</p>", 
    "end_date": null, 
    "title": "PHP with PDO: Build a Basic Task List with PHP, PDO & MySQL", 
    "price": "30.00", 
    "instructors": "Osayawe Terry Ogbemudia", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/787164_60d0_2.jpg", 
    "course_url": "https://www.udemy.com/php-with-pdo-build-a-basic-task-list-with-php-pdo-mysql-ajax/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-09T10:35:56Z"
}