{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>PHP is the most popular</strong> server side language used to build many of the websites on the internet today.   PHP is not as difficult as many people expect and having an understanding of how to <strong>use PHP code</strong> opens a <strong>new world for web developers.</strong><br></p>\n\n<p>This course is designed to be easy to follow along, its encouraged to practice the code being presented through out the course.  Resources, source code, and everything you need to learn PHP is provided.   Start with simple PHP functionality as we explain how it integrates with HTML.</p>\n\n\n\n<p>PHP is exciting and we want to introduce PHP to you.</p>\n\n\n\n<p> This step by step course shows you the code you need to know to accomplish dynamic server side web development with PHP<br></p>\n\n\n\n<p>We cover all the core fundamental concepts of PHP that you need to know in order to effectively create your own PHP code.</p>\n\n\n\n<p>Learn about these PHP code concepts and much more.....<br></p>\n\n\n\n<ul><li>Setup PHP</li><li>Coding PHP</li><li>PHP errors</li><li>PHP variables</li><li>PHP operators</li><li>PHP conditional statements</li><li>PHP loops</li><li>PHP arrays </li><li>PHP functions and more</li></ul>\n\n\n\n<p>Knowing how to apply PHP is an excellent skill to have. PHP is everywhere and by the end of this course you will have what you need to use it on your own webpages.<br></p>\n\n\n\n<p>We walk you through step by step with detailed explanations of code and more. </p>\n\n\n\n<ul><li>quick lessons get right to the point</li><li>fully covered topics with real world examples</li><li>source files downloadable to work along</li><li>challenges and lessons and code samples</li><li>code snippets</li><li>Links to top resources to save time</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li><li>quick response support to students</li><li>regular discussions</li></ul>\n\n\n\n<p>We teach you the latest techniques and tools to use in order to create amazing web content. Everything you need to know is included in this course. Learn at your own pace, lifetime access to this course.</p>\n\n\n\n<p>We show you how to write PHP code, easy to learn. Our tutorials are easy to follow and effective in teaching PHP.</p>", 
    "end_date": null, 
    "title": "PHP Essential How to create build Amazing websites with PHP", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674646_040e.jpg", 
    "course_url": "https://www.udemy.com/php-essential-how-to-create-build-amazing-websites-with-php/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T16:21:03Z"
}