{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>¿Buscando el curso perfecto que te enseñe a programar cualquier aplicación o sitio web?</em></p>  <p><em>¿Cansado de ver tutoriales aburridos y mal explicados?</em></p>  <p>Bienvenido a <strong><em>PHP y MYSQL: El Curso Completo, Practico y Desde 0</em></strong>, el curso en el que aprenderás <strong>paso por paso y desde lo más básico</strong> a programar cualquier Aplicación o Sitio Web de una forma práctica y sencilla.<br>Este curso es tu oportunidad de crear sitios en uno de los lenguajes más utilizados del mundo.</p>  <p><strong>Sitios como Facebook, Wikipedia, Tumblr e incluso Udemy han sido creados con PHP!</strong></p>  <p><u>El siguiente gran sitio web podría ser creado por ti y este curso te da la oportunidad de aprender lo que necesitas para hacerlo.</u></p>  <p><strong>No importa si nunca antes has programado, el curso está diseñado para que aprendas desde lo más básico</strong> hasta un nivel en el que podrás crear tus propias Aplicaciones y Sitios Web Funcionales.</p>  <p>El curso inicia con los fundamentos de PHP, en los cuales aprenderás y dominaras todas las estructuras del lenguaje de programación tales como <em>Variables, Ciclos, Condicionales, Arreglos, Funciones</em> y entre muchas otras.</p>  <p>Seguido aprenderás a crear bases de datos en MySQL y los fundamentos del lenguaje SQL. Para después crear aplicaciones dinámicas conectando nuestras bases de datos a PHP.</p>  <p><strong>Además durante el curso pondrás en práctica todo lo aprendido mediante los múltiples proyectos reales en los que crearemos Formularios de Contacto, Galerías de Imágenes, Páginas de Registro de Usuarios e incluso un Blog que programaremos desde 0.</strong></p>  <p>Al final del curso serás capaz de crear cualquier Aplicación o Sitio web que desees. Ya sea un proyecto personal, la web de tu empresa o inclusive tu propia red social.</p>  <p><strong>¿Qué incluye este curso?</strong></p>  <ul><li>14 horas en video en las que aprenderás más de 100 temas diferentes.</li><li>5 Proyectos en los cuales practicar todos los conocimientos Aprendidos.</li><li>Acceso a todo el código del curso, incluyendo las Prácticas.</li><li>Garantía de 30 días.</li></ul>        <p>¡Por si fuera poco, aprenderás como publicar tu propia página web en Internet para que todo el mundo pueda acceder a ella!</p>  <p><strong> </strong></p>  <p><strong>Aprenderás:</strong></p>  <ul><li>A programar en PHP, el lenguaje de programación más importante en Internet.</li><li>A trabajar con bases de datos en MySQL.</li><li>A crear Formularios de Contacto, Galerías de Imágenes, Paginas de Registro de Usuarios, Blogs y mucho más.</li><li>A subir tu propia página web a Internet para que todo el mundo pueda acceder a ella.</li></ul>        <p><strong>¿Porque estoy compartiendo todo esto contigo?</strong></p>  <p>Mi nombre es Carlos Arturo Esparza y soy el creador de numerosos proyectos incluyendo <em>FalconMasters un canal de Youtube con más de 80.000 suscriptores y más de 5 MILLONES de reproducciones</em> en el que enseño Diseño y Desarrollo Web mediante tutoriales amenos y prácticos.</p>  <p><u>A la gente le encantan mis videos por la facilidad que tengo para explicar las cosas de una forma única.</u> (Puedes comprobarlo en los comentarios de cualquier video de mi canal de YouTube).</p>  <p>Durante mi carrera como desarrollador web me he dado cuenta de la importancia que tiene saber PHP y de todos los beneficios que ahora me otorga.</p>  <p><strong>Gracias a PHP ahora puedo trabajar desde casa y ganar dinero haciendo lo que más me gusta.</strong></p>    <p>Quiero compartirte este conocimiento porque quiero que tú también puedas hacerlo, <strong>gracias a este curso.</strong></p>    <p><strong>No esperes más y empieza a crear sitios web con este curso.</strong><br> Si no te gusta te devolvemos tu dinero en 30 días.</p>", 
    "end_date": null, 
    "title": "PHP y MYSQL: El Curso Completo, Practico y Desde 0 !", 
    "price": "20.00", 
    "instructors": "Carlos Arturo Esparza", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672600_1def_7.jpg", 
    "course_url": "https://www.udemy.com/php-y-mysql/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-17T20:10:05Z"
}