{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\">Update #1 ---   11/06/2015 ---- 8 videos added</strong></p><p><strong style=\"\">What is PHP?</strong></p><p>PHP (recursive acronym for PHP: Hypertext Preprocessor) is a widely-used open source general-purpose scripting language that is especially suited for web development and can be embedded into HTML.</p><p>Ok, this is some great jargon, but what that actually means? </p><p>Let&#039;s take a simple example of this website on which you are learning. This website allows you to create an account and keep track record of your details such as login credentials, course completed, payment etc. Now this all work is done via a server side scripting language and database. PHP is one of those language that can process all of the back end work and will serve you correct information. All PHP is free and there is no licensing fees associated and this might be the biggest reason why Facebook was developed in PHP.</p><p><strong style=\"\">What is the current market status of PHP?</strong></p><p>PHP market never went off and there is no such chance in the near or far future. Even the entire Word press is designed in PHP. There are always plenty of projects in the market as well as on freelancing websites. No doubt, it is a good investment of time to learn PHP. </p><p><strong style=\"\">How can I start to learn PHP?</strong></p><p>First of all, Great decision that you want to learn PHP. Now, PHP is very simple to learn if you get a course that starts from scratch and goes till the end of project creation, and you are on the right page. This course will guide you from installation, troubleshooting to learn every concept in chunks and finally you will learn to combine those chunks and create a variety of projects with that knowledge. </p><p><strong style=\"\">Any more special to offer before I join into the course?</strong></p><p>The course is not just a onetime get course. This course will get frequent updates and new videos based on students problems as well as more project videos will be added. Also you will get 30 days, no question asked, and money back guarantee. But we will make sure that, we will serve you the best and most comprehensive course over the internet. Course is divided into small steps and covers all the PHP stuff that you will ever need.</p><p><strong style=\"\">See you in the course !</strong></p>", 
    "end_date": null, 
    "title": "PHP super series from scratch. Learn with projects", 
    "price": "50.00", 
    "instructors": "Igneus Technologies", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495390_b798_3.jpg", 
    "course_url": "https://www.udemy.com/php-tutorials/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-06T20:27:54Z"
}