{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tHello, and thank you for checking out my course!  </p>  <p>  \tSo do you own a website or code PHP? If so this course is perfect for you!  </p>  <p>  \tYou might know this or you might not, but if you don&#039;t know about web security your website is more then likely vulnerable and hackers could use this to take down your website or even steal your data.  </p>  <p>  \tHacking is still alive to this date, hackers will search the internet looking for exploitable websites to attack. If a hacker find this exploit, what they can do is honestly endless. They could execute code on your site, they could use your web server for other attacks they might do. They could honestly do anything they wanted. They could even steal your data E.G Credit card information of your clients, emails, phone numbers or anything you save on your website.  </p>  <p>  \tOnce your website is hacked your credibility goes down the hill, do you think someone would use your service if you&#039;ve been hacked in the past? No they wouldn&#039;t. So take an hour out of your day to fix all theses exploits and make sure no one can hack your website!  </p>  <p>  \tIn this course I have shown examples of every known exploit to this date. I will also keep updating this course when new exploits are found.  </p>", 
    "end_date": null, 
    "title": "PHP Security/Website Security - Secure your website today!", 
    "price": "20.00", 
    "instructors": "KB Entreatment", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305162_a6c3.jpg", 
    "course_url": "https://www.udemy.com/php-security-website-security-secure-your-website-today/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-22T04:33:01Z"
}