{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>O curso de PHP Expert tem por objetivo principal ensinar todos os passos necessários que um iniciante na linguagem PHP precisa para seguir a carreira como programador profissional. Nela você terá todos os conhecimentos exigidos pelo mercado, do mais elementar ao mais avançados.</p>\n\n\n\n<p>Uma das grandes características marcantes deste curso é que mesmo que o seu nível de conhecimento seja zero, ainda assim conseguirá compreender e se desenvolver como programador, pois da maneira como é ministrado o curso você terá todas as aulas passo a passo, explicado de forma detalhada, com uma linguagem simples, clara e objetiva. Em todo o instante você será apresentado a conteúdos que de fato contribuirão no seu aprendizado, sem rodeios, sem conteúdos inúteis e acima de tudo muita prática, pois a junção da teoria e prática é sempre o melhor caminho para fixar o conhecimento.</p>\n\n\n\n\n\n\n\n<p>PHP Expert é fruto de minha experiência de mais de 10 anos como programador e também como professor na internet. Neste período já recebi diversas dúvidas e perguntas dos mais variados tipos de alunos de todas as regiões do Brasil, com diferentes níveis sociais. Também tenho diversos alunos em países de língua portuguesa como Angola, Moçambique, Cabo Verde, Portugal. Assim como brasileiros que vivem em outros países como Suíça, Japão, Itália, EUA.</p>\n\n\n\n\n\n<p>O mais interessante nesta variedade de alunos é que na sua essência as dúvidas e perguntas são bastante semelhantes. O curso PHP Expert dar a você um roteiro de estudo e o conduz neste roteiro ensinando e solidificando cada assunto de forma que ao final o seu conhecimento será bastante profundo e concreto, tendo toda a base que você precisa para seguir na sua carreira de programador.</p>\n\n\n\n<p>Ao final do curso você desenvolverá um sistema completo de área de membros.</p>", 
    "end_date": null, 
    "title": "PHP Experts - Completo e Passo a Passo", 
    "price": "50.00", 
    "instructors": "Manoel Jailton Nascimento", 
    "commitment": "70 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/808344_2c3b.jpg", 
    "course_url": "https://www.udemy.com/curso-de-php-completo/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-30T17:11:09Z"
}