{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Curso de PHP O.O usando AdoDB, aprenda a criar uma loja virtual (carrinho de compras) até a geração do boleto bancário. Usei: Mysql e Dreamweaver cs4. São 163 videoaulas, 8.5 gigabytes em arquivos.</p><p><strong>Quer evoluir em php, criar loja virtual, dominar O.O. ?? Esse é o curso perfeito para você.</strong></p><ul><li>Veja um pouco do que você vai aprender nas 163 videoaulas:</li><li>Aprenda PHP Orientado a Objetos até 5 camadas</li><li>Aprenda a usar o framework AdoDB</li><li>Veja como criar um a loja virtual completa</li><li>Gerar Boletos Bancários</li><li>Criar a parte administrativa do site</li><li>Criar a parte visual (do usuário final)</li></ul><p><strong>Veja um pouco mais do que irá aprender a fazer:</strong></p><ul><li>Aprenda a criar uma loja virtual, com carrinho de compras, parte administrativa e geração de boletos</li><li>Você poderá aumentar a quantidade de produtos, eliminar itens do carrinho, continuar comprando e finalizar o pedido.</li><li>Em finalizar o pedido, o cliente tem a opção de entrar com seu login e senha ou se cadastrar no site</li><li>Depois de ter escolhido os produtos, acessado com seu login e senha, o cliente visualiza a tela final para conferir e finalmente gerar o boleto bancário para efetuar o pagamento</li><li>Você poderá gerar o boleto para qualquer banco ou até para todos os bancos</li><li>Você vai aprender a criar a parte administrativa para manipular os produtos e categoria que estarão na loja virtual que o cliente irá ver</li><li>Claro que somente pessoas autorizadas poderão acessar a parte administrativa, o controle é feito através de sessões</li><li>Aprenda a fazer upload das imagens dos produtos, e você poderá mais de uma imagem por produto</li><li>O curso todo é feito em O.O. usando AdoDB em camadas, veja que para produtos são 4 arquivos, assim, seu código ficará muito mais organizado e profissional</li><li>O sistema carrinho de compras foi todo modelado com powerdesigner</li><li>Para esse curso foi usado o MySQL</li></ul>", 
    "end_date": null, 
    "title": "PHP O.O. Loja Virtual, Adodb em 163 videoaulas", 
    "price": "30.00", 
    "instructors": "Neri Neitzke", 
    "commitment": "23.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632460_5589.jpg", 
    "course_url": "https://www.udemy.com/php-oo-loja-virtual-adodb-em-163-videoaulas/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T14:46:21Z"
}