{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Learn PHP &amp; MySQLi web development from scratch by understanding basic PHP functions and create your very own applications &amp; projects using PHP &amp; MySQL.  </p>  <p style=\"\">  \t<strong style=\"\">Build a strong web development foundation by learning PHP &amp; MySQLi open source technologies with these basic video tutorials including apps:</strong>  </p>  <ul style=\"\">  \t<li>Basic PHP Understanding</li>  \t<li>Basic MySQLi Understanding</li>  \t<li>PHP Basic Functions &amp; Commands</li>  \t<li>Advance PHP Functions</li>  \t<li>Object Oriented Programming (OOP) Concept</li>  \t<li>MySQLi - Insert/View/Delete/Edit Operations</li>  \t<li>Creating a Calculator in PHP</li>  \t<li>Creating a Currency Converter in PHP</li>  \t<li>Creating a Complete Registration Form in PHP</li>  \t<li>Creating an Online Voting System in PHP</li>  </ul>  <p>  \t<strong style=\"\">Learning PHP &amp; MySQL is easy</strong>  </p>  <p>  \t          PHP is open source and free to use, as MySQLi is open source and free to use too, this combinations makes it the best solution for web developers, this course covers a variety of PHP functions as well as MySQLi queries, with over 8 hours of content and more than 70 lectures, it walks you through the exact process in order to be able to work as a PHP and MySQL developer.  </p>  <p>  \t<strong style=\"\">Content &amp; Duration: </strong>  </p>  <p>  \t  Learning from very basic takes some time, but after the initial stages, you&#039;ll get it very easy, and it shouldn&#039;t take more than a month to master this program, the PHP web development is not that difficult to learn as shown on the web, but with a practical &amp; positive approach, it gets very easier gradually.  </p>  <p>  \t  The content is structured for starters, who want to start from absolutely scratch, but along the way, you&#039;ll learn creating projects like registration form, voting system, calculator and currency converter, which means you&#039;ll take your skills ahead of your thoughts.  </p>  <ul style=\"\">  </ul>", 
    "end_date": null, 
    "title": "PHP & MySQL Web Development From Scratch - Build 5 Projects", 
    "price": "20.00", 
    "instructors": "Abdul Wali", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425526_8437_2.jpg", 
    "course_url": "https://www.udemy.com/php-mysqli-web-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T01:35:41Z"
}