{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t <strong style=\"\">Learn How to Code Dynamic Websites with PHP </strong><em style=\"\">f</em><em style=\"\">or absolute beginners!</em>  </p>  <p>  \t This course is a total beginners guide to coding dynamic websites with PHP so you need <em style=\"\">no prior knowledge or experience with PHP — </em>although, it is a good idea if you know <em style=\"\">some</em> HTML &amp; CSS. <em style=\"\">(My beginner&#039;s guide Build a Website from Scratch with HTML &amp; CSS will teach you everything you need to know about HTML &amp; CSS.)</em>  </p>  <p>  \t <strong style=\"\">Practical Hands-on Approach</strong>  </p>  <p>  \t            My approach with this course, like many of my courses, is to take a practical &quot;hands on&quot; approach. While there will be some theory involved — every single lesson requires you to get your hands dirty and exercise what you&#039;ve learned in that specific lesson. I find this to be the best approach, because you&#039;re able to retain much more of what you learned, and therefore, get up and running with maximizing your practical knowledge of PHP quickly!  </p>  <p>  \t <strong style=\"\">Why Should I Learn PHP?</strong>  </p>  <p>  \t            So — why learn PHP? Well, PHP is a very powerful scripting language used by millions of websites. Some of the most popular websites and frameworks utilize PHP to build their dynamic websites. PHP works very well with HTML, and therefore will allow you to start coding dynamic websites quickly without having to learn some of the more complicated scripting languages out there.  </p>  <p>  \t <strong style=\"\">You Will Love This Course</strong>  </p>  <p>  \t            I think you&#039;re going to love this course, and you&#039;re going to especially love what you&#039;re going to learn. When I first started learning PHP, I <em style=\"\">couldn&#039;t wait </em>to start implementing what I learned into my websites! I think you&#039;ll feel the same.  </p>  <p>  \t <strong style=\"\">It&#039;s Totally Free!</strong>  </p>  <p>  \t            Also, I am excited to be offering this course <em style=\"\">absolutely free</em> for three reasons:  </p>  <ol style=\"\">  \t<li>I don&#039;t want a purchasing decision to get in the way of you learning what I have to offer in this course.</li>  \t<li>I want as many people as possible to be able access the content.</li>  \t<li>I want to give you learning material so good that it <em style=\"\">should </em>cost money.</li>  </ol>  <p>  \t <strong style=\"\">The Final Project</strong>  </p>  <p>  \t <strong style=\"\"></strong>Throughout the course you will be building a handful of dynamic PHP examples, but in the last section of the course, we will build a dynamic website for a (fictional) restaurant.  </p>  <p>  \t            So, I invite you to join me in learning how to Code Dynamic Websites with PHP!  </p>  <p>  \t            Let&#039;s do this.  </p>", 
    "end_date": null, 
    "title": "Practical PHP: Master the Basics and Code Dynamic Websites", 
    "price": 0, 
    "instructors": "Brad Hussey, Code College", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/130064_22b3_9.jpg", 
    "course_url": "https://www.udemy.com/code-dynamic-websites/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-06T22:45:20Z"
}