{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t            Are you wondering how Liquid Markup can help you build better online businesses in Adobe Business Catalyst? This course provides examples showing how to best use Liquid Markup in your projects. Not only does this course share solutions to common problems, but helps build up your Liquid Library.  </p>  <p style=\"\">  \t<strong style=\"\">Solutions to Common Problems</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>Reading documentation will help you with the technical specifics, but understanding how  Liquid Markup fits into your projects will open a whole world of possibilities. Each lesson gives you a look at what can be done when you combine built-in Business Catalyst features with Liquid Markup.  </p>  <p style=\"\">  \t    Concepts covered in this course:  </p>  <ul style=\"\">  \t<li>Variables</li>  \t<li>Loops</li>  \t<li>Filters</li>  \t<li>Dates</li>  \t<li>Sorting</li>  \t<li>Collections</li>  \t<li>More...</li>  </ul>  <p>  \t<strong style=\"\">Liquid Library</strong>  </p>  <p style=\"\">  \t      One of the advantages of Business Catalyst is its ability to significantly speed up site development. This is the same reasoning behind using a common Business Catalyst library. A library full of ready-to-use includes will allow you to add common features to your sites in seconds instead of hours or days. This course not only comes with powerful library items, it provides information on how to start a Liquid Library, and how to add your own items.  </p>  <p style=\"\">  \t<strong style=\"\">Instructors</strong>  </p>  <p style=\"\">  \t            Scott B Reynolds with Thrise, and Dave Haggblad with Digital Ink Multimedia have worked countless hours using Liquid Markup in their own projects and on other Business Catalyst Partners&#039; projects. Many of the examples come from actual projects, proving their value. There&#039;s no need to start from scratch. Join us for Liquid Lessons.  </p>", 
    "end_date": null, 
    "title": "Practical Liquid Markup Examples for Adobe Business Catalyst", 
    "price": "50.00", 
    "instructors": "Scott Reynolds, Dave Haggblad", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402992_f3d0_8.jpg", 
    "course_url": "https://www.udemy.com/practical-liquid-markup-examples-for-adobe-business-catalyst/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T15:37:33Z"
}