{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Want to really understand Web Development but don't know where to start. are you overwhelmed by technical buzz words such as NodeJs and JQuery? </p><p>You probably know the end result you want: To understand the whole enchilada of Web Development.</p><p>The Web development arena is vast and it is ever growing. There is no way for any one person to know it all. There is one critical skill and that is a practical understanding of the whole space. It doesn't matter if you are a designer, a content author or perhaps someone that has been tasked to bring the whole thing together. With the knowledge you get from this course, you will have an understanding of all the major areas of Web development and the highly important touch points.</p>\n\n\n\n\n\n<p>I start you off with some of the key concepts of successful web design. Some of these are often overlooked such as the development lifecycle and Search engine optimization. Others you may know something about but are not sure how it impacts the success of your site. The first section of this course gives you the foundation you need to get your site off the ground</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Next, I go over web security and how it has become a major topic of discussion and concern for anyone involved with Internet technologies.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The last section goes over all of the technologies that make up websites and applications. By the end of this course, you will know what each of the technologies are and what they do. This course does not intend to teach you how to write or use any of these but instead gives you enough understanding about each to know where you want to focus your learning next.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is all about understanding. Once you have that the rest is up to you. Do you want to learn to code it yourself or farm that work out to someone else. You will have the skills to make that decision and be well on your way to becoming a first class developer.</p>", 
    "end_date": null, 
    "title": "Practical Guide to Web Development", 
    "price": "20.00", 
    "instructors": "Bob Creigh", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823236_10c0_2.jpg", 
    "course_url": "https://www.udemy.com/designers-guide-to-web-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T22:32:44Z"
}