{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Looks Are Everything!</strong></p><p>Learn the basic concepts, tools, and functions that you will need to build fully functional Website using CSS  and HTML.</p><p><strong>Build a strong foundation in CSS with this hand on-tutorial crash course.</strong></p><ul><li><strong>Fundamental difference between CSS and HTML</strong></li><li><strong>CSS Editing techniques</strong></li><li><strong>Inspect Element Tool for outstanding Website design consideration</strong></li><li><strong>CSS coding techniques</strong></li></ul><p>You surf the internet every single day and come across several Websites with varying designs and layouts. The fact of the matter is that - the difference between an outstanding site and a terrible site is the quality of its <strong>CSS development</strong>.</p><p>So, Are you looking for the easiest and fastest way to learn how to build your own beautiful websites with CSS? And how to even make them into a <strong>responsive Website</strong>?<span></span></p><p>With little innovation and few techniques, you can build outstanding Website design using <strong>CSS coding skills</strong> - This course teaches you how to identify CSS on a Website, understand what goes behind the scene, and then be able to design and code like an expert!</p><p>At the end of the course, you will have a complete, ready-to-launch outstanding website that looks great on any desktop computer, tablet and smartphone. You get the entire code and all the images and graphical assets that I designed especially for the course as a free download.<br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Practical CSS Website Development: Crash Course ", 
    "price": "20.00", 
    "instructors": "Syed Raza", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736940_0fb1_5.jpg", 
    "course_url": "https://www.udemy.com/css-website-development-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T16:19:32Z"
}