{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Probar Django 1.9 </strong>es un video tutorial de Django para principiantes. Un curso ideal para gente sin mucha experiencia técnica ya que Django es un framework que fomenta el desarrollo rápido junto a un diseño limpio y pragmático. Te enseñaremos lo suficiente --sin marearte-- para que te quedes con una buena base para después, poder crear una aplicación web.<br></p><p><strong>Crear el proyecto de tus sueños en poco tiempo.</strong><br></p><ul><li>Empezar un proyecto con Django</li><li>Acabar con una página de aterrizaje (\"landing page\") lista para personalizar</li><li>Instalar todo el software necesario</li><li>Aprender los componentes básicos del framework</li><li>Escribir código utilizando el lenguaje de programación 'Python'</li></ul><p><span></span></p><p>Django es un backend framework de código abierto y de alto nivel, utilizado por Instagram y Pinterest. Con Django es posible construir aplicaciones web muy útiles y poderosas para todos tus proyectos. Está escrito en Python, un lenguaje de programación potente y muy expresivo, es perfecto tanto para expertos como para principiantes. </p><p>Las comunidades de Django y Python no dejan de crecer, únete y verás las posibilidades que te salen!</p><p><strong>Resumen del Curso</strong></p><p>Este curso con enfoque práctico está dirigido a gente motivada y sin experiencia técnica ya que con Django se puede crear aplicaciones escribiendo el menor código posible. </p><p>Como está escrito en Python, aprenderás el concepto de programación orientada a objetos (POO, u OOP según sus siglas en inglés), un paradigma de programación que usa objetos en sus interacciones, para diseñar programas informáticos. Está basada en varias técnicas, incluyendo herencia y encapsulamiento.</p><p>Siguiendo el curso, crearás una página de aterrizaje --pasito a pasito-- algo que te servirá como base para tu gran proyecto, una aplicación web con mucha funcionalidad. </p><p>Por último, doy explicaciones para principiantes, es decir, no te explicaré \"en marciano\". Quiero que tu primera experiencia con Django sea agradable NO frustrante! </p><p><strong>Elementos de Django que cubrimos en este curso:</strong></p><ul><li>Formularios (Django Forms y Model Forms)</li><li>Modelos</li><li>Vistas</li><li>Interfaz Administrativa</li><li>Plantillas</li><li>URLs </li><li>Archivos Estáticos (imágenes)</li><li>Diseño Básico (HTML &amp; CSS)</li><li>QuerySets</li><li>y MUCHO MÁS!</li></ul><p><strong>¿Por qué 'Probar Django 1.9'?</strong><br></p><ul><li><strong>34</strong> videos y <strong>4</strong> horas de lecciones</li><li>Aprenderás los elementos básicos de Django para crear un proyecto personalizado y con mayor funcionalidad</li><li><span></span>Te presentaré los conceptos complejos de manera sencilla</li><li>Porque estaré contigo durante todo el proceso: escribiremos el código juntos y si te pierdes, repítelo todas las veces que haga falta!</li><li>Y si aún tienes preguntas o si surgen dudas, <em>te contestaré</em> en poco tiempo!</li></ul>", 
    "end_date": null, 
    "title": "Probar Django | Construir una Aplicación Web en Python", 
    "price": 0, 
    "instructors": "Justin Mitchel, Karlita K", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/729456_60dc.jpg", 
    "course_url": "https://www.udemy.com/probar-django-construir-una-aplicacion-web-en-python/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T21:31:45Z"
}