{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Have you ever wanted to know the secrets behind all the cool things that WordPress plugins and themes can do? This course is offered by an instructor who has developed over 250 WordPress plugins for major corporations and can now teach these skills to you.</p><p><strong>For Those Developers Who Would Like To Know How To Develop Powerful WordPress Plugins!</strong><br></p><p>After getting frustrated, because maybe a downloaded plugin does not fit your needs, why not take your WordPress programming skills to the next level and really learn how to develop your own plugins or customize other downloaded plugins to fit your needs?</p><p><strong>For PHP Developers</strong></p><p>Programming in WordPress is a snap when you already know PHP. This course shows how to take that PHP experience and parlay into professional WordPress development.</p><p><strong>OVER 7 FREE PLUGINS INCLUDED WITH THIS COURSE!</strong></p><p><strong>Some Videos Come With FREE Complete Plugins</strong></p><p>Besides just teaching the advanced concepts, some videos come with complete plugins that can be downloaded and used immediately after some customization as explained in each video.</p><p><strong>In this course, I teach the powerful WordPress development concepts from:</strong></p><ul><li>Developing WordPress plugins: from basic plugins to powerful advanced plugins</li><li>Adding fields to the user profile page</li><li>Hook programming and how to use them in your themes and plugins</li><li>Over 20 popular WordPress hooks available for use in your plugins and themes</li><li>Changing post and page content on the fly</li><li>Displaying messages on the administrative back end to writers, contributors and other users</li><li>User management</li><li>Writing your own dashboard and sidebar widgets</li><li>Hiding certain admin links and dashboard widgets from other users</li><li>Security hacks such as redirecting unauthorized users away from the wp-admin login form.</li></ul><p><br></p><p><strong>When students finish this course, they will have a powerful WordPress programming skill that most developers do not have and trust me, this looks amazing to other programmers and on your resume.</strong></p>", 
    "end_date": null, 
    "title": "Professional WordPress Plugin Development for 2016", 
    "price": "20.00", 
    "instructors": "Bruce Chamoff", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529028_8748_3.jpg", 
    "course_url": "https://www.udemy.com/advanced-wordpress-development-take-control-of-the-back-end/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T23:15:11Z"
}