{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn the basic concepts, tools, and functions that you will need to build beautiful and modern websites using HTML5 &amp; CSS3.<br></p><p>Build a strong foundation in HTML and CSS with this tutorial for beginners. </p><ul><li>Code in HTML</li><li>Code in CSS</li><li>Understand the CSS Box Model</li><li>Combine CSS and HTML to create a beautiful modern website</li></ul><p><br></p><p><strong>A Powerful Skill at Your Fingertips </strong><br>Learning the fundamentals of HTML5 &amp; CSS3 puts a powerful and very useful tool at your fingertips. HTML &amp; CSS are free, easy to learn, has excellent documentation, and is the base for all things on the web. . </p><p>When I am asked: Where should I start if I want to learn programming? My response is always HTML and CSS. Have you ever wanted to dive further into Wordpress themes? Have you ever wanted to create a beautiful HTML email? Or maybe you just want to be able to design websites. This course is the place to start.</p><p><strong>Content and Overview </strong><br><br>Suitable for beginning programmers, through this course of 56 lectures and 6 hours of content, you’ll start by downloading a text editor and coding in HTML. Random lectures have specific \"challenges\" sprinkled in. </p><p>After creating some basic web pages and learning about HTML syntax we will go over the differences and changes in HTML 5.(Todays standard)</p><p>With the basics of HTML established, we will begin to dive into the world of cascading style sheets.(CSS) We can supercharge our learning by tackling both at the same time.</p><p>Finally, we take the course into \"project mode.\" We will go step by step, line by line, and code our own modern and beautiful website using CSS3 and HTML5. </p><p><br></p><p>This course was created to establish a foundation in programming by learning HTML5 and CSS3. These are the building blocks of all websites.<br></p><p>This course is targeted towards teaching every day people to code, not just computer science majors. </p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Programming Foundations: HTML5 + CSS3 for Entrepreneurs 2015", 
    "price": "20.00", 
    "instructors": "Andrew Eddy", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505208_2307_4.jpg", 
    "course_url": "https://www.udemy.com/html-css-more/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-18T14:25:43Z"
}