{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>JavaScript es uno de los lenguajes más difundidos en la actualizada, ya que se ejecuta en los 5 principales navegadores. Sin embargo, aunque es un lenguaje orientado a objetos, se acostumbra programar los scripts en programación funcional o estructurada.</p>\n\n<p>En tiempos modernos, es necesario hacer aplicaciones más complejas y fáciles de mantener, por lo que el paradigma de la programación orientada a objetos es necesaria. Usted encontrará en este curso que es sencillo programar orientado a objetos con JavaScript, lo que permitirá hacer a usted código más limpio y mantenible.</p>\n\n<p>En este curso iniciaremos desde los principios básicos de la programación orientada a objetos, definiendo lo que es herencia, encapsulamiento, polimorfismo y abstacción, que son principios generales a cualquier lenguaje de programación irientada a objetos.</p>\n\n<p>Definiremos las propiedades y limitaciones del lenguaje, y cómo hacer nuestras aplicaciones orientada a objetos. Realizaremos diferentes ejemplos, como el manejo de imágenes con el canvas de HTML5, una aplicación de dibujo y otra para dibujos en mapas de bits.</p>\n\n<p>Este curso no es un curso básico. Usted debe conocer previamente los principios de programación con JavaScript, como un ciclo, una condicional o una variabl, los cuales no se ven en este curso, pero no necesita ser un experto en programación. Necesitará su computadora con internet, un navegador de los cinco principales y un editor de código HTML estándar.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Programación orientada a objetos con JavaScript", 
    "price": "20.00", 
    "instructors": "Francisco Javier Arce Anguiano", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/710446_5888_2.jpg", 
    "course_url": "https://www.udemy.com/programacion-orientada-a-objetos-con-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T04:38:05Z"
}