{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Update June 2015  - This course now includes live coding exercises to put into practice your new skills!</strong></p><p>J<strong>avaScript is eating the world</strong>. Starting as a web scripting language, JavaScript is now used not just for web development, but also game, mobile app, server and database development.</p><p>This course is the fastest way for you to get a basic understanding of <strong>JavaScript programming</strong>. Whether your goal is to build websites, HTML5 games and apps, or server-side programming, you need to learn the basics of the language and get it right from the start.</p><p>The first part of the course covers the basics of JavaScript and programming in general. The second part of the course is project-based and includes building a responsive dating app (only client-side).</p><p>This course is taught by <strong>Pablo Farias Navarro</strong>, founder of <strong>ZENVA</strong> and JavaScript developer. Pablo has created dozens of web applications and JavaScript games, authored over 40 online courses taken by over 85 students, created educational content for companies such as <strong>Amazon</strong> and <strong>Intel</strong>, and run live workshops on programming and HTML5 game development.</p><p>Some of the concepts you'll learn in this course:</p><ul><li>Variables and strings</li><li>Functions</li><li>Working with Arrays</li><li>Objects and JSON</li><li>Conditional statements</li><li>Loops</li><li>Accessing the DOM</li><li>Working with events and user interaction</li><li>Putting it all together in a fun project</li></ul>", 
    "end_date": null, 
    "title": "Programming for Entrepreneurs - JavaScript", 
    "price": "20.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101864_b984_7.jpg", 
    "course_url": "https://www.udemy.com/javascript-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-05T13:19:52Z"
}