{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Hai un'<strong>idea che vuoi sviluppare </strong>ma non sai come fare?</p><p>Stai <strong>cercando un web developer</strong> ma non sai come muoverti?</p><p>Vuoi <strong>intraprendere un percorso come programmatore</strong> ma non sai come iniziare?<br></p><p>Vorresti essere in grado di <strong>parlare un linguaggio comune</strong> ed essere credibile con i programmatori?</p><p>Sei <strong>incuriosito dalla programmazione</strong> e dal digitale e vorresti capire come funziona?</p><p><br></p><p><strong>Allora questo è il corso che fa per te</strong></p><p>Avere competenze di programmazione è diventato necessario nel mondo digitale. Questo corso è pensato per darti i fondamentali della programmazione che ti serviranno per muoverti con agilità in questo mondo.</p><p>In questo corso andrai a vedere come si approccia lo sviluppo di un progetto digitale, imparerai la terminologia adatta ed analizzerai i diversi linguaggi di programmazione principali per capire quali siano i più adatti per sviluppare il tuo progetto.</p><p>Per la fine di questo corso avrai le competenze che ti serviranno per cercare il developer più adatto a sviluppare il tuo progetto, interagire in maniera consapevole con i programmatori o avere la curiosità necessaria per intraprendere questa strada in maniera autonoma</p><hr style=\"\"><p><strong>Perché Lacerba?</strong></p><p>Vero, ci sono centinaia di corsi online su come avviare una StartUp. Questo corso è diverso perché:</p><ul><li>è tenuto da startupper, che ci sono passati, conoscono bene i primi ostacoli e applicano queste tecniche tutti i giorni, non da professori e/o consulenti</li><li>è incentrato sul mercato italiano, è in lingua italiana e racconta casi di StartUp italiane</li><li>è il primo passo per formare una community interattiva di startupper, per supportarci a vicenda e crescere assieme</li><li>approccio estremamente pratico, per darti delle competenze che puoi utilizzare da subito.</li></ul><hr style=\"\"><p><strong>Cosa imparerai in questo corso?</strong></p><ul><li>Che cosa significa programmare</li><li>Come funziona un computer e i software</li><li>La terminologia fondamentale</li><li>Le caratteristiche e differenze dei principali linguaggi di programmazione</li><li>Capire le differenze tra i principali linguaggi back end e front end</li><li>Come scegliere il linguaggio di programmazione giusto</li><li>Come si approccia il web development</li><li>I principali linguaggi e tecniche per sviluppare mobile</li></ul><hr style=\"\"><p><strong>Quanto tempo ci vorrà per terminare il corso?<br></strong></p><p>In totale i video durano meno di due ore. 10 minuti al giorno per 10 giorni sono più che sufficienti per seguire le lezioni.</p><p>La nostra piattaforma è già compatibile con smartphone e tablet, quindi anche quando sarai in giro potrai seguire i corsi. Del resto è sempre un buon momento per imparare!</p><hr><p><strong>Quali requisiti servono per capirne i contenuti?</strong></p><p>Nessuno! Questo corso è pensato proprio per darti i fondamentali della programmazione.</p><hr><p>Che aspetti dunque? Acquisisci subito le competenze di programmazione che ti serviranno per avere successo nel mondo digitale.</p>", 
    "end_date": null, 
    "title": "Programmazione per non programmatori", 
    "price": "30.00", 
    "instructors": "Daniele Ugolini", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656994_4724_2.jpg", 
    "course_url": "https://www.udemy.com/programmare/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-01T14:21:20Z"
}