{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The world&#039;s most advance course on Foundation is here. Learn responsive web development with Foundaton by building ten amazing websites. It has everything you need to master professional programming techniques in foundation. It is a through, elegant and practical course designed for everyone who wants to learn the Foundation framework. </p><p>The course starts with quick review of the Zurb Foundation Framework the open source tool chain for creating responsive websites. The following are the projects covered in the course</p><p><strong style=\"\">Business Website</strong></p><p>A detail discussion on navbar and Grid system</p><p><strong style=\"\">Photographer Image Gallery</strong></p><p>Learn the use of orbit slider, gallery pages and contact modal</p><p><strong style=\"\">Project Management UI</strong></p><p>Advance foundation concepts, form design and environment setup</p><p><strong style=\"\">Mobile Application</strong></p><p>Introduction to mobile app development concepts and foundation APIS.</p><p><strong style=\"\">Hosting Template</strong></p><p>Learn advance CSS design and HTML markup with foundation</p><p><strong style=\"\">Fitness website</strong></p><p>Learn Professional app development practices using Foundation</p><p><strong style=\"\">Ecommerce Theme</strong></p><p>Build a real world app that you can monetize</p><p><strong style=\"\">Foundation WordPress Theme</strong></p><p>Learn to combine Wordpress and Foundation in this awesome project</p><p><strong style=\"\">Restaurant Website</strong></p><p>Learn to use slick Slider and lightbox</p><p><strong style=\"\">Tech News Website</strong></p><p>Final project covering Mixture, tempates and includes</p><p>Learn to build all these cool projects while building a sound understanding of the underlying concepts. So enroll and lets get started</p>", 
    "end_date": null, 
    "title": "Projects in Foundation Framework - Learn By Building 10 Apps", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564268_b12d.jpg", 
    "course_url": "https://www.udemy.com/foundation-framework-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-25T08:13:27Z"
}