{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Express</strong> is one of the most popular and powerful framework to build web applications using nodejs. It is elegant, minimalistic and fast allowing developers to quickly create very powerful applications. It provides great number of features to make your life easy without hiding the node features which you can also directly use in your application. It can be used for building single page, multi page and hybrid web applications. </p><p style=\"\">In our course you will learn Express, Node and everything in between while working on real world projects. The Projects covered under this course are:</p><p style=\"\"><strong style=\"\">Project 1 : HTTP Server</strong> - It will teach you basic express functionality focussing on ground work required to build more complex apps.</p><p style=\"\"><strong style=\"\">Project 2: Computer  Repair Business Website </strong>- This will be a small business website and will use both node and express. You will also learn the use of Express generator and node mailer in this project.</p><p style=\"\"><strong style=\"\">Project 3: Sports Blog Application</strong> - It will be a CRUD application and will use MongoDB and Mongoose. You will learn about routing and other advance features present in professional web apps.</p><p style=\"\"><strong style=\"\">Project 4: User Login System</strong> - Learn to build a complete server side login system with built in authentication module. This project also uses MongoDb and Mongoose along with the Passport API.</p><p style=\"\"><strong style=\"\">Project 5: Learn to Build a Chat application</strong> - Build a complete Chat application using Node, Express and socket io. It will be a real time chat app and you will be able to learn a lot of stuff in this project.</p><p style=\"\"><strong style=\"\">Project 6: Client management application</strong> - Learn to build a complete application which uses the full power of the Mean stack. It will use front end component like angular in addition to express and node for building the projects.</p><p style=\"\"><strong style=\"\">Project 7: Job Board </strong>- Build a job board using Meanjs package. You will also learn the use of Angular filters and Yo generator in this project</p><p style=\"\"><strong style=\"\">Project 8: Movie Listing Application</strong> - Learn to develop a movie listing App with Express and KrakenJS. You will learn to use Mongoose for data models and search plugins.</p><p style=\"\"><strong style=\"\">Project 9: Instagram App</strong> - Learn to integrate Instagram APIs with express and build an app to show images and public feed. This will also track posts and followers for the users.</p><p style=\"\"><strong style=\"\">Project 10: Business Directory</strong> - Build a complete business directory using Couch DB and Express . This last project in the series will provide unique perspective in express development with a different nosql database.  </p><p style=\"\">Learn all this and much more about the cutting edge tool and be  part of the next genertaion of developers.</p>", 
    "end_date": null, 
    "title": "Projects in ExpressJS - Learn ExpressJs building 10 projects", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606756_2219.jpg", 
    "course_url": "https://www.udemy.com/projects-in-expressjs-learn-expressjs-building-10-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T07:53:18Z"
}