{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Imagine powering up your tablet and browsing a site you built. Or discovering the skills necessary to launch a career in web programming. Or imagine, after years of thinking about it, finally crossing “become code literate” off your bucket list. The Stone River eLearning course<em style=\"\"> Python Web Programming</em> will ease you through the big, vast world of Python web programming. Over the course of 7 hours, you&#039;ll be introduced to all the innovative concepts and foundational principles necessary to master web programming with Python. So whether you&#039;re an upstart programmer, an aspiring web developer, or someone just looking to gain a deeper understanding of python web programming, with this course you&#039;ll acquire the understanding and the confidence to conquer all things Python. </p><p><strong style=\"\">Three Reasons to Learn Web Programming With Python </strong></p><ul style=\"\"><li><strong style=\"\">It&#039;s easy and quick to learn:</strong> Forget strict syntax rules and endless strings of coding, Python was designed with simplicity in mind. And you&#039;ll be busy coding before you know it. Why? Because Python requires less time, less code and less concepts than all other programming languages. </li> <li><strong style=\"\">It&#039;s a stepping stone: </strong>New to object-oriented coding, or programming all together?<strong style=\"\"> </strong>Get your feet wet with the most versatile coding language on the market. Python Web Programming teaches you sound foundational skills that are easily transferable to other, more tedious languages. <strong style=\"\"></strong></li> <li><strong style=\"\">It&#039;s a money maker: </strong>The demand for Python web programmers is booming. In fact, it&#039;s the most popular coding language in the world. Used by giants like Google, Pinterest and Instagram, it&#039;s is the only language you&#039;ll need to begin a career in Python web programming, design your own games, software, websites and work with Big Data. And that&#039;s just for starters. <strong style=\"\"></strong></li></ul><p><strong style=\"\">How is this course different?</strong></p><p>We understand. There are other Python courses, but<em style=\"\"> Python Web Programming </em>dives deep into all aspects of web programming with Python. We pull back the curtain on web programming with Python—giving you an unparalleled understanding of the art and science behind it, but we don&#039;t stop there. You&#039;ll graduate with the all the tools necessary to build vibrant, sustainable web based programs. </p><p>You see, this course was created as a labor of love. In fact, it&#039;s delivered with a level of quality and expertise you&#039;d expect from an elite university ---not an online course. </p><p><strong style=\"\">What are the requirements?</strong></p><ul style=\"\"><li>A computer</li> <li>PC, Mac or Linux Operating Systems OK</li></ul><p><strong style=\"\">What am I going to get from this course?</strong></p><ul style=\"\"><li>Over ___ lectures and 7 hours of content!</li> <li>Acquire an in-depth understanding of Python web programming.</li> <li>Get hands on experience working with Python files and building programs</li></ul><p><strong style=\"\">What is the target audience?</strong></p><ul style=\"\"><li>Programmers</li> <li>Aspiring web developers and app creators</li> <li>Anyone aspiring to become code literate</li></ul>", 
    "end_date": null, 
    "title": "Python Web Programming", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523312_a0eb_3.jpg", 
    "course_url": "https://www.udemy.com/python-web-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T13:53:00Z"
}