{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This Course involves two primary targets: that is how to efficiently work as a full-stack developer by applying a unique theme from <em>Themeforest</em>, along with showing all stages of developing of a real e-commerce application with Ruby on Rails Framework.</p><p><strong class=\"redactor-inline-converted\">To whom the course is intended</strong>. </p><p>If you have basic knowledge of Ruby and Rails and you want to go to the next level - this course is definitely for you! A skillful developer can pick up solutions to a challenging task that the author had already encountered.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How to get the highest benefit from the course</strong>.</p>\n\n\n\n\n\n\n\n<p>There’s nothing wrong with imitation. Feel free to replicate. It is an good way to polish your skills and confirm your knowledge.</p>\n\n\n\n\n\n\n\n<p>After watching it I advise you try to write a code yourself. If you find another solution, that will be great! If you admit errors just draw your attention to. Take your time to rewind, mind the details. There is no hurry. This video will always be at yours. What you have to do is to understand the code you write. </p>\n\n\n\n\n\n\n\n<p>Besides that, Rail is an incredibly friendly and easygoing community. So let us pursue its principles. If you have something to share do it!. Whether you find an error fix it. Have any questions – ask them. I promise to search solution so that nobody feel to bump into a wall.</p>\n\n\n\n\n\n\n\n<p>However, try to do it yourself. If you find own solution you will get much more than an appropriate answer. You will get own experience that is far more invaluable.</p><p><strong>We will use next Frameworks systems and libraries:</strong></p><ul><li>Ruby on Rails version 4.2</li><li>ActiveAdmin administration framework for your Rails app </li><li>Figaro gem to securely set your environment variables</li><li>Paperclip gem - easy file attachment management tool</li><li>BrainTree API for accepting payments in your store</li><li>Heroku service to deploy our application</li><li>Puma Web Server </li></ul><p>Take this course if you want to create e-commerce RoR applications like pro. <br></p>", 
    "end_date": null, 
    "title": "Rails Ecommerce App with HTML Template from Themeforest", 
    "price": "25.00", 
    "instructors": "Ruby on Rails PRO Evgen Obraztsov", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858762_9ebd_3.jpg", 
    "course_url": "https://www.udemy.com/rails-ecommerce-app-with-html-template-from-themeforest/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T16:40:18Z"
}