{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t   Rapid Lo-Dash is a fast-paced introduction to using functional programming techniques in JavaScript.  </p>  <p style=\"\">  \t   You will start by setting up your development environment, and get your feet wet using Lo-Dash to work with arrays. Then you&#039;ll use Lo-Dash to work with JavaScript Objects and Types. You will then do some exercises to explore object keys and values, and duplicate objects and values. Then you will learn to create collections, extract data from them, and manipulate them. Once you&#039;ve seen the building blocks of Lo-Dash, you&#039;ll use functional programming techniques to write applications that you&#039;ll love to maintain. Finally you’ll learn to use chaining and control the flow of your app.  </p>  <p style=\"\">  \t   By the time you&#039;ve completed Rapid Lo-Dash, you&#039;ll have seen how Lo-Dash can help you write fast and maintainable JavaScript applications for nodeJS or the Web.  </p>  <h4><strong style=\"\">About the Author</strong></h4>  <p style=\"\">  \t<strong style=\"\">Adam England </strong>is software developer, start-up executive, and public speaker from Kansas City, Missouri. He actively writes and speaks on JavaScript topics, as well as writing applications in Ruby, Python, Java, and PHP. He holds a BS in Computer Science from Truman University, and has developed software for companies ranging from Fortune 500 companies to bootstrapped start-ups. He also helps companies build web and mobile software through his company, Durin Software. When he&#039;s not writing web and mobile applications, you&#039;ll find him perfecting his pizza dough recipe in the kitchen or learning entry level robotics.  </p>", 
    "end_date": null, 
    "title": "Rapid Lo-Dash", 
    "price": "20.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420218_4a8a_2.jpg", 
    "course_url": "https://www.udemy.com/rapid-lo-dash/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T14:15:36Z"
}