{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t      This video course is a quick introduction to the intriguing Emberjs  framework. You’ll learn about the basic features of Emberjs and how to  build adaptable client-side web apps with minimum time and effort.  </p>  <p style=\"\">  \t      While building a functional Ember application, you will see how Ember  works and how to use its powerful data binding features. You will then  move on to understand how an Ember application is structured and  configured by writing the router mapping. By the end of the course, you  will know how data can be represented in an Ember application and how  the content of your web pages can be generated automatically.  </p>  <p style=\"\">  \t      Using an example-driven approach, this course will give you the basic  tools you need to make your very own impressive Ember applications.  </p>  <h4><strong style=\"\">About the Author</strong></h4>  <p>  \t<strong style=\"\">William Hart</strong> has led a bit of a varied life, having started out as a  business graduate working in Logistics and now working as a mechanical  engineer for an Oxford-based technology startup. He is a mostly  self-taught programmer having caught the bug hacking LogoWriter on a  laptop in the early 90s.<br style=\"\">  \t<br style=\"\">  \t      William found Emberjs during the Beta  phase and immediately fell in love with it. He has used Ember to make  websites and web and mobile apps ever since. He has written a few Ember  tutorials on his website  </p>", 
    "end_date": null, 
    "title": "Rapid EmberJS", 
    "price": "20.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366572_23b2_3.jpg", 
    "course_url": "https://www.udemy.com/rapid-emberjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T11:35:57Z"
}