{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Modern web development is filled with an abundance of tools and technologies, but it&#039;s difficult to know where to begin. You want both efficiency of your work and high performance of your site; Gulp brings that right to your doorstep. With its rising popularity, you don&#039;t want to leave Gulp out of your toolbox.</p><p style=\"\">This course will teach you to use the tools needed to create better websites through clear examples and step-by-step instructions.</p><p style=\"\">You&#039;ll start with setting up Gulp and writing basic tasks, and move through common use cases to create a plugin from scratch. You will learn how to use Gulp through the many practical examples this course comes with, like optimizing our site&#039;s files and automating the process of testing our code, as well as tips on how to get the most out of Gulp. We&#039;ll gain a deeper understanding by looking at how streams work and how to define custom plugins.</p> By the end of this course, you&#039;ll know how to create your own apps, make them look good, test them and more: everything you need to know about building apps with Gulp!<strong style=\"\">About the Author</strong><strong style=\"\"></strong><strong style=\"\"></strong><p style=\"\"><strong style=\"\">Matthew Brandly</strong> is an experienced web developer with over a year of experience using Gulp on a variety of projects. He&#039;s helped build sites for a number of start-ups and has contributed to open source projects on GitHub. If he&#039;s not at his keyboard, you&#039;ll find him making music on his guitar or playing pickup basketball.</p><p style=\"\">I would like to thank Evan Hahn, who gave me some initial motivation to create this course, as well as Giles Van Gruisen, for continued motivation throughout. I also have to thank Matthew Stephens, Joe Ostrow, Joe Hermann, David Brusstar, Lulu Tang, Ryan Gonzales, Alex Horak, Mike Marsh, and Alex Schiff, for all kinds of support, and my family, Mark Brandly, Lynda Brandly, Laura Brandly, and Mark Brandly, for supporting all I do. I owe many people who aren&#039;t listed as well.</p>", 
    "end_date": null, 
    "title": "Rapid Gulp", 
    "price": "20.00", 
    "instructors": "Packt Publishing", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465818_6187_4.jpg", 
    "course_url": "https://www.udemy.com/rapid-gulp/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-02T12:28:12Z"
}