{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t   Rapid PhantomJS will help you to write your own PhantomJS scripts easily in order to perform various testing tasks.  </p>  <p style=\"\">  \t      You will begin with a detailed description of the main functionality to build up the base of advanced PhantomJS scripting. You will then move on to learn about the scripting for the four main use cases of PhantomJS, which covers rendering images from any website to avoid visual regression, monitoring network traffic to notice performance degradation, simulating user behavior, and checking the results of your unit testing suite automatically. This is where you will master popular frontend build tools such as make, npm scripting, Grunt, and gulp. These will be set up to help you automate your new developed PhantomJS scripts in any environment.<br style=\"\">  \t      By the end of the course, you will be able to automate and optimize your workflow with the help of PhantomJS, which leads to higher productivity and products of higher quality.  </p>  <h4><strong style=\"\">About the Author</strong></h4>  <p style=\"\">  \t<strong style=\"\">Stefan Judis</strong> lives in Berlin and has been developing websites using popular frontend technologies like Grunt, Gulp, RequireJS, and BackboneJS for five years. He fell heavily in love with open source, automation, and tooling. He is the maintainer of two Grunt plugins that are based on PhantomJS, which help avoiding visual regression and making it easier to gain frontend-related performance metrics (grunt-photobox and grunt-phantomas).  </p>", 
    "end_date": null, 
    "title": "Rapid PhantomJS", 
    "price": "20.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370652_8a8d_2.jpg", 
    "course_url": "https://www.udemy.com/rapid-phantomjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T11:28:43Z"
}