{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The problem of scale and complexity creates new challenges for system designers and force us all to fundamentally innovate processes and paradigms for software creation. React and Flux are Facebook's response to their scaling problems and these technologies have opened up new avenues for all web programmers worldwide. React has become the buzzword as it provides a cool new framework to solve real world problems and if you are a web developer you must learn this amazing new technology.<br></p>  <p>This is where our <strong>Projects Using React JS and Flux </strong>course comes in. The course has been meticulously designed in a manner to help you understand the technology as well as have a little fun with them. Using 10 different projects, we will get you on board on how to use ReactJS and Flux to make your application unique, just like you!</p>  <p><strong>What are ReactJS and Flux?</strong></p>  <p>Created by Facebook, both technologies were designed to simplify the process of coding and making applications. ReactJS is a powerful JavaScript library that uses an XML-like syntax called JSX to describe component's DOM representations. It allows you to not only easily create interactive User Interface (UI) components, but also reuse them when needed in other projects.</p>  <p>On the other hand, Flux is an application architecture that is used for creating dynamic client-side JavaScript web applications and works alongside ReactJS. Flux is used to maintain a unidirectional data flow, in order to deal with scalability issues that can arise in the MVC and simplify the data flow. </p>  <p>The Projects Using React.JS and Flux tutorial is the perfect way to not only learn these technologies, but also understand how they can be practically applied to create applications. It will also give you a working idea of other technologies that can be used in tandem with these technologies.</p>  <p><strong>In this course, you will build the following 10 projects:</strong></p>  <p><strong>Project 1 – Bootstrap React Components – This is a starter project to help you understand how to use Bootstrap to create basic React components.</strong></p>  <p><strong>Project 2 – Github Profile Viewer – Learn how to use ReactJS to create a UI and fetch data from the Github API. </strong></p>  <p><strong>Project 3 – Quick Quiz – Design a simple React quiz application </strong></p>  <p><strong>Project 4 – Movie Find – Learn how to create a movie find database that uses the OMDB API to fetch movies from the database. </strong></p>  <p><strong>Project 5 – Contact List – Create a contact list and learn how to use the Firebase database technology</strong></p>  <p><strong>Project 6 – Stickypad Notes - Create a fancy ToDo List that uses a Stickypad image for its background</strong></p>  <p><strong>Project 7 – InfoFinder Search Engine – Learn how to use the DuckDuckGo API to design a fully-functional search engine.</strong></p>  <p><strong>Project 8 – Youtube Gallery – Create a complex video gallery that allows you to add YouTube videos using just the ID of the video.</strong></p>  <p><strong>Project 9 – Socket . io Chat – Learn how to create a functional chat application that allows you to create a username and send messages back and forth over web sockets.</strong></p>  <p><strong>Project 10 – Workout Logger – Finally one of the most interesting and the most complex application in the list, this Workout Logger will have a mobile friendly interface and will also teach you how to create a local storage.</strong></p>  <p>At the end of this course, not only will you have 10 functional applications ready for use, but you will also learn how to use React.JS and Flux to create interesting web and mobile applications. Enroll now and become a React and Flux wiz. </p>", 
    "end_date": null, 
    "title": "ReactJS and Flux: Learn By Building 10 Projects", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764042_60ef_3.jpg", 
    "course_url": "https://www.udemy.com/reactjs-and-flux-learn-by-building-10-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T06:08:02Z"
}