{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>**** This course is not yet fully complete there are more videos on the way! If you have any suggestions for videos just message me! ****</strong><br></p>\n\n<p>This tutorial will take you through everything you need to know to master web development using ReactJS.</p>\n\n<p>We will cover ReactJS, ES6, Webpack and build some fantastic projects that demonstrate exactly how to use ReactJS in modern web development.</p>\n\n\n\n\n\n\n\n<p>Getting a great understanding of ReactJs will get you into a position to build fantastic, well built personal and professional projects. It will also put you in high demand for employers where knowing and understanding ReactJS will put you ahead of everyone else.  </p>\n\n\n\n\n\n\n\n<p>This course starts from the beginning of ReactJS and is done in a way that means from the first video you start building with React. Only when we enter the projects section will you need to setup your environment, but by then you will know exactly what you're doing.</p>\n\n\n\n\n\n\n\n\n\n<p>We'll start by mastering the fundamentals of React, including JSX, “props\", “state\", and eventing. Source code is provided for each lecture, so you will always stay up-to-date with the course pacing. </p>\n\n\n\n\n\n\n\n\n\n<p>If you are new to React or maybe you've been struggling to learn and truly understand whats going on then this course is for you. You will be confident in using ReactJS in no time at all and if you ever get stuck I will be there to help.</p>\n\n\n\n\n\n\n\n\n\n<p>I built this course as I felt the current resources out there expected you to already have a great understanding of how react works to even get started so I've made this course as simple as possible in order to take you through step by step so you can feel confident and get a truly good understanding of how to utilise ReactJS.</p>", 
    "end_date": null, 
    "title": "React From The Ground Up", 
    "price": "20.00", 
    "instructors": "Tim Knight", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/836044_c960_4.jpg", 
    "course_url": "https://www.udemy.com/reactjs-from-the-ground-up/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-30T13:17:17Z"
}