{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><p>This course will have you look over my shoulder right into my code and browser as we rebuild the amazing site Pinterest.com together.</p><p>You&#039;ll be doing it yourself which is the BEST way to learn.</p><p><strong>How is this course divided?</strong></p><p>It&#039;s divided into 2 parts:</p><p><strong>Part 1:</strong> includes the fundamentals of HTML + CSS and a practical application of the code.  (FREE)</p><p><strong>Part 2:</strong> is where we rebuild the front page of Pinterest. If you&#039;re interested in Part 2 you must complete this Part 1 first.</p><p>Part 1 is essential before getting to Part 2.<br></p><p><strong>This Part is completely FREE!</strong></p><p><strong>What we&#039;ll cover</strong></p><p>We&#039;ll cover all the basics of HTML such as:</p><p><ul><li>How do you build a simple web page?<br></li><li>How do you design and customize the look of a webpage?<br></li><li>What about links, images and navigation menus?<br></li></ul></p><p>I got you covered.</p><p><strong>How long will this take?</strong></p><p>This course is 1 hour. Wow. You get to become a web design guru in 1 hour!</p><p><strong>How is this course structured?</strong></p><p>This course is broken down into 10 parts, but every section is connected and follows up from the previous. We&#039;ll stay together throughout the course step by step.</p><p><strong>Who should take this course?</strong></p><p>Wordpress developers, graphic designers, marketers, and anyone interested in being able to have the basic know how to tweak html and css should take this course. </p><p>It&#039;s really important to know how to touch and handle HTML and CSS even if you use Wordpress or Dreamweaver that does the work.</p><p>I use Wordpress and Dreamweaver all the time but I&#039;m always tweaking the code and you&#039;ll need to also.</p><p>If you&#039;re a graphic designer this is great for you because you&#039;ll learn some of the basics and you&#039;ll be able to turn your designs onto a web page without hiring a web developer.</p><p>If you know a little something about HTML and CSS but you want to brush up to take the bull by the horn this is for you too.</p><p><strong>Who should not take this course?</strong></p><p>If you&#039;re already a code ninja this won&#039;t be for you.</p><p><strong>Cool Notes</strong></p><p>I recommend that you don&#039;t skip around because I&#039;m walking you through the code step by step and I want to stay with you as you go through it.<br></p><p>All these videos are in 720p HD and crisp so you will be able to CLEARLY see the code.</p><p>What makes this course awesome is that you&#039;ll be able to look over my shoulder zoomed in so you follow me step by step. You&#039;ll also be able to see both the CODE and the Results in the browser side by side throughout each video. This will help you fully grasp what&#039;s happening.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Rebuild Pinterest from Scratch with HTML + CSS (Part 1) FREE", 
    "price": "20.00", 
    "instructors": "Omar Elbaga", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/34616_298f_3.jpg", 
    "course_url": "https://www.udemy.com/rebuild-pinterest-from-scratch-part1/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-05T01:26:58Z"
}