{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong><strong>This course is completely updated and current through April 2015.</strong></strong></p>  <p>  \t            Dear website owner,  </p>  <p>  \t            If you are like most of us, you created your website in english, and are earning money through the promotion of offers/affiliates links directed at  American customers, or atleast in the country at which you direct your content.  </p>  <p>  \t            If you plan on making your website and business a big thing, here's a news flash for you : You must target worldwide visitors. If you don't, you are leaving thousands of dollars on the table -period.  </p>  <p>  \t            In this course, we will teach you :  </p>  <p>  \t            - How to redirect visitors to subpages according to their country of residence.  </p>  <p>  \t            - How to block certain countries from accessing your content.  </p>  <p>  \t            - How to easily create subpages for specific countries, with appropriate offers that could mean earning more commissions.  </p>  <p>  \t            - How to make your visitors feel at home and improve user-friendliness.  </p>  <p>  \t            With this information, you will be in a position where you can easily get your content translated in different languages, without worrying about them mixing up.  </p>  <p>  \t            With this information, you could also double your income, or more:If 40% of your visitors are american, and you are only earning from them, you are leaving the big piece of the cake untouched.  </p>  <p>  \t            This course comes with a 30-days no questions asked full money back guarantee, <strong>so you take absolutely no risk</strong>  </p>  <p>  \t            We will also personally answer any question in the members area.  </p>  <p>  \t            Enroll now, and get your website to a spot it deserves to be in.  </p>  <p>  \t        Completion of this course requires you to own \"GeoIP Country Redirect\", which is a plugin currently priced at 13$.  </p>  <p>  \t            To Your Success,  </p>  <p>  \t            Antoine Lelièvre &amp; Howard Lynch  </p>", 
    "end_date": null, 
    "title": "Redirect Your Visitors By Country Easily -Wordpress Tutorial", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/407796_7cce_4.jpg", 
    "course_url": "https://www.udemy.com/redirect-your-visitors-by-country-easily-wordpress-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-29T13:44:07Z"
}