{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><br></p><p>This course is to show you how to setup your very first ecommerce website with free hosting and a business email.<br style=\"\"><br style=\"\">I start by showing you how to register your domain and looking for the cheapest option to purchase your domain.<br style=\"\"><br style=\"\">Then i go onto talk about setting up your free web hosting account, it has unlimited use however is capped at 10GB disk space and 250GB traffic which is more than enough for any startup website.</p><p>I will then go ahead and setup a FTP account and install a open source e commerce website and setup a business email address.</p><p>I do a comparison of presta shop and open cart so you are familiar with the layout as well as the admin area, we also search for a few themes that you can install in your spare time.<br style=\"\"><br style=\"\">Lastly we will go through some simple onsite SEO to better understand it and implement it into our website.<br style=\"\"><br style=\"\"><strong>This course has been developed for everybody so no previous experience is needed. If you're looking for a simple and easy to follow, step by step guide on getting a domain name and installing a eCommerce website and a free hosting service thrown in then this course is for you!</strong><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Register a domain with FREE hosting and eCommerce store", 
    "price": "20.00", 
    "instructors": "Pixelated Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604916_2819_4.jpg", 
    "course_url": "https://www.udemy.com/register-a-domain-with-free-hosting-and-ecommerce-store-and-ftp-server/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T15:28:26Z"
}