{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Materialize is the NEW EVOLUTION of Responsive Design MOBILE FIRST THINKING</strong></p><p style=\"\">A modern responsive front-end framework based on <strong style=\"\">Material Design.  </strong> Incredibly easy to use, BETTER than Twitter Bootstrap.  Materialize has thought of everything.  The design and development approach is made extremely <strong style=\"\">user friendly</strong>.  Take advantage of what Google has to offer.   Download this open source framework for yourself and see how easy it is to use.</p><p style=\"\"><strong style=\"\">In this course we will teach you </strong></p><ul style=\"\"><li style=\"\">Forms will blow your mind - what you always wanted to do</li><li style=\"\">More navigation options that bootstrap</li><li style=\"\">media options and components have never been easier and more mobile friendly</li><li style=\"\">Modals are even easier to apply with more options</li><li style=\"\">easy to add classes that bring your site to life</li></ul><p style=\"\"><strong style=\"\">Benefits of using Materialize</strong></p><ul style=\"\"><li style=\"\">Speeds up development</li><li style=\"\">User Experience Focused</li><li style=\"\">Easy to work with</li></ul><p style=\"\">Create RESPONSIVE WEBSITES in minutes.</p><p style=\"\">Don&#039;t waste time when all the heavy lifting is done for you.</p><p style=\"\">Utilizing elements and principles of Material Design.</p><p style=\"\">Additionally, a single underlying responsive system across all platforms allow for a more unified user experience.</p><p style=\"\">After completion of this course you will have the skills needed to make <strong style=\"\">FULLY RESPONSIVE WEBSITES.  </strong></p><strong style=\"\"><span style=\"\"></span></strong><p style=\"\">This course will teach you to create AWESOME Mobile first FULLY <strong style=\"\">responsive websites in minutes </strong>using the Materialize open source framework from Google.</p><p style=\"\"><strong style=\"\">Material Design</strong> by Google is the latest and most powerful CSS JS framework.  Better than the super popular Twitter Bootstrap.  Much like Bootstrap it is grid based but Materialize has a lot of functionality that Bootstrap is lacking.  Yes, once you work with Materialize you won&#039;t go back to Bootstrap.  Its that good!!!!</p><p style=\"\">Designed totally with mobile in mind, it has built in swipe functionality, modals, responsive images and incredible form functionality.  </p><p style=\"\">Text is responsive, truncate text, and much more.  </p><p style=\"\">upon completion of this course you will be able to create a responsive website, using this framework is easy.  STOP wasting time with styling, use a well thought out framework that will seem like magic.</p><p style=\"\">Its not magic, its Materialize that brings websites to life like nothing before. </p>", 
    "end_date": null, 
    "title": "Responsive Design with NEW Materialize", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/561136_8d11_2.jpg", 
    "course_url": "https://www.udemy.com/responsive-design-with-new-google-materialize/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-22T02:31:54Z"
}