{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  The Internet is an essential part of our daily lives. Moreover, smartphones are an important part of our daily lives. Learning to design websites for desktops is no longer good enough. Websites need to be designed for computer, tablets, and smartphones.  </p>  <p style=\"\">  \t      This course covers how to use HTML5 and CSS3 to build websites that look great whether they are viewed on computers, tablets, or smartphones.  </p>  <p style=\"\">  \t<strong style=\"\">Learn and Master Responsive Web Design Using HTML5 and CSS3</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"></strong>Build a personal website that looks great on all devices</li>  \t<li style=\"\">Build a multi-page business website that looks great on all devices</li>  \t<li style=\"\">Learn to use HTML Forms and Tables</li>  \t<li style=\"\">Learn all about HTML5 and CSS3, the latest web design technology</li>  \t<li style=\"\">Purchase your own custom domain name and upload a website to the internet</li>  </ul>  <p style=\"\">  \t<strong style=\"\">The Perfect Course for Anyone Interested in Learning Web Development</strong>  </p>  <p style=\"\">  \t      In this course, you will learn everything you need to know about HTML5 and CSS3. You will learn to build headers, navigation bars, and well structure content sections for your site. Then, you will learn to use Responsive Web Design, so that your website looks different on smaller devices. This will allow you to create engaging websites for all users.  </p>  <p style=\"\">  \t      The course is taught through a series of screencasts. Each video will teach you a new practical skill, and you will alway be learning new things. The course is project-based, so you will always be building a useful website. This helps to keep the course engaging and fun.  </p>  <p style=\"\">  \t      The course would be perfect for any beginner interested in learning web development. We even cover what materials you need, and how to download them for free. By the end of the course, you will have successfully uploaded three websites to the Internet, and you will be capable of designing many more.  </p>  <p style=\"\">  \tThe course contains 4 hours of content and over 60 lectures. You will receive a certificate for successful completion of the course, and you will have a strong understanding of HTML5 and CSS3.  </p>", 
    "end_date": null, 
    "title": "Responsive Web Design: Complete Web Design with HTML and CSS", 
    "price": "25.00", 
    "instructors": "Joseph Bergman", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/388812_18b3_3.jpg", 
    "course_url": "https://www.udemy.com/complete-responsive-web-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-08T19:12:21Z"
}