{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>¿<strong>Sobre qué es el curso</strong>? En este curso vamos a desarrollar una REST Api profesional usando el framework Slim para PHP. Luego vamos a consumir dichos servicios desde Codeigniter y Angular JS para poder dar solución al problema que viene incomodando a la empresa Cineworld.</p><p>¿<strong>Como <strong>está </strong>compuesto el curso</strong>? Esta compuesto en 2 partes, en la <strong>primera parte </strong>veremos algunos conceptos básicos que se requieren del curso y lo que es Slim. En segundo lugar vamos a desarrollar nuestro proyecto comenzando por crear la REST Api en el framework Slim, luego construir el BackOffice usando Codeigniter y finalmente el FrontOffice usando AngularJS.</p><p>¿<strong>Como está estructurado el curso</strong>? Cada clase está compuesta por un video, donde iremos desarrollando nuestros ejemplos y al finalizar la clase, adjunto lo que haya avanzado para que lo puedas descargar en caso que te atrases. Adicionalmente, en algunas clases se adjunta material extra para reforzar el conocimiento.</p><p>¿<strong>Por qué tomar el curso</strong>? En los proyectos empresariales y comerciales, las empresas están demandado trabajar con más de una tecnología y desarrollar todo pensando en una tecnología hace que nuestro proyecto se retrase, no sea escalable y mantenible a largo plazo. Es por eso, que en este curso vamos a entender la importancia de una REST Api para centralizar nuestro aplicativo y que este pueda ser consumido por cualquier tecnología/aplicativo.</p>", 
    "end_date": null, 
    "title": "REST Api con PHP: desde básico hasta un proyecto profesional", 
    "price": "25.00", 
    "instructors": "Eduardo Patiño", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741150_960b_5.jpg", 
    "course_url": "https://www.udemy.com/crea-una-rest-api-profesional-con-php/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T16:12:12Z"
}