{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<h4><strong style=\"\">Save Time, Money, and Stress!</strong></h4>  <h4>Find Out What Hackers Don&#039;t Want You to Know!</h4>  <p>  \t<strong style=\"\">Rock Solid Wordpress Security</strong> is changing the security landscape for thousands of Wordpress sites! <strong style=\"\">Updated January 14th, 2015</strong>.  </p>  <h4>Secure you Wordpress website today at the cost of about a theme!</h4>  <hr style=\"\">  <p>  \t<strong style=\"\">JOIN 2,500+ STUDENTS ALREADY SECURING THEIR WORDPRESS SITE</strong>  </p>  <hr style=\"\">  <h4><strong style=\"\">Secure your Wordpress website today!</strong></h4>  <p>  \t                                                                                                    Having a website is essential to your online identity. Chances are you chose to use Wordpress as a website platform due to its ease and flexibility. <strong style=\"\">Along with the popularity of the Wordpress platform, as with anything else, come risks, security risks.</strong> Not everyone on the Internet has good intentions, not everyone wants to see you succeed, there are even a select few that take pride in tearing down what others have created.  </p>  <h4><strong style=\"\">Secure your Wordpress login and admin area!</strong></h4>  <p>  \t                                                                                                    Don&#039;t fall victim to those looking to destroy your site, and don&#039;t think for just a moment that just because you aren&#039;t some big name that everyone is playing nice. It is the age of the Internet, and Internet <strong style=\"\">security for your website</strong>, especially your Wordpress login area, has never been more important.  </p>  <h4><strong style=\"\">Use the simple steps in this course to secure Wordpress!</strong></h4>  <p>  \t                                                                                                There is good news! In just a few, simple steps I will show you how to <strong style=\"\">secure your Wordpress installation</strong> so you never have to worry about hackers again. I am addressing Wordpress security with a <strong style=\"\">no-code approach</strong> so anyone can secure their site. You can rest easy knowing that your site will be there in the morning, just the way you left it, from this point forward.  </p>  <h4><strong style=\"\">Wordpress Security Best Practices</strong></h4>  <p>  \t                                                    This course is regularly updated to reflect the Wordpress security best practices based on the <strong style=\"\">most current Wordpress version</strong> and recent security threats.  </p>  <!-- Facebook Conversion Code for Rock Solid -->  <img height=\"1\" width=\"1\" alt=\"\" src=\"https://www.facebook.com/tr?ev=6020743274591&amp;cd[value]=0.01&amp;cd[currency]=USD&amp;noscript=1\" style=\" max-width:100%;\">", 
    "end_date": null, 
    "title": "Rock Solid Wordpress Security - Secure Web Development", 
    "price": "20.00", 
    "instructors": "Jason Rybka", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375136_3a20_3.jpg", 
    "course_url": "https://www.udemy.com/rock-solid-wordpress-security-secure-wordpress-easily/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-21T19:49:25Z"
}