{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Are you ready to start building professional <strong>web applications</strong>? Over a decade of programming experience has taught me that the best way to learn how to code is to acquire a <strong>comprehensive understanding</strong> of the basic principles and then learn from building <strong>real world projects</strong>, and that's exactly what this course does. Beginning with setting up your local development environment and ending with deploying your production application to the web, this course gives a <strong>detailed walk through</strong> on:</p><ul><li>Creating applications</li><li>Using the Rails console</li><li>Generating scaffolds</li><li>Running advanced database queries</li><li>How to configure RESTful routes</li><li>Configuring views</li><li>Building out the full Model/View/Controller architecture</li><li>Working with multiple database options</li><li>Creating custom algorithms</li><li>Building a file uploader connected to a CDN</li><li>Working with Ruby gem libraries</li><li>Integrating authentication</li><li>And much more.</li></ul><p>This course differs from others because it not only teaches you how to build an application, it focuses on giving developers an <strong>in depth understanding of the web framework itself</strong> so that you can take your new knowledge and <strong>build any type of application</strong>. With the course organized so that each video teaches a specific feature, you can use them in the future as a <strong>reference</strong> when you want to build out a specific functionality. The course was engineered to ensure you will be able to learn the material:</p><ul><li>With over <strong>6.5 hours of video lectures</strong></li><li>Access to the project's <strong>source code</strong></li><li><strong>Quizzes</strong> at the end of each section</li><li>And I will be your <strong>personal code mentor</strong>, answering every question you have as you go through the course to ensure you can complete it successfully and that you have an extensive understanding of the material</li></ul><p>After you complete the course and quizzes you will be given a <strong>Ruby on Rails Foundations</strong> certificate of completion and you will be on your way to becoming a professional Rails developer!</p>", 
    "end_date": null, 
    "title": "Ruby on Rails Foundations", 
    "price": "20.00", 
    "instructors": "Jordan Hudgens", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656522_78ee_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-learn-ruby-on-rails/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-31T19:37:04Z"
}