{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Ruby on Rails can seem overwhelming at first, but it doesn’t have to be! In this course I’ll walk you through it step by step and you’ll be building your first web app in MINUTES. You’ll be amazed how quick and easy it is to create very professional looking websites, even if you have no programming or web design experience at all.</span>  </p>  <p style=\"\">  \tWatch over my shoulder as I build a Pinterest website step by step right in front of you. You’ll follow along and build your own copy. By the time we’re finished, you’ll have a solid understanding of Ruby on Rails and how to use it to build awesome web apps.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<span style=\"\">The course contains 19 videos – and is just over 5 hours long. Watch the videos at your own pace, and post questions along the way if you get stuck. You don’t need any special knowledge or software to take this course, though any experience with HTML or CSS is a plus. You don’t even need to know the Ruby programming language. I’ll walk you through EVERYTHING.</span>  </p>  <p style=\"\">  \t<span style=\"\"><br style=\"\">  \t</span>  </p>  <p style=\"\">  \tRuby on Rails is a great web development tool and learning it has never been this easy.  </p>  <p style=\"\">  \t<span style=\"\"><br style=\"\">  \t</span>  </p>", 
    "end_date": null, 
    "title": "Ruby On Rails For Web Development", 
    "price": "20.00", 
    "instructors": "John Elder", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372518_57c2_6.jpg", 
    "course_url": "https://www.udemy.com/ruby-on-rails-for-web-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T17:01:12Z"
}