{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em>UPDATED FOR MARCH 2016. JOIN OVER 1,100 STUDENTS!</em></strong></p><p><strong><em>You might be able to create the greatest Ruby on Rails website in the world... But is anyone going to find it?</em></strong></p><p>Do you already have some knowledge of Ruby on Rails? And would you like to boost search engine traffic to the Ruby on Rails websites you build? Also, do you want to be more attractive to employers who value web development SEO skills?</p><p>My name is David Fonvielle, and I created my first Ruby on Rails website in 2011. When I built my website, I wanted to optimize it for search engine traffic, so that people could find all the articles I was writing and the tools I was building. Unfortunately, I didn't know anything about SEO at the time, much less how to use my skills as a Ruby on Rails web developer to make my website better optimized for search engine traffic.</p><p>I looked online for help on how to create a more SEO friendly Ruby on Rails website, and it was a very confusing, time-consuming learning experience. </p><p>First, I learned an overwhelming amount of information about SEO, with a lot of contradictory information which made me more confused than ever. Then, I had to figure out how to create a more SEO friendly Ruby on Rails website from bits and pieces of information scattered around the internet.</p><p>What I wanted was simple: for someone to teach me the basic, most important aspects of search engine optimization (SEO) that I could do something about as a Ruby on Rails web developer... And then give me specific step by step instructions on how to create a more SEO friendly Ruby on Rails website that addressed these most important aspects.</p><p>And that's exactly what this course does.</p><p>This course assumes that you have some basic, working knowledge of Ruby on Rails, but it also assumes that you have no knowledge of SEO at all. So you'll learn the most important aspects of SEO that you can do something about with your Ruby on Rails skills, and you'll learn step by step how to use your Ruby on Rails skills to create more SEO friendly websites.</p><p>Specifically, you'll learn:</p><ul><li>Why meta titles are so important for SEO and how to implement a unique meta title on every page of your website</li><li>How meta descriptions are related indirectly to SEO and how to implement a unique meta description on every page of your website</li><li>What the best type of urls are for an SEO friendly website and how to create them (this is important: Ruby on Rails does not give you seo-friendly urls out of the box!)</li><li>What types of redirects to use to preserve \"link-juice\" and how to implement them</li><li>How to keep certain pages out of the search engine results and how to protect your websites from Google's \"duplicate content penalty\" by making sure you only get the pages you want indexed</li><li>How to make sure that every page title is better optimized for search engine traffic by taking just 1 simple step</li></ul><p>By taking this course, you're going to learn one of the most useful, practical, web development skills ever: how to help your Ruby on Rails websites rank in search engine results so that people can find the website you created.</p><p>After all, that's the entire point of creating a website in the first place, isn't it? To create something that other people will find, use, and enjoy.</p><p>So take this course today and immediately become a more skilled, knowledgeable Ruby on Rails web developer who enjoys getting more search engine traffic.</p><p>Enrol in the course right now!</p>", 
    "end_date": null, 
    "title": "Ruby on Rails Tutorial: Learn 6 Ruby on Rails SEO Techniques", 
    "price": "20.00", 
    "instructors": "David Fonvielle", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465210_7bfb_2.jpg", 
    "course_url": "https://www.udemy.com/ruby-on-rails-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T18:57:16Z"
}