{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\">Learn to deploy Docker at scale in about 6 hours</em></p>\n\n<p>Looking to scale your web applications with Docker? How about gaining heaps of practical knowledge about working with Amazon Web Services (AWS)?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Prepare to get excited about this course!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>AWS has over a million customers, some of which are the most popular websites in the world. You can be sure that AWS will be a great fit for your web application regardless of what scale you're running at.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>One awesome thing about using AWS</strong> is that a ton of companies are hiring people who have experience with it. All of the knowledge you gain from this course can be used to apply for DevOps or cloud computing positions.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The main AWS component that you'll learn about in this course is Amazon ECS, which is the Amazon EC2 Container Service. It's Amazon's take on how to manage a cluster of Docker containers.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>The first section of this course</strong> will concentrate on getting familiar with AWS and then performing a deep dive on Amazon ECS where you'll learn everything there is to know about it. You'll also get familiar with Amazon ECR which is Amazon's private Docker registry.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>During this deep dive there will be plenty of guided labs to get your hands dirty.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>The second section of this course</strong> will be all about Dockerizing a multi-service Ruby on Rails application, as well as profiling that application with Docker and other open source tools.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>If you're not a developer or have no intentions of using Ruby on Rails that's fine because you can skip the development section. The only thing you'll have to do is build the Docker image, which will be as simple as running a few commands.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>The third section of this course</strong> will be taking the knowledge learned from previous sections and deploying the application to production on AWS in a fault tolerant way.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You'll learn how to calculate costs for a real life project hosted on AWS and load balance the web application so you can scale out to as many hosts as you need.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Along the way you'll learn about many other AWS resources and also learn how to hook up a domain name to a load balancer and secure it with a free SSL certificate.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">This entire course is very hands on</em>, with just enough theory to understand the main goal -- which is to get you comfortable scaling your web apps with Docker on AWS.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Excellent teacher and great material - easy to follow and informative. I especially like the hands-on labs.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Here's what you'll get when you sign up to my course today:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>You'll learn how to get your development environment set up to run Docker. Windows, Mac and Linux users will be able to follow along.</li><li>You'll learn what Amazon ECS is and how it differs from similar services.</li><li>You'll learn everything there is to know about Amazon ECS.</li><li>You'll learn how to create your own private Docker Registry with Amazon ECR.</li><li>You'll gain general AWS knowledge on identity and access management, security groups, EC2, S3, ELB, RDS, ElastiCache and more.</li><li>You'll learn how to Dockerize a Ruby on Rails web application.</li><li>You'll learn how to profile your applications with Docker.</li><li>You'll learn how to price out a project on AWS at various traffic loads.</li><li>You'll learn how to load balance your web application on AWS.</li><li>You'll learn how to wire up a custom domain to your load balanced web app.</li><li>You'll learn how to create and use a FREE SSL certificate.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">You're getting all of that for just $25.</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is jam packed with over 60 lectures, 6+ hours of videos and quizzes. You'll also receive full PDF text directions for each video lecture and complete source code examples.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"> \"This training is great to start using ECS on AWS. It's very clear and the instructor explains really well the concepts of both, Docker and AWS and how they work together.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n<p><strong>Why is it worth using Docker?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Saves a ton of time and headaches when setting up development environments.</li><li>Easily move an application across environments or servers.</li><li>Removes issues such as \"well, it worked on my machine!\".</li><li>Makes developing with teams a much more pleasant experience.</li><li>Works on most major platforms.</li><li>Has amazing support on most cloud hosting providers.</li><li>Docker as a company is well funded and moving forward quickly.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why is it worth using AWS?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Amazon's infrastructure is spread across the globe.</li><li>Amazon has a tremendous amount of experience operating at scale.</li><li>Reap the rewards of using battle hardened services.</li><li>Avoid having to manage the low level details of your infrastructure.</li><li>Many companies are hiring people with AWS experience.</li><li>You can try it out for free for an entire year.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n<p><em> \"What I loved most about this course was that I could tell how much thought Nick put into arranging the labs and resources.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why is this course for you?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>After finishing this course you'll have a ton of knowledge about using Docker on AWS. You'll be able to apply this knowledge to your own projects or use it to further your career by applying for DevOps or cloud computing jobs.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You're walking away with not only knowledge, but complete source code and working examples that you can reference for life.<br></p>", 
    "end_date": null, 
    "title": "Scaling Docker on AWS", 
    "price": "25.00", 
    "instructors": "Nick Janetakis", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785388_e6f4_2.jpg", 
    "course_url": "https://www.udemy.com/scaling-docker-on-aws/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T20:49:16Z"
}