{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In this course you will learn how to <strong>scrape data</strong> from web pages using CasperJS.</p><p>This course consists of <strong>5 example projects</strong> to help you fully understand the powers of the headless browser using the CasperJS API.</p><p><strong>You Will Learn</strong></p><p>You will gain a thorough understanding of advanced <strong>web scraping</strong> concepts and also gain an insight into how to use the CasperJS for <strong>Testing DOM</strong> manipulation and UI interaction.</p><p><br></p><p><strong>What to Expect</strong></p><ul><li>We'll begin with an overview of how both PhantomJS and CasperJS works along with how to install these frameworks.</li></ul><ul><li>Next, we'll discuss what our workflow will look like and the options we can pass into a Casper object.</li></ul><ul><li>Then we'll dive into the meat of this course by working through 5 projects.</li></ul><p><strong><br></strong></p><p><strong>The Projects Will Cover</strong></p><ul><li>How to scrape websites that are rendered with JavaScript instead of standard HTML</li><li>How to wait for AJAX loaded data to appear before scraping elements</li><li>How to submit forms both for Authorization and when making searches</li><li>How to define navigation Steps - like logging into a site, clicking a button and following links</li><li>How to write and save specified data in tables then output as an .html file or as JSON.</li><li>And how to take screenshots both of full web pages and specific containers</li></ul><p><strong><br></strong></p><p><strong>What is PhantomJS?</strong></p><p>PhantomJS is a Full Web Stack that  employs a headless browser.  Phantom gives us the power to perform many interesting actions on a web page, such as: performing page\nmanipulation, simulating user interaction and the ability to dynamically capture and\nsave website data.</p><p><br></p><p><strong>What is CasperJS?</strong></p><p>CasperJS is a stand-alone framework built on top Phantom and is compatible with most operating systems.  The focus of this course will be on the Casper API and we'll\nbe using this API to write all our web scraping scripts.</p><p><br></p><p><strong>What You Should Know</strong></p><p>You should already know JavaScript basics.  Including what a callback function is.  It will help if you know some jQuery.  We use lodash in of our examples but only as a replacement for the built-in Map method that's part of the native Javascript API.</p><p><br></p><p><strong>By the End You Will Be Able to</strong></p><ul><li>Know how to use\nJavaScript for Data Mining</li><li>Be able to Capture,\nDownload and Save Website Data</li><li>Understand how to\nuse CasperJS and PhantomJS</li><li>Create Your Own\nScripts for Scraping Data</li><li>Apply What You've\nLearned to UI Testing</li><li>Have a Better\nUnderstanding of Functional Programming,</li><li>Fully Understand\nJavaScript and jQuery Selectors </li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Scrape Websites using PhantomJS and CasperJS", 
    "price": "20.00", 
    "instructors": "Patrick Schroeder", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/751100_d221_2.jpg", 
    "course_url": "https://www.udemy.com/scrape-websites-phantomjs-casperjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T10:46:37Z"
}