{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>How to use Power Point to self advertise on Twitter Facebook and much more.</strong></p><p><strong></strong> If your just starting out trying to bring people to your <strong>blog</strong> or <strong>web page</strong> this is a great organic way to bring in free traffic.</p><p><em><strong>I struggled for months trying to get organic traffic to my website and was about out of cash to pay for it.</strong></em></p><p>So I started using Power Point to make my own content to tweet out instead of paying twitter or Facebook to do it for me.  </p><p><strong>   Using paid advertising along with this course works great says</strong> <em><strong>Jill Spence of Atlanta</strong></em></p><p><strong>\"In the long run it saved me so much. Now when I tweet a picture I made on PowerPoint it gets way more clicks and likes than my boring text ever did  Thanks abunch.....Kristina Lawson of Florida\"</strong></p><p><strong><br></strong></p><p><strong><em>We well take and open powerpoint and build a Tweetable image and or a postable photo or advertising content.</em></strong></p><p>Then we will save and store our file to go and grab.</p><p>How to find and tweet or post your content out for the world to see and share</p><p>You will also find in this course a short rundown on how you can use iMovie to make content for your courses,Websites and all social media posts including blogs and YouTube videos</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Self Advertise Using PowerPoint Twitter and Facebook on ios", 
    "price": "20.00", 
    "instructors": "Justin Beene", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669346_1a86_3.jpg", 
    "course_url": "https://www.udemy.com/the-basic-roadmap-to-power-point-advertising-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T05:39:23Z"
}