{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn the basic concepts, tools and functions that you will need to send emails from your website or web application in PHP.</p>\n\n<p><strong>Learn to Send emails using PHP in this Comprehensive Course.</strong><br></p>\n\n\n\n<ul><li>Learn basic email concepts</li><li>Discover the best tools and methodologies for sending emails using PHP</li><li>Learn best practices to make sure your emails arrive as intended</li><li>Improve response time in the browser by sending emails asynchronously</li><li>Use third-party email providers to track what happens to emails once sent</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Add Sending emails to Your PHP Toolkit</strong><br></p>\n\n\n\n<p>If you’re creating a website or web application in PHP, sooner or later you’ll want it to send emails to your users, for example: </p>\n\n\n\n<ul><li>a contact page</li><li>an account activation email</li><li>a monthly report</li><li>an invoice</li><li>a password reset email</li><li>a newsletter</li><li>email marketing</li></ul>\n\n\n\n<p> and so on.<br></p>\n\n<p>Sending email from PHP can be a tricky thing to get right. From making sure that your email is readable in as many different email clients as possible, to sending the email asynchronously so that your website responds as quickly as possible.</p>\n\n<p>This course will teach you the basics through to the advanced techniques and tools used by professional PHP programmers.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Content and Overview</strong><br></p>\n\n\n\n\n\n<p>I designed this course to be easily understood by programmers who know PHP, HTML and CSS but don't have much experience sending emails from PHP.</p>\n\n<p>Starting with the basic concepts of how emails work, such as senders, recipients, file attachments, using HTML and CSS and so on, this course will take you through all the steps needed to have your PHP website sending emails to its users.</p>\n\n<p>Once we've covered the basics, we'll move on to advanced techniques like sending emails asynchronously and tracking emails using third-party email services.</p>\n\n\n\n\n\n<p>New concepts are explained in detail as and when they're introduced, with full explanations of all the code used with detailed examples.</p>\n\n<p>At the end of the course, you will be able to swiftly and reliably send professional-looking emails using PHP.</p>\n\n<p>Complete with working source code at every stage, you'll be able to work alongside the instructor and will receive a verifiable certificate of completion upon finishing the course.<br></p>", 
    "end_date": null, 
    "title": "Sending email with PHP: from Basic to Advanced", 
    "price": "20.00", 
    "instructors": "Dave Hollingworth", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/770526_15d0_5.jpg", 
    "course_url": "https://www.udemy.com/php-email/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-22T13:00:55Z"
}