{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em>*** Attention: New Release - Sign Up Right Now and Don't Miss this Incredible Training Course from an SEO Industry Veteran &amp; Best-Selling Author of the SEO University and SEO 2016 Book and Audiobook Series ***</em></strong></p><p><strong><em>Have you found yourself frustrated with the field of search engine optimization? Has ranking on Google eluded you? Does the thought of understanding the convoluted world of SEO seem like a daunting task to you?</em> </strong></p><p>If you've answered yes to any of those questions, you're not alone. SEO is an increasingly-complex field that has expanded to include a wide range of skills and practices. What used to be simple at one time, is complex, intricate, and extremely time-consuming. </p><p>But, in this course, I'll present you with a vast amount of knowledge to help you truly understand and leverage the field of search engine optimization. </p><p><strong><em>Imagine being able to send virtually limitless amounts of free organic traffic to your offers and pages on the Web? That skill is worth its weight in gold! </em></strong></p><p>To begin, we'll lay the groundwork with the fundamental principles involved in SEO. You'll gain historical knowledge about where we've come and what's changed in recent years along with the strategies and techniques to help you rank at the top of Google's searches. </p><p>From beginner to advanced, you'll quickly move through the ranks to become a professional search engine marketer taught to you by a seasoned professional. </p><p>But, why should you listen to me? </p><p>My name is R.L. Adams and I've published some of the best selling books and audiobooks in the field of online marketing and SEO. But in this course, you'll get the latest and the greatest information to help you rank today, not yesterday, with SEO. </p><p>In this course, you'll get the following benefits:</p><ul><li>In-depth understanding of SEO fundamentals</li><li>Powerful SEO strategies to rank your site today!</li><li>BONUS: 80+ pages of downloadable resource guides </li><li>Social media marketing techniques</li><li>An introduction to email marketing</li><li>And much more...</li></ul><p><strong>_____________________________________________________________________</strong></p><p><strong>Scroll up and hit the TAKE THIS COURSE button right now. </strong></p><p><strong>****************************************************</strong></p>", 
    "end_date": null, 
    "title": "SEO Training Academy: Learn Search Engine Optimization", 
    "price": 0, 
    "instructors": "R.L. Adams", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539858_5daa_3.jpg", 
    "course_url": "https://www.udemy.com/seo-training-academy-learn-search-engine-optimization/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T05:21:59Z"
}