{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Questions:</strong> How do you get started online? How do you build a web business? How do you start making money online for a tiny investment? </p><p><strong>Answer:</strong> <em>Build your own website and immediately publish valuable content</em>. </p><p>And, you know what’s really amazing? You can do that – I mean all of that – in just 5 minutes.</p><p>In order to build your own website you need two things:</p><ul><li>a <strong>do</strong><strong>main name</strong> (you need to register your www something dot com)</li><li>and <strong>web hosting</strong> (you need to get a physical server to host your website's files)</li></ul><p>In this course I'll show you how to do that easily and for less than $4 a month. I recommend good quality web hosts and domain name registrars but can do this course with any web host and domain name registrar you choose.</p><p><strong>WordPress</strong> is free, open source software that powers 20-25% of the world’s websites. You can use it to set up a one page website as well as an incredibly complex, busy website with thousands of pages and a shop.</p><p>I show you how to set up WordPress in seconds and provide you with a content management system that will be able to handle anything you can throw at it. <br></p><p>And we do it the right way – so it is <strong>optimized for search engines</strong>. </p><p>Sure, WordPress has a learning curve to it. But that’s really no excuse. It is very easy to build your own website, create content and set up a business that will support the lifestyle you want into the future – if you take this course!<br></p><p>And you can start now! <strong><em>This is the course that will enthuse you into taking action</em></strong>.  As soon as you set up WordPress you can start creating content and start building an online business and brand. </p><p>You can do it!</p>", 
    "end_date": null, 
    "title": "Set Up WordPress And Blog: A Crash Course In Web Publishing", 
    "price": 0, 
    "instructors": "Rob Cubbon", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646294_3e1d.jpg", 
    "course_url": "https://www.udemy.com/set-up-wordpress-and-blog-a-crash-course-in-web-publishing/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T00:07:20Z"
}