{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span>WordPress is the most widely used content management system on the planet. That&#039;s simply because it is so powerful and yet easy to use.</span>  </p>  <p>  \t        GoDaddy is the most widely used hosting platform on the planet. That&#039;s because they are affordable and also easy to use.  </p>  <p>  \t        This course mashes those two items together to help you create an amazing Website quickly and easily.  </p>  <p>  \t        I will walk you through every step of the process to get your site setup, running and looking great.  </p>  <p>  \t        If you have wanted to get a Website for your business or organization or if you have wanted to move your Website to WordPress <strong>this course is for you!</strong>  </p>  <p>  \t        This is a video-based course that shows you how to setup everything step by step.  </p>  <p>  \t        If you have never setup a Web hosting account or Website before you will feel your brain stretch a bit as you go. But just follow each step and you will be up and running in no time.  </p>  <p>  \t        You could realistically be up and running in an afternoon.  </p>  <p>  \t        This course is meant to take the mystery out of making a Website. It&#039;s not out of the realm of your capability. WordPress and GoDaddy make setting up a Website straight forward and easy. This course guides you through the process so you are sure to have everything up and running correctly and effectively.  </p>", 
    "end_date": null, 
    "title": "Setup A WordPress Website on GoDaddy - From Start To Finish", 
    "price": "20.00", 
    "instructors": "Sage Lewis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/331932_8787_4.jpg", 
    "course_url": "https://www.udemy.com/wordpressbysage/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-30T18:04:10Z"
}