{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Follow our step by step tutorials to learn everything you need to know about setting up and managing a WordPress website.</span>  </p>  <p style=\"\">  \tIf you have never set up a website before and wouldn&#039;t know where to start, then this course is perfect for you. You do not need any prior experience to follow our course, in fact all you will need to have is a domain name and hosting and we&#039;ll talk you through the rest.<span style=\"\"> </span>  </p>  <p style=\"\">  \t<span style=\"\">This course will ideally suit someone who wants to learn how to set up a website and build up a good following for it as we will also take you through some good techniques to start your email marketing and SEO campaigns in the right way.</span>  </p>  <p style=\"\">  \t<span style=\"\">So whether you have a business that you want to setup up online or you just want to setup a website to share some knowledge, this is the course for you.</span>  </p>  <p style=\"\">  \t<span style=\"\">Don&#039;t be one of the &#039;I wish I had&#039; people out there as there really are enough of them. Make the decision now to learn the techniques you need to learn to give yourself a head start in the online industry.</span>  </p>  <p style=\"\">  \t<span style=\"\">The best thing about our course is that we know where you are because we have been there to and we will always answer any questions as we want to help you get started up online.</span>  </p>  <p style=\"\">  \t<span style=\"\">If a certain aspect of this journey is really troubling you, be sure to leave us a comment and that could be the next subject of any additions that we make to our course.</span>  </p>  <p style=\"\">  \t<span style=\"\">So start now and let&#039;s get you on the road to building up your very own online presence with your first WordPress website. </span>  </p>", 
    "end_date": null, 
    "title": "Setup and manage your WordPress website today", 
    "price": "20.00", 
    "instructors": "Noisyegg Tutorials", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380430_2362_2.jpg", 
    "course_url": "https://www.udemy.com/setup-and-manage-your-wordpress-website-today/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T23:26:41Z"
}