{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn Javascript the simple way!  This course is especially helpful if you're a beginner to Javascript or even a beginner to the whole world of programing.  Dive in and let me show you how to get stuff done.  </p><p>Javascript is used to develop websites, servers, iPhone / Android apps, robots, and is the most popular language in 2015. This course helps you get your hands dirty by writing your own code for building web sites and web apps. It's packed with examples and practical how-to's. I walk you step-by-step through each of them, building on concepts as the lessons progress. </p><p>The course is divided into 2 sections: The Basics and User Interaction. In the Basics we go over creating and using Javascript strings, numbers, arrays, objects, and functions. You'll see how to calculate data and present it to the user in a dynamic fashion.</p><p>In the User Interaction section we build on of the fundamental lessons by using HTML and CSS to create elements for the user to interact with (i.e. typing text, clicking buttons). You'll learn how to capture these events and respond to them, as well as generate on-the-fly HTML and CSS. If you don't have any experience with any of these languages (HTML, CSS, or Javascript) that's perfectly ok! I have created these lessons with that in mind and you'll learn the basics of Javascript along with the HTML and CSS that's necessary to complete the course. </p><p>All you'll need is your web browser -- I recommend Google Chrome as it's what I use throughout the course. You'll use the web browser to write and execute the Javascript code. I hope you enjoy! </p>", 
    "end_date": null, 
    "title": "Simple Javascript: Learn by Doing, Beginners Welcome!", 
    "price": "20.00", 
    "instructors": "Elijah Windsor", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577796_d348_4.jpg", 
    "course_url": "https://www.udemy.com/simple-javascript-learn-by-doing/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T03:46:04Z"
}