{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>I want to teach intermediate angular JS to developers who have basic knowledge in application development and want to be able to use Angular javascript at client side effectively in business applications.</p><p>This course is having step by step code creation of <strong style=\"\">Single Page Application[SPA]</strong> of Angular JS framework with ASP NET MVC 5 Business Application. Based on my Experience i learned that most of the time people get confused when they want to merge <strong style=\"\">ASP Net MVC</strong> with <strong style=\"\">AngularJS MVW</strong> architecture with SPA, or they do some mistakes without knowing proper way of doing this.</p><p> This course will surely  solve this issue and make developers understand that how to implement this in real line of business application. In this course i am using number important features of MVC and Angular which are as follows.</p><ul style=\"\"><li>Asp Net MVC architecture</li><li>Web API 2</li><li>AngularJS MVW Architecture</li><li>Dependency Injection of AngularJS </li><li>AngularJS Routing</li><li>AngulatJS Resource</li><li>Directives like ng-show, ng-pattern, ng-model, ng-repeat, ng-view, ng-disable, ng-click etc.</li><li>Services like $http, $scope, $resource, $routeProvider, $location, $error, $dirty, $invalid, etc</li><li>BootStrap CSS for responsive UI</li></ul><p>The best thing of this course is we have combined <strong style=\"\">multiple modules, controllers, services, factory of angularJS  everything at one place</strong>  in a small POC [proof of concept] kind of project  so that after this developers can directly follow same for their projects. And things will be much clear when they do this with hands on step by step. </p><p>I make double sure that all the videos have proper steps and codes which should match with snippet and code source.</p><p></p>", 
    "end_date": null, 
    "title": "Single Page Application of MVC 5 Using AngularJS", 
    "price": "20.00", 
    "instructors": "Maruti Makwana", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563880_b82f_2.jpg", 
    "course_url": "https://www.udemy.com/maruti-spa-angularjs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T18:34:33Z"
}