{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span>With </span><strong style=\"\">&quot;Social Network Web Development&quot;</strong><span>, you will learn everything you need to create a social network site.</span>  </p>  <p>  \t            This course it&#039;s structured in <strong style=\"\">6 chapters</strong>, more than <strong style=\"\">30 video lectures</strong>.  </p>  <p>  \t            The entire course it&#039;s based on an social network site example, inspired mainly on pinterest like site, that you&#039;ll learn to create from zero. I&#039;m a real fan of the learn-by-project method because it forces you to learn all the concepts applying them with something that you can use and re-use at the end.  </p>  <p>  \t<strong style=\"\">Why learn to create a social network site?</strong>  </p>  <p>  \t            The full course has <strong style=\"\">more than 30 video lectures</strong>, divided into 6 chapters. Each chapter will give you a new level of knowledge in developing a social network site. We&#039;ll start from the basics with <strong style=\"\">XHTML,</strong> <strong style=\"\">CSS</strong> and <strong style=\"\">Javascript</strong> to more advanced and the most popular/requested programming languages nowadays, such as <strong style=\"\">ASP.NET 4.0, jSON, AJAX, jQuery, OOP, WebServices,</strong> the <strong style=\"\">MS SQLServer</strong> database and the new<strong style=\"\"> HTML5</strong>+<strong style=\"\">CSS3</strong>!  </p>  <p>  \t            The source code of each chapter will be available for you to download as well.  </p>  <p>  \t<strong style=\"\">&quot;</strong><strong style=\"\">Social Network Web Development</strong><strong style=\"\">&quot;</strong> will give you a new perspective on how the Internet works and after you completed the course you will be able to create your own websites and apps with the latest technology. Hope you enjoy!  </p>  <p>  \t<strong style=\"\">Why Learn How to Create a Social Network Site?</strong>  </p>  <p>  \t             The internet is evolving real fast and so are the platforms. There are some huge social networks where you share a little bit of everything. Those that rocks are just few of them. It&#039;s preferable to have a niche social network that&#039;s focused in a particular topic. When you learn the content of this course you&#039;ll be able to create your own niche social network like a Tattoo Social Network, Scuba Diving Social Network, Mini Cooper Social Network, what ever you like.  </p>  <hr style=\"\">  <br style=\"\">  <strong style=\"\">***** FREE BONUS! *****</strong><br style=\"\">  <br style=\"\">                Everyone who joins to this course will have access to my magic ready code <strong style=\"\">Sicuel2Vibi software</strong> that creates a lot of code with a single click.<br style=\"\">  <br style=\"\">  <u style=\"\"><strong style=\"\">How It Works:</strong></u><br style=\"\">  <br style=\"\">                Connect to your database server, choose the database and click the magic button. It will create automatically all the <strong style=\"\">Business Logic Layer </strong>and<strong style=\"\"> the Webservices.</strong><br style=\"\">  <br style=\"\">                Just this software it&#039;s <strong style=\"\">worth the entire price of this course</strong> and you can use this software in <strong style=\"\">unlimited sites</strong> you create for you or your clients. Have Fun!", 
    "end_date": null, 
    "title": "Social Network Web Development", 
    "price": "50.00", 
    "instructors": "Leo G.", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/56513_982e_14.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-social-network-site-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-26T16:13:14Z"
}