{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t      If you are developing an application for today's Internet, you can't miss letting your users <strong>sign up/in using their Facebook or Google account</strong>. Not only that, you may also find <strong>accessing their social data</strong>, like their friends list, very useful.  </p>  <p>  \t      This tutorial will show you how to do that, <em>step-by-step</em>. After discussing the basics in a very simple manner, here we are going to develop a sample web application to let users sign up and sign in using their social accounts and access their social data. We will begin with a simple Spring Boot web application secured with Spring Security having username/password sign up/in features, and we will extend that to have the social sign up/in and data access features. Watch the second lecture, which is a free preview video, to <strong>see the final application running and know what exactly we are going to develop</strong>.  </p>  <p>  \t  We are going to use Facebook in this tutorial, but you can extend it easily to other social sites after going through this tutorial.  </p>  <p>  \t      To follow this tutorial, you should have prior knowledge of <em>Spring Framework 4.x, Spring Boot, Spring Security, Spring MVC</em> and <em>Spring Data JPA</em>. If you don't know any of these well enough to understand and deploy the code that we are going to write, I'd recommend you first go through my <strong>Spring Tutorials</strong> available here at Udemy.  </p>", 
    "end_date": null, 
    "title": "Spring Social Tutorial: Socialize Your Spring Applications", 
    "price": "25.00", 
    "instructors": "Sanjay Patel", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426820_e91f_8.jpg", 
    "course_url": "https://www.udemy.com/spring-social-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T13:29:09Z"
}