{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Want to learn how to create webpages, but feeling intimidated by HTML and CSS? Not sure where to start? <strong>Step-by-step HTML and CSS for Absolute Beginners</strong> is a comprehensive and friendly course designed for beginners with NO previous coding or programming experience.    </p><ul>  \t<li><em>HTML (HyperText Markup Language) and CSS (Cascading Style Sheets) are the building blocks of the web. If you've ever looked at a website, you've seen HTML and CSS in action!</em></li></ul><p><br></p><p>Whether you want to make changes to your website's template, create new webpages from scratch, or just understand what you're doing when you cut-and-paste embed codes from sites like YouTube or SlideShare — understanding HTML and CSS makes it possible.<strong></strong></p><p><br><strong></strong></p><p><strong>HOW IS THIS COURSE DIFFERENT?</strong>    </p><p>  \t                                                My name is Kathleen, and I've been teaching technology to beginners under the moniker <strong><em>Robobunnyattack!</em></strong> since 2009. I believe that with the right approach, anyone can learn anything.  </p>  <p>  \t<strong>My goal in this course is to help you develop an intuitive understanding of how HTML and CSS work.</strong>  </p>  <p>  \t                                                In this course, we'll create a simple \"Coming Soon\" webpage using valid HTML5 and CSS3 code. As we work together, I'll explain WHY the code we write looks the way it does. I'll point out the simple patterns in the code, so you can <strong>learn more quickly and with more confidence</strong>.  </p>  <p>  \t                                                As we build our webpage, we'll cover:  </p>  <ul>  \t<li>What tools you need to write HTML and CSS, and how to use them</li>  \t<li>How to use HTML to organize and manage the content of your webpage</li>  \t<li>How to use CSS to control the presentation or \"look\" of your webpage</li>  \t<li>How web publishing works, and how to get your HTML and CSS files from your computer onto the web</li>  \t<li>How to use lots of other helpful and free web building tools, including code validators, free icon libraries, color scheme generators and more</li>  </ul>  <p>  \t<br><strong>    </strong></p><p><strong>By the end of this course, you'll be able to use HTML and CSS with confidence, following best practices every step of the way.  </strong>  </p>  <p><br>  \t                                                </p><p>Here's just a sample of what my (awesome!) students have to say about this course:  </p>  <p>  \t<em>\"My favourite part was learning how to tilt images and add drop shadows. Also, the instructor cares enough to answer questions promptly. Can't say enough good things about this course!\" —R.B.</em>  </p>  <p>  \t<em>\"Very accurate and detailed explanations with real time examples. For me it was a big step ahead...\" —Mihai E.</em>  </p>  <p>  \t<em>\"[Kathleen] knows exactly the info to deliver and what to leave out to avoid confusion.\" —Tara</em>  </p>  <p>  \t<em>\"What I once thought would be overwhelming to learn is surprisingly quite straight forward.\" —Odette</em>  </p>  <p>  \t<em>\"This course finally made CSS make sense to me.\" —Julie G.</em>  </p>  <p>  \t<em>\"Thank you, Kathleen, for a wonderful course! Never thought coding could be made fun.\" —Leslie V.</em><strong></strong></p><p><br><strong></strong></p><p><strong>WHAT'S INCLUDED?</strong>    </p><ul>  \t<li>This course includes lifetime access to 4 hours of step-by-step videos. You'll also get supplementary text lectures, links to helpful resources, HTML and CSS code examples, and downloadable project files.</li>  \t<li>Short quizzes at the end of each section will help you gauge your own understanding and check your progress along the way.</li></ul><p><br><strong></strong></p><p><strong>HOW LONG WILL IT TAKE ME?</strong>    </p><ul>  \t<li>This completely depends on your availability and learning preference. You can work through all the video lectures in one afternoon, or pace yourself over several days or weeks — it's up to you!</li></ul><p><br><strong></strong></p><p><strong>WHAT IF THIS COURSE ISN'T FOR ME?</strong>    </p><ul>  \t<li>This course comes with an <strong>unconditional 30-day Udemy-backed guarantee</strong>. Try out this course for 30 days and see for yourself if my approach to learning HTML and CSS is right for you. If you're not 100% satisfied with this course, simply request a full refund within 30 days — no conditions, no questions asked!</li>  </ul>  <p><br>  \t                                                </p><p>I'm confident you'll LOVE this course, and I'm excited to help you learn. <strong>Enrol now and you can start building your own webpage using HTML and CSS today!  </strong>  </p>  <p>  \t<em>—Kathleen Farley (aka Robobunnyattack!)</em></p>", 
    "end_date": null, 
    "title": "Step-by-step HTML and CSS for Absolute Beginners", 
    "price": "50.00", 
    "instructors": "Kathleen Farley", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/73080_7783_5.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-html-and-css-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-02T15:28:13Z"
}