{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Understand the technology and process for getting started on the internet.</strong></p><p>Learn how to find a host, pick a domain name and much more.</p><p>We should you the top Development tools with a massive list of free resources.  Compare different web editors for creating web code.  What a web server does and how it functions. Why local machines and virtual hosts are important in the development process.</p><p>This course will help you determine the constructor language PHP, .Net and Java.  We also discuss content management systems like Wordpress, Joomla, and Drupal.  What your hosting options are and how to select the best option for your business needs.   How to pick the best host provider that will meet you site requirements.   </p><p>Picking a domain name is a difficult decision, we help you pick an effective domain name and how to weight your options.  Subdomains and top levels domains.</p><p>FTP how to get your files online to the web host provider.</p><p>Database and the basics of using phpmyadmin to control and view data.</p><p>Version control with Git and using Github.</p><p>Web design how to wireframe and storyboard your website.  We provide top free tools to use to improve this process.</p><ul><li>quick lessons get right to the point</li><li>fully covered topics with real world examples</li><li>links to top resources to save time</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li><li>quick response support to students</li><li>regular discussions</li></ul><p>We teach you the latest techniques and tools to use in order to create amazing web content.  Everything you need to know is included in this course.</p><p>Learn at your own pace, lifetime access to this course.</p>", 
    "end_date": null, 
    "title": "Successful website creation - everything you need to know", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647442_5c1f.jpg", 
    "course_url": "https://www.udemy.com/total-guide-to-creating-websites-and-an-online-web-business/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T01:41:51Z"
}