{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn the tools, concepts and inbuilt functions you need to get a Symfony Security System up and running in your projects. Become more employable in the process.</p><p><strong style=\"\">With the skills taught in this course you can easily understand the inner workings of any other third party bundle you may choose to use in the future.</strong> <strong style=\"\">Or you can write your own!</strong></p><ul style=\"\"><li>More practice with console code generators</li><li>Deeper understanding of working with twig templates</li><li>Thorough explanation of the Security Encoding Component in both Fixtures and Controllers</li><li>Thorough explanation and coding of Application Login Functionality</li><li>Thorough explanation of Authorization and Access Control for your pages</li><li>More practice in writing a controller by hand</li></ul><p><strong style=\"\">A powerful and valuable skill at your fingertips</strong>.  <br style=\"\"></p><p>For PHP Developers there is no better choice in choosing a framework to bring your skill set to the next level. Symfony is one of the two main frameworks of choice in the PHP development world today and is the basis of the second. With powerful third party bundles, excellent documentation and a large giving community, Symfony is the most useful tool to add to your PHP collection.</p><p><strong style=\"\">Content and Overview</strong></p><p>Suitable for intermediate and advanced PHP developers, this lecture series takes a beginning look at the powerful and elegant security system in Symfony. If you can write a class but are not yet comfortable with the MVC paradigm then you&#039;ve come to the right place. We won&#039;t get bogged down in too much theory. Instead we will learn by doing.</p><p>In this 3 plus hour course we show targeted errors along the way so that you know how to handle them. We dig into the fundamentals of Authentication and Authorization in depth and practice many common skills along the way.<br style=\"\"></p><p>The course is designed to be your &quot;second&quot; tutorial. So many courses start at the very beginning and don&#039;t delve to deeply in any given subject. The question is asked where do I go next? The answer is here. Security is considered by most to be the most difficult of the Symfony Components. Here we will dispel that myth!</p><p>The course files are designed so that you can look at every coding change to any file along the  way. They are devided into each video section and only include the changed files so that you can easily navigate to any code you need to look at quickly.</p><p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\"><br style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "Symfony Login Application In Depth", 
    "price": "20.00", 
    "instructors": "Rick Mason", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612770_b432_2.jpg", 
    "course_url": "https://www.udemy.com/symfony-login-application-in-depth/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T14:29:18Z"
}