{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Join the most comprehensive and popular Angular 2 course on Udemy, because now is the time to get started! </strong></p>\n\n<p>From <strong class=\"redactor-inline-converted\">Setup</strong> to <strong class=\"redactor-inline-converted\">Deployment</strong>, this course covers it all! You'll learn all about <strong class=\"redactor-inline-converted\">Components</strong>, <strong class=\"redactor-inline-converted\">Directives</strong>, <strong class=\"redactor-inline-converted\">Services</strong>, <strong class=\"redactor-inline-converted\">Forms</strong>, <strong class=\"redactor-inline-converted\">Http</strong> Access, <strong class=\"redactor-inline-converted\">Authentication</strong> and <strong class=\"redactor-inline-converted\">much more </strong>- and in the end: You'll learn how to <strong class=\"redactor-inline-converted\">deploy</strong> <strong>an application</strong>!</p><p><strong class=\"redactor-inline-converted\">But that's not all!</strong> This course will also show you how to use the <strong class=\"redactor-inline-converted\">Angular 2 CLI</strong> and feature a <strong class=\"redactor-inline-converted\">complete project</strong>, which allows you to practice the things learned throughout the course!</p><p>And if you do get stuck, you <strong class=\"redactor-inline-converted\">benefit from an extremely fast and friendly support</strong> - both via direct messaging or discussion. You have my word! ;-)</p><p>With Angular 2 being in release candidate phase and almost released,<strong class=\"redactor-inline-converted\"> now is the time to jump in</strong> and take the advantage of being amongst the first to fully use the power and capabilities Angular 2 offers!<strong class=\"redactor-inline-converted\"> Learn all the fundamentals you need to know to get started developing Angular 2 applications right away. </strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course will be kept up-to-date to ensure you don't miss out on any changes once Angular 2 is finally released!</strong></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Hear what my students have to say</strong></p>\n\n\n\n<p><em><em>Absolutely fantastic tutorial series. I cannot thank you enough. The quality is first class and your presentational skills are second to none. Keep up this excellent work. You really rock!﻿ - Paul Whitehouse</em></em></p>\n\n\n\n<p><em>The instructor, Max, is very enthusiastic and engaging. He does a great job of explaining what he's doing and why rather than having students just mimic his coding. Max was also very responsive to questions. I would recommend this course and any others that he offers. Thanks, Max!<br></em></p>\n\n\n\n<p><em>As a person new to both JavaScript and Angular 2 I found this course extremely helpful because Max does a great job of explaining all the important concepts behind the code. Max has a great teaching ability to focus on what his audience needs to understand.</em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">This Course uses TypeScript</strong></p>\n\n\n\n<p>TypeScript is the main language used by the official Angular 2 team and the language you'll mostly see in Angular 2 tutorials. It's a superset to JavaScript and makes writing Angular 2 apps really easy. Using it ensures, that you will have the best possible preparation for creating Angular 2 apps. Check out the free videos for more information.</p>\n\n\n\n<p>TypeScript knowledge is, however, not required - basic JavaScript knowledge is enough.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why Angular 2?</strong></p>\n\n\n\n<p>Angular 2 is the next big deal. Being the successor of the overwhelmingly successful Angular.js framework it’s bound to shape the future of frontend development in a similar way. The powerful features and capabilities of Angular 2 allow you to create complex, customizable, modern, responsive and user friendly web applications.</p>\n\n\n\n<p>Angular 2 is faster than Angular 1 and offers a much more flexible and modular development approach. After taking this course you’ll be able to fully take advantage of all those features and start developing awesome applications immediately.</p>\n\n\n\n<p>Due to the drastic differences between Angular 1 and Angular 2 you don’t need to know anything about Angular.js to be able to benefit from this course and build your futures projects with Angular 2.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Get a very deep understanding of how to create Angular 2 applications</strong></p>\n\n\n\n<p>This course will teach you all the fundamentals about modules, directives, components, databinding, routing, HTTP access and much more! We will take a lot of deep dives and each section is backed up with a real project. All examples showcase the features Angular 2 offers and how to apply them correctly.</p>\n\n\n\n<p>Specifically you will learn:</p>\n\n\n\n<ul><ul><li>Which architecture Angular 2 uses</li><li>How to use TypeScript to write Angular 2 applications</li><li>All about directives and components, including the creation of custom directives/ components</li><li>How databinding works</li><li>All about routing and handling navigation</li><li>What Pipes are and how to use them</li><li>How to access the Web (e.g. RESTful servers)</li><li>What dependency injection is and how to use it</li><li>We will build a major project in this course</li><li>and much more!</li></ul></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Pay once, benefit a lifetime!</strong></p>\n\n\n\n<p>This is an evolving course! Angular 2 currently is in beta and this course will therefore be expanded and reflect futures currently not fully implemented or documented. You won’t lose out on anything!</p>\n\n\n\n<p>Don’t lose any time, gain an edge and start developing now!</p>", 
    "end_date": null, 
    "title": "The Complete Guide to Angular 2", 
    "price": "30.00", 
    "instructors": "Maximilian Schwarzmüller", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756150_c033.jpg", 
    "course_url": "https://www.udemy.com/the-complete-guide-to-angular-2/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T17:02:55Z"
}