{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>You’re here because you’re ready to start building professional, career-boosting websites.</p>  <p>Or maybe you’re coding already and want to take things to the next level?  </p>  <p>I’m here because I’m the creator of the <em>best-selling, highest-rated</em> coding courses on Udemy—and I love to share my secrets with you.</p>  <p><strong>Welcome to The Complete Web Developer Course 2.0<em> </em></strong></p>  <p>Based on feedback from over 25,000 5-star reviews, I’ve created <strong>The Complete Web Developer Course 2.0, </strong>the sequel to my global smash-hit: Build 14 Websites course. </p>  <p><em>It’s my most current, in-depth and exciting coding course—to date.</em></p>  <p>Designed for you—no matter where you are in your coding journey—my next-generation web developer course is overflowing with fresh content. Jam-packed with high-quality tutorials.  And crucially, features the most advanced, hot-off-the-press software versions.</p>  <p><em>It’s your fast-track to iron-clad coding results.</em></p>  <p><strong>We’ve left no stone unturned. </strong></p>  <p>I guarantee, this is THE most thorough, laser-focused and up-to-date coding course available ANYWHERE on the market—or your money back.</p>  <p>Whether you’re an entrepreneur, an innovator or the next Mark Zuckerberg just waiting to happen, here you’ll find everything you need to get up and coding—fast. </p>  <p>And it’s all in one perfectly-packaged, super-convenient online solution.</p>  <p><em>“It is hard to find a complete course out there that is like this one. I am amazed at the value of the content and I would without a doubt recommend it to anyone looking for a complete web developing course.”</em> -Daniel Lim</p>  <p><strong>From zero to break-neck speed in just six weeks.</strong></p>  <p>What else makes my course different?  It’ll take you from beginner to expert in just six weeks (or take it at your own pace—whatever suits you).</p>  <p><em>“I went from total novice to getting my first paid client, before I’d even finished the course. Almost unbelievable!” </em>Priti Palmer.</p>  <p><strong>Don’t be the one to get left behind</strong></p>  <p>Get started today and join millions of my happy students, many of whom have changed careers, created second incomes or added critical new skills to their tool kits. </p>  <p>Oh, and did I mention you get FREE unlimited hosting for one year?  <strong></strong></p>  <p>Sign up to <strong>The Complete Web Developers Course 2.0</strong> today and revolutionise your learning. Effortlessly embed the fundamentals. Refresh your groundwork. Dig deeper than ever. Start building powerful apps and cash-earning websites today—and enjoy bigger, brighter opportunities.<strong></strong></p>  <p><em>“Excellent course gives you everything you need to know for doing awesome websites!”</em> - Steven De Jesús</p>  <p><strong><u>Don’t believe me? I offer full money back guarantee if you haven’t earned your money back within 60 days of completing the course.</u></strong></p>  <p>Ready to open new doors and become a smart, in-demand web developer?  </p>  <p>Here’s what you get with <strong>The Complete Web Developer Course 2.0</strong></p>  <p>You’ll get access to twelve chapters that dig deep into the nitty gritty of building successful websites.</p>  <p>Each chapter is supported with over 40 hours of clear, intelligent video tutorials and practical website challenges. </p>  <p><strong>All at your fingers tips. Right now.</strong></p>  <ul><li>The course starts with the fundamentals. I’ll show you insider tips to work quickly and efficiently with web technologies like HTML5, CSS3 and Python.  </li><li>Once you’ve got that locked down, I’ll show you how to build your own responsive websites using more advanced techniques such as iQuery PHP 7, MySQL 5 and Twitter Bootstrap. </li><li>By then you’ll be developing blogs and eCommerce sites with Wordpress, and learn smart ways to add dynamic content, using APls to connect to sites such as Google Maps and Facebook.</li><li>As we all know, the best way to learn is to do, so you’ll complete fun website challenges at every turn. Plus, as you fly through the course, you’ll use your skills to put a site together as you go. The final challenge is a full Twitter clone. </li></ul>          <p><em>“Very easy to follow along with how the course has been divided into small topics. The summary pages at the end of each topic are very useful to review if you have to take a break from the course, allowing you to pick up right where you left off.”</em> - Andrea Price-Lace</p>    <p>Over 12 chapters you will learn:</p>  <ul><li><strong>How does the web work?</strong></li><li><strong>Setting up your (free) hosting</strong></li><li><strong>HTML</strong></li><li><strong>CSS</strong></li><li><strong>Javascript</strong></li><li><strong>jQuery</strong></li><li><strong>CMSs and WordPress</strong></li><li><strong>Responsive Design</strong></li><li><strong>PHP Coding</strong></li><li><strong>MySQL Databases</strong></li><li><strong>Putting it all together: Making a Twitter clone</strong></li><li><strong><em><u>Bonus Chapter: How to make $10,000 while learning to code</u></em></strong></li></ul>                        <p>What else will you get?</p>  <ul><li><strong>A friendly,  informal community to support you every step of the way</strong></li><li><strong>Personal contact with me, the course tutor</strong></li><li><strong>Ebooks that will show you how to start earning before you’ve even finished</strong></li><li><strong>Lifetime access to course materials</strong></li><li><strong>Hands-on learning to lock that knowledge in</strong></li><li><strong>A deep understanding of how to code, design and build powerful websites</strong></li><li><strong>FREE UNLIMITED WEB HOSTING FOR ONE YEAR (worth $199)</strong></li></ul>                <p><em>“There are TONS of books, expensive courses, and crappy videos online that you could waste hours upon hours on. DON’T. Just take this course. You’ll see.” T. Henderson</em></p>  <p>Never waste another minute learning from out-of-date books, clunky and expensive online courses and yawnsome YouTube videos again! </p>  <p>With <strong>The</strong> <strong>Complete Web Developer Course 2.0</strong> everything’s ready to go, in one convenient, mapped-out platform.  </p>  <p>Plus you’ll get fast, friendly, responsive support by email, Twitter and on the Udemy forums.  Or enjoy chatting with 100,000 other students in my friendly forums.</p>  <p><em> </em></p>  <p><em>“Great course!!! Easy to follow and gives great support if needed! Both the instructor and fellow students are quick at helping out.” - </em>Malin Singleton</p>  <p><strong> </strong></p>  <p><strong>Take a peek at my bio below, to see how I gave up my successful career to teach others to code part time.  Since making that decision, my life has changed beyond compare. </strong></p>  <p><strong>I guarantee that ANYONE can benefit from taking this course, whether it’s earning some extra money or changing your career altogether.</strong></p>  <p><strong><u>So what <em>are you waiting for? Transform your world and sign up now to get a free copy of my exclusive 20 page ebook ‘How to make $10,000 while learning to code’.</em></u></strong></p>  <p><em>“I learned more in the first few HTML tutorials then I did with 70% of code academy.” - Louis Elliott</em></p>  <p><strong>Taught by</strong></p>  <p>Hi! I’m Rob. I have a degree in Mathematics from Cambridge University and you might call me a bit of coding geek.  </p>  <p>After building websites for friends and family for fun, I soon learned that web development was a very lucrative career choice. I gave up my successful (and sometimes stressful) job as a teacher to work part time and today, couldn’t be happier. </p>  <p>I’m passionate about teaching kids to code, so every summer I run codeschoolorguk in the beautiful city of Cambridge. I also run the popular web hosting and design service, Eco Web Hosting, which leaves me free to share my secrets with people like you.</p>  <p>You wouldn’t believe the freedom that being a web developer offers. Sign up and find out for yourself why so many people are taking and recommending this course.  I genuinely believe it’s the best on the market and if you don’t agree, I’ll happily refund your money.</p>  <p><em>“If you’re looking for a genuinely effective course that gears you up to competently build polished, professional websites that people will want to pay you for, I personally guarantee this is the ONLY course for you.” Rob Percival</em></p>  <p>Sign up to <strong>The Complete Web Developer Course 2.0</strong> and join me in this amazing adventure today.</p>  <p><em> “The course is excellent. I haven't completed even half the course but couldn't wait to share my review based on the experience so far. This is just the perfect recipe for students who have little or no knowledge of the technologies required to develop websites. (It also helps the students who know them). The one thing that impressed me a lot was the motto - Learn by Doing. I personally knew these technologies as I had studied them in college but I really learned them while doing this course!! And there's the difference. The practical hands on knowledge is really helpful. Kudos! Keep up the good work :).”</em> -Veeresh Kamble</p>  <p><strong><em> </em></strong></p>", 
    "end_date": null, 
    "title": "The Complete Web Developer Course 2.0", 
    "price": "50.00", 
    "instructors": "Rob Percival", 
    "commitment": "30.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764164_de03_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-web-developer-course-2/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T09:09:40Z"
}