{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>The Ultimate HTML Developer Course</strong> is about teaching you proper HTML. HTML is the structure behind every web page and you <em>cannot </em>create a website <em>without </em>using HTML, including mobile websites and cross-platform compatible HTML5 apps.<br></p><p>In this course you will learn everything you need to know about HTML, XHTML and HTML5. Even if you know HTML, this course will teach you the ins and outs of HTML and challenge what you <em>think </em>you know.</p><p>This course specializes in HTML only. You will become a professional in just a few hours!</p><p><strong>This course is very compact.</strong><br></p><p>Other development courses are bloated with empty space, watching the teacher code in silence and other time-wasting events. The Ultimate HTML Developer Course has removed all time-wasting sections of a video and is designed to teach you the most HTML in the shortest time while getting <strong>hands on practice.</strong><span></span></p><p>The total course is just three hours, split into videos that are no longer than 10 minutes each. <strong>By the end of this course you will know as much HTML as a college student and you'll be 100% ready to move on to the next step as a professional.</strong></p><p><strong>Why take this course?</strong><br></p><p>If you have an idea, want to start a company or just want to make websites for fun, this course is for you. The Ultimate HTML Developer Course gives you all the HTML skills you will need to succeed as a web developer. </p><p><strong>Still not sure about this course?</strong><br></p><p>Preview the first few lessons of this course for free to get a clear idea of what you can expect from every video.</p>", 
    "end_date": null, 
    "title": "The Ultimate HTML Developer", 
    "price": "45.00", 
    "instructors": "The Ultimate Developer School, Kalob Taulien", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721192_6219_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-html-developer/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T20:38:22Z"
}