{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>WordPress powers over 25% of all websites!</strong></p><p>So if you're thinking of creating a new website, or changing your existing site, WordPress is a fantastic solution.</p><p>It's easy to use, but at the same time hugely powerful and flexible - and it can be used to create almost any kind of website.  Including:</p><ul><li>Company websites.</li><li>Blogs.</li><li>Online stores.</li><li>Even discussion forums.</li></ul><p><strong>Okay, so what exactly is WordPress?</strong></p><p>Well, it's free-to-use software that allows you to quickly and easily create a great looking website, with a ton of functionality.  Plus, WordPress makes updating and maintaining that site incredibly easy.</p><p>However, like any software, there's a learning curve involved.  There's specific terminology to learn, and quite a lot of unique know-how required, to really start getting comfortable and productive with WordPress.</p><p>And there's certainly tons of WordPress tutorials online.  However, many are out of date, some go way more in depth than you need, and often with free tutorials they don't give you the complete picture.</p><p><strong>So that's where this tutorial comes in!</strong></p><p>It's right up to date with WordPress, and takes you from complete beginner to having your own website, and knowing exactly how to manage that site.  This course will help you:</p><ul><li>Claim your own address on the web.</li><li>Install WordPress.</li><li>Customize WordPress so it looks exactly as you'd like it to.</li><li>Add all the content you'd like to your site easily - pages, blog posts, images, videos, audio...</li><li>Easily maintain your site.</li></ul><p>In fact, if you follow along with this course, you could even have your own website online in the next 24 hours.</p><p>Sound good?</p><p><strong>Sign up now, and get started easily creating your own great looking WordPress site.</strong></p>", 
    "end_date": null, 
    "title": "The Ultimate Crash Course to WordPress", 
    "price": 0, 
    "instructors": "Louis Allport", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651184_b950_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-crash-course/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T12:46:28Z"
}