{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">&quot;This  has been one of the best web courses ever. It should be used as a model  by almost anyone thinking of teaching on the web. It has cleared out  nearly a decade of web programming cobwebs. The fact you have made a  course which is complete end-to-end is impressive. The fact that code  examples all work puts nearly every programming book and most web  courses to shame.&quot;</strong><em style=\"\"><br style=\"\">Paul Wolfson, Principal Investigator, Dallas Legal Technology</em></p><p><em style=\"\">---------------------------------------------------------------------------------------------------------</em></p><p><strong style=\"\">&quot;The Ultimate Web Development course is the most user friendly course I have encountered to date. Additionally, the lecturer, Dr. Richard Stibbard is extremely committed and accessible. Oh! If only all the on-line lecturers could take a page from his book.</strong>&quot; <em style=\"\"><br style=\"\">Urich Wilmot-Hoyte</em><br style=\"\"></p><p>-----------------------------------------------------------------------------------------------------------<br style=\"\"></p><p style=\"\"> <strong style=\"\">&quot;Solid Full Stack Development course </strong><strong style=\"\">-  I have been through numerous other books and courses trying to get up to speed on CSS, JQuery, Ajax, and PHP, and so far this is the most effective. I think there are two keys to it&#039;s success. First, the app developed throughout the course is reasonably complex and whether its a particular look in CSS or behaviour in jQuery, it accurately reflects what modern apps really look like. Next, there is enough hands on coding in all the tools that it really begins to stick. HIghly recommended for anyone wanting broad introduction to modern web development that really touches almost all the bases.&quot; <br style=\"\"></strong><em style=\"\">Donald Brummel</em><strong style=\"\"></strong></p><p>-----------------------------------------------------------------------------------------------------------<br style=\"\"></p><p>  \t          Taught by freelance developer and experienced online educator <strong style=\"\">Dr. Richard Stibbard</strong>, this course takes you in easy steps through the entire process of building an up-to-date web interface <strong style=\"\">which updates its database and HTML on the fly without the need for page refreshes</strong>, rather like the &#039;Add to Favourites&#039; function on Youtube or Trivago&#039;s hotel search.  </p>  <p>You will learn how to:  </p>  <ul style=\"\">  \t<li style=\"\">structure a website using <strong style=\"\">HTML5</strong></li>  \t<li style=\"\">apply styling with <strong style=\"\">cascading stylesheets</strong> (CSS)</li>  \t<li style=\"\">convert a static site to a dynamic one using <strong style=\"\">PHP</strong></li>  \t<li style=\"\">remove inefficient duplicate code</li>  \t<li style=\"\">use PHP <strong style=\"\">functions </strong>to isolate variables</li>  \t<li style=\"\">use <strong style=\"\">MySQLi </strong>and <strong style=\"\">prepared statements</strong> for secure database queries</li>  \t<li style=\"\">manipulate page content immediately with <strong style=\"\">jQuery</strong></li>  \t<li style=\"\">update the database silently with <strong style=\"\">AJAX</strong></li>  \t<li style=\"\">upload the project to a web host and deal with important <strong style=\"\">security considerations</strong>.</li>  \t<li style=\"\">PDF version of the course allows full-text search</li>  </ul>  <p>  \t                                            The course is equally suitable for beginners or more advanced students. For beginners there are step-by-step instructions which take you through every step of the project until all the principles have been covered, and then hand over to assignments which allow you to put into practice what you have learned before you see the solutions.  </p>  <p>  \t                                              For learners already familiar with some aspects of web design and development who want to move onto specific points more quickly, <strong style=\"\">incremental working files </strong>and clear guidance are provided at every stage, allowing you to skip lessons you do not need and rejoin the course at any point without losing track of the necessary code.  </p>  <p>  \t                                              With studio quality audio, widescreen HD video, and incremental versions of the source code, this efficiently organized course teaches up-to-date coding techniques and gives comprehensive coverage of an important aspect of modern web development.  </p>", 
    "end_date": null, 
    "title": "The Ultimate Web Development Course", 
    "price": "35.00", 
    "instructors": "Richard Stibbard", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/30240_8bff_16.jpg", 
    "course_url": "https://www.udemy.com/build-an-instant-update-database-interface-with-jquery-ajax/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-21T11:02:19Z"
}