{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>The Premier Web development Course. </strong> EVERYTHING web creation.</p>\n\n<p><strong>Regular content updates and new material.  One stop place to learn web development!</strong></p>\n\n\n\n<p><strong>Did you know that you can make an extra income online by learning the skills presented in this course!  </strong>Whether you want to earn extra income, change your career or want to launch your own web business this is the course for you.  You can begin to earn money online by while you're learning and practicing web development.   </p>\n\n\n\n<p><strong>We teach you the skills you need to succeed.</strong></p>\n\n\n\n<p>Everything you need to know to create your own websites and web applications, easy to follow complete course.  Creating websites give you freedom to express you creativity, launch a business and a whole lot more.   </p>\n\n\n\n<p>I've been a web developer for over 14 years, and I wanted to create a course that has it all, answers all of your questions about starting off and gives you the base to launch your own successful web creations.</p>\n\n\n\n<p>This course is designed to have important information to everyone of all levels, we include source code, practice exercises, challenges, quizzes, resources, examples, samples and everything else in between.  I want you to be able to take this course and gain a solid understanding of how to create your own websites.   This course is designed to be effective at teaching and stressing the important aspects and common goals to create websites.</p>\n\n\n\n<p>This course is designed to equip you with the knowledge to proceed with your own goals.</p>\n\n\n\n<p>We are also planning on having regular updates, if you find something isn't covered or you want more information let me know and I will help.  I'm committed to creating a premier course that is designed to help.</p>\n\n\n\n<p>We cover everything in an easy to follow format.</p>\n\n\n\n<ul><li><strong>HTML<br></strong></li><li><strong>CSS<br></strong></li><li><strong>JavaScript<br></strong></li><li><strong>JQuery<br></strong></li><li><strong>Bootstrap<br></strong></li><li><strong>PHP</strong></li></ul>\n\n\n\n<p>We have a full 30 day money back guarantee. Content is designed to be effective and clear.</p>\n\n\n\n<p>We walk you through step by step with detailed explanations of code and more.<br></p>\n\n\n\n<ul><li>quick lessons get right to the point</li><li>fully covered topics with real world examples</li><li>source files downloadable to work along</li><li>challenges and lessons and code samples</li><li>code snippets</li><li>Links to top resources to save time</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li><li>quick response support to students</li><li>regular discussions</li></ul>\n\n\n\n<p>Everyone and anyone can benefit from this course.  </p>", 
    "end_date": null, 
    "title": "The Ultimate Web Developer How To Guide", 
    "price": "40.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "22.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629142_15c2_3.jpg", 
    "course_url": "https://www.udemy.com/learn-web-development-complete-step-by-step-guide-to-success/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T20:24:02Z"
}