{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Do you want to create an awesome web application but aren’t sure where to start?</strong></p>\n\n<p>Hi, I’m Nick and for the last year I've been teaching thousands of happy\nstudents how to deploy web applications with Docker.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Now I want to teach you how to develop PRODUCTION READY web applications with\nconfidence.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Most learning material out there only teaches you how to build <em>toy examples</em>\nand throw out lines like “you wouldn’t want to do this in production…”, <strong class=\"redactor-inline-converted\">but\nthen they never tell you the REAL way to do it</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Imagine how awful you’d feel after spending your time and hard earned money but\nstill had to do a ton of research to complete your project. I’ve been there,\ndone that and it’s not fun.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Instead, <strong class=\"redactor-inline-converted\">a large portion of the code base in my course is battle hardened from running in production on multiple projects</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I’ll be at your side explaining my thought process along the way while we build\nup a multi thousand line application together.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’re going to walk away with everything you need to <strong class=\"redactor-inline-converted\">feel confident building\nyour own web applications.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"Wow, what an amazing resource you've made. The app source is amazingly concise (clearly years of experience distilled). Honestly, it's the handsomest web app code base I've ever seen. - David N.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<h5><br><strong class=\"redactor-inline-converted\"></strong></h5>\n\n\n\n\n\n\n\n\n\n<h5><strong class=\"redactor-inline-converted\">Here’s just some of what you’ll learn by taking my course:</strong></h5>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Learn how to use Docker to “Dockerize” a web application</li><li>Learn what Flask is and how to use its features in your applications</li><li>Learn how to create a Python 2 and 3 compatible code base</li><li>Learn how to use PostgreSQL, Redis and Celery with Flask</li><li>Create a full blown user management system</li><li>Create a flexible custom admin interface</li><li>Accept both recurring and microtransaction credit card payments</li><li>Deal with both HTML template and JSON responses</li><li>Logging, middleware and error handling</li><li>Database migrations and internationalization (i18n)</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"I have been working with Flask for the past 3 years and have been a technical reviewer on the Mastering Flask Packt book, even so, I am learning so much form you! - Pedro B.\"</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<h5><br><strong class=\"redactor-inline-converted\"></strong></h5>\n\n\n\n\n\n\n\n\n\n<h5><strong class=\"redactor-inline-converted\">What makes Flask awesome?</strong></h5>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Based on one of the most popular computer languages in the world (Python)</li><li>Minimalistic and easy to get started</li><li>Lightning fast (Pinterest’s API serves 12+ billion requests / day with Flask)</li><li>Vibrant community and ecosystem (hundreds of high quality extensions)</li><li>Profitable for freelancing and consulting</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<h5><strong>Why is Docker worth using?</strong></h5>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Saves you from a ton of headaches when setting up development environments</li><li>Easily move an application across environments or servers</li><li>Prevents issues such as “well, it worked on my machine!”</li><li>Makes developing with teams a much more pleasant experience</li><li>You won’t need expensive hosting to deploy your web applications</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You won’t just become a Flask master by taking my course but you’ll also gain the confidence in developing web applications so that <strong>you can command the hourly rates\nyou deserve as a software developer</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This could be done through increasing your rates as a freelancer or negotiating\na higher salary at your job. In my years working as a consultant and talking to\na lot of developers, I discovered that most developers are not confident in their\nability to fulfill work that is requested of them.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Some of them are even afraid to bid on or accept contract work.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This is actually a very common problem and is described as “Impostor Syndrome”.\nI’ve suffered from it for a long time and it has cost me tens of thousands of\ndollars and now I want to save you the hardship of making the same mistake.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>You might be thinking “Nick, how in the world is a course on Flask going to let\nme raise my rates?”</strong> and that’s a great question but before I answer that, let’s\njust play around with a few numbers:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>If you work 20 hours a week for the next year at $30/hour then you would stand to make $31,200.</li><li>After you double your rate then you would make $62,400 instead.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Wouldn’t you want an extra 30k in your pocket every year? You know, the only\nreal difference between a $30/hour and $60/hour developer is their mindset.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>One of them believes they can fulfill the job, while the other struggles to\nbelieve in themselves.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>How will Build a SAAS App with Flask help you generate more income?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Simple, you’re going to get a battle hardened web application that you can use\nas a bulletproof base for your next project. You won’t have to sit there second\nguessing yourself while researching everything on your own.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’re getting well tested code that’s been running in production. <strong>Tons of\nedge cases have been ironed out</strong>, and <strong>features were added due to real life\nneeds</strong>. Not only that, but I’ll be at your side explaining everything to you\nwhile you make your way through the course.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’re going to <strong>see how the application gets built up from a single file,\nall the way to a 4,000+ line project</strong> that spans across dozens of files and folders.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If that’s not enough, I’ll be available to answer any questions you have in the\ncourse’s forums and <strong>all of my courses come with an unbeatable 30 day guarantee</strong>\nthat’s 100% RISK FREE. If you don’t love the course then I insist you get a\n100% refund – no questions asked.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"Definitely delivers on hours and sanity saved! Comprehensive and well worth it. - B.C.\"<br></em></p>", 
    "end_date": null, 
    "title": "The Build a SAAS App with Flask Course", 
    "price": "40.00", 
    "instructors": "Nick Janetakis", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/856526_8cd8.jpg", 
    "course_url": "https://www.udemy.com/the-build-a-saas-app-with-flask-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-22T12:37:29Z"
}