{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The world’s favorite programming language now comes with more things to love. PHP 7 is finally here, with spankin’ new enhancements to make your app and websites more powerful.\n\n  </p>\n\n<p>PHP is a popular server-side programming language that now also doubles as a general programming language for building apps. The freedom of coding in PHP, as well as ease in learning the language has maintained PHP as the go to language for many developers.\n\n  </p>\n\n\n\n<p>The latest iteration builds on the greatness of the original PHP, adding speed and performance, along with some additional syntax features to make the coding cleaner, faster and better. The change in performance and speed can be credited to the new Zend Engine 3 that powers the latest PHP, making it twice as fast for websites such as WordPress, as well as using half as much memory as PHP 5 and even allows better support for more component users as the same time.\n\n  </p>\n\n\n\n<p>In addition the turbocharged engine, the new PHP also includes some syntax modifications such as the unserialise function that now accepts another optional parameter, password has function that now automatically generates a secure salt, fatal- or recoverable-level legacy PHP error mechanisms are now replaced with object-oriented exceptions, addition of left-hand-side expressions, deprecated or unmaintained server application programming interfaces (SAPIs) were discarded, list() operator now includes support for strings,  even modern language features such as return type declarations for functions, and support for the scalar types in return type and parameter declarations.\n\n  </p>\n\n\n\n<p><strong>So, where can you learn all of these amazing features? Here, of course!</strong>\n\n  </p>\n\n\n\n<p>Our PHP guide course has been designed for programmers to fall in love with PHP all over again. The course will not only cover the basics of PHP 5 but also go over the fundamentals of PHP 7 and help breakdown the latest coding paradigms to make them easier to incorporate them in your latest projects.\n\n  </p>\n\n\n\n<p>Learn all about the Throwable Interface, Handling Fatal Errors, Fetching Data &amp; Error Handling, Generator Delegation, new spaceship operator, Anonymous Classes, and so much more. If that’s not enough, the course also includes quizzes to help test your knowledge and even a fully operational project to help you get a more hands on experience with the latest PHP.\n\n  </p>\n\n\n\n<p>Come on, let’s get started developing amazing and powerful apps with the latest supercharged PHP language!</p>", 
    "end_date": null, 
    "title": "The Complete PHP 7 Guide for Web Developers", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/839174_3d5e_3.jpg", 
    "course_url": "https://www.udemy.com/the-complete-php-7-guide-for-web-developers/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-04T07:07:05Z"
}