{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Welcome To The Complete Bootstrap Masterclass - Build 4 Projects </strong></p>\n\n<p><strong>⇉ Watch the promo video </strong>to see How You Can Begin Mastering Bootstrap To Build You Next Professional Website Today! <br></p>\n\n<p><strong>⇉ This Course is MASSIVE! </strong>You receive over<strong> 7+ hours of video</strong> content &amp; <strong>60+ lectures!</strong></p>\n\n<p><strong>⇉ Join Over 100,000+</strong> <strong>Students</strong> Who Have Enrolled In My Udemy Courses This Year!</p>\n\n<p><strong>⇉ 2500+ Five Star Reviews Shows</strong> Students Who Enrolling Are Getting Real Results!</p><p><em class=\"redactor-inline-converted\">\"Complete bootstrap course....well explained.....After searching so many courses in udemy,this course taught me complete bootstrap and it is for beginner to advanced...Thank you very much...\" -Pratrap</em></p><p><em>\"This was one of the best courses I've ever joined\" -Tariq Alkhassa</em></p>\n\n<p><em class=\"redactor-inline-converted\">__________________________________________________________________________</em></p>\n\n<p>Learn the basic concepts, tools, and functions that you will need to build beautiful, fully functional, professional landing pages within the bootstrap framework. But that is not all you will learn from enrolling in our course... </p>\n\n<p><strong>You Will Learn: </strong></p>\n\n<ul><li><strong>Bootstrap components</strong></li><li><strong>Grid System</strong></li><li><strong>Customizing Bootstrap</strong></li><li><strong>Glyphicon icons</strong></li><li><strong>So Much More! </strong></li></ul>\n\n\n\n<p>This course will help you create a perfect bootstrap responsive landing page for your app, business, portfolio or blog. Having a little knowledge of HTML &amp; CSS is ideal to get you started on the quicker route to Bootstrap, however it isn't essential. I will walk you through every step of code to ensure you have the right understanding and tools to further your learning after you have completed the course.</p>\n\n<p>You will not only create a clean, modern professional looking bootstrap landing page, you will also add scroll spy, animation and Google Webfonts to make sure your website stands our from the crowd. We start by understanding the basics of bootstrap, how it works and how it is implemented. We will cover the famous grid system and media queries to ensure your new page looks it's best on all devices.</p>\n\n<p>You will learn-by-doing which will help you understand all aspects of bootstrap and give you the tools to re-design our template or build an entirely new landing page specifically how you want it. You will be able to download project files throughout the course, which will be yours to keep and work on at your leisure</p>\n\n<p>__________________________________________________________________________</p>\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards Mastering Bootstrap To Build You Next Professional Websites Today! </p>\n\n<p><strong>When we learn something new,</strong> I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n<p>In addition to the <strong>Udemy</strong> <strong>30-day money back guarantee</strong>, you have my personal guarantee that you will love what you learn in this course.</p>\n\n<p>__________________________________________________________________________</p>\n\n<p><em class=\"redactor-inline-converted\">What I can't do in this Course..</em></p>\n\n<p><em class=\"redactor-inline-converted\">I can't guarantee your success – this course does take work on your part. But You Can Do It!</em> </p>\n\n<p><em class=\"redactor-inline-converted\">I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n<p><em class=\"redactor-inline-converted\">__________________________________________________________________________</em></p>\n\n<p>This course will not remain this price forever! It's time to take action!</p>\n\n<p><strong>Click the \"take this course\" button at the top right now!</strong></p>\n\n<p>...<em class=\"redactor-inline-converted\">every hour you delay is costing you money</em>...</p>\n\n<p>See you in the course!</p>\n\n<p><strong>Sincerely,</strong></p>\n\n<p><strong>Joe Parys &amp; Shahzaib Kamal<br></strong></p>", 
    "end_date": null, 
    "title": "The Complete Bootstrap Masterclass Course - Build 4 Projects", 
    "price": "50.00", 
    "instructors": "Joe Parys, Shahzaib Kamal", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642410_1cde_3.jpg", 
    "course_url": "https://www.udemy.com/bootstrapcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T13:40:36Z"
}