{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t          ** The most 5* ratings of any paid course on Udemy **  </p>  <p style=\"\">  \t          Looking to boost your income as a web developer? Or maybe you're seeking a career change that gives you more free time and flexibility?  </p>  <p style=\"\">  \t          Whatever your motivation to become a pro web developer, you've come to the right place.  </p>  <p style=\"\">  \t<em style=\"\">The Complete Web Developer Course</em> is THE most comprehensive, cost-effective and career-enhancing course you'll find on the web – or your money back.  </p>  <p style=\"\">  \t          It's a one-stop-shop for everything you need to start creating professional websites that engage visitors, call them to action and ultimately - make you money!  </p>  <p style=\"\">  \t          This fast, effective course takes you easily from zero skills to fee-earning web developer in just six weeks.  </p>  <p style=\"\">  \t          Not only that but you'll get unlimited web hosting for one year. So you can start earning cash before you've even finished.  </p>  <p style=\"\">  \t          What's involved?  </p>  <p style=\"\">  \t          You'll gain immediate access to 11 painstakingly-designed chapters, each developed with ease of learning in mind. Using my background as a Cambridge University mathematics graduate and professional code teacher I've created crystal-clear, original content which you'll find easy to understand - and more importantly - to absorb.  </p>  <p style=\"\">  \t          You'll find learning both quick and fun. And, I've used techniques proven to effortlessly lock that knowledge in, as you gallop through each comprehensive chapter.  </p>  <p style=\"\">  \t          If you're looking for a genuinely effective course that equips you to build stunningly presented, websites that will start earning you cash, I personally guarantee this is the number one course for you.  </p>  <p style=\"\">  \t<u style=\"\">Don't believe me? I offer a full money back guarantee, so long as you request it within 30 days of your purchase of the course.</u>  </p>  <p style=\"\">  \t          Are you ready to transform your world and become a confident, cash-earning web developer?  </p>  <p style=\"\">  \t          Here's what you get with <em style=\"\">The Complete Web Developer Course</em>:  </p>  <p style=\"\">  \t          You'll get access to twelve chapters that will give you a deep understanding of each topic.  </p>  <p style=\"\">  \t          Each chapter is supported with over 28 hours of clear, engaging video tutorials and practical website challenges.  </p>  <p style=\"\">  \t          All at your fingers tips. Instantly.  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t          ·The course starts with the basics. I'll show you the tips and tricks to work effortlessly with web technologies like HTML, CSS and JavaScript.  \t</p>  \t<p style=\"\">  \t\t          ·Once you're doing that in your sleep, I'll show you how to build your own responsive websites using more advanced techniques such as iQuery PHP, MySQL and Twitter Bootstrap.  \t</p>  \t<p style=\"\">  \t\t          ·By then you'll be developing blogs and eCommerce sites with Wordpress, and learn intelligent ways to add dynamic content, using APls to connect to sites such as Google Maps and Facebook.  \t</p>  \t<p style=\"\">  \t\t          ·As Richard Branson says, 'The best way of learning is by doing,' so you'll complete website challenges at every section. As you painlessly tick them off, you'll use your skills to put a site together as you go. The final challenge is a full Twitter clone.  \t</p>  </ul>  <p style=\"\">  \t          Over 11 chapters you will learn:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t          ·Setting up your (free) hosting  \t</p>  \t<p style=\"\">  \t\t          ·HTML  \t</p>  \t<p style=\"\">  \t\t          ·CSS  \t</p>  \t<p style=\"\">  \t\t          ·Javascript  \t</p>  \t<p style=\"\">  \t\t          ·jQuery  \t</p>  \t<p style=\"\">  \t\t          ·CMSs and WordPress  \t</p>  \t<p style=\"\">  \t\t          ·Responsive Design  \t</p>  \t<p style=\"\">  \t\t          ·PHP Coding  \t</p>  \t<p style=\"\">  \t\t          ·MySQL Databases  \t</p>  \t<p style=\"\">  \t\t          ·APIs  \t</p>  \t<p style=\"\">  \t\t          ·Mobile Apps  \t</p>  \t<p style=\"\">  \t\t          ·<em style=\"\"><u style=\"\">Bonus Chapter: How to make $10,000 while learning to code</u></em>  \t</p>  </ul>  <p style=\"\">  \t          What else will you get?  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t          ·A friendly, informal community to support you every step of the way  \t</p>  \t<p style=\"\">  \t\t          ·Personal contact with me, the course tutor  \t</p>  \t<p style=\"\">  \t\t          ·Ebooks that will show you how to start earning before you've even finished  \t</p>  \t<p style=\"\">  \t\t          ·Lifetime access to course materials  \t</p>  \t<p style=\"\">  \t\t          ·Hands-on learning to lock that knowledge in  \t</p>  \t<p style=\"\">  \t\t          ·A deep understanding of how to code, design and build powerful websites  \t</p>  \t<p style=\"\">  \t\t          ·UNLIMITED WEB HOSTING FOR ONE YEAR (worth $199)  \t</p>  </ul>  <p style=\"\">  \t          You'll never have to waste your time and hard-earned cash learning from books, expensive online courses and YouTube videos. With TheComplete Web Developer Course you get everything you need, all under one convenient, easy to navigate platform. Plus, you will get fast, friendly, responsive support by email, Twitter and on the Udemy forums.  </p>  <p style=\"\">  \t          I will never leave you hanging!  </p>  <p style=\"\">  \t          Check out my bio to see how I was able to give up my successful career to teach others to code part time. Since making that decision, I've never looked back.  </p>  <p style=\"\">  \t          It doesn't matter how old you are or what you do professionally. I guarantee that ANYONE can benefit from this course, whether it's earning a bit of extra cash on the side or changing career altogether.  </p>  <p style=\"\">  \t<u style=\"\">So what <em style=\"\">are you waiting for? Transform your world and sign up now to get a free copy of my exclusive 76-page ebook 'How to make $10,000 while learning to code'.</em></u>  </p>", 
    "end_date": null, 
    "title": "The Complete Web Developer Course - Build 14 Websites", 
    "price": "40.00", 
    "instructors": "Rob Percival", 
    "commitment": "28 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/185774_cb62_3.jpg", 
    "course_url": "https://www.udemy.com/complete-web-developer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-21T13:27:33Z"
}