{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em><strong>Funded by 500+ supporters through a massively successful Kickstarter campaign!</strong></em></p><p>Create impressive web applications with real-time capabilities using \nMeteor.js, a full-stack JavaScript framework designed to drastically \nsimplify development time and complexity. <strong>No server-side or database programming experience is required</strong>, but you do need to have basic to intermediate J<strong>avaScript skills.</strong></p><p>If you come from a different background such as PHP and MySQL, this \ncourse will get you up and running with current web trends such as the <strong>connected client</strong> approach, <strong>reactive user interfaces</strong>, <strong>real-time apps</strong> and <strong>No-SQL databases</strong>.</p><p><strong>Pablo Farias Navarro</strong> is a software developer and \nfounder of ZENVA. Pablo has been programming since 1996 and has taught \nprogramming to over 100k students. By following our usual project-based \napproach, by the end of this course you’ll have the skills to create \nsolid web applications.</p><p><strong>What you will learn in this course:</strong></p><ul><li>Create highly interactive, real-time Meteor webapps, through 5 Real-World projects</li><li>Store, retrieve and manipulate data with <strong>MongoDB</strong></li><li>Project-based approach from the start, but also including lessons with some theory</li><li>User signup, authentication and proper data validation</li><li>How to structure the folders and files in your projects</li><li>Give your apps superpowers with external community packages</li><li>Style your apps with Bootstrap 3</li></ul><br><p>One of the main features of Meteor is that is allows the easy \ncreation of real-time apps, where changes in the server database are \npropagated to all connected clients. <strong>Think of how Facebook and Google Docs show real-time alerts and changes made by other users.</strong></p>", 
    "end_date": null, 
    "title": "The Complete Web App Development Course with Meteor.js", 
    "price": "30.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/752928_8b47.jpg", 
    "course_url": "https://www.udemy.com/meteorjs-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-04T23:47:15Z"
}