{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn all of the different aspects of full stack JavaScript development using the MEAN stack. We're not talking about any generators or MEAN frameworks here, we're talking about a full understanding of MongoDB, Express, AngularJS and Node<em>.</em>js. Throughout this course we'll show you how to use each of these technologies, and how to use them together.</p>\n\n<p><strong class=\"redactor-inline-converted\">Note: this course is currently in EARLY ACCESS.</strong> We will be adding 1-2 videos per week </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Build Great JavaScript Applications using MongoDB, Express, AngularJS and Node<em>.</em>js</strong></p>\n\n\n\n<p>The overall aim of the course is to enable to you confidently build all different types of application using the MEAN stack.</p>\n\n\n\n<p>To do this, the course is divided into four sections, each section focusing on a different goal. The four sections all work together building a full application, with an overall outcome of showing how to <strong class=\"redactor-inline-converted\">architect and build complete MEAN applications</strong>.</p>\n\n\n\n<p>The breakdown of sections looks like this:</p>\n\n\n\n<ol><li>By the end of section one you will be able to <strong class=\"redactor-inline-converted\">set up a web-server using Node.js and Express</strong>, to listen for requests and return responds.</li><li>By the end of section 2 you will be able to <strong class=\"redactor-inline-converted\">design NoSQL databases and work with MongoDB</strong> from the command line and from Node and Express.</li><li>After section 3 you will be able to design and build <strong class=\"redactor-inline-converted\">robust REST APIs using Node<em>.</em>js</strong>, Express and MongoDB, following industry best practices.</li><li>By the end of section four you will be able to build high quality <strong class=\"redactor-inline-converted\">AngularJS single page applications (SPAs)</strong>, following industry best practices.</li><li>When you have finished with section five you will able to <strong>add authentication to the MEAN stack</strong>, enabling users to log in and manage sessions.</li></ol>\n\n<p>Along the way there are various activities, so you can be has hands on as you like. You'll get the most out of the course if you follow along and code as you go, but if you want to speed through it the source code is supplied with each video (where relevant).</p>", 
    "end_date": null, 
    "title": "The complete JavaScript developer: MEAN stack zero-to-hero", 
    "price": "50.00", 
    "instructors": "Full Stack Training Ltd", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687466_a08b.jpg", 
    "course_url": "https://www.udemy.com/the-complete-javascript-developer-mean-stack-zero-to-hero/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T22:19:37Z"
}