{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The most amazing course of jQuery designed specially, to learn in very simple manner with solid grip and control over the subject.</p><p>Are you looking to be a part of multi billion dollar industry ?</p><p>Are you looking to increase your income by becoming rock star jQuery developer ?<br></p><p>Are you already a developer, but have confuse knowledge and can not compete with other professional jQuery developers ?</p><p>Whatsoever is your aim,<strong> The Ultimate jQuery Course</strong> is fit for you. You are taking the right course.</p><p>This is thorough, economical and life changing course for you.</p><p>At the end of course, you will be master of</p><ul><li>Setting up jQuery</li><li>Selectors</li><li>Attributes</li><li>Filters and Traversing</li><li>Manipulation</li><li>CSS</li><li>Events</li><li>Effects</li><li>AJAX</li><li>Utilities</li></ul><p>I will provide you friendly and quick life time support &amp; tips on twitter, facebook, google plus and udemy forums. During the course and after completion of course, you will get <strong>100% free support</strong> from me, even after <strong>5</strong> or <strong>10 years</strong> or <strong>whenever</strong>. I will be there for you.  if you get stuck during studies or working on any project after completing the course or whatever the case, I will assist you from my forums quickly, friendly and graciously. Teaching people is my passion. I always welcome you to contact me and discuss your issues. It's time to change your life.<br></p>", 
    "end_date": null, 
    "title": "The Ultimate jQuery Course", 
    "price": "20.00", 
    "instructors": "Abdul Basit", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633606_cb50_2.jpg", 
    "course_url": "https://www.udemy.com/essential-jquery-training/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T14:46:18Z"
}