{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>01/06/2015 - Check out the free preview videos of the web apps we'll build in the course below by expanding section 1</strong></p><p><strong>11/30/2015 - Free Live Support added for the course!</strong></p><p><strong>11/17/2015 - Update - Bonus Software as a Service - Project Management Application added to section 10</strong></p><p><strong>The Complete Ruby on Rails Developer Course</strong> provides a thorough introduction to Web Applications Development using the wildly popular Ruby on Rails framework. With almost<strong> 30 hours</strong> of engaging video lectures and <strong>text follow-up lectures with directions, references and all the code used in the videos</strong>, this course is designed to take students with no programming/web development experience to accomplished Ruby on Rails developers while being just as useful for students who have experience coding in Rails and want to take their skills to the next level or students who are making the the switch to Ruby on Rails from other frameworks.</p><p>Why Ruby on Rails? Since its introduction, Ruby on Rails has rapidly become one of the most powerful and popular tools for building web applications for both startups and existing software houses. Some of the top sites using Ruby on Rails are Basecamp, Twitter, Shopify, Github, LivingSocial, Groupon, Hulu, Airbnb, Yellow Pages and much more. Ruby on Rails developers command some of the highest salaries in the development world and are in high demand.</p><p>This course takes a very structured approach of teaching Rails <strong><em>starting with Ruby</em></strong> - the programming language behind Rails. Everything from \"Hello World\" to Object Oriented Programming is covered. Students acquire skills rapidly utilizing homework assignments, quizzes, coding exercises and free web based resources alongside the video lectures. The text lectures also provide reference material after each video, it's like having multiple books in addition to the videos to guide students through the course.</p><p>At first all the code is done from scratch limiting the use of shortcuts and generators so students can understand what's really going on under the hood of Rails applications and can design them the way they want. Then with solid knowledge and understanding already in place, rapid prototyping methods are introduced in later parts of the course, showing use of generators and scaffolding, finishing with a complete Software as a Service Application that can be used to launch a startup!</p><p>Some key features of this course are:</p><p>- <strong>230+</strong> lectures and <strong><em>29+</em></strong><strong><em> hours of video content</em></strong></p><p>- <strong>Ruby</strong> programming from writing your first program to say \"Hello World\" to Object Oriented Programming while building multiple mini-projects along the way</p><p>- <strong>Rails 4</strong> using cloud-based Integrated Development Environment so no setup necessary</p><p>- <strong>Git</strong> for version control, <strong>Github</strong> as code repository, <strong>Heroku</strong> for production deployment</p><p>- Working with <strong>Amazon Web Services S3</strong> bucket for storage, Sendgrid for production email functionality, <strong>Multi-Tenancy</strong> using Milia</p><p>- Custom credit card form creation and working with <strong>Stripe API</strong> to implement payment processing functionality</p><p>- Rails <strong>MVC</strong> structure in-depth - Models, Views, Controllers</p><p>- <strong>FREE live support</strong></p><p>- Design and conceptualization using wireframing tools</p><p>- Building authentication systems from scratch using default Rails stack, including admin feature, log in/logout and signup at first, then learning how to use <strong>Devise</strong> and then extend the basic functionality provided by Devise to customize it and speed up authentication systems</p><p>- <strong>Ajax, Jquery</strong>, Javascript - all 3 used in different parts of the course!</p><p>- <strong>Bootstrap</strong> for UI styling</p><p>- Learning to build test suites by writing <strong>Unit</strong>, <strong>Functional</strong> and <strong>Integration tests</strong></p><p>- Migrations, one-to-many and complex many-to-many associations at the database layer and implementation with Rails using ActiveRecord</p><p>- much, much more!</p>", 
    "end_date": null, 
    "title": "The Complete Ruby on Rails Developer Course", 
    "price": "35.00", 
    "instructors": "Rob Percival, Mashrur Hossain", 
    "commitment": "31.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519442_63fe.jpg", 
    "course_url": "https://www.udemy.com/the-complete-ruby-on-rails-developer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T19:21:08Z"
}