{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Do you want to learn how to build different types of websites with WordPress?</p>\n\n<p>You have chosen the right course because this course is going to teach you exactly how to build any type of website in mind with WordPress.</p>\n\n<p><strong>Content and Overview</strong></p>\n\n<p>Perfect for students with prior experience working with WordPress, through this intensive course, you will learn how to build different types of websites with WordPress. <br><br>Originally designed to build blogs, WordPress over the years has evolved to become a full scale web development platform with which any kind of website can be built. From business websites to social networking sites, from internet directories to internet forums, WordPress has the necessary features and plugins to build any type of website imaginable.</p>\n\n<p>The aim of this course is to give you all the necessary training and experience needed to build such websites. You will gain experience working with over 40 different plugins, multiple themes, API's and page builders.</p>\n\n<p>The very first website you will build will be a standard WordPress blog. In addition to working with the most common features you would find on a blog website, you will learn additional techniques such as how to grow your mailing list and even add advertisements to your website.<br><br>Next comes section 2 where you will learn how to privatize your blog so that its content is available only to a select group of people. <br><br> In section 3 you will build a full blown social networking site using the BuddyPress plugin. With this plugin, you will learn how to create users, groups, custom fields and activity tabs which are all essential features of any decent social networking site. You will also work with different plugins that will provide security for your site.<br><br>You will then move on to learning how to build a job board website. In this section, you will learn how to use a very powerful job manager plugin to add and manage jobs in your website. You will learn how to create an account in one of the biggest job sites in the world <strong><em>I</em></strong><strong><em>ndeed</em></strong>. You will then gain experience working with API's by learning how to import jobs from Indeed.<br></p>\n\n<p>Last but not least, you will build a website for a fictional non profit organization. </p>\n\n<p>By the time you complete this course, you will have all the necessary knowledge and confidence to build any type of website with WordPress. You will also receive a verifiable certificate of completion as well.</p>", 
    "end_date": null, 
    "title": "The Ultimate WordPress Boot Camp: Build Multiple Websites", 
    "price": "35.00", 
    "instructors": "Alexander Oni", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683606_9600_6.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-wordpress-boot-camp-build-multiple-websites/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T21:42:03Z"
}