{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>⇉ Watch the promo video</strong> to see How You Can Start Becoming A Professional Web Developer Today!<br></p>\n\n<p><strong>⇉ Join Over 100,000+ Students</strong> Who Have Enrolled In My Courses! </p>\n\n\n\n<p><strong>⇉ 2500+ Five Star Reviews</strong> Shows Students Who Enrolling Are Getting Real Results!</p>\n\n\n\n<p><strong>⇉ This course is MASSIVE! </strong>You receive more than <strong>80+ lectures and 8+ hours of content.</strong></p>\n\n\n\n<p><strong>_________________________________________________________________________</strong></p>\n\n\n\n<p><strong>HTML and CSS are the two most important languages for a new web developer to learn. They are also the easiest and most basic. If you are interested in learning how to build webpages, but have limited experience with coding, this course will help you learn HTML and CSS quickly and easily! We Promise to take you from Novice to Professional!<br></strong></p>\n\n\n\n<p>In this course you will learn fist hand by building your very own website! We take a step by step approach to ensure each student receives a valuable learning experience.  </p>\n\n\n\n<p>You will Begin by understanding what HTML and CSS are, so you will be able to comprehend what they can do for you, and how to use them in web design. </p>\n\n\n\n<p>You will then learn the rest below throughout this entire course: </p>\n\n\n\n<ul><li>All of the HTML Basics</li><li>Working With HTML </li><li>HTML Lists</li><li>HTML Tables</li><li>URL's, Links and iframing</li><li>HTML and Images</li><li>All of the CSS Basics</li><li>CSS Selectors </li><li>CSS Dimensions</li><li>CSS Box Model </li><li>CSS Lists, Text &amp; Fonts and Tables</li><li>HTML Forms</li><li>Complting A Complete Website Project </li><li>And So Much More!!  </li></ul>\n\n\n\n<p>You will receive a basic, yet thorough understanding of both HTML and CSS. The course focuses on having you begin to learn to write code and understand the fundamentals of coding so you can learn through doing.  By the end of this course you will be able to completely use HTML and CSS and become a professional! </p>\n\n\n\n<p>This course is designed for everyone and anyone, especially aspiring web designers, bloggers, programmers to business owners can benefit from learning some HTML and CSS. This course is also for anyone who plans on becoming a web programmer or a web designer themselves. HTML and CSS are the essential first two languages you must master. HTML is required for anyone that wants to get into web development, there is no way around it. Being able to learn it simultaneously with CSS allows you to become a professional web designer in no time! </p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards becoming a professional web designer and developer. </p>\n\n\n\n<p>When I learn something new about HTML and CSS, I add it to the course -at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the Udemy 30-day money back guarantee, you have my personal guarantee that you will love what you learn in this course.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em> </p>\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p>This course will not remain this price forever! It's time to take action!</p>\n\n\n\n<p><strong>Click the \"take this course\" button at the top right now!</strong></p>\n\n\n\n<p>...<em>every hour you delay is costing you money</em>...</p>\n\n\n\n<p>See you in the course!</p>\n\n\n\n<p>Sincerely,</p>\n\n\n\n<p>Joe Parys and Shahzaib Kamal</p>", 
    "end_date": null, 
    "title": "The Complete HTML & CSS Course - From Novice To Professional", 
    "price": "50.00", 
    "instructors": "Joe Parys, Shahzaib Kamal", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556248_4517_3.jpg", 
    "course_url": "https://www.udemy.com/htmlwebsite/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T12:55:47Z"
}