{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>\"<em>This course is very well done, and provides results. Within 2 days of finishing the videos, I was able to take a customers website from the 65th percentile in speed to the top 10th</em>\" (Franco Valentino).</p><p>\"<em>The Best course that I've ever seen</em>\" (Thanaponth).</p><p>\"<em>2 Thumbs, Up A++, Home Run. </em><em>I am glad that not a lot of other Udemy Instructors I've encountered have a similar teaching style because I'd never get any actual work done. I'd be on Udemy all the time learning and not doing! </em><em>Great stuff!</em>\" (Steve Dougherty). </p><p>\"<em>Waaaay good stuff! The depth of information here is impressive. AJ has succeeded in making some very arcane, technical material accessible to anyone who is motivated enough to work through it</em>\" (Randall Zamorski).</p><p>\"<em>This step-by-step course has done wonders for my websites. I now know more about speeding up Wordpress than I ever thought possible</em>\" (Jeffery Wood).</p><p>\"<em>AJ's course is a must for anyone looking to improve their or clients website speed. A course that is worth doing from start to finish</em>\" (Ian Campbell).</p><p>\"<em>AJ is an entertaining lecturer and he definitely knows his stuff</em>\" (Josh Tseng).</p><p>\"<em>I was totally blown away by the simplicity, logical presentation of facts and real time results as I followed these lessons</em>\" (Frank).</p><p><strong><br></strong></p><p><strong>Your WordPress website made not just faster &amp; not merely fast, but one of the fastest websites on the Internet. The Official WpFASTER WordPress Speed Optimization Master Course is, by popular demand, finally here. Enjoy the rewards now!</strong><br></p><p><strong><em>...2 seconds...</em></strong></p><p>You may have heard it said that this is the amount of time you have to get your content in front of the eyes of your website's visitors before they start to bounce, <strong>or before you begin to lose money</strong>.</p><p>While this 2 second figure is indeed true, it doesn't actually tell the whole story. Website speed is <em>not</em> a game of seconds. It is a game of <strong>milliseconds</strong>. A game in which a website that is interactive in a literal blink-of-an-eye quicker than yours will enjoy better user engagement, longer on-site times, superior search engine positioning; and, <strong>more income</strong><em>. These are the facts.</em></p>Now, more than ever, your website's speed is absolutely critical to your site's User Experience; and, your WordPress site's ultimate success or failure:<p><br></p><ul><li>Google found that a <strong>500ms</strong> slowdown equals <strong>20% decrease</strong> <strong>in </strong>ad <strong>revenue</strong>.</li><li>Amazon finds a <strong>100ms</strong> slowdown – <em>one tenth of one second</em> – can mean a 1% <strong>decrease </strong><strong>in revenue</strong>.</li><li>Yahoo! found that a <strong>400ms improvement</strong> in load time translated to a <strong>9% increase</strong> in <strong>traffic</strong>.</li><li><strong>27%</strong> of users say that visiting a slow site makes them likely to visit a competitor.</li><li>Google is so committed to speed and User Experience that they are, right within their search results, experimenting with affixing a \"<strong>SLOW</strong>\" label to slower websites...</li></ul><p><br></p><p>In this, the official WpFASTER WordPress Speed Optimization Master Course, <strong><em>the only course of its kind on the planet</em></strong>, you will not learn how to make your WordPress websites merely faster, <em>but how to make them</em> <em>some of the fastest, most performant websites <strong>in the entire world</strong></em>. You will further be able to <strong>prove </strong>that they are.</p><p>This course -- WpFASTER's blueprint -- includes everything you need to know, from theory to application: Basic, to intermediate, to advanced WordPress performance techniques and configurations; to troubleshooting and mitigating optimization issues; and, ultimately, the goods to produce the most incredibly fast WordPress sites on the Web.</p><p>And lest I forget, you are going to learn all of this and <em>more</em> without having to know or learn any code <strong>whatsoever.</strong></p><p>My name is AJ McKay. I am the Managing Partner for WpFASTER, the instructor for the course and here to help you every step of the way.</p><p>If you have a WordPress-powered website or blog and can see that this course will, in a very real way, <strong>pay you</strong> for taking &amp; applying it, the Official WpFASTER WordPress Speed Optimization Master Course is for you!</p><p><strong>SPEED. GET SOME.</strong></p>", 
    "end_date": null, 
    "title": "The WpFASTER WordPress Speed Optimization Master Course", 
    "price": "50.00", 
    "instructors": "AJ McKay", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443746_5a22_5.jpg", 
    "course_url": "https://www.udemy.com/make-your-wordpress-sites-fastest-in-world/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T13:35:54Z"
}