{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Welcome To The Complete JavaScript Course For Web Development Beginners! </strong></p>\n\n<p><strong></strong><strong>⇉ Watch the promo video</strong> to see How You Can Begin Using <strong>JavaScript Today!</strong></p>\n\n<p><strong>⇉ J<em></em>oin Over 100,000+ Students</strong> Who Have Enrolled In My Udemy Courses This Year!<br></p>\n\n<p><strong>⇉ 2000+ Five Star Reviews </strong>Shows Students Who Enrolling Are Getting Real Results!<br></p>\n\n<p><strong>⇉ You receive</strong> over <strong>4</strong><strong>+ hours</strong> of video content &amp; <strong>40</strong><strong>+ lectures &amp; So Much More!</strong></p>\n\n<p><em>__________________________________________________________________________</em><strong>In This Course You Will Learn </strong><strong>About JavaScript!</strong> </p>\n\n<p>JavaScript is a high level, dynamic, untyped and interpreted programming language. </p>\n\n<p>In this course we will learn how to embed JavaScript code into HTML code and how JavaScript can be used in order to create interactive websites. We will also learn what are comments and statements in JavaScript and what is their significance in writing JavaScript. In the duration of the course we will also go through the basic data types, which are used in JavaScript in order to store and manipulate the data.<br><br>We then study what are variables and will learn the syntax to create variables in JavaScript. Moving along we start with functions, what functions are, where they are used and how to create and call them. Next to that are operators, we study different types of operators in JavaScript, such as the mathematical operators and the assignment operators. After that we will study about the control flow and we study the conditional statements which are used to make decisions. Next in the course is nesting, we go through how a function can be nested in other.<br><br>Moving along we learn how to repeat a set of JavaScript statements by using loops and the basic syntax for creating loops. In the next part we study about objects and the concept of object oriented programming in JavaScript. We will also learn what are properties and what are methods. After this we discuss arrays in depth, we learn how arrays can be created and manipulated in JavaScript, also we learn some methods related to arrays.</p>\n\n<p>Finally we learn how to access form and form elements in JavaScript,we also learn how JavaScript can be used to validate HTML forms</p>\n\n<p><strong>Here is What You Will Learn In Each Section of our Course:</strong></p>\n\n<ul><li><strong>Introduction to JavaScript </strong></li><li><strong>Functions in JavaScript </strong></li><li><strong>Operators in JavaScript </strong></li><li><strong>Control Flow in JavaScript</strong></li><li><strong>Looping in JavaScript</strong></li><li><strong>Event Handling &amp; Objects </strong></li><li><strong>Arrays in JavaScript </strong></li><li><strong>Objects &amp; Forms</strong></li><li><strong>Summary &amp; Conclusion </strong></li><li><strong>And So Much More! </strong></li></ul>\n\n<p>__________________________________________________________________________<br></p>\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards Using and Mastering JavaScript!</p>\n\n<p>When I learn something new, I add it to the course - <strong>at no additional cost to you!</strong> This is a course that will continue to <strong>add more and more to every aspect of your life.</strong></p>\n\n<p>In addition to the <strong>Udemy 30-day money back guarantee,</strong> you have my <strong>personal guarantee </strong>that you will love what you learn in this course.</p>\n\n<p>__________________________________________________________________________</p>\n\n<p><em>What I can't do in this Course..</em></p>\n\n<p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em> </p>\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n<p><em>__________________________________________________________________________</em></p>\n\n<p><strong>This course will not remain this price forever! It's time to take action!</strong></p>\n\n<p>Click the <strong>\"take this course\"</strong> button at the top right now!</p>\n\n<p><strong>...<em>every hour you delay is costing you money</em>...</strong></p>\n\n<p>See you in the course!</p>\n\n<p><strong>Sincerely,</strong></p>\n\n<p><strong>Joe Parys &amp; <strong>Ashutosh Pawar</strong></strong></p>", 
    "end_date": null, 
    "title": "The Complete JavaScript Course For Web Development Beginners", 
    "price": "45.00", 
    "instructors": "Joe Parys, Ashutosh Pawar", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695656_4395_3.jpg", 
    "course_url": "https://www.udemy.com/javascriptcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T14:39:04Z"
}