{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>⇉ Watch the promo video</strong> to see How You Can Start Becoming A Professional Web Developer Today!<br></p>\n\n<p><strong>⇉ Join Over 100,000+ Students</strong> Who Have Enrolled In My Udemy Courses This Year!</p>\n\n\n\n<p><strong>⇉ 2500+ Five Star Reviews</strong> Shows Students Who Enrolling Are Getting Real Results!</p>\n\n\n\n<p><strong>⇉ This course is MASSIVE! </strong>You receive more than <strong>54</strong><strong>+ lectures and 5+ hours</strong> of content.</p>\n\n\n\n<p>In this course you will learn fist hand by building your very own website! We take a step by step approach to ensure each student receives a valuable learning experience.</p>\n\n\n\n<p>In this course you will learn how to use HTML5 and CSS3 to create responsive websites your clients will love. Our course teaches you how to code showing you multiple examples that you can easily create afterwords on your own. This course will teach you everything you will need to know about HTML5 and CSS3 and what it will take to start your own website development and responsive design.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>Here is What You Will Learn Throughout Our Entire Course:</strong></p>\n\n\n\n<ul><li><strong></strong>Introductions and Basics of HTML5</li><li>New Updates about Multimedia</li><li>HTML5 New Forms Elements</li><li>The Canvas Tag</li><li>The Power of CSS3</li><li>The Complete and Professional Webpage Using HTML5 &amp; CSS3 Techniques</li><li>So Much More!! </li></ul>\n\n\n\n<p>This course is designed for everyone and anyone, especially aspiring web designers, bloggers, programmers to business owners can benefit from learning some HTML5 and CSS3. This course is also for anyone who plans on becoming a web programmer or a web designer themselves. HTML5 and CSS3 are the essential languages you must master, especially in todays day of coding.</p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards becoming a professional web designer and developer.</p>\n\n\n\n<p>When I learn something new about HTML5 and CSS3, I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the Udemy 30-day money back guarantee, you have my personal guarantee that you will love what you learn in this course.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em> </p>\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p>This course will not remain this price forever! It's time to take action!</p>\n\n\n\n<p><strong>Click the \"take this course\" button at the top right now!</strong></p>\n\n\n\n<p>...<em>every hour you delay is costing you money</em>...</p>\n\n\n\n<p>See you in the course!</p>\n\n\n\n<p>Sincerely,</p>\n\n\n\n<p>Joe Parys and Shahzaib Kamal</p>", 
    "end_date": null, 
    "title": "The Complete HTML5 & CSS3 Course Build Professional Websites", 
    "price": "50.00", 
    "instructors": "Joe Parys, Shahzaib Kamal", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559512_0c62_2.jpg", 
    "course_url": "https://www.udemy.com/html5css3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T15:39:23Z"
}