{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\">From Docker novice to DevOps expert in 7 hours</em><br></p>\n\n<p>Looking to level up your skills by deploying your own web application? How about furthering your career by picking up years worth of general DevOps skills?<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Prepare to get excited about Docker (and this course)!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Dozens of massive companies are using Docker every day but the awesome thing about Docker is it works incredibly well even for the smallest projects.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Nowadays learning about Docker and general DevOps skills is gaining massive momentum in the tech scene. It's similar to how mobile app development was a few years ago.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Companies are EXPECTING new developers to manage the full life cycle of their web applications. This means BOTH developing and deploying your apps.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Here's your chance to STAY AHEAD OF THE CURVE.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The Docker for DevOps course isn't just your run of the mill introduction to Docker course, you can get that info by skimming Docker's website.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course shows you WHAT you can build with Docker and HOW to do it -- of course you'll learn the Docker basics along the way!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Together we'll walk through developing and deploying a multi-service Flask and Ruby on Rails application (more framework examples will be provided as bonus lectures too).</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Oh and don't worry, you won't need Flask or Ruby on Rails experience to understand this course. The emphasis is on deploying a web application, not building one.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Learning by example is a great way to retain information and learn quickly. <br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"The course has a perfect balance between theory and practical material. At the end of the course, you have a working and secured web app with fully automated deployment along with an understanding of how it works. This is exactly what I wanted from the course.\" </em></p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"></em></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Ready to level up?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Here's what you'll get when you sign up to my course today:</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>You'll learn how to get your development environment set up to run Docker. Windows, Mac and Linux users will be able to follow along.</li><li>Next, you'll learn the Docker basics and we'll complete a hello world example.</li><li>You'll Dockerize a Flask or Ruby on Rails application and pickup a few \nbest practices on how to create a production ready application with \nthose frameworks.</li><li>You'll learn how to create a staging server so you can test your app.</li><li>You'll learn how to keep your app running forever by getting a crash course with systemd.</li><li>You'll learn how to configure and serve your app over SSL (HTTPS) with nginx.</li><li>You'll get $10 in free hosting credits on DigitalOcean to deploy your application.</li><li>You'll learn how to purchase and configure a domain name (and make it work with your new server).</li><li>Finally, you'll learn how to obtain a FREE SSL certificate and hook it up.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><br>I'll also give you tips on where to go next for topics such as:<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Adding more services to your app</li><li>Scaling out beyond 1 host</li><li>Monitoring and alerting</li><li>Hooking up a continuous integration pipeline</li><li>Dealing with centralized logging</li><li>Looking into using various configuration management tools</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><br><em class=\"redactor-inline-converted\">You're getting all of that AND additional bonus lectures for just $25.</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is jam packed with <strong class=\"redactor-inline-converted\">over 100 lectures</strong><strong class=\"redactor-inline-converted\">,</strong><strong class=\"redactor-inline-converted\"> 7+ hours of videos </strong>and<strong class=\"redactor-inline-converted\"> quizzes</strong>. You'll also receive <strong class=\"redactor-inline-converted\">full PDF text directions for each video lecture</strong> and <strong class=\"redactor-inline-converted\">complete source code examples</strong>.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"This course was really well put together and covers a wide range of topics around both DevOps and Docker. I chose it primarily for the Docker side, but learned a lot about Ruby and Python too. I am very pleased with this course.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why is it worth using Docker?</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Saves a ton of time and headaches when setting up development environments.</li><li>Easily move an application across environments or servers.</li><li>Removes issues such as \"well, it worked on my machine!\".</li><li>Makes developing with teams a much more pleasant experience.</li><li>Works on most major platforms.</li><li>Has amazing support on most cloud hosting providers.</li><li>You won't need expensive hosting to deploy your web applications.</li><li>Docker as a company is well funded and moving forward quickly.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br><em class=\"redactor-inline-converted\"></em></p>\n\n<p><em class=\"redactor-inline-converted\">\"Well structured course with high quality information. Source code is really well written and well structured. The tutor support is like 24/7. He replied to my all questions within few hours and most of the times in few minutes.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why is this course for you?</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>After finishing this course you'll have enough knowledge about Docker and general DevOps skills to start applying for jobs, so by investing in this course you're jump starting your DevOps career.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Or perhaps you have a thirst to broaden your skill set and want to save a ton of time by avoiding the tedious task of researching all of these topics on your own.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>In either case, you're going to walk away with years of knowledge and best practices that I've accumulated while working as a consultant.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"Meticulous hands-on descriptions and recipes of how to utilize Docker and a lot of associated software in the real world scenario of building a web-app! I especially enjoyed the clear delivery of content: well structured, superbly produced, written summaries for each shown topic.\"</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Who am I?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Hi, I'm Nick. I'm a consultant by day and open source contributor by night. I write software and help companies being their ideas to life.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I love learning new things and then sharing my knowledge with others.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I don't have a fancy degree but I do have experience shipping code and explaining my thought process to others while I talk about various technical topics.<br></p>", 
    "end_date": null, 
    "title": "The Docker for DevOps course: From development to production", 
    "price": "25.00", 
    "instructors": "Nick Janetakis", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641868_cddd_5.jpg", 
    "course_url": "https://www.udemy.com/the-docker-for-devops-course-from-development-to-production/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T22:29:40Z"
}