{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>- Welcome to this Course &quot;Treasureboat the new WebObjects Framework Part: 1&quot;. My Name is Rene Fuerst, and i&#039;m a programmer for over 16 years now and I´m also an Instructor at Udemy. This is my first course and i will guide you through this course. </p><p>- In this course you will learn how to install and prepare your Development tools for coding with WebObjects and the Treasureboat Framework.- You will see how to create a Hello World Application, and how easy it is to use Treasureboat. </p><p>- Treasureboat is a further development from WebObjects, because new WebObjects releases are now only Apple internal. Apple is still using WebObjects because it is an amazing language and so much easier and faster to develop than, for example, Java EE. You dont need to know how to build difficult SQL queries. WebObjects and Treasureboat will do this for you. You can switch immediately from MySQL to Oracle or to IBM DB2 or to Microsoft SQLServer, it doesn&#039;t matters.</p><p>- This course is for programmers who understand objective oriented programming, if you&#039;r familiar to Java, C#, WebObjects or any other Object Oriented Languages, you have the right requirements for this course.</p><p>- If you don&#039;t understand objective oriented programming, please take a simple Java course where you can learn the basics.</p><p>- You don&#039;t know what WebObjects or Treasureboat is? You can take a look to our next video or watch the introduction to WebObjects 1.0 by Steve Jobs from 1996 on Youtube. We now have a much more advanced version of WebObjects and this is the 5th version, but i think the introduction would be nice to look at, so you should look for WebObjects by Steve Jobs on Youtube.</p><p>- WebObjects is still currently in use on some Enterprise Applications, like the iTunes Music Store, Apple Store and some big iOS and Android Games running WebObjects in the back-end with over 10.000 instances.</p><p>***As bonus you have access to our other Treasureboat tutorials over the Dashboard, where you can learn more about Treasureboat development***</p>", 
    "end_date": null, 
    "title": "Treasureboat the new WebObjects Framework Part: 1", 
    "price": "50.00", 
    "instructors": "René Fürst", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470830_9fe5.jpg", 
    "course_url": "https://www.udemy.com/treasureboat/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T13:28:27Z"
}