{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Learn how to add Twitter content to your web projects in this easy to follow quick Tutorial designed to get you working with the Twitter Data Feed quickly.</strong></p><p><strong>Keep Visitors on your site instead of having them leave to visit your content on Twitter.   More engagement, fresh content and allow them to become part of the converstation easier.</strong></p><p>This course is for anyone who wants to add Twitter to their Website, multiple options that are available either Widgets, JavaScript or REST.</p><p>Integrating Twitter allows you to bring the Worldwide twitter conversation to your site.   Get more engagement and have a constant feed of new content right on your website.   Save visitors from having to leave you site to check out your content on Twitter.</p><p><strong>Step by Step guide</strong></p><p>This course is designed to be easy to follow along, its encouraged to practice the code being presented through out the course. Resources, source code, and everything you need to pull Twitter Data is included. <br></p><p>Learn about Twitter Development and its core concepts and much more.....<br></p><p>We walk you through step by step with detailed explanations of code and more.</p><p>We teach you the latest techniques and tools to use in order to create amazing web content. Everything you need to know is included in this course. Learn at your own pace, lifetime access to this course.</p>", 
    "end_date": null, 
    "title": "Twitter Integration customize Tweets with developer API", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709180_9720.jpg", 
    "course_url": "https://www.udemy.com/twitter-integration-customize-tweets-with-developer-api/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T00:56:55Z"
}