{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>COURSE UPDATED – 36 New Lectures!</strong></p>\n\n<p><em>Added two brand new sections covering AngularJS, and WordPress Plugin Development.</em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Are you looking for an all-in-one Web Design, Web Development and Career Building course </strong>that takes you step-by-step through the all of the skills you need know to start a working professionally?</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Are you a programmer looking to improve your design skills</strong>, so your designer colleagues can stop making fun of your bad designs? Or <strong class=\"redactor-inline-converted\">maybe you're</strong><strong class=\"redactor-inline-converted\"> a designer looking to learn how to code</strong>, so your programmer colleagues can stop laughing at your sad coding attempts?</p>\n\n\n\n<p>Have you wasted hours of your time or money watching terrible video tutorials that make you fall asleep at your desk?</p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">Stop wasting your time &amp; money!</strong> This is the ultimate, most comprehensive, A to Z web design, development and career building course on the market. I promise and I guarantee that to be true.</em></p>\n\n\n\n<p><em><em><strong class=\"redactor-inline-converted\">Here is my guarantee to you:</strong> If within 30 days you complete this course and you haven't experienced impressive results, you can't design or build modern websites, or you can't get a paying web design or development gig — I will give you 100% of your money back.</em></em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">You will go from knowing nothing</strong><strong class=\"redactor-inline-converted\"> to creating over 23 impressive designs, websites, and applications</strong> — all with step-by-step instruction from the most entertaining and engaging coding instructor on the web today!</p>\n\n\n\n<p>We'll start by learning Visual &amp; Web Design, how to use Adobe Photoshop, and how to sketch professional wireframes. We'll then learn to code with HTML5, CSS3, Javascript and jQuery. At this point you'll be able to code custom websites, animations and web applications by yourself.</p>\n\n\n\n<p>Once we're cool with the front-end languages, we'll then melt our brain-bits with highly advanced skills like Responsive Websites, PHP, MySQL, WordPress and custom WordPress plugin development. You'll then have the ability to build responsive, dynamic websites and blogs, basic eCommerce sites and online stores, and have a professional understanding of all aspects of web design &amp; development.</p>\n\n\n\n<p>After you've learned everything from Design to Development, you'll be taken through a hands-on career section fully-loaded with valuable tips, resources, and real-world guidance to help you start your career — whether you want to work-from-home as a freelancer, or secure a full-time studio gig at a design agency.</p>\n\n\n\n<p>- - -</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What are some of the projects you will build?</strong></p>\n\n\n\n<p>In addition to working on your very own self-directed project that challenges you to use your new skills as you learn, you'll be building over 23 custom projects throughout the course:</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In Photoshop:</strong></p>\n\n\n\n<ul><li>Design a custom web graphic</li><li>Design a custom business card</li><li>Design a modern landing page</li><li>Re-design a blog</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In HTML5 &amp; CSS3:</strong><br></p>\n\n<ul><li>Multiple custom websites &amp; web pages</li><li>Code the Google landing page</li><li>\"Orbiting planets\" animation in CSS3</li><li>A responsive \"Startup Style\" website</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In Javascript &amp; jQuery</strong><br></p>\n\n<ul><li>A working \"Tip Calculator\"</li><li>An actual race car game</li><li>A \"To Do List\" web application</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In PHP &amp; MySQL</strong><br></p>\n\n<ul><li>Dynamic websites</li><li>Impressive application that fixes clickbait headlines</li><li>Working \"login\" and \"logout\" sequence</li><li>Profile page that pulls information from a database</li><li>Robust \"Client Address Book\" application that manages your clients' information</li><li>Custom WordPress plugin</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In AngularJS</strong></p>\n\n\n\n<ul><li>Real Estate Listing Single-Page Application</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In WordPress Plugins</strong></p>\n\n\n\n<ul><li>Custom, real world \"survey\" plugin</li></ul>\n\n\n\n<p><em>...and much more<br></em></p>\n\n<p><em><em>- - -</em></em></p>\n\n<p><br></p><p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Why trust me? What makes me any better than the thousands of coding instructors out there?</strong></p>\n\n\n\n<p>My name is Brad Hussey, and I've been working professionally as a designer and developer for over 6 years. I studied design &amp; development in college for 2 years before getting hired as an in-house web developer at a local web development firm. Only a year into full-time employment, I quit to start my own freelance business from home, which has been the best career move I've ever made because it allows me the freedom to work on my own terms on projects I love to be a part of, and it pays extremely well.</p>\n\n\n\n<p>What makes me different than all the other coding instructors out there is that I know how to communicate complex &amp; boring concepts without putting you to sleep! While you're staring at a screen with hundreds of lines of code, I like to keep things light, crack jokes and keep you entertained. My approach is simple, hands-on, and relaxed. Think of me as your handsome friend who just so happens to be a passionate computer geek under the surface.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Don't take it from me, read what some of my students have said about my courses:</strong></p>\n\n\n\n<p><em>\"Instantly, I felt comfortable with Brad's style and approach. After only a week of finishing this course, I have 3 projects for freelance website design. I couldn't thank Brad enough!\" <strong class=\"redactor-inline-converted\">— a graduate of Bootstrap to WordPress</strong></em></p>\n\n\n\n<p><em>\"I challenged myself to an entire weekend to complete the [client] project, utilizing this course as a step-by-step guide. I am happy to say that my challenge was successful! I've already received payment for my work and my client was so impressed that he immediately gave me another project to work on!\" <strong class=\"redactor-inline-converted\">— a graduate of Bootstrap to WordPress</strong></em></p>\n\n\n\n<p><em>- - -</em></p>\n\n\n\n<p>How would you like to be able start a lucrative career in web design &amp; development, work for a high-tech company, or kick back in the comfort of your own home studio providing high quality solutions to your very own clients?</p>\n\n\n\n<p>There's a ton of design &amp; coding courses out there begging for your money &amp; attention, but none of them will give you the ultimate fusion of web design, development and career building that I guarantee this course will deliver.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">So stop wasting your time and money on courses &amp; tutorials that don't deliver</strong> - and let's launch your career to new heights!</p>\n\n\n\n<p>Join me on this journey, and I promise I won't let you down. Set yourself up for success, and sign up for the course right now. See you on the inside :)</p>", 
    "end_date": null, 
    "title": "Ultimate Web Designer & Developer Course: Build 23 Projects!", 
    "price": "40.00", 
    "instructors": "Brad Hussey, Code College", 
    "commitment": "32.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446134_383c.jpg", 
    "course_url": "https://www.udemy.com/web-developer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-12T22:10:05Z"
}