{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>Welcome to Ultimate HTML + CSS course for Absolute Beginners!</strong></p><p><strong>Taking this course you'll definitely acquire the knowledge of HTML/CSS and in the nearest future you'll </strong><strong>be able to gradually increase your skills and, as a result, to become a brilliant front end developer.</strong></p><p>During this course you will learn such basic notions of HTML as: </p><ul><li>HTML documents,</li><li>types of HTML documents</li><li>creating of HTML documents.</li></ul><p>We will also familiarize you with various HTML tags and special characters. <br></p><p>You`ll be able to create lists, tables and sign up forms for your web site. </p><p>What is more, you`ll know how to embed audio and video content in HTML document.</p><p>On grasping the HTML material you`ll be ready for learning CSS. Here you are provided with all the necessary information on this part of the course: applying CSS to HTML, formatting text with the means of CSS, a great variety of stylistic properties and much more. At the end of the course you`ll have a perfect opportunity to refine your understanding by putting your knowledge into practice. </p><p>Following our instructions, you`ll create a simple registration form combining your acquired skills in HTML and CSS. </p><p>This course is a wonderful chance for those, who would like to discover the basic notions of web development.</p><p><strong>We suggest you to use it as a starting point in your becoming a skillful specialist. </strong></p><p><strong>Don`t miss it – just grasp it!</strong></p>", 
    "end_date": null, 
    "title": "Ultimate HTML and CSS course for Absolute Beginners 2015", 
    "price": "20.00", 
    "instructors": "PHP - Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608342_4aea_2.jpg", 
    "course_url": "https://www.udemy.com/html-css-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T19:23:47Z"
}