{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t The course teaches PHP Data Objects (PDO), the preferred way to connect to databases within PHP. It covers connecting to the database, and using all the features required to build fast, scalable applications that use a database connection. It covers essential concepts like security, and best practices with using the data retrieved from the database.</p><p>While a basic knowledge of PHP is recommended for this course, both beginners and experienced web developers will gain a complete understanding of how PHP Data Objects work.  </p><p>A basic knowledge of PHP is recommended for this course. You will need to be able to open and write to a basic PHP file and be able to have a server and database installed. This course will use MySQL server. </p>  <p>  \t<strong style=\"\">Exactly What Is PDO?</strong>  </p>  <p>  \tThe PHP Data Objects (PDO) extension defines a lightweight, consistent interface for accessing databases in PHP. Each database driver that implements the PDO interface can expose database-specific features as regular extension functions. Note that you cannot perform any database functions using the PDO extension by itself; you must use a database-specific PDO driver to access a database server.  </p>  <p>  \tPDO provides a <em style=\"\">data-access</em> abstraction layer, which means that, regardless of which database you&#039;re using, you use the same functions to issue queries and fetch data. PDO does <em style=\"\">not</em> provide a <em style=\"\">database</em> abstraction; it doesn&#039;t rewrite SQL or emulate missing features. You should use a full-blown abstraction layer if you need that facility.  </p>", 
    "end_date": null, 
    "title": "Understanding PHP Data Objects (PDO)", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/249580_bc32_4.jpg", 
    "course_url": "https://www.udemy.com/understanding-php-data-objects-pdo/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-24T18:02:02Z"
}