{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>User experience (UX) design is a theoretical understanding of how \nusers interact with websites. The major challenge developers building a \ncompany website face is finding the right balance that fulfils the \nobjectives of the company as well as the needs of their users. A poor \nuser experience leads to losing out on customers and in turn the company\n losing out on money.</p><p>User experience design underpins all major decisions taken by web \ndesigners when laying out web pages. It is governed by fundamental \nprinciples and practical approaches including wireframing, \nbootstrapping, and even pen and paper designs that gives an indication \nabout the user experience that a successful site needs to offer to its \nusers.</p><p>UX Design for Web Developers is a breakthrough guide that reveals the\n fundamental rules that govern how most people read and work with \nwebsites, through the process of redesigning a mobile friendly website.</p><p>We’ll start off our journey by understanding why we need UX, how UX \ncame to be, and where it fits in the business and web development. We’ll\n explore the fundamental skills for structuring and defining a website \nalong with content strategy. We’ll take a look at a variety of media \ntouch points that have potential to engage and influence your audience’s\n experience.</p><p>With an overall review of some of the best practices of UX design \nwe’ll start building our application with screens that allow us to think\n about the interactions. We’ll touch down on the important concept of \nsetting up wireframes and fix the loophole of static application by \nbuilding a simple clickable, prototype using the Invision tool. We’ll \ncomplete our journey with a finished website plan ready for testing and \nfeedback.</p><p>By the end of this course, you will gain the ability to think like a UX designer, through engaging human centered design practices, UX methodologies, useful UX tricks, as well as skills required for interactive web designing.</p><p><strong>About The Author</strong></p><p><strong></strong></p><p><strong>Chris R Becker</strong> is an imaginative and creative interaction \ndesigner / UX designer / Design researcher and educator. A conceptual \nthinker, he has the ability to design across media platforms for \nsolutions within experience design, interaction, information \narchitecture, business and brand strategy, web and app design, \nadvertising, systems design, and print. He is organized and passionate \nfor following design problems from concept to finished product. He is \nalso well versed in prototyping, design research, human-centered design \nmethodologies, and user testing for taking ideas from the drawing board \nto the real world. He is competent in pre-press and production and is \nnot afraid to get his hands dirty, with a strong communication \nbackground through positions in versed industries.</p><p>Chris teaches at the Loyola Marymount University, UCLA – Extension \n&amp; Art Center College of Design. His clients include Vitasigns, \nApple, Beats by Dre, Nissan, VW, STEAM Carnival, Theranos, \nCB2, Men's Wearhouse, Hyundai, Toyota, and more.</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "UX Design for Web Developers", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725418_5d1e.jpg", 
    "course_url": "https://www.udemy.com/ux-design-for-web-developers/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T11:16:59Z"
}