{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Com o aumento do comércio eletrônico (e-commerce) no Brasil e em todo mundo, todas as empresas (pequenas, médias e grandes) têm de ocupar um espaço na Internet, mostrando e oferecendo os seus produtos virtualmente para explorar o crescente mercado de clientes pela internet.</p><p>E para facilitar a sua vida, aqui estou aprensentando o curso de VirtueMart, que é uma solução de E-commerce (loja virtual) Open Source para ser utilizada em conjunto com um Sistema de Gestão de Conteúdo (CMS) chamado Joomla. Joomla e VirtueMart foram escritos na linguagem PHP e podem ser utilizados em qualquer ambiente PHP/MySQL.</p><p>Neste curso, explicarei a instalação do joomla (sem entrara a fundo nele, já que fiz um curso específico de joomla), VirtueMart (componente, plugins, módulos e idiomas) e daremos os primeiros passos para trabalhar com este poderoso software. </p><p><strong>Veja abaixo um pouco do que você vai aprender:</strong></p><ul><li>O que é o VirtueMart</li><li>Funcionalidades do VirtueMart</li><li>Instalação do Componente do VirtueMart</li><li>Instalação de Módulos e Plugins</li><li>Pacote de Idiomas</li><li>Primeiros passos com o VirtueMart</li></ul><p><strong>Veja algumas das funcionalidades do VirtueMart</strong></p><ul><li>Inserir produtos</li><li>Gerenciar estoque</li><li>Pode-se adicionar várias imagens a cada produto, programar variações de um produto (cor, tamanho, modelo etc.), o que facilita muito quando você tem que vender algo que apresenta várias opções. Obviamente que o VM calcula preços diferentes para cada característica que o cliente escolher.</li><li>Venda de produtos que podem ser baixados pelo usuário (download).</li><li>Os usuários registrados, clientes, podem alterar os seus dados de cadastro, consultar o histórico de ordens de compra e outros detalhes que você decida disponibilizar.</li><li>Os módulos de pagamento podem ser adicionados de acordo com a sua necessidade, como por exemplo, o módulo disponibilizado pelo pagseguro  e paypal.</li><li>Trabalha com diversos tipos de moeda, inclusive o nosso R$ (real).</li><li>Modelo de cobrança de impostos flexível</li><li>Diferentes métodos de envio de produtos permitindo a programação e configuração de diversas formas de shipping para o cliente. Existem alguns módulos disponíveis no Brasil que implementam, por exemplo, o envio pelos correios nas suas diferentes modalidades (PAC, Sedex, e-Sedex) </li><li>Confirmação da ordem de compra por e-mail tanto para o comprador como para o dono do comércio virtual. Estas confirmações são configuradas e personalizadas no admin do Joomla!.</li><li>Gerenciamento de ordens de compra: resumo, ordens pendentes, ordens concluídas etc. Tem também um esquema de notificação do cliente em caso de mudança do status da ordem de compra.</li><li>Gerenciamento feito pelo painel de administração do Joomla!.</li></ul><p><strong>Pré-requisito:</strong></p><p>Conhecimento prévio em Joomla (veja meu curso de joomla)</p>", 
    "end_date": null, 
    "title": "Virtuemart loja virtual (e-commerce) com joomla", 
    "price": "30.00", 
    "instructors": "Neri Neitzke", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615148_ab2c.jpg", 
    "course_url": "https://www.udemy.com/virtuemart-loja-virtual-e-commerce-com-joomla/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T19:31:55Z"
}