{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t   If you&#039;ve learned a little bit about HTML and CSS than you&#039;re ready to take the next step in front end development with Javascript.  Some people find javascript to be a little confusing, but I take you step by step through real world examples so that you can learn the easy way... By doing!  </p>  <p>  \t  What is Javascript?  Javascript is what brings your website to life!  Its what allows users to interact with things on your website.  The page you&#039;re looking at right now uses it all over the place. See those little arrows below this description that give additional details about this course? Well when you click on that to reveal the additional text, THATS JAVASCRIPT!  Look off to the left where theres the description about me, when you click on the &quot;more&quot; button, thats JavaScript too!  </p>  <p>  \t  Why learn Javascript?  If you&#039;re serious about being able to build a website, then knowing Javascript is essential.  Without it you can&#039;t really consider yourself a front end developer.  You can already see how its used on this one page alone, just imagine where else its used, and the possibilities of what YOU can do with it.  This course will take you from knowing nothing to being a javascript pro.  You wont just learn some boring code syntax, you&#039;ll learn how to use it in real life examples.  </p>", 
    "end_date": null, 
    "title": "Web Development by Doing: Javascript", 
    "price": "50.00", 
    "instructors": "Bradley Berger", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/171032_ffb9_4.jpg", 
    "course_url": "https://www.udemy.com/webdevbydoing-javascript-complete-and-practical/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-22T18:00:48Z"
}