{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t                If your looking to get a start on learning the, fun, and profitable skill of web development, then this course is for you. Unlike other courses which teach tedious theory ABOUT making a website, you&#039;ll learn practical knowledge on HOW to do it. This course takes you step-by-step as we build a complete professional website from scratch.  <strong style=\"\">Websites like the one we build in this course can easily sell for $1,000 - $4,000.</strong>  </p>  <p>  \t                The course starts out assuming that you know nothing, and shows you where to get the free tools needed to make a website.  Then we jump right in and start learning HTML5 and CSS3 the easy way.  </p>  <p>  \t                By the end of the course, you&#039;ll be able to make a complete professional website and be able to sell your work for a lot of $.  Whether you&#039;re looking for a new career, to make a little extra on the side, or you want to be able to make a website for yourself and friends, you&#039;ve come to the right place.  </p><p><strong style=\"\">You could be making money RIGHT NOW on the internet instead of wasting your time. Enrolling in this course will give you all the skills you need to do so.</strong></p><p>We begin by learning HTML which is the structure that makes up every single website. Once the structure of our site is complete we begin styling it using CSS, which is also used on every single website. CSS is used to style everything on a website, including: background colors (or images), font sizes, font colors, as well as the width, height, and position of everything on a webpage.</p><p>We then cover topics which are critical to modern websites, like responsive design and embedding images and videos. We also go over how you can develop a website locally on your computer, then put the files on a live server for the world to see.</p><p>Enroll now to invest in yourself and to open the doors to this exciting field.</p>", 
    "end_date": null, 
    "title": "Web Development: Make A Website That Will Sell For Thousands", 
    "price": "50.00", 
    "instructors": "Bradley Berger", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65355_df9a_15.jpg", 
    "course_url": "https://www.udemy.com/web-development-by-doing-html5-css3-complete-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-14T04:22:22Z"
}