{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Web development techniques are rapidly changing to adapt to new advancements in technologies each day. To keep up with these changes, developers need to be able to create websites with brilliant visualizations. HTML5 makes it possible to build interactive visualizations right in the web browser, written in JavaScript. It provides an integrated approach to speed up the process of creating live visualizations. The birth of CSS3 brings with it many updates that make designing in HTML easier and more stunning. </p><p>Web Visualization with HTML5, CSS3, and JavaScript is a comprehensive video course that covers everything you need to know about the cutting-edge techniques introduced in HTML5, CSS3, and JavaScript. </p><p>The course starts off by getting you up to date with the most recent advancements in CSS3 visualization techniques. From there you’ll keep building your knowledge base by shifting your focus to animating and transforming elements without JavaScript using CSS. Moving ahead, you’ll discover how to draw in SVG and animate these elements without the use of JavaScript. Then, we’ll change gears to cover bitmap/raster art as you learn to draw in HTML5 Canvas and how to animate the drawn elements. We’ll wind up the course with a foray into animation libraries and pure JavaScript animations.</p><p>By the end of the course, you will be fully armed to create stunning web visualizations to integrate it into your workflow.</p><p><strong>About The Author</strong><strong></strong><br></p><p><strong>Ben Fhala</strong> discovered his passion for data visualization while he was working at Parsons in New York, in their data visualization department, PIIM. He is the owner of the online video training school, 02geekcom, and an Adobe ACP. He enjoys spending most of his time learning and teaching, and has a love for visual programming and visualization in general. Ben has had the honor of developing applications for members of the US Congress, Prime Ministers, and Presidents around the world.<br></p><p>He has built many interactive experiences for companies such as Target, AT&amp;T, Crayola, Marriott, Neutrogena, and Nokia. He has technically directed many award-winning projects and has been part of teams that have won three Agency of the Year awards.</p><p>Among Ben's publications are HTML5 Graphing and Data Visualization Cookbook, and three video courses jQuery UI Development, Learning Object-Oriented JavaScript, Mastering JavaScript, and JavaScript Design Patterns, all for Packt Publishing.</p>", 
    "end_date": null, 
    "title": "Web Visualization with HTML5, CSS3, and JavaScript ", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691828_9cc1_2.jpg", 
    "course_url": "https://www.udemy.com/web-visualization-with-html5-css3-and-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T06:58:41Z"
}