{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Learn the basic skills, tools, and techniques you will need to employ to develop attention-grabbing websites.</span>  </p>  <p style=\"\">  \t<strong style=\"\">Develop a strong foundation in HTML and CSS while learning to build websites.</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Learn HTML and CSS</li>  \t<li style=\"\">Build a personal website</li>  \t<li style=\"\">Upload your website to the internet for the world to see</li>  </ul>  <p style=\"\">  \t<strong style=\"\">The Most Important Step Towards Becoming A Web Developer</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>Learning HTML and CSS is an essential step for anyone hoping to become a web developer. HTML and CSS are easy to learn, and powerful enough to build amazing websites.  </p>  <p style=\"\">  \t        Web Developers make, on average, $65K dollars, so why not start learning today? After learning HTML and CSS, you will be able to move onto front-end development with JavaScript and JQuery, or back-end development with PHP and Ruby.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \t        The Web Development Crash Course covers everything you need to know to start building your own websites. By the end of the course, you will have your very own personalized domain and an amazing website to show of to the world.  </p>  <p style=\"\">  \t        Learning HTML and CSS is easy, and all you need is a text editor and a web browser, which we will cover in the course. You will learn by building three projects, which helps keep the course interesting and engaging. All lectures are straight to the point, so you will always be learning.  </p>", 
    "end_date": null, 
    "title": "Web Development Crash Course: Become a Web Developer Today", 
    "price": "20.00", 
    "instructors": "Joseph Bergman", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375116_39c1_3.jpg", 
    "course_url": "https://www.udemy.com/web-development-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-21T19:09:22Z"
}