{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t            You can launch a new career in web development today by learning HTML &amp; CSS. You don't need a computer science degree or expensive software. All you need is a computer, a bit of time, a lot of determination, and a teacher you trust.  \t  \t              I've taught HTML and CSS to countless coworkers and held training sessions for fortune 100 companies. <strong>I am that teacher you can trust</strong>.  </p>\n\n<p>  \t            Don't limit yourself by creating websites with some cheesy “site-builder\" tool. This course teaches you how to take 100% control over your webpages by using the same concepts that every professional website is created with.</p>\n\n<p>This course does not assume any prior experience. We start at square one and learn together bit by bit. By the end of the course you will have created (by hand) a website that looks great on phones, tablets, laptops, and desktops alike.</p>\n\n<p><em><strong>I have helped over 4,000 students and have received the following feedback:  </strong></em>  </p>\n\n\n\n<p>  \t          “…A fantastic course… clear, definite and engaging.\"</p>\n\n\n\n<p>“…Presentation is concise without being tedious… you honestly feel that you have a thorough understanding of the subject.\"</p>\n\n\n\n<p>“…[Brad] explained the process. Not memorize this or that, he explained the process. If you're looking to take a course to understand the foundations of creating websites, look no further.\"</p>\n\n\n\n<p>“Brad definitely has some of the best techniques to embed the lesson into your mind… hands down these are the best tutorials I have had the opportunity to view.\"</p>\n\n\n\n<p>“I found this course really helpful and I highly recommend it… all things you learn are seen in action instantly.\"</p>\n\n\n\n<p>“Brad has put together a great foundation for any body wishing to get a good understanding with front end web-development.\"<br></p>\n\n\n\n<p>“…I would definitely recommend this course to most folks I know who want to learn web design.\"</p>", 
    "end_date": null, 
    "title": "Web Design for Beginners: Real World Coding in HTML & CSS", 
    "price": "25.00", 
    "instructors": "Brad Schiff", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/246154_d8b0_3.jpg", 
    "course_url": "https://www.udemy.com/web-design-for-beginners-real-world-coding-in-html-css/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-19T00:19:15Z"
}