{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t        # To celebrate my success with this course within the two months, I have decided to lower the price to 15 dollars. Don't know when will I raise back the price but enjoy it when it's 15 dollars. Ps I won't give out coupons when the price raise back so please don't send me message for coupon :) Thank you!</p><p>This course is designed for students who want to make <strong>hundreds to </strong><strong>thousands extra income</strong> from Flippa by 3 ways.  </p>  <p>  \t        # Flip website  </p>  <p>  \t        # Buy website and generate monthly income  </p>  <p>  \t        #Build website and sell it on Flippa.  </p>  <p>  \t<strong>Content:</strong>  </p>  <p>  \t<strong></strong>Except the 3 ways of making money on Flippa, This course also covers skills required like how to list your website on flippa, and how to transfer websites. It includes personal experience and tricks of selling on Flippa as well. All features of Flippa(deal flow, featured listing, bounce rate of website..etc) are explained. Those knowledge and warnings can help you with your business on flippa effectively.  </p>  <p>  \t        This course can help you get started with Flippa and website business <strong>within 1 day</strong>. You will be able to learn how to earn <strong>more than a hundred per hour on website.</strong>  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t        Also, this course provide hundred percent grantee, if you are not satisfied with this course, you can apply for a <strong>100 percent refund.</strong>  </p>  <p>  \t        To be rich, working hard is not the way. You have to find the right path and work hard. Remember how you look at your successful friends? That's how they are going to look at you! With internet and websites become one of the most important components of our daily life, website trading business is defiantly a smart choice for within at least 10 years.  </p>", 
    "end_date": null, 
    "title": "Web Training Market Using Flippa: Three Key Strategies", 
    "price": "20.00", 
    "instructors": "Yiran Zhou", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387228_1871_2.jpg", 
    "course_url": "https://www.udemy.com/web-training-market-using-flippa-three-key-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T00:40:38Z"
}