{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em><em>IMPORTANT NOTE: The material of this course is also covered in my other course about web design and development with HTML5 &amp; CSS3. Scroll to the bottom of this page to check out that course, too! If you're already taking my other course, you already have all it takes to start designing beautiful websites today!</em></em></strong><br></p><p><em>\"<strong>Best web design course on Udemy:</strong> If you're interested in web design, but want more than just a \"how to use WordPress\" course, I highly recommend this one.\" </em>— Florian Giusti<br></p><p><em>\"<strong>Very helpful to us left-brained people:</strong> </em><em>I am familiar with HTML, CSS, JQuery, and Twitter Bootstrap, but I needed instruction in web design. This course gave me practical, impactful techniques for making websites more beautiful and engaging.\" — </em>Susan Darlene Cain</p><p><em>\"<strong>The most educational instructor ever!:</strong> Everything is good about this course, you learn a lot, the instructor are excellent and the production is flawless. Love this course, simple as that!\"</em> — Lovisa</p><p>Did you know that beautiful websites convert better that ones that don't stand out at all? This means more sales, more signups, and ultimately more money for you. Do you want to learn how to do exactly that?<br></p><p><span></span></p><p><strong>If you wonder how you can make your next website really good looking, then you've come to the right place! </strong></p><p><strong>In this course, I will show you 25+ guidelines of amazing web design in less than 1 hour.</strong> No boring theory, no unnecessary stuff. You will learn dead simple web design rules and guidelines that go straight to the point — you can use them to improve your websites <strong>today!</strong></p><p>In this course, we will use beautiful web design examples together with my <strong>25+ guidelines of amazing web design</strong> to learn:</p><p>• How to make text look professionally designed</p><p>• How to correctly use the power of colors</p><p>• How to get and use amazing images, fonts and icons to make your website shine — all for FREE.</p><p>• How to create a layout using whitespace and visual hierarchy</p><p>• How to keep yourself inspired to learn more and more about web design</p><p>• How to make your websites convert better using 8 simple-to-use techniques</p><p>But there is even more: I provide you with tons of useful web design resources to get you started for your next web design project! You get immediate FREE access to the course e-book “Best Resources for Web Design and Development with HTML5 &amp; CSS3\". <strong>These are real-world resources used by real professionals in the web design industry!</strong></p><p>You can use the rules and guidelines you'll learn in this course for everything you want: design your own Wordpress theme, personalize a Bootstrap website, start from scratch with HTML and CSS or mockup a website in Photoshop. <strong>The 25+ guidelines of amazing web design are universal and ready-to-use for any project.</strong></p><p><strong>This course is perfect for experienced web developers who want to learn how to make their websites look beautiful and professionally designed.</strong></p><p>So start designing websites that convert today! The thing is: you will have a hard time to find a compilation of guidelines like the one I show you in this course anywhere else. But see for yourself and click the “Take this course\" button right now.</p>", 
    "end_date": null, 
    "title": "Web Design for Web Developers: Build Beautiful Websites!", 
    "price": 0, 
    "instructors": "Jonas Schmedtmann", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473160_d929.jpg", 
    "course_url": "https://www.udemy.com/web-design-secrets/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T22:31:50Z"
}