{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Whether working in the enterprise, building for web or mobile, you will need to build (if you haven't already) RESTful APIs to serve data between different client applications and endpoints. This course delivers the fundamental knowledge required to enable highly connected interaction between applications through building RESTful web APIs.</p><p>Building good web APIs is not an easy task, but is a necessity for applications that support multiple platforms (mobile, tablet, and web applications) especially with the modern, mobile-first approach to development. In this course, you will learn how to build up and structure an effective web API that can be used by any client application accessing it over the HTTP protocol.</p><p>We will start out with basics of the Flask framework before establishing a comprehensive foundation of working with CRUD operations using SQLAlchemy and MySQL as the data store. You’ll get an understanding of how REST works relative to APIs, and we’ll cover how to test APIs written in Python with the support of Flask. You will learn about token-based authentication and find out how to store passwords securely in your database. Best practices and design guidelines when building large applications are also presented.</p><p>After completing Web API Development with Flask, you will have enhanced your technical knowledge about RESTful web APIs and have absorbed best practices that can be applied practically in the future.</p><p><strong>About The Author</strong></p><p><strong>Gergo Bogdan </strong>is a software engineer with over 7 years of experience in the IT industry. During this time, he worked at small companies and multinational organizations too. He has vast expertise in multiple technologies, starting from .NET to Python to JavaScript to Java. He loves to create technical articles and tutorials for fellow developers.<br></p>", 
    "end_date": null, 
    "title": "Web API Development with Flask", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/755822_aee8_2.jpg", 
    "course_url": "https://www.udemy.com/web-api-development-with-flask/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T10:40:04Z"
}