{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t In this course you will learn how to translate and localize websites with special attention to cultural adaptation. You will also find out how to translate files with tags and how to ensure high quality of your website localization projects. Sounds interesting? Here is exactly what we will cover:  </p>  <p>  \t <strong>Website Localization Process</strong>  </p>  <p>  \t In the first section you’ll learn what is globalization, localization and internationalization and why do you need to know that. Then we’ll discuss why websites are actually localized and have a look at the website localization process.  </p>  <p>  \t <strong>Cultural Adaptation in Localization of Websites</strong>  </p>  <p>  \t You’ll learn why it is important to adapt a website to the target culture and how to do it. I’ll show you some examples of culturally adapted websites and explain why the specific changes had to be implemented.  </p>  <p>  \t <strong>Digital Genres</strong>  </p>  <p>  \t You’ll find out why a digital text is different from a printed text and how to translate it. You&#039;ll also learn about various digital genres and why it is important to be able to recognize the digital genre on the localized website.  </p>  <p>  \t <strong>How To Do It?</strong>  </p>  <p>  \t Once you understand the background of the website localization, you’ll be able to move on to the practical issues. First I’ll teach you how to set a rate and deadline for your website localization project and how to specify the word count of the translatable text. Then you’ll learn how to translate HTML and XML files and how to deal with files with embedded code. I’ll also explain what is a localization kit and why it is important for your work. You’ll also learn what tools are useful for website translation and localization. Finally, I’ll give you several practical tips for better website localization.  </p>  <p>  \t <strong>Quality In Website Localization</strong>  </p>  <p>  \t Once you know how to translate and localize websites, you’ll have to review your work and assure high quality. I’ll give you several tips how to do it.  </p>  <p>  \t Are you ready? Let’s get started!  </p>", 
    "end_date": null, 
    "title": "Website Localization For Beginners", 
    "price": "50.00", 
    "instructors": "Dorota Pawlak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/132804_edba_4.jpg", 
    "course_url": "https://www.udemy.com/website-localization-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-12T15:36:19Z"
}