{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">What is this course about?</strong>  </p>  <p style=\"\">  \tDo you wish to create a professional website or blog that looks great but without actually spending months to learn coding? Look no further. This course is designed for beginners and those who have never build a Wordpress website before or maybe you are looking to refresh your skills.  </p>  <p style=\"\">  \tIn this course I will walk you through each step one-by-one to get you up to the level where you can even create websites as a part time job!<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">What you will learn from this course?</strong>  </p>  <p style=\"\">  \tAt the end of this course, you will be able to create a website possibly within 1 hour.  </p>  <p style=\"\">  \tThroughout the course, you will learn everything you need to know to create a user-friendly wordpress Website or blog.  </p>  <p style=\"\">  \tWe will also show you how to find professional looking themes like websites such as CNN, Sony Music, TechCrunch and more.  </p>  <p style=\"\">  \t<strong style=\"\">How can you benefit from this course?</strong>  </p>  <p style=\"\">  \tThis course will leach you everything you will need to know for becoming a expert at wordpress fundamentals and how to use them to create wonderful websites.  </p>  <p style=\"\">  \tYou will also learn many skills throughout the way such as SEO and how to get your blog ranked easier on google.  </p>  <p style=\"\">  \t<strong style=\"\">You will also learn:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"></strong>Getting a hosting account</li>  \t<li style=\"\">Getting a domain name (FREE)</li>  \t<li style=\"\">Installing Wordpress</li>  \t<li style=\"\">Learn how to properly work around Wordpress</li>  \t<li style=\"\">Learn how to add new software/features to your website easily!</li>  \t<li style=\"\">And much more....</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Why is our course better?</strong>  </p>  <p style=\"\">  \tMost courses will rely on the students to install hosting and finding domain names, while this course will take you through all the steps on how to get them setup easily and CHEAPLY. Also the language used is jargon free, and with short lectures you can always go back to what you need to learn easily.  </p>  <p style=\"\">  \t<strong style=\"\">PLEASE NOTE: THIS COURSE IS IN PROGRESS!!! AND UPDATES ARE BEING MADE.</strong>  </p>", 
    "end_date": null, 
    "title": "wordpress webdesign", 
    "price": "20.00", 
    "instructors": "Agron Cela", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389336_58f3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-wordpress-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-09T09:33:07Z"
}