{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>Are you struggling with setting up your own WordPress website or blog? </strong>  </p>  <p>  \t<strong>Sick of outdated training on older versions of WordPress that are never updated and more instructional rather than eduicational?</strong>  </p>  <p>  \t<strong>Do you want to learn WordPress best practices for building, maintaining, protecting, and monetizing a successful website?</strong> <br>  \t<br>  \t<span>Then please read on...<br>  \t</span><span> </span>  </p>  <p>  \t              Learn all you need to know about WordPress 4 on-wards, and remain on top ALL its features, while learning all you need to know to easily build your own website or blog and making it a success.  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>I leave no stone un-turned</strong><span> on how to build a successful website, easily, and without wasting time and money on plugins, themes, courses, and training that just does not work or make things easier?</span>  </p>  <p>  \t           This training is updated as WordPress updates it system and makes changes, and <strong>I do my best to keep everything as simple as can be.</strong> If you are not a programmer... lucky you!  </p>  <p>  \t        These videos are <strong>techie free</strong> so that anyone can understand them and start to learn all you will ever need to know. That means YOU!  </p>  <p>  \t             Save time and money, no up-sells , no additional or advanced training... just the know-how to <strong>g</strong><strong>et your website ready (and live... fast) with our detailed &#039;over-the-shoulder&#039; step-by-step video tutorials.</strong>  </p>             As a SPECIAL BONUS we are: <br>  <br>  <ul>  \t<li><span>G</span><span>iving away free themes and plugins for you to use on your site (if you need them) </span></li>  \t<li><span>Learn important Search Engine Optimization (SEO) rules and best practices</span></li>  \t<li><span>Understand the basics of the L</span><span>egalities of owning a site and what you need to protect you</span></li>  \t<li><span></span><span>Discover how to secure your site easily (and for free). This is super important!</span></li>  \t<li><span>Learn different ways of monetizing your site and online business and how to do it properly</span></li>  \t<li><span>...</span><span>and other really cool training that no-one offers... </span><strong>especially for FREE!</strong></li>  </ul>  <strong></strong>  <p>  \t           Thank you, and please enjoy! <br>  </p>  <p>  \tYour requests and feedback are welcome!  </p>", 
    "end_date": null, 
    "title": "WordPress 4+ Unveiled - Up To Date Trainings - ALWAYS", 
    "price": 0, 
    "instructors": "Crucial Advantage, Zimmaron Zsido", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/196100_ed29_3.jpg", 
    "course_url": "https://www.udemy.com/wordpress-39-unveiled-build-your-own-site-fast/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-09T04:53:05Z"
}