{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Just Launched and 800 students enrolled on the first day!</strong></p><p><strong>WordPress Training: A Step by Step Course to Create Professional Looking Website</strong></p><p>This course will teach you in easy steps to create professional, mobile friendly and responsive website. You do not have to learn any programming or coding as the very purpose WordPress is to take care of the technical stuff.</p><p>The course is great for beginners as well as those who want to develop their WordPress skills professionally.</p><p><strong>Simple Language Instructions</strong></p><p>The lectures have been delivered in simple and plain English with minimum use of any technical words or jargon. This ensures that you learn what you need without going through unnecessary technical and difficult terminology.</p><p><strong>Customize Any WordPress Website</strong></p><p>You will be able to customize any website using WordPress themes without touching any code. Once you master the art of customization, you can change the look and feel of any WordPress Site within a few minutes. </p><p>You will learn all this by playing around with WordPress themes without to worry about the the theme development aspect.</p><p><strong>Materials Included</strong></p><p>Most content is delivered through videos. Wherever necessary, files, folders and PDFs documents have been added to make things easier and more informative.</p><p><strong>Create WordPress Sites for Money</strong></p><p>At the end of the course you will be able to </p><ul><li>Create website for small business and other clients locally, nationally or even internationally.</li><li>Purchase a hosting account, create add on domains other features of Cpanel</li><li>Install WordPress for your business or other clients for money</li><li>Use themes to change the look and feel of website for your clients</li></ul><p><strong>Monetize Your Site</strong></p><p>Apart from earning for creating sites for clients, you can also monetize your own sites. In this course, I create an affiliate demo site ready for monetizing with Adsense and other affiliate products.</p><p><strong>What Will Your Learn at the End of the Course</strong></p><ol><li>Find a domain name.</li><li>Register a domain name</li><li>Buy a hosting account</li><li>Using WordPress editor</li><li>Creating your first post</li><li>Creating your first page</li><li>Difference between posts and pages</li><li>Comments and general settings.</li><li>Installing themes</li><li>Plugins and WordPress</li><li>Creating and customizing your homepage</li><li>Adding a slider</li><li>Creating a free header</li><li>Changing the colors</li></ol><strong>And a lot more... This is just the tip of the iceberg only.</strong><p>If you follow me over my shoulder, by the end of the course you will have a website that you will truly proud of....</p><p><em><strong>Not only, that you will be ready to launch several sites in no time and ....</strong></em></p><p><em><strong>Even creates websites for money!</strong></em></p><p><em><strong></strong></em><strong>What am I going to get from this course?</strong></p><ul><li>Over 64 lectures and 7 hours of content!</li><li>This WordPress Course will teach anyone to build a function, beautiful website with WordPress.</li><li>Build a WordPress website in the shortest possible time.</li><li>Understand the main features of WordPress as platform and why WordPress</li><li>Learn how to professionally configure WordPress for best results</li><li>Learn  plugins &amp; themes and how to find/install them easily</li><li>Create an affiliate site for passive, recurring income</li><li>Create a Responsive Website that looks good on any browser and pass Google's mobile friendly test.</li></ul><ul><li></li></ul>", 
    "end_date": null, 
    "title": "WordPress for Beginners Master WordPress in No Time", 
    "price": "20.00", 
    "instructors": "Qadar Khan", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428672_34e4_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-create-professional-wordpress-websites-no-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T20:01:01Z"
}