{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Hi WordPress Friends, </p><p>in This \"WordPress Green Belt\" course we'll tackle a WordPress website from scratch. <strong>Attention: it's not a \"ACF Complete Guide\" or something! </strong>But we'll use the power of ACF in order to build a real estate website which looks individual. We'll create an image field and a text field and in the theme we will style both to our needs. <br></p><p><strong>You have to bring CSS, HTML and PHP fundamental understanding or you must be very brave! </strong></p><p>But I'll provide code examples and explain everything step by step. So if you are a beginner, then be brave and try to learn something from this tutorial. There is a lot of documentation out there which'll help you to understand my code. </p><p>The coolest thing is that we'll do a lot of essential WordPress coding: </p><p>- we'll create a custom post type called property</p><p>- we'll output custom fields with php functions in the theme</p><p>- <strong>we'll create a custom shortcode! </strong></p><p>Alongside I'll give yo a lot of tips and tricks. For example I use a wordcounter I frequently use personally. Or I will tell you how to save logos for the web. If that's not enough to you: then I don't know. </p><p>The structure of this course is as follows: We will install WordPress on a local machine (with mamp actually) and then install a Theme. After installing the theme we clone the theme into a subtheme. This is pretty important. With doing that you'll not overwrite your own changes while updating. After creating this subtheme we can start and install ACF (Advanced Custom Fields). The we will create our custom post type a property. After that we will add a bunch of fields (a field group) through ACF to our post type property. Then of course we create content. </p><p>After creating the content we style our fields. We use a lot of css in order to get a nice header image running. </p><p>When we are done with our content we create and build our frontpage with a shortcode. This is a handy way which will keep all the WordPress functionality for you. I've seen worse ways to create a frontpage with code than using a shortcode. If you overwrite your frontpage with a template for example you lose all your WordPress code editor capabilities for example! </p><p>When we have our frontpage in place we'll add a logo to our sidebar. And we'll of course remove all the content we don't need from our sidebar. After that we'll add a nice menu! </p><p>That's all relating the content of this course. But be sure, I'll add captions to every video which will explain everything and I'll give code examples! I'll try to shorten all the contents in the descriptions of the videos! </p><p>If you should have any questions while watching my course please feel free to ask me and open a new discussion. I will respond to that as soon as possible. I promise. </p><p>This tutorial here is: unique! I promise. I hope you enjoy this course and will learn a lot! </p><p>sincerely </p><p>Malte Helmhold</p>", 
    "end_date": null, 
    "title": "WordPress Website Programming for Beginners with ACF", 
    "price": "20.00", 
    "instructors": "WordPress, SEO & Programimerung Malte Helmhold", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670418_a676_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-green-belt/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T16:07:24Z"
}