{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>New Content Added July 9, 2015</p><p>Take advantage of our <strong>Free Setup Offer</strong>. Get your Wordpress installed <strong>Free ($99 Value)</strong>. Learn how inside the course. It doesn't cost you one thing extra.</p><p>This is a 100% FREE course for Beginners who know nothing about Wordpress.  It starts at the beginning and teaches you step by step how to use Wordpress. Students will gain valuable knowledge for developing sites using Wordpress.  Wordpress is used by more than 37 million users. It makes up over 20% of all the sites online. Wordpress continues to grow daily. So learning how to use Wordpress is only investing in valuable knowledge.</p><p><strong>Students Will learn:</strong></p><ul><li>Learn to build website using Wordpress</li><li>Learn to embed video in Pages or Post in Wordpress</li><li>Learn How to install Wordpress on Host Provider</li><li>Learn how to change header image for logo</li><li>Learn to customize layout of the pages using Wordpress</li><li>How to embed video in page or post</li><li>How to create an image gallery</li><li>How to add New Domain to Cpanel</li><li>How to add Wordpress to New Domain</li><li>Learn the best Wordpress Host</li></ul>Students will also be invited to join our private Facebook group where we answer any questions you have day or night. Are you confused how to setup Wordpress with a hosting company.  Reach out to us on here and we will setup your site FREE of Charge.  We only require you choose from 3 of our top recommended providers.  What are you waiting for hit that enroll button.", 
    "end_date": null, 
    "title": "Wordpress 2015 For Beginners: No Coding Build Site ", 
    "price": 0, 
    "instructors": "Mitch Stevens", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525500_e520_12.jpg", 
    "course_url": "https://www.udemy.com/wordpress-no-coding-needed/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T22:49:31Z"
}