{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>WordPress</strong> Content Management System (CMS) is the #1 website builder available on the internet and it is use by more than 85 million entrepreneurs and businesses worldwide.</p><p>This course is an in-depth look at some other WordPress's features and functionality. It teaches you <strong>from scratch</strong> how to create a <strong>customized website</strong> hosted on your own computer.</p><p>This course also shows step by step how to <strong>successfully </strong><strong>migrate</strong> <strong>website</strong> from Localhost to an online Web Server, and creating a fully functional responsive website using WordPress <strong>themes</strong>.</p><p>It is about WordPress <strong>Developmen</strong><strong>t</strong> and in this course I will guide you step by step by means of <strong>hands-on tutorials</strong> on how to develop a WordPress <strong>website</strong> on your LocalHost and then I will teach you how to migrate your website from your <strong>LocalHost</strong> to a <strong>Web Server</strong>. </p><p>This course is approximately 1.5 hours long and within this time period you will become an expert at WordPress Development. If you are interested in learning the fundamental <strong>concepts</strong> of WordPress then this course is for you. So why wait? Enroll Now and become an <strong>expert</strong> at WordPress Development.<br></p>", 
    "end_date": null, 
    "title": "WordPress Development Crash Course: From Zero To Hero", 
    "price": "20.00", 
    "instructors": "Syed Ali", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722754_244b.jpg", 
    "course_url": "https://www.udemy.com/wordpress-development-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-10T13:26:06Z"
}