{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<ul><li>Hello a Welcome to This Course This is a Wordpress Website Development Course form Basic To Advanced</li><li>This isn Mobiles &amp; Tabs and SEO Friendly</li><li>SEO Helps ranking Your Website in Search Engines</li><li>This Course is going to help you build a \"$2500\" website: With no programming or coding knowledge - experience necessary, </li><li><strong>bonus</strong>! in this Course i will Show you How to Create a Custom <strong>Logo</strong> For Your Websites</li><strong></strong><li><strong>What i am going to get from this course:</strong></li><strong></strong></ul><ul><li>Choose a domain using godaddy and HostGator, Get hosting service,</li><li>Connect Hostgator and Godaddy, Login website cpanel, Install wordpress</li><li>Log into wordpress, Install Spacious Theme for our wordpress website, </li><li>Download and Upload images onto wordpress, Create a custom <strong>logo</strong> for our Website,</li><li>Upload logo, Create pages for slider,Activate slider, Create products and services section,</li><li>Create Image Gallery, Create recent blog posts section, Create blog posts,</li><li>Create call to action, Create featured page and testimonials, Create additional pages</li><li>Customize footer, Create About Us Page, Customize header menu,</li><li>Learn how to edit font on wordpress, Create contact us page, Create email option form</li><li>Customize right sidebar And Much More,</li><strong></strong><li><strong>This is The Latest Course of 2016</strong></li><li><strong>if You Want More info Watch Promo Video and Free Preview Video For More More's Ideas ! Or \"</strong>Take This Course<strong>\" Right Now</strong></li><li><strong>This Course for All, and i will Teach You in This Course How to Become a Wordpress Expert</strong></li><li>After This Course You Can start work om freelancing with provide Wordpress Service</li><li>No Need Any Type of Coding or Programming just \"Drag and Drop\", \"Copy and Paste\"</li><li>This course was designed to show anyone how to use wordpress to create websites by making wonderful and skilled looking websites. i feel that the most effective thanks to learn is by doing, which is what we are going to do. This course operates beneath the belief that the coed is aware of nothing regarding WP, or building websites for that matters</li><li>Have you ever needed to create an expert looking web site, however did not understand wherever to start currently you'll be able to with Wordpress four. wp for Beginners could be a complete course for anyone, no matter what your technical ability This course assumes no previous knowledge!<span></span></li><li>This is a Complete Beginner Wordpress Step by Step Guide, Join This Course Today and Build Your first wp website Today</li></ul>", 
    "end_date": null, 
    "title": "Wordpress For Beginners Create Your first Website Today", 
    "price": "25.00", 
    "instructors": "Jameson jane", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725052_e4da.jpg", 
    "course_url": "https://www.udemy.com/wordpress-for-beginners-create-your-first-website-today/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T03:46:36Z"
}