{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Самостоятельное создание своего блога/сайта с элементами Email-маркетинга + создание страницы захвата для построения своей базы подписчиков + создание формы подписки на каждой странице.<br></p><p>Вы когда-нибудь слышали о Email-маркетинге? На сегодняшний день это один из лучших способов построения бизнеса в сфере интернет-маркетинга. Его успешно применяют в сетевом маркетинге, успешно используют интернет предприниматели.<br></p><p>Основное преимущество использования Email-маркетинга – это высокая автоматизированность. Ваш бизнес будет работать 24 часа в сутки, 7 дней в неделю, тогда, когда Вы спите или отдыхаете. Вы сможете владеть собственной базой подписчиков, одновременно переписываться с которой можно одним кликом мыши.</p><p>Много рассказывать о Email-маркетинге я не буду. Вы и самостоятельно можете в интернете разыскать кучу бесплатной информации на эту тему. Другое дело построить бизнес по модели Email-маркетинга. И вот этому я Вас научу.</p><p>Специально для Вас, уважаемый читатель, я создал видео-курс, смотря который и повторяя все действия за мной, Вы без труда сможете настроить Ваш бизнес в рамках Email-маркетинга.</p><p><strong><em>Просмотрев и изучив видео-курсы Вы самостоятельно сможете:</em></strong></p><p>1. Создать свой собственный блог/сайт с элементами Email-маркетинга. Материалы, программы, плагины я предоставлю и все подробно объясню. Вы только смотрите видео и повторяете за мной. Ваши затраты на создание блога составят: домен – примерно 2,5-6$ в год; хостинг – примерно 2.5-3$ в месяц. Согласитесь, это не большие деньги. </p><p>2. Создать собственную подписную страницу захвата и свою базу подписчиков. Система подписных страниц захвата является одной из самых эффективных моделей превращения посетителя Вашего блога/сайта в подписчика.</p><p>3. Создать форму подписки на каждой странице. С ее помощью Вы сможете предлагать любой Ваш материал (в моем видео-курсе это электронная книга) взамен на подписку. </p><p>4. Получите информацию по раскрутке Вашего блога/сайта, а также много другой полезной информации.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "WordPress: самостоятельное создание своего блога/сайта", 
    "price": "20.00", 
    "instructors": "Евгений Ермолович", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/730078_32f8_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-16T15:33:42Z"
}