{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Join Over 11,698 Students and Sign Up to one of My Courses Today!</strong><br></p><p><strong>Last Updated: February 20th, 2016.</strong></p><p><strong></strong></p><p><strong></strong></p><p><em><strong></strong></em></p><p><em></em>Creating a website for your business online doesn't have to be complicated and stressful or even remotely hard at all - all you need is a good understanding of how Wordpress works.</p><p>My name is Robin Haney and I am a <em>Web developer, Blogger, Author, Internet Marketer and SEO specialist</em>. I have been created websites online for over 8 years and have been loving it ever since.</p><p>In this course you are going to learn how you can easily build a website for your own/someone's business. In this course we are going to cover:</p><ul><li><em>Picking a domain name for your website and hosting it online.</em></li><li><em>The pros and cons of free website hosts and self-hosted websites online.</em></li><li><em>How to hook-up your domain name to your hosting account in no time.</em></li><li><em>How to install Wordpress in a matter of minutes.</em></li></ul>We are also going to be working in wordpress where you will learn how to do the following:<ul><li><em>Navigate and work within the Wordpress interface with confidence and clarity.</em></li><li><em>Adding content to our website by publishing posts and pages as well as formating our content so it looks all nice and pretty.</em></li><li><em>Adding images and video to your website.</em></li><li><em>Installing and customizing Wordpress Themes.</em></li><li><em>Installing plugins and drastically changing the way our Website operates.</em></li><li><em>Adding and working with widgets so you can easily customize all areas of your website.</em></li><li><em>Learn how to SEO optimize your Wordpress website to get extra organic SEO traffic.</em></li><li><em></em></li></ul><em><em>Here are some reviews from students who have already taken the course:</em></em><p><strong>Michael Choke</strong> - <em>Actionable knowledge, not just pure information, communicated with great professionalism</em></p><p><strong>N S Gaskin</strong> - <em>Awesome course on wordpress! Goes very deep in each and every concept. Thanks Robin!</em><em></em></p><p><strong>Mike Hall</strong> -<em> </em><em>I have taken 11 courses till date on the same topic, but the amount of knowledge I got in such a short span of time was amazing. Thanks a lot, Robin!</em></p>I created this course so that everyday people can reap the rewards of taking their business online. This course is also great for beginners learning how to get started in web development and design or for anyone who just wants to learn how to use Wordpress effectively.<p>I really enjoy designing websites and creating online businesses and now you can too.</p><em></em><em><span></span></em><em><span></span></em>", 
    "end_date": null, 
    "title": "Wordpress For Beginners: Create a Professional Website", 
    "price": "20.00", 
    "instructors": "Robin Haney", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507992_5955_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-create-a-website-with-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T10:46:52Z"
}