{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em><strong>Over 2800 students staying ahead of the changes in Wordpress security!</strong></em><br></p>\n\n<p>Learn the Latest Wordpress Security Strategies and Concepts From a Leading Expert with Years of Real World, Hands On Experience.</p>\n\n\n\n<p>Keep Your Wordpress Website Safe and Secure With Simple, Practical Techniques that Anyone Can Implement.</p>\n\n\n\n<p>Every hour of every day 30,000 Wordpress sites are being attacked by people who want to either damage those sites or take control of them.</p>\n\n\n\n<p>And the worse part is... 99% of all Wordpress Security incidents are entirely preventable.</p>\n\n\n\n<p>How do you keep your Wordpress site secure? </p>\n\n\n\n<p>In this course, I'll teach you the most effective things you can do to keep out the bad guys without having to become some kind of a security guru or spend tons of money for someone to do it for you.</p>\n\n\n\n<p>If you're like most Wordpress website owners, security is a complete mystery.  You want to keep your site secure, but your primary focus is on creating great content for your visitors.</p>\n\n\n\n<p>You probably also have seen and read reports about internet security breaches that occur, but you probably think that your site is too small to have a serious problem.</p>\n\n\n\n<p>The truth is, you couldn't be more wrong!</p>\n\n\n\n<p>Wordpress powers just over 20% of all websites on the internet today and staggeringly, 70% of those site, 140m sites, have exposures that could make it easy for an unscrupulous individual to hack their site.</p>\n\n\n\n<p>Modern security attacks aren't confined to defacing websites and stealing information, sophisticated groups of professional hackers are actively building up networks of millions of compromised websites.  They collect these sites to use as large scale attacks and cause serious damage.</p>\n\n\n\n<p>And if you're site is compromised, it could be contributing to this problem!</p>\n\n\n\n<p>Having your site compromised could result in:</p>\n\n\n\n<ul><li>Loss of income</li><li>Damage to your reputation</li><li>Stolen data or information</li></ul>\n\n\n\n<p>That's not even considering the cost and effort required to clean up a security problem.</p>\n\n\n\n<p>Wordpress Security doesn't have to be that hard.  With just some simple understanding of the risks and steps that you can take to mitigate them, you can prevent over 99% of all potential attacks.</p>\n\n\n\n<p>This course will help you put those numbers in your favour!</p>\n\n\n\n<p>I am going to share with you my 10+ years of hard earned, battle tested experience in managing Wordpress sites so that you can start making your websites more secure in minutes right away.</p>\n\n\n\n<p>But Wordpress and security in general are a moving feast and it is very hard to keep up to date on everything that's happening.</p>\n\n\n\n<p>And that's something that I'm going to solve for you by regularly updating this course with new videos.  As changes happen in the Wordpress landscape or something big occurs in the security world, I'll break it down for you in simple and easy to understand ways.</p>\n\n\n\n<p>This course is backed by Udemy's 30 day guarantee and my personal promise that for just a small investment of your time, you'll be shocked at just how easy it is to rapidly improve your Wordpress site's overall security posture!</p>\n\n\n\n<p>Every second you delay creates risk for you and helps tilt the odds in favour of your Wordpress site becoming one of the 30,000 sites that get attacked every hour, of every day.</p>\n\n\n\n<p>Enroll now and put the odds back in your favour!</p>", 
    "end_date": null, 
    "title": "Wordpress Security", 
    "price": "20.00", 
    "instructors": "Sean Kaye", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473338_72db_2.jpg", 
    "course_url": "https://www.udemy.com/easy-wordpress-security/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-11T05:53:10Z"
}