{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Have you heard of WordPress, but aren't really sure what it is, or what it can do?</strong><br></p>  <p>  \t        Perhaps you've been told you should build your website in WordPress because it is so easy - but you don't know a thing about it!  </p>  <p>  \t        Maybe you want to get started with WordPress but aren't sure if you should be using WordPress from the .org, or the .com website, or what the differences between them are.  </p>  <p>  \t        Or you've played around with WordPress, but have just ended up lost or confused!  </p>  <p>  \t        Well, I've got good news for you...  </p>  <p>  \t        Because this is <strong>the perfect course for you</strong>!  </p>  <p>  \t            This is a course for anyone that wants to know what WordPress is, what it can do, and enable you to decide whether it is the right product for <strong>you</strong> to choose to build a website with.  </p>  <p>  \t            This is <strong>NOT a technical course</strong>. It is a course designed to give you a good overview of WordPress, so that by the time you have finished it you will have a good understanding of what WordPress is capable of. Please note that this is a <strong>no fluff</strong>, <strong>no filler</strong>, <strong>no waffle</strong> course. I'm sure you are a busy person, and this course is designed to give you <strong>all the information you need to know</strong> about WordPress in as short a time as possible. Take this course, and <strong>30 minutes from now you will know <em>everything </em>you need to know about WordPress!  </strong>  </p>  <p>  \t<strong>Unsure if you should take this course? - Don't be. And here's why...</strong>  </p>  <p>  \t        This course comes with a 30 day, 'no questions asked', money back guarantee. So, if for <strong>ANY </strong>reason you aren't happy with the course, or don't feel it has delivered on it's promises, or hey - even if you just don't like my voice, you can ask for your money back, and get it - in full!  </p>  <p>  \t        And while you are here, you might as well click on the free preview lectures and try out the course content before you buy. They're free for you to try out.  </p>  <p>  \t        I hope to see you inside the course, and after you join feel free to ask me any questions you have inside the discussion area. I'd be happy to help.  </p>  <p>  \t        Join now. There is no reason not to. It's completely risk free!  </p>", 
    "end_date": null, 
    "title": "WordPress : An Overview", 
    "price": "20.00", 
    "instructors": "Chris O'Connor", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400280_1e8a_3.jpg", 
    "course_url": "https://www.udemy.com/what-is-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T17:42:47Z"
}