{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<h4 style=\"\"><strong style=\"\">Wordpress Fundamentals - Create a Dynamic Website</strong></h4>  <p style=\"\">  \t          Have you been looking for a web design course that will take you from beginner to professional in just 2 days? Are you struggling to find a course that teaches you how to code without knowing rocket science?  </p>  <p style=\"\">  \t          If your answer to those questions is yes, then this is definitely the course for you. We have built this course from the ground up, so that beginners can start creating robust applications that do more than just static content like business websites. You will understand what a MVC architecture is and how it applies to web development practices. You will learn why a dynamic website can make your life easier &amp; save you loads of time. You will learn how to manage a server and your application files, emails and content.  </p>  <h4 style=\"\"><strong style=\"\">Why our course is the best solution for you</strong></h4>  <p style=\"\">  \t                In our course we going to teach you the fundamentals to create a dynamic web application that&#039;s capable of building any website you could imagine, this will allow you to create thousands of websites and web apps over and over again using the same methods and skills we teach you. Once you understand how easily we can create websites using a CMS ( Content management system ) and dynamic architecture you will see professional results in just minutes, you will also have a fully working model to work with every time you start a new project.  </p>  <h4 style=\"\"><strong style=\"\">How can you Benefit taking this course</strong></h4>  <ul style=\"\">  \t<li style=\"\">Learn how servers work</li>  \t<li style=\"\">Make money building websites</li>  \t<li style=\"\">Learn to manage a CMS</li>  \t<li style=\"\">Learn Web Design &amp; Developement</li>  \t<li style=\"\">Understand API&#039;s</li>  \t<li style=\"\">Learn the difference between static and dynamic websites</li>  \t<li style=\"\">Start a Web Development business</li>  \t<li style=\"\">Two instructors will Help you become a professional Web Designer</li>  </ul>  <h4 style=\"\"><strong style=\"\">What makes our course better</strong></h4>  <p style=\"\">  \t           The problem with other courses is they don&#039;t teach you web development or design, they teach you how to follow exactly what they are showing you at the time. Once you complete the course you try to create your own applications or websites, only to find it doesn&#039;t work the same way that you were taught in the course. That&#039;s because every website or application is different and you will need different codes to achieve different results.  </p>  <p style=\"\">  \t<strong style=\"\">PLEASE NOTE THIS COURSE IS IN PROGRESS!! UPDATES ARE BEING MADE</strong>  </p>", 
    "end_date": null, 
    "title": "Wordpress Web Design Fundamentals - Create Dynamic Web Apps", 
    "price": "20.00", 
    "instructors": "Tammy Meyer", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317702_f64a_5.jpg", 
    "course_url": "https://www.udemy.com/wordpress-web-design-fundamentals-how-to-create-a-website-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-11T09:25:16Z"
}