{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em></em>This class picks up where the basic Shortcode Ultimate class left off and offers video lectures on the more powerful shortcodes to make you a complete expert with this plugin.</p><p><strong>Benefits of this Course:</strong></p><ul><li><strong></strong>Create the most beautiful web pages that previously only web developers could create without any code.</li><li>Transform your plain WordPress pages and posts into the most exciting web pages just by filling out a simple form for over 50 different shortcodes.</li><li>Combine the features and functionality of over 30 popular WordPress plugins into just one.</li><li>Create dynamic and awesome looking sidebar widgets with any shortcode from this plugin.</li><li>Learn how to add shortcode features globally to all posts and pages and get the code to add it to your theme or plugins.</li></ul><p><strong><br></strong></p><p><strong>What Kind Of Web Pages Can Be Created With the Shortcodes Explained In This Course?</strong><br></p><p>The following list is just a partial set of the most advanced and powerful features that you can add to any WordPress page or post:<br></p><ul><li>animation</li><li>private member content</li><li>QR codes</li><li>Google Maps</li><li>scheduled content that displays only at certain hours or days of the week or even on any holidays. For example, which your website visitors Merry Christmas on December 25 of every year without coding the website to recognize the date.</li><li>tooltips</li><li>RSS feeds</li><li>lightboxes</li><li>dummy images and text</li><li>many more</li></ul><p><span></span></p><p><strong>How Is This Course Presented?</strong></p><ul><li>I explain in each video lecture how to fully fill out the form for each shortcode and exactly what data you need to enter.</li><li>Projects are available to exercise your knowledge and creativity with each shortcode.</li><li>Quizzes test your knowledge and reinforce the concepts presented.</li></ul><p><br></p>", 
    "end_date": null, 
    "title": "WordPress Shortcodes Ultimate Advanced Expert", 
    "price": "20.00", 
    "instructors": "Bruce Chamoff", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/740348_5a40_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-shortcodes-ultimate-advanced-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-24T22:33:22Z"
}