{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">In this course, we&#039;ll go through the key steps required to get your Wordpress website up and running, from purchasing your domain and hosting, through installation, to content creation and themes. </p><p style=\"\"><strong style=\"\">Learn Wordpress Basics and Build Your Own Website</strong></p><p style=\"\">Starting with nothing more than basic computer skills, internet access and a web browser, by completing this course and the accompanying activities, you&#039;ll have learnt the tools you need to create a functioning Wordpress website with rich text and media content:</p><ul style=\"\"><li style=\"\">Learn how to register your domain and purchase hosting</li><li style=\"\">Be able to install Wordpress to your new domain</li><li style=\"\">Find out how to navigate key areas of the Wordpress Dashboard and adjust basic settings</li><li style=\"\">Create Posts and Pages featuring rich text and media content </li><li style=\"\">Learn how to search for and install an existing Wordpress Theme</li></ul>Complete the course activities as you progress through the course to get your Wordpress website up and running.<p style=\"\"><strong style=\"\">Who is the course for?</strong></p><p style=\"\"><strong style=\"\"></strong>This course has been created for bloggers and small business owners in particular, to help you get your Wordpress website up and running without employing the services of a professional web developer.</p><p style=\"\"><span style=\"\"></span>Learn from a self-taught small business owner and blogger - for people who want to keep it simple, building a website without getting too technical.</p><p style=\"\"><strong style=\"\">What Do You Need to Get Started?</strong></p><p style=\"\">All you need is basic computer skills, internet access and a web browser!</p><p style=\"\">The course starts with purchasing a domain and hosting, followed by installation of Wordpress, adjusting key settings and then we&#039;re set! The next stage is Content Creation, customising the Appearance of your website using Themes and Widgets and then finally, we&#039;ll go through a few steps to take for ongoing maintenance.</p><p style=\"\">Course sections feature activities to help you put the knowledge you&#039;ve picked up throughout the course to use.</p><p style=\"\">By the end of the course you&#039;ll be equipped with the knowledge and tools you need to get your Wordpress website up and running!</p><p style=\"\">Subscribe to our e-mail list now for exclusive offers &amp; discounts!</p>", 
    "end_date": null, 
    "title": "WordPress for Beginners: Build Your Own Website", 
    "price": "25.00", 
    "instructors": "Nisha Lakhani", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/568382_0927_3.jpg", 
    "course_url": "https://www.udemy.com/beginners-wordpress-in-under-60-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T16:02:32Z"
}