{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>WordPress is the hottest CMS available on the web.There are hundreds of jobs posted each day online with clients seeking WordPress developers. It's popularity is due to the fact that there are thousands of plugins and themes available online.<strong> There's a lot of money to be made with this industry and I will show you how.</strong></p><p>This course will help make you into one of the most competitive WordPress developers out there. You will be able to develop custom plugins and themes no matter how hard the task is.</p><p>We'll explore the various WordPress APIs and how they should be used. The codex page is filled with examples and each page is quite lengthy. WordPress development doesn't have to be hard to learn. The biggest \nmistake most coding tutorials make is expecting someone to learn simply \nby imitating others' code. Real world situations are never exactly like \nthe tutorial.</p><p>  \t                                             \n                                                                        \n                                                                        \n                                                                        \n                                                                        \n                                                                        \n                                                                        \n                               I believe the best way to learn is to \nunderstand how a tool works and what it does for you, look at examples, \nand then try it yourself. That's how this course is built, with the goal\n to help you both <strong>learn </strong>and <strong>understand </strong>WordPress.  </p><p>You will also be taught <strong>how to sell your plugin online and make a profit. </strong>This includes licensing and learning about the various platforms out there to help you with marketing.</p>", 
    "end_date": null, 
    "title": "WordPress Development - Create WordPress Themes and Plugins", 
    "price": "20.00", 
    "instructors": "Luis Ramirez Jr", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576054_7e88_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-development-create-wordpress-themes-and-plugins/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-06T21:22:24Z"
}