{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<strong></strong><p><strong></strong><strong></strong><strong></strong>---------------------------------------------------------------------------------------------------------------------------<br>This course receives continuous updates !! The Price will be adjusted as well<br>---------------------------------------------------------------------------------------------------------------------------</p><p><strong>This absolute Course introduces to you the best Wordpress Plugins that will bring your Wordpress projects forward.</strong></p><p>In this course you are going to learn how to use the very most influential and useful Wordpress Plugins that will transform your Wordpress Website into whatever you want it to be:</p><ul><li>An Onlineshop that let's you start selling physical or digital products immediately</li><li>A Booking System for your Hotel, Hostel, City Tour, Barber Shop Parlour, etc.</li><li>A Forum to get your community engaged in topics you are strong in</li></ul><br>You will learn where to get the most brilliant and useful Wordpress Plugins. You will also see every single step how to properly install and integrate them into your Wordpress Installation. This course covers a range of Free and Premium Wordpress Plugins.<br><span></span><br>Which Plugins are you going to learn about:<ul><li>Woocommerce Online Shop - the number 1 shop system for Wordpress</li><li>Checkfront Booking System - a powerful Booking Back- and Front end for Wordpress</li><li>Visual Composer Page Builder</li><li>Page Builder by Site Origins</li><li>Revolution Slider 5 - the most advanced Slider Plugin for Wordpress</li><li>MailChimp Newsletter Sign Up Forms and List Management</li><li>Contact Form 7 - </li><li>Easy Google Fonts - Manage and Customize all fonts on your Website</li><li>BBPress - Set up a personal Forum on your Website</li><li>SEO Yoast - Instant Feedback how your page ranks for certain Keywords<br>...<br>This list will be continuously updated!!</li></ul>After taking this course you will not depend on expensive Wordpress Experts anymore to bring your Online Business forward. You will be able to do 80% to 100% of the work on your Wordpress Website yourself, Because you will be the Wordpress Expert yourself!! :)<p><br>What you need to know:<br></p><ul><li>You should have a simple own Wordpress Website</li><li>You should know how to setup a Wordpress Website on your own<span></span></li><li>You should have clicked a bit around in the Back end of Wordpress</li></ul><p><br>Who is this course for:<br></p><ul><li>Beginners and Advanced Users of Wordpress who want to become more independent</li><li>Starters of Web Development who want to bring their Wordpress Projects forward</li><li>Anyone who likes to learn about great tools and want to become a Wordpress Hero</li></ul><br>The best thing about this course is that it will be continuously updated with content about the latest and most useful Wordpress Plugins on the market. Wordpress is so dynamic and daily new fantastic Plugins are released. So as soon as I discover some gems for you, I will sit down and create another learning video for you! <p><br>My Promise to you:<br></p><ol><li>You get Frequently Updated content about Wordpress Plugins</li><li>You get Personal Wordpress Support and Guidance of myself</li><li>You benefit from my long experience in Wordpress</li></ol><br>Enrol now and start your own fantastic Web Project with Wordpress! :)", 
    "end_date": null, 
    "title": "Wordpress Plugins that will transform your Website", 
    "price": "20.00", 
    "instructors": "Jonas Schindler", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630528_7d48_3.jpg", 
    "course_url": "https://www.udemy.com/top-wordpress-plugins/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T16:38:23Z"
}