{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Learn Wordpress and Web Development with this amazing Example</strong></p><p>In this course you will see how a modern and professional Website is built in Wordpress. I am convinced that learning is much more efficient if you learn from practical examples. This is why I won't bother with any boring encapsulated lessons. All you learn is part of the greater project Website.</p><p>From the very beginning to the completely finished Website I show you every single step.</p><p>There are 4 steps that you need to cover to bring your personal Website online:</p><ol><li>Getting quality and reliable Web Hosting</li><li>Installing Wordpress on the Webspace</li><li>Adding a fantastic Theme</li><li>Making the Website</li></ol><p>All these steps are covered in very detail in this course. There is no step skipped, you will see exactly where to click and what to do. So no need to worry about any confusion.</p><p><strong>Creating Stunning Layouts<br></strong></p><p>The Website that we build in this course is so appealing because the structure of the visual elements is \"candy for the eye\" :). With the amazing Page Builder Visual Composer there are barely limits to what you can do to your Wordpress Website.</p><p><strong>Adding Beautiful and large Images</strong></p><p>A modern Website needs beautiful and large images that appeal to the visitors. Getting these image resources is usually very expensive, but I show you where you can get amazing images for your Web Projects for free.</p><p><strong>No Coding Skills Required</strong></p><p>We will not write a single line of HTML or CSS to build the great Project Website.<br><br>All the resources you need to download for this course are available through links in the lectures. Some of the links will provide you some extra discount.<br></p><p><strong>Personal Support</strong></p><p>If you have any problems or questions, whether they are technical, logical, about the understanding or anything else I will be around to bring your Projects forward. Also if you require more guidance in some Web Project I can offer you full assistance for a very good price. Just let me know!<br><br>The earlier you start this course the quicker your business will be visible to world! </p><p>Enrol now! I am looking forward to welcome you in this course.</p>", 
    "end_date": null, 
    "title": "Wordpress - Create an Outstanding Website in 2 hours", 
    "price": "30.00", 
    "instructors": "Jonas Schindler", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651032_2502_4.jpg", 
    "course_url": "https://www.udemy.com/wordpress-business-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T08:11:04Z"
}