{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Developing WordPress plugins is hard and you’ll get <strong>CONFUSED </strong>and <strong>LOST</strong></p><p>You may THINK that is true - and this is exactly what I thought</p><p>But - you know what I found?</p><p>Developing your own WordPress Plugins is <strong>EMPOWERING</strong>. Using plugins you can now bend the WordPress platform completely under YOUR command!</p><p>When I first started looking into what plugins are available I was disappointed </p><p>I STRUGGLED with finding usable plugins.</p><p>Many of them don’t work and those that DO work often don’t deliver to the exact demands me or my CUSTOMERS have</p><p>Then it got worse…</p><p>I spent a LOT of time and effort trying to hack my way through the WordPress codex </p><p>WAY too much time!</p><p>Finally I have discovered simple <strong>STEP by STEP </strong>methods to create a highly USABLE plugin - methods that you can use in YOUR OWN projects or even put on the market!</p><p>I’ll be your tour-guide throughout this FUN adventure - I will WALK with you through the methods that I use to build fully integrated WordPress Plugins!<br></p><p>I am <strong>EXCITED </strong>to see that you have started your own journey into the world of ADVANCED web site development!</p><p>In this course I’ll lead you - step by step - focusing on the most IMPORTANT and difficult tasks you need to complete!</p><p>My promise to you is this:</p><ul><li>Discover the 5P step-by-step method to <strong>PREPARE - PLAN - PROTOTYPE - PRODUCE </strong>- and finally <strong>PROFIT </strong>from a solid plugin</li><li><span></span>Create a fully working WordPress Plugin using <strong>PHP </strong>and <strong>MySQL</strong>.</li><li><span></span>Take the ready made plugin and <strong>CUSTOMIZE </strong>as you like. Use for your own website or sell as part of a BIGGER solution to local clients where you can charge hundreds or even THOUSANDS of dollars!</li></ul><p><br></p><p>This How-to course is fast-paced - so hold on as we SPEED ahead. If you feel I am going too fast - just rewind the video and watch it again :)</p><p>By following the lectures carefully, you can get a job as a web developer or even sell full featured websites to high-paying customers.</p><p>Does this sound exciting?  </p><p>...</p><p>So - Let’s get started<br></p><p>Enroll now!</p><p>There is absolutely no risk when purchasing with the full 30 day money back guarantee.</p><p>And - I’ll throw in these bonuses:</p><ul><li><strong>Download the full code for the working plugin we develop<br></strong></li><li><strong>Get the WordPress plugin Cheat Sheet - with tips and tricks for the most used functions<br></strong></li><li><strong>Invitation to a live Q&amp;A where you can dive even DEEPER </strong></li></ul><p>Just hit the BIG BLUE take this course button and get started!</p><p>I can’t wait to see those <strong>AMAZING WordPress plugins</strong> that you’ll create using these methods! </p><p>IMAGINE having your own Plugin up and running TODAY, right after going through this course - and be EARNING big - soon after that!</p><p>Don’t get left behind - <strong>ENROLL NOW</strong> and invest in your future</p><p>Feel the power this NEW skill set will give you.  </p><p><strong>Take this course now!</strong></p>", 
    "end_date": null, 
    "title": "WordPress Plugin Development -> Deep dive discovery!", 
    "price": "20.00", 
    "instructors": "Thrandur Arnthorsson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570848_9555.jpg", 
    "course_url": "https://www.udemy.com/wordpress-plugin/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-01T12:11:29Z"
}