{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn how to create a WordPress theme from ground-up. Create custom forms and Shortcodes. Face real-world challenges and learn tips-tricks. This course teaches you a very practical way to create your own theme.<br></p><p><strong>On the job like development, examples from real-word practices<br></strong>The course is taking you through a real world development process. From basic to advanced theming and functionality. You will also learn how to use Ajax and create forms with and without Ajax. Again, no plugin used. We will also cover basic form security provided by WordPress. During development you will learn how to avoid some glitches and take full control of entire theme.</p><p><strong>A complete Project, not just theme development</strong><br>It is a complete project development training rather than developing some just for training or demonstration purpose. I have imagined a fictional client and put everything you needs during developing a regular corporate introductory or personal projects.</p><p><strong>Describes every theme concept in detail</strong><br>Learn concepts like WordPres Template Hierarchy, form validation and security, custom sidebars, search, pagination and custom menu. </p><p>You will also learn creating various types of forms, use WordPress functions to secure and validate form data. Utilize Ajax helpers provided by WordPress.</p><p><strong>From installation to deployment</strong><br>Take you through basic installation to deployment on production server, without any plugin.  We are describing deployment on a shared LAMP server. Each step described in detail. Also, learn how make you WordPress site secured. </p><p><strong>Overview of content</strong><br></p><ul><li>Basic of WordPress installation and settings</li><li>Theme concept and template hierarchy</li><li>Multiple page layout</li><li>custom sidebars and menu</li><li>Banners and headers customization</li><li>Search and pagination</li><li>Custom forms and Ajax</li><li>Shortcodes</li><li>Script and style enqueue </li><li>Deployment and security</li><li>Customize Comment Form</li></ul><strong><p><strong>Who should take this course</strong><br></p></strong><ul><li>WordPress Developer</li><li>Web designer or PHP programmer want to create WordPress theme</li><li>Anyone with basic HTML, PHP and WordPress skill, who wants to learn how to create a WordPress theme without any template or plugin</li></ul>", 
    "end_date": null, 
    "title": "Wordpress Theme Development From Scratch - Complete Project ", 
    "price": "20.00", 
    "instructors": "Aryan Kumar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611428_8ed7_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-theme-development-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T07:43:39Z"
}