{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>WordPress lernen kann ganz einfach sein.</strong> Mit WordPress kann man erfolgreiche Internetseiten, Homepages, Blogs, Portfolios und Online Shops bauen! Dass dies ganz einfach sein kann, habe ich schon mit meinen Videos auf YouTube bewiesen, die in wenigen Monaten auf Platz 1 gelandet sind. Auch mit SEO-Praktiken werde ich meine Videos um Mehrwerte anreichern. Alle Aktionen, die in den Videos gezeigt werden, sind mit SEO und Sicherheit im Hinterkopf ausgearbeitet worden. Somit kann man sich ganz leicht auf die wesentlichen Sachen konzentrieren und sofort anfangen eine Website zu erstellen, die Kunden und Einkommen generiert. <span></span></p><p><strong>Kerninhalte werden sein: </strong></p><p>- WordPress installieren und einrichten auf einem Host</p><p>- WordPress auf dem lokalen Computer installieren (kostenlos)</p><p>- Mit einem kostenlosen Theme eine Website aufsetzen</p><p>- Mit dem BeTheme, dem Impreza Theme eine Website aufsetzen</p><p>- Inhalte bearbeiten (Kopfbereich, Hauptinhalt, Fußbereich) </p><p>- Von Beginn an: SEO-Basiseinstellungen vornehmen; vor allem mit SEO by Yoast</p><p>- Beiträge und Seiten SEO-Optimiert gestalten (sodass Sie bei Google besser und häufiger angezeigt gefunden) </p><p>- Kontaktformulare einbinden</p><p>- kostenlose Newsletter Formulare mit Mailchimp integrieren</p><p>- Backups der WordPress Seite nehmen</p><p>- WordPress Sicher machen durch WordFence und anderen Security Plugins</p><p>Ein Augenmerk habe ich darauf gelegt, dass man diesem ersten Kurs ohne Kosten folgen kann. Auch wenn es empfehlenswert ist ein Premium-Theme, sowie eine von überall erreichbare Website zu besitzen. </p><p>Melde dich noch heute für meinen Videokurs an. In dem Videokurs habe ich <strong>andere und neue Elemente als auf YouTube </strong>eingebaut. Dieser Kurs ist also ergänzend und aufbauend. </p><p>Der \"Weiße WordPress Gürtel\" baut ein Verständnis zu dem meistgenutzten Content Management System (System um Websites zu erstellen) auf. Es werden Grundlagen<strong> OHNE HTML UND CSS </strong>vermittelt. Für HTML und CSS im Bereich WordPress wird es noch Folgekurs geben. Aber dieser Kurs muss sich Grundlagentechnisch so von Folgekursen abgrenzen. Jeder muss diesen Kurs <strong>OHNE VORKENNTNISSE </strong>belegen können. Darauf habe ich als Autor ein besonders Augenmerk gelegt. </p><p>Falls weiterer Hilfebedarf besteht, ist immer die Möglichkeit gegeben über Udemy Fragen zu stellen. Auch steht es jedem zur Verfügung sich auf cmsVideos in meinem Forum anzumelden und öffentlich Fragen zu unter anderem den Themen WordPress, SEO, Impreza, BeTheme zu stellen.  </p><p><strong>Viel Erfolg mit eurem Blog, eurer Website, eurem Online-Shop mit WooCommerce oder eurer Unternehmenswebsite MIT WORDPRESS!</strong></p><p>Vielen Dank für den Kauf dieses WordPress Kurses und somit für die Unterstützung,</p><p>Happy Learning, und 100% Motivation, </p><p>Euer Malte Helmhold</p>", 
    "end_date": null, 
    "title": "WordPress Websites erstellen - Die Anleitung für Beginner", 
    "price": "25.00", 
    "instructors": "WordPress, SEO & Programimerung Malte Helmhold", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629514_2229_4.jpg", 
    "course_url": "https://www.udemy.com/weisser-wordpress-guertel/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-03T09:27:44Z"
}