{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This step-by-step course will teach you how to setup, run and use <strong>Wordpress</strong>. When you are finished with this course you will know how to use WordPress and move on in the direction you want. For example, building a business website, blog or even eCommerce store. </p><p>In this very to the point course you will learn <strong>everything </strong>you need to master WordPress. In just over a hour of content you will know how to create pages, posts and install themes or even plugins. This will help you in your WordPress journey. </p><p>This course will be <strong>updated </strong>regularly with the newest WordPress updates or even new lectures. For now this course will answers all you basic question about WordPress. In the f</p><p>But there is more. If you want, I <strong>create</strong> a lecture specially for you! Yes, that is right, you can send me a message and I will record as many lectures needed to help you. That request can be for a specific theme, plugin or function in WordPress.<br><br>There are so many <strong>plugins</strong> and extension available for WordPress it is very difficult for me to please all of you right from the start. So do not hesitate to contact me, i will make sure I deliver and i will deliver within a week.</p><p>Have fun with my course, if you have any questions, suggestions or feedback please do not hesitate to contact me though Udemy or directly. </p><p><br></p>", 
    "end_date": null, 
    "title": "WordPress Basics: Learn WordPress in one hour!", 
    "price": "20.00", 
    "instructors": "Patrick Gerrits", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766348_7fa9_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-basics-learn-wordpress-in-one-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T09:10:31Z"
}