{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Been scratching your head wondering why your Website is slow + your conversions are low?</p><p>Never take a so-called expert's word about this again.</p><p>During this course, you'll master all the tools to pros use to do site analysis audits + you'll discover what all these tools really tell you, in plain language.</p><p>You'll discover how fast + easy it is to answer basic money site questions like...</p><p>Is my site fast or slow? If it's slow, where are the bottlenecks + potential fixes?</p><p>Is my site secure? Does my site have exploit vectors (how hackers get in) that allow a hacker to take control of my site or siphon data from my site? If there are any exploits, what are potential fixes? And once fixed, how to I close all the holes that got me in this jam in the first place?</p><p>Is my site SEO friendly? Can Spiders ingest my site + make sense of my content? If not, how do I fix this?</p><p>Same with browsers? Is my site browser neutral? In other words, will all browsers see some semblance of my content for every visitor, all the time?</p><p>Is my site Mobile friendly? Is my site responsive + does it render fast on all phones + tables, independent of device operating system - Android + iOS + Java? Also is my site network + battery optimal or will my site fire off warnings about overrunning people's data plan + draining their battery life? If not, how do I fix all Mobile Unfriendliness?</p><p>And, now that you know what's wrong + have an idea of how to fix it + once it's supposedly fixed, you can retest your site to make sure all work was done correctly... What's the checklist of criteria all developers must meet before they are paid?</p><p>Excited about boosting your conversions + cashflow, then this course is for you!</p><p>I'm looking forward to working with you!<br></p><p>Here's to your success,</p><p>David Favor</p>", 
    "end_date": null, 
    "title": "WordPress Analysis Masterclass - Speed Security SEOity", 
    "price": "20.00", 
    "instructors": "David Favor", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496914_ea28_3.jpg", 
    "course_url": "https://www.udemy.com/wordpress-site-analysis-masterclass-speed-security-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-08T16:41:05Z"
}