{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">In this WordPress Security course you will learn how to backup, secure and protect your WordPress site against Hackers.</strong></p>\n\n<p>In a typical brute force attack, several machines or bots try to guess the username and password for a site one at a time. In a brute force amplification attack, attackers can guess hundreds or thousands of combinations within a single request making the attack more efficient and difficult to block.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How do you know your WordPress site is safe and secure against brute force amplification attacks or any other form of attacks? </strong><strong class=\"redactor-inline-converted\">What WordPress plugins should you use to protect your WordPress site?</strong></p>\n\n\n\n<p>Without proper implementation of WordPress security plugins your site will become vulnerable and could easily be hacked without your knowledge.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What if your WordPress site is not looking normal or there’s a system failure?</strong></p>\n\n\n\n\n\n<p>I'll demonstrate the proper WordPress security plugins you should use to keep your site safe and intact.</p>\n\n\n\n\n\n<p><em>I'll show you how to secure your WordPress site using the best security plugins available to you. </em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In this course you can test and download the latest security plugins to protect your WordPress site.</strong></p>\n\n\n\n\n\n<p>I’ll show you what steps you must take to prevent a hostile takeover of your WordPress site!<br></p>\n\n\n\n<p>Protect your WordPress site against malicious attackers and by the end of the course you’ll have the peace of mind knowing that your sites are monitored 24/7.\n</p>\n\n<p><strong>These simple WordPress security actions will safely secure your WordPress site. You will be able to:</strong></p>\n\n\n\n\n\n<ul><li>Regularly schedule backups</li><li>Schedule malware scanning</li><li>Enable Two Factor Authentication for better WordPress security</li><li>Lock out bad users and automatically ban admin username hosts</li><li>Force ONLY strong passwords to be used on your WordPress site</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>One of the main reasons WordPress sites get hacked in the first place is because many first time users install their WordPress site and just forget about it.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I created this WordPress security course for freelancers, designers and developers just like you. You probably manage your own WordPress site and your client's sites.</strong></p>\n\n\n\n\n\n<p>You will not have to worry about hackers gaining access to your WordPress site or any of the other WordPress sites you manage because you will be 10 steps and beyond ahead of everybody else who does absolutely nothing to add extra protection to their WordPress sites.</p>\n\n\n\n\n\n<p>This WordPress security course will provide you with all the tools you need to get you started. I’ll show you what plugins you need to download. You can also download the plugins directly from this course included as a resource for all students in this course. And in a worst case scenario I’ll show you what you should do if your site has been hacked.</p>\n\n\n\n\n\n<p>Throughout this WordPress security course I’ve broken it down into a step by step process that you can follow with me and protect your site as I’m protecting my own WordPress website.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">There are four sections in this WordPress security course that cover everything you need to do to secure your site.</strong></p>\n\n\n\n\n\n<p>The very first thing you will do is a few simple security exercises.</p>\n\n\n\n\n\n<p>Then, I’ll show you how to backup your WordPress site the easy way.</p>\n\n\n\n\n\n<p>After you’ve backed up your site, in the third and final sections of this course, you'll focus on  WordPress Security.</p>\n\n\n\n\n\n<p>I’ll walk you through each step to secure your site.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Everything I teach in this course is based on proven WordPress security tactics to prevent hackers from penetrating your WordPress site. I use these techniques on all of my sites and my client sites.</strong></p>\n\n\n\n\n\n<p><em>The skills that you will learn, to secure, backup and protect your site, are the same techniques that I’ve successfully used over the past few years and I’ll show you what you need to do to accomplish this.</em></p>", 
    "end_date": null, 
    "title": "WordPress Security - Secure, Protect and Backup Your Site", 
    "price": "20.00", 
    "instructors": "Susan Cork", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648882_5ea7_2.jpg", 
    "course_url": "https://www.udemy.com/secure-protect-and-backup-your-wordpress-site-from-hackers/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T14:42:50Z"
}