{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Course Last Updated 23 January 2016</strong></p><p><strong>Added a new lecture titled: </strong>Extra Added Security<strong></strong><br><strong></strong></p><p><strong>FREE Web Hosting Account to Students</strong><br></p><p>Starting December, I have started to give my students enrolled in my WordPress Security course free web hosting account in order to test what they have learnt. This is a great way to try different plugin's and methods without having to try it on your live website. I will also show you an easy way to copy your live site into the testing environment.<br></p><p>WordPress 'The Ultimate <strong>Security </strong>Guide' is designed for any <strong>WordPress </strong>novice and professional alike. Anyone that is actively using or thinking of using WordPress as a platform in terms of a website or a blogging platform needs this course to empower them to take control over their site and hosting platform  </p>    <p>  \t                              The aim of this WordPress course is to take a complex and frustrating subject for most and turn it into easy and an enjoyable task.  </p>  <p>  \t<strong>Securing your WordPress website</strong> is not easy and can be a very daunting experience so I am going to try and make it as easy and as simple as possible.  </p>  <p>  \t                              So if you have a website powered by WordPress or thinking of building one any time soon, then this is a must have course for sure.  </p>  <p>  \t                              In this course, I will go through free and paid tools to secure your WordPress website, it is you that can determine what to use based on your need, budget and required functionality. Over all, it is how much you care about your site and its success over time.  </p>  <p>  \t                            I will demonstrate a <strong>live hacking attempts </strong>into a WordPress website to show you how easy it is to hack.  </p>  <p>  \t                              I will also be at hand to help you in the student forum section of my course to give you a helping hand if you get stuck, as well as share resources and ideas with you and answer any question you may have.  </p>  <p>  \t                              As we progress in the course, if you need further verification or additional video's to cover a particular topic, just shout. This course is designed to be interactive and an evolving course.  </p><p>  \t<strong>** No Technical Knowledge Required **</strong>  </p>  <p>  \t<strong> START this course TODAY and SECURE your FUTURE tomorrow</strong></p>", 
    "end_date": null, 
    "title": "WordPress Security - The Ultimate Security Guide", 
    "price": "20.00", 
    "instructors": "Khalid Hamadeh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339086_5275_5.jpg", 
    "course_url": "https://www.udemy.com/wordpress-the-ultimate-security-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T06:41:37Z"
}