{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t          Этот курс предназначен для новичков в сфере интернет-технологий. И если вы - именно тот, кто хочет сделать себе сайт самостоятельно, тогда этот курс как раз для вас. Вот что мы с вами будем делать:  </p>  <ol style=\"\">  \t<li>подробно разберём вместе основные понятия сети Интернет;</li>  \t<li>рассмотрим структуру CMS &quot;Wordpress&quot;;</li>  \t<li>научимся регистрировать домен и управлять хостингом своего сайта;</li>  \t<li>изучим, какие материалы и как можно публиковать с помощью CMS &quot;Wordpress&quot; на своем сайте;</li>  \t<li>рассмотрим большое количество дополнительных модулей, расширяющих функционал вашего сайта;</li>  \t<li>подключим систему сбора статистики и начнем получать обратную связь от своего сайта;</li>  \t<li>интегрируем свой сайт с социальными сетями;</li>  \t<li>научимся защищать свой сайт от потенциальных атак;</li>  \t<li>настроим автоматическую архивацию сайта с определенной периодичностью.</li>  </ol>  <p>  \t         В курсе используются видеоматериалы высокого качества. Курс последовательно показывает этапы создания настоящего сайта &quot;с нуля&quot; и без программирования, а также рассказывает о тех тонкостях, которые необходимо учесть после создания сайта.  </p>  <p>  \t<strong style=\"\">Обновление от 28 мая 2014 г.: </strong>после окончания изучения каждого раздела вы можете пройти тест для самопроверки.  </p>  <p>  \t         Материал основан на многолетнем использовании автором курса CMS &quot;Wordpress&quot; в практической деятельности для создания как своих сайтов, так и на заказ.  </p>  <p>  \t *****  </p>  <p>  \t This course is designed for beginners in the field of Internet technologies. And if you - the one who wants to make a site of your own, then this course is for you.  </p>", 
    "end_date": null, 
    "title": "WORDPRESS: сделайте свой сайт сами", 
    "price": "20.00", 
    "instructors": "Evgeniy Solovey", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/160910_9fe2_7.jpg", 
    "course_url": "https://www.udemy.com/make-your-site/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-10T10:42:18Z"
}