{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>** Updated with 7 new videos teaching you the new Cornerstone update. In these videos you will learn everything you need to know about Cornerstone, as well as how to build a landing page with X **</p><p>Create websites that will look great on any device, increase traffic, convert customers and increase sales... without any prior experience or code!</p><p><strong>Learn step-by-step how to create professional responsive websites, with X theme for WordPress.</strong></p><p>With X, you can create every kind of website you can imagine without knowing how to code.</p><ul><li>e-commerce stores</li><li>one page sites</li><li>membership sites</li><li>social networks</li><li>portfolio</li><li>blog</li><li>business</li><li>and much more!</li></ul><p>Having a professional website and online presence is crucial for you and your business. Having a site that also looks great on every device is even more so, since <strong>o<em>ver 50% of the Internets traffic now takes place on mobile devices.</em></strong></p><p>If you are looking to create a site for yourself, your business/startup, or even earn extra income developing sites for clients, than this course is for you! You do not need to have any prior experience creating websites or even know how to use WordPress. In this comprehensive course, I will walk you through each and every step. In addition, I have jam packed this course with <strong>free design resources</strong> to help you create original content for your site.</p><p><strong>In this course, I will teach you:</strong></p><ul><li>How to create stunning custom responsive websites with X.</li><li>Provide you with free design resources... stock photos, graphics, video backgrounds, icons, fonts, and much more.</li><li>How and where to purchase a domain name.</li><li>How to purchase and setup hosting for your site.</li><li>How to get your site live on the Internet.</li><li>All of my favorite free WordPress plugins and why you should use them too.</li><li>SEO optimization, Google analytics, &amp; how to make your site fast!!</li></ul><p>By the end of this course, you will have obtained all of the knowlege and resources necessary to create your own stunning responsive websites.</p>", 
    "end_date": null, 
    "title": "X theme for WordPress: Responsive web design without code!", 
    "price": "20.00", 
    "instructors": "Robert Guss", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440006_777f_8.jpg", 
    "course_url": "https://www.udemy.com/x-theme-for-wordpress-responsive-websites-without-code/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-06T00:02:11Z"
}