{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Using XNA, you can get up and running with 3D graphics development in no time, and you will quickly start developing fun gaming experiences. Developing a 3D graphics engine can be very rewarding when done right; learn how to get an immediate payoff so you can focus on developing your game. This course includes videos on shader development, coding for extensibility, scene construction, and multi-platform game development.</p><p>XNA 3D Toolkit will walk you through all the information you need to develop a 3D graphics engine. Along the way, you will learn how to deal with a complex game scene and how to incorporate and work with in-game debugging tools. This is a great series for anyone who wants to get an in-depth view of how to design 3D graphics using XNA.</p><p>Starting from scratch, with this course you&#039;ll learn all the building blocks needed for developing a cross platform 3D graphics engine. You&#039;ll build upon this until you have a sound infrastructure that will allow you to quickly implement the functionality needed for your future games.</p><p>XNA 3D Toolkit helps you learn how to effectively work with models, providing you with the ability to go from concept to scene. You&#039;ll learn how to display your models many times on the screen without wasting memory, as well as making them look ultra realistic. You will then move on to creating a basic foundation for physics and shaders to get the most out of your engine. Once everything is in place, you&#039;ll learn how to add all of your content to a scene to produce a high-quality effect. Lastly, we will ensure that your game is ready for the real world by deploying it to the Xbox and Windows Phone Emulator.</p><p>By the end of this course, you should be comfortable using all the tools necessary to start creating your very own 3D video games.</p><p><strong style=\"\">About the Author</strong></p><p><strong style=\"\">Dustin Heffron</strong> is an avid gamer and programmer. He has over 8 years of experience programming in various languages and environments including Linux, Windows, embedded systems, and various consoles. He has been working with XNA since version 2.0 and has created everything from 3D military applications to small 2D games. Dustin currently works for Johnson Controls where he creates a variety of tools to integrate with AutoCAD to facilitate the design of HVAC equipment. He is also currently working on a variety of different game projects using Monogame. Dustin has previously helped Packt as a technical reviewer for the book XNA 4.0 Game Development by Example and the video series 3D XNA Game Development by Example.</p><p></p><p><strong style=\"\">Larry D. Louisiana</strong> has worked as Lead Software Developer at Magenic since 2010. He is a self-taught programmer with a dual bachelor&#039;s degree in Biology and Chemistry from Minnesota State University in Moorhead. Larry is an accomplished problem-solver who has published peer-reviewed research in synthetic chemistry. Larry is a Minnesota native who spent his summers working on a family carnival and his winters working in a sawmill. He is an outdoor enthusiast with formal training in forestry and fire fighting. His hobbies include gaming, abstract mathematics, and fishing.</p><p>Larry is currently a Software Consultant at Magenic as well as a Microsoft Gold Partner, where his main focus has been developing, architecting, and leading teams of developers working on web and business applications using Microsoft technologies.</p>", 
    "end_date": null, 
    "title": "XNA 3D Toolkit", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543058_0dda_3.jpg", 
    "course_url": "https://www.udemy.com/xna-3d-toolkit/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T12:09:31Z"
}