{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Bu kurstaki  videoları izleyerek sıfırdan web sitesi kodlama ve tasarımı üzerine eğitimler alabilirsiniz.</p><p style=\"\"> Kurs içeriğinde Adobe Dreamweaver, Adobe Photoshop, Adobe Fireworks, Adobe Flash progmları üzerinden video eğitimler ile kendi başınıza web sitesi yapma yeteneği kazanabilirsiniz.  </p><p style=\"\"><strong style=\"\">Web Tasarım Kursunun Faydaları Nelerdir?</strong></p><p style=\"\"><strong style=\"\"></strong><strong style=\"\"></strong>Web tasarım eğitiminde, internet ortamında yaratıcı fikirlerinizi görsel bir platformda web tasarımı programlarından destek alarak sunabilirsiniz. Hazırladığınız web sitenizi bütün yada parçalı olarak editör program Dreamweaver&#039;a html mantığında kavrayarak internet ortamında yayına hazır duruma getirebilirsiniz.Sitenizin bir tablo görünümünde olmasını sağlayan 3 boyutlu arayüz tasarımı ile efektli buton tasarımı Adobe Photoshop&#039;ta hazırlayabilirsiniz.</p><p style=\"\"> Aynı zamanda sitenizin estetik ve görsellikle birleştiği bir arayüz tasarımında hareketli banner, rollower ve popup butonlarından oluşan içeriği Fireworks&#039;de hazırlayabilirsiniz. Web sitenizin hareketli, eğlenceli, dinamik ve ilgi çekici olmasi için, hareketli bir görsellikle müziğin yer aldığı animasyonlu içerikte Flash&#039;dan destek alabilirsiniz. </p>", 
    "end_date": null, 
    "title": "Yeni Başlayanlar İçin Web Tasarım Eğitimi: Adobe Dreamweaver", 
    "price": 0, 
    "instructors": "Fatih GÖK", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425560_1423_2.jpg", 
    "course_url": "https://www.udemy.com/videobilgi-yeni-baslayanlar-icin-web-tasarm-egitimi/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T02:34:46Z"
}