{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Do you want to learn the PHP framework, Zend Framework 2, from scratch and <strong>become a professional in no time?</strong> Then this course is an excellent starting point for you to <strong>quickly learn the basics of Zend Framework 2</strong> and to put your knowledge to work in just a few hours! This is your chance to harvest the knowledge that I have personally obtained through <strong>working with Zend Framework and other PHP frameworks for years</strong>. I am making all of this information available in an easy to understand language that you will understand <em>even if you are not a professional PHP developer</em>. Zend Framework is a popular PHP framework and will be an excellent addition to your CV - even if you are already familiar with other PHP frameworks such as Laravel, CakePHP, Symfony, Codeigniter, Yii Framework, Nette Framework, Phalcon, etc.<span></span></p><p>The course begins by explaining all of the essential theory that you will need to develop great PHP applications with Zend Framework 2, before putting it to use when implementing a blogging application step by step. You will learn how to work with databases, forms, input filters, users and more in this course, and we start at the beginning! <strong>No experience or knowledge of Zend Framework or any other PHP frameworks is required.</strong> Even if you have experience with other PHP frameworks, you will still benefit a lot from this course, and you will have a head start because Zend Framework is built on top of the MVC design pattern or framework. It is, however, not a requirement at all, just as no experience with PHP is required.</p><p>So, join me in this course and learn to build professional PHP applications with Zend Framework 2 today!</p>", 
    "end_date": null, 
    "title": "Zend Framework 2: Learn the PHP framework ZF2 from scratch", 
    "price": "20.00", 
    "instructors": "Bo Andersen", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631754_49ee_4.jpg", 
    "course_url": "https://www.udemy.com/zend-framework-2-from-beginner-to-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T21:33:37Z"
}