{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Welcome to Ruby on Rails course. Learn the basic and intermediate of Ruby on Rails step by step.  In this course, </p><ul style=\"\"><li style=\"\">We&#039;re going to learn this popular open source web development framework. </li><li style=\"\">We will walk through each part of the framework, while we also cover best practices. In real world web development techniques. </li><li style=\"\">We&#039;ll route browser requests to controller actions, that return dynamic page content. </li><li style=\"\">We will learn to interact with the database, and to manage the database schema. </li><li style=\"\"><span style=\"\"></span>We&#039;ll walk through the steps that go into creating, reading, updating and deleting database records.</li><li style=\"\"><span style=\"\"></span>We will discover how to work with relational database associations effectively. </li><li style=\"\">We will learn about Rails built-in helpers. Form validations and security protections.</li></ul><p style=\"\"> Throughout the process, we will gain practical, hands-on experience. By building a complete Ruby on Rails application, a content management system. </p><p style=\"\">Create full-featured, object-oriented web applications with the latest version of the popular, open-source Ruby on Rails framework. This course explores each part of the framework, best practices, and real-world development techniques. Plus, get hands-on experience by building a complete content management system with dynamic, database-driven content. Hassan teaches how to design an application; route browser requests to return dynamic page content; structure and interact with databases using object-oriented programming; create, update, and delete records; and implement user authentication. Previous experience with Ruby is recommended, but not required.</p><p style=\"\">به آموزش روبی آن ریلز به زبان فارسی خوش آمدید. روبی آن ریلز (Ruby on Rails) یا به صورت ساده ریلز، یک چارچوب نرم افزاری تحت وب، آزاد و متنباز است که از زبان برنامهنویسی روبی استفاده میکند. هدف ریلز، ایجاد یک چارچوب نرمافزاری تحت وب، که از روش توسعه سریع برای برنامهنویسان وب استفاده میکند، است. در این قسمت از آموزش ها سعی من بر این است که تمام موضوعات روبی آن ریلز را به شما آموزش دهم. در این آموزش های عالی پله پله جلو رفته ایم و تمامی قسمت ها را پوشش دادیم. مهم نیست اگر تا حالا اپلیکیشن با روبی آن ریلز نساختید چون سعی شده تمامی مطالب پوشش داده شود، بهترین روش ها پوشش داده شود، چطور با دیتابیس کار کنید و رکورد بسازید، رکورد بروزرسانی کنید، رکورد بخوانید و حذف کنید. با معتبر سازی ها، رابطه سازی های دیتابیس و خیلی چیزهای مفید دیگر کار خواهیم کرد. در آخر اینکه بعد از مقدمات ما پروژه هم خواهیم ساخت که یک نمونه از مدیریت سامانه محتوای ساده خواهد بود.</p><p style=\"\">آموزش ها به زبان فارسی ایرانی است.</p>", 
    "end_date": null, 
    "title": "آموزش کامل روبی آن ریلز Ruby on Rails", 
    "price": 0, 
    "instructors": "Hassan Azimi", 
    "commitment": "20.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571628_90aa_4.jpg", 
    "course_url": "https://www.udemy.com/ruby-on-rails-persian/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-02T14:35:27Z"
}