{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t          <strong>** أكثر كورس تقييما 5 نجوم على موقع يودمي العالمي **  </strong></p>  <p>هل تبحث عن مضاعفة الدخل الخاص بك بأن تصبح مطورا للويب؟ أو من الممكن ان تبحث عن تغيير في مهنتك لتعطيك مزيداً من الوقت والمرونة؟</p><p>لا يهم ما هو الحافز لتكون مطورا محترفا للويب لانك الان في المكان الصحيح<br></p>  <p>الدورة الشاملة لمطور الويب هي الدورة الوحيدة على الانترنت المتكاملة من حيث المحتوى، بسعر فعال ومجدي جدا، وان شاء الله ستصعد بك لمستوى جديد في مهنتك مع ضمانة ارجاع كافة نقودك اذا لم نحقق لك ما تطمح اليه<br></p>  <p>عبر هذه الدورة المميزة ستجد كل ما تحتاجه للبدء ببناء مواقع احترافية جذابة وتجلب الزوار لتكسب عن طريقهم الاموال بشكل غير محدود<strong></strong></p><p><strong>هذه الدورة السريعة والفعالة، ستجعلك تجني الاموال بجعلك مطورا للويب حتى من دون اي خبرة او مهارات سابقة تذكر، كل ذلك خلال 6 اسابيع</strong><br></p>    <p>ليس ذلك فحسب، وانما ستحصل على استضافة مجانية لمواقعك على الانترنت لمدة عام كامل، وذلك سيمكنك من البدء بكسب النقود حتى بدون انهائك للدورة<br></p>  <p>  \t          <strong>ماهي مكونات الدورة؟</strong><br></p>  <p>ستحصل على 11 فصل مصممة بطريقة اكثر من رائعة، كل فصل منها مصمم لتسهيل عملية التعلم بطريقة سلسلة، باستخدام خبراتنا في التعليم التقني، فالاستاذ روب هو خريج جامعة كامبريدج بتخصص الرياضيات في بريطانيا وكذلك الاستاذ احمد ناصر فهو مدرب تقني عربي متميز في العديد من المعاهد المشهورة في الشرق الاوسط وله باع طويل في هذا المجال، الاستاذين يعملان كمبرمجين محترفين ايضا مسؤولان عن تطوير المحتوى التعليمي الواضح والحصري الذي ستجده سهلا جدا للاستيعاب، وطبعا للتطبيق والممارسة</p><p>ستجد تسلية ومتعة التعلم مع تقنيات التعلم المثبتة بشكل مريح مع تجولك خلال شمولية كل قسم من أقسام الدورة<br></p>  <p>اذا كنت من الباحثين عن دورة ذات محتوى حقيقي وفعال لتحضرك لبناء مواقع مميزة واحترافية ستكسبك النقود، نحن كمدربان بشكل شخصي نضمن لك ان هذه الدورة هي الاولى<br></p>  <p><u>هل لديك اية شكوك؟ سنمنحك فرصة استعادة نقودك كاملة خلال اول 30 يوم من شراءك للدورة</u><br><u></u>  </p>  <p>هل انت مستعد لتحويل عالمك بان تصبح مطورا مستقلا مستقبلا للارباح؟<br></p>  <p>  \t          هذا ما ستحصل عليه مع الدورة الشاملة لمطور الويب:</p>  <p>  \t          ستحصل على 11 فصل سنضمن لك الاستيعاب الكامل للدروس بطريقة شرح اكثر من مميزة<br></p>  <p>كل قسم من اقسام الدورة مدعم باكثر من 28 ساعة من الفيديوهات التعليمية المشجعة والواضحة والعديد من التمارين العملية لتصميم المواقع.<br></p>  <p>  \t          <strong>كل ذلك بين يديك بضغطة زر</strong><br></p>  <ul>  \t<p>هذه الدورة سنبدأ معكم فيها من الاساسيات، سنريك النصائح والخطوات والاسرار التي ستجعل العمل في مجال الويب اقل جهدا واكثر كفاءة عند عملك مع تقنيات الويب المختلفة مثل </p><p>HTML, CSS and JavaScript<br></p>  \t<p>سنريك كيفية تصميم مواقع رسبونسف تعمل على جميع انواع الشاشات والموبايل بكل راحتك وبدون اي تعب يذكر باستخدام تقنيات متقدمة اخرى مثل</p><p>jQuery PHP, MySQL and Twitter Bootstrap.<br></p>  \t<p>بعدها ستطور مدونات ومواقع تجارة الكترونية ومتاجر باستخدام منصة الوورد بريس، وستتعلم طرقا ذكية لاضافة المحتوى عن طريق الاي بي ايز والويب سيرفسز لتشبكها مع مواقع مثل خرائط جوجل وفيس بوك وتويتر<br></p>  \t<p>كما يقول ريتشارد برانسون -\"إن افضل طريقة للتعلم هي الممارسة\"، فانك ستكمل تحديات لبناء المواقع في كل قسم وفصل من فصول الدورة، وبدون اي جهد كبير ستتمكن من حل التمارين والاختبارات عن طريق استخدام مهاراتك التي تعلمتها وجمعها مع بعضها البعض، لتتمكن من عمل موقع شبيه بموقع تويتر بالنهاية<br></p></ul>  <p><br></p><p>  \t          <strong>اكثر من 11 فصل للدورة ستعلمك ما يلي:</strong></p><ul><li>  \t\t          اعداد الاستضافة المجانية الخاصة بك</li><li>  \t\t          HTML  \t</li><li>  \t\t          CSS  \t</li><li>  \t\t          Javascript  \t</li><li>  \t\t          jQuery  \t</li><li>  \t\t          CMSs and WordPress  \t</li><li>  \t\t          Responsive Design  \t</li><li>  \t\t          PHP برمجة  \t</li><li>  \t\t          MySQL قواعد البيانات</li><li>  \t\t          APIs الويب سيرفسز</li><li>  \t\t          Mobile Apps تطبيقات الموبايل</li><li>  \t\t          <em><u>Bonus Chapter: كيف تكسب 10 الاف دولار اثناء تعلمك البرمجة - كتاب مجاني</u></em>  \t</li></ul>  <p><br>  \t          </p><p><strong>ما الذي ستحصل عليه ايضا خلال الدورة؟</strong></p>  <ul>  \t<ul><li>·مجموعة متميزة من الاعضاء المتعاونين الذين سيساعدونك في كل خطوة لك على الطريق</li><li>  \t\t          ·اتصال مباشر مع المدرب الدولي الاستاذ احمد ناصر</li><li>  \t\t          ·كتب تعليمية تريك كيفية البدء بكسب الاموال حتى قبل انهاء الدورة</li><li>  \t\t          ·دورة مدى الحياة، حيث يمكنك الوصول الى محتوى الدورة في اي وقت تريده</li><li>  \t\t          ·تطبيق عملي لتتعلم كل شيء خلال الدورة</li><li>  \t\t          ·فهم عميق بكيفية تصميم، برمجة وتطوير المواقع الالكترونية بشكل احترافي</li><li>  \t\t          ·حزمة استضافة لمواقعك لمدة عام كامل سعرها 199 دولار مجانا لك عند الاشتراك</li></ul>  </ul>  <p><br></p><p>لا داعي لتنفق اموالك التي تعبت لجنيها على الكتب، والدورات الاونلاين مرتفعة الثمن وحتى فيديوهات على اليوتيوب، فمع الدورة الشاملة لمطور الويب باللغة العربية ستحصل على كل شيء تريده، تحت منصة واحدة مريحة وسهلة الاستخدام بالاضافة لانك ستحصل على خدمة دعم قوية وسريعة وصديقة عن طريقة الايميل والتويتر والمنتدى الخاص بهذه الدورة<br></p>  <p>لن نتركك معلقا لوحدك<br></p>    <p>  \t          اقرأ السيرة الذاتية الخاصة بالاستاذ روب لترى كيف تخلى عن مهنته السابقة كمعلم ليصبح مطورا للويب، فهو لم يندم على ذلك الخيار مطلقا ولم ينظر الى الخلف بتاتا</p><p>لا يهم كم هو عمرك او ماهي خلفية تخصصك او مهنتك. نحن سنضمن لك ان اي شخص يمكنه الاستفادة من هذه الدورة، سواءا بالاستفادة وكسب بعض المال على جنب، او بتغيير مهنتك كمطور للويب بشكل كلي<br></p>  <p>  \t<u><em></em>اذا ما الذي تنتظره؟ حول حياتك و<strong>سجل الان لتحصل على نسختك المجانية من كتابنا ب 85</strong><strong> صفحة <u><em></em></u>كيف تكسب 10 الاف دولار </strong><strong>أثناء تعلمك البرمجة</strong><em></em></u>  </p>", 
    "end_date": null, 
    "title": "الدورة الشاملة لمطور الويب - قم ببناء 14 موقع وتطبيق ", 
    "price": "50.00", 
    "instructors": "Rob Percival, أ. أحمد ناصر", 
    "commitment": "28.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692394_f8c1_2.jpg", 
    "course_url": "https://www.udemy.com/complete-web-developer-arabic-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T21:49:17Z"
}