{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">امتلك المهارات الأساسية لتطوير المواقع باستخدام لغتى HTML, CSS</strong></p>\n\n<p>أقدم لكم المستوى الأساسى من مستويات تطوير المواقع والذى يشمل شرحاً مبسطاً للمبتدئين فى هذا المجال يوفر لهم ما يحتاجون إليه للانتقال إلى المستوى المتوسط ثم الإحتراف</p>\n\n<p>في هذا الكورس \"<strong>تطوير المواقع للمبتدئين باستخدام HTML, CSS</strong>\" تجد شرحاً مبسطاً لأوامر التكويد الأساسية لبناء عناصر صفحات الويب وتنسيقها باستخدام الطرق التعليمية الشيقة والعالمية المعتمدة من مدرسة W3Schools الأكبر والأشهر في مجال تطوير الويب بالعالم</p>\n\n<p>الآن يمكنك ارتياد مجال تطوير المواقع وتكويد صفحات الويب دون خوف أو تردد من صعوبة المعلومة أو دقة المجال، فكل المعلومات الأساسية في هذا الكورس مبسطة كى تناسب كل من ليس له أى خبرة أو سابق معرفة على الإطلاق بتطوير المواقع</p>\n\n<p>ولأننى واثق من مدى قوة هذا الكورس ومن نتائجه المؤكدة النجاح، أقدم خدمة الدعم الفني للدارسين عقب الانتهاء من الكورس للإجابة عن استفساراتك ومساعدتك فى تنفيذ كل الخطوات العملية المشروحة في الكورس لكى تلمس بنفسك العائد الذى يمكنك الحصول عليه بعد امتلاك هذه المهارات المتميزة</p>\n\n<p><strong class=\"redactor-inline-converted\">فى هذا الكورس سوف تتعلم ما يلى:</strong></p>\n\n<ul><li>الهيكل الأساسى للغة HTML</li><li>التحكم في heading و paragraph للتركيز على النصوص وإبراز العناصر الهامة فى صفحات الويب</li><li>الروابط التشعبية Hyperlinks وتركيبها الأساسى في كافة عناصر الويب</li><li>إدراج وخصائص الصور Images وتغيير مصدر الصورة والنص البديل والأبعاد وغيرها من الخصائص الهامة</li><li>وسوم hr, br, pre لإدراج الفواصل مما يساهم فى تنسيق الصفحا بشكل جذاب بعيداً عن الملل والرتابة</li><li>التحكم في لون الخلفية ولون النص background color, text color وشرح كامل ومبسط لأكواد الألوان والتعرف عليها وانتقائها</li><li>تغيير نوع الخط والمحاذاة font family, alignment</li><li>التنسيقات formatting بكل أنواعها فى عناصر صفحات الويب والتى ترتبط بشكل أساسى بالقسم الثاني من الكورس</li><li>الاقتباسات Quotations للتركيز على نصوص معينة داخل الصفحات</li><li>التعليقات Comments وأهميتها الكبيرة لمطورين الويب عند عمل أى مشروع جديد أو التعديل فى مشروعات جاهزة</li><li>الألوان Colors, RGB, Hexa</li><li>التنسيقات المتعددة باستخدام لغة CSS</li><li>تحديد العناصر والإشارة إليها باستخدام element, id</li><li>classes, comments</li><li>التحكم في خصائص الخلفيات Background images</li><li>إطارات العناصر CSS borders</li><li>المساحات الخارجية عن العناصر CSS margins</li><li>المساحات الداخلية للعناصر CSS padding</li></ul>\n\n<p>كما يشتمل الكورس على كافة المصطلحات الانجليزية التى تحتاجها لفهم هذا المجال مع شرح مبسط لمعنى كل مصطلح مما يساهم في رفع قدرتك على متابعة كافة التطورات</p>", 
    "end_date": null, 
    "title": "تطوير المواقع للمبتدئين باستخدام HTML, CSS, Javascript", 
    "price": 0, 
    "instructors": "Mohammed Fakhry", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/835988_69b0_3.jpg", 
    "course_url": "https://www.udemy.com/web-development-basics-arabic/", 
    "subject_name": [
        "Web Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-30T11:31:53Z"
}