{"selfpaced": false, "topic_name": ["Astronomy"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Science\n                                                                                                    &gt; Astronomy\n                                                            \n                            \n                                                \n                    \n                    \n                    Learn about the origin and evolution of life and the search for life beyond the Earth.\n\n                                            Syllabus\n                        Life and Its OriginsWhat is life and what are the definitions of life? What do we know about the origin of life and what are the current hypotheses for how it originated on the Earth?Life on EarthWhat was the environment of early Earth like when life first emerged and what do we know about life on the earliest Earth? How did life evolve to cope with survival in extreme environments? What have been the major evolutionary transitions of life on the Earth?Habitable Environments Elsewhere in our Solar System?What are the prospects for life on other planetary bodies in our Solar System and how do we go about searching for it? What conditions are required for a planet to be habitable? The Search for Habitable Exoplanets How do we search for Earth-like planets orbiting distant stars and how would we detect life on them?Extraterrestrial IntelligenceWhat are the possibilities for intelligent life elsewhere? How would we deal with contact with an extraterrestrial intelligence and what would be the impact on society? Who would represent Earth?\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Astrobiology and the Search for Extraterrestrial Life", "price": 0, "instructors": "Charles Cockell", "institution_name": ["University of Edinburgh"], "commitment": "3-4 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/astrobiology", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}