{"selfpaced": false, "topic_name": ["Astronomy"], "description": "\n\n                    \n                    \n                    What was the Big Bang? How do black holes work? Could there be life elsewhere in the Universe? In this course we’ll address those topics, as well as gaining some insight into how great scientific discoveries were made, and what's involved in scientific research.\r\nWe'll also look at the vital role that new technology plays in scientific discoveries. We'll talk to scientists about their role in the development of largest telescope in the history of astronomy: the Square Kilometre array.\r\nWhat will I learn?\r\n\r\nHow people over the ages have tried to understand the world around them\r\nHow we have developed our current picture of the Universe\r\nWhat the Universe looks like on different scales - from the Earth and the Solar System right up to the largest-scale structure of the universe\r\nKey theories in astronomy and the key individuals behind them\r\nHow the universe has evolved and what new discoveries we are finding through the use of new technologies\r\nSome insight into the big questions we hope to find answers for, such as whether we are alone in the universe\r\n\r\nThis course requires approximately 2 - 4 hours of study per week, but can vary depending on the student. This includes watching videos, and taking quizzes and assessments.\r\nIf you pass this course you'll receive a Certificate of Achievement. While this certificate isn't a formal qualification or credit, you can use it to demonstrate your interest in learning about this area to potential employers or educational institutions.\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nAstronomer\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: GREAT DISCOVERIES IN ASTRONOMY\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: UNLOCKING THE SECRETS OF THE UNIVERSE: HOW WE DO SCIENCE\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: BUILDING THE WORLD'S LARGEST SCIENCE EXPERIMENT\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: ANSWERING BIG QUESTIONS WITH THE SQUARE KILOMETRE ARRAY\r\n\r\n\r\n\r\n\n                                    ", "end_date": "2016-02-08T00:00:00Z", "title": "Astronomy: Discovering the Universe", "price": 0, "instructors": "Dr John Morgan", "institution_name": ["Curtin University"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.open2study.com//node/1771", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Open2Study"], "start_date": "2016-01-11T00:00:00Z"}