{"selfpaced": true, "topic_name": ["Astronomy"], "description": "\n\n                    \n                    \n                    This course is designed for anyone who is interested in learning more about modern astronomy. We will help you get up to date on the most recent astronomical discoveries while also providing support at an introductory level for those who have no background in science.\n\n                                            Syllabus\n                        Astronomy: Exploring Time and SpaceHere you can find all of the introductory information, course syllabus, and current announcements.Science and HistoryScience combines logic and evidence to increase our understanding of the natural world, including remote and inaccessible regions of space and time. The Night SkyAstronomy is the oldest science, and its history shows a growing realization of our insignificant status in a vast and ancient universe.The Tools of AstronomyA continuing revolution in telescope design and construction is giving astronomers an unprecedented set of tools for exploring the universe.Matter and RadiationAstronomers harvest information across the electromagnetic spectrum, using spectra to measure the composition of distant objects and diagnose extreme physical conditions.The Solar SystemSpace probes have visited most planets in the Solar System, and orbiters and rovers are homing in on the habitability of Mars. Space exploration is entering an entrepreneurial phase that might let us venture beyond the Solar System.ExoplanetsIn the last few years, thousands of extrasolar planets have been discovered, including some that are Earth-like and possibly habitable.Star Birth and DeathStars are the crucibles of heavy element creation, and the chaotic regions of their birth are being understood though long wavelength observations. Gravity is the ultimate victor in the life story of any star, leaving behind the exotic end states of white dwarfs, neutron stars, and black holes.GalaxiesThe architecture of the Milky Way galaxy is that of a disk, a bulge, and a halo, with the entire assemblage bound by enigmatic dark matter. Every galaxy contains a supermassive black hole, and entire population of galaxies is sculpted by gravity into subtle structures on large scales.CosmologyThe expanding universe points back to an extraordinary state of extremely high density and temperature called the big bang.Life in the UniverseThe Earth gives us a ringside seat on the physical, chemical, geological, and biological evolution of a dynamic terrestrial planet. The abundance of terrestrial planets in remote solar systems motivates the search for life and technology elsewhere in the universe.\n                                    ", "end_date": "2015-05-03T00:00:00Z", "title": "Astronomy: Exploring Time and Space", "price": 0, "instructors": "Chris Impey and Matthew Wenger", "institution_name": ["University of Arizona"], "commitment": "4-6 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/astro", "duration": "11 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-02-15T00:00:00Z"}