{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Miről szól a Jelmeztervezés gyakorlata című tanfolyam?</strong>  </p>  <p style=\"\">  \t A tanfolyamot pályakezdő és már a pályán lévő, aktívan tevékenykedő tervezőknek hoztam létre. A tervezés egy rendkívül összetett munka, és mivel alkalmazott művészeti ág, nagy hangsúlyt kell fektetni a gyakorlati oldalára, mivel anélkül nem működőképes a művészeti tudás. Az évek alatt rengeteget tanultam erről az oldalról, megfigyeltem mi miért működik, vagy mi miért nem. Szeretném hogy az összegyűjtött tudásom segítségével mások hatékonyabban tudjanak dolgozni a szakmában. Ami nálam működött másnál is működni fog, ami nekem segített, másnak is fog. A cél, hogy profibb szakemberek és boldogabb művészek tevékenykedjenek a művészeti szférában.  </p>  <p style=\"\">  \t <strong style=\"\">Mit tartalmaz a kurzus?</strong>  </p>  <p style=\"\">  \t A tanfolyam pdf formátumú fájlokat tartalmaz, egy fájl, egy lecke, amiben kifejtem, konkrét gyakorlati feladatokkal és képes példákkal mit és hogyan érdemes csinálni munka közben, annak érdekében, hogy sikeresebbek legyünk.  </p>  <p style=\"\">  \t <strong style=\"\">Mennyi időt vesz igénybe a tanfolyam elvégzése?</strong>  </p>  <p style=\"\">  \t Ez attól függ, ki, mennyi időt szán rá a tanulásra. Összesen 25 lecke van, ezek mindegyike külön-külön maximum egy óra tanulást vesz igénybe. Ha valaki napi egy órát rászán a tanulásra, akkor 25 nap alatt elvégezheti a tanfolyamot és azonnal elkezdheti alkalmazni a tanultakat, ami rögtön látványosan hatékonyabbá teszi a munkáját.  </p>  <p style=\"\">  \t <strong style=\"\">Hogyan épül fel a tanfolyam?</strong>  </p>  <p style=\"\">  \t Lépésről-lépésre haladva, ahogy a cím is jelöli, A-tól Z-ig végigvezetem a tanulót a munkafolyamat állomásain és ezáltal egy komplett munkastratégiát sajátíthat el, aminek köszönhetően, gyorsabban és összeszedettebben lesz képes ellátni a feladatát, úgy, hogy közben megmarad a jó közérzete és képes lesz kezelni a feszültségeket, esetleges súrlódásokat. A leckék végén gyakorlati feladatok vannak, melyeket el kell végezni ahhoz, hogy az elméleti tudást át lehessen ültetni a mindennapokba. A tanfolyam végén lévő jegyzetben egy könyvajánlót talál, mely könyvekből újabb hasznos információkkal egészítheti ki a meglévő tudását.  </p>  <p style=\"\">  \t <strong style=\"\">Miért érdemes elvégezni?</strong>  </p>  <p style=\"\">  \t Önmagunk fejlesztése és képzése a legjobb üzlet, amibe fektethetünk. A művészi alkotáshoz is tudásra van szükségünk, különösképpen egy ilyen alkalmazott művészeti területen, mint a jelmeztervezés. Ha valaki művészi hajlamokkal rendelkezik nem kizárt, hogy kreativitását képes a gyakorlati területeken is alkalmazni. Ha valaki képes volt megtanulni magas színvonalon rajzolni és megtanulta használni a fantáziáját, az miért ne lenne képes elérni mindazt ami szeretne, a gyakorlatban is? Ez a tanfolyam megadja a választ a kérdésekre és megerősítést ad és kedvet a folytatáshoz.  </p>", 
    "end_date": null, 
    "title": "A jelmeztervezés gyakrolata", 
    "price": 0, 
    "instructors": "Costume Designer Coach Julie Horanyi", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/159122_a670_5.jpg", 
    "course_url": "https://www.udemy.com/a-jelmeztervezes-gyakrolata/", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-06T13:02:26Z"
}