{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong></strong><strong></strong><strong></strong><span></span><em><strong>Learn fine hand sewing stitches and use them to make a beautiful skirt in only five days or less. </strong></em></p><p>Each day you will be taught how to sew fine stitches or other techniques that will help you advance your sewing skills. This course includes a skirt project to enhance your learning experience. Each day includes the following:</p><ul><li><strong>Course Lecture</strong> - This is a short video presentation where you get to learn the benefits of each stitch and when to incorporate it into your projects.</li><li><strong>Demonstration</strong> - This portion is a video lesson of how to perform the stitch. It's best if you follow along with the video demonstration so that you can get a more engaging experience.</li><li><strong>Assignment</strong> - After you learn how to do the stitches for the day, you are then challenged to use them to develop your couture skirt. You are also challenged to discuss a particular topic with your classmates.</li></ul><p><strong></strong><strong>What You Will Not Learn</strong></p><p>You will not learn how to make a skirt. This course will show you how to incorporate the stitches that you will learn into a basic skirt. The skirt project is a supplementary learning tool to give you a real-world example of how you can use the hand sewing stitches used in the course.</p><p><strong>What You Get</strong></p><ul><li>Discussion Board<ul><li>Interact with other people in the sewing community. Sewing is always more fun with others. Each day includes questions to invoke dialog with your fellow classmates.</li></ul></li><li>The Skirt Project\n<ul><li>The best way to learn how to sew is to practice. The project included in this course is designed by you. Each day you will be working on your skirt to practice using the stitches in a real situation. You can pick out any straight or pencil skirt pattern that you desire. Your skirt will include the hand stitches that you learn in the course, which will improve its quality and look. You will be given a downloadable assignment sheet that will show you what part of the skirt to work on each day. You are not given a sewing pattern in this project, but you are encouraged to purchase your own skirt pattern and redesign it to fit your own personality and style.</li></ul></li><li>Stitching Demonstrations\n<ul><li>Each day includes demonstrations of how to perform each stitch or task that is necessary to advance your sewing skills.</li></ul></li><li>Lectures\n<ul><li>These are short presentations that give you background information of each stitch to deepen your understanding of hand sewing.</li></ul></li></ul><p><strong>FAQ</strong><br></p>Does this course include a downloadable sewing pattern?<p>No. In this course, you are the designer. I show you how to pick out a skirt pattern that suits your own body shape, personality and style on Day 1. This gives you the freedom to make whatever you desire.</p>Do I need a sewing machine?<p>The hand sewing stitches that you will learn in the course are not meant for completing large seams.  To complete the skirt in the recommended time-frame, you should use a sewing machine to put the major seams together.</p>", 
    "end_date": null, 
    "title": "Advanced Hand Sewing in 5 Days", 
    "price": "20.00", 
    "instructors": "Jasmine Loveit", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741722_569b.jpg", 
    "course_url": "https://www.udemy.com/advanced-hand-sewing-in-5-days/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T02:11:56Z"
}