{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<span>Starting a fashion company can be challenging. Especially when you lack experience in retail management or fashion. You do not want to make a simple legal or business mistake, which can cost you financially.</span>  </p>  <p style=\"\">  \t <strong style=\"\">Be a Step Above the Competition When You Master These Legal and Business Concepts:</strong>  </p>  <p style=\"\">  \t             ·Trademark your brand  </p>  <p style=\"\">  \t             ·Figure out your brand identity  </p>  <p style=\"\">  \t             ·How to get Copyright protection  </p>  <p style=\"\">  \t             ·Familiarize yourself with patents  </p>  <p style=\"\">  \t             ·Find your ideal price strategy  </p>  <p style=\"\">  \t             ·Learn retail terminology  </p>  <p style=\"\">  \t             ·How to find and approach retailers  </p>  <p style=\"\">  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t <strong style=\"\">This course is designed by a retail professional with fashion designers in mind.</strong>  </p>  <p style=\"\">  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t <strong style=\"\">Contents and Overview</strong>  </p>  <p style=\"\">  \t             The topics are based on the common problems and questions new brands have. I’m familiar with these issues since I’m an online retail buyer for a top 300 retailer. These are the topics I’m commonly asked when new brands are seeking advice from a buyer.  </p>  <p style=\"\">  \t             As a retail buyer with over 6 years of experience I have seen a lot of mistakes. For example, there are many tee-shirt brands on the market that will never land on a website, due to various legal problems with the retailer carrying the line. Communication can be an issue as well, especially when the owner of a brand lacks a retail or fashion management background and does not understanding common retail terms. <strong style=\"\"></strong>  </p>  <p style=\"\">  \t             This course contains 7 topics and over 50 lectures. The majority of videos time length ranges from 30 seconds to 3 minutes, so you don’t feel overwhelmed by the material.  In the class I give out helpful worksheets, resources for more information, and offer a quiz to learn terms.  </p>  <p style=\"\">  \t             I designed this course to be easily understood by beginners with no legal or business background.  This class is perfect for teenagers to adults looking to start something new. I have a background in teaching, training and understand the importance of making lessons clear and simple.  </p>  <p style=\"\">  \t             At the end of the course you will feel more confident with the legal and business topics covered. You will gain valuable skills to help you run your fashion business as a seasoned professional.  </p>  <p style=\"\">  \t <strong style=\"\">DISCLAIMER: </strong><em style=\"\">The legal information contained in this course is not legal advice, and should not be treated as such. Nothing contained in this course and course materials shall be deemed to create an attorney-client relationship with you. You must not rely on the information on this website as an alternative to legal advice from your attorney or other professional legal services provider. If you have any specific questions about any legal matter you should consult your attorney or other professional legal services provider. You should never delay seeking legal advice, disregard legal advice, or commence or discontinue any legal action because of information on this website. Portions of this disclaimer were created using a Contractology template available at: Free Net Law dot com</em>  </p>", 
    "end_date": null, 
    "title": "Anatomy of A Brand: Fundamental Legal & Business Concepts", 
    "price": "30.00", 
    "instructors": "Ericka Mitton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/223428_11ca_4.jpg", 
    "course_url": "https://www.udemy.com/fashionbusinesslaw/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-20T00:09:26Z"
}