{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong><u>Become a Fashion Buyer <em>- Learn the essentials.</em></u></strong></p><p>This course will help you decide if becoming a fashion buyer is for you, and it will help you understand the key tasks of a fashion buyer and the skills required to become a successful fashion buyer.</p><p>By the end of this course you will be in a position to understand what a fashion buyer does. You will have the confidence to either embark on further study or take the steps to securing your first job as a fashion buyer.</p><p><strong><u>Section 1</u></strong><strong>:</strong></p><p>Introduction</p><p><strong><u>Section 2</u></strong><strong>:</strong></p> <ul><li>You will learn the buyers <u>main responsibilities</u> </li> <li>You will gain an understanding of the key areas a buyer is evaluated on in their role (otherwise referred to as <u>KPI's</u> or key performance indicators), and </li> <li>You will understand the <u>key skills</u> required to be successful in this role. </li></ul> <p><strong><u>Section 3</u></strong>: </p> <ul><li>Structures of buying departments are discussed – from small to large sized businesses , different types of buying roles (brand buyers to product developers) and </li> <li>We will cover other staff roles in a buying department that work alongside a buyer. </li></ul> <p><strong><u>Section 4:</u></strong><strong></strong></p> <ul><li>You will understand the steps involved in planning a fashion range</li></ul> <p><strong><u>Section 5</u></strong><strong>: </strong></p> <ul><li>You will gain an understanding on various sources used in predicting fashion trends for your fashion range and a checklist is provided for you to create your own trend board.</li></ul> <p><strong><u>Section 6:</u></strong><strong></strong></p> <ul><li>You will gain a good overview of the financials involved in planning a fashion range, and gain an understanding of the considerations to factor in when building a fashion range.</li></ul> <p><strong><u>Section 7:</u></strong><strong></strong></p> <ul><li>You will understand what to look at when sourcing a fashion supplier, how to evaluate a supplier and understand the different types of suppliers.</li></ul> <p><strong><u>Section 8:</u></strong> <strong></strong></p> <ul><li>Understand the steps involved in negotiating with a supplier. </li></ul> <p><strong><u>Section 9:</u></strong><strong></strong></p> <ul><li>You will understand the term landed cost price and how this is calculated. </li> <li>You will also understand the importance of strategies involved in setting the retail price.</li> <li>Gross Profit calculations are also included in this section as it is important financial part of a buyers role.</li></ul> <p><strong><u>Section 10:</u></strong><strong></strong></p> <ul><li>You will understand the fundamental analytical functions in a buying department and gain an understanding of what an open to buy is. </li> <li>There will be basic calculations and examples of an OTB. </li></ul> <p><strong><u>Section 11:</u></strong><strong></strong></p> <ul><li>You will gain an understanding of the key sales reports reviewed in a buyers role.</li></ul> <p><strong><u>Section 12:</u></strong><strong></strong></p> You will gain tips on the best way to land your first role. We will cover work experience, qualifications, finding available positions, cover letters and CV presentation, and interview preparation for meeting with a company.<p><br></p>", 
    "end_date": null, 
    "title": "Become a fashion buyer - learn the essentials", 
    "price": "30.00", 
    "instructors": "Diane C", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/591438_57e6_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-fashion-buyer/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T02:01:25Z"
}