{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Beginner Sewing: Making a Tote Bag is an introductory course to sewing meant to show you everything you need to know to safely operate a sewing machine.  I will show you everything from machine to set up to the construction of a lined tote bag complete with two pockets.\n\n  </p>\n\n<p>Some lectures in this course are the same as in Beginner Sewing for Tweens and Teens, but the project is brand new and directed toward an adult.</p>\n\n<p><strong>Learn Basic Sewing Practices And Challenge Yourself to Create Your First Sewn Item</strong>\n\n  </p>\n\n\n\n\n\n<p>·      Learn how to safely operate a sewing machine\n\n  </p>\n\n\n\n\n\n<p>·      Practice basic stitching skills like creating corners and curving lines\n\n  </p>\n\n\n\n\n\n<p>·      Recognize problems and learn how to fix them\n\n  </p>\n\n\n\n\n\n<p>·      Learn how to read a sewing pattern\n\n  </p>\n\n\n\n\n\n<p>·      Properly cut fabric in preparation of sewing\n\n  </p>\n\n\n\n\n\n<p>·      Use industry standard construction and finishing sewing techniques \n\n  </p>\n\n\n\n\n\n\n\n<p><strong>A Lifelong Skill With Unlimited Possibilities</strong>\n\n  </p>\n\n\n\n\n\n<p>Learning basics sewing skills is not only a rewarding skill but it is also something that you can develop over your lifetime.  Start with something small and eventually work up to creating your own clothing.  \n\n  </p>\n\n\n\n\n\n<p>If you have ever considered going into the fashion field this is a great place to start.  Unlike most home sewing courses I focus on industry standards and teach you how the professionals sew.\n\n  </p>\n\n\n\n\n\n<p><strong>Course Overview</strong>\n\n  </p>\n\n\n\n\n\n<p>I designed this course for the absolute beginner. If your machine has never been out of the box, no worries, I will show you how to set it up, teach you about the parts of the machine and how to safely operate it to effectively sew together your very first project.\n\n  </p>\n\n\n\n\n\n<p>You’ll learn all of these things in 22 lectures with over 3 hours of video content.  Each lecture is broken down into easy to understand topics as to no overwhelm a beginner and created in real time so you can follow along or pause the lecture and pick it back up at any time.\n\n  </p>\n\n\n\n\n\n<p>By the time you finish this course you will be a confident seamstress well on your way to enjoying a skill that you can grow and develop over your lifetime.  The machine will no longer be a scary machine but a place you visit for a creative outlet and a tool to help you construct some really cool stuff. </p>", 
    "end_date": null, 
    "title": "Beginner Sewing: Making a Tote Bag", 
    "price": "30.00", 
    "instructors": "Kimberly Irwin", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/820452_2555.jpg", 
    "course_url": "https://www.udemy.com/beginner-sewing-making-a-tote-bag/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-13T00:48:15Z"
}