{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Get over the sewing overwhelm blues. In this course you will be practically taken by the hand to learn how to perform common hand sewing techniques used in general sewing and in dressmaking.</p>    <p><strong>Learn Exactly What You Need; Nothing More, Nothing Less, In This Step-by-Step Hand Sewing Course.</strong></p>    <ul><li>Learn what hand sewing supplies      you need, when to use them, and how to use them</li><li>Become comfortable with using the      thimble</li><li>Learn the correct way to sew on a      button and hooks and eyes</li><li>Understand the differences between      temporary (basting) and permanent stitches</li><li>Recognize and understand hand      sewing terminology</li><li>Learn how to sew basic hems by      hand</li><li>Apply your hand sewing understanding      to real-life scenarios</li></ul>    <p><strong>Sew by hand with confidence.</strong><strong></strong></p>  <p>Professionals use hand-sewing techniques to shape the garment, sew with delicate fabrics, increase garment quality, and sew garment areas that are impossible to sew by machine. </p>  <p>Get a strong foundation for hand sewing so that you can start your hand-sewing journey with boldness.</p>    <p>Course Description</p>  <p>You will first learn hand-sewing supplies. Each lecture will build with difficulty and in the end you will learn how to attach buttons and hooks and eyes.</p>    <p>The course includes one quiz to help you test your knowledge. Your knowledge will also be tested with a fun sewing exercise. The exercise will help you to practice applying what you’ve learned to a real-life sewing example. You will have one other sewing exercise that will help you practice and sharpen your sewing skills. </p>    <p>To get the best learning experience, most of the stitches are sewn in real-time so that you can follow along. You will be able to finish the course with enough knowledge to make your own basic projects by hand.</p>", 
    "end_date": null, 
    "title": "Beginner Hand Sewing for Dressmaking", 
    "price": 0, 
    "instructors": "Jasmine Loveit", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692520_8d25_4.jpg", 
    "course_url": "https://www.udemy.com/beginner-hand-sewing-for-dressmaking/", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T01:27:20Z"
}