{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Becoming a tremendous stylist takes hard work, social skills, timing, persistence, knowledge, and fabulous resources for clients.&nbsp;This class will take you within the unique world of fashion and style.&nbsp;You will gain the techniques and skills you must have to start and sustain a career as a stylist upon completion of this course.&nbsp;</p><p style=\"\">Industry Expert</p><p style=\"\"><strong style=\"\">Tiffany Dean</strong> <em style=\"\">Celebrity Fashion Stylist</em><p style=\"\">Tiffany began her career as a Retail Merchandising Coordinator&nbsp; for high-end fashion brands DKNY, BCBG, Max Azria, and Guess by Marciano.&nbsp; She has quickly risen within the world of&nbsp; celebrity fashion styling over the last decade with a roster of such clients as&nbsp; Katy Perry, Lindsay Lohan, and Tyrese Gibson.&nbsp;&nbsp; Also, she works with Emmy Award winning shows <em style=\"\">Modern Family</em> and <em style=\"\">Hawaii 5.0</em>,&nbsp; as well as with many high fashion magazines such as <em style=\"\">Elle</em>, <em style=\"\">Vogue</em>, <em style=\"\">Marie Claire</em>, <em style=\"\">Maxim</em>, <em style=\"\">British FHM</em>, and <em style=\"\">Bride and Bloom</em>.<p style=\"\">Featured Expert <strong style=\"\">Angela Dean</strong> <em style=\"\">Celebrity Fashion Designer</em> <p style=\"\">Viewed as an industry pioneer by the fashion community, Angela&nbsp; Dean has served as President of Fashion Institute of Design and Merchandising&nbsp; in Los Angeles, where the exhibit The Era of Entertainment was created to&nbsp; preserve garments she made for Hollywood elite. <p style=\"\">She has created looks that have been worn by an&nbsp; extraordinary list of clients.&nbsp; Among&nbsp; them are Madonna, Halle Berry, Patti Labelle, Priscilla Presley, Monique, Mary&nbsp; J. Blige, Magic Johnson, Paris Hilton, and Oprah Winfrey.&nbsp; Her creations too have graced magazine covers,&nbsp; awards shows, and CD covers such as,&nbsp; the&nbsp; 30th Anniversary <em style=\"\">Essence</em> magazine cover which represented the highest selling issue in the magazine’s history,&nbsp;&nbsp; Natalie Cole’s gown worn on the cover of her&nbsp; Grammy award winning album, <em style=\"\">Unforgettable</em>, and numerous gowns for&nbsp; actress Latonya Richardson’s Academy Awards appearances.</p>  ", 
    "end_date": null, 
    "title": "Celebrity Fashion Stylist: Fashion and Styling the Famous", 
    "price": "20.00", 
    "instructors": "Faith in Dreams Edutainment", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/72454_2089_8.jpg", 
    "course_url": "https://www.udemy.com/fid_celebritystylist/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-01T03:36:27Z"
}