{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  The trainers of Image Masters, instructors of image consultants, created this course.  </p>  <p>  \t  A course full of fresh and fun new techniques to integrate color in your clothes. Whether you're accustomed now to always wearing black, or have a closet full of color, with this course you'll learn something new.  </p>  <p>  \t  You will learn the how and how to address color on your body, color contrasts, some color communication, and how you can use color to achieve certain effects. Everything on the basis of compelling examples.  </p>  <p>  \t  You can complete the course all in one sitting or spread it out over time. You’ll get the most out of it, by completing the exercises at the end of each section.  </p>  <p>  \t<strong>Comments from participants: </strong>  </p>  <ul>  \t<li>I've had a lot of fun with the information from the course. </li>  \t<li>Even just by watching the videos, I noticed that I was looking at different clothes in shop windows </li>  \t<li>I understand now, why sometimes I was not taken seriously. That will not happen to me anymore! </li>  \t<li>Through the course, I understand that I limit myself in my possibilities to combine the clothes in my closet.</li>  \t<li>Nice, these examples. This makes everything easy to follow. </li>  \t<li>I did not know so much can de said about color in your clothes. Great and useful tips. Thank you.</li>  </ul>", 
    "end_date": null, 
    "title": "Color Snacks - Dress yourself with confidence, ease and fun ", 
    "price": "40.00", 
    "instructors": "Image Masters", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289474_cd5c_5.jpg", 
    "course_url": "https://www.udemy.com/dress-yourself-with-more-confidence-ease-and-fun/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-28T11:00:10Z"
}