{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h4 style=\"\">¿Buscas una imagen con la que te sientas mejor y te vean mejor?</h4>  <h4 style=\"\">¿Quisieras parecer más delgada y alta, pero las dietas no te hacen efecto, y la cirugía no te convence?</h4>  <p style=\"\">  \t               Hasta la mujer más segura de sí misma quisiera mejorar su figura, en búsqueda de ese ideal, que cambia de cultura en cultura, pero que hoy en día se aproxima a la mujer esbelta, delgada sin exagerar, bien proporcionada.  </p>  <p style=\"\">  \t               Si tu problema es que no acabas de verte bien con tu ropa, el problema no está en ti, sino en tu vestuario.  </p>  <p style=\"\">  \t              Con este manual que te he preparado, serás tu propia asesora en este campo. Tendrás la información necesaria para revisar tu forma de vestir y corregir aquellas prácticas que te están traicionando.  </p>  <p style=\"\">  \t               Hemos condensado en un curso breve y sencillo de entender todos los trucos y técnicas que manejan los profesionales.  </p>  <p style=\"\">  \t               Descubrirás qué prendas que debes evitar y las que más te convienen. Cómo emplear el color , la forma y proporción de las prendas y accesorios para disimular tus &quot;defectos&quot;, aquellas características físicas que quisieras retocar. Sólo que aquí aprenderás a hacerlo sin cirugía y de forma muy creativa y entretenida.  </p>  <p style=\"\">  \t               Sin paja,  directo al grano. Ricamente ilustrado con combinaciones que ejemplifican las distintas técnicas y fotos de looks de mi propio vestuario. A través de diversos ejemplos podrás comprobar que has entendido cómo aplicar los principios que se enseñan.  </p>  <p style=\"\">  \t<strong style=\"\">Además, podrás imprimirte la guía en pdf, con todo el contenido transcrito e ilustrado con las fotos, para que puedas releerlo en el futuro.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <h4 style=\"\">Las reglas esenciales del &quot;disimulo&quot; en el vestir, explicadas de forma más sencilla que nunca</h4>  <ol style=\"\">  \t<li style=\"\">El monocromatismo es mágico</li>  \t<li style=\"\">Básate en los neutros</li>  \t<li style=\"\">Las líneas verticales, tus aliadas</li>  \t<li style=\"\">Proporciones divinas</li>  \t<li style=\"\">Mantén el equilibrio</li>  \t<li style=\"\">No subas el volumen</li>  \t<li style=\"\">Tienes que superponerte</li>  \t<li style=\"\">Esto tiene tela</li>  </ol>  <h4 style=\"\">Anímate, es más sencillo de lo que parece. A base de práctica te puedes convertir en una artista de tu propia imagen.<span style=\"\"></span></h4>", 
    "end_date": null, 
    "title": "Cómo vestir para parecer más alta y delgada.", 
    "price": "20.00", 
    "instructors": "Rosanna Gil", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306864_5bf0_4.jpg", 
    "course_url": "https://www.udemy.com/como-vestir-para-parecer-mas-esbelta/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-24T13:33:38Z"
}