{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">¿Eres de las que dicen por las mañanas &quot;No sé qué ponerme&quot; aunque tienes los armarios llenos de ropa que apenas usas? ¿Cuando vas a comprarte ropa no tienes claro qué es lo que necesitas? ¿acabas descubriendo que las prendas que has comprado no sabes muy bien con qué ponértelas y terminan apartadas en un cajón?¿Quisieras poner orden en tu armario y disfrutar del momento del día en que eliges qué ponerte?</em>  </p>  <p style=\"\">  \t   Vestirse bien no solo es un arte. Para disfrutarlo al máximo, el orden es importante. Nos ayuda a tener en mente qué prendas tenemos, con qué nos combinan, y sobre todo, cómo sacarles partido para lucir lo mejor posible.  </p>  <p style=\"\">  \t   En otros cursos desarrollamos el tema de lo que va mejor a cada mujer, por su cuerpo y fisonomía. Pero aquí nos centraremos en construir un vestuario “eficaz”, en el sentido de obtener lo que llamamos un <em style=\"\">fondo de armario</em>, que es tu conjunto básico de prendas, que:  </p>  <ul style=\"\">  \t<li style=\"\">Combinan bien con casi todo, permitiendo el máximo número de estilismos.</li>  \t<li style=\"\">Son intemporales, de calidad e inmunes a las modas.</li>  \t<li style=\"\">Van con tu estilo y forma de vida</li>  </ul>  <p style=\"\">  \t   Con un buen fondo de armario, sabrás vestirte bien en cualquier ocasión, incluso cuando no tengas muchas ganas de ser “creativa”.  </p>  <p style=\"\">  \t   Además no debemos olvidar el tema económico. Conocer qué prendas son las más imprescindibles y versátiles nos ahorrará tiempo y dinero a la hora de ir de compras.  </p>  <p style=\"\">  \t   En este curso, descubrirás:  </p>  <ul style=\"\">  \t<li style=\"\">Cuáles son las prendas básicas que debe tener tu fondo de armario, teniendo en cuenta tu particular estilo y lugar de vida.</li>  \t<li style=\"\">Lo mismo con los imprescindibles complementos. Por el camino iremos desmontando algunos mitos y “dogmas” respecto al tema.</li>  \t<li style=\"\">Os daré mis mejores consejos a la hora de “diseñar” el fondo de armario, y particularmente, sobre cómo hacer compras inteligentes.</li>  \t<li style=\"\">Haremos mención especial al tema de los colores.</li>  </ul>  <p style=\"\">  \t   Por último dedicaremos una sección amplia a las semillas de vestuario, por su importancia para mantener orden en nuestro vestuario .  </p>  <p style=\"\">  \t   ¿Qué son las &quot;semillas de vestuario&quot;?  </p>  <p style=\"\">  \t   Un método lógico, fácil y liberador para limpiar nuestro armario de prendas que no nos convienen, descubrir cuáles son las piezas claves sobre las que construir una multitud de combinaciones que no habíamos percibido, y hacernos un plan de compras claro para completar nuestro fondo de armario.  </p>  <p style=\"\">  \t     Se acabaron las sesiones de compra sin rumbo, y salir de casa descontenta por no haber encontrado un estilismo apropiado.  </p>", 
    "end_date": null, 
    "title": "El fondo de armario: cómo construirlo según tu estilo.", 
    "price": "20.00", 
    "instructors": "Rosanna Gil", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206056_0b3c_5.jpg", 
    "course_url": "https://www.udemy.com/semillas-de-vestuario/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-27T16:12:58Z"
}