{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\"><strong style=\"\">Be the best dressed woman in the room.</strong></em>  </p>  <p style=\"\">  \tBe filled with confidence, personal empowerment, while feeling sexy and feminine and most importantly becoming the best version of you!  </p>  <p style=\"\">  \t<strong style=\"\">After taking this course you will:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Choose colors that flatter your natural beauty</li>  \t<li style=\"\">Feel confident dressing according to your shape</li>  \t<li style=\"\">Organize your space to get most out of your wardrobe</li>  \t<li style=\"\">Be amazing at accessorizing</li>  \t<li style=\"\">Think outside the box with styles beyond the trends</li>  \t<li style=\"\">Dress appropriately for any occasion</li>  \t<li style=\"\">Become a smarter, more confident shopper</li>  \t<li style=\"\">Enjoy experimenting with fashion!</li>  </ul>  <p style=\"\">  \t<strong style=\"\"></strong>There is a lot more to fashion than just picking out an outfit in the morning based on the weather patterns. The latest scientific studies shows that the outfit you choose to wear actually alters the way you interact with the world.  </p>  <p style=\"\">  \t                This course will help you choose garments that allow you to bring your A-game to both your professional and personal life. Learning how to carefully select items that enhance your best features will give a powerful edge. It might even open the door to new business ventures or better relationships. The image you project to the world through your clothes determines the quality of your connections, as well the relationship you have with yourself.  </p>  <p style=\"\">  \t                    Your closet isn&#039;t just a box filled with fabric. Instead it is a doorway to creativity that allows you to express who you are, heighten your performance and quality of life. Ultimately it opens the gateway  for you to become the best version of YOU!  </p>  <ul style=\"\">  </ul>  <p style=\"\">  \t                    Take this course today, and become the best dressed woman in the room!  </p>", 
    "end_date": null, 
    "title": "Fashion: Style Yourself Flawlessly", 
    "price": "20.00", 
    "instructors": "Louise Croft, Larissa Swart", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419006_66a7_6.jpg", 
    "course_url": "https://www.udemy.com/fashion-styling-for-women/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T05:49:01Z"
}