{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Are you interested in fashion and style? Do you know how Fashion works? Do you want to be good at fashion management?</p><p>We offer you the help of true professionals – fashion education with Italian teachers from Milan in Italian E-Learning Fashion School. <br></p><p><strong>This course is about Fashion management and how fashion works nowadays.</strong> </p><p>This course will be a start point to everybody who wants to begin the career in fashion world. You will know how fashion works, who is who in a fashion business, what are fashion weeks and fashion collections.</p><p><strong>We will help you to become fashion professionals with up to date knowledges and skills in fashion management.</strong><br></p><p>More than 1 hour of informative and useful lectures about fashion management and how fashion works!</p><p>In these lectures you will know more about fashion management and how fashion works:</p><ul><li>Haute Couture and Luxury in fashion</li><li>Premium brands in fashion: what is it</li><li>Mass market brands. Fast fashion: what is it</li><li>What do first and second lines of a fashion brand mean?</li><li>Licensing for Apparel fashion and Fashion industry</li><li>How to design a fashion collection: from mood board to production</li><li>Production of fashion collection: details</li><li>Fashion groups: who is most powerful in a fashion world now</li><li>Fashion designers: how is who in a fashion world</li><li>Fashion weeks and fashion shows. How to enter fashion week?<span></span></li></ul>", 
    "end_date": null, 
    "title": "Fashion management: Essential Guide to the Fashion Business", 
    "price": "50.00", 
    "instructors": "Italian E-learning Fashion School", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587122_03b2_2.jpg", 
    "course_url": "https://www.udemy.com/fashion-management-essential-guide-to-the-fashion-business/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T07:27:23Z"
}