{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  Do you love fashion and want to make money from it?  </p>  <p>  \t  Want to learn how to style women, and be known as a professional, well known stylist?  </p>  <p>  \t  Want to get flown around the world and work with some amazing brands?  </p>  <p>  \t  Then this course is for you.  </p>  <p>  \t  I know.  You are probably tired of searching for the right fashion course, from people who have not worked in the industry and are teaching from book knowledge right? Well look no further.  Flavilla not only talks the talk, she walks the walk, and in this fun course, she is lifting the lid and giving you her insider tips on how to become a top stylist.  </p>  <p>  \t  Flavilla has been featured in a number of media outlets, with one journalist calling her styling event  </p>  <p>  \t<span>We created this fashion introduction course with your needs in mind. This fashion course provides you the core fashion knowledge to build your styling skills and colour skills. These elements are necessary to succeed as a fashion stylist. Added to that we also teach you how successfully run your fashion career as a business entrepreneur.</span>  </p>  <p>  \t  This fashion course has been designed for fashion enthusiasts and anyone who wants to start a fashion career as a fashion stylist, personal stylist, personal shopper, colour consultant or wardrobe stylist.  </p>  <p>  \t  As a fashion stylist, you will style with many clients who will need your help finding the right styles for their body shape and lifestyle. You could also work with brands to help them run stylish workshops, present new collections, train their team and so much more.  Start your career with our straightforward introductory fashion course which will teach the core skills you need to succeed as a fashion stylist.  Take a look at what you will learn with the modules below.  </p>", 
    "end_date": null, 
    "title": "How To Start A Success Fashion Stylist Career", 
    "price": "20.00", 
    "instructors": "Flavilla Fongang", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276024_cf54_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-success-fashion-stylist-career/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-06T14:54:11Z"
}