{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Merch by Amazon is Amazon's newest platform for content creators. It allows anyone to create and sell shirts right on Amazon's website with no upfront costs or minimum print runs. Anyone can now easily create custom branded shirts that their fans will love to wear. This course will help you get started and learn how to use the platform both optimally and creatively.<br><br>In this course, students will learn about the Merch by Amazon platform, the image requirements (dimensions and resolution), the royalty calculation system, and the content policies. Students will also learn about the different options and settings in their Merch by Amazon accounts and how to use them to optimize their shirt designs.<br><br>If you want to fast-track your understanding of the Merch by Amazon platform and get your shirt designs live and offered for sale on Amazon in as little as a few hours, then this course is for you. Students who complete this course will find that they have a better understanding of the technical aspects of the Merch by Amazon platform as well as the tools needed to create successful shirt designs.<br><br>Merch by Amazon is an absolutely incredible platform. This course will also show you the bigger opportunities that Amazon is offering by letting content creators upload print on demand shirt designs. Once a student completes this course, they will be able to use the Merch by Amazon platform for themself as well as be able to teach it to others. </p>", 
    "end_date": null, 
    "title": "Introduction: Make and Sell Custom Shirts w/ Merch by Amazon", 
    "price": "20.00", 
    "instructors": "Chris Green", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645290_7030_3.jpg", 
    "course_url": "https://www.udemy.com/merchbyamazonintro/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T23:18:35Z"
}