{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t           Deze cursus werd samengesteld door de trainers van Image Masters, opleiders van image consultants.  </p>  <p>  \t           Een cursus boordevol frisse en leuke nieuwe technieken om kleur in je kleding te gebruiken. Of je nu gewend bent om altijd zwart te dragen, of juist een kast vol kleur hebt, met deze cursus kom je echt verder.  </p>  <p>  \t       Je leert o.a. het hoe en waarom van kleuren combineren, van kleur op je lichaam, kleurcontrasten, wat kleur communiceert, en hoe je kleuren kunt gebruiken om bepaalde effecten te bereiken. Alles aan de hand van aansprekende voorbeelden.  </p>  <p>  \t             Je kunt de cursus in &eacute;&eacute;n keer doorlopen, of over wat langere tijd uitsmeren. Je haalt er het meest uit, door van elk onderwerp de opdrachten te doen, zodat je meteen leert hoe je al die nieuwe kleureffecten in je eigen kleding kunt cre&euml;ren.  </p>  <p>  \t<strong style=\"\">Reacties van deelnemers:</strong>  </p>  <ul style=\"\">  \t<li>Ik heb veel plezier gehad met de informatie uit de cursus. </li>  \t<li>Zelfs door alleen de video&#039;s te bekijken merkte ik al dat ik anders naar kleding in de etalages ging kijken</li>  \t<li>Ik begrijp nu, waardoor ik soms niet serieus werd genomen. Dat gaat me niet meer gebeuren!</li>  \t<li>Door de cursus begrijp ik, dat ik met de kleding in mijn kast maar beperkt kan combineren. </li>  \t<li>Leuk, al die voorbeelden. Daardoor is alles makkelijk te volgen. </li>  \t<li>Ik wist niet dat er zoveel over kleur in je kleding te zeggen viel. Reuze handige tips. Dank je wel. </li>  </ul>", 
    "end_date": null, 
    "title": "KleurBEWUST - Modieus met kleur voor zelfbewuste vrouwen", 
    "price": "40.00", 
    "instructors": "Image Masters", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/117028_cb93_5.jpg", 
    "course_url": "https://www.udemy.com/kleurbewust-modieus-met-kleur-voor-zelfbewuste-vrouwen/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-08T15:15:24Z"
}