{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Learn the principles and elements of fashion design like never before!</strong></p>\n\n<p>\n\n</p>\n\n\n\n<p>Do you have a passion for fashion? Do you want to learn\nhow to be a fashion designer but don't have access to a school fashion program\ndue to budget cuts? Are your dreams of a career in fashion being limited\nbecause you don’t have the time or money to attend a college or university? The SnapFashun Program is your solution!</p>\n\n\n\n<p>\n\nIn this Beginners' course, we will show you the basic essentials of working with fashion flats in Adobe Illustrator. The SnapFashun Program has 3 components to provide a truly unique experience:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>1) Included in the course will be access to our massive database of fashion flats in 6 SnapLibraries: Women's, Men's, Kids, Costume, Handbags &amp; In-Store.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>2)<strong> </strong>Included as well will be a 1 year license to SnapFashun's unique software plug-in for Adobe Illustrator CC that provides an interactive reference library as well as browser to store and retrieve the sketches in the database. </p>\n\n\n\n\n\n\n\n\n\n<p><strong>NOTE:</strong> Once you're registered for the course, we'll send you a link to download the software, installation instruction, SnapLibraries details and user manual.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>3) Finally, our course will allow you to develop skills and techniques to create your designs from inspiration to create a technical design pack that can be used for production.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this Beginners' level course, you will learn all the tools necessary to begin your fashion design journey and prepare you for the Intermediate and Advanced levels of our Program.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>For Beginners that have not used Adobe Illustrator before</li><li>Overview of Illustrator  </li><li>Overview of design principles and elements used in industry and how   Illustrator fits into the design workflow</li><li>Familiarize yourself with the Illustrator interface</li><li>Learn the core tools and features needed to produce basic fashion drawings</li><li>Learn fashion color basics including color properties &amp; color schemes</li><li>Learn basic fashion principles and elements including balance, proportions, rhythm &amp; emphasis......and more. </li></ul>\n\n\n\n\n\n\n\n<p>We're excited to bring you a unique blend\nof resources that you can use to create your own fashion line. We use Adobe\nIllustrator CC along with a plug in that contains a comprehensive library of\nthousands of templates for you to choose from and make edits to customize your\ngarments to meet your fashion goals. Whether you are designing, marketing\nor teaching, these instructional videos will give you\nstep by step how to training to make your fashion dreams come alive! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br><br></p>", 
    "end_date": null, 
    "title": "Learn Fashion Design like never before with SnapFashun", 
    "price": "50.00", 
    "instructors": "Betty Hurd, Betty Hurd", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/787318_7ca1_3.jpg", 
    "course_url": "https://www.udemy.com/learn-fashion-design-like-never-before-with-snapfashun/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-09T14:06:28Z"
}