{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Learn how to use Adobe Illustrator to draw fashion flats. Develop your skills to enable you to produce creative, accurate product designs quickly and to standards required for retail and manufacturing.</p><p style=\"\"><strong>In this intermediate level 2 course, you will learn further tools and features that take your fashion flats from basic to detailed and professional. </strong></p><ul><li>For students that have a basic working knowledge of drawing fashion with Adobe Illustrator or for students that have completed the Level 1 Beginners Illustrator 4 Fashion course.</li><li>Learn how to add detailed design features to your drawings such as fabric fills, patterns ribbing, draping and shading. </li><li>Learn to create reusable brush libraries of trims and stitching such as sequins, buttons, zippers and overlock stitching.  </li><li>Garment drawing workshops</li></ul><p style=\"\"><strong>Learn essential skills required by the fashion industry</strong></p><p style=\"\">Having spent over a decade implementing and training software technologies into fashion brands and retailers across the globe, I spent a lot of time working with the designers. Over the years there seemed to be a common theme in the design room - lots of designers were using Illustrator well but many either couldn't use it at all or couldn't use it very well. They also didn't adhere to any drawing standards or best practises so had problems such as not being able to easily edit each other's drawings, create colourways quickly or create reusable components properly, making them inefficient. </p><p style=\"\">Illustrator 4 Fashion training has been specifically tailored for fashion, with the needs of the industry in mind. The training can be taken by company design employees, freelance designers, fashion design students and anyone else looking to learn or improve their fashion drawing with Adobe Illustrator.</p><p style=\"\"><strong>Course Overview</strong></p><p style=\"\">Most Adobe Illustrator manuals and online training courses are industry generic with many modules not relevant to fashion drawing. It can be hard to know which features to learn and how to develop techniques to draw professional fashion designs. Illustrator 4 Fashion only teaches you the features and techniques relevant to drawing fashion flats, illustrations and garment components. </p><p style=\"\">The Illustrator 4 Fashion course is split into 3 levels; beginner, intermediate and advanced. This level 2 intermediate course is aimed at students that have a basic working knowledge of fashion drawing with Adobe Illustrator. This course builds on the foundations learnt in Level 1, progressing to more advanced skills and techniques to bring fashion flats to life. Students will learn how to build powerful trim and brush libraries to improve design efficiency and accuracy. Level 2 also looks more in depth at the use of colour, patterns, fabric fills and embellishments, to add dynamism and realism to drawings. The final section of this course features a selection of garment drawing tutorials, putting the skills and techniques learnt in the first part of the course into real life practise.</p><p style=\"\">Every lecture includes supporting Illustrator work files so that students can follow the lecture exactly.</p>", 
    "end_date": null, 
    "title": "Learn to draw fashion with Adobe Illustrator CC Intermediate", 
    "price": "45.00", 
    "instructors": "Jo Hughes", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570716_2e49.jpg", 
    "course_url": "https://www.udemy.com/learn-to-draw-fashion-with-adobe-illustrator-cc-intermediate/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-01T06:46:33Z"
}