{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Learn how to use Adobe Illustrator to draw fashion flats. Develop your skills to enable you to produce creative, accurate product designs quickly and to standards required for retail and manufacturing.</p><p style=\"\"><strong style=\"\">In this beginners level course, you will learn all the core tools and features that make up the basic fashion drawing toolbox.</strong></p><ul style=\"\"><li style=\"\">For beginners that have not used Adobe Illustrator before</li><li style=\"\">Overview of Illustrator terminology</li><li style=\"\">Overview of design and product development processes used in industry and how Illustrator fits into the design workflow</li><li style=\"\">Familiarise yourself with the Illustrator interface</li><li style=\"\">Learn the core tools and features needed to produce basic fashion drawings</li><li style=\"\">Garment drawing workshops</li></ul><p style=\"\"></p><p style=\"\"><strong style=\"\">Learn essential skills required by the fashion industry</strong></p><p style=\"\">Having spent over a decade implementing and training software technologies into fashion brands and retailers across the globe, I spent a lot of time working with the designers. Over the years there seemed to be a common theme in the design room - lots of designers were using Illustrator well but many either couldn&#039;t use it at all or couldn&#039;t use it very well. They also didn&#039;t adhere to any drawing standards or best practises so had problems such as not being able to easily edit each other&#039;s drawings, create colourways quickly or create reusable components properly, making them inefficient. </p><p style=\"\">Illustrator 4 Fashion training has been specifically tailored for fashion, with the needs of the industry in mind. The training can be taken by company design employees, freelance designers, fashion design students and anyone else looking to learn or improve their fashion drawing with Adobe Illustrator.</p><p style=\"\"><strong style=\"\">Course Overview</strong></p><p style=\"\">Most Adobe Illustrator manuals and online training courses are industry generic with many modules not relevant to fashion drawing. It can be hard to know which features to learn and how to develop techniques to draw professional fashion designs. Illustrator 4 Fashion only teaches you the features and techniques relevant to drawing fashion flats, illustrations and garment components. </p><p style=\"\">The Illustrator 4 Fashion course is split into 3 levels; beginner, intermediate and advanced. In this level 1 beginners course, aimed at users with no previous Illustrator knowledge, we start off by introducing you to the Illustrator terminology and interface. You&#039;ll also gain an understanding of the fashion product development process used in industry and how Adobe Illustrator is used as part of this. Following this we will then go through in simple individual tutorials all the functional tools you need to know how to use to get you started with fashion drawing. The final part of the course features a series of garment drawing workshops where we will put together all the skills you have acquired into practise. </p><p style=\"\">Every lecture includes supporting Illustrator work files so that students can follow the lecture exactly.</p>", 
    "end_date": null, 
    "title": "Learn to draw fashion with Adobe Illustrator CC - Beginners", 
    "price": "45.00", 
    "instructors": "Jo Hughes", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472114_a27c_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-draw-fashion-with-adobe-illustrator-cc-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T18:23:32Z"
}