{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>In this course you will discover how you can look your absolute very best</strong>, with YOUR personal COLORS. Make a harmonious, authentic impression - and feel good about it!</p><p>Click “Take This Course” to look your very best or visit my blog (color-style-image.com) for more Informations about my Udemy courses.<br><br>In this course I will cover: Wearing <strong>your best colors will make you look younger, healthier and slimmer</strong>.\n Also, how to strategically wear lines, prints, textures, fabrics and accessories. Fine \ntune your personal and professional style – the basis for a successful, \nlasting image – and save time and money in the process.</p><p>The colors that will make you glow are <strong>based on your skin complexion, hair and eye color</strong>. You will learn all about the different color seasons, do your personal color analysis and download your reference book with color charts for shopping.</p><p>This course will help you to choose garments that flatter your body type and how to bring your figure in perspective with the right colors, lines, cuts, fabrics &amp; accessories.<br></p><p>Take this course today, (with Personality Style test) and create your unique personal style - beyond trends. Make no more costly mistakes, you will be able to shop with focus, \naccording to your individual lifestyle needs, your personal sense of \nstyle and budget.</p>", 
    "end_date": null, 
    "title": "Look Your VERY best – Learn about Color, Style & Fashion ", 
    "price": "25.00", 
    "instructors": "Astrid Feichter", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541658_26e0_2.jpg", 
    "course_url": "https://www.udemy.com/look-your-very-best-all-about-color-style-fashion/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T22:07:10Z"
}