{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">*Over 1,000 people have taken this course, join them.*</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Want to dress better? Well, us girls want you to. This course will take you from fashion newbie to stylish gentleman.</strong>  </p>  <p style=\"\">  \t           Hey there, I’m Jordyn. I&#039;m a girl that’s tired of seeing guys poorly dressed. I created this course to provide practical style advice, from a woman’s perspective.  </p>  <p style=\"\">  \t                  Every guy wants to look and feel his best, but when you have a busy life, it’s easy to brush &quot;fashion&quot; to the side. Truth is, learning the basics of men’s style isn’t as time consuming as it seems, and this course will get you on the right track.  </p>  <p style=\"\">  \t<strong style=\"\">This course was created with love by a lady to provide perspective and advice. This course ensure you’ll always step out in style.</strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>The course will cover must have items, how to wear them, how they should fit, and where to get them.  </p>  <p style=\"\">  \t <strong style=\"\">Is this course for you? This course was created for men that...</strong>  </p>  <p style=\"\">  \t <strong style=\"\">Are style novices and want to learn the basics. </strong>Do you dread getting dressed each morning just because you don’t know what looks good? Do you fear the first date because you don’t know what to wear to impress? Do you feel completely lost in a department store? After taking this course, you’ll be armed with the skills and knowledge to navigate the shopping mall and the confidence to own your own style.  </p>  <p style=\"\">  \t <strong style=\"\">Have a fashion sense but want to refine their personal style. </strong>You have a general idea of what looks good on you, but you want to go deeper than that. You want to learn about outfit pairings and fit. This course will dig into the nitty gritty details you need to become a style expert. It’s time to level up.  </p>  <p style=\"\">  \t <strong style=\"\">Only care about what the ladies think. </strong>You could care less if you like it  - all that matters is if the ladies will. I’m here to tell you what we like, what we don’t, what makes us take a second look, and what to avoid wearing if you want our number.  </p>  <p style=\"\">  \t <strong style=\"\">Ready to dig in? Let’s get started. </strong><strong style=\"\">Sign up now to get lifetime access to this course. With Udemy&#039;s 30-day money-back guarantee, it&#039;s risk-free.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">P.S. $49 is the introductory price. Get this course now before the price goes up! </strong>  </p>  <p style=\"\">  \t<strong style=\"\">Want to keep upping your style game? Visit Jordyn&#039;s site, ManPlusRaw.com for constant men&#039;s style advice and shopping tips!</strong>  </p>", 
    "end_date": null, 
    "title": "Men's Fashion Ultimate Guide: A Woman's Perspective", 
    "price": "20.00", 
    "instructors": "Jordyn Lee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/155076_6c34_4.jpg", 
    "course_url": "https://www.udemy.com/mens-style-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-30T01:12:58Z"
}