{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Printing on Fabric: Five Techniques to Get You Started is your answer to boring old fabric from your local craft store.  Learn how to take your fabrics from basic to extraordinary with a few simple techniques.</p>\n\n<p><strong>Learn Textile Techniques to Get Your Creative Juices Flowing</strong>\n\n  </p>\n\n\n\n\n\n<p>·      Learn 5 techniques that will transform your sewing projects\n\n  </p>\n\n\n\n\n\n<p>·      Learn to determine the difference between natural and synthetic fibers\n\n  </p>\n\n\n\n\n\n<p>·      Choose the appropriate dye or ink for your project\n\n  </p>\n\n\n\n\n\n<p>·      Feel comfortable experimenting with textile design on fabric\n\n  </p>\n\n\n\n\n\n<p>·      Set up appropriate workspaces for each technique\n\n  </p>\n\n\n\n\n\n<p><strong>Experiment with Five Non-traditional Textile and Surface Design Techniques</strong>\n\n  </p>\n\n\n\n\n\n<p>This class will give you the courage and know how to create one-of-a-kind fabric for your sewing projects with the help of five very different techniques.  \n\n  </p>\n\n\n\n\n\n<p>Whether you're a beginner looking to get your feet wet in the textile industry or if you are an experienced sewer or quilter looking to take your project up a notch this course is for you. You can even use it to build your fashion, textile or fiber arts portfolio, a great way to get ready for art school.\n\n  </p>\n\n\n\n\n\n<p>This course is presented in real time so you can follow along and includes detailed instructions about workspace set up and making the most of your home studio.\n\n  </p>\n\n\n\n\n\n<p><strong>Contents and Overview</strong>\n\n  </p>\n\n\n\n\n\n<p>Over 11 lectures and over 1.5 hours of video content you’ll learn how to effectively manipulate dye and chemicals on fabric.\n\n  </p>\n\n\n\n\n\n<p>First I’ll show you how to monoprint, a non-repeatable abstract manipulation of dye on a slick surface that's then transferred onto a piece of fabric.  Then I’ll show you how to apply vibrant splashes of dye with little more than dye powder and a spray bottle.  \n\n  </p>\n\n\n\n\n\n<p>Once you feel comfortable with dyes and inks I’ll show you a non-traditional way to create beautiful surface texture with only a heat gun.\n\n  </p>\n\n\n\n\n\n<p>Then, I’ll introduce you to two chemicals, one used to remove color called, discharge paste and another to remove fibers from fabric, called Fiber Etch.  \n\n  </p>\n\n\n\n\n\n<p>Upon completion of this course you’ll be able to think beyond your local fabric store and create unique textiles on any fabric using fabric dye, inks, heat and chemicals.   </p>", 
    "end_date": null, 
    "title": "Printing on Fabric: 5 Techniques to Get You Started", 
    "price": "20.00", 
    "instructors": "Kimberly Irwin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/851130_0ad7_2.jpg", 
    "course_url": "https://www.udemy.com/printing-on-fabric-5-techniques-to-get-you-started/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T19:45:40Z"
}