{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t <strong style=\"\">&iquest;Te has desesperado alguna vez porque las prendas que est&aacute;n de moda no te sientan bien? &iquest; no disfrutas de comprar y vestirte porque no acabas de verte bien, de acertar con tus estilismos? &iquest;Te gustar&iacute;a disimular ciertas partes de tu cuerpo que no te gustan y no sabes c&oacute;mo? &iquest;Crees que por no tener un cuerpo de modelo no te puedes sacar mucho partido?</strong>  </p>  <p>  \t No existe un solo tipo de belleza femenino.  </p>  <p>  \t Estad&iacute;sticamente se han identificado al menos cinco figuras-tipo, todas ellas tan admirables como el cuerpo de reloj de arena, que es el patr&oacute;n ideal en este momento de la Historia.  Todas las mujeres somos bellas, pero no cabe duda que siempre podemos mejorar nuestra imagen, trabajando m&uacute;ltiples aspectos.  En este curso nos centraremos en aprender a modelar las proporciones de nuestro cuerpo.  </p>  <p>  \t Por fin un VIDEOCURSO donde se desgranan los secretos del buen estilismo para cada tipo de cuerpo.  </p>  <p>  \t Aqu&iacute; encontrar&aacute;s explicados con detalle los tipos de prenda, combinaciones, y texturas que te convienen y las que no, y lo que es m&aacute;s importante: aprender&aacute;s por qu&eacute;. Conocer&aacute;s las reglas b&aacute;sicas para reconocer por ti misma qu&eacute; disimula tus partes menos agraciadas y qu&eacute; potencia tus puntos fuertes. Explicado de forma muy sencilla, al alcance de cualquiera.  </p>  <p>  \t Comos sabemos que la teor&iacute;a no basta, cada secci&oacute;n se concluye con ejemplos pr&aacute;cticos y ejercicios para que compruebes que has entendido correctamente lo que debes conocer.  </p>  <p>  \t Te recomendamos ponerlo en pr&aacute;ctica lo antes posible, revisando las prendas de tu armario a la luz de lo que has aprendido, para que valores lo que te favorece y deseches la ropa que te est&aacute; boicoteando.  </p>", 
    "end_date": null, 
    "title": "Saber vestir según tu silueta. Sácate más partido.", 
    "price": "20.00", 
    "instructors": "Rosanna Gil", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/133492_193f_6.jpg", 
    "course_url": "https://www.udemy.com/saca-partido-a-tu-tipo-de-cuerpo/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-14T11:24:24Z"
}