{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn the skills needed to create a screen using one of your designs and then print it onto t-shirts or fabric at home, without the need for a dark room.</p>\n\n<p><strong>Master Screen-Printing Techniques and Turn Your Original Designs Into Money Making T-shirts.</strong>\n\n  </p>\n\n\n\n<p>·      Learn how to create a screen for printing\n\n  </p>\n\n\n\n<p>·      Discover best printing practices\n\n  </p>\n\n\n\n<p>·      Make designs permanent and able to withstand washing and regular wear and tear\n\n  </p>\n\n\n\n<p>·      Properly clean and care for your screen so you can use it repeatedly \n\n  </p>\n\n\n\n<p><strong> </strong>\n\n  </p>\n\n\n\n<p><strong>Discover How Fast and Easy it is to Print Single-Color Images.</strong>\n\n  </p>\n\n\n\n<p>Learning how to screen print from home gives you the opportunity to create custom clothing for your friends and family or even to start your own business selling t-shirts with your clever and cute designs on sites like Etsy.  \n\n  </p>\n\n\n\n<p>Anyone interested in printmaking, fashion or textile design and the fiber arts will benefit greatly from having screen-printing skills in their arsenal of techniques.  It's a versatile skill that develops a little more each time you move dye across the screen.  With a little practice you will be confident to tackle intricate designs.\n\n  </p>\n\n\n\n\n\n<p><strong>Overview</strong>\n\n  </p>\n\n\n\n<p>Suitable for the beginner, through this course of 12 lectures and an hour of video content, you’ll learn everything you need to print single-color images onto t-shirts or fabric.  \n\n  </p>\n\n\n\n<p>First, I’ll show you the supplies you’ll need to get started and then how to create a padded work surface to attach your fabric or t-shirts to.  Once our workspace is ready to go, I’ll take you through everything you’ll need to know to create a screen using one of your original designs.  I’ll show you how to stretch the screen-printing fabric, attach it the frame and make it waterproof.  Then I’ll demonstrate how to transfer the design and use drawing fluid to block out the areas of the screen that the dye will penetrate, before finally filling the rest of the screen with screen filler—so dye doesn’t end up where it shouldn’t. \n\n  Once you complete this course you will have the know how to create almost any design onto a screen and the confidence to experiment with other print techniques </p>", 
    "end_date": null, 
    "title": "Screen Printing Made Easy", 
    "price": "20.00", 
    "instructors": "Kimberly Irwin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/876950_5947_2.jpg", 
    "course_url": "https://www.udemy.com/screen-printing-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Fashion"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-13T17:09:52Z"
}