{
    "selfpaced": false, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                    \n                    \n                    Coaching educators to create digital learning environments is a challenging, important, and highly collaborative role. Individuals who play this role are instrumental in cultivating a digital learning culture within their school, district and/or state. This course allows you to learn along with your colleagues from other schools and districts to enhance your digital learning content knowledge and further develop coaching strategies. During this self-directed, peer-supported, MOOC-Ed you will:\r\n\r\ndeepen your understanding of what it takes to coach others to integrate technology effectively;\r\nexplore relevant frameworks (e.g. TPACK, SAMR, Four C’s), strategies, tools, and resources to advance your digital learning coaching efforts;\r\nexperience multiple opportunities for personalized application of your new learning and job-embedded practice; and\r\ndevelop and share a coaching plan to support your school/district’s digital learning culture.\r\n\r\nThis MOOC-Ed  is designed specifically for instructional technology coaches, instructional technology facilitators, technology integration specialists, media specialist, mentor teachers, and others who guide teachers’ integration of digital learning to directly enhance and support student learning.\n\n                                    ", 
    "end_date": "2016-03-28T00:00:00Z", 
    "title": "Coaching Digital Learning", 
    "price": 0, 
    "instructors": "Abbey Futrell", 
    "institution_name": [
        "Friday Institute", 
        "North Carolina State College of Education"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://place.fi.ncsu.edu/course/view.php?id=34", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "MOOC-ED"
    ], 
    "start_date": "2016-02-15T00:00:00Z"
}