{
    "selfpaced": false, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                    \n                    \n                    Foundations of Teaching for Learning is a program of study primarily for people who are currently teaching but have had no formal teacher education. This course is an introductory one that considers the three domains of being a teacher:  Professional Knowledge and Understanding; Professional Practice; and Professional Values, Relationships and Engagement.\n\nAnnouncement for US based teachers:\n\nCoursera and its partners are proud to offer eligible teachers in the US free Course Certificates for this course and other high-quality teacher professional development courses, through the Connected effort announced by President Obama.\n\nTo participate in this opportunity, US district leaders simply need to approve Coursera teacher professional development by completing a brief form at: www.coursera.org/tpd.\n\nUS Teachers interested in this opportunity are also encouraged to follow the link to learn more and www.coursera.org/tpd.\n\nOnce a district’s form has been verified, the district leader will be notified and teachers in the district will receive access to free verified certificates for Coursera professional development.\n\nCoursera and the Commonwealth Education Trust thank educators for the hard work they do every day and hope this opportunity will assist US teachers to continue developing their craft in a meaningful and flexible way.\n\n                                            Syllabus\n                        Being a Teacher: A Professional PrivilegeThis first week gives an introduction to the course and asks what it is to be a teacher. This is a chance for you to reflect on you own identity and aspirations as a teacher and gain an informed understanding of the world, or worlds, of childhood. You will build on and extend your existing knowledge as a teacher. We will discuss the ways in which teaching can be defined as a profession and what it means to be a professional teacher.Thinking About LearningThe videos in this week are all related to the theme of children and young people’s learning. The emphasis is on thinking ‘skills’ – learning how to think effectively and creatively. We ask how you as a teacher ensure that students are thinking while they are in your classroom. You will write an essay which brings together the various strands of your learning. This is for your own professional development, but it will also help you to consider what the implications are for teaching and learning in your own classroom.How Good is My Classroom?This week is focused on the classroom and asks you to consider the question ‘How good is my classroom?’ It asks you to revisit, replay, and bring together the many ingredients that make a classroom a stimulating place for learning and an enjoyable and engaging place for teaching. We come back to the importance of assessment for learning. As Dylan Wiliam says, ‘assessment is minute by minute in the classroom’, not simply something that happens at the end of the course.Continuing to Learn in a Changing WorldThis week focuses on ways that we can help children to live and learn in a world of change. We will consider the importance of cultivating creativity and acknowledging multiple types of intelligence. We will also look at learning that takes place informally outside of school. We will identify key features of excellent practice in schools and look at the benefits of professional development. This is the final week of this course. If you have stayed with us to the end, congratulations! This may be an ending but it is also a beginning as you move on to the next course.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Foundations of Teaching for Learning 1: Introduction", 
    "price": 0, 
    "instructors": "John MacBeath", 
    "institution_name": [
        "Commonwealth Education Trust"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/learn/teaching", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}