{
    "selfpaced": false, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                    \n                    \n                    You will consider various techniques which help to assess student learning. The course also will help you to acquire the skills to develop and use appropriate assessment procedures. \n\nThis course is part of the Foundations of Teaching for Learning program which is designed to assist people who are currently teaching but have had no formal teacher education improve their understanding of their role and work as a teacher.  This set of courses will enhance your knowledge and understanding about learning and teaching and what makes a teacher a professional.  \nPractical activities are provided to assist you in using what you have learned to improve your teaching practice.  While these are optional, it is strongly recommended that you undertake them if at all possible.\n\nOf particular importance is a guide to the development of a portfolio to help you organize and document your thinking about what you have learned. In addition, you may be able to use the portfolio to access other opportunities in the future.\n\nAnnouncement for US based teachers:\n\nCoursera and its partners are proud to offer eligible teachers in the US free Verified Certificates for this course and other high-quality teacher professional development courses, through the ConnectED effort announced by President Obama.\n\nTo participate in this opportunity, US district leaders simply need to approve Coursera teacher professional development by completing a brief form at: www.coursera.org/tpd.\n\nUS Teachers interested in this opportunity are also encouraged to follow the link to learn more and www.coursera.org/tpd.\n\nOnce a district’s form has been verified, the district leader will be notified and teachers in the district will receive access to free verified certificates for Coursera professional development.\n\nCoursera and the Commonwealth Education Trust thank educators for the hard work they do every day and hope this opportunity will assist US teachers to continue developing their craft in a meaningful and flexible way.\n\n                                            Syllabus\n                        An Introduction to Assessment Theory and PracticeWhat is the purpose of assessment? Research has shown that opinions on this differ around the world. In this week’s general introduction to assessment theory and practice, you can compare your own experience of assessment with some contrasting experiences from different parts of the world. We will take a clear look at how educational assessment integrates and links curriculum, teaching, and learning. We will then look at cultural factors that may influence the teaching practices of your workplace.The nature of feedback in improving teaching and learningFeedback can vary greatly in its effectiveness. In the lectures this week we will identify the key characteristics of good (and bad) feedback. We will explore the practice of incorporating feedback into teaching. Teachers and students have their own views on what constitutes effective feedback. Understanding these views can help you to decide how you should give feedback to your own students. We will ask you to consider how you can best provide feedback to minority students. By the end of the week you should be able to generate your own examples of effective feedback for students.Reporting student achievementWelcome back to our third week of exploring ideas connected to assessment. In the lectures this week, we explore current approaches to reporting and raise important questions about their validity. We will consider the strengths and weaknesses of standardized test scores and point you to effective techniques for writing reports and giving feedback that will actually help students and pupils improve their learning. We will give you tools for use in your own practice and encourage you how reporting practices used with majority groups might need to be modified for use with parents from minority groups.Guidelines for developing and using objectively answered question proceduresThis week we describe specific techniques for designing assessment tools. The assessment tool that we will focus on is multiple-choice questions (MCQs), however we will present a number of different formats. You will be given practical advice and tools for creating a variety of good test questions. The key point to note is that unless such objectively-scored questions are written well, getting them right will not be an indicator of knowledge or skill in the domain being assessed. Test-wiseness (i.e., knowing how to answer such questions) increases test scores but this is no guarantee students actually understand more. Hence, care and attention needs to be paid to how test questions are written. Stay active – and enjoy the learning this week. Guidelines for developing and using human judgement scoring proceduresLast week we focused on assessments that could be scored against agreed correct answers. We will now look at judgement-based assessments. The main assessment method used in teaching has changed from  objective-style to using judgement-based assessment. This change has brought forward some new issues for us to consider.  We will introduce you to challenges that are inherent in designing and evaluating student performance in open-ended formats in the first lecture. In the next two lectures we will focus on two assessment tools that are often used under judgement-based conditions: the rubric and the essay. In the last lecture, we will explore the concepts of moderation and inter-rater reliability. The topics for this week require you to grapple with notions of accuracy, quality, reliability, validity, and error. By the end of the week you should be able to design a valid and reliable assessment task and corresponding marking scheme (rubric).Guidelines for developing and using procedures that involve students in assessmentIn this final week we will define two assessment practices that involve student participation: self-assessment and peer assessment. We will provide you with exemplars of both kinds of assessment for your own personal use, and point you to important issues that you will need to consider when preparing your own assessments. By the end of this week you should be able to create peer and self-assessment tasks that facilitate learning for children you teach.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Foundations of Teaching for Learning 6: Introduction to Student Assessment", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Commonwealth Education Trust"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/learn/learning-assessment", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}