{
    "selfpaced": false, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                    \n                    \n                    Múltiples y diversas manifestaciones muestran que se están produciendo unos profundos cambios en el mundo. El modelo de la sociedad industrial está dejando paso a un nuevo modelo de sociedad, aún difuso, en el que la capacidad de transformar la información en conocimiento es clave. Es fácil deducir que para esta nueva sociedad emergente se necesita un concepto de educación bien distinto al que requería la sociedad industrial. Sin este cambio educativo difícilmente se podrá conseguir satisfactoriamente el cambio y, consecuentemente, instalarse adecuadamente en un mundo que va a alterarse radicalmente.\n\nEl curso tiene dos objetivos. El primero es presentar el fenómeno de la transformación de la sociedad que estamos viviendo y los fundamentos para definir el mundo que está emergiendo como el de la sociedad del conocimiento.  La pretensión de la primera parte es disponer de un escenario suficientemente detallado y sólido de lo que está sucediendo y superar así la visión e interpretación triviales que pueda haber sobre un nuevo modelo de sociedad. Sin esta buena base es difícil fundamentar el siguiente objetivo del curso: el papel de la educación.\n\nEl objetivo de tratar la educación en este curso es para presentarla en estrecha relación con una intensa crisis cultural que inevitablemente tiene que sobrevenir para que no aumente el desajuste entre el mundo tecnológico -planetario, desigual y contradictorio- que hemos levantado y los valores culturales de otros tiempos con los que queremos mirar e interpretar el mundo de hoy y el que se avecina. Así que se tratará la estrecha relación que hay y debe haber entre educación y cultura. De igual modo se verá en el curso la relación entre tecnología y educación, no desde el punto de vista instrumental, sino cultural.\n\nLa pretensión del curso es que de esta observación del fenómeno actual de  cambio, y de la interpretación del papel de la educación para la orientación y control de ese cambio, surjan elementos inspiradores de acciones educativas precisas ajustadas a las múltiples realidades concretas desde las que se están sintiendo los desafíos de vivir en el siglo XXI.\n\nEl planteamiento didáctico del curso seguirá la estructura de un viaje por el tiempo, por lugares y también por conceptos que haga ameno el recorrido durante las siete semanas. En cuanto a la parte textual, habrá la experiencia de lectura de piezas multimedia concebidas y escritas para la lectura en pantalla, y especialmente en smartphones y tabletas.\n\nMás información\n\n                                    ", 
    "end_date": "2015-09-22T00:00:00Z", 
    "title": "HGA.1x: Utopedia: Educación para una Sociedad del Conocimiento", 
    "price": 0, 
    "instructors": "Antonio Rodríguez de las Heras, Beatriz de las Heras Herrero and Jaime Cubas", 
    "institution_name": [
        "Universidad Carlos iii de Madrid"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.edx.org/course/utopedia-educacion-para-una-sociedad-del-uc3mx-hga-1x", 
    "duration": "9 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-07-21T00:00:00Z"
}