{
    "selfpaced": false, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                    \n                    \n                    Join High Tech High in this groundbreaking new course that follows the educational experiences of various students in our schools. We will will listen to them as they tell us How To Teach Us.\n\n                                            Syllabus\n                        Significant LearningWhen High Tech High educators go “on the road” to talk about our school, the first thing we ask the audience is to reflect on their most significant learning experiences. \n\nOur first module, “Significant Learning” will look closely at these moments, first through the eyes of High Tech High students and then through those of our course’s participants. \n\nWe ask that you use this data to identify the principles of significant learning and to discuss what these might mean for your own practice. The Day-To-DayThe average student day looks very different at High Tech High that it does in traditional schools. In this module, students will talk about how their daily schedule has impacted their education. We will explore the reasons why a learning schedule within a school setting is so important and how you can incorporate student voice into its design. Finally we will charge course participants with designing a schedule for their ideal school. The will be shared with other course participants who will be asked to provide feedback.How We Show What We KnowAssessment is one of the most interesting aspects of project based learning. Students working in a multidisciplinary education style logically answer the question of “what have you learned?” in a multi-faceted manner. To assess students within their learning environments we use quite a few different models of engagement, and some we are even developing as we speak.In this module you will see how students learn at High Tech High as well as how teachers bring student voice into the assessment process. You will look at exhibitions, digital portfolios, and student led comments that are crafted by both the instructor and the students in tandem. \n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "How To Teach Us", 
    "price": 0, 
    "instructors": "Patrick Yurick and Larry Rosenstock", 
    "institution_name": [
        "High Tech High"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/learn/how-to-teach-us", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}