{
    "selfpaced": false, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                    \n                    \n                    Annoyed of students being distracted by their mobile phones? Tired of seeing students falling asleep after a night of gaming? Let's turn our students from passive consumers of technology into active producers of technology. Let's get them to develop apps, design games and start their own websites.\r\nTechnology is everywhere, if we like it or not. And nearly all future jobs require us to understand it. To respond to this, governments are including computing in national curricula, as a subject taught at all ages but also as part of other subjects. This means the responsibility is on to us, the teachers, because we need to teach it. In the UK already every primary school teacher has to teach computing concepts and in many other countries more and more of us will be required to teach computing or at least integrate computing concepts, ideas and processes into the teacher of our subjects. So let's get ready for this.\r\nIf you are a Computer Science teacher who needs new ideas, tools or resources on how to teach your subject. If you are an Art teacher who suddenly has to talk about website design, user experience and user interfaces in your subject. If you are a Biology teacher who has to teach your students how to programme sensors taking important measurements in an experiment. This MOOC is here to help you. We will be exploring the ideas, concepts, processes and skills that are important in computing and then introduce you to the tools, resources and lesson activities that can help you teach these concepts and processes in the classroom.\r\nThe course is designed as an introductory course, for you to use as a starting point to explore some of the ideas and tools further. It is relevant to secondary teachers from all subjects and all levels of experience. A basic amount of knowledge on operating computers and other technology devices is expected but you don't need prior knowledge of computing. The course lasts for six weeks and requires around 2 hours of work per week. The course has been designed by teachers for teachers and will feature interviews, presentations, and activities from teachers, professors, students and computing professionals.\r\nEnrol in the course and join the discussion on our social media channels via the Facebook group and Twitter using #CScourse\n\n                                    ", 
    "end_date": "2014-12-15T00:00:00Z", 
    "title": "How to Teach Computing: An Introduction to Concepts, Tools and Resources for Secondary Teachers", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "European Schoolnet Academy"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.europeanschoolnetacademy.eu/web/how-to-teach-computing", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2014-11-03T00:00:00Z"
}