{
    "selfpaced": false, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                    \n                    \n                    All of us, children and adults alike, have different strengths and weaknesses in our learning.  Historically, however, schools have approached student learning with a one-size-fits-all mentality and have struggled to adapt to changing student needs. That ends now.\r\nIn order to help you change the way your students learn, this course will expand your knowledge related to learning differences, provide actionable strategies to impact the learning experience of your students, and cultivate positive habits of mind. At the end of this course, you will have: \r\n \r\n\r\nDeepened your own understanding of learning differences and the related constructs of motivation, executive function, and working memory.\r\nExplored relevant strategies for supporting students with learning differences.\r\nApplied strategies in your classroom and provided a more personalized learning experience for all of your students. \r\n\r\nThe Learning Differences MOOC-Ed is designed for educators including teachers, coaches, administrators, or allies who play a role in meeting the needs of all students. If you're interested, register here - we would love to learn with you.\n\n                                            Syllabus\n                        \r\nIntroduction: Embracing New Habits of Mind \r\nWorking Memory\r\nMotivation\r\nExecutive Function (Part One)\r\nExecutive Function (Part Two)\r\nConclusion\r\n\r\n \r\nFollowing the six weeks, instructional coaches, media coordinators, and teacher leaders will have the opportunity to participate in an additional three units focused on strategies for coaching and supporting other teachers in their work with learning differences.\n                                    ", 
    "end_date": "2015-11-09T00:00:00Z", 
    "title": "Learning Differences", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Friday Institute", 
        "North Carolina State College of Education"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://place.fi.ncsu.edu/course/view.php?id=14", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "MOOC-ED"
    ], 
    "start_date": "2015-09-28T00:00:00Z"
}