{
    "selfpaced": false, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                    \n                    \n                    On the Hunt for Feedback: Self-Directed Teacher Improvement \n\nTeaching\nis isolating.  Most of the work happens behind a closed door.\n Teachers want feedback about their teaching, but encounter three\nproblems:\n\n1.\nThey don't get much.  The principal or department head doesn't visit very\noften.  And there’s no built-in structure at their school for peer\nobservation. \n\n2.\nThe feedback isn't helpful or actionable. \n\nSometimes\nit's just happy talk -- 98% of American teachers are rated satisfactory -- and\nwhile everyone likes a pat on the back, evaluations that say \"you were\nwonderful\" don't make better teachers.  Or sometimes the feedback is\ncritical in ways that don’t present clear next steps.  Sometimes it's\nvague or just plain wrong.  \n\n3.\nSome teachers can be defensive.  \n\n(Yes,\nwe know – only SOME people are defensive, but not YOU.  You are different.\n You handle feedback with grace, confidence, and a \"let's fix\nthis\" orientation. {Except sometimes maybe not.}) \n\n***\n\nThis\ncourse is based on a simple idea: that teachers take control of their own\nimprovement by aggressively seeking out and acting upon feedback about their\nteaching. \n\nThe\nidea may be simple, but the work is not. So we should say straight up: this\nis NOT a typical MOOC. Participants in this MOOC won’t improve their\nteaching skills by just watching lectures. Participants also won’t really take\nanything away from this MOOC if they do it “a la carte:” we believe they need\nto do every part of every assignment in order to leverage the kinds of changes\nin practice that we think are possible in a course like this. \n\nWe\nall wish that our public school system was such that every teacher would have\neasy access to great coaching – or even any coaching at all. But unfortunately that’s\nnot the world we live in. Indeed, high school athletes can EXPECT to be\ncoached, but schoolteachers somehow need to track it down themselves. Teachers\ndeserve better. But they have a choice: bemoan\nthe lack of legit coaching that they get and will likely continue to get, or\nbecome the rare teacher who builds her own improvement loop.  \n\nClass\n1: The Big Picture on Teacher Feedback\n\nWe\nwill review the realities of teacher feedback in typical schools, looking at\nwhere that feedback usually comes to teachers and how it’s processed.  In\nmost schools, the teacher plays a passive role in this—waiting until an\nevaluation comes to them.  We believe the best teachers create the\nopposite type of process: they HUNT down feedback, drag it back to their lairs,\nand use it.  They realize that if they wait for good feedback to come to\nthem, they might wait a long, long time.  \n\nClass\n2:  Case Study: Peer Feedback\n\nWe\nprofile teachers who've asked their peers to give them critical\nfeedback. How did they ask their colleagues for help? What rubric or\nobservation protocol did they use? How did they choose what to focus on after\nthey got the feedback? What kind of action/improvement plan did the teacher\nwrite? What happened when the teachers tried to implement their action steps?\nWhat did their peers say when they came back to their classroom a few weeks\nlater? \n\nParticipants\nin this course will do the exact same assignment: they will seek out feedback\nfrom a peer to generate their own action plan and a reflection on its\nimplementation. Participants will also be assigned to give and receive feedback\non these action plans from other students in our MOOC who are working on\nsimilar focus areas in similar contexts (e.g. other math teachers who are\ntrying to improve the rigor of their questioning). \n\nClass\n3: Case Study: Student Feedback  \n\nFirst\nwe review the emerging new evidence, from the Gates Foundation MET Project,\nabout student surveys and their power for accurately assessing teachers’\nstrengths and weaknesses.  Then, similar to the Peer Feedback class, we\nshow a teacher going through all the steps, interspersed with commentary from\nthe course instructor.\n\nAgain,\nour MOOC participants will do the same assignment: create a student survey\n(we’ll show you examples); administer the survey; tabulate the data; write and\nimplement a plan; and get and give feedback from/to a peer with a similar focus\narea. \n\nClass\n4: Case Study: Assessment Data\n\nFirst\nwe cover the evidence of how schools and teachers are using student assessment\ndata to drive instructional improvements. Then we once again examine examples\nof teachers who go through all of the steps of administering a unit assessment,\nanalyzing the data, and designing and implementing a targeted instructional\nintervention. \n\nMOOC\nparticipants will do the same assignment, and then get and give feedback\nfrom/to a peer who teaches a similar subject and/or grade level.  \n\nCourse\nLearning Outcomes:\n\nTo describe both structural and psychological\nimpediments to teachers receiving effective feedback about their practice, as\nwell as strategies to overcome those impediments. To engage in self-directed improvement via three\ntypes of data collection—action plan—reflection assignments: peer observation,\nstudent surveys, and student assessment data analysis.To provide critical support and feedback to fellow\nMOOC participants who have similar teaching contexts and/or improvement focus\nareas. \n\n\n\n\n\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "On the Hunt for Feedback: Self-Directed Teacher Improvement", 
    "price": 0, 
    "instructors": "Orin  Gutlerner", 
    "institution_name": [
        "Match Teacher Residency"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/course/teacherfeedback", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "9999-12-31T23:59:59Z"
}