{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Education &amp; Teaching\n                                                                                                    &gt; Teacher Development\n                                                            \n                            \n                                                \n                    \n                    \n                    Learn 3 high leverage ideas and techniques to thrive in your first (or fifteenth) year of teaching.\n\n                                            Syllabus\n                        Teaching and Learning: Key BeliefsLectures during the first week will introduce students to the Match Teacher Residency’s key beliefs around teaching and learning. Week 1 will discuss the dynamics of classroom learning as well as the complexly layered decisions that teachers make during every period of instruction. Students will be asked to complete a quiz covering lecture material as well as a quiz on a short supplemental reading. We recommend approaching the material by first watching the lecture videos and then doing the associated reading. Afterwards, the quiz is a summative assessment that allows you to demonstrate mastery of the Week 1 material.ConsistencyLectures during the second week will introduce students to the concepts of Consistency and Automaticity in classroom management. Without the ability to make certain predictable management decisions on a minute-to-minute basis, a rookie teacher will have trouble devoting sufficient mental \"bandwidth\" to higher-level teaching decisions about content, rigor, engagement, etc. Students will be asked to complete the Week 2 Quiz covering lecture material and a short supplemental reading. During Week 2 you will also complete your first peer-reviewed planning assignment. We recommend approaching the material by first watching the lecture videos and pausing to do the associated reading when prompted. Alternatively, watch the videos in their entirety and then do the reading. RatioLectures during Week 3 will focus on the concept of \"Ratio\" in the classroom: how much of the mental heavy lifting are your students doing relative to you, their teacher? Ratio has two dimensions: participation ratio (the number of students involved), and thinking ratio (the rigor of the task students are engaged in). In an ideal classroom, the teacher is doing relatively little of the high-level thinking, and (all) students are consistently engaged in those rigorous cognitive tasks.  Week 3 will also introduce a strategy for boosting the ratio in your own classroom: the Turn and Talk. Relationship BuildingDo you call your students or their parents at home? While there is a lot of anecdotal evidence to suggest that building relationships with students can increase classroom effort, many teachers don't proactively try to do similar outreach to the parents or guardians of their students. Week 4 offers anecdotes and a rigorous scientific study on the value of calling home. We try to make the case for why calling home is too effective *not* to do, then offers detailed advice on how to script \"the praise call\" and \"the correction call.\"  This week, in addition to the quiz, you'll also be asked to do a short written assignment in which you plan and script phone calls to your students or their parents. Click here for guidelines and to access this assignment.  \n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Surviving Your Rookie Year of Teaching: 3 Key Ideas & High Leverage Techniques", 
    "price": 0, 
    "instructors": "Orin  Gutlerner", 
    "institution_name": [
        "Match Teacher Residency"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/learn/rookie-teaching", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}