{
    "selfpaced": false, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                    \n                    \n                    In this education and teacher training course we will explore effective teaching methods for biology. We will emphasize approaches proven to be effective and show you how to implement them. We will also give you the opportunity to reflect on your own teaching experience and exchange ideas and share challenges with other learners in the course.\n\nWe will begin by looking at the most common method of teaching science, the lecture. We’ll discuss what the lecture method does well and look at data that illustrates when it is less effective. You will hear highly successful teachers talk about their experience with lecture and how they modified their lecture time to more actively engage students. We’ll investigate creating learning objectives and how they can be used to communicate your expectations to students. You will practice writing your own learning objectives and see how they can streamline exam construction. We’ll look at a variety of ways to include active learning during class time, discuss how active learning strategies support your learning objectives, and give you practice developing learning activities for biology topics you find challenging to teach. \n\nLastly, we’ll look at how to use resources for student learning outside of class, and how to know that your students have successfully learned from both in-class and outside of class activities.\n\nOur course is designed for instructors, or instructors-to-be, of undergraduate-level biology. High school instructors of AP Biology, post-doctoral fellows and graduate students looking ahead to teaching should find the course useful. The course can serve as a means of professional development. There are no pre-requisites, although prior satisfactory completion of a college biology course is highly recommended.\n\n                                    ", 
    "end_date": "2016-02-09T00:00:00Z", 
    "title": "T003x: Effective Teaching Strategies for Biology", 
    "price": 0, 
    "instructors": "Kathleen Archer", 
    "institution_name": [
        "Trinity College"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.edx.org/course/effective-teaching-strategies-biology-trinityx-t003x", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-01-05T00:00:00Z"
}