{
    "selfpaced": false, 
    "topic_name": [
        "Teacher Development"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, you will learn ideas for teaching reading and writing courses, and how to include grammar instruction within them.  Learn how to help students with differing types of reading problems and how to implement both intensive and extensive reading strategies.  Learn strategies to engage students in the stages of writing--pre-writing, writing, and post-writing.  Find out about different writing problems that students may encounter.  Incorporate grammar through the use of noticing and input enhancement.\n\n                                            Syllabus\n                        Overcoming Reading Difficulties:  Dorothy in the Land of OzIn this module, learners are introduced to some of the basic principles of reading, as well as three basic types of reading problems common in TESOL.  Learners will gain insight into how to overcome these basic types of reading problems through a careful understanding of principles such as prediction, involvement, and authenticity.  Reading Strategies:  The Tortoise and the Hare In this module, learners are introduced to two different types of reading strategies: extensive and intensive.  Strategies for intensive reading, such as skimming and scanning, are introduced.  Strategies for extensive reading, such as reading for pleasure and reading for connection are also discussed.  Overcoming Writing Difficulties:  Hansel and Gretel, or How to Literally Get Out of a JamIn this module, learners are introduced to the writing process, with attention paid to pre-writing, writing, and post-writing activities.  Learners also explore the concepts of recursion and appropriation. Writing Techniques: Aladdin and the 1,000 Arabian NightsIn this module, learners are given the opportunity to learn about strategies from good writers, in particular, how good writing is generated from reading, speaking, and critical thinking.  Learners are also introduced to the six traits of writing, and the need to consider both voice and audience.  The Princess and the PeaIn this module, learners are given the opportunity to think about how to integrate grammar into a reading and writing class.  Teachers are taught the principle of noticing, and the importance of noticing for both learner and instructor.  Teachers are also taught about how to enhance input in order to help students notice, and hopefully, acquire language.AssessmentWatch the final review video to verify your understanding of the course material.  Then proceed to the final checkpoint quiz.  \n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Teach English Now! Second Language Reading, Writing, and Grammar ", 
    "price": 0, 
    "instructors": "Jessica Cinco, Dr. Shane Dixon and Dr. Justin Shewell", 
    "institution_name": [
        "Arizona State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/learn/tesol-writing", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}