{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">    In diesem Kurs lernen Sie, die kyrillische Schrift richtig zu lesen.</strong>  </p>  <p style=\"\">  \t  Damit schaffen Sie die Grundlage für das Erlernen der russischen Sprache, aber natürlich auch für viele andere slawische Sprachen, etwa Serbisch oder Ukrainisch.  </p>  <p style=\"\">  \t  Auch wer schon einmal versucht hat, im Urlaub die Moskauer U-Bahn zu benutzen, weiß wie wichtig es ist, vorher das russische Alphabet zu lernen.  </p>  <p style=\"\">  \t  Die Videolektionen beinhalten:  </p>  <ul style=\"\">  \t<li style=\"\">Korrekte Aussprache jedes einzelnen Buchstaben, sowie jeweils drei repräsentative Wortbeispiele.</li>  \t<li style=\"\">Änderungen der Aussprache z.B. aufgrund der Position</li>  \t<li style=\"\">Grundregeln zur richtigen Betonung.</li>  </ul>  <p style=\"\">  \t  Der ganze Kurs baut auf zahlreichen Audio-Beispielen auf, gesprochen von einer russischen Logopädin, die schon seit 1995 mit der russischen Sprache erfolgreich arbeitet.  </p>  <p style=\"\">  \t    Um das Memorisieren zu erleichtern, haben wir alle Beispiele mit entsprechenden Bildern verknüpft. Alle Beispielwörter wurden gezielt so ausgewählt, dass die Aussprache der Buchstaben gut hörbar ist.  </p>  <p style=\"\">  \t  Zusätzliche schriftliche Übungen helfen Ihnen dabei, das gelernte noch fester im Langzeitgedächtnis zu verankern.  </p>  <p style=\"\">  \t  Wie lange es dauert, bis man die russische Schrift fließend lesen kann, ist individuell sehr unterschiedlich. In der Regel lassen sich aber schon nach einigen Tagen regelmäßiger Auseinandersetzung mit dem Alphabet gute Ergebnisse erzielen.  </p>", 
    "end_date": null, 
    "title": "Das Russische Alphabet", 
    "price": "20.00", 
    "instructors": "Dr.  Anna Obukhovskaya", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240164_d48b_2.jpg", 
    "course_url": "https://www.udemy.com/das-russische-alphabet/", 
    "currency": "USD", 
    "subject_name": [
        "Russian"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-09T17:17:07Z"
}