{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t  Though the Russian language is <strong style=\"\">complex language</strong> for learning, its grammar system has logical structure. Anyone who will study Russian diligently will find Russian grammar not so difficult to understand.  </p>  <p>  \t   In this course you will learn <strong style=\"\">Russian grammar</strong>, focusing on <strong style=\"\">nouns</strong>:  </p>  <ul style=\"\">  \t<li>noun genders, number, cases;</li>  \t<li>adjective endings;</li>  \t<li>verb endings, tenses.</li>  </ul>  <p>  \t   Besides grammar lectures, you will find a lot of <strong style=\"\">illustrated lexical topics</strong> with new words and texts to listen and read, for example:  </p>  <ul style=\"\">  \t<li>My Family</li>  \t<li>Grocery Store</li>  \t<li>Days of Week. A Daily Routine</li>  \t<li>Animals</li>  \t<li>Seasons</li>  \t<li>Hobbies</li>  \t<li>Professions, etc. </li>  </ul>  <p>  \t   There are also exercises to practice and quizzes in most sections.  </p>  <p>  \t  You will also get a <strong style=\"\">downloadable PDF</strong> with compilation of this course grammar (about 30 pages) and illustrated lexical topics PDF (15 pages).  </p>  <p>  \t Duration of the course video lectures is <strong style=\"\">about 2.5 hours</strong>. To complete all the exercises, quizzes, to read included texts and to scrupulously study all the grammar rules you will need much more time.  </p>  <p>  \t It is impossible to learn Russian just memorizing a set of phrases or by sentence models because in Russian words in sentences are used in the required case. You need to understand clearly how to change words, what form to use, how to combine words together, what case to use with particular preposition, etc. All this — <strong style=\"\">cases values, ending changes, prepositions use </strong>and more — you will find in this course lectures with explanations, examples and exercises.  </p>  <p>  \t We hope You will love Russian language!  </p>", 
    "end_date": null, 
    "title": "Learn Russian Language - Russian For Beginners 2", 
    "price": "30.00", 
    "instructors": "Ilona Protchenko", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/141614_8174_2.jpg", 
    "course_url": "https://www.udemy.com/russian-for-beginners-2/", 
    "currency": "USD", 
    "subject_name": [
        "Russian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-03T22:08:13Z"
}