{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t  The best way to learn a foreign language is by listening and repeating after a native speaker. Therefore, <strong>Learn Russian in Conversation </strong>course is entirely based on dialogs by native speakers supported by most useful grammar and most common phrases.  </p>  <p>  \t<strong>Learn Russian in Conversations </strong>is perfect for intermediate level students who wish to acquire and improve speaking and listening skills in Russian language. The aim of this course is to familiarize students with the Russian language and assist them in acquiring linguistic competence to handle everyday conversational situations.  </p>  <p>  \t  The course is taught both in English and Russian and includes a series of situational contexts in which participants hold dialogs in short social exchanges. The course provides a decent balance between understanding the Russian grammar, developing common vocabulary and advance comprehension skills, leading the students towards mastering authentic communication expertise.  </p>  <p>  \t<strong>Learn Russian in Conversations </strong>consists of 20 lectures 6 to 12 minutes each. Every lesson covers a different topic and is supported by additional useful information and grammar at the end. Constantly repeating all words and phrases after the native speakers and studying the useful information is your key to success in this course.  </p>  <p>  \t  The course videos are designed and structured in such a way, that students can also follow the conversations in audio format without having to watch the videos on the screen.  </p>  <p>  \t  By completing the <strong>Learn Russian in Coversations</strong> you will feel at ease with the Russian language. Having built up a solid foundation in the Russian language, you will be able to communicate on most everyday situations, understand complex dialogs and be understood.  </p>  <p>  \t  Subscribe now and learn to speak Russian!  </p>", 
    "end_date": null, 
    "title": "Learn Russian in Conversations", 
    "price": "20.00", 
    "instructors": "Linkage  Business Group", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311384_1bd4_4.jpg", 
    "course_url": "https://www.udemy.com/learn-russian-in-conversations/", 
    "currency": "USD", 
    "subject_name": [
        "Russian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T08:45:29Z"
}