{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">WELCOME </strong>to my training, designed specifically for you – a person who wants to speak Russian properly and be easily understood!  </p>  <p style=\"\">  \t                                     I have no doubts you have experienced this problem before (formulated one way or another):  </p>  <p style=\"\">  \t                                     “I have been learning Russian for so long but I still have a hard time understanding native speakers, or being understood by them”.  </p>  <p style=\"\">  \t                                     Well, I can assure you, <strong style=\"\">it is NOT your fault!</strong> The problem lies in the bad habit to study languages almost solely from texts. Does it make sense to start speaking a language if you cannot hear it properly yet? If you do not know which sounds make up the language? If you do not know how to pronounce them? I believe it does not.  </p>  <p style=\"\">  \t                                     Instead, I offer you to learn good pronunciation from the start! My main objective is to get you acquainted with the sounds and the manners of speaking that exist in Russian but do NOT exist in English.  </p>  <p style=\"\">  \t                                     Here’s what you’ll gain in my <strong style=\"\">Pronounce Russian Properly </strong>tutorial:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t                                     ·     38 INFORMATIVE SCREENCAST LECTURES (over 3.5 hours of content) to start hearing and speaking Russian properly from the beginning;  \t</p>  \t<p style=\"\">  \t\t                                     ·     Over 300 of the MOST FREQUENTLY USED WORDS in spoken Russian;  \t</p>  \t<p style=\"\">  \t\t                                     · 32 AUDIO TRACKS with the vocabulary to practice, recorded by a native speaker;  \t</p>  \t<p style=\"\">  \t\t                                     · A BOOK IN PDF FORMAT. It contains all the content of our course, nicely formatted, to help you review it quickly and easily;  \t</p>  \t<p style=\"\">  \t\t                                     ·     INTERNATIONAL PHONETIC ALPHABET transcriptions for each of the examples, so you can see the pronunciation of every word and sentence instantly;  \t</p>  \t<p style=\"\">  \t\t                                     ·     A SPECIAL TECHNIQUE to model your pronunciation after that of native speakers, along with the material to practice.  \t</p>  </ul>  <p style=\"\">  \t                                     Let’s check out the most important features of the course in more detail.  </p>  <p style=\"\">  \t                                     If you have already tried to tackle Russian, you must be aware of its key features – Russian is NOT a phonetic language. It simply means that a sound can be written in <em style=\"\">numerous</em> ways and, vice-versa, a group of letters can be pronounced in different ways, depending on the word.  </p>  <p style=\"\">  \t                                     In Russian, knowing how to pronounce a word is not enough to write it down. The reverse is true also: seeing a word in writing is not enough to know how to pronounce it. That is exactly why it is basically useless to start learning Russian with the alphabet. No native speaker pronounces Russian letters in words the way they are presented in the alphabet. We use <strong style=\"\">many </strong><strong style=\"\">sounds</strong> not found in the alphabet.  </p>  <p style=\"\">  \t                                      In order to teach you Russian sounds and especially to draw your attention to the sounds that exist in Russian but not in English, I use<strong style=\"\"> the International Phonetic Alphabet</strong> in the course, also known as the IPA. The IPA lets us write down words the way we pronounce them.  </p>  <p style=\"\">  \t                                     Another technique I use in the course lets you model your pronunciation after that of native speakers. To do that, I offer my students to use an audio editor. Unlike other methods, I advise you not just listen to the recording and repeat AFTER it. You are going to do it <strong style=\"\">WITH </strong>the recording. To put it another way, you will try to synchronize your voice with the voice of the recording.  </p>  <p style=\"\">  \t                                This will let you not only instantly hear if you pronounce the sound correctly or not, it will also let you keep an eye on the length of the sound (or syllable or word) to make sure you are in sync and using the same rhythm as the native speaker. The course contains 25 audio tracks recorded by a native speaker to let you practice. I will show you how to use a special tool to make the exercise more efficient.  </p>  <p style=\"\">  \t<strong style=\"\">     Don’t worry!</strong> None of these techniques is rocket science.  </p>  <p style=\"\">  \t                                     Besides, this course has a number of takeaways, resources, and added educational benefits.  </p>  <p style=\"\">  \t                                     This training is designed to be self-paced but any serious student should be able to complete it in 3-4 weeks, including review times. You should observe nice results in terms of listening and speaking after only 2 weeks.  </p>  <p style=\"\">  \t                                     If you are interested in learning Russian to boost your career or just for fun, and appreciate a good challenge, this course is for you.  </p>  <p style=\"\">  \t                                     To sum up, you will have an unlimited, lifetime access to both screencast lessons, to the downloadable audio offered as a bonus and to the downloadable bonus PDF book, anytime and anywhere.  </p>  <p style=\"\">  \t                                     Besides, you will be able to ask the instructor any question related to the topic and receive a full, clear answer or let me know about any remark you have on how to further improve the course. The questions and remarks are reviewed weekly.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">     There’s truly no time to lose here. Get started now!</em></strong>  </p>", 
    "end_date": null, 
    "title": "Pronounce Russian Properly", 
    "price": "20.00", 
    "instructors": "Tatiana Kharitonchik", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/204902_98ad_4.jpg", 
    "course_url": "https://www.udemy.com/pronounce-russian-properly/", 
    "currency": "USD", 
    "subject_name": [
        "Russian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-25T03:38:41Z"
}