{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t'Readings in Russian. Leo Tolstoy (1)' is the first pilot sub course in the series 'Readings in Russian.' which is planned to be continued. The major goal of the series is to help my virtual students start reading classical Russian literature at the upper-beginner level.  </p>    <p>  \tYou would say: ‘No, this cannot be true! Russian classical literature is too complicated and this is not something to start learning this terribly difficult language with!’ Well, of course “War and Peace” or “Anna Karenina” by Leo Tolstoy, “Seagull” or “The Cherry Orchard” by Anton Chekhov, poetry by Alexander Pushkin are not what I’m offering here.   </p>  <p>  \tFor the series I have picked up well-known short stories for children by the Great Russian writers. In this very first sub course you’ll read six short stories by Leo Tolstoy: Косточка, Котёнок, Акула, Филипок, Отец и сыновья, and Мужик и водяной. I am planning to continue with more texts by the author.   </p>  <p>  \tEvery lecture contains an audio of one short story recorded at a slower pace, illustrated and subtitled for easier comprehension by the student. There are also some downloadable supporting materials, e.g. full texts of stories with and without word stresses, vocabulary notes, etc. Plenty of 'multiple choice', 'true/false', 'fill in the blanks' exercises with feedback are included. To get the maximum benefit from the course step-by-step instructions are provided.  I also guarantee chat support in case students have any questions.   </p>  <p>  \tIf you start right away then in just a week you will be able to proudly say: “I have read Leo Tolstoy in Russian!” – Я читал ЛьваТолстого на русском!  </p>", 
    "end_date": null, 
    "title": "Readings in Russian. Leo Tolstoy (1). ", 
    "price": "25.00", 
    "instructors": "Irina Liner", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/64236_4bea_6.jpg", 
    "course_url": "https://www.udemy.com/readings-in-russian-leo-tolstoy/", 
    "currency": "USD", 
    "subject_name": [
        "Russian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-07T10:21:12Z"
}