{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>I am offering a Russian language crash course making it easy and enjoyable for you to learn this language.  </p>\n\n\n\n<p><strong>What other people wrote about my course:</strong>\n\n  </p>\n\n\n\n\n\n<p>“Many thanks to Dr Chakirova for an excellent introduction to the Russian language. Engaging instruction and plenty of content.”<strong></strong></p>\n\n<p><strong>“</strong>Not only was this course engaging but it also met most of my expectations. Thankfully, the speed at which the course was conducted was quite slow and therefore, easily understandable. Thank you for conducting this course, Dr. Chakirova. :)”</p>\n\n<p>“Dr. Chakirova is a very good instructor, and she doesn't shy away from introducing the Cyrillic alphabet at the beginning, so we learn to read the language along with starting to speak it. Very nice indeed!”</p>\n\n<p>“I achieved what I set out to learn from this course which was get a good introduction to the Russian language. This course kept my attention and the handouts are really great. The production quality is excellent throughout.”</p>\n\n<p>“This course is wonderful. I appreciate all the time and effort that the instructor, Dr Goultchira Chakirova put into the course and all the resource materials. Thank you\"</p>\n\n<p>“Great introduction! Lessons started with the alphabet (letter names and pronunciation), and moved on to useful words and a few phrases. Just enough grammar to help those who want to progress to Level II and beyond, but not enough to confuse beginners. Cпасибо!”</p>\n\n<p>I hope you will enjoy learning Russian and will find my course useful and interesting. So, let’s get started with Russian for Beginners level I!\n\n\n\n</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Russian for Beginners Level I", 
    "price": "30.00", 
    "instructors": "Dr. Goultchira Chakirova", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265556_3b1f_4.jpg", 
    "course_url": "https://www.udemy.com/russian-for-beginners-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Russian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T09:37:14Z"
}