{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>This course is for people who love studying languages in a 'live', non-text book manner, who already know how to read Cyrillic and are eager to start speaking Russian. </p>\n\n<p>We will cover three topics: <strong class=\"redactor-inline-converted\">household kitchen items, clothing </strong>and<strong class=\"redactor-inline-converted\"> every day action verbs</strong>. Initially introduced to each word, you will then learn and practice it in sentences and conversational situations. And sometimes we'll go out on a tangent when the word or expression calls for it. </p>\n\n\n\n<p>This course is meant to entertain while educating, so get ready to <strong class=\"redactor-inline-converted\">have some fun with the language</strong>. I encourage you to <strong class=\"redactor-inline-converted\">engage in a conversation</strong> - be it with your fellow students or your teacher (me that is). What else is a language for but to converse and share?</p>\n\n\n\n<p>There will be <strong class=\"redactor-inline-converted\">some grammar</strong> exercises and quizzes. <strong class=\"redactor-inline-converted\">Make mistakes and have a laugh</strong>. By all means have a laugh, and only then go back and learn again. You will <strong class=\"redactor-inline-converted\">get better with practice. </strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Take your time</strong> with each lecture. Practice makes permanent (although not necessarily perfect). Each one contains ample opportunities to practice reading, writing and pronunciation. Test your skills on quizzes, practice in conversations and then move on to the next lecture.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Ask questions and share your thoughts</strong> - it will help everybody.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">I'm here to help</strong> and would gladly chat with you and help you practice pronunciation. <strong class=\"redactor-inline-converted\">Post requests </strong>and I'll do my best to find time to set up <strong>Skype/FaceTime/Google Hangout</strong>, you name it.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn and have fun!</strong> <br></p>", 
    "end_date": null, 
    "title": "Russian vocabulary: from simple words to conversation.", 
    "price": "20.00", 
    "instructors": "Nina Kozlova", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737290_d71e_5.jpg", 
    "course_url": "https://www.udemy.com/build-up-your-russian-vocabulary/", 
    "currency": "USD", 
    "subject_name": [
        "Russian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T22:02:14Z"
}