{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<strong style=\"\">  In this course you will learn to read the russian alphabet.</strong>  </p>  <p>  \tIn doing so you will build a necessary foundation for learning the russian language, but also other slavic languages like serbian or ukrainian for example.  </p>  <p>  \tAnyone who has ever tried to use the subway in moscow, will easily understand the importance of this knowledge.  </p>  <p>  \tThe video lectures contain:  </p>  <ul style=\"\">  \t<li><span>The correct articulation of each letter, followed by three representative full-word examples.</span></li>  \t<li><span>Changes in the pronunciation, for example due to the position of the letter within the word.</span></li>  \t<li><span>Basic rules for the correct stressing of russian words.</span></li>  </ul>  <p>  \tThe whole course is based on plenty of audio-examples, recorded by a russian speech therapist, who has been working successfully with the russian language since 1995.  </p>  <p>  \t  To make memorisation easier, we have supplemented all examples with visual representations. All the words used have been carefully chosen so that the correct sound of the letters will be easy to grasp.  </p>  <p>  \tAdditional written exercises will help you to solidly anchor your knew knowledge in your long term memory.  </p>  <p>  \tBecause the individual progress depends on a lot of different factors, it is not easy to say how long it will take you to reach a state where you can fluently read russian texts. On average, substantial progress can be seen within a few days though.  </p>", 
    "end_date": null, 
    "title": "The Russian Alphabet", 
    "price": "20.00", 
    "instructors": "Dr.  Anna Obukhovskaya", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242824_8b7c_3.jpg", 
    "course_url": "https://www.udemy.com/the-russian-alphabet/", 
    "currency": "USD", 
    "subject_name": [
        "Russian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-13T16:25:34Z"
}