{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>This linguistic course is created for highly motivated people, who want to learn in a short amount of time how to read, write, and speak in Russian. Whether you are a complete beginner or already have some knowledge of the Russian language but would like to expand on it, this course is for you.</p><p>While I studied several foreign languages and earned my Master&#039;s in Linguistics, I realized all of the advantages and disadvantages of those educational programs and developed my own unique and effective teaching method, which will help you pick up Russian language very quickly. </p><p>The course consists of 22 video lectures (2.5 hours of video content) and 26 Quizzes (approximately 12 hours of exercise materials). Each section contains one video lesson, several quizzes and video exercises. Every lesson will cover the essential grammar subject in an easy to digest form, new vocabulary and a special section with &quot;hot&quot; words and phrases Russians love to use in their speech. At the end of every lesson you are encouraged to go through exercises and quizzes, which will help you remember the grammar you&#039;ve just learnt and pick up new vocabulary as well.</p><p>Every lesson lasts up to 10 minutes and covers a new grammar topic, such as:</p><ol style=\"\"><li>Russian Alphabet.</li><li>Personal Pronouns.</li><li>Negative and Interrogative Sentences.</li><li>The Gender of Nouns.</li><li>The Adjective Agreement.</li><li>The Infinitive.</li><li>The Verb Conjugation. The Present Tense.</li><li>The Dative Case.</li><li>The Modal Words.</li><li>The Past Tense.</li></ol><p>This list will continue to grow as I&#039;m working on additional video lessons now, which you&#039;ll be able to study very soon in a subsequent class.</p><p>Thoroughly listen and repeat all of the material covered in the lessons, go through the exercises and complete the entire course and you&#039;ll be speaking, reading, writing, understanding and even thinking in Russian in no time.</p>", 
    "end_date": null, 
    "title": "The Secrets of Successful Russian - Learn Russian Quickly", 
    "price": "50.00", 
    "instructors": "Kate Chekhov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370422_77c0_2.jpg", 
    "course_url": "https://www.udemy.com/the-secrets-of-successful-russian-learn-russian-quickly/", 
    "currency": "USD", 
    "subject_name": [
        "Russian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T02:55:00Z"
}