{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    Cultural Intelligence (CQ) is the natural evolution from the well-established notions of IQ (intelligence quotient) and EQ (emotional intelligence). Good leaders need all three to lead effectively.\n\nCQ is the ability to cross divides - whether country, generation, gender, sector or background - and to thrive in multiple cultures. Developing your CQ will enable you to work with people who are different from you, and lead in your organisation, community, business or place of study.\n\nUnderstand and develop Cultural Intelligence\n\nThis free online course will introduce you to the concept of CQ and explore its evolution and relevance for leadership.\n\nThrough a series of activities, exercises and advice from leaders around the world, you will:\n\n\n  build the skills to lead across divides and thrive in multiple cultures;\n  go on a journey to uncover the cultural influences that make you think and act the way you do;\n  see how understanding yourself can help you work with other people;\n  learn skills to recognise what makes others tick and behave the way they do;\n  and embrace diversity and recognise its role in innovative problem solving.\n\n\nIn discussions with other learners from around the world, you’ll grow your network and build relationships which will, in turn, help you develop your CQ.\n\nLearn with Common Purpose - experts in CQ\n\nCommon Purpose has been running leadership development programmes for over 25 years. This course builds this experience and expertise into an accessible, personal and professional development course.\n\nYour guide will be Common Purpose’s Founder and Chief Executive, Julia Middleton. She is a well-respected thought leader in the field of leadership and author of Cultural Intelligence - CQ: The Competitive Edge for Leaders Crossing Borders. This book explores the subject and details her own journey to develop CQ.\n\nYou can find out more about this course in Julia’s post for the FutureLearn blog: “6 reasons why modern leaders need Cultural Intelligence.”\n\n\n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "Developing Cultural Intelligence for Leadership", "price": 0, "instructors": "Julia Middleton", "institution_name": ["Common Purpose"], "commitment": "4 hours", "subject_name": ["Business & Management"], "course_url": "http://www.futurelearn.com/courses/cultural-intelligence?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-06-06T00:00:00Z"}