{"selfpaced": true, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    O curso Gestão para a Aprendizagem: Módulo Gestão Estratégica aborda uma nova concepção de gestão escolar focada na aprendizagem dos alunos e nas dimensões de trabalho do gestor visando o sucesso escolar, com foco na rede pública. O cerne do curso é o planejamento estratégico e os instrumentos práticos, tais como a caracterização da comunidade escolar, a avaliação de eficácia, a análise SWOT e o plano de ação.\n\n                                            Syllabus\n                        Introdução à GestãoNesta unidade você conhecerá os conceitos de Administração e Gestão Escolar. A unidade também abordará a Gestão com foco na aprendizagem e o papel do gestor para a melhoria da qualidade.\t\t\t\t\t\nGestão EstratégicaO foco desta unidade é a Gestão Estratégica. Você conhecerá as dimensões do trabalho do gestor, indicadores de qualidade em educação e a importância do planejamento.Planejamento EstratégicoPor meio dos estudos dessa Unidade, você conhecerá  as diretrizes do planejamento estratégico e algumas etapas que compõem a sua elaboração.\t\t\tCenário da EscolaEsta unidade apresenta com detalhes alguns instrumentos que contribuem para mapear o cenário da escola para elaboração do planejamento estratégico: caracterização da comunidade escolar, avaliação da eficácia de eficácia escolar e a avaliação estratégica.\t\t\t\t\tPlano de AçãoNesta unidade você encontrará o passo a passo para a realização de um plano de ação, a fim de que a equipe escolar possa desenvolver suas ações orientadas por um planejamento estratégico.\t\t\t\t\t\nMateriais de ApoioAqui você encontrará todas as Referências Bibliográficas do curso e informações complementares que podem auxiliar na construção do seu plano de ação.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Gestão para a Aprendizagem: Módulo Gestão Estratégica", "price": 0, "instructors": "Claudia Dalcorso and Silvana Tamassia", "institution_name": ["Fundação Lemann"], "commitment": "4-5 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/gestao-escolar", "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}