{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    Globally, 1 in 11 jobs are in the hospitality industry, with predictions for continued job growth. Hospitality careers are often stereotyped as low-wage and entry-level with little opportunity for advancement, but with constant innovation, opportunities for talented individuals are vast, and growing. \n\nAre you wondering if a career in hotel management, restaurant management, hotel asset management, or services marketing would benefit you?  Are you currently working in the industry and seeking promotional opportunities?  Enroll now and let Cornell guide your exploration of this exciting industry.\n\n \n\nFAQ\n\nWho is the intended audience for this course?\n\nThe audience for this MOOC is anyone in the industry seeking to advance, as well as individuals who are interested but who don’t know much about the industry. It’s also appropriate for use as an employee-development tool within hospitality industry companies\n\nAre there formal prerequisites?\n\nNo. Some proficiency with Excel will be helpful.\n\nIs there a textbook for this course?\n\nNo. A list of supplemental resources, will be provided.\n\nWhat are the topics covered in this course?\n\nAn Introduction to the Hospitality Industry\n\tStrategic Hospitality Management and Innovation\n\tOwners, Operators, and Investors: A Behind-the-Scenes Look at Investing in the World of Hospitality\n\tMarketing the Hospitality Experience\n\tHuman Resources Management in Hospitality\n\n\n                                    ", "end_date": "2016-03-07T00:00:00Z", "title": "HOSP.101x: Introduction to Global Hospitality Management", "price": 0, "instructors": "Bill Carroll", "institution_name": ["Cornell University"], "commitment": "1 hours", "subject_name": ["Business & Management"], "course_url": "https://www.edx.org/course/introduction-global-hospitality-cornellx-hosp-101x-0", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-01-25T00:00:00Z"}