{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    In this ten-week course you will learn how to get the most out of people in the workplace. Aimed at people who have, or are about to have, managerial responsibility in any type of organisation, this course will introduce you to reflective practice in people management.\n\n\n\n  “The conventional definition of management is getting work done through people, but real management is developing people through work.”\nAgha Hasan Abedi\n\n\n\n\nThink back to your last few days in the workplace. Were you and your team energised, focused and all delivering real benefit to the organisation? As managers our task is to deploy resources so that we can achieve results. In our rapidly changing world this is never easy, especially when our delivery is based on the efforts of other people. People can be hugely creative and enthusiastic, or negative and distracted. People are much more than a source of labour; we are complex and are all different from each other.\n\nSo how do we energise a disparate group of people and get them pulling together – and keep them pulling together? The course will arm you to deal more effectively with the challenges you regularly face. It will provide you with different ways of looking at difficult situations and will give you a broader range of techniques to use when dealing with them.\n\nWe will cover aspects of management theory and psychology, but our premise is that management is as much an art as it is a science. We cannot make you a great artist in ten weeks but we can set you on the path.\n\n\n\n  “Management is, above all, a practice where art, science, and craft meet”\nHenry Mintzberg\n\n\n\n\nWho is this course for?\nThe course is primarily designed for people who are already working and who have, or are about to have, managerial responsibility. However, the course does not presume any prior knowledge of management theory. The nature of the organisation in which you work – or hope to work – is immaterial.\n\nThe depth of thinking and analysis will broadly be at a post-graduate level thus making this an ideal taster course should you be thinking of pursuing a masters degree in business or management in the future. However, you don’t need to have a degree to participate.\n\nWhat might I learn and how might this benefit me?\n\n\n  How to manage people and get them engaged.\n  How to get the best out of people.\n  What good management practice is, and how it could be developed sustainably through a process of continuing reflection.\n  Tools and techniques to help you deal more effectively with challenges you may regularly face.\n\n\nWhat will the learning experience be like and what will be expected of me?\nThe course will take place online and will consist of a variety of videos, articles, discussions, quizzes and activities based on your experience.\n\nYou must be willing to think about the ideas we will discuss in the context of your experiences of managing (and being managed) and to reflect on more effective approaches. Indeed, sharing your experiences and reflections with others on the course will help you to get the most out of it.\n\nDelivered by the Henley Business School\nThis course will be delivered by Henley Business School, a triple accredited, world-renowned business school, part of the University of Reading. Henley offers a full suite of business education from undergraduate and postgraduate study, to executive education and the Henley MBA.\n\n\n\n\n\n\nYou can find out more on the FutureLearn blog: see what the team at VoucherCodes.co.uk thought of this course or read Martin Bicknell’s post “Beyond the template manager.”\n\n\n\n                                    ", "end_date": "2015-11-30T00:00:00Z", "title": "Managing People: Engaging Your Workforce", "price": 0, "instructors": "Martin Bicknell", "institution_name": ["University of Reading"], "commitment": "4 hours", "subject_name": ["Business & Management"], "course_url": "http://www.futurelearn.com/courses/managing-people?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "9 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2015-09-28T00:00:00Z"}