{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    Once you have hired good employees, the next step that successful people managers take is to develop the full potential of their employees.  Performance management is a process that helps managers achieve the goal of getting the best from their employees. \n\nIn this third course in the Human Resources for People Managers specialization,  we will discuss the skills and key processes you will need to develop your employees to attain department and organizational goals.  These skills will include setting clear expectations, providing positive and corrective feedback, and delivering an effective performance appraisal.\n\n                                            Syllabus\n                        GETTING STARTED - DEVELOPING PERFORMANCE MANAGEMENT SYSTEMSIn this module, you will begin your journey into learning about managing employee performance for your organization.  We will cover performance management fundamentals and discuss ways to be more strategic in implementing better performance management in your organization.  Two key elements that will be useful to people managers in this module are the difference between performance appraisals and performance management and recognizing how performance management can affect your organization.IMPLEMENTING PERFORMANCE MANAGEMENT SYSTEMSIn this module we will begin to put structure around performance management.  We will discuss the difference between results and behavior and how to describe and identify performance objectives and standards. You will also learn how to identify employee skills and how you can use this to develop performance standards.  Finally, you will learn about three ways to measure results and behaviors and the different benefits and limitations each approach offers.TOOLS FOR EFFECTIVE PERFORMANCE MANAGEMENT In this module, you will learn the fundamentals of performance reviews.  You will learn the steps for conducting an effective performance review, timing and frequency, and how to create individual development plans for your employees.  Another key element in this module is feedback; You will learn the components of effective feedback, the advantages and disadvantages of multirater feedback, and why giving feedback is so important.  Finally, you'll learn ways to avoid rater bias and elements for best practice in performance reviews.   CREATING A POSITIVE PERFORMANCE CULTUREYou are now ready to bring things full circle.  In this module you will learn how to create a positive performance culture in you organization.  You will learn the fundamentals of creating civility in your organizational cultures, as well as ways to identify and correct incivility, which can weaken your organization's performance.  Finally, you will learn about building a culture that focuses on values and strengths.  A culture that creates and reinforces positive norms and values is a culture that helps your organization grow.  It is important to \"walk the talk\" and model the behaviors of positive performance culture.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Managing Employee Performance", "price": 0, "instructors": "Larry Bourgerie", "institution_name": ["University of Minnesota"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/employee-performance", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}