{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/businessandphilo2\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/businessandphilo2-001/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    businessandphilo2-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    This\n entire MOOC is based on one of my strongest beliefs: philosophy is the \nbest tool to help managers in areas where no numbers are available. \nAfter all a strategic vision is an \"idea\", it is translated into a \"concept\", a business model is a … \"model\" etc. And we need to better \nunderstand what is an idea, what is a concept, what is a model etc. In \nother words we need to better understand how do we think. In the first \nsix lectures we made a surprising journey from the ancient Greek \nphilosophers to the corporate world of today. You probably crossed a set\n of \"new territories\" but honestly, it was the same for me ! Apparently\n this experience has no end in sight! The first six lectures are \nbroadcasted for a second time during this fall and I had the chance to \nrecord three additional lectures last September. Not a surprise: \nphilosophy is like a country you want to visit, there are always new \nroads to discover and even new paths to create. It is highly recommended\n to have attended lectures 1-6 to take the most out of this part 2.In\n lecture 7, I examine the deep nature of the changes the world is \ncurrently facing and the associated challenges for us. Lecture 8 focus \non one of them: the impact of technology on the way we think. In the \nlast lecture I suggest some tips that might help you to become a better \nmanager, in other words to become a corporate philosopher.Evaluations\n will be similar to the ones you had so far: open questions that request\n some research. At the end of lecture 9, I will again ask you to submit a short paper about a famous quote of a great philosopher. Moreover, we will organize a Google Hangout during lecture 8.\n\n                                            Syllabus\n                        Lecture 7: The Essence of Change7.1 The end of...7.2 You need a fixed point7.3 Philosophy as a fixed point7.4 Two first challenges7.5 Another center of gravity7.6 The four causes of Aristotle7.7 'A thus B' or 'A and B'Lecture 8: Is technology making us stupid?8.1 Four types of tools8.2 The disappointing equation8.3 A third example: Big Data8.4 The end of Science?8.5 Question what is in front of you8.6 Who is the tool of who?Lecture 9: Become a corporate philosopher!9.1 Use the right words9.2 Use criteria9.3 Beware the question9.4 Use creativity techniques9.5 Think visual9.6 Never stop thinking9.7 Embrace humor\n                                    ", "end_date": "2015-03-09T00:00:00Z", "title": "On Strategy: What Managers can learn from Philosophy - Part 2", "price": 0, "instructors": "Luc de Brabandere", "institution_name": ["École Centrale Paris"], "commitment": "2-3 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/course/businessandphilo2", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-02-16T00:00:00Z"}