{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    People analytics is a data-driven approach to managing people at work. For the first time in history, business leaders can make decisions about their people based on deep analysis of data rather than the traditional methods of personal relationships, decision making based on experience, and risk avoidance. In this brand new course, three of Wharton’s top professors, all pioneers in the field of people analytics, will explore the state-of-the-art techniques used to recruit and retain great people, and demonstrate how these techniques are used at cutting-edge companies. They’ll explain how data and sophisticated analysis is brought to bear on people-related issues, such as recruiting, performance evaluation, leadership, hiring and promotion, job design, compensation, and collaboration. By the end of this course, you’ll understand how and when hard data is used to make soft-skill decisions about hiring and talent development, so that you can position yourself as a strategic partner in your company’s talent management decisions. Organizations flourish when the people who work in them flourish. Analytics can help make both happen. This course in People Analytics is designed to help you flourish in your career, too.\n\n                                            Syllabus\n                        Introduction to People Analytics, and Performance EvaluationIn this module, you'll meet Professors Massey, Bidwell, and Haas, cover the structore and scope of the course, and dive into the first topic: Performance Evaluation. Performance evaluation plays an influential role in our work lives, whether it is used to reward or punish and/or to gather feedback. Yet its fundamental challenge is that the measures we used to evaluate performance are imperfect: we can't infer how hard or smart an employee is working based solely on outcomes. In this module, you’ll learn the four key issues in measuring performance: regression to the mean, sample size, signal independence, and process vs. outcome, and see them at work in current companies, including an extended example from the NFL. By the end of this module, you’ll understand how to separate skill from luck and learn to read noisy performance measures, so that you can go into your next performance evaluation sensitive to the role of chance, knowing your environment, and aware of the four most common biases, so that you can make more informed data-driven decisions about your company's most valuable asset: its employees.StaffingIn this module, you'll learn how to use data to better analyze the key components of the staffing cycle: hiring, internal mobility and career development, and attrition. You'll explore different analytic approaches to predicting performance for hiring and for optimizing internal mobility, to understanding and reducing turnover, and to predicting attrition. You'll also learn the critical skill of understanding causality so that you can avoid using data incorrectly. By the end of this module, you'll be able to use data to improve the quality of the decisions you make in getting the right people into the right jobs and helping them stay there, to benefit not only your organization but also employee's individual careers. CollaborationIn this module, you'll learn the basic principles behind using people analytics to improve collaboration between employees inside an organization so they can work together more successfully. You'll explore how data is used to describe, map, and evaluate collaboration networks, as well as how to intervene in collaboration networks to improve collaboration using examples from real-world companies. By the end of this module, you'll know how to deploy the tools and techniques of organizational network analysis to understand and improve collaboration patterns inside your organization to make your organization, and the people working within in it, more productive, effective, and successful. Talent Management and Future DirectionsIn this module, you explore talent analytics: how data may be used in talent assessment and development to maximize employee ability. You'll learn how to use data to move from performance evaluation to a more deeper analysis of employee evaluation so that you may be able to improve the both the effectiveness and the equitability of the promotion process at your firm. By the end of this module, you'll will understand the four major challenges of talent analytics: context, interdependence, self-fulfilling prophecies, and reverse causality, the challenges of working with algorithms, and some practical tips for incorporating data sensitively, fairly, and effectively into your own talent assessment and development processes to make your employees and your organization more successful. In the course conclusion, you'll also learn the current challenges and future directions of the field of people analytics, so that you may begin putting employee data to work in a ways that are smarter, practical and more powerful.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "People Analytics", "price": 0, "instructors": "Cade Massey, Martine Haas and Matthew Bidwell", "institution_name": ["University of Pennsylvania"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/wharton-people-analytics", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}