{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">L</strong><strong style=\"\">earn 12 Steps to Investment Success and cut through the complexity of investing. See how you can beat the professionals, with no experience, and spend less than 10 hours a year doing it.</strong>  </p>  <p>  \t<br style=\"\">  \t          Andrew has been working for more than 20 years in the global financial industry, with a particular focus on Asia. During that time, he has taught numerous classes to fellow professional financial industry experts. But, when it came time for Andrew to teach his five teenage nieces how to handle their financial future, he found it extremely challenging to boil down a lifetime of research and experience into something that could be a simple lifelong guide on the path to achieve financial independence. Because of this challenge, Andrew has compiled a fantastic set of materials that resulted in a book and a course, to help guide you and your loved ones to financial independence.<br style=\"\">  \t<br style=\"\">  \t          At the end of the course YOU will have a simple and easy method of managing your own money – for your lifetime. Andrew makes seminal academic research easy to understand and combines it with his industry experience to create an actionable plan that you can easily execute to gain the best returns over the long term.  </p>  <p>  \t<strong style=\"\">Don’t waste your most valuable wealth creation years </strong>– you can start today to learn these core principles, even if you have no prior knowledge of investing.  </p>", 
    "end_date": null, 
    "title": "12 Steps to Your Financial Independence", 
    "price": "35.00", 
    "instructors": "Andrew Stotz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375506_44a5_5.jpg", 
    "course_url": "https://www.udemy.com/12-steps-to-your-financial-independence/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T10:17:59Z"
}