{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Learn and master the five steps to successful personal finance and budgeting!</strong> </p><p>Do you feel like you don&#039;t have control of your finances? You&#039;re not alone! Many people struggle to maintain strong personal finances while building savings and lowering debt. </p><p>In this step-by-step video training course, Ashley Corley, a management consultant at a Fortune 500 firm, a volunteer overseeing leadership development of 5,000+ women across the Southeast, and founder of the Foundation First concept, shares her secrets to success in managing personal finance.</p><p>I&#039;ve watched multiple people in different stages of life struggle day to day because of not understanding how to manage their personal finances. I don&#039;t want anyone else to struggle, which is why I created this course for you.</p><p><strong style=\"\">There are countless benefits</strong> to developing, managing, and maintaining strong personal finances from understanding your current financial picture, to optimizing your cash flow to achieve maximum potential, to creating spending plans that match your financial goals.</p><p>In addition to the compelling lectures, video trainings, and templates/resources, I am also available to answer questions on how to build your financial picture. </p><p>Nothing is kept secret; I reveal all I know. Additionally, I constantly will be adding to the course <strong style=\"\">at no extra cost to you</strong>! </p><p>I look forward to working with you!</p>", 
    "end_date": null, 
    "title": "5 Easy Steps to Make the Most of Your Finances", 
    "price": "25.00", 
    "instructors": "Ashley Corley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409998_79ae_2.jpg", 
    "course_url": "https://www.udemy.com/personal-finance-budgeting-in-five-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T15:44:15Z"
}