{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        According to a recent study by the Brookings Institute, 38 million Americans live paycheck to paycheck. Over 2/3 of those on the edge of bankruptcy are considered &quot;middle class&quot; by most standards. Why is this? <strong style=\"\">Is it possible to live debt free on a <em style=\"\">normal</em> income?</strong>  </p>  <p style=\"\">  \t        Debt and other personal finance issues plague our society. Most of us have been taught how to handle money by advertisers and banks, who have convinced us that as long as we can afford the minimum payments, we can afford anything we want.  </p>  <p style=\"\">  \t        In this course:  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">I will challenge the idea that debt is required.</span></li>  \t<li style=\"\"><span style=\"\">I will outline how to live without debt. </span></li>  \t<li style=\"\"><span style=\"\">You will gain a framework for you to better understand how money really works.</span></li>  \t<li style=\"\"><span style=\"\">You will learn common-sense solutions to make your money behave. </span></li>  \t<li style=\"\"><span style=\"\">I will walk you through several exercises that will help you prioritize your money to make the most of every penny you earn, and minimize the expenses that drain your bank account every month.</span></li>  </ul>  <p style=\"\">  \t<span style=\"\"></span><span style=\"\">In short, this course will help you move from debtor...to better.</span>  </p>  <p style=\"\">  \t<span style=\"\">This course is made up of over 2 hours of video instruction with all the tools necessary to get out of debt, no matter how big of a mess you&#039;re in.</span>  </p>", 
    "end_date": null, 
    "title": "5 Simple Steps (and all the tools you need) to Overcome Debt", 
    "price": "20.00", 
    "instructors": "Barry Myers", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/245968_6ec9_3.jpg", 
    "course_url": "https://www.udemy.com/5-simple-steps-to-get-out-of-debt/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-18T19:01:41Z"
}