{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn how to build Financial Freedom for you and your family.</p><p> At the end of the course you will know what you need to do to begin to build your Financial Freedom.</p>  <p>The book, videos, workbook and pdfs will give you step by step help to begin taking charge of your financial future. You will better understand financial terms and pitfalls.</p><p>What are the five steps to financial freedom? </p><p><strong>1. Control your emotions</strong></p><p><strong>2. Establish a financial plan</strong></p><p><strong>3. Acquire assets</strong> (because those are the building-blocks to financial   freedom) </p><p><strong>4.Live a financially efficient life</strong></p><p><strong>5.Minimize your risks</strong></p><p>With those steps, and this course, what will you learn? </p><p>You'll   learn how to discover and correct some of the financial mistakes that you may   be making. </p><p>You will learn to clearly articulate your financial goals and begin   to achieve them. </p><p>You will receive some practical advice on how to begin or   improve your investing. </p><p>You will obtain a checklist of some important ways to   minimize your risk</p><p>You will begin to build the freedom to live the kind of   life you've always wanted.<br></p><p>Remember that some of these things are going to sound pretty simple. They're simple, but they're not easy. They're also financial truths that they were true 100 years ago. They'll be were true ten years ago, they are true today, and they will be true fifty years from now. </p><p>What I teach doesn't sound like arcane financial terms, it will not confuse you. These steps are the financial truths that will help you build your own financial freedom, and achieve a financially fulfilled life.<br></p>", 
    "end_date": null, 
    "title": "5 Steps to Financial Freedom", 
    "price": "40.00", 
    "instructors": "Lindsey Torbett", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785394_fad7_6.jpg", 
    "course_url": "https://www.udemy.com/5stepstofinancialfreedom/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T20:51:24Z"
}