{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong>Course updated as of 4 January 2016: Uploaded the \"VIM Investment Checklist\" to help you in your stock selection and decision making process.</strong></em></p><p>JOIN MILLIONS OF PEOPLE GLOBALLY WHO ARE ALREADY INVESTING IN THE STOCK MARKET.</p><p>In this course, you will learn how to<strong> become a profitable value investor</strong> by screening, analyzing, and identifying high performing and undervalued stocks.</p><p><strong>Value Investing is the only proven stock investing method </strong>since the 1920s which focuses on looking at stocks as a business rather than a moving stock price. It is also the only investing methodology where you are required to know how much the business is worth- its <strong>Intrinsic Value</strong>- before you invest, and include a <strong>Margin of Safety</strong> to take care of any possible errors in calculation. It is a highly conservative method. <strong>Value stocks tend to outperform growth stocks in global markets. </strong></p><p>Is beating the market just a dream? How is it possible for an ordinary person- more importantly for you, to make this a reality?</p><p><strong>The secret to wealth is simple: You need a formula. A formula makes investing easy to understand.</strong></p><p><em>Value investing is actually quite simple- if you know how to take the right steps- but let's be honest here; Google and books don't do a good job in explaining things, do they? </em></p><p>I will take you by the hand and show you EVERYTHING on how it can be done. The concept is simple, the explanation is simple, but most important of all, <strong>the execution is simple enough for you to do on your own.</strong> This formula does only 1 thing. It helps you buy above-average companies, but only when they are available at undervalued prices.</p><p>What's in it for you:</p><ul><li><strong>QUICK and POWERFUL 5-step formula</strong></li> <li>Find above-average stocks in 5 minutes</li> <li>Buy them at undervalued prices</li> <li>Reduce your risk in investing by 30%</li> <li>Free online tools professional investors can't use</li> <li>Regular bonuses and lifetime instructor support <em>(not forgetting to mention- our monthly stock analysis, absolutely free just for you!)</em></li> <li>All the ongoing updates to this course are FREE, forever</li> <li><em><strong>30-day money back guarantee</strong></em> (that's my commitment to your success. You have nothing to lose!)</li></ul><p>If you want to start investing in your very first stocks within the next 1-2 months,<strong> if you are determined to achieve YOUR financial freedom</strong>, <strong><em>this course is definitely for you</em></strong>.</p><p>You will be equipped with the <strong>practical knowledge and confidence </strong>to search for great undervalued stocks at the end of this course.</p><p>   Click the<strong> \"take this course\" </strong>button on the top right of this page, now. Remember, only you can take charge of your own financial freedom.</p>", 
    "end_date": null, 
    "title": "5-Step Value Investing Formula", 
    "price": "45.00", 
    "instructors": "Value Investing Monster", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386714_604e_7.jpg", 
    "course_url": "https://www.udemy.com/find-value-stocks-five-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T14:23:21Z"
}