{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In our quest for “more\", we have allowed the material world to rob us of optimal life quality. At a time when we could be thriving, our modern way of life has become more complex then ever, ushering with it unprecedented levels of stress, disconnection, and dissatisfaction. Fortunately, we can choose another path, one that is enriching in all the ways that matter for our health, happiness, and wellbeing and planetary sustainability—the path of <em style=\"\">simplicity</em>.</p><p><strong style=\"\">Learn how to have more with less and optimize the quality of your life with this course.</strong></p><ul style=\"\"><li>Gain essential information and practical guidelines for how to make your life easier and more advantageous to your wellbeing.</li><li>Learn how to save money and how to be more effective with your money.</li><li>Learn how to restructure your lifestyle to reflect the art of simplicity.</li><li>Discover the numerous benefits of simplicity for your health, finances, and more!</li></ul><p><strong style=\"\"></strong></p><p><strong style=\"\">The Art of Simplicity</strong> course was created to help you thrive in our modern times by knowing that you have a choice with respect to how you create your life. Whether you are looking for some savvy financial tips or wish to implement a complete overhaul of your lifestyle, this course will inspire, empower, and enable you to start applying effective habits to positively transform your life today.</p><p>You will learn how to optimize key areas of your lifestyle, including:</p><ul style=\"\"><li>home and living costs</li><li>food and drink costs</li><li>personal care and entertainment costs</li></ul><p><strong style=\"\"></strong></p><p><strong style=\"\">By applying the art of simplicity you will gain more freedom and control over your life. </strong></p><p>The course will provide you with 6 hours of content, divided across 23 topic-specific lectures. The lectures feature visual and written resources within a foundation of informative, practical and empowering content. Lectures engage students to apply what they are learning via practical worksheets and enriching resources.</p>", 
    "end_date": null, 
    "title": "Art of Simplicity: Financial Strategies to a Fulfilled Life", 
    "price": "30.00", 
    "instructors": "Evita Ochel", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472892_2f35_5.jpg", 
    "course_url": "https://www.udemy.com/art-of-simplicity/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T15:53:56Z"
}