{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Another training on the stock market, but I think this one is better. First, it's basic enough to address those Frequently Asked questions about getting started while detailed enough to answer the questions so that you can act on them. Second, it starts with getting your financial house in order to make sure you can sustainably afford to invest. </p><p>When this training refers to “the rest of us,” it is referring to those of us who did not grow up with the habit of investing, the goal of wealth creation, and the experience of legacy. This training is for people who are looking to make their first $100,000 not their next million.</p><p>While some financial trainers are telling you not to get into debt, and not to take risks. They are neglecting to tell you how some of the richest and most successful people who CAME FROM NOTHING used debt and risk to their advantage.</p><p>The course explains the basic terminology for stock investing, online trading services, and how to inform yourself about purchases. It's everything you need to know, but have been misinformed about. Even clients who had family members invested have benefited from the explanations provided in this course.</p><p>The course is structured into lessons including the all important:</p><ul><li>Overcoming risk and fear with knowledge of investment options.</li><li>Ensuring a solid financial foundation.</li><li>Explanation of ways to make money in the stock market.</li><li>Exploring trading services. </li><li>Pinpointing the costs of creating a stock trading account.</li><li>Reading stock information, evaluating companies, and staying up to date on with stock buying information and insights.</li><li>Determining an investment strategy that works for YOU.</li></ul><p>Take this course because you realize that your money could be making money for you. </p>", 
    "end_date": null, 
    "title": "Basic Stock Trading & Financial Literacy for the Rest of Us", 
    "price": "20.00", 
    "instructors": "MAWMedia Group, LLC", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416004_013c_3.jpg", 
    "course_url": "https://www.udemy.com/stock-trading-for-the-rest-of-us/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-07T18:42:12Z"
}