{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><em style=\"\"><strong style=\"\">UPDATE: Scheduled price rise to $199 very soon.</strong></em></p><p style=\"\">This course will enable you to:</p><ol style=\"\"><li><strong style=\"\">Make more money in your career</strong> by getting you to discover <strong style=\"\">your unique value which only you have in this world</strong>. Once you light this up, the world will <strong style=\"\">pay you handsomely</strong> for it, because <strong style=\"\">only you have it and no one else</strong>.</li><li><strong style=\"\">Advance up the ladder of wealth</strong> by showing you the <strong style=\"\">steps</strong>, <strong style=\"\">requirements</strong> and <strong style=\"\">attributes</strong> of each of the <strong style=\"\">9 levels of wealth</strong> that all financially successful and financially independent people have gone through since time as we know it began.</li><li><strong style=\"\">Invest</strong> using the same <strong style=\"\">ancient and proven principles</strong> that self-made billionaires have been using, principles that <strong style=\"\">preserve your capital</strong> and create financial gardens that <strong style=\"\">liberate you from having to work for money</strong>.</li><li><strong style=\"\">Start a home or small business</strong>, if you choose to, that takes advantage of your strengths and passions and at the same time releases you from having to work in the business, thereby creating <strong style=\"\">passive income</strong> for you, leading to financial freedom.</li></ol><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">What's The Fuss All About?</strong></p><p style=\"\"><em style=\"\">So, you might ask, \"What's the fuss all about?\"</em></p><p style=\"\">Well, there are several reasons people seem to like this material:</p><ul style=\"\"><li>It's practical</li><li>It's simple</li><li>It's based on proven and time-tested principles and examples</li><li>Students who take it end up feeling better <em style=\"\">instantly</em> and start to <em style=\"\">create</em> tangible positive changes and experiences in their lives, <em style=\"\">instantly</em></li></ul><p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p style=\"\"><strong style=\"\">Content And Overview</strong></p><p style=\"\"><strong style=\"\"><em style=\"\">PART 1: Working For Money - How To Earn More And More, Day By Day, From Your Efforts</em></strong></p><p style=\"\">We first start with working for money, since that is what 99% of the world does. Most of the world works for money.</p><p style=\"\">This course is not a guide to tell you what career to be in or what business to start. There are many other courses out there for that. This course is about how to make more money, whatever career or business you are in.</p><p style=\"\"><em style=\"\">What you are about to learn will work for just about any career, any walk of life, any business, and so on.</em></p><p style=\"\">Think of it this way: let us take the example of architecture, buildings. The fundamentals of a building, the physics, are applicable to all buildings. All architects get taught similar things in all architectural schools in the world, because physics is physics. But once they graduate, they can use that information to design all sorts of different types of houses and buildings.</p><p style=\"\">This course is like architectural school: you will learn the fundamentals. You can then use these fundamentals in your own specific career or area of interest, and they will work.</p><p style=\"\"><em style=\"\">This is a framework for success when it comes to working for money, no matter what work that is.</em></p><p style=\"\"><em style=\"\">And this framework has two components:</em></p><p style=\"\"><strong style=\"\">1. Knowing Your Unique Value &amp; Leveraging It:</strong> There are things that only you can do, in a way that only you can do, and no one else can replicate you. These things are what will make you rich, make you wealthy. These are the things that people will seek you for and pay you well for. No one will pay you for what everyone else can do, for what they can do - it can happen, but unlikely. What is virtually assured is that people will pay you for what only you can do in your way. That is unique. That is value. The trick is, most people don't know themselves, they don't know what their unique value is. Here, we will discover yours.</p><p style=\"\"><strong style=\"\">2. The 9 Levels Of Wealth:</strong> Once you know your unique value and start leveraging it, there are 9 levels to climb. Each level has its ways, and each level leads you to the next. Many people think that making money is random. It is not. It is specific. For example, a corner grocery shop is very different from a supermarket chain. They exist at different levels. The 9 levels of wealth, again, apply to all careers, businesses, areas of interest. Once you learn them, you will have a precise map of what to do with your unique value so as to realise the level of wealth that most interests you.</p><p style=\"\"><strong style=\"\"><em style=\"\">PART 2: Money Working For You - How To Make Money Even While You Sleep</em></strong></p><p style=\"\">Consider this: you do not even need to be alive to make money! We all know of dead people who still make money today. The most obvious ones are famous people like Elvis, Tupac, Michael Jackson... but even normal folk make money even after they are dead. Why? Because they have either a (1) business that run without them having to be there or (2) investments that make money without them having to be there.</p><p style=\"\">Even dead people make money!</p><p style=\"\">That statement should right away let you realize that there is an entire different world of money out there.</p><p style=\"\">And you can join that world. To join it, you have two options, and you can take either one of these options, or both:</p><p style=\"\"><strong style=\"\">1. Investments:</strong> I am not talking about mutual funds. You will discover later in this course what I am talking about. However, an investment garden that creates money 24/7, independently, is the easiest way to get wealthy. However, it takes a longer time than the second option, even though it is far safer and easier than the second option, which is...</p><p style=\"\"><strong style=\"\">2. Businesses:</strong> A business may be harder to start and set up, may be risker even, but it creates wealth much, much faster than investments. Again, most people think they know what a business is, but they don't. When you start a business and you have to wake up in the morning for that business otherwise the business doesn't run, then you don't really have a business. Being self-employed is not the same as owning a business. We will cover what a true business is composed of, one that allows you to walk away and it still runs.</p><p style=\"\">Welcome!</p>", 
    "end_date": null, 
    "title": "Become More Valuable at Work or Start a Small Business", 
    "price": "20.00", 
    "instructors": "David Cameron Gikandi", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/422674_2090_2.jpg", 
    "course_url": "https://www.udemy.com/become-more-valuable-at-work-or-start-a-small-business/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-15T19:40:12Z"
}