{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Gain access to your own individual copy of your \"Finance Compass\" financial tracker and learn how use it best!</p><p>This course is a step by step guide to create your personal finance tracker. By the end of this course, you will have created a powerful tool to manage your finances each month, which will provide you 100% clarity on how much you spent, including the invisible costs that most people don’t consider, and will also enable you to know what your bottom line figure is: the range of money you have the opportunity to save each month! </p>  <p>By registering to this training you will get your individual copy of the personal finance tracker called the “Finance Compass” and the videos will guide you on how to use it. It makes it simple, easy, and straightforward for you.</p>    <p>In addition to your own downloadable version of the Finance Compass, which is a powerful financial tracker, this course incudes 2 sets of videos:</p>      <li>A first set of videos introducing the fundamental principles of successful financial management</li><li>A second set of videos that are recordings from the Finance Compass to help you understand how to use it. An interactive manual!</li><p><br></p><p>The Finance Compass includes the following sections:</p><ol><li>your monthly expenses</li><li>your invisible costs</li><li>your revenues</li><li>your bottom line figure</li><li>your monthly tracker</li><li>your 12 months savings plan</li></ol>", 
    "end_date": null, 
    "title": "Beginner Guide to Creating Your Personal Finance Tracker", 
    "price": "20.00", 
    "instructors": "Greg Henriques", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644002_7daf_13.jpg", 
    "course_url": "https://www.udemy.com/gain-control-over-your-finances-and-save-money/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-18T16:00:21Z"
}