{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">“Bitcoin for Beginners”</strong> is the new Udemy Video Training Series designed to help anyone who wants to know more about <em style=\"\">“The Future of Money”</em>, but needs someone to show them how it works in the real world, and do it in simple language anyone can understand. Whether it is used as a store of value, an investment, for sending money worldwide for virtually nothing, or for those just looking to experience the latest in global financial technology, <em style=\"\">Bitcoin</em> has something for everyone. This will take someone who has no knowledge of <em style=\"\">Bitcoin</em>and bring them a solid understanding of what it is and why it is here to stay, and a worthwhile investment in your future.  </p>  <p style=\"\">  \t  This Free Version of <strong style=\"\">&quot;Bitcoin for Beginners&quot;</strong> gives you a basic understanding of how Bitcoin works, and gets you ready for more advanced training in the 20-Video Udemy Training series. The full version also includes the eBook <strong style=\"\">&quot;Bitcoin Bonanza - Why You Need to Get Bitcoin Now&quot;</strong>, plus Volume 1 of the <strong style=\"\"><em style=\"\">Bitcoin Bonanza Newsletter</em></strong>, which shows you how Bitcoin has become a global phenomenon.  </p>  <p style=\"\">  \t<strong style=\"\">Here you will learn:</strong>  </p>  <ul style=\"\">  \t<li><em style=\"\">Who Evander Smart is, and why his background on Wall Street helps him teach the benefits of using Bitcoin</em></li>  \t<li><em style=\"\">How the current global monetary policy works, and how it is destined to collapse on a grander scale, following many mini-collapses that have already happened recently.</em></li>  \t<li><em style=\"\">How Bitcoin is modeled after the growth and design of The Internet, and how this model of success will change &quot;The Future of Money&quot;</em></li>  \t<li><em style=\"\">How PayPal is a future victim of the design advantages of Bitcoin, and how PayPal joining forces with Bitcoin may only delay the inevitable</em></li>  \t<li><em style=\"\">How Bitcoin is made, and how it has a record of security fiat (paper) currency only dreams of.</em></li>  \t<li><em style=\"\">How Bitcoin is transitioning to a global currency, and the growing pains that go along with that growth. </em></li>  \t<li><em style=\"\">How adding major endorsements and partnership with mega-corporations like Microsoft, Dell, Wikipedia and PayPal hurts Bitcoin&#039;s value in the short-term, and how they strengthen it long-term.</em></li>  </ul>", 
    "end_date": null, 
    "title": "\"Bitcoin For Beginners\" - Using Bitcoin & Altcoins", 
    "price": 0, 
    "instructors": "Evander Smart", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414096_9497.jpg", 
    "course_url": "https://www.udemy.com/bitcoinforbeginnersfree/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T12:54:19Z"
}