{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em><strong>Over 300 students registered!</strong></em>  </p>  <p>  \t      This course will show you how to boost your retirement income through passive means. You don't need to get a part-time job. You can work from home, from the library, or anywhere else. All you need is access to a computer for the self-publishing process.  </p>  <p>  \t            The course will cover a variety of methods that anyone can use to earn money. Writing, recording, photography, blogging, and more, will be covered. These all use technology, but luckily the concepts are pretty easy. There are step by step instructions provided when extra detail is needed. The author, and those that have already taken the course, are available to help you should you have any trouble.  </p>  <p>  \t            As mentioned, you will need a computer, and it must have Internet access. This will allow you to publish material when necessary. You can develop your materials offline and upload them as soon as you are able, or you can have an active connection to the Internet at all times.  </p>  <p>  \t            This course is comprised of video lectures and supplemental documents. The lectures will feature screen capture images. The intent is to show how everything works by recording the actual systems in use. This will reduce the complexity. You should be able to follow along and if you can't, please ask the author for help.  </p>  <p>  \t            You should take this course if you feel that you need to augment your monthly income through non-traditional methods. A number of methods will be shown. These will allow you to earn money. Best of all, when you follow the steps, you can devote effort to the process then sit back and earn income passively. When everything is working for you, you'll be able to earn money virtually 24 hours a day.  </p>  <p>  \t            Note that you should not expect to get rich by following the course instructions. Your actual revenue earning potential will depend on many factors. Most of all, your dedication to the process is the key. If you take no action, you will earn no revenue. If you follow the steps, you can earn money. The author can make no guarantees about the applicability of the course materials for your particular situation.  </p>  <p>  \t      Updated on January 4, 2015:  </p>  <p>  \t      - added December 2014 description of earned amounts  </p>  <p>  \t      - new descriptions  </p>  <p>  \t- adjusted audio tracks on lectures  </p>  <p>  \t- created new lectures to be published asap  </p>", 
    "end_date": null, 
    "title": "Boost Your Retirement Savings", 
    "price": "20.00", 
    "instructors": "Vaughn Smith", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321054_ebd3_5.jpg", 
    "course_url": "https://www.udemy.com/boost-your-retirement-savings/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-16T19:03:31Z"
}