{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        The $50 Wealth-Builder gives you what you need to know to start investing with as little as $50 to get rich slowly! Learn how to invest starting with small amounts in investments such as bonds, stocks, ETFs, mutual funds, real estate and precious metals.  </p>  <p style=\"\">  \t   I first did this seminar in 1983....still going strong after 30 years! The information is extensive and is continuously updated for today's financial markets and economic conditions.  </p>  <p style=\"\">  \t        Among what will be covered is ...  </p>  <p style=\"\">  \t        * The 5 things you must do before you invest your first dollar  </p>  <p style=\"\">  \t        * Mini-crash course for retirement (reaching financial independence!)  </p>  <p style=\"\">  \t        * How to start on the path toward your first $1 million (the 4 ways to start).  </p>  <p style=\"\">  \t        * How to start investing in bonds with as little as $25  </p>  <p style=\"\">  \t        * How to choose stocks for your investing approach  </p>  <p style=\"\">  \t    * How to buy stocks starting with $50 (or less!)  </p>  <p style=\"\">  \t        * Understanding exchange traded funds (ETFs) and why they can be great for most investors  </p>  <p style=\"\">  \t        * Mutual Funds; How to choose them. The 6 steps to choosing the right one for you  </p>  <p style=\"\">  \t        * The 9 basic categories of mutual funds and which will meet your needs  </p>  <p style=\"\">  \t        * Which types of investments are good (or bad) for today's economy  </p>  <p style=\"\">  \t        * How to easily buy income-producing real estate starting with under $100  </p>  <p style=\"\">  \t    * How to get 18% interest...guaranteed with this real estate-related investment.  </p>  <p style=\"\">  \t        * Buying precious metals as a diversification from paper assets  </p>  <p style=\"\">  \t        Included will also be resources to help you you every step of the way.  </p>  <p style=\"\">  \t    Although there is over 8 hours of content, you don't need to view or listen to all of it. All the video content comes bite-sized! Most videos are in the 5-9 minute range so you can view as much or as little as you need to (or want to).  </p>  <p style=\"\">  \t    The audio portion of the program (3 hours in MP3 format) can be downloaded to listen through your favorite electronic device.  </p>  <p style=\"\">  \t    The bottom line is that if you want to learn about investing in a personal style, easy to view or listen to...either as a novice or intermediate, this program is for you!  </p>  <p style=\"\">  \t  The seminar leader, Paul Mladjenovic, has been a CFP since 1985 and he has authored books such as Stock Investing For Dummies and has been teaching about investing and business start-up issues since 1983. His website is <a class=\"external-link\" href=\"http://www.RavingCapitalist.com\" rel=\"nofollow noreferrer\" style=\"\" target=\"_blank\">RavingCapitalist.com</a>.  </p>  <p style=\"\">  \t  ...you can't beat the value. You get extensive information and guidance that normally sells for hundreds (or even thousands!) in other venues...but you can full access for a very low price...start learning about investing and wealth-building today!  </p>  <p style=\"\">  \t IMPORTANT: The course is only $37 until 12/31/2013.  </p>", 
    "end_date": null, 
    "title": "Build Your Future: Smart Tips for Investors of All Levels", 
    "price": "50.00", 
    "instructors": "CFP Paul Mladjenovic", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107162_82ff_7.jpg", 
    "course_url": "https://www.udemy.com/build-your-future-smart-tips-for-investors/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-17T15:20:01Z"
}