{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you ever felt that you are not getting ahead no matter how hard you work? Do you feel working 9 to 5 is not what your life should be about? To get out of the rat race and live a meaningful life you must save and invest. This is no news, yet most people do not even try, or the ones who do, give up when the first difficulties present themselves. </p>\n\n\n\n<p>The reason for failure is tantalizingly simple: you are taught to earn money but the school system didn’t arm you with the knowledge of putting your money to good use: <strong class=\"redactor-inline-converted\">investing </strong>it<strong class=\"redactor-inline-converted\"> to produce Reliable and Growing Passive Income</strong>.</p>\n\n\n\n\n\n\n\n<p>This is exactly what you will learn in this course! Forget gambling with your hard earned cash, the stock exchange can be your wealth building platform if you follow a recipe that has been working well for centuries. Do you think the richest people in history were all just lucky when it came to investing? Absolutely not, and many of them used the approach you can learn here.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">\"Do you know the only thing that gives me pleasure? It's to see my dividends coming in.\" - John D. Rockefeller</strong></p>\n\n\n\n\n\n\n\n<p>See for yourself in one of the FREE preview videos that Rockefeller knew what he was talking about: <strong class=\"redactor-inline-converted\">Dividends explain almost 90% of the profits you can make in the stock market</strong>, yet very few investors give them the due respect when it comes to picking stocks for their portfolios. </p>\n\n\n\n\n\n\n\n<p>After this course you will not make this deadly mistake, since the knowledge included in these videos have the power to change your life by taking CONTROL of your financial future.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why taking this course is a no-brainer?</strong></p>\n\n\n\n\n\n\n\n<ul><li>Learn the investment system I built after reading more than 30 books, subscribing to the most expensive newsletters and asking the available experts tons of questions. What took me years of hard work and a lot of money can be yours for a bargain basement price.</li><li>You can learn this investment approach in about 2 days (even if you are totally new to stock market investing) and using this simple system will only take 1-2 hours per week.\n\n</li><li>This course is all about <strong class=\"redactor-inline-converted\">“learning by doing”</strong>. By the end of it, you will have your OWN shortlist of top quality stocks available at fair or lower prices. So your successful start is virtually guaranteed.</li></ul>\n\n\n\n<ul><li>Dividend investing is not a flash in the pan. This approach has been working well for centuries and I am sure that <strong class=\"redactor-inline-converted\">even your CHILDREN will use the knowledge you can get from this course</strong>. After all, this is about intergenerational wealth building.\n\n</li><li>Dividend investing is a proven approach that produces <strong class=\"redactor-inline-converted\">outstanding returns</strong>. See the PROOF in one of the FREE preview videos and get ready to learn how to invest for passive income the right way!</li></ul>\n\n\n\n<ul><li>By focusing on dividends, <strong class=\"redactor-inline-converted\">you can track your PROGRESS</strong> towards your ultimate goal and as the world’s number one peak performance coach, Tony Robbins says: “Progress equals happiness.” Progress is guaranteed if you follow the 12 Easy Steps outlined in the Lectures.\n\n</li><li>This course is entertaining and enjoyable besides being useful. I love teaching and this comes across, <strong class=\"redactor-inline-converted\">making your learning experience FUN</strong>!</li><li><strong class=\"redactor-inline-converted\">I am here to answer all your questions</strong> and HELP you start your journey towards financial freedom.\n\n</li><li> I provide FREE preview videos to make your decision easier. Writing a course description that sells is definitely easier than providing real value in the course lectures. Feel free to check out the quality of my videos!</li><li>I’m so confident you will like what you learn here that if you are not 100% happy with this course I do not want to keep your money. It is not only my personal promise, but Udemy gives you a <strong class=\"redactor-inline-converted\">30-DAY TOTAL MONEY BACK GUARANTEE</strong>, so give yourself the chance to learn with zero risk! (This is like an investment that has no downside risk, so there is no rational reason to pass it up.)\n\n\n\n</li></ul>\n\n<p><br></p>\n\n<p>This course arms you with the Knowledge and Confidence to start investing. Take the first step and <strong class=\"redactor-inline-converted\">ENROLL NOW</strong>!</p>", 
    "end_date": null, 
    "title": "Build a Passive Income Dividend Portfolio in 12 Easy Steps", 
    "price": "50.00", 
    "instructors": "David Solyomi", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/748880_82ae_3.jpg", 
    "course_url": "https://www.udemy.com/build-a-passive-income-dividend-portfolio-in-12-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T13:36:31Z"
}