{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  This course is for the self-employed, business owner/manager and accounting student as well as the individual who wants to understand how to create a cashflow forecast (on excel) and how to set a budget.  </p>  <p style=\"\">  \t  The course is ideal if you want to improve your finances (both in business or from a personal perspective). The course covers budgeting (how to set a budget and what budgeting is), and cashflow – how to create a cashflow forecast, how to improve upon a cashflow forecast and the implications of bad debt and poor cashflow management.  </p>  <p style=\"\">  \t  An excel template cashflow forecast and an excel budget template is included. You can use these templates and amend them to suit yourself – be it for personal or business use.  </p>  <p style=\"\">  \t  The course should take approx 90 minutes to complete. We go through a cashflow forecast exercise / example together – inputting the income, the expense and working out the net cashflow. WE then calculate the closing bank balance and when we’re likely to need an overdraft. We look at ways in which we can improve upon the cashflow forecast and discuss the implications of not collecting in the cash owed to use in a timely manner.  </p>  <p style=\"\">  \t  We explore the issue of debt and the implications of late payments on a business and what can be done about it. We also look at budgeting – how to set a budget, and the different types of expenses.  </p>  <p style=\"\">  \t  The course is structured in such a way that it is very practical. We have a go at a cashflow forecast example with estimated numbers and we look at what this forecast shows us. The templates are all editable and reusable in your own ‘real life’ be it business life or personal life. You are given practical tasks to complete i.e. to maintain a money diary for a week as we want this to be a useful and practical experience.  </p>  <p style=\"\">  \t  Its worth taking this course if you are required to do a cashflow forecast and you’ve never had to do one before, or if you have to budget and manage your personal or business finances and you want to be able to manage this task more effectively.  </p>", 
    "end_date": null, 
    "title": "Cashflow & Budgeting", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302462_5b44_3.jpg", 
    "course_url": "https://www.udemy.com/cashflow-budgeting/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:11:31Z"
}