{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Has debt and a lack of financial control ever held you back from living your best financial life? </p>  <p>Are you under constant stress because you live paycheck to paycheck and can’t see how you will ever turn the corner financially?</p>  <p>If you could completely turn your finances around, what great things could you do that you’re not able to do right now?</p>  <p>Where would you go?</p>  <p>Who would you bless?</p><p><br></p>    <p><strong>Your Best Future is Waiting!</strong></p>  <p>Celebrating Financial Freedom will help you answer those questions and make your best future a reality!</p>  <p>CFF is a get out of debt course based on Christian financial principles and a ton of common sense.</p>  <p>I’m Jason Cabler from the top ranked <strong><em>CelebratingFinancialFreedom </em></strong><em>blog</em>, and I’ll show you the exact techniques My wife Angie and I used to get rid of all our consumer debt and start succeeding with money like we never had before.</p>  <p>Since we did it, we’ve been able to:</p>  <ul><li>Completely paid off our cars, and paid cash for all of our vehicles (3 of them) since then.</li><li>Paid cash for all our vacations.</li><li>Paid cash for Angie’s Bachelor’s and Master’s degrees.</li><li>Financed our Christmas spending every year with cash.</li><li>Currently sending our oldest to college without taking out any student loan debt (scholarships provide only 10% of the cost, the rest we pay for in cash).</li><li>We’re able to bless several charities that are near to our heart on a monthly and yearly basis.  This is over and above what we give to our church in tithes and offerings.</li></ul>            <p>None of these things would have been possible had we not made the decision years ago that debt was <strong><em>just not worth it</em></strong> anymore.</p>  <p>So as you think about what your debt free future can look like, understand that <strong><em>you can get there too</em></strong>, and I can show you how.</p><p><br></p>    <p><strong>Here’s What You’ll Learn</strong></p>  <p>In this course, I’ll show you how to start living the financial life you’ve always wanted.  More importantly, you will learn:</p>  <ul><li>How to change your <strong><em>mindset</em></strong> and <strong><em>behavior</em></strong> when it comes to money.</li><li>The <strong><em>exact plan</em></strong> that Angie and I used to get out of debt, which you can easily <strong><em>customize</em></strong> to fit your own situation.</li><li>How being a better manager of your resources changes your spirit, your marriage, and your family tree.</li><li><strong><em>And much more…</em></strong></li></ul>        <p>This course is a <strong><em>small investment in yourself</em></strong> that will literally save you tens to hundreds of thousands of dollars over your lifetime!</p>    <p><strong>Free Preview + a Guarantee</strong></p>  <p>Feel free to use the blue <strong><em>“Preview”</em></strong> buttons below to check out some of the actual video content from the course to get a feel for what it’s all about.  </p>  <p>I <strong><em>guarantee</em></strong> that when you use the techniques in this course, you WILL get out of debt!  We did it and I know you can too!</p>  <p>Best of all, there is <strong><em>no risk</em></strong> because you have an iron clad <strong><em>30 day money back guarantee</em></strong>!  You will get your money back, no questions asked if you decide the course just isn’t for you.</p><p><br></p>    <p><strong>Here’s What My Students Think</strong></p>  <p>Here’s what some of my previous students have to say about the course:</p>  <p><strong><em>Shana B. says-</em></strong><em> \"Dr. Jason Cabler deserves five stars for this course because he gives you step by step instructions on getting out of debt. I like that he is available for you with his guidance. He...wants to see you succeed. Thank you Dr. Cabler for putting together Celebrating Financial Freedom!\"</em> <strong><em></em></strong></p>  <p><strong><em>John Frainee says:</em></strong><em> “Section 4 on getting out of debt truly works, and is liberating.” “I highly recommend this course… A+!”</em></p>  <p><strong><em>-Gina H.- </em></strong>When asked if she would recommend the course to others <em>“Absolutely! I already have.\" <strong></strong></em></p>  <p><strong><em>Darren Watson says: </em></strong><em>“Dr. Cabler's CFF is already changing our lives and anyone can do this! I highly recommend it to everyone whether you have financial challenges or not. Everyone and every relationship can benefit!”</em></p>    <p><strong><em>So what are you waiting for?</em></strong>  If you’ve decided it’s finally time to stop living paycheck to paycheck and finally get out of debt for good, here’s your chance!</p>  <p>It’s the <strong><em>best investment</em></strong> you’ll ever make!</p>  <p>Just click here to enroll or scroll back to the top and click the <strong><em>“Take This Course” </em></strong>button</p>", 
    "end_date": null, 
    "title": "Celebrating Financial Freedom", 
    "price": "50.00", 
    "instructors": "Jason Cabler", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32836_d6f5_10.jpg", 
    "course_url": "https://www.udemy.com/celebrating-financial-freedom/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-16T19:36:33Z"
}