{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Updated on December 2015:</strong><br></p><p><strong>Enroll on this Course right now</strong>. You can be making more money next week that you are doing today.</p><p>__________________________________________</p><p>***** <strong>Top 50 Udemy Authors in the Business Finance Industry</strong> - <em>eSkillsToday Award</em> *****</p><p>***** <strong>Ricardo is one of the best Instructors and my favorite when we are talking about Passive Income and Business Development. Hands down.</strong> - <em>Mike Robinson</em> *****</p><p>***** <strong>Near 1200 students enrolled in the first 4 weeks! </strong>*****</p><p>__________________________________________</p><p><strong>Who is this course for and why you should take it (in 1 minute):</strong></p><p>Hello and welcome to the Course, where I’ll take you through the entire process of creating money online from several ways, from scratch.  My name is Ricardo Ribeiro and I’m an awarding winning Instructor in the Business Finance Industry, with more than 15 years experience, owner of several successful businesses, with thousands of dollars made on Passive Income, and an enthusiast of Personal &amp; Business Development.</p><p>This certified course is for you that seeks to improve your overall making money online skills and build profitable money making passive income sources, combined with your own self development. Throughout the course we will cover techniques used by professionals, and walk you through a step-by-step process for creating profitable passive income sources on your own, that you will successfully benefit from for many years to come by not doing nothing more, and… I’ll even include a few “secrets of the pros.”</p><p>--------</p><p>Did you know that you easily could automate your income every month without exchanging work for money, be in charge of your time, live a wealthier life and improve your life in general? </p><p>If you don't have a clue of what I am talking about, let's show you the light. <strong>Passive income is the money you profit continuously from assets you have created or purchased. </strong>Here's an example; if you buy a house and rent it out for more money than it costs you to pay your mortgage and other expenses every month, that profit you make is considered passive income. Other example is writing a book, you only have to write it once and put it on the market for sale, after that, your only job is marketing that book to increase sales, <strong>giving you a steady influx of profit</strong>. </p><p>You should start thinking on your future, <strong>start putting money to work for you</strong>. There are many ways you can create passive income these days, and on this Course we will cover the 3 best, most profitable and easy of them.</p><p><strong>This Course is the awakening for you</strong> so that you can spend more time with your family, earn money while laying back at the beach, spend time writing that book you always wanted and that could help thousands of people, spend time starting a business you truly love.</p><p>Imagine how amazing that would be if you could be experiencing this right now. <strong>Well, the truth is you can! You just need to get started</strong>…</p><p><strong>And since your success is intimately connected to your personal development, on this Course we will be focusing on that too. Learn 5 easy steps that you can do and can change your life forever.</strong></p><p>I'm here to help you and I'm available to answer your questions and advice you along the way. Together we can make sure you have great success in your life.</p><p>Thanks for your interest in this course. I put my hearth and soul on everything I do so you have my personal guarantee that you will absolutely love it as the happy students already enrolled, or y<strong>ou have 30 days money back guaranteed with no questions asked</strong>, so… you have nothing to lose. </p><p>I hope you’re as excited as I am!  If you’re ready to learn more and sign up for the course, <strong>go ahead and hit that Enroll button</strong>, or take a test drive by using the Free Preview feature. See you in the course!</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Change Your Life: Run an Online Business from Home", 
    "price": "20.00", 
    "instructors": "Income Mastering Ricardo Ribeiro", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618102_6b2a_7.jpg", 
    "course_url": "https://www.udemy.com/change-your-life-run-an-online-business-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T13:32:13Z"
}