{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<div style=\"\">  \t<span style=\"\">The number one key issue that many </span><span style=\"\">small businesses and individuals </span><span style=\"\">face are cashflow challenges. This course is about why Cashflow is so important to your financial survival and happiness and how to generate Constant Cashflow. The problem with Cashflow is that often businesses and individuals are too reliant on just one income stream/source. Instead of just having &#039;one/two&#039; jobs or key clients, and &#039;twenty&#039; expenses, why not turn this around? What we demonstrate on this course, is why everyday should be a payday - and we explains how to make each of your days a payday and why.</span>  </div>  <div style=\"\">  \tUnfortunately most workers in the western world are indebted and terrified of losing their jobs and are working around the clock just to make ends meet. During this course, we will outline several things that you can do to generate Constant Cashflow, but nothing is overnight, and this is why we ask you to dedicate 1 hour a day over the next 12 or so months to the tasks and activities set out. This is time well invested, as once you have constant cashflow - then you don&#039;t have to work so many hours in your day job or business.  </div>  <div style=\"\">  \tThe secret to prosperity it to have constant cashflow - streams of income flowing in from more than one source, but rarely does anyone show you how. This course will show you how. If you&#039;re sick and tired of being sick and tired of your financial situation then this course is for you. This course will show you how to make money flow to you every single day - whether you are a small business owner, self-employed, employed, unemployed, underemployed or a student.  </div>  <div style=\"\">  \tThe book &#039;Constant Cashflow&#039; is included, as are template downloads.  </div>  <div style=\"\">  \tThe course will take approx 1-2 hours to complete.  </div>", 
    "end_date": null, 
    "title": "Constant Cashflow", 
    "price": "30.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302458_fb58_6.jpg", 
    "course_url": "https://www.udemy.com/constant-cashflow/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:09:53Z"
}