{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p></p><p><p>&quot;Creating a Personal Budget: How to\r\nMake a Personal Budget&quot; guides you through a five-step process, using\r\ntransformative tools and concepts, for finally developing a spending plan that\r\nworks for you and incorporates all those various financial puzzle pieces that\r\nmake up your personal financial world. </p>\r\n\r\n<p>This Creating a Personal Budget course will\r\nteach you how to budget by explaining and showing how all the pieces work\r\ntogether.</p>\r\n\r\n<p>Based on the\r\nbest-selling workbook, <em>The Budget Kit:\r\nCommon Cents Money Management Workbook</em> (Kaplan Publishers), which has been\r\nselling in national bookstores for over thirty years, the tools and concepts\r\nare flexible and adaptable, making them tools you will use for a lifetime. You\r\ncan use the tools as a stand-alone budgeting system or apply them to other\r\nsoftware or online programs you’re currently using.</p>\r\n\r\n<p>Even though\r\nyou may have used variations of these budgeting tools with the many budgeting\r\nproducts available, there was probably still something missing.&nbsp; This course provides the missing piece. </p>\r\n\r\n<p>After going through this Creating a Personal\r\nBudget course, and learning how to make a personal budget, outline and work\r\nwith a comprehensive and realistic budget/spending plan for the month, as well\r\nas the year, you will have a better understanding of why your other budgeting\r\nattempts were not working.</p>\r\n\r\n<p>You will\r\nreceive many valuable materials including &quot;The Budget Kit 6th Ed.&quot;\r\neBook, PDFs of the dozens of worksheets found in the workbook, along with an\r\nExcel Package of prime worksheets.</p>\r\n\r\n<p>With nearly\r\nthree hours of video by the author sharing her decades of experience with you\r\nand specific homework using the course materials, rest assured, this time you\r\nwill have a lifelong system that works and will bring you mastery, confidence\r\nand financial peace of mind.</p>\r\n\r\n<p>Here’s what\r\nsome satisfied customers/clients said about Judy’s style and body of work:</p>\r\n<p><em>“Just wanted to thank you for your\r\ntime and assistance today. You were very helpful in resolving my problems. As\r\nwe discussed, I have your budget software to be really great. I have tried\r\nseveral in the past. However, I found your software and book to be\r\noutstanding!!”</em>&nbsp; - Larry</p>\r\n\r\n<p></p>\r\n\r\n<p><em>“I continue to study (and love your\r\nBudget Kit. Thanks for holding my hand and getting me going.”</em>&nbsp;\r\n- Elfriede</p>\r\n<p><em>“Working with Judy, and her Budget\r\nKit book, has helped me bring order to my financial life on a monthly basis and\r\nto clarify my big-picture financial goals. Her supportive, practical coaching\r\nstyle guided me towards budgeting solutions and behaviors that fit my own core\r\nvalues and lifestyle, and has given me a greater sense of peace and personal\r\nsuccess.”</em>&nbsp; - Jonathon</p>\r\n\r\n<p>Take this Creating a Personal Budget course\r\nand learn how to make a personal budget.</p>&lt;/p&gt;<p></p>\r\n", 
    "end_date": null, 
    "title": "Create a Budget that Works", 
    "price": "30.00", 
    "instructors": "Judy Lawrence", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25998_150d_3.jpg", 
    "course_url": "https://www.udemy.com/create-a-budget-that-works/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-04T18:30:35Z"
}