{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">By far, the NUMBER ONE credit repair course on Udemy!  Over 3,500 students can't be wrong.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">LATEST: Course updated in June, 2016!   </strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">CONSTANTLY EXPANDED:  5 new lectures added this week!  Now over 5 hours of content!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Learn everything you need to start improving your credit today.  Put yourself in the position to buy your dream home, get a new car, or qualify for a business loan.</p>\n\n\n\n\n\n\n\n\n\n<p>Your credit status is your most important financial asset. If you take care of it, it will take care of you, even in areas you have never thought about. Of course it can affect your ability to get a loan for a car or a home, but it can also affect many other areas of your life such as getting bail, a job, an apartment, or even a cell phone.</p>\n\n\n\n\n\n\n\n\n\n<p>In this course, we'll figure out, together, the areas where your credit can be improved, start repairing them, and lay out a working plan for issues that need a longer term to fix. </p>\n\n\n\n\n\n\n\n\n\n<p>Written in a way that can be understood by anyone, <strong class=\"redactor-inline-converted\">THIS COURSE WILL ALLOW YOU TO BEGIN IMPROVING YOUR CREDIT QUICKLY, EASILY, AND ACCURATELY.</strong> No complicated jargon, no sleep inducing explanations, and no long-winded details unrelated to your situation.</p>\n\n\n\n\n\n\n\n\n\n<ul><li>Written by best-selling author and expert, Craig Randall - \"<em>For 25 Years, The Credit Repair Coach!\"</em></li><li>Finally a course that will teach you step-by-step how to fix your credit immediately.<strong class=\"redactor-inline-converted\">  You can actually begin the credit repair process within an hour of beginning this course.</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li>Already up to date with June<strong class=\"redactor-inline-converted\"> 2016</strong> tools, tricks and standards! </li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li>Included are many screen shots, images and diagrams to help you <strong class=\"redactor-inline-converted\">follow the EXACT, MISTAKE-FREE path </strong>to improving your credit. </li><li>The <strong class=\"redactor-inline-converted\">NUMBER ONE </strong>selling Udemy course on credit repair!</li></ul>\n\n\n\n\n\n\n\n\n\n<p>You will also learn about repairing specialty areas such as foreclosures, bankruptcies, late payments, medical bills and other common areas that damage credit.<br></p>\n\n\n\n\n\n\n\n\n\n<p>And finally, you will learn how to build good financial habits that will continue to improve your credit for the rest of your life. </p>\n\n\n\n\n\n\n\n\n\n<p>At the end of this course, you will have the knowledge, experience and tools to achieve a high credit score.</p>\n\n\n\n\n\n\n\n\n\n<ul><li>No Risk: 30 day money back guarantee!</li><li>Learn Anytime: Lifetime Access</li><li>Learn Anywhere: Computer, iPhone, iPad and Android</li><li>Get Recognition: Course Certificate</li></ul>", 
    "end_date": null, 
    "title": "Credit Repair : The Complete Guide to a Great Credit Score", 
    "price": "20.00", 
    "instructors": "Craig Randall", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430408_1996_5.jpg", 
    "course_url": "https://www.udemy.com/credit-repair/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T22:42:25Z"
}