{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                      Welcome to Credit Repair Techniques for Better Credit and Higher Scores.  </p>  <p>  \t              This course is for those who have experienced a hard time trying to get credit with decent interest rates when applying for a home, automobile, or even a credit card etc. because of their low credit scores and don't know what to do to better their credit. The content in this course teaches the beginner not only how to re-establish a better credit profile and how to get higher scores, but also how to maintain your good credit and high scores.  </p>  <p>  \t              Credit Repair Techniques consists of 12-short, video presentations (most of them under 3 minutes), including an introduction, last thoughts, and a conclusion. Some of the topics that are covered in the course include::  </p>  <ul>  \t<li>what you can do to help your credit scores increase,</li>  \t<li>how to re-establish a good credit profile,</li>  \t<li>what to do if you're ever harassed by a creditor,</li>  \t<li>how you can restore your credit profile after a bankruptcy,</li>  \t<li>how to handle old debts and late pays,</li>  \t<li>how to stay aware of what's going on with your credit profile,</li>  \t<li>how to manage applying for credit and paying your bills,</li>  \t<li>how to manage credit card balances, and </li>  \t<li>services that are available to help with debt management</li>  </ul>  <p>  \t              The course is only a little over 30-minutes long and PDF files are also available. You can choose to follow along with the video presentations or you can print out a PDF copy and study the materials at your own pace.  </p>  <p>  \t            If you really want a better credit profile and higher credit scores to get the best interest rates when applying for a new home, an automobile, or credit cards, etc., this is the course for you.  </p>  <p>  \t        It's time to take charge of your credit profile destiny and get the credit and higher scores that you deserve.  </p>", 
    "end_date": null, 
    "title": "Credit Repair Techniques", 
    "price": "20.00", 
    "instructors": "Claudette Pendleton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314028_a7e6_5.jpg", 
    "course_url": "https://www.udemy.com/credit-restoration-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-06T00:42:13Z"
}