{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                    Debt Buster Dynamite explores all the various options available to reduce debt but capitalizes on the fastest debt payoff system available. It teaches that the average American consumer can eliminate all debt including the mortgage in an average 7.5 years with the money currently being earned. This system is covered in depth.  </p>  <p>  \t                    But teaching this method is the simple part.  Developing the motivation to put it in action is the tough part.  Therefore, a good part of this course involves both negative and positive motivation including the two most powerful super charge practices to insure success.  </p>  <p>  \t                    This course is for anyone in debt but favors consumers living from paycheck to paycheck. (Please note: if a person has initiated bankruptcy, this course won&#039;t help but will offer guidance for the future.)  </p>  <p>  \t                    Debt Buster Dynamite is a series of short videos, downloadable documents and support materials all designed with one purpose… to help you reduce or eliminate debt.  It is taught through power point lectures and with light-hearted and motivating illustrations where possible.  The speaker is a very dedicated and experience debt counselor and instructor.  Short quizzes are included both to cement the learning process and to help the instructor improve the course.  </p>  <p>  \t                    There are also other attached documents through Google Docs to include Instructor office hours and instructions for using <em>Delicious</em> web site as well as other free support resources. Students are encourage but not required to participate in ongoing communicative efforts.  The instructor is available on the Forum during office hours and via email anytime .  </p>  <p>  \t      The student should have available a list of their debts including minimum payment and balance payoff.  They should also bring to class the mental makeup to make changes in their lives.  They should also be prepared to take notes during the lectures and be willing to pause to write things down or be willing to listen to the lecture multiple times.  Since this is mostly lecture, the student should prepare themselves accordongly and stop when mentally tired as this information is too important to gloss over.  </p>  <p>  \t                    If you are drowning in a sea of debt or know of someone who is, this course is for you. If you simply can’t muster the motivation to take an action on your debt problem, this course is for you. This material is important enough to every individual, that telling others about it could be the greatest gift one individual can give to another.  </p>", 
    "end_date": null, 
    "title": "Debt Buster Dynamite", 
    "price": "20.00", 
    "instructors": "Michael (Mike) Killian", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299366_8aa9_4.jpg", 
    "course_url": "https://www.udemy.com/debt-buster-dynamite/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-12T23:08:43Z"
}