{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Welcome to <strong><em>Design Your Dream: Your Financial Plan for Success</em></strong>, where you'll design your personal financial plan to meet your goals, care for your loved ones, and enjoy financial peace of mind.</p><p><strong>** Control Your Financial Destiny **</strong></p><p>You'll feel confident about your financial life, set some clear priorities, and move forward for financial peace of mind.</p><p>You'll complete this course with a CLEAR, PERSONALIZED plan with your top financial priorities.</p><p><strong>** Feel Confident About Your Money **</strong></p><p> In these quick, narrated video lessons, you will:</p> <ul><li>Learn two quick ways to INCREASE your income</li> <li>Understand when NOT to invest.</li> <li>Find the best savings rate – hint: it's NOT at the corner bank.</li> <li>Master planning for college, whether your have years, months, or just weeks to prepare</li> <li>Learn 10 Sources for Great FREE stuff.</li> <li>Plan your next career, whether you're brand new or getting back into the work force after a break</li></ul> <p><strong> “On My Way to Debt Free\" </strong></p> <ul><li>Learn the emergency-911- consumer debt strategy that YOU control – not the bankruptcy court!</li> <li>Looking for work? Get three great tips for keeping yourself focused even when facing unemployment.</li> <li>Join us for “7 Steps to get back on track\" if your financial life is stuck in a ditch</li></ul> <p>Plus lots more:</p> <ul><li>The number one first step in your financial plan is this – and it's actually pretty easy</li> <li>Three red flags that say you need a will right away</li> <li>The basics for getting a mortgage</li> <li>Ready to start investing? Here's a simple, sustainable newbie investment plan</li></ul> <p>We keep it fresh, with different styles and video themes. Free downloads include a 55-page e-book, a discount code  for our other course, even a motivational video you can view, download, even post on your own website if you wish.</p><p>You'll complete the course with simple, powerful strategies to turbo-charge your financial life to the next level – with confidence! Press the “Take this Course\" button on the right to get started.</p>", 
    "end_date": null, 
    "title": "Design Your Dream: ", 
    "price": "20.00", 
    "instructors": "Christine Williams", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444462_00d9_3.jpg", 
    "course_url": "https://www.udemy.com/design-your-dream/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T05:20:54Z"
}