{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Did you know that 60% of working Americans have less than $25,000 saved for retirement and other short-term goals? Do you want to spend your golden years living life to its fullest, while only working when you want to? Do you want to spend your retirement indulging in whatever makes you happy? Do you want to be truly free?</p>    <p>Retirement is supposed to be a time of freedom! Imagine a lifestyle of enjoyment, leisure, and fulfillment. Imagine a lifestyle free from the typical 9 to 5 grind. Freedom does have its price, but fortunately through some planning it is attainable! The sooner you begin investing for retirement, the better off you will be! Investing for retirement can be scary, especially if you have never done it and do not know what to do. </p>    <p>Trust me, I understand! No one is born knowing how to invest; it is a skill that is learned. At the end of the day, investing for retirement is really not that complicated. I can show you how you can invest for your retirement comfortably and successfully!</p>    <p>In this online presentation, we will cover a proven plan for retirement investing success. I introduce, and explain, the EASE principle which is something that I have created and practiced. And the great thing is that it works! </p>    <p>This program covers many topics including investing, qualified plans, the EASE principle, retirement goal-setting, and some rules for success! If you follow the simple principles explained in this presentation, you will achieve success as a retirement investor!</p>    <p>At the age of 28, I am on track to have a retirement nest-egg in excess of $10 million! I am not one of those crazy wealthy people, and I do not have a super high income either. You can produce a large retirement nest-egg, and I can help you get there!</p>    <p>Sign up today and take control of your retirement! This program comes with a 30 day money back guarantee. Also, once you purchase the program, you will have lifetime access! </p>    <p>Sign up today and take a step toward financial wellness!</p>", 
    "end_date": null, 
    "title": "E.A.S.E. into Retirement Investing", 
    "price": "50.00", 
    "instructors": "Devin Czech", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419354_32c2.jpg", 
    "course_url": "https://www.udemy.com/ease-into-retirement-investing/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T15:42:32Z"
}