{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you ever wanted to learn about investing in companies? How to <strong>trade stocks and shares?</strong></p>\n\n\n\n<p>Do you like the idea of building a <strong>lucrative investment portfolio</strong>, but are scared of all the horror stories you hear? You know the ones – how people have literally lost there houses on a bad investment?</p>\n\n\n\n<p>Would you like to <strong>take control of your wealth</strong> but don’t have the time to sit and watch stock market prices all day long?</p>\n\n\n\n<p>Like you, I have a full time job, and like you I always wanted to get involved in the stock market – but I simply didn’t know where to start!</p>\n\n\n\n<p>Early on in my investing I made lots of mistakes.  I made a bit of money, then lost some on a bad bet.</p>\n\n\n\n<p>But through research, a bit of trial and error, and ultimately a modicum of common sense – <strong>I learnt what most other investors don’t want you to know</strong> – that investing in the stock market is actually easy, relatively straight forward, doesn’t require you to give up your job – and with a few simple rules - can be safer than you think!</p>\n\n\n\n<p>As my experience grew I transferred £10k into my own managed portfolio.  In no time at all my investments had grown to £30k! All without having to put any more money in.</p>\n\n\n\n<p>Let’s be clear on this – I’m not a financial wiz.  I just learnt a handful of basic principles – and then did it all whilst holding down a full time job and busy family life!</p>\n\n\n\n<p>Now I want to show you just how easy it can be – and help you succeed too!</p>\n\n\n\n<p>In my course I’ll teach you;</p>\n\n\n\n<ul><li>The basics of investing – what exactly ARE stocks, shares, ISAs, SIPPs bonds and gilts?</li><li>Where to find stocks that are growing and have real potential;</li><li>All the FREE tools you need.</li><li>How to perform SIMPLE analysis of a company – get to the core of what you need to know.</li><li>How to separate the good investments from the bad</li><li>How to reduce risk as much as possible to stop you from losing it all on one bad deal.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I’ll assume you don’t know the first thing of investing, that you don’t have time to spend all day scouring the financial times or glued to stock price tickers.</p>\n\n\n\n<p>By the end you’ll know your PE Ratios from your Market Caps – and you’ll have the confidence to invest without putting you house at risk!</p>\n\n\n\n<p>So join my course – <strong>EASY STOCK MARKET SUCCESS IN SIMPLE STEPS </strong>– and take control of YOUR finances.</p>", 
    "end_date": null, 
    "title": "Easy Stock Market Success In Simple Steps", 
    "price": "20.00", 
    "instructors": "Brett Hargreaves", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765802_f55a_2.jpg", 
    "course_url": "https://www.udemy.com/easy-stock-market-success-in-simple-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T20:50:37Z"
}