{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Excelente curso introductorio acerca de la Educación Financiera, las Finanzas Personales y el desarrollo de la Mente Millonaria. Este es un tema que muy poca gente conoce aún en nuestros días. </p><p>El curso abarca algunos temas cruciales en el desarrollo personal y financiero.</p><p>También se incluyen fundamentos acerca de los tres mayores activos con los que cuenta el ser humano: tu tiempo, su mente y tu dinero.</p><p>Incluimos presentaciones concretas abordando temas como: Formas de incrementar tu ahorro y como puedes ganar más dinero. Además de los tres principios de como ser millonario.</p><p>Se incluyen también varias presentaciones en cartoons que harán muy ameno y divertido tu aprendizaje.</p><p>El curso se estructura de la siguiente forma:</p><p>- Educación Financiera para Todos (Excelentes presentaciones cuidadas para adultos y niños.)</p><p>- Inteligencia Financiera. (Cartoons y presentaciones de gran calidad con información invaluable).</p><p>- El mayor principio de desarrollo personal y financiero: SER , HACER y TENER.</p><p>Los conceptos y presentaciones se han resumido a tal grado que el curso es muy rápido de llevar, fluido y sin rodeos. Apúntate hoy mismo y disfruta de los beneficios que muchas personas exitosas ya conocen. Mejorarás tu concepto en cuanto a tus activos personales, tu educación financiera y tu desarrollo personal.</p>", 
    "end_date": null, 
    "title": "Educación Financiera y Finanzas Personales- Mente Millonaria", 
    "price": 0, 
    "instructors": "Fabián Razo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690002_860a_2.jpg", 
    "course_url": "https://www.udemy.com/educacion-financiera/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T01:22:53Z"
}