{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you're reading this then I suspect you get it. Money and kids, that's what ends serious relationships, but why? At first you might say, “Everything is great, I have my money, you have your money and we can spend it as we see fit.” Your relationship is all fun and games! That is until it starts getting serious enough to consider money in the 'our money' context. You wonder, why is my partner being so irrational?</p><p>Then it starts, the quibbling and nagging  \"We can't afford a vacation!\", \"We'll we could if you quit buying a new phone every 3 months! Oh really, maybe cutting back to 10 pairs of shoes would help too\" and so on. We all know this and tread lightly when talking about money but all relationships have a spender and a saver in different categories of products, without a process to navigate this minefield a bomb is going to detonate. </p><p>We speak from experience, very different upbringings and views about money almost ended our marriage before it started.</p><p>Luckily, we decided to get creative and combine our legal and engineering training to create a logical system that is extremely flexible between couples (our friends use it too) and just makes sense! Since we began using our process we have, literally, never fought about money. It's amazing, and we want to share it with you!</p><p>This course will provide you with a detailed budget template and walk you through the entire process of filling it out and maintaining it. We won't waste your time and preach for you to \"Pay off credit card debt\" or \"Take your employer 401k match.\" That information is abundant on the internet (and you should read about it), however, every person needs to find their own way to \"the right numbers,\" the trick is the process.</p><p>We will get straight down to business on setting up the budget process you and your partner can use to eliminate the money fight from your life. We know you are busy so will try to keep it clear and concise but in a presentation full of entertaining stories and examples. </p><p>Ready to never fight about money again? Check it out and if it isn't what we claim we'll happily give you your money back...it will work though ;)</p>", 
    "end_date": null, 
    "title": "End the Financial Fight: A New Approach to Joint Budgeting", 
    "price": 0, 
    "instructors": "Scott Kane", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/547288_df22_2.jpg", 
    "course_url": "https://www.udemy.com/end-the-money-fight-a-new-approach-to-joint-budgeting/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T22:55:13Z"
}