{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This is a step-by-step video walk-through of how to set up and use the Cash Dash to create your own 100% private, personalized budget and yearly financial forecasting utility. It is taught in the 100% free, open-source Open Office Calc software for PC, but can be learned using any current spreadsheet tool including Google Documents.</p><p style=\"\">This course covers basic accounting and spreadsheet use. It is supplemented by several written articles and some slide-shows, but is mainly a video walk-through lecture for you to follow along with. It will take between 2-3 hours to complete the 3 main sections.</p><p style=\"\">The basic Cash Dash spreadsheet template is included for download and should be used by the student concurrently with the course and will become part of the student&#039;s daily life as the financial tracking tool of choice for as long as they choose to use it.</p><p style=\"\">If you have ever wanted to learn a financial budgeting tool, but were put off by confusing instructions, tedious data-entry or submitting your information to third parties, this is the course for you. I have designed it to be as simple as possible and as accessible as possible while granting the student the power to see their financial future without the headaches, confusion and hoop-jumping the other systems require.</p><p style=\"\">By the end of this course, you will see your money and your spending in a completely different light. You will be in control because the power to make great decisions will forever be at your fingertips. Never wonder if you can afford &quot;it&quot; again: plan, analyze, budget, spend and save. See the effects in real-time as the Cash Dash updates to any event you create.</p><p style=\"\">This tool is the financial advisor everyone in the world should have on their side.</p>", 
    "end_date": null, 
    "title": "Excel Personal Finance Dashboard - The Cash Dash", 
    "price": "20.00", 
    "instructors": "Cimarron Benjamin", 
    "commitment": "29 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/561072_a01f_3.jpg", 
    "course_url": "https://www.udemy.com/the-cash-dash-budget-organize-and-forecast-your-finances/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-22T00:23:12Z"
}