{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Are you sick &amp; tired of sabotaging yourself financially?</strong>  </p>\n\n<p>  \t<strong>W</strong><strong>ant to learn how to think like a millionaire and create more financial success?</strong>  </p>\n\n<p>  \t                                        Most experts agree, financial success is an attitude and all about how you think and what you believe to be true about your potential.  </p>\n\n<p>  \t            If you've been focused on the negative aspects of your career for a prolonged period, like being in debt or noticing the lack of money in your life, you will have changed your core beliefs about money negatively and these limiting beliefs will be sabotaging your financial success.  </p>\n\n<p>  \t            As you get excited about ideas and try and make money, stress, fear, worry, self doubt and procrastination seem to repeat and this strips self confidence and ultimately, your ability to earn a good living.  </p>\n\n<p>  \t<strong>    The great news is that limiting career beliefs can be easily changed once you become aware of them and I will personally walk you through step by step and support you along the way. I have already supported over 6 million viewers on my successful YouTube channel and am well known for providing great student support.</strong>  </p>\n\n<p>  \t        During this course you will learn EFT Tapping (emotional freedom technique) and how to easily apply it to change your limiting beliefs using a simple to learn technique using acupuncture points.  </p>\n\n<p>  \t        With over 6 hours of exclusive video and audio content you'll learn step by step simple EFT Tapping techniques that:  </p>\n\n<ul>  \t<li>Release 99 common money blocks most people suffer</li>  \t<li>Master 55 abundance beliefs that increase income potential</li>  </ul>\n\n<p>  \t                              This means that you can quickly change your limiting beliefs about money and create a new confident attitude that lays the foundation for permanent financial success.  </p>\n\n<p>  \t      This course also helps you release old stress, overwhelm and worry associated with debt and money. Clear out all the emotional baggage, get confident and starting making more money than you've ever dreamed of. Go beyond limitations and dare to dream.  </p>\n\n<p>  \t<strong>Interaction &amp; Support:</strong> This course comes with a full student support package including a money back guarantee and my personal assistance along the way. I will be updating this course and adding new content that adds value to the student experience.  </p>\n\n<p>  \t<strong>                      If you are ready to break free from debt and hardship, enrol now and let's start changing your beliefs about money so you can realise your potential and possibilities. Invest in yourself today you'll be glad you did!  </strong>  </p>", 
    "end_date": null, 
    "title": "Finance Mastery: Mind Techniques for Increasing Abundance", 
    "price": "20.00", 
    "instructors": "David Childerley", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315030_17b5_8.jpg", 
    "course_url": "https://www.udemy.com/finance-mastery-mind-techniques-for-increasing-abundance/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T12:54:53Z"
}