{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The world of money and finance can be confusing and dangerous, and \nmost educational curriculum ignore the concepts altogether. This leaves \nmany successful professionals searching for sound financial advice.</p>\n\n<p>Although there are a plethora of \"Personal Finance for Dummies\" books and courses out there, <em>Finance for Freedom </em>is\n the only program that is rooted in a thorough understanding of money \nand monetary history. Money is half of every transaction thus half of \nthe entire economy therefore it is only possible to construct a \nsustainable asset portfolio with a fundamental understanding of money.</p>\n\n<p>If you doubt this, simply ask yourself a question: <em>what is money?</em></p>\n\n<p>Is\n it a green piece of paper with numbers and symbols on it? Is it a \nplastic card with a bank logo and an account number? Or is it something \nelse entirely?</p>\n\n<p>As it turns out, money is far from a static \nfunctionary, and it has a very interesting story to tell. Those who \nunderstand this story take a unique approach to structuring their \nfinances while those who do not understand money tend to follow the \nherd. If you want to be financially independent then you absolutely must\n understand money – what it is, where it has been, and where it is \ngoing.</p>\n\n<p><em>Finance for Freedom: Master Your Finances in 30 Days</em>\n will not only convey the necessary fundamentals, but it will also \npresent specific actionable strategies that you can begin to implement \nimmediately to grow your wealth.</p>\n\n<p>In fact, the strategies presented in <em>Finance for Freedom</em>\n are the very strategies the author used to master his finances, build a\n sustainable asset portfolio, and quit his job within five years time. \nWhether you are a young professional just getting started or a seasoned \nveteran approaching retirement, these same strategies will work for you.</p>\n\n<p>Are you ready to turbo-charge your retirement portfolio? Do you yearn to exit the rat-race? Is financial freedom calling to your spirit?</p><p>This course will convey everything you need to know in order to achieve a level of financial security that can never be taken away from you. This course will show you how to structure your finances and scale your income such that you will never need to worry about market crashes, lay-offs, globalization, outsourcing, or uncertain political environments. More importantly, this course will show you how to reach <br>financial escape velocity so that you can live the life of your dreams!</p>\n\n<p>Here is what the course delivers:<br></p>\n\n<ul><li>How to\n\tbecome money-conscious</li><li>How to\n\tanalyze your financial statements</li><li>How to\n\tintuitively understand how each decision you make affects your\n\tfinancial statements</li><li>How to\n\tanalyze spending, slash debt, and implement a tool to model and\n\tmonitor a flexible monthly budget</li><li>How to\n\tultimately master your finances in 30 days time</li><li>How to\n\tanalyze macroeconomic trends and leverage this understanding into\n\tactionable financial strategies</li><li>How to\n\tconstruct and implement an asset allocation model</li><li>How to\n\tassess and acquire the prominent asset classes for your model: cash,\n\tprecious metals, real estate, stocks, bonds, and bitcoins</li><li>How to\n\timplement the <em>Beta Investment Strategy</em></li><li>How to\n\tintegrate alternative investments into your portfolio to truly\n\tcreate <em>antifragility</em></li><li>How to build\n\tand scale diverse income streams in order to achieve <strong>financial\n\tescape velocity</strong></li></ul>\n\n<p><strong><br></strong><em>Sound too good\nto be true?</em> <strong>It’s not. </strong>This is not your standard\n“personal finance for dummies” advice, nor is it abstract theory.\nThis course delivers both the core principles and the actionable\nstrategies used by the instructor to build a sustainable financial\nportfolio that enabled him to quit his job and escape the rat-race\nwithin five years time. \n</p>\n\n<p>To add additional\nvalue to this course, the instructor is completely willing to answer\nany and all questions you may have as you go through the material.</p>\n\n<p>Now to be clear,\nthere is no magic formula for eliminating debt, building wealth, and\nreaching financial escape velocity. As such, this course is NOT for\npeople who are looking for get-rich-quick-schemes. But for\nself-disciplined people who are willing to think outside of the box\nand focus long-term, this course offers a comprehensive approach to\nmoney, finance, and economics that will enable you to cut debt,\nstrategically build an asset portfolio, and even develop scalable\nincome streams in order to build the life you desire!</p>\n\n<p>Do not take a\nbackseat when it comes to your own finances. Learn everything you\nneed to know to master your finances in 30 days by enrolling in\n<em>Finance for Freedom</em> today!</p>", 
    "end_date": null, 
    "title": "Finance for Freedom: Master Your Finances in 30 days", 
    "price": "25.00", 
    "instructors": "Joe Withrow", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631584_6a3b_4.jpg", 
    "course_url": "https://www.udemy.com/finance-for-freedom/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T18:34:06Z"
}