{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Profitability strategies is for individuals and business owners who want to master their money and finances in a quick and easy way. This course is easy to understand, its suitable for those with absolutely no knowledge of money management or finances. Your course tutor breaks down exactly what you need to do, and the printed handout helps you to apply the material to your own personal situation and finances.</p><p>The course is about managing your money - how to actually 'master' money. We spend years at school - we may have done classes in English, Science, Maths - but rarely, if ever, has anyone actually taught us how to be working with our money and how we can improve the financial situation in which we find ourselves.</p><p>All situations can be salvaged. So, even if you feel that your finances are in a bit of a mess, or if you are on top of things, but want to improve your money game - then this course is for you. There isn't any particular terminology that you need to know - but we do cover the meaning of income, expenses, assets and liabilities. </p><p>The course will take approx 1 hour to complete. It is structured in a way whereby you download the material (a 5 page booklet). Print this off. Then watch the lecture and then fill in the booklet with the lecturer as the lecturer is talking and ideas are coming to you.</p><p> This course is ideal for those who want to understand how money works, to understand how to make more money, and it's for those who just want to understand “money” - to really master it and to improve their financial situation. So, this course is ideal if you want your financial situation to improve and you are serious about taking steps towards having a better financial future.</p>", 
    "end_date": null, 
    "title": "Financial Mastery in 5 Accessible Steps", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535914_0eff.jpg", 
    "course_url": "https://www.udemy.com/improve-finances-through-management/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T08:29:05Z"
}