{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Student Review on Financial Bootcamp for Engaged Couples:</strong><br></p><p><strong>A course that can save your relationship!</strong></p><p><em><strong>\"When we enter into a relationship, we cannot believe that\n something like finances may affect or even destroy our engagement or \neven marriage. And it can. It happened to me once and, if I would’ve \nwatched this course before that, I might have saved it.\n\nTaffy doesn’t try to sweeten reality or sell beautifully wrapped \nlectures with no value. She understands how financial problems and \nmisunderstandings can affect a couple and gives practical, smart advice\n and tips about how to avoid them. I understood so many things about my \nfinancial habits and how they affect my partner, I feel like a veil \nwas lifted from my eyes. I finally understand what went wrong with my \nfirst marriage and how easily I could have saved it.\n\nAfter watching the course, I talked to my boyfriend about our financial \nhabits and we decided to keep separate accounts,  not to\n take credits (at least not me…) and we found a better way to manage out\n money. We felt a lot better after clarifying all these aspects\". Alexandra Moore</strong></em></p><p>*******************************************************************************************</p><p>Do you spend or do you save money?</p><p>Do you pay all of your bills on time?</p><p>Do you talk with your future spouse about money beyond the cost of the caterer, florist, venue or even the wedding itself?</p><p>Do you believe you are ready to manage money for two people?</p><p>I've been happily married for 19+ years and have dealt with it all from coming into the marriage with financial baggage (from being homeless, having debt, spouse having filed bankruptcy in a previous marriage and me having to deal with the creditors calling), to having less than stellar credit, starting over establishing credit, buying a house, becoming parents, being audited by the IRS and more. I know what I am talking about when it comes to money and marriage.</p><p>I have counseled many couples when it comes to premarital financial counseling and they are succeeding. I want that for you to. <br></p><p>Here is your opportunity to set your upcoming marriage apart from those that ended up as a divorce statistic because of money. </p><p>This course shows you:</p><ul><li>How the power of your words (whether spoken or written) can impact a job, education, children or even finances. </li><li>How you need to discover what your communication style is as well as the style of your future spouse. This will help you to communicate more effectively. </li><li>Who you are when it comes to money. Everything from how you pay your bills, what your income is to whether you are solution oriented or not if a financial emergency happens. </li><li>The significance of ordering your credit report at least once a year. Whether you will be brave enough to share your credit report during your engagement. </li><li>How money management is crucial to the success of any relationship.</li><li>How to set financial goals as a couple and much, much more. </li></ul><p>No longer will you have to fear the elephant in the room \"money conversation\" because of your own personal habits that you bring to the table. One of the top reasons for divorce is because of money. That doesn't have to be the case for your marriage.<br></p><p>This bootcamp course empowers you to talk about money, develop goals short and long term, plan ahead for future financial needs as well as prepare for a lifetime of money management knowing your marriage can succeed. Before you know it friends and family members will come to you for advice about money and marriage.<br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>    <p><br></p>", 
    "end_date": null, 
    "title": "Financial Bootcamp for Engaged Couples - Personal Finances", 
    "price": "20.00", 
    "instructors": "Taffy Wagner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635436_c153_4.jpg", 
    "course_url": "https://www.udemy.com/financial-bootcamp-engaged-couples/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T01:44:04Z"
}