{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Come with me on a journey where you will create a new future for your money and achieve your financial dreams quickly. </em></strong></p><p><strong><em>****Over 1,900+ Students are already enrolled ****</em></strong></p><p><strong><em></em></strong><strong><em>COURSE UPDATED IN DECEMBER 2015</em></strong></p><p><strong><em></em></strong>You're about to discover the best methods for managing your hard-earned money. These money management principles have stood the test of time. The best part is, it's incredibly<strong><em> SIMPLE</em></strong>. When the one thing getting thin is your bank balance, <strong><em>it's time to get HELP.</em></strong></p><p>•Have you ever stayed awake at 3 am... worrying about money?</p><p>•Are you a slave to your debt?</p><p>•Do you work hard but always have a hard time making ends meet?</p><p>•Have you lost control of your expenses? </p><p>•Are your credit cards maxed out? </p><p>•Have you ever asked, \"where did my money go\"?</p><p>•Are you in fear of losing your house?</p><p>•Are you living with the shame &amp; stigma that comes with being homeless?</p><p>•Have you considered filing for bankruptcy?</p><p>•How about the fear of never having enough money to retire?</p><p>If you answered, <strong><em>\"YES\" </em></strong>to any of these questions, chances are you are worried about your finances. Chances are, you worry all the time, about how you will pay your bills. Chances are, you worry that you're going to work for the rest of your life. You worry about retirement, you worry about your children's college education and <strong><em>you're scared for yourself and your family. </em></strong></p><p><strong><em><strong><em>The question is what can you do?</em></strong></em></strong></p><p>Perhaps you've tried paying of your debt but started accumulating it again. You tried to be frugal but you were so miserable. If you've ever felt <strong><em>DESPERATE</em></strong> for money, let me tell you: </p><p>You <strong><em>CAN</em></strong> take control of your finances again. You have the power to change your financial future. You are filled with strength to make your financial goals a reality. You deserve the peace of mind and confidence that comes with having your financial life in order. You can earn more, payoff your debts, and increase our savings and investments. It can be done. </p><p>What you need is to commit to making small changes in the way you make, spend, save and invest your money. Before you know it, you will achieve BIG changes and BIG results. You see, when you make big changes drastically, your mind and heart will reject the drastic changes and you simply won't stick to them. </p><p>A doable, step-by-step guide will help you make small, yet consistent, positive changes with your money. </p><p><strong><em>In this class you will learn</em></strong></p><p>•How to change your Financial Mindset </p><p>•How to Getting Out of Debt and Staying out of Debt</p><p>•How to create a budget and stay on a budget</p><p>•How to choose a bank that fits your needs</p><p>•Ways of boosting your income using the internet</p><p>•Ways of growing your skills</p><p>•How to better manage risk</p><p>•How to plan for the long-term</p><p>•Basic ways of investing your hard earned money</p><p>•How to protect your identity </p><p>This personal finance course comes as a complete e-course with lessons<strong>, cheat sheets and worksheets</strong>. This means you'll absorb the lessons and implement my easy strategies no matter your learning style. You'll also get money and mindset worksheets that will help you understand and implement new behaviors. </p><p>Don't let another day go by. Subscribe to the course and start putting your financial life in order. </p><p>Money is one of the leading causes of divorce in our society. In addition, money is one of the top causes of stress. But you deserve to be free from fear! So if you want to learn how to keep more of what you make, </p><p>Join the Personal Finance Course today…..</p><p><strong><em>•Over 1.4 million people in the United States filed for bankruptcy in 2009</em></strong></p><p><strong><em>•43% of American families spend more that what they earn</em></strong></p><p><strong><em>•The average household has $8,000 in credit card debt</em></strong></p><p>Don't be another Statistic. You <strong><em>deserve </em></strong>to win, and enjoy the experience of <strong><em>financial peace</em></strong> and <strong><em>financial freedom.</em></strong></p><p><strong><em> </em></strong><strong>Click the \"take this course\" button, top right, now ... <em>every hour you delay is costing you money</em><em> </em>...</strong></p><p>Thank you, Keroy King </p>", 
    "end_date": null, 
    "title": "Financial Truths: Learn How to Budget & Get Out of Debt", 
    "price": "20.00", 
    "instructors": "Keroy King", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21439_f2ed_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-budget-get-out-of-debt/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-19T00:49:47Z"
}