{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul style=\"\"><li>Eres de las personas que se “<strong style=\"\">descuadra</strong>&quot; en sus gastos?</li><li>Te gustaría poder <strong style=\"\">vivir mejor</strong>?</li><li>Has pensado en <strong style=\"\">generar nuevos ingresos</strong>?</li><li>Te gustaría <strong style=\"\">reducir tus deudas</strong>?</li><li><strong style=\"\">Has soñado</strong> con un viaje y <strong style=\"\">no lo has podido realizar</strong>?</li></ul><p>Si has respondido “<strong style=\"\">SI</strong>&quot; a alguna de las anteriores preguntas, este curso te ayudará a conseguir lo que quieres y mucho más… te permitirá alcanzar <strong style=\"\">libertad financiera</strong>.</p><p>Este vídeo curso está planeado para aportarte y aumenta tu <strong style=\"\">inteligencia financiera</strong>, por medio de <strong style=\"\">más de 7 horas de vídeos</strong>, archivos PDF con información y <strong style=\"\">simuladores en Excel</strong> que te permitirán hacer una plantación adecuada de tus finanzas personales.</p><p>Se una de esas personas con elevada educación financiera y que logran alcanzar mucho más fácilmente objetivos tanto en la parte financiera como en la parte personal.</p><p>Desarrollamos el curso para que aprendas desde los <strong style=\"\">errores o mitos sobre el dinero, ingresos, deudas, presupuesto, apalancamiento, </strong> hasta llegar a la <strong style=\"\">generación de ingresos</strong>, todos los capítulos los puedes tomar de forma independiente, de tal manera que se puedan asimilar los conceptos fácilmente, además de usar un lenguaje sencillo y sin términos complicados, para que el tengas el máximo nivel de asimilación y comprensión.</p><p><strong style=\"\">QUIERES REDUCIR TUS DEUDAS?</strong> El curso cierra con un compendio de todo lo aprendido, haciendo un <strong style=\"\">plan de reducción de deudas</strong>, mostrando como con los conceptos, información y herramientas aprendidos en el curso se puede alcanzar un equilibrio entre los ingresos y los gastos, incluso alcanzar la <strong style=\"\">libertad financiera</strong>.</p><p><strong style=\"\">Si estas interesado(a) en adquirir valiosos conceptos, información de muy alta calidad e importancia</strong>, buscando <strong style=\"\">ideas para generar ingresos adicionales, ingresos pasivos y reducir tus deudas</strong> para mejorar tu estado financiero y elevar los ingresos sin importar tu profesión u oficio, este curso es el curso que estás buscando.</p> <strong style=\"\">QUE ESPERAS PARA GENERAR RIQUEZA? Comienza ya!</strong>", 
    "end_date": null, 
    "title": "Finanzas Personales - Tu camino al éxito y la riqueza", 
    "price": "40.00", 
    "instructors": "DMW Academy", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310816_d18f_4.jpg", 
    "course_url": "https://www.udemy.com/finanzas-personales-clave-del-exito-y-de-la-riqueza/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T15:03:49Z"
}