{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tThis course is ideal for those who want to improve their personal financial situation. It doesn&#039;t matter if you are a young student who is just starting out, or older with responsibilities and a full time 9 to 5... money still matters. If you&#039;ve ever struggled (or still struggle) to make the ends meet or have an empty savings account or just don&#039;t feel in control of your money - then this course is for you.  </p>  <p>  \tAre you working hard yet have little to show for it? Do you ever get to the end of the month, only to discover that there is more month left than money? Does your bank balance seem to hang around the same amount (close to nil or overdrawn) no matter what you try?  </p>  <p>  \tThis course will help you to understand how money works. How to improve your credit score, how to manage credit cards, mortgages, how to set a budget and how to improve your situation. It’s not just theoretical. It is practical.  </p>  <p>  \tWe cover your mindset and your money personality and there are practical tasks for you to complete.  </p>  <p>  \tThis course breaks down the concepts in an easy-to-understand and jargon-free language.  </p>  <p>  \tYou get an example budget, templates, and an e-book as part of the course. The course will take approx 2 hours to complete. There are videos to watch, tasks to complete and plenty of resources and further reading material.  </p>  <p>  \tIf you want to take control of your financial future and not have to worry again about not having enough money to pay the bills - then this course is for you. It doesn’t matter where you live in the world... the principles of how money works, and how to manage money... are the same. The sooner you make the decision to take control of your financial destiny – the sooner things will start to change and improve for the better. Unfortunately many people leave school without these money management skills and they suffer for it. Its never too late to learn or to correct a bad situation.  </p>", 
    "end_date": null, 
    "title": "Finance Matters: From Your Credit Score to Your Budget", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302476_5657_5.jpg", 
    "course_url": "https://www.udemy.com/moneymatters/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:18:50Z"
}