{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Interested in learning how to manage your money an easier way? Or are you secretly worried that you will never be financially free? You are in the right place! <strong class=\"redactor-inline-converted\">Course updated March 28, 2016.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Financial Management Hacks: Budgeting, Investing and Planning is for you if: </strong></p>\n\n\n\n<ul><li>You are someone who sees the potential of becoming a confident money manager but needs to know how to get started.</li><li>You want simple strategies and advice that are easy to implement given your busy schedule.</li><li>You would like a creative fun way to deal with personal finances instead of the boring straight-laced masculine approach.</li><li>You would like to finally feel empowered when you are sitting across the table with financial professionals who usually make you feel like you don’t know anything about money.</li><li>You are ready to live rich now and live rich in retirement but you just need the motivation that connects with your internal drive to make it happen.</li></ul>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why take</strong> <strong class=\"redactor-inline-converted\">Financial </strong><strong class=\"redactor-inline-converted\">Management Hacks: Budgeting, Investing and Planning?</strong></p>\n\n\n\n<p>This is why you are here because you want to manage your finances and not have your finances manage you.  </p>\n\n\n\n<p>You finally want to learn from a financial professional that wants you to be in charge of your finances plus gives you simple plan that is easy to follow.</p>\n\n\n\n<p>Now keep this in mind. Every piece of advice, strategy and logical approach to managing money the easy way has been tested; none of this is theory.<br></p>\n\n\n\n<p>In fact, this comprehensive course is step-by-step and gives you the guidance to quickly turn around your financial situation so you stop wasting time and money doing the wrong things.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What is covered in Financial </strong><strong class=\"redactor-inline-converted\">Management Hacks: Budgeting, Investing and Planning?</strong></p>\n\n\n\n<ol><li>Learn power-positioning questions you must begin with that sets you up for financial success.</li><li>Discover Easy Steps to creating a budget that works for you not against you.</li><li>Uncover the Power of PRACTICAL Creativity: How to save money without sacrificing your personal flare.</li><li>Understand finally THE WORST number in Money Management and how to protect yourself from it.</li><li>Get to the bottom of how your in-laws secretly sabotage your financial freedom and the steps you need to turn that around</li><li>Learn simple financial planning hacks that put you back in control</li><li>Budgeting hacks part 1 – spending plans that are super easy and keep you out of debt</li><li>Budgeting hacks part 2 – savings short-cuts that add up when you are not even thinking about it</li><li>Investing your money the super simplified way that even Warren Buffet wishes he followed</li></ol>\n\n\n\n<p>***************************************************************************************************************</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">How will Financial </strong><strong class=\"redactor-inline-converted\">Management Hacks: Budgeting, Investing and Planning benefit you?</strong></p>\n\n\n\n<p>Money management hacks makes personal finance as easy as learning your ABC’s.  </p>\n\n\n\n<p>You get <strong class=\"redactor-inline-converted\">26 simple strategies to manage money and finally take control of your financial life so you can live rich now and retire rich later.</strong>  </p>\n\n\n\n<p>You get the holistic approach to personal finance that Womanly Wealth Academy is famous for.</p>\n\n\n\n<p>In this course you discover simple strategies I have used in my financial workshops.  </p>\n\n\n\n<p>You get the <strong class=\"redactor-inline-converted\">money management blueprint, the 10 Day Plan </strong>and the know-how to become the master of your own financial destiny.</p>\n\n\n\n<p>If that’s something you would like to achieve, you have selected the right course to take.  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">When can you take</strong> <strong class=\"redactor-inline-converted\">Financial</strong> <strong class=\"redactor-inline-converted\">Management Hacks: Budgeting, Investing and Planning?</strong></p>\n\n\n\n<p>What are you waiting for? If you’re looking for a course to learn what it takes to become an empowered money manager the simple easy way, then look no further.</p>\n\n\n\n<p>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</p>\n\n\n\n<p>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; NO EXTRA COST TO YOU.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">REMEMBER:</strong> If you are not completely satisfied, you can get a full money back refund, so long as you request it within 30 days of purchase – No questions asked.</p>\n\n\n\n<p>Click on the <strong class=\"redactor-inline-converted\">\"Take This Course\"</strong> button and start learning instantly</p>\n\n\n\n<p>Still not convinced? Make sure you watch some of the FREE PREVIEWS available to learn more about the course and more about me your instructor. Plus you can check out some of the reviews. Here is just one of the many examples:</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What people are saying about</strong> <strong>Financial</strong> <strong class=\"redactor-inline-converted\">Management Hacks: Budgeting, Investing and Planning created by Louise Anne Maurice of Womanly Wealth Academy:</strong></p>\n\n\n\n<p><em>\"A Woman’s Touch on Money Management <strong class=\"redactor-inline-converted\">- </strong></em><em>This course was great! The instructor is a trained financial professional who understands money matters and gives insider tips plus resources which were so valuable. But she also has a different approach which I really connected with. I never thought of managing money this way and it doesn’t scare me anymore. I can’t wait to use some of the simple hacks for spending and saving money. I have stayed away from investing because I never understood it but now I can use her feminine approach with confidence to get started. I liked this because she is not a current financial adviser but an educator who wants me to be successful with money for me.\"</em></p>\n\n\n\n<p><em>****************************************************************************************************************</em></p>", 
    "end_date": null, 
    "title": "Financial Management Hacks: Budgeting, Investing & Planning", 
    "price": "20.00", 
    "instructors": "Womanly Wealth Academy, Louise Anne Maurice", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409296_3b7f_9.jpg", 
    "course_url": "https://www.udemy.com/4-simple-steps-to-manage-your-money-live-retire-rich/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T19:40:06Z"
}