{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is the only course that speaks the truth about how to get the most out of life as you possibly can, and how the new tools available in society make it easier than ever to make it happen.</p><p>If you are not completely satisfied with what you are doing in life, let me show you:</p><p> 1) How To Discover What Is The Best Work For You To Be Doing To Live A Satisfied Life</p><p> 2) Why Most People Are Not Doing What They Really Should Be Doing In Life</p><p> 3) How To Use the Internet, CrowdFUNding, and the Shared Economy To Finance What Will Give You A Complete Life</p><p>You will never hear anything like this from anyone else.  This is not a slick powerpoint presentation.  THIS IS FROM THE HEART.</p><p>After 40 years of having more success in life than I ever dreamed, I now want to speak from my heart and try to help as many other people before I die.</p><p>I have been travelling the country speaking on this subject and getting standing ovations. I even received  an incredible response in Shanghai, China.  And recently I did a TEDx Talk  and am more convinced this life philosophy is needed. </p><p>I am a serial entrepreneur who just completed 1,000 exclusive interviews of people who have used Internet funding to do what they always dreamed of doing in life. I speak the truth so you'll learn truisms like:</p><p>1) The Best Way To Win In Life Is By Having Fun</p><p>2) Experts Pretend to Know the Answers so They Can Charge You A Lot of Money...but They Really Don't Know</p><p>3) If You're Not Failing You're Not Doing Anything</p><p>4) The Internet Is Giving Out More Free Money Than The Government</p><p>5) Now It's the Easiest Time In The History of the World To Make Money When You Have No Cash, Expertise or Contacts</p><p>6) Retirement Is Dumb</p><p>7) Your Friends and Loved Ones Can Be Your Worst Enemies</p><p>8) How To Stay Lovable and Love More</p><p>8) How To Give More To The World Than You Ever Imagined! </p><p>9) How To Deal with Things When They're Bad </p><p>10) The Biggest Opportunities for You to Grow Your Income are on the Internet</p><p>11) The New Economy Means Creating Your Own Job Is Now Safer than Getting A Job</p><p>12) Why Banks, Employment, Agencies, Hotels, Car Rentals, Traditional Jobs, Fat Cats, and More Are Being Replaced In The New Economy</p><p>13) Your Own Mind Is The Only Thing Stopping You From A Great Life</p> <ul style=\"\"><li></li></ul>", 
    "end_date": null, 
    "title": "Get The Best Job Of Your Life Using Crowdfunding", 
    "price": "20.00", 
    "instructors": "Matthew Lesko", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544192_91d5_4.jpg", 
    "course_url": "https://www.udemy.com/your-success-depends-on-fun-free-failure-plus-crowdfunding/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T16:39:18Z"
}