{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                    Picture this. Your daughter worked hard throughout high school. She earned good grades while taking a full schedule of challenging courses. She spent many hours preparing for college entrance exams, visited numerous college campuses and participated in extracurricular activities. Finally, after applying to a few colleges, she was accepted to her dream school. After four years, she graduated and went on to graduate law school. One year later, she is now applying for a job at Starbucks and has student loan debt totaling well over $100,000.  </p>  <p>  \t                    Do you think, “This can&#039;t possibly happen to my child!”  </p>  <p>  \t                    Think again!  </p>  <p>  \t                    Every year, students and their parents spend countless hours going through the stressful college admissions process called in the hope of getting into a good college. The truth is, in today&#039;s economy, getting into college isn&#039;t the problem. The real questions are:  </p>  <ul>  \t<li><strong>How will you pay for college once you get in?</strong></li>  </ul>  <ul>  \t<li><strong>How can you be sure you will complete college in only four years?</strong></li>  </ul>  <ul>  \t<li><strong>How can you be sure you will get a job in your degree field, or any field?</strong></li>  </ul>  <p>  \t                    College is an extremely important, expensive investment, and families need to treat it that way. Knowing how the college system works will help you avoid costly mistakes, as well as maximize your college experience.  </p>  <p>  \t                    The first step of your journey is to get your student in the right college for the lowest possible cost. The second step is to position your student for success after college, by achieving success during college. These steps are exactly what Ontrak 101 can help you complete.  </p>  <p>  \t                    It is nearly impossible to know in advance how much a school will actually cost, or which school to attend, or how to succeed there. We have broken down the complex, confusing “college process” into easy-to-follow steps to help you: choose the right college, get the best price, and guide you through college to career success.  </p>  <p>  \t                    Ontrak 101 holds your hand all the way through college graduation, and makes a previously overwhelming process manageable and easy to navigate. We&#039;re there when you need us!  </p>", 
    "end_date": null, 
    "title": "Get Your Student Ontrak to College & Win the Financial Game", 
    "price": "20.00", 
    "instructors": "Keith Kube", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/324980_3583_22.jpg", 
    "course_url": "https://www.udemy.com/ontrak101/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-22T16:48:58Z"
}