{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Master The Art Of Getting Out Of Debt Quickly &amp; Enjoy The Feeling Of Effortlessly Staying Out Of Debt!</strong></p><p style=\"\">Does your paycheck disappear into bills every month it arrives?</p><p style=\"\">Are you constantly in debt and never seem to find a permanent way out?</p><p style=\"\"><strong style=\"\">Getting Out Of Debt Made Simple For Everyone</strong></p><ul style=\"\"><li style=\"\">Discover the compound effect of multiple small changes</li> <li style=\"\">Learn how to turn your house &amp; belongings into money making assets</li> <li style=\"\">Find out how you can save over 30% on your current car costs with small simple changes</li> <li style=\"\">Structure your bank accounts the way the wealthy do to maximize how you use your money</li> <li style=\"\">Over 30 apps and websites to help you get the heck out of Debt and Stay out!</li></ul><p style=\"\"><strong style=\"\">No Longer Be Out Of Cash Way Before Payday!</strong></p><p style=\"\">This course is ridiculous as to how effective it is! I gave a musician a few of the ideas contained in this course and he was out of £3500 of debt in 90 days!</p><p style=\"\">The material in this course is detailed, practical and easy to follow.</p><p style=\"\">I don&#039;t believe in talking fluff.</p><p style=\"\">The course is ram-packed full of detailed actionable advice.</p><p style=\"\">You get 60 mins worth of short sharp Apple style slides with me explaining and elaborating on the slides as we progress</p><p style=\"\">To top it all off I wanted to ensure that some of the key points sink in, so I&#039;ve set up 9 quizzes to help with this.</p><p style=\"\">And finally the pièce de résistance! Over 30 apps and websites that give you all kinds of ways of not only saving money but also turning what you have into assets. Just one example is one app that pays you for the TV that you watch!</p>", 
    "end_date": null, 
    "title": "Getting out of Debt made simple for everyone", 
    "price": "20.00", 
    "instructors": "Sajid Siddiqui", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415548_73ff_4.jpg", 
    "course_url": "https://www.udemy.com/debt-flowdynamics/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-07T03:48:52Z"
}