{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>We live in a financially driven world. However, instead of feeling empowered by money you've been in survival mode, feeling more overwhelmed than anything else.</p><p>No matter how much money you have in the bank, you can't seem to shake the feeling of anxiety, shame, or guilt when it comes to the subject.</p>  <p><em>  \tWhy stay stuck and experience anxiety around money when you can feel good and trust it to support you in doing the work you love to do?</em></p>  <p>This very question prompted the creation of this program. It is an easily accessible, 2 minute-a day, on-the-go guided meditation series that is <strong>ideal</strong> if you're ready to receive A LOT more money and live your life with greater authenticity!</p>  <p>  \tNo matter what stage of business and life you're in, establishing an empowering relationship with money is pivotal to create significant impact in your life, the lives of your clients, and the world.</p>  <p>  \t<strong>Why 21 days?</strong>  </p>  <p>  \tIt takes a minimum of 21 days to create a new habit.</p>  <p>  \tIf you stay committed and consistent with the 2 minute meditations over the next 21 days, your belief system will shift appropriately, making you feel empowered and excited about your financial reality.</p>  <p>You will be amazed at how naturally financial opportunities and ideal clients will come to you - almost seemingly “out of the blue.\"</p><p><strong>Where you focus goes, your energy flows!</strong></p>  <p>*All that is required to experience results is finding 2 MINUTES a day to close your eyes and plug in your headphones (preferably a place with the least amount of distraction). In your relaxed state of being, press play, and then begin listening to my voice. <em>That's it! </em> </p>  <p>  \t<strong>How do I know if this course will work for me?</strong>  </p>  <p>  \t    If you're generally an open-minded person and are committed to changing your relationship with money, you will see exciting changes! You'll be well on your way to increasing the cash-flow that directly supports you in living life on your own terms and no longer let a lack-mentality stand in the way of you living your purpose.</p>  <p>  \t    As a passionate entrepreneur, I understand how easy it is to get caught up in the “go go go\" hustle that often leaves you disconnected to why you even started your mission in the first place.</p><p>That's why it's even <em>more important for you to commit</em> to this course and find 2 minutes a day to actively begin to shift your mindset and change your reality with money, once and for-all. </p><p><span></span><strong>When and where can I listen?</strong></p><ul><li>On the bus</li><li>In your office</li><li>Under your covers</li><li>On the toilet (haha…but seriously)</li><li>On a park bench </li></ul><strong></strong><p> …anywhere that is comfy for you!</p>  <p>  \t<strong>Can this course work for me if I have never meditated?</strong>  </p>  <p>  \t    Yes! I have specifically designed this meditation as a <em>guided</em> meditation, even if you're a virgin meditator. It's an effortless process that only requires your ability to press “play\" and listen. If you're ready to heal your relationship with money, these short meditations are for you!</p>  <p><strong>Testimonial</strong></p>  <p>  \t    My personal challenges were still rooted in money and fear of the lack of money. After 2 years...I lost my passion and would even surprise myself with the negative banter of the profession and downward outlook of the community towards money, time, and requirements. I was in survival mode, like the majority of people out there still today. At that point I said to myself, \"do this the way I desire with 100% complete commitment\".  </p>  <p>  \t    I have been through many master programs, training in communication, presentation, public speaking, marketing, team building, etc. I have worked with many teachers/trainers/coaches/masters in various fields. So I have high expectations for the person I commit to, because it takes commitment.  </p>  <p>  \t    I found Juliet Turalski via her online existence and I immediately felt so drawn to her message that I kept going back and checking in to see what she was doing and what would it take for me to stand out in such a big pond of \"masters\". I began to see messages pop up in my external life and words in my mind that JulesInspired was the technique I will be using to commit 100% to my desires.  </p>  <p>  \t    -Jeff  </p>  <p><strong>Here is a motto I live by and I invite you to take on yourself…</strong></p><p><strong>START BEFORE YOU'RE READY!</strong></p>  <p>Do you feel...</p>  <ul><li><em>emotional and overwhelmed when organizing your finances?</em></li><li><em>like money always runs out?</em></li><li><em>fear around purchasing items and paying the bills?</em></li><li><em>compulsive in you're habit of spending?</em></li><li><em>stressed around sales conversations and/or asking for money for your services?</em></li><li><em>compare your worth to others in your industry?</em></li></ul>            <p><strong>Life is too short to waste another minute in resistance to having an empowered relationship with money! Your potential is waiting for you to just grab hold and say “YES!\"</strong></p><p><strong>Take charge of your life and let these meditations take you to YOUR</strong><strong> next level!</strong></p>", 
    "end_date": null, 
    "title": "Heal Your Relationship with Finances", 
    "price": "20.00", 
    "instructors": "Juliet Turalski", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415276_b5e6_4.jpg", 
    "course_url": "https://www.udemy.com/heal-your-relationship-with-finances/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T20:14:12Z"
}