{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn basic concepts to improve your financial situation.  Let's work together to increase the value of your monthly cash flow statement!</p><p><strong>Build a strong financial base and mindset that you can build upon.</strong></p><ul><li>Initiate positive, calm, goal-oriented thinking</li><li>Discover creative outlets</li><li>Reduce and automate your expenses </li><li>Find purpose while increasing your income</li><li>Reduce time and money wasters</li><li>Align your budgeting, spending, mindset, and daily action steps towards your purpose and goals.</li></ul><p><strong>Take a value-based approach at money that you can apply the rest of your life.</strong></p><p>By aligning your thoughts and actions towards value, you can cut the bad, add the good and move in a positive direction financially and in your purpose. It is a skill you can build upon so you can make decisions to get the most of your time and what money can provide you.</p><p>Ever wonder what people that don't make much more than you seem to have access to more money? In this one month course, with under ten minutes of instruction per day, we will learn skills to get out of scarcity and into this place of abundance.</p><p>Value your time and personal finance with this course balancing mindset, action steps, and support elements needed to naturally make progress.  Included is a financial and tracking worksheet to track this progress along the way.  Know what it important in your life and build your life and money-management around these values.</p>", 
    "end_date": null, 
    "title": "How to Maximize Cash Flow in 1 Month", 
    "price": "20.00", 
    "instructors": "Rachel Bourne", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611272_6228_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-maximize-cash-flow-in-1-month/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T03:18:21Z"
}