{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>How many times have you setup a budget only to see it get busted?</p>\n\n<p>Don't feel bad. A busted budget is more common than one that actually works. But how can you ever get out of debt and achieve your financial goes when every budgeting system seems to fail?</p>\n\n<p>There is a way around this annoying problem. What if you could see into the future and know exactly how your spending today affects you financially a year or more down the road?</p>\n\n<p>Let's go a little further. What if you could:</p>\n\n<ul><li>Know when your checking account is about to go negative</li><li>Have a predetermined cushion of cash in your account</li><li>Have the ability to save every month</li><li>Pay down credit debt and know exactly how much of a payment you can feasible send in</li><li>Setup a financial plan that lets you finally get ahead</li></ul>\n\n<p><strong>With the Personal Financial Co-Pilot you can.</strong></p>\n\n<p>We start with the setup. This means getting you finances into the system. Then we create a budget, which lays the foundation for building your personal financial plan.</p>\n\n<p>The course is easy to follow along since we actually use real financial accounts to create a personal financial co-pilot, step by step.</p>\n\n<p>Once your financial co-pilot is in place, <em>it will look after your finances</em>, constantly monitoring them for any potential problems and helping you reach your financial goals.</p>\n\n<p>Join now to get to take back your finances! I can't wait  to see you inside the course.<br></p>", 
    "end_date": null, 
    "title": "How To Create A Personal Financial Co-Pilot", 
    "price": 0, 
    "instructors": "Brett Romero", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/873592_7f30.jpg", 
    "course_url": "https://www.udemy.com/personal-financial-co-pilot/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-09T16:44:51Z"
}