{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><p>In Personal Finance Course you\r\nwill learn how Sharman and her husband\r\ngot a vision to pay off all their debt, including their mortgage, in five\r\nyears. At 36, after accomplishing that monumental goal, she was inspired to\r\nreach out and help others with Personal Financial\r\nPlanning who are struggling financially and living paycheck to paycheck.&nbsp;<br>\r\n<br>\r\nSharman Lawson lets you know that financial freedom isn&#039;t based on who&nbsp;you\r\nknow, how much money you make, or your education. It is a result of a change in\r\nyour thoughts and habits regarding your hard-earned money.&nbsp; This course is\r\ntaught by Sharman Lawson a certified coach and human behavior consultant.\r\nSharman teaches people how to change habits, behavior, and spending when it\r\ncomes to money in order to create financial freedom and live debt free.<br>\r\n<br>\r\nLiving debt free is a lifestyle and philosophy that anyone can choose to\r\nimplement in his or her current situation using his or her current income. This\r\nPersonal Finance Course will give you\r\nrelevant principles, concepts, information, and tips that you can immediately\r\nstart applying in order to obtain financial freedom and live debt free.&nbsp; <br>\r\n<br>\r\nAfter taking this Personal Financial Planning\r\nTraining&nbsp; you will:<br>\r\n<br>\r\n- Walk away with a financial vision for your own life and future<br>\r\n- Have clarity and more confidence regarding your finances <br>\r\n- Be able to take the information and immediately start applying it<br>\r\n- Be able to develop a strategic plan to eliminate debt<br>\r\n- Be able to develop a strategic plan to start saving and investing<br>\r\n- Have a different perspective on personal finances and money<br>\r\n- See how to create financial security and a debt free lifestyle are doable <br>\r\n- Have a passion and motivation to experience financial freedom</p>&lt;/p&gt;\r\n", 
    "end_date": null, 
    "title": "How to Have Financial Security and Live Debt Free", 
    "price": "25.00", 
    "instructors": "Development Coach and Consultant Sharman G. Lawson", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21509_f415_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-have-financial-security-and-live-debt-free/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-20T16:02:52Z"
}