{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Did you know that the average college senior is graduating with over $30,000 in student loan debt? College pricing is skyrocketing, and college debt levels are following suit. What is not rising? Salaries! </p>    <p>College students typically do not put a lot of thought into student loans while they are in school. I know I didn't! However, this can be very dangerous! It is very easy to fall deep into student loan debt, and this type of debt can be difficult to manage and pay off. </p>    <p>I graduated from Saint Cloud State University in May of 2009. I came out of school with about $32,000 in student loans. What was even worse is that it took me ONE WHOLE YEAR until I was making enough money to properly manage that debt-load! </p>    <p>I know exactly what college graduates are going through. And now that I am on the other side, I can say with 100% confidence that fighting through this type of debt is absolutely worth it! Becoming debt-free feels amazing and it opens up so many doors in life! </p>    <p>If you have student loan debt, you must learn how this type of debt affects your finances and how you can properly manage. This online program is designed to help you understand the consequences of this type of debt, so that you can identify the right course of action. This program will help you get on a plan to overcome your student loans so that you can enjoy life! </p>    <p>I know exactly how student loans affect people (I have experienced it myself). I have won the battle against student loans, and I can help you win too! Sign up today and take control of your student loans! This program comes with a 30 day money back guarantee. Also, once you purchase the program, you will have lifetime access! </p>    <p>Sign up today and take a step toward financial wellness!</p>", 
    "end_date": null, 
    "title": "How Student Loans Affect Your Finances", 
    "price": "30.00", 
    "instructors": "Devin Czech", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494548_6ced_3.jpg", 
    "course_url": "https://www.udemy.com/how-student-loans-affect-your-finances/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T21:19:17Z"
}