{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>**COURSE UPDATED FOR JUNE 2016**</strong></p>\n\n<p><br>Hi, My name is Viktor and I was once in your position.</p>\n\n\n\n<p>My credit score was 520, and I couldn't get approved for anything... a loan, a car, a house... nothing!</p>\n\n\n\n<p>Exactly 19 days later my score suddenly shot up to 765 by using a secret that I found by accident.<br></p>\n\n\n\n<p><strong>A Secret that <em>Nobody</em> knows about.</strong></p>\n\n\n\n<p>And I want to share with you just ONE of those secrets with you right now - So you can do it too....</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>You see, not all that long ago, I was broke.</strong> I had lost my business, and was living off credit cards.</p>\n\n\n\n<p>That put me in a huge amount of debt very quickly. My minimum payments started to add up to more money than my rent.</p>\n\n\n\n<p>Debt collectors began calling non-stop, and even came knocking at my door!</p>\n\n\n\n<p>They called my friends and family looking for me, like I was a criminal!</p>\n\n\n\n<p><strong>Something Had to Give.</strong></p>\n\n\n\n<p><strong>I Searched the Internet for Answers.</strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p>I got desperate and tried every so-called \"trick\" including hiring a \"Credit Repair\" Company....</p>\n\n\n\n<p><strong>Nothing worked...</strong></p>\n\n\n\n<p>I considered filing for bankruptcy, but I couldn't afford a bankruptcy lawyer.</p>\n\n\n\n<p>So I decided to take matters into my own hands. I looked to the law and found the Fair Credit Reporting Act. I read it front to back, over and over and over again.</p>\n\n\n\n<p>And in between thousands upon thousands of words of legal mumbo jumbo, I found one little sentence that changed everything.</p>\n\n\n\n<p><strong>I Couldn't Believed What I Had Found</strong></p>\n\n\n\n<p><strong>If I Was Correct, I Had Just Found my Ticket Out of the Hell I was Living In...</strong></p>\n\n\n\n<p><strong>A 100% Legal Loophole that Nobody was Talking About.</strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p>I searched everywhere and couldn't find any mention of it.</p>\n\n\n\n<p>Had No One Seen this Before?</p>\n\n\n\n<p>Why was it not being talked about anywhere?</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>I Decided to put my \"Loophole\" to the Test...</strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p>I had 12 negative marks on my credit report, adding up to tens of thousands of dollars - charge offs, late payments, and collections.</p>\n\n\n\n<p><em>I used my trick on every single one of them, hoping for the best.</em></p>\n\n\n\n<p><br></p>\n\n\n\n<p>Within 19 days, I received 9 letters in the mail... those negative marks had been removed!</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>It Was Like They Never Happened!</strong></p>\n\n\n\n<p>My credit score went through the roof practically overnight!</p>\n\n\n\n<p>I felt like I had hit the jackpot!</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>I Instantly Had Perfect Credit!</strong></p>\n\n\n\n<p><br></p>\n\n\n\n<p>And Now, I'd Like to Share it with You....</p>\n\n\n\n<p><br></p>\n\n\n\n<p>I hope you understand how powerful this information is...</p>\n\n\n\n<p><strong>Over the Past Few Months, I've Showed My Friends and Family This Trick, and They've Used it Successfully 100% of the Time.</strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p>I believe this is going to get national attention very soon.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>This is as real as it gets, and you will not find it anywhere else.</strong></p>\n\n\n\n<p>This course has been structured to make it as easy as possible for you to get started...</p>\n\n\n\n<p>It includes scripts, templates, action steps, and much much more...</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>You Just Learned ONE of the 34+ Proven Ways to Increase your Credit Score...</strong></p>\n\n\n\n<p><em>There are Many More that Boost your Score and Keep it There...</em></p>\n\n\n\n<p><br></p>\n\n\n\n<p>Whatever your reason is- you made a mistake, fell on hard times, lost your job, you forgot to pay... whatever it is... I don't care.</p>\n\n\n\n<p>You Now Control Your Own Destiny...</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>****UDEMY INSTRUCTOR HAS 7 COURSES with 7000+ Students and 150+ 5-Star Review****</strong><br></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p>Even if you have a high credit score and want to get it higher... this course is for you</p>\n\n\n\n<p>Even if you only boost your credit score by 50 points in 60 days, then the course is worth it!</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>ENROLL NOW!</strong></p>\n\n\n\n<p><strong>p.s. Udemy has a 30 Day Guarantee... if for any reason you aren't satisfied, I will personally make sure you get your money back. No Questions Asked.</strong></p>\n\n\n\n<p><strong></strong></p>", 
    "end_date": null, 
    "title": "How I Boosted my Credit Score from 520 to 765 in 19 Days!", 
    "price": "20.00", 
    "instructors": "Viktor Jiracek", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628474_082c_3.jpg", 
    "course_url": "https://www.udemy.com/34-proven-ways-to-improve-your-credit-score-in-30-days/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T02:11:12Z"
}