{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>JOIN 2,400+ STUDENTS LEARNING HOW TO GROW THEIR NET WORTH FROM ZERO TO $100,000 IN 3.5 YEARS!</strong></p>\n\n<p>In this course, I'll be teaching you the exact methods that I used to grow my net worth from zero to $100,000 in just 3.5 years. </p>\n\n\n\n<p><strong>What is my experience on the topic?</strong></p>\n\n\n\n<p>I've been tracking my finances for over 5 years with the free financial software Mint. In doing so, I've been able to cut my lifestyle to just $25,000 per year (which I've been living on for over 5 years) and pay off my debt, save up a big pile of money and quit my job to start my own business. I now have a location independent online business that allows me to work from anywhere and still make a comfortable living.</p>\n\n\n\n<p><strong>Who is this course for?</strong></p>\n\n\n\n<p>It's for the person who's looking to spend less money so they can get ahead. It's right for the person who is willing to make big changes in order to succeed financially. It's for you if you have big things you want to do with your life and need financial padding to do so (which is most of us)!</p>\n\n\n\n<p><strong>Who is this course NOT for?</strong></p>\n\n\n\n<p>This course isn't for people who won't let go of being materialistic. It's not for people who don't have big dreams and it's definitely NOT for people who aren't willing to put in tons of work and sacrifice to make financial freedom a reality.</p>", 
    "end_date": null, 
    "title": "How to Grow Your Net Worth Substantially in 3.5 Years", 
    "price": "25.00", 
    "instructors": "Kraig Mathias", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/457096_690a_11.jpg", 
    "course_url": "https://www.udemy.com/how-to-grow-your-net-worth/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T20:30:20Z"
}