{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Over 100 students enrolled in just weeks shows the interest in having a second income. </p><p>If you want extra money to pay for that wonderful holiday or shiny new \ncar, or if you need more money each month to top up your pay-packet, or \nif you have lost your job and need cash until you find a job, or if you \nare retired with time on your hands and want a new venture then this is \nfor you. </p><p>Over 100 students enrolled in the first 72 hours of being published. The course is full of ideas that are suitable for anyone with any level of education. The course consists of easy to follow videos that are fully self explanatory, </p><p>Most of these opportunities are local and need no special expensive equipment or other outlay, no special skills, no premises (you can operate from home), and no traveling. For many you need no transport. Where you will need equipment it will be low cost or something you use at home. In some cases as the business develops you will be able to invest in more robust equipment to improve the quality and speed. Some skills can be learned on the job or in an online course. </p><p>You should take this course if you are motivated and driven to succeed, if you are positive and prepared to take enthusiastic action. <br> </p><p>This course covers 60 local business opportunities that you could start tomorrow. But this course is not for you if you want a get rich quick scheme - I believe all overnight success has taken years of hard work. </p><p> A Self-Help Questionnaire is included together with a start up guide you can download. You can take this course in an hour or slower if you want. The course covers ideas that you can build upon. If you follow through and take some action you will be successful.</p><p>Take this course. Find an opportunity that suits. Roll up your sleeves and start making money. Good luck!<br></p>", 
    "end_date": null, 
    "title": "How to earn a second income starting today locally ", 
    "price": "20.00", 
    "instructors": "Mike Leahy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/484336_036c_3.jpg", 
    "course_url": "https://www.udemy.com/start-making-300-this-week/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-23T14:39:13Z"
}