{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course the winner of a recent international Forex trading competition (860% return in 2 months) openly reveals and shares all the techniques, strategies, tools and approaches used that gave him the edge to nose ahead of the competition by almost 200%. He did not use rocket science, so after doing this course there should be no reason why your own Forex trading should not take a quantum leap forward in the next year.</p>  <p>This course is presented by his mentor Alex du Plooy and the content comes from numerous email, Skype and Team Viewer conversation sessions. He has known and been mentored by Alex for over 5 years.</p>  <p>The content of the course be simple and clear and should motivate and inspire you to achieve improved Forex trading results. It mainly consist of videos and quizzes. Many example and explanations are given as well as an analysis of the winning trading statement </p>  <p>The winner takes you through the process of preparing himself mentally, psychologically for the competition. He knew the tools, rules, strategies to be used, currency to be traded even before the competition. After that is was a case of merely implementing his strategy using specific tools to guide and assist in planning deals. When sticky situations developed he worked his way out of them as his strategy and risk management was decided before the time.</p>  <p>There are 100’s of basic and advanced trading lessons scattered throughout this course.</p>  <p>Major techniques and approaches you will learn are:</p>  <ul><li>How to select currencies</li><li>How important it is to be psychologically prepared for Forex trading</li><li>How important it is to be the master of your trading tools – not their slave</li><li>How important it is to have a very clear and complete strategy covering all eventualities before starting to trade.</li><li>How easy it is to get the direction right most of the time with a free Trading technique</li><li>How to use a 3 dimensional view of the Forex Market to enter and monitor your trades.</li><li>How to be use position sizing to leverage gains and reduce losses</li><li>How to use Gap sizes to leverage gains and reduce losses</li><li>How to manage trading risk by managing the number of open deals at any one time</li><li>How to know when to stop trading and take a rest.</li><li>How to know when to trade aggressively and take full advantage of trends</li><li>How simple a successful trading strategy really can be</li><li>………..and much more</li></ul>                          <p>The Course includes the Grid Trend Multiplier EA and the Multiple Moving Average strategy used by the trader to guide him as to which strategies to use during the competition. These tools along with other techniques helped him only trade of the markets major trends and to get out of the market quickly when this trends reversed or slowed down. </p>  <p>Although the Forex trading competition required the use of a GTM EA the principles above apply to Forex trading in general and can be used for most Forex trading techniques.</p>  <p>The beginner will get a good idea of what is required to succeed in Forex trading and the intermediate and advanced trader can use the course as a check list to find ways to improve their trading.</p>  <p>You need to do this course.It has so many Forex trading and trading psychology gems that you will be filled with confidence and inspiration at the end.</p>", 
    "end_date": null, 
    "title": "How to Achieve Financial Success with Forex Trading", 
    "price": "50.00", 
    "instructors": "Alex du Plooy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/738624_6b07_5.jpg", 
    "course_url": "https://www.udemy.com/how-i-made-860-percent-in-2-mths-a-forex-trading-competition/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-23T05:31:04Z"
}