{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is the <strong>first in a series </strong>of courses which will teach you on how to practically apply sustainability in making money, saving money and investing to improve your cashflow and income. This course and upcoming ones are articulated in a way no one has ever done to maximise on using sustainability to generate income. </p><p>My courses will make sure that you are able to quantify and improve on your cashflow and income over time to create both <strong>passive and active income sources for yourself. </strong>Feel free to join me on my journey at lifestylesustainabilityDOTcom. I started on the journey and you can too and believe me once you get started on this plan and are consistent over time , we can watch our income grow over time in a sustainable way.</p><p>I guarantee you that this course will teach you the fundamental elements in building <strong>cashflow and income </strong>for your life through understanding and knowing where to apply sustainability. I have created a number of cashflow sources and you can too regardless of where you are in the world and how old you are. You can start now, in fact today.</p><p><strong>The target audience</strong></p><p>Anyone with a drive to make more income, even starting off a shoestring budget - literally. Basically anyone looking to improve their cashflows and live a fuller life with meaning and purpose.</p><p>Look out for the free compliementary takeaway at the end of this course which will help set you up along your journey for success, improved cashflow and more income or simply visit lifestylesustainabilityDOTcom</p>", 
    "end_date": null, 
    "title": "How to use sustainability to create cashflow and income", 
    "price": 0, 
    "instructors": "Tendai Mabikacheche", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527276_bab4_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-sustainability-to-create-cashflow-and-income/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T06:31:17Z"
}