{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Have you ever bought a car and felt annoyed when you realised that you could have got a better deal?  </p>  <p style=\"\">  \t  Does it leave you feeling like you are useless at negotiating a good deal? When you see everyone else getting a better deal than you.  </p>  <p style=\"\">  \t  Pushy car salespeople always seem to get their way and exploit the hard working individuals like yourself and I’m sick of seeing so many people around me gettting ripped off when buying a car.  </p>  <p style=\"\">  \t  The information in this course has been passed onto me through mentors and countless industry professionals in the car industry and the sales industry. Not only that but the information has been taught to many clients and friends that have tried and tested these strategies successfully. Collectively the course has been refined to only include the most important information to give you a comprehensive and elite understanding of how to get what you want.  </p>  <p style=\"\">  \t  I’m going to reveal to you the sacred selling techniques that car dealers and professional private sellers use to rip you off.  </p>  <p style=\"\">  \t  Those techniques are used in such a subliminal way that you are not even aware that you are being manipulated into buying a car on their terms and not yours.  </p>  <ul style=\"\">  \t<li style=\"\">This will allow you to buy a car that you might not have ever thought you could afford.</li>  \t<li style=\"\">You will get a better deal on buying a car by about 25%</li>  \t<li style=\"\">Never get ripped off buying a car ever again.</li>  </ul>  <p style=\"\">  \t  These highly sought after techniques have been used for decades by professional sellers.  </p>  <p style=\"\">  \t  So Don’t miss out on this opportunity to change the way you not only buy cars but also the approach to buying any product in your life.  </p>  <p style=\"\">  \t  Believe it or not they are simple to teach, easy to learn and even easier to use.  </p>  <p style=\"\">  \t  You don’t have to have any special skills except for the willingness to learn how to get yourself a better deal.  </p>  <p style=\"\">  \t  Take advantage of this course today.  </p>", 
    "end_date": null, 
    "title": "How to Get a Great Deal When Buying a Car", 
    "price": "20.00", 
    "instructors": "Jackson Dean", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289048_6843_3.jpg", 
    "course_url": "https://www.udemy.com/tips-tricks-save-money-buying-car-private-seller-dealer/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-27T17:03:08Z"
}