{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><br></p>  <p>  \t                      Most online shoppers, especially US consumers, shop on impulses and even when they actually need what they're shopping for, they are not actually aware that they could be paid a small fraction of their spending as cash-back. This cash-back balance then adds over time and can add to surprising amounts if you follow the steps which we'll be going over in this quick course.  </p>  <p>  \t                      This course will take you about 35 minutes at most to complete. The course spans about 5 great lectures; no filler; all great value content!  </p>  <p>  \t                      This course is great for the following people:  </p>  <ol>  \t<li>This course is NOT a scam; you’ll be refunded if what I showed you wasn't true or doesn't work.</li>  \t<li>This course if NOT for anyone who shops in brick and mortar buildings like at physical shopping malls; this course if ONLY for those shopping ONLINE; no physical malls here.  </li>  \t<li>This course is for everyone who wants to get paid for shopping online</li>  \t<li>You did NOT know that you could be PAID for doing your own shopping online literally; no catch here.</li>  \t<li>I start off the course with a proof video showing my very first check that I received in the mail within my first month of using this system which I will be showing you in the course; and I am not even an aggressive online shopper.</li>  \t<li>You do most of your shopping online and usually use your debit or even better, your credit card.</li>  \t<li>In the course, I go briefly into why you should use a credit card which gives you some kind of cash-back for using your credit card, whether that be 5% cash-back or more.</li>  \t<li>The course is NOT about using your credit card; it’s about some of the services which are available online and which you can use to earn cash-back every time you shop online.</li>  \t<li>This course is for anyone who’s used to shopping online the typical way, using your debit or credit card and NEVER getting paid a small fraction of your spending back.</li>  </ol>  <p>  \t                      Have 35 minutes to spare? Then let's jump in and save some money!  </p>", 
    "end_date": null, 
    "title": "How to Grow a Home Business by Shopping Online", 
    "price": "50.00", 
    "instructors": "Joel Guifo", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339694_db5f.jpg", 
    "course_url": "https://www.udemy.com/grow-a-home-business-by-shopping-online/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T16:08:03Z"
}