{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    In this eye-opening presentation, noted investor, entrepreneur, educator, and author Robert Kiyosaki and investor/Rich Dad Education instructor Katie O&rsquo;Brien will give you an introduction to how financial education can transform your life and put you on the path to financial freedom.  </p>  <p>  \t    Today, the middle class all over the world is under attack. While those at the top have seen their wealth grow to almost obscene levels, those in the middle have actually been losing ground with stagnant or falling wages. The old advice of &ldquo;go to school, get a job, stay out of debt, and live below your means&rdquo; could be putting you in real danger!  </p>  <p>  \t    As Robert outlined in his mega-bestseller <em style=\"\">Rich Dad Poor Dad</em> (30 million copies sold worldwide and still going strong), the rich know powerful things about how to use money that the middle class doesn&rsquo;t know and is never taught in schools.  </p>  <p>  \t    The purpose of Rich Dad Education is to bring this type of financial education to people like you. During this free training, you will be introduced to several financial strategies that can help you:  </p>  <ul style=\"\">  \t<p>  \t\t <strong style=\"\">   &bull; Create Income from Real Estate without Using Your Own Money </strong>  \t</p>  \t<p>  \t\t <strong style=\"\">   &bull; Invest in Real Estate without Using Your Own Credit </strong>  \t</p>  \t<p>  \t\t <strong style=\"\">   &bull; Elevate Your Financial IQ </strong>  \t</p>  \t<p>  \t\t <strong style=\"\"></strong>  \t</p>  </ul>  <p>  \t    Robert will share his personal story of how financial education lifted him from the middle class to multi-millionaire status and why he&rsquo;s now on a crusade to share this same information with as many people as possible.  </p>  <p>  \t    You will also get information on:  </p>  <ul style=\"\">  \t<p>  \t\t <strong style=\"\">   &bull; A Cash Flow Formula to Build Long-Term, Sustainable Wealth in Your Own Life </strong>  \t</p>  \t<p>  \t\t <strong style=\"\">   &bull; 5 Life Lessons That Can Build Wealth in Your Own Life </strong>  \t</p>  \t<p>  \t\t <strong style=\"\">   &bull; 3 Keys to Financial Success </strong>  \t</p>  \t<p>  \t\t <strong style=\"\">   &bull; The Next Steps You Can Take to Achieve Financial Freedom </strong>  \t</p>  </ul>  <p>  \t    The goal of this presentation is to show you that you can get out of the rat race and onto the fast track where you can achieve your dreams.  </p>", 
    "end_date": null, 
    "title": "How to Build a Better Financial Future", 
    "price": 0, 
    "instructors": "Rich Dad Education", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/130104_cd97_13.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-better-financial-future/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-06T16:27:12Z"
}