{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>JOIN 3,500+ STUDENTS LEARNING HOW TO USE MINT TO TRACK THEIR FINANCES AND MANAGE THEIR MONEY SO THEY CAN ENJOY MORE FREEDOM.<br>  \t</strong>  </p>\n\n<p>  \t      In this course, I'll be teaching you the exact methods  that I used to track my finances with Mint, save half of my income for several years and save up five years worth of living expenses before I turned 30, enabling me to quit my job and start my own business.<br>  \t<br>  \t<strong></strong><strong>What is my experience on the topic?</strong><br>  \t                   I've been using Mint for over five years and have tracked my finances every single month throughout that entire period. Doing so enabled me to get myself out of $26,000 of debt and build up five years worth of living expenses in savings, allowing me to quit my job and start my own business.<br>  \t<br>  </p>\n\n\n\n<p>  \t<strong>Who is this course for?</strong> <br>  \t          This course IS RIGHT for people looking to take responsibility for their future and turn their lives around financially.  </p>\n\n\n\n<p>  \t<strong>What problems does this course solve?</strong><br>  \t                   It saves you hundreds of hours of trial and error in learning to use Mint to track your finances. It helps you get it right the first time, without wasting a ton of time, money or energy.<br>  \t<br>  \t<strong>Who is this course NOT for?</strong><br>  \t                  This course is NOT for those who aren't serious about getting their finances under control and who's financial accounts won't sync up with Mint.  </p>", 
    "end_date": null, 
    "title": "How to Use Mint to Track Your Finances and Win with Money", 
    "price": "25.00", 
    "instructors": "Kraig Mathias", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/407068_03f7_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-mint-com/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T20:25:22Z"
}