{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Here's over the shoulder teaching on how to reverse engineer your income from $0 to $100 000. This course for any of you who are absolutely focused on achieving a specific financial target, regardless of what you do and field your are in. </p><p>Do the math, the world is a vast space with over a billion people, its never that there is not enough money for you to be making your chunk. Its about positioning and being repetitive in the areas that work. Whether you are in India, Nepal, United Kingdom, Australia, United States, Ghana,  South Africa,Israel. The priniciples here apply to you all and all you need is your specific financial goal - a hard figure like $100 000 (that's the case for me).</p><p>This course is NOT for people who are not goal determined. Im focused and only want to teach and share these principles with people I know are in the same space. Basically a super- focused and targeted tribe. I don't mind a tribe of just a 100 super goal oriented individuals. My job will be done.</p><p><strong>Here's undeniable proof why this course is for you:</strong></p><p>I'll provide you with science backed and complete idiot proof tips on how to get to your target financial goal without cracking your head on how to get there.</p><p>I have completely trusted sources of the principles I teach which have been applied by others and they have achieved significant results. I share these in the course.</p><p>You owe it to yourself to have a financial goal and ACTUALLY achieve it, and see the results physicaly , not just mentally or day dreaming. You deserve all good things.</p><p>I'll tell you the biggest mistake you are making that no one has told you just yet.</p><p><strong>Here's your zero risk guarantee:</strong></p><p>If you feel that you are still the same person you were before taking this course, I am more than happy to give you your money back - so a strong money back guarantee here! After all - all the pennies you spend should only be for  highly valuable things if you want to achieve your financial goals.</p><p>Start the course now. Enrol here on the bar to the right.</p><p>If you feel you havent quite got this yet, re-read through my undeniable reasons above again on why you should take this course today.<br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "How to reverse engineer your income to your target figure", 
    "price": 0, 
    "instructors": "Tendai Mabikacheche", 
    "commitment": "28 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552754_9d49_2.jpg", 
    "course_url": "https://www.udemy.com/reverse-engineer-your-income-from-0-to-100-000/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T20:58:24Z"
}