{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis-Become A Money Magnet Now Using Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn -</p><ul><li><strong>1.     \n</strong><strong>Why most people fail to make money</strong><strong>?</strong><strong></strong>\n\na.      Limiting\nbeliefs are those that keep us from realizing our goals.  Most of our limiting beliefs come from\nsomewhere in our past. They come from what we were taught as children by our\nenvironment – parents, peers, others, from religious influences, religion,\ntelevision and movies, and from popular culture.\n\n<strong><em>Examples: “Money is the root of all evil,\" “blessed are the poor,\" “rich\npeople are jerks,\" or simply that “there is never enough.\"</em></strong>\n\nb.      Lack of\nmotivation\n\nc.      \nLack of enthusiasm\n\nd.     \nStays in the comfort zone, does not want to come out\nof their comfort zone\n\n\n\n<strong>2.     \n</strong><strong>How Self Hypnosis Can Help?</strong><strong></strong>\n\n1)     \nSelf\nhypnosis helps change your old and limiting beliefs and thoughts\n\n2)     \nSelf\nhypnosis helps visualize yourself having and making more money\n\n3)     \nSelf\nHypnosis helps you to relax and calm down\n\n4)     \nSelf\nhypnosis helps maintain positive attitude \n\n5)     \nSelf\nhypnosis treats stress, anxiety, nervousness and depression successfully</li><li>This course is for those who have been facing a lot of financial issues and are unable to attract money in their life with a positive attitude and are getting demoralized due to lot of negativity in their mind and lack of self confidence.</li></ul><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 8 lectures in English including bonuses.</p><p>This course contains-</p><p>Lecture 1: Introduction</p><p>Lecture 2: Remove Myths About Self Hypnosis</p><p>Lecture 3: Conscious Mind Vs Subconscious Mind</p><p>Lecture 4: How To Enter Into The State Of Self Hypnosis</p><p>Lecture 5: How To Master Self Hypnosis To Reprogram Your Subconscious Mind</p><p>Lecture 6: Guided Visualization Exercise: To Become A Money Magnet Now </p><p>Lecture 7: Summary</p><p>Lecture 8: Bonus Exercise - Affirmations For Depression, Stress, Insomnia And Negativity</p>", 
    "end_date": null, 
    "title": "Hypnosis: Become an Abundance Magnet Using Self-Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578874_48b7.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-become-an-abundance-magnet-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T09:32:56Z"
}