{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Hypnosis for Magnetic success Guided Hypnosis program has been created to simulate a private hypnosis session with me.</strong></p>\n\n<p>Hypnosis will help you Learn why attracting personal finance success and financial stability and wealth is only a state of mind that you can easily acquire with the power of your own mind with Hypnosis by tuning into what is necessary for you to change so that you can begin to attract the money, financial success and wealth that you desire.</p>\n\n<p>Desire being the most important factor of you taking this personal mindset change program, because having that powerful emotion of desire as a driving force will get that financial success come to you even faster.</p>\n\n\n\n<p>In this program that I have created, to simulate a visit to my therapy room just like having your very own private personal hypnotherapy session here with me.</p>\n\n\n\n<p>You will begin to program your mind to become more aware of financial opportunities that you can take advantage of with your own skills and talents.</p>\n\n\n\n<p>Because this is how millionaires become millionaires by doing what they do best to attract and create their fortunes by using their skills and intuition to improve their personal finance and attracting wealth and everything that goes with that wealth.</p>\n\n\n\n<p>So how will you get a wealth mindset with Hypnosis natures gift that has been surrounded by misconceptions and the power of your own mind and all your own special talents that you will utilize to become more aware and intuitive about what actions are necessary for you to attract and create a new wealth and personal finance success instead of leaving it to chance or trying to copy what others who have had success did.</p>\n\n\n\n<p>So you will begin to attract and create financial wealth by being more authentic and doing it your way naturally..Because when you try to copy how others do it you just become a bad copy because you are not being the authentic you with the pleasure and ease attached to getting financial success and wealth.</p>\n\n\n\n<p>What I will teach you in this hypnosis course</p>\n\n\n\n<p>1.<strong class=\"redactor-inline-converted\">You will begin by creating an image in your mind of what you want so that you will know where you are going by having a destination to reach your personal financial wealth goal.</strong></p>\n\n\n\n<p>2.<strong class=\"redactor-inline-converted\">Learn a secret feel good trigger that will help you through any bad times or set backs on your way.</strong></p>\n\n\n\n<p>3.<strong class=\"redactor-inline-converted\">learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</strong></p>\n\n\n\n<p>4.<strong class=\"redactor-inline-converted\">Learn how you naturally resist changes even changes that can be very good for you</strong></p>\n\n\n\n<p>5.<strong class=\"redactor-inline-converted\">Learn just how powerful words can be and their effect on you physically even if they are only self talk.</strong></p>\n\n\n\n<p>6.<strong class=\"redactor-inline-converted\">Learn who can and cannot be hypnotized</strong></p>\n\n\n\n<p>7.<strong class=\"redactor-inline-converted\">Learn how you can feel amazing any time you want to</strong></p>\n\n\n\n<p>8.<strong class=\"redactor-inline-converted\">Attract financial success - Virtual Hypnotherapy bonus section </strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">with 2 extra hypnosis sessions</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">A. Debt Managing Hypnosis</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">B. Being more assertive Hypnosis</strong></p>\n\n\n\n<p>9. <strong class=\"redactor-inline-converted\">How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings that have been stopping you from doing what you need to do to have financial success.</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">All Files and videos are downloadable for easier access</strong></p>", 
    "end_date": null, 
    "title": "Hypnosis for Magnetic success Guided Hypnosis program", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433964_1218_3.jpg", 
    "course_url": "https://www.udemy.com/attract-financial-success/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T11:28:26Z"
}