{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em style=\"\">Infinite Banking Made Simple </em>is a course that will teach you how to increase your wealth by B<em style=\"\">ecoming Your Own Banker</em>. This course is for business men and women, real estate investors, stock market traders, or anyone looking for what it takes to generate lasting wealth. </p><p>Wealth Strategist and President/CEO of Paradigm Life, Patrick Donohoe, will take you through a series of short videos that explains what the Infinite Banking Concept (IBC) is, how it works, and how to successfully implement privatized banking into your overall wealth picture.</p><p>Your take-away points from this course will be:</p><ul style=\"\"><li>An understanding of how <strong style=\"\">privatized banking</strong> can increase your <strong style=\"\">cash flow</strong> and give you a steady <strong style=\"\">rate of return</strong></li><li>How to use the IBC for an ample <strong style=\"\">retirement</strong></li><li>How to maximize the <strong style=\"\">opportunity cost</strong> of your money</li><li>How privatized banking<strong style=\"\"> protects your wealth</strong></li></ul><p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p>The ultra-rich have used the Infinite Banking Concept for decades to build and maintain a financial legacy, and this course will teach you exactly how to do the very same thing. </p><p>Since the conception of the Federal Reserve in 1913, and the central banking system, banks today have learned how to leverage your money to earn over 100% profit. This economic principle of leveraging makes banks some of the richest corporations in the world. By <strong style=\"\">learning how to infinitely bank</strong>, you can implement the same system that central banks use today for your personal profit. Using the Infinite Banking System isn&#039;t just a smart way to maximize your dollar and build wealth, it protects you from financial insecurity.</p><p>This course will enlighten you on how to maximize the opportunity cost of your money, and how to build and sustain sincere wealth. Using a privatized banking system will not only help you obtain financial freedom, it also protects you, your business, your family from the volatile market and unpredictable economy. </p><p>The Infinite Banking Concept will change your financial life forever. </p>", 
    "end_date": null, 
    "title": "Infinite Banking Simplified", 
    "price": 0, 
    "instructors": "Paradigm  Life", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426974_90b2.jpg", 
    "course_url": "https://www.udemy.com/infinite-banking-simplified/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T16:10:36Z"
}