{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">¿TE INTERESA TRANSFORMAR TU CAPACIDAD PARA GANAR, MANEJAR Y DISFRUTAR DEL DINERO?</strong>  </p>  <p>  \t<strong style=\"\">La inteligencia emocional con tu  dinero implica el Ser</strong><strong style=\"\"> consciente de tus capacidades, temores y dificultades</strong> en relación al manejo del dinero.  </p>  <p>  \t<strong style=\"\">Entrenar tu Inteligencia emocional con tu dinero </strong><strong style=\"\">es fundamental</strong> para  conocer tus dificultades para ganarlo, manejarlo y disfrutarlo y a su vez, asegurarte un presente y futuro próspero en dinero, salud y satisfacciones.  </p>  <p>  \t<strong style=\"\">Cuanto mayor es tu Inteligencia Emocional Financiera,</strong> mayores son las  posibilidades que se te abren en la vida para crear, sostener, disfrutar y administrar el dinero en forma gratificante, placentera y exitosa.  </p>  <p>  \t<strong style=\"\">La inteligencia emocional con tu dinero es una habilidad que te permite </strong>manejar tu dinero con confianza, seguridad y placer, y a la vez, combinarlo con el amor, la salud,  las relaciones familiares y el crecimiento espiritual de manera equilibrada.  </p>  <p>  \t<strong style=\"\">EN ESTE CURSO APRENDERÁS LAS CLAVES PARA:</strong>  </p>  <ul style=\"\">  \t<li><em style=\"\">Activar tu manera de ganar dinero en forma próspera.</em></li>  \t<li><em style=\"\">Optimizar tu forma de manejar el dinero.</em></li>  \t<li><em style=\"\">Habilitarte para disfrutar del dinero con placer, conciencia y confianza.</em></li>  \t<li><em style=\"\">Permitirte compartir tu dinero con amor y límites saludables.</em></li>  \t<li><em style=\"\">Generar un estado de Prosperidad Integral = Dinero + Amor + Salud + Placer + Crecimiento Personal-Espiritual. </em></li>  </ul>  <p><strong style=\"\"><br style=\"\"></strong></p><p>  \t<strong style=\"\">A través de los re</strong><strong style=\"\">cursos y herramientas combinadas de la Psicología, Coaching Transformacional y el Taoísmo, </strong>recibirás información clara y didáctica que cambiará para siempre tu manera de relacionarte  con Tu Dinero  y te permitirá crear Prosperidad Integral en tu vida.  </p>  <p>  \t<strong style=\"\">AL INSCRIBIRTE EN ESTE CURSO, RECIBIRÁS GRATIS:</strong>  </p>  <ul style=\"\">  \t<li><em style=\"\">Material en PDF con Ejercicios prácticos para entrenar tu Inteligencia Emocional Financiera y lograr resultados concretos en tu vida.</em></li>  </ul>  <p>  \t<strong style=\"\">ESTE CURSO ES DICTADO POR PABLO NACHTIGALL:</strong>  </p>  <ul style=\"\">  \t<li>Psicólogo clínico- Ejerce su actividad profesional en la ciudad de Buenos Aires, Argentina. </li>  \t<li>Especialista en Inteligencia Emocional Financiera y Liderazgo Transformacional. Dicta seminarios, conferencias, capacitaciones y  psico-coaching para empresas y público general en Argentina y Colombia.</li>  \t<li>Colabora como psicólogo en diversos medios de TV, radio y Web Sites en Argentina, Colombia y USA. </li>  \t<li>Autor del libro <em style=\"\">&quot;Bendito Dinero: Cómo generar prosperidad material y espiritual en tu vida&quot; </em>(Ediciones Urano-2013). A su vez ha escrito otros 2 libros  de amplia repercusión en Argentina y Latinoamérica, y un 4to libro que sale publicado en Septiembre 2015.</li>  </ul>  <p><em style=\"\"><strong style=\"\"><br style=\"\"></strong></em></p><p>  \t<em style=\"\"><strong style=\"\">Opcional:</strong> </em>  </p>  <ul style=\"\">  \t<li><em style=\"\">El costo del curso no incluye el libro &quot;Bendito Dinero&quot;. </em></li>  \t<li><em style=\"\">Puedes adquirir el libro <strong style=\"\">&quot;Bendito Dinero: Cómo generar Prosperidad Material y Espiritual en tu vida&quot;</strong> (Ediciones Urano) de Pablo Nachtigall, en formato e-book.</em></li>  </ul>  <p>  \t<strong style=\"\">PARA MAS INFO: www.pablonachtigall.com</strong>  </p>", 
    "end_date": null, 
    "title": "Inteligencia Emocional con tu Dinero", 
    "price": "20.00", 
    "instructors": "Pablo Nachtigall", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433282_c6a9_4.jpg", 
    "course_url": "https://www.udemy.com/inteligencia-emocional-con-tu-dinero/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T19:10:44Z"
}