{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t BIENVENIDOS a nuestro Curso de Proyectos para Pequeños Negocios. El curso está dirigido a entregar conocimientos prácticos e inmediatos que permitan al alumno comprender como se confecciona un proyecto desde la etapa de la idea hasta su presentación final.  </p>  <p style=\"\">  \t  Se trata de un curso dirigido a personas comunes que requieren hacer un proyecto para su pequeño negocio, donde aprenderemos haciendo, basado en:  </p>  <p style=\"\">  \t   - videos cortos donde se plantean las ideas fundamentales;  </p>  <p style=\"\">  \t    - videos suplementarios de Internet donde se muestran ejemplos prácticos  </p>  <p style=\"\">  \t    - se suguieren lecturas complementarias para los que deseen profundizar en algúno de los temas tratados.  </p>  <p style=\"\">  \t    Cada clase planteará un desafío para el estudiante, que consistirá en plantear un proyecto y desarrollarlo desde que se formulan las ideas a través de todas sus etapas hasta completarlo con sus flujos, cálculo de VAN.  </p>  <p style=\"\">  \t    La metodología es distinta a las clases tradicionales, que tiene largas exposiciones de conocimientos del profesor y la memorización pasiva por los alumnos.  </p>  <p style=\"\">  \t    En nuestro caso las exposiciones del profesor son solo píldoras de conocimiento para introducir al alumno en el tema y la parte principal de su aprendizaje se logra en cada uno de los desafíos prácticos, que los alumnos harán por si mismos ayudados con los videos, lecturas complementarias y consultas por medio de correo electrónico.  </p>", 
    "end_date": null, 
    "title": "Introducción a los proyectos privados de inversión", 
    "price": 0, 
    "instructors": "Tomas Bradanovic, Daniel Viera Castillo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/78238_0b3d_8.jpg", 
    "course_url": "https://www.udemy.com/introduccion-a-los-proyectos-privados-de-inversion/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-13T22:51:08Z"
}