{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>COMPLETE COURSE FROM A TOP UDEMY INSTRUCTOR WITH <strong class=\"redactor-inline-converted\">12+ HOURS OF AWESOME CONTENT AND GROWING</strong> TO HELP YOU BECOME A GREAT INVESTOR.<br></p>\n\n<p><strong>Join over 2,000 students in this top rated course!</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Investing can be mastered by anyone</strong> and for those who really learn the key concepts and best practices they will be able to reach their most challenging financial goals and lead the life they dream about.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Unfortunately, many people do not receive the key educational information and best practices </strong>that make the difference between success and failure from a successful investor.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">THIS COURSE WILL TEACH YOU HOW TO BE A SUCCESSFUL INVESTOR. </strong></p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">\"I've taken several of Steve's courses now and they always provide value.</strong> I'm not done with this course (yet) but I've really enjoyed this one so far because it covers so many different things. You can tell that hes been there and done that and really knows what he's talking about!\"- Tommy J</em><br></p>\n\n\n\n<p>Not boring theory. <strong class=\"redactor-inline-converted\">You will learn practical tips and best practices from an instructor who started with nothing <em>(</em></strong><em>Actually $10,000 in student loans living in a 1-bedroom apartment above the garbage cans)</em> <strong class=\"redactor-inline-converted\">to building a million dollar investment portfolio</strong>. No inheritance or luck just good sound actions over the years that you will learn about in the course and can replicate for your own personal situation.</p>\n\n\n\n<p>No get rich quick scheme or a course that is designed to sell you consulting services this course has one mission and that is all about sharing of experience and wisdom from a successful long-term investor and teaching you how you can apply it to your own goals and time horizon.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In this course you will learn all about:</strong></p>\n\n\n\n<ul><li>How the current model of investing (The 3-legged Stool) is broken and how to succeed where others are doomed to fail.</li><li>Key investing concepts that successful investors understand.</li><li>Investing in a variety of assets class.</li><li>Investing in mutual funds and ETF.</li><li>Role of cash in your portfolio.</li><li>Investing in Stocks.</li><li>Investing in Bonds.</li><li>Investing in Real Estate.</li><li>Investing in other assets such as gold, silver, and collectibles</li><li>Understanding or risk and how to calculate your own risk profile.</li><li>Key investment mistakes to avoid that alone can make the difference between success and failure.</li></ul>\n\n\n\n<p>Top Udemy quality Instructor who has a corprate training and university teaching background and continues to be an active investor who will show you the way to success.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">This is an awesome flagship course which means you get:</strong></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Over 6+ hours of video based lessons</strong>.</li><li><strong class=\"redactor-inline-converted\">Lifetime access</strong> to the course so you get updates and new bonus lessons for FREE.</li><li><strong class=\"redactor-inline-converted\">Quizzes</strong> that will test and confirm your knowledge.</li><li>Complete <strong class=\"redactor-inline-converted\">Follow-Along Guide</strong> you can print to aid in note taking and remembering what you learned.</li><li>Ability to <strong class=\"redactor-inline-converted\">participate in online discussions</strong> to share ideas with other students and get answers to your questions from the instructor who will answer every question.</li><li><strong class=\"redactor-inline-converted\">Ask questions directly of the instructor</strong> and every one of those will also be answered.</li><li><strong class=\"redactor-inline-converted\">30 day money back guarantee</strong>-love the course or return it with Udemy easy no questions asked policy.</li></ul>\n\n\n\n<p>Disclaimer Note: This course is for educational and informational purposes only. There will be no recommending of any particular investments such as a particular stock or mutual fund as only you know what is right for your portfolio and your comfort with risk and volatility. Consult with a Professional for specific advice. Course is for education purposes only and instructor will have no liability related directly or indirectly to any loss or damage.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Investing can be fun and really fun when you do it well!</strong></p>\n\n\n\n<p>No risk to sign up and impact could be life-changing. Learn from my experience and rapidly move ahead faster with the knowledge I will share with you. Don't delay.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Please click the TAKE THIS COURSE</strong> button in the upper right corner and let's get started!</p>\n\n\n\n<p>Many thanks and I appreciate your interest and hope to see you in the course!</p>\n\n\n\n<p>-Steve Ballinger</p>", 
    "end_date": null, 
    "title": "Investing Success: Learn Keys From A Millionaire Investor!", 
    "price": "20.00", 
    "instructors": "Steve Ballinger, MBA", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635824_2aa9_4.jpg", 
    "course_url": "https://www.udemy.com/investing-success/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T13:07:05Z"
}