{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Most people (especially young folks) are intimidated by financial topics - particularly investing. Millions of people make a good living, yet continue struggle with money their entire lives. The 20-Something Millionaire course shows you that building wealth on a small salary is (1) entirely possible and (2) how to do it.</p>  <p style=\"\">  \t<strong style=\"\">Start Building Wealth TODAY... Regardless of Your Starting Salary</strong>  </p>  <p style=\"\">  \t  Even if you implement just one of the concepts contained in these lessons, you would get your money&#039;s worth many times over. After taking the course, you&#039;ll be able to:  </p>  <p style=\"\">  \t  - Understand exactly what a stock is and how it makes you money.<br style=\"\">  \t  - Know which investment assets build wealth vs. those that do not.<br style=\"\">  \t  - Create a portfolio mix of stocks/bonds that makes sense for you.<br style=\"\">  \t  - The only 3 mutual funds you need to beat 90% of Wall Street.<br style=\"\">  \t  - Automate your finances.<br style=\"\">  \t  - Understand how a newspaper boy could build more wealth than a doctor.<br style=\"\">  \t  ... and much more!  </p>  <p style=\"\">  \t  Many courses, blogs, articles, and books do a great job of explaining a particular concept in great detail, but they never offer any actionable steps to take to implement that knowledge. The course focuses on simple content that is easy to understand and presented in a way that you can make real changes in your life... starting today!  </p>  <p style=\"\">  \t  We avoid using financial jargon so that a beginner can pick things up right off the bat without any prior knowledge about investing or finance.  </p>  <p style=\"\">  \t  The course is broad, which means I&#039;ll give you a high level overview of basically everything you need to know to get started. We&#039;ll start with the basic foundation of wealth building and then progress towards topics particularly focused on growing your wealth through investing and help you avoid high fees and taxes.  </p>  <p style=\"\">  \t  The videos are all under 10 minutes and each focuses specifically on one topic. Most people learn by seeing things visually as well as hearing them explained audibly, which is why this course focuses on illustrating ideas on the screen, not just providing a bunch of bullet points.  </p>  <p style=\"\">  \t  The videos are supplemented with short quizzes to concrete your understanding. When a lesson involve math, easy-to-use Excel spreadsheets are included to eliminate any need for your own calculator.  </p>  <p style=\"\">  \t  Even if you&#039;re a complete newbie when it comes to finance, you&#039;ll leave this course knowing more than 95% of your friends, family and co-workers about how money works and what it takes to be a successful investor.  </p>  <p style=\"\">  \t  You can build wealth and reach financial freedom... on nothing more than a starting salary! Let me help you get started on your journey. Sign up for the course today!  </p>  <p style=\"\">  \t  ++++++++++++++  </p>  <p style=\"\">  \t  BONUS #1: Downloadable Excel calculators help you make any calculations fast and easy.  </p>  <p style=\"\">  \t  BONUS #2: New courses will be added based upon student request. Feel free to let me know what topics you would like to know more about and I&#039;ll add follow up videos.  </p>  <p style=\"\">  \t  ++++++++++++++  </p>", 
    "end_date": null, 
    "title": "Investing 101: How to Start Investing in 4 Simple Steps", 
    "price": "20.00", 
    "instructors": "Nathan Winklepleck", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317452_dddb_17.jpg", 
    "course_url": "https://www.udemy.com/investing/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-10T20:57:34Z"
}