{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>Course fully up-to-date and new lectures added as of this month.</em><br></p>\n\n<p><strong>FROM THE #1 PERSONAL FINANCE INSTRUCTOR ON UDEMY</strong></p>\n\n<p>JOIN HUNDREDS OF SUCCESSFUL INVESTORS WHO ARE NOW MANAGING THEIR PORTFOLIOS, INCREASING RETURNS, AND PAYING LOWER FEES!</p>\n\n<p>1. Are you interested in <strong>increasing</strong> your investment returns with <em>minimal effort</em>?</p>\n\n<p>2. Would you like to learn important investing fundamentals to fulfill your <strong>financial and lifestyle goals</strong>?</p>\n\n<p>3. Do you want to pay <strong>lower fees</strong> to <em>keep more of your money</em>?</p>\n\n<p>If you answered \"yes\" to at least one of these questions, then this course is for you!</p>\n\n<p><strong>Investing for the sake of investing simply won't cut it.</strong> Along the way you probably wanted to learn about investing, but you weren't sure where to start, what to read, or who to trust. However, improving the odds of lifestyle and retirement success demand that you take ownership of your financial matters. As a result, financial success doesn't start with an \"advisor\"... it starts with you.</p>\n\n<p><em>Stock Market Investing for Experienced Investors</em> addresses the appetite that many people have for learning about personal finance with a focus on investing. Course content is kept simple and neatly arranged so that you get a well-rounded understanding of financial and investment concepts.</p>\n\n<p>As you work toward <strong>building a sound portfolio</strong>, you'll implement an asset allocation inline with your investor profile, for example, a conservative or aggressive investor. Upon successful completion of this course, you will be able to:</p>\n\n<ul><li>Understand fundamental concepts including stocks, bonds, and managed funds</li><li>Understand your portfolio and if your current asset allocation makes sense</li><li>Learn how to build a portfolio of mutual funds and/or exchange-traded funds</li><li>Understand all investment-related fees and which fees to avoid</li><li>Make intelligent portfolio decisions leading to increased returns and wealth</li><li>Learn the steps to becoming a DIY investor (so that you can fire your advisor)</li><li>Plus many other course goals as stated</li></ul>\n\n<p><br></p>\n\n<p>Sign up and experience the top online investment course for experienced investors.</p>\n\n<p><strong>Start Learning!</strong></p>\n\n<p>Enroll now and start increasing your investment returns TODAY!</p>", 
    "end_date": null, 
    "title": "Investing for Experienced Investors ", 
    "price": "20.00", 
    "instructors": "Chad Tennant, Make Money Online - Home Business", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658262_ef09_3.jpg", 
    "course_url": "https://www.udemy.com/investing-stock-market/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T22:20:31Z"
}