{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    A nuts-and-bolts financial literacy course for students on both sides of college.  </p>  <p style=\"\">  \t    With more than 80 engaging videos in 17 information-packed segments, <em style=\"\">Personal Financial Management from College to Career</em> delivers knowledge you can put to use today and later on in life.  </p>  <p style=\"\">  \t    Since 2009, Mitchell D. Weiss has been teaching his typically oversubscribed personal finance course at the University of Hartford. Now, Mitch is bringing both the course and its accompanying &quot;un-college-textbook,&quot; <em style=\"\">Life Happens</em>, to vivid life online.  </p>  <p style=\"\">  \t    You&#039;ll learn how to evaluate student loans, bank loans and competing credit card offers, approach buying a house or car, protect against ID theft, prepare for and choose between career opportunities, compare different insurance products, deal with financial adversity, and much more. Mitch&#039;s straightforward explanations and wide-ranging advice are easy to follow and implement.  </p>  <p style=\"\">  \t    The 17-section course can be taken from start to finish or sampled à la carte, if you prefer to focus on just what you need today. The e-text contains thought-provoking questions, real-life problems, and links to the same online tools Mitch uses on screen to solve those problems. The book also includes hundreds of additional links to even more educational resources and informative articles on this important subject.<br style=\"\">  \t<br style=\"\">  \t    About your instructor: Mitchell D. Weiss is an experienced financial services industry executive and entrepreneur, adjunct professor of finance at the University of Hartford, a member of the board of the university’s Barney School of Business and co-founder of its Center for Personal Financial Responsibility. Mitch is also the author of <span style=\"\">Business Happens - A Practical Guide to Entrepreneurial Finance for Small Businesses and Professional Practices</span><span style=\"\"> </span><span style=\"\">and </span><em style=\"\"><a href=\"http://www.collegehappensbook.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"></a></em><span style=\"\">College Happens: A Practical Handbook for Parents and Students.</span>  </p>  <p style=\"\">  \t<em style=\"\"><a href=\"http://www.collegehappensbook.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"><br style=\"\">  \t</a></em>  </p>  <p style=\"\">  \t<em style=\"\"><a href=\"http://www.collegehappensbook.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"><br style=\"\">  \t</a></em>  </p>  <p style=\"\">  \tBusiness Happens - A Practical Guide to Entrepreneurial Finance for Small Businesses and Professional Practices  </p>", 
    "end_date": null, 
    "title": "Life Happens: Personal Finance from College to Career", 
    "price": 0, 
    "instructors": "Mitchell D. Weiss", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/34815_b74d_5.jpg", 
    "course_url": "https://www.udemy.com/life-happens/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-06T15:59:03Z"
}