{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tThis is a short course on basic money management which is conducted by the Institute for Financial Literacy, Singapore. We provide free and unbiased financial education programmes to companies and organisations.</p>  <p>  \t<strong>Description of Module:</strong>  </p>  <p>  \tLearn to set S.M.A.R.T. financial goals and work out how much you need for your goals. Develop a budget by tracking your spending and savings on a regular basis. Learn how to cut down on expenses and reduce debt.  </p><p>Financial planning includes: Managing your income to meet your current as well as future needs, such as your retirement or your children’s education; Managing exposure to unforeseen events like pre-mature death, illness or disability; Managing savings and investments to meet your financial goals. </p><p>Setting up a budget is a good way to start taking control of your financial situation because it helps you to: Live with your financial means, and meet expenses; Track spending, in order to meet both your long-term and short-term goals; Control your money, so that it does not end up controlling you.</p><p>The concept of money comes with a lot of associated feelings. Too little money can make you miserable. Too much money can also make you miserable. Managing money means knowing how to: Make and earn money; Hang on to it once you have it; Spend it; Invest it; Enjoy it in our golden years.<br></p><p>In this module, we will cover essential money management skills such as setting financial goals, preparing a budget, Paying Yourself First (Saving a portion of your income the moment you receive it), assessing your expenses, stretching your dollar and debt management. We will also cover important topics such as the Power of Compounding Interest and Consumer Debt. Take this module as a step towards financial wellness.</p><p>Browse through the text content in the lectures and download the supplementary materials for additional learning. This course will take your about an hour to complete.<br></p>", 
    "end_date": null, 
    "title": "Making Sense Of Your Personal Finances", 
    "price": 0, 
    "instructors": "Ferris Wee, Peggy Chan, Institute for Financial Literacy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44784_9059_9.jpg", 
    "course_url": "https://www.udemy.com/making-sense-of-your-money/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-05T02:42:30Z"
}