{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Many people borrow money at certain points in their lives, usually when their savings are not enough to pay for “big-ticket” items such as a HDB flat or a car. In such cases, borrowing money to buy important items like a home may be necessary. </p><p>Borrowing is also a major responsibility as too much debt can easily get us in trouble. The number of persons seeking counselling for debt issues is already increasing every year, and credit card debt in Singapore is one of the fastest growing forms of debt which has grown at an average rate of 11.5% a year (Credit Bureau Report 2011).</p><p>Learn about how to avoid the debt trap. If you are already in debt, find out all your available options:</p>    <ul>  \t<li>What to do immediately when you are in debt?</li>  \t<li>How can you reduce your credit card debt?</li>  \t<li>Working out your financial ratios.</li>  \t<li>Do's and Don'ts when you are in debt.</li>  \t<li>Bankruptcy as a last resort.</li>  \t<li>Find out the best way to borrow money legally.</li>  </ul>  <p>Learn how to work out your own financial ratios to see if you are borrowing to much. Learn how to reduce your credit card debt and calculate how much debt you can actually afford.</p><p>Find out what you can do if you are already in debt in order to choose the best possible option. Also, learn how to borrow money effectively and wisely. Handle your credit card statements well.</p><p><br></p>", 
    "end_date": null, 
    "title": "Managing Debt", 
    "price": 0, 
    "instructors": "Peggy Chan, Institute for Financial Literacy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63535_5912_3.jpg", 
    "course_url": "https://www.udemy.com/managing-debt/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-03T01:45:50Z"
}