{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>El presente curso está diseñado para personas de cualquier edad, con poco o ningún conocimiento sobre Finanzas Personales, ni Excel 2013. Todos los días se toman decisiones sobre cómo manejar el dinero, no siempre son las mejores, alejándonos cada día más de nuestra independencia financiera. Tampoco es necesario manejar importantes sumas de dinero, al contrario, si es una cantidad discreta, es más fácil administrarlo y establecer las bases para que tus ingresos siempre estén en aumento.</p><p>Por su parte, la presente era digital nos ofrece numerosas herramientas que nos facilitan la toma de decisiones en nuestra vida diaria. Por su parte, el paquete Microsoft Office es el más utilizado en el mundo y su herramienta Excel facilita el análisis de información para la toma de decisiones, no sólo de nuestro dinero, sino de cualquier proyecto que requiera el manejo y cálculo de datos.</p><p>El curso está diseñado para instruir sobre Finanzas Personales y también sobre Excel 2013. ¡Es un curso dos en uno! Ambos temas serán abordados a un nivel básico, sin profundizar en conceptos avanzados sobre Finanzas ni programar en Excel 2013. Por su parte, como es característico de la época actual, todos tenemos múltiples roles que cumplir, por lo que el curso tiene una duración de 100 minutos, de manera que no hay excusa para dejar pasar esta gran oportunidad.</p><p>La estructura del curso se presenta en 7 bloques con un total de 12 capítulos. Después de una breve introducción, es necesario identificar la situación actual de tus finanzas, sólo así se podrán trazar algunos cambios a implementar en el manejo de tu dinero. En el tercer bloque, se inicia el aprendizaje de Excel 2013, para después diseñar una estrategia financiera, con la información de los dos bloques previos.  El siguiente bloque está dedicado al manejo de las tarjetas de crédito, para después dedicar algunos minutos a considerar algunas opciones para incrementar tus ingresos, y finalizar con las conclusiones.</p><p>Esta es una excelente oportunidad para aprender dos temas en uno: optimizar el manejo de tu dinero mientras aprendes Excel 2013 ¡No te la pierdas! ¡Te espero!</p>", 
    "end_date": null, 
    "title": "Maneja tus Finanzas Personales mientras aprendes Excel 2013", 
    "price": "20.00", 
    "instructors": "Silvia Marinho", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416694_d0df_3.jpg", 
    "course_url": "https://www.udemy.com/maneja-tus-finanzas-personales-mientras-aprendes-excel-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T19:20:00Z"
}