{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn the basic factors that determine how much you pay in taxes and common strategies to save hundreds or thousands of dollars a year.</p><p><strong>Learn to Save Thousands in Taxes with this 1 Hour Course</strong><strong></strong></p><ul><li>Demystify Tax Rates and Brackets</li><li>Master Timing and Deductions</li><li>Decode Common Tax Forms</li><li>Harness The Biggest Tax Breaks</li></ul><p><strong>Go Beyond Tax Software and Master Your Taxes</strong><strong></strong></p><p>If you make money, you probably pay taxes. And if you pay taxes, there are things you could be doing to reduce the amount you pay.</p><p>But they’re not always obvious, and by the time you’re filling out forms in your tax software, it may be too late to maximize your savings.</p><p>Understanding the basics of how taxes are computed and what you can do to reduce your taxes throughout the year can pay off in the form of hundreds or thousands of dollars in savings each year.</p><p><strong>Course Overview</strong></p><p>For almost 25 years, we’ve produced a nationally syndicated consumer finance news segment called Money Talks with Stacy Johnson, garnering 2 Emmy’s for our reporting in the process and helping millions of viewers around the country save more and spend less. But there are some topics that can’t be tackled in a minute and a half news story. Reducing your taxes is one of those topics.</p><p>So we created this course, an enjoyable 1 hour video series that will take you from tax novice to tax master. You’ll learn the same strategies that tax pro’s advise their clients, simple and effective ways to reduce your tax bill every year, as well as some of the best tax breaks available to filers.</p><p>You’ll also learn some of the fundamentals of taxes, why you pay what you do, what income is and is not taxable, how to read a few of the most common tax forms, and when and where to go for more help if needed.</p><p>Your host, Stacy Johnson, has earned a CPA (now inactive) and held licenses in stocks, commodities, options principal, mutual funds, life insurance, securities supervisor, and real estate. After a 10 year stint working for Wall Street, he left behind a lofty salary to start Money Talks with Stacy Johnson, the longest-running syndicated consumer finance news segment on television today, in an effort to help as many people as possible learn to master their money, get out of debt, avoid scams and rip offs, and save for the future. </p><p>Since then, he’s authored 2 books, written and presented more than 3,000 personal finance news stories for the newscasts of NBC, CBS, ABC, and FOX affiliates nationwide, and speaks to audiences around the country about fiscal responsibility.</p><p>By the time you’re finished with this course, you’re going to feel a lot more confident filing your taxes. You’ll understand how your tax software arrived at its calculations, and you’ll know that you’ve done far more than the average filer to reduce the amount you pay. And best of all, you’ll be empowered to save money every year you have an income.</p>", 
    "end_date": null, 
    "title": "Mastering Taxes: Slash Your Taxes and Have Fun Doing It!", 
    "price": "25.00", 
    "instructors": "Stacy Johnson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641132_e6f1.jpg", 
    "course_url": "https://www.udemy.com/mastering-taxes/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T07:25:12Z"
}