{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Get it while you can at this Introductory Price!  Price will increase to $99 on September 1, 2015</strong></p><p><strong>COURSE UPDATED AS OF AUGUST 2015</strong></p><p><strong>Join the over 1000 students who are learning how to stop letting their money control them!</strong></p><p><strong>INCLUDED IN THIS COURSE:</strong></p><p>-Over 1 Hour of jam-packed personal instruction</p><p>-Direct access to your instructor for additional tailored direction</p><p>-Access to Free Expansion Lectures</p><p>-Fully functioning Budgeting Spreadsheet available for Numbers as well as Excel</p><p>-Lifetime Access</p><p>-No Risk! 30-Money back guarantee </p><p><em><strong>Take Hold of Your Life…and Your Money!</strong></em></p><p><strong>WHY HAVE A BUDGET?</strong></p><ul><li>Only one in three Americans actually prepare a detailed household budget. Yet more than 40 million American families can't afford their homes.*</li></ul><ul><li>Assurance in knowing that you will have enough money to pay bills</li></ul><ul><li>Peace of Mind that the money will be there when you need it</li></ul><ul><li><em><strong>Confidence that you will be saving money</strong></em> by budgeting the right way</li></ul><ul><li>Reduce the stress and fear by gaining control of your financial situation</li></ul><ul><li>In the first quarter of 2015, 15.8% of Americans reported that in the last year they had struggled to <em><strong>afford food for themselves or their families</strong></em>.* Taking a look at your lifestyle and life-needs can help you to never have a fear like this one.</li></ul><span></span><p><em><strong>TAKE THE GUESS-WORK OUT OF MONEY MANAGEMENT</strong> </em></p><p><strong>WHY THIS COURSE?</strong></p><ul><li>No need to go hunting for something that may or may not fit you needs. This course comes with a full and <em><strong>adaptable budgeting spreadsheet</strong></em>. No learning curve needed.</li></ul><ul><li>You are taken step-by-step through the completion of your budget so you know you've done it…and done it right.</li></ul><ul><li>You are given guides for determining the correct amounts for life expenses like food, gas and even savings.</li></ul><ul><li>Plugging numbers into a spreadsheet and hoping they will work is no way to manage your money. - I show you how to determine if your budget will work of your household and make changes on the fly should something unexpected happen.</li></ul><ul><li>Included in this course are tools and tips for tracking your money on a daily basis - giving you peace of mind that your money will be there when you need it most.</li></ul><span></span><ul><li>Reducing costs and how to utilize the #1 Way to Reduce Debt are just two of the hidden treasures of this course.</li></ul><span></span><p><em>My family and I where able to reduce thousands of dollars in debt by using the <strong>#1 Way to Reduce Debt!</strong></em></p><p><strong>WHAT MIGHT BE STANDING IN YOUR WAY</strong></p><p>COST</p><p>-Yes. There is a cost to this course. But there is something to remember about money. Sometimes we have to spend some to save some. <em><strong>Consider this an investment in your future.</strong></em></p><p>TIME</p><p>-There isn't enough time in the day to do all that we want. With this course brings over 1 hour of instruction that is broken up into 13 bitesized lectures with the longest being just over 11 minutes. That means you can <em><strong>fit some in on your coffee break each day</strong></em>. </p><p>METHOD OF TEACHING</p><p>Learning online is something that works for some and not for others. While this course is geared towards those comfortable engaging online, there are several things within this course to ease the mind of the apprehensive.</p><p>One of which being <em><strong>24 hour direct access to your instructor</strong></em> - you can get tailored direction to help overcome the hurdles you may be facing. </p><p><strong>IT'S TIME TO GIVE YOUR FAMILY THE SECURITY THEY'VE ALWAYS DREAMT OF!!</strong></p><p><strong>Enroll Today!</strong></p>", 
    "end_date": null, 
    "title": "Master Personal Budgeting in Just 1 Hour!", 
    "price": "20.00", 
    "instructors": "Laura Hix", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542486_653b.jpg", 
    "course_url": "https://www.udemy.com/master-personal-budgeting-just-1-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T19:38:33Z"
}