{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t        Learn the tools to change your financial situation and the life practices that will create greater happiness and gratitude in your life.  </p>  <p>  \t<strong style=\"\">Prosperity Consciousness is a powerful energy that exists inside you that, once you choose to unleash, can create unlimited possibility, maximise your wealth, and totally transform your life.</strong>  </p>  <p>  \t        This is what can create a wealthy and happy life rather than one of frustration and lack.  </p>  <p>  \t        This easy-to-follow course contains the keys to generating true wealth; tools you can use to free yourself from limiting beliefs about money and simple tips on how to expand your wealth and prosperity consciousness. These tools will be with you for the rest of your life.  </p>  <p>  \t<strong style=\"\">During this course you will discover:</strong>  </p>  <p>  \t        1. What needs to change for you to maximize your wealth  </p>  <p>  \t        2. How to shift your focus from Scarcity to Prosperity and wealth generation  </p>  <p>  \t        3. How to receive money in a totally different way that generates wealth  </p>  <p>  \t        4. How to transform your relationship with money  </p>  <p>  \t        5. How to cultivate curiosity that opens up wealth possibilities you have been refusing to acknowledge  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">Life Changing Practices to Maximize your Wealth</strong>  </p>  <p>  \t        The extraordinary tools, practices and insights contained in this course will facilitate expansion of your prosperity consciousness and set in motion a whole new way of being and living with awareness and with money and wealth.  </p>  <p>  \t        The aim of this &#039;Maximizing Wealth&#039; course is to help you awaken and unleash the power of consciousness over money. Along the way, this course will assist you to explore how and why you diminish your prosperity consciousness, so that you can understand, and then let go of, the lies that keep you trapped in a scarcity paradigm.  </p>  <p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p>  \t    Suitable for those who want a different way of being with money and wealth, through this course of 21 lectures, you will learn how to expand your consciousness around money and change your points of view so you can start to generate wealth dynamically. Starting with exploring what points of view you have that are sabotaging your prosperity, the course moves on to how to fine tune your willingness to receive wealth, using the secrets of generosity of spirit and gratitude, and the power of curiosity and being the question for wealth generation.  </p>  <p>  \t    Once these have been practiced with a series of tools and techniques, the course will take you through a series of practical tools to assist in changing your life and finances to one of prosperity.  </p>  <p>  \t    Students completing the course will have the knowledge and insights to change their financial reality.  </p>  <p>  \t    Complete with quizzes and extra materials, you will be able to work alongside the authors to explore and change your points of view about wealth, money and prosperity so that this reality can start to work for you.  </p>", 
    "end_date": null, 
    "title": "Maximizing Wealth - Prosperity Consciousness", 
    "price": "50.00", 
    "instructors": "Chutisa Bowman, Steven Bowman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378340_4db3_2.jpg", 
    "course_url": "https://www.udemy.com/maximizing-wealth-prosperity-consciousness/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T03:12:38Z"
}