{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled 'Mind Power- Attract Money Using Mind Power Techniques' By Pradeep Aggarwal , you will learn -</p><p>In this course you will learn how to make more money in your life and have a positive attitude using visualization and mind power techniques.</p><p><span></span></p><p>The exercises in this course are designed to make you aware of the possibilities for increasing your assets in the near future. You will start seeing various ideas for making more money.</p>Whatever you want in your life – a better job, a larger business, or whatever; these techniques will help you focus on your goal. <br><p><span></span></p><p>These exercises are designed to give you the experience of being in control of wherever you are. You will feel the energy radiating all around you, making you stronger.</p><p>It is ideal for people who are facing financial issues and money crunch problems and are unable to come out of the circle of money problems because of negative thoughts, negative energy and the inability to find the solution to their money problems</p><p>By taking up this course you will be able to feel more relaxed , confident and positive about your future and be able to overcome your money problems and attract more money.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.<br></p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 8 lectures in English and bonus E-book.</p>", 
    "end_date": null, 
    "title": "Mind Power: Attract Abundance Using Mind Power Techniques", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/668586_edd4_2.jpg", 
    "course_url": "https://www.udemy.com/attractabundance/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-13T08:09:17Z"
}