{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<strong></strong><p><strong>ماذا قالوا عن الكورس؟</strong></p><p><strong>كورس مفيد و أكثر من رائع</strong></p><p>لقد سبق لي الشراء من علي النت و كنت اعتقد انى اعلم كل شيء و عند سماع هذا الكورس تبين لي كم من المعلومات التي تسهل عملية الشراء و تأمنه. فعلا كورس مفيد و يستحق حضوره اكثر من مرة</p><p> <strong>أ.د.هيثم أحمد سامي</strong> - أستاذ مساعد الأشعة - جامعة أسيوط<strong></strong></p><strong>الموضوع قيم جدا جدا</strong> <div><span style=\"\"><br></span><div>فى البداية كنت فاكرة هيتكلم مجرد بس عن المواقع او طرق الشراء الموضوع كان اشمل جدا جدا وكان نظامى بطريقة احترافية</div><p><strong>مينا</strong><br></p><div><span style=\"\"><br></span><p><strong>Amazing course</strong></p><p>The content is very simple and comprehensive, so anyone can understand it easly. The production quality is perfect and exceed my expectations the instructor can delivee the information by a very interesting way and show examples for every thing.</p><p>- <strong>David</strong></p><p>==========<br></p><ul><li>سمعت كتير عن الأسواق الإلكترونية اللي تقدر من خلالها تشتري اونلاين و نفسك تجربها؟</li><li>مش عارف المواقع دي إزاي بتشتغل و محتار تستعملها إزاي؟</li><li>خايف تشتري منها علشان محدش ينصب عليك أو تضيع عليك فلوسك؟</li><li>حاسس أنك بتدفع ثمن أعلي في مشترواتك و نفسك توفر فلوسك و تشتري بأحسن الأسعار؟</li></ul><p>كل ده و أكثر هتقدر تتعلمه من خلال الكورس\" إزاي تشتري أي حاجة أونلاين بأحسن الأسعار و بأمان تام\"</p><p><strong>هتتعلم أيه في الكورس؟</strong></p><ul><li>هتتعرف علي أحسن المواقع اللي ممكن تشتري منها و كمان أيه مميزات كل موقع منها.</li><li>هتتعلم إزاي تقدر تشتري بأحسن الأسعار و إمتي تشتري و إمتي تنتظر و تأجل قرار الشراء</li><li>هتعرف طرق بسيطة و عملية علشان تضمن حقك و جودة المشتروات</li><li>كمان هتعرف تتصرف إزاي لو اشتريت حاجة و طلع فيها مشكلة أو عيب و محتاج ترجعها.</li><li>كل ده و أكثر من خلال كورس عملي و شرح مبسط يقدر أي حد يفهمه و ينفذه بدون خبرة تقنية أو مهارات خاصة.</li></ul><p><strong>الكورس ده مناسب لمين؟</strong></p><ul><li>لأي حد بيحب يشتري منتجاته أونلاين و بيحتار يعمل كده أزاي بطريقة صحيحة</li><li>لكل واحد نفسه يوفر فلوسه و يشتري إحتياجاته بطريقة أسهل و أوفر</li><li>لكل واحد مش عاوز يضيع وقته في اللف علي المحلات و زحمة المواصلات</li></ul><p><strong>في إنتظارك داخل الكورس و أوعدك أنك هتستمتع و تستفيد منه و توفر فلوس كتير كمان!</strong><br></p></div></div>", 
    "end_date": null, 
    "title": "Online Shopping Secrets  أسرار التسوق أونلاين بأمان", 
    "price": "20.00", 
    "instructors": "Mamdouh Ezz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/675436_2309.jpg", 
    "course_url": "https://www.udemy.com/online-shopping-secrets-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-20T08:25:19Z"
}