{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">&quot;No matter what your current financial situation is, you can find a way out of it. However, you will only be able to do so, not by luck, but by thinking and then acting in very specific ways.&quot;</em></strong></p>    <p style=\"\">We have all been in situations when we might not have had any money, or been seriously in debt.<span style=\"\">&nbsp; I know I certainly have, and it&#039;s really a challenge to get yourself over that hurdle, because if it&#039;s constantly in the back of your mind that you&#039;re overdrawn or you can&#039;t afford this or can&#039;t afford to eat, then it is incredibly difficult to get out of that mindset.&nbsp; </span></p>    <p style=\"\">Well, in this course I am going to share with you a few little tips and techniques that I personally use, and also help other people use, to soften the blow a little bit and also to help you re-orientate your mindset around thinking about wealth and abundance…rather than about the lack of money you have.</p>    <p style=\"\"><strong style=\"\">In order to help you to achieve this I have broken the process down into eight, easy to apply steps.</strong></p>  There is one very important thing you need to remember as you go through each step. Just because they may seem relatively simple, or even obvious, don’t let that detract from what you are here for...&lt;/p&gt;    <p style=\"\"> See you on the course...</p>    <p style=\"\">To Our Success!</p>    <p style=\"\">Gary Vurnum</p>", 
    "end_date": null, 
    "title": "Out Of Debt, Out Of Mind", 
    "price": "20.00", 
    "instructors": "Gary Vurnum", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/68470_5028_6.jpg", 
    "course_url": "https://www.udemy.com/outofdebt/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-23T08:45:45Z"
}