{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you've ever wanted to earn more than the interest rates on your savings account, everybody knows that means investing wisely. Whether stocks, collectibles, real estate, or any other investment option - we all know how overwhelming it can be to try to understand everything you need to know to get started without putting your financial future at risk.</p><p>In this course you will learn a fast and easy way to put your money to work with a low level of risk and a high return on investment.</p><p>In this course you will learn:</p><ul style=\"\"><li>The basics of Peer-to-Peer Lending: Helping your community while earning passive income.</li></ul><ul style=\"\"><li>How to set up your accounts.</li></ul><ul style=\"\"><li>How to find borrowers with the lowest risk.</li></ul><ul style=\"\"><li>How to diversify your account to guarantee positive income.</li></ul><ul style=\"\"><li>How to buy and sell on the secondary market.</li></ul><ul style=\"\"><li>How to set up a system that automatically invests according to your own preferences.</li></ul><ul style=\"\"><li>How to increase your return by compounding interest and reinvesting.</li></ul><ul style=\"\"><li>And much, much more...</li></ul><p>Get started putting your money to work for you. Sign up for this course today, and learn the simple skills to earn passive income, so that your money can grow and give you the freedom you want.</p><p>Sign up Today!</p>", 
    "end_date": null, 
    "title": "Peer-to-Peer Lending Basics: Investing for Passive Income", 
    "price": "30.00", 
    "instructors": "Wes Lucus", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430424_8ad8_4.jpg", 
    "course_url": "https://www.udemy.com/social-lending/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T22:54:16Z"
}