{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Do you want to learn how to master your financial destiny and finally take control of debt, money, budgeting and investing? </strong>You are in the right place because this <strong>F</strong><strong>ree online course</strong> by Louise Anne Maurice of Womanly Wealth Academy was created for you.  <strong>   </strong></p><p><strong>Personal Finance Mastery: Debt Money Budgeting and Investing is for you if:</strong></p>  <ul><li>You want to learn how to get out of debt</li><li>You want to learn how to make money</li><li>You want to start and stick with a budget</li><li>You are a first-time investor</li></ul><p>***************************************************************************************************************</p>        <p><strong>Why take </strong><strong>Personal Finance Mastery: Debt Money Budgeting and Investing?</strong><br></p>  Take the guess-work out of personal finance and learn how to manage your debt, make more money, budget and begin to invest.  <p>Today you will feel more confident about your personal finances.  </p>  <p>Tomorrow you will get into action because the course will give you an incentive for applying what you learned.</p>  <p>Next week things start to happen because you have a plan in the right order that guides you step-by-step.</p>      Discover how simple financial planning can be!  Take this free personal finance course and let 2016 be your best year.      <p><strong>What is covered in Personal Finance Mastery: Debt Money Budgeting and Investing?</strong></p>  <li>Become an empowered confident financial planner for your own personal finances</li><li>Discover the key to finally becoming the master of your debt free destiny.</li><li>Walk away with strategies that you can implement starting today that's going to help you get out of debt and keep you out of debt.</li><li>Learn how to make money so that you never have to worry about losing your job or your business being downsized.</li><li>Get easy ways to make money and even ways to make money fast.</li><li>Become skilled at creating a budget, working with budget calculators and budgeting worksheets you'll follow as well as budgeting tips and tools that you can use every day.</li><li>Feel comfortable with money and the thought of investing your money.</li><li>Become a confident investor and discover how to invest in stocks, how to invest money and investment strategies so you can start investing now.</li><li>Develop a financial planning strategy for life</li><p>*****************************************************************************************************************</p>                    <p><strong>How will </strong><strong>Personal Finance Mastery: Debt Money Budgeting and Investing</strong><strong> Benefit You?</strong></p>  <p>I know you are busy and I have meticulously created this course with your success in mind. This training is no-fluff essential information you need to succeed easily and quickly.</p>  <p>Let me show you exactly how to succeed by giving you a personal finance plan like no other.  </p>  <p>You get insights and step-by-step instruction that show you how to succeed and move past limitations.  </p>  <p>You get the inside track on what you need to do plus the exact plan to make it happen in the right order.</p>  <p>If that's something you would like to achieve, you have selected the right course to take. If you complete this entire course and implement everything you learn you will have a good solid foundation to build upon.</p>  <p>Remember, it doesn't matter what stage you are at, I can show you how to make it happen.</p>  <p><strong>When Can You Take </strong><strong>Personal Finance Mastery: Debt Money Budgeting and Investing</strong><strong>?</strong><strong></strong></p>  <p>What are you waiting for? If you’re looking for a course to show you how to finally take control of your financial future, then look no further.</p>  <p>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</p>  <p>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; NO EXTRA COST TO YOU.</p>  <p>Click on the <strong>\"Start Learning Now\"</strong> button and start learning instantly</p><p>*****************************************************************************************************************</p>", 
    "end_date": null, 
    "title": "Personal Finance Mastery: Debt Budgeting and Investing", 
    "price": 0, 
    "instructors": "Womanly Wealth Academy, Louise Anne Maurice", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/435902_7d40_9.jpg", 
    "course_url": "https://www.udemy.com/personal-finance-mastery-debt-money-budgeting-and-investing/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-01T20:52:45Z"
}