{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t               This course is designed to help anyone get a better grasp on their personal finances by building a budget and a personal balance sheet, or net worth statement.  </p>  <p>  \t          As an engineer, I&#039;m constantly trying to build systems to automate repetitive tasks, and always trying to make things easier, more efficient and more effective.  </p>  <p>  \t          I&#039;ve tried several methods for budgeting, from manually tracking all my spending and filling out worksheets each month, to complicated software that never quite works the way I want it to, and I always quit after a short time out of frustration - so I built my own.  </p>  <p>  \t          I think I have a system that&#039;s very simple and intuitive, with a lot of useful effort-free features, and most importantly, it&#039;s easy to stick to.  </p>  <p>  \t            We&#039;ll go step by step through the system, which is basically a couple of simple Microsoft Excel spreadsheets, and I&#039;ll show you how to customize it for yourself.  Along the way, we&#039;ll talk about all of the important financial principals behind it like fixed vs. variable expenses, liquid and illiquid assets, and how to set up an emergency fund with your savings.  </p>  <p>  \t       Once you&#039;re set up (some short videos and just a little bit of homework), here&#039;s what you should have:  </p>  <p>  \t          A complete picture of your personal finances, including:  </p>  <ul>  \t<li>How much you spend each week and each month, broken down into the categories you care about most.</li>  \t<li>A budget based on your real spending, where you can see the current picture and set goals for the future.</li>  \t<li>A net worth statement, showing everything you own vs. what you owe.</li>  </ul>  <p>  \t          You will be able to easily:  </p>  <ul>  \t<li>View automatically updated graphs of your spending over the last year.</li>  \t<li>Fine tune goals for your budget, track your progress and watch your success translate into a higher net worth.</li>  \t<li>Perform what-if scenarios that help you to make better financial decisions.  For example:  \t<ul>  \t\t<li>Should you buy or lease that car (and how much should you pay)?</li>  \t\t<li>Should you rent an apartment or buy a house?</li>  \t\t<li>Can you afford an extra vacation if you cut back on going to the movies?</li>  \t</ul>  \t</li>  </ul>  <p>  \t          You&#039;ll see instant improvements in your financial well being:  </p>  <ul>  \t<li>Reduce your &quot;waste&quot; spending</li>  \t<li>Less worrying each month about forgetting bills, or not being able to pay them</li>  \t<li>Be prepared for making investments, applying for loans and credit without digging through years worth of receipts</li>  </ul>  <p>  \t          Hopefully this course will be like <strong>giving yourself a raise</strong>.  You&#039;ll be able to take more vacations and use your money the way you want to, without it disappearing under your nose... And your stress level will go way down: you&#039;ll have the piece of mind in knowing where you stand at all times!  </p>", 
    "end_date": null, 
    "title": "Personal Finance Autopilot - Budgeting Made Easy!", 
    "price": "20.00", 
    "instructors": "Bernie Gridley", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/186124_1cb0_5.jpg", 
    "course_url": "https://www.udemy.com/personal-finance-autopilot/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-21T00:15:18Z"
}