{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>This online personal finance course will teach you how to master your money, how to grow your income, reduce your debt, budget the smart way, invest your money, and much more!</strong></p>\n\n<ul><li>Do you need help handling your money?</li><li>Can you imagine a life of financial freedom?</li><li>Do you want to make more money?</li><li>Are you interested in investing but just don’t know where to start?</li><li>Have you struggled with credit card or student loan debt?</li><li>Do you want to own a home?</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you answered yes to any of these questions, you’re in the right place. We know how hard it is to get by in the modern world. We understand your struggles. Heck, we’ve lived them. But we’ve been able to turn it around ourselves, to not just survive but to THRIVE! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Phil paid off over $140,000 in student loan debt </strong>and built a 6-figure side business within 5 years of college graduation. <strong>Mike &amp; Lauren are on the path towards super-early retirement,</strong> are the ultimate personal finance hackers, and are currently traveling the country with their newborn son. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>This isn’t your traditional personal finance course.</strong> We’re not bankers or creditors. We’re not trust fund babies who haven’t worked for themselves. We’re just like you, and that’s what this course is all about. This is a course that teaches normal people like you the skills and knowledge to truly understand how money works. We show you the path towards financial freedom.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This online personal finance course covers all of the following topics: </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong>Understand Your Money</strong></li><li><strong>Budgeting, Savings, Reducing Expenses</strong></li><li><strong>Grow Your Income</strong></li><li><strong>Understanding Credit Cards</strong></li><li><strong>Loans, Debt, Debt Reduction</strong></li><li><strong>Investing 101</strong></li><li><strong>Real Estate, Mortgages, and Other Big Ticket Purchases</strong></li><li><strong>Retirement Basics</strong></li><li><strong>Early Retirement Plan &amp; Financial Freedom</strong></li><li><strong>Taxes</strong></li><li><strong>Love &amp; Money</strong></li><li><strong>Youth &amp; Money</strong></li><li><strong>Psychology &amp; Money<br></strong></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Master your own finances to build wealth for you and your family.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Regardless of what your financial expertise is or how much money you have in your bank account, this in-depth course is designed to provide you with everything you need to take your finances to the next level. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Whether you’re in debt and don’t have a clue where to go from here, or you’re just wondering where to invest your money, you’ll learn the next steps to success. By truly understanding how things like credit, compound interest, taxes, and  investment accounts work, you’ll be in a better position for financial freedom.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>By the end of this course, you’ll have a better grasp of your own finances. You’ll know the next steps towards financial freedom. You’ll know how to save more, spend less, and invest smarter. You’ll be less stressed and happier. That's our goal. <strong>Take the first step to financial success with this amazing personal finance course.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>About the instructors:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Phil Ebiner</strong> started teaching online courses in 2012, and now has over 130,000 happy students on Udemy learning all sorts of things from personal finance and business building to video editing and motion graphics. Phil is passionate about helping people understand their finances and uses tools like video to break down the complexity of these topics.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Mike and Lauren</strong> are personal finance wizards with a YouTube channel geared at helping others tackle their financial problems. Mike and Lauren don’t just talk the talk, but also walk the walk of early retirement and living a financially smart life.</p>", 
    "end_date": null, 
    "title": "Personal Finance Masterclass", 
    "price": "25.00", 
    "instructors": "Phil Ebiner, Michael Moyer", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/787836_9930_3.jpg", 
    "course_url": "https://www.udemy.com/personal-finance-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-09T21:40:20Z"
}