{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Personal finance is the fundamental principle that everyone should learn. However, it is sometimes overlooked by many people despite the fact that money is always a part of everyone&#039;s life. In personal finance, there are four key personal finance principles: 1) wealth creation (how to generate savings), 2) wealth accumulation (what to do with your savings), 3) wealth protection (how to protect your wealth and how to plan for unexpected events), and 4) wealth distribution (how to distribute your wealth after your death. As the name implies, this course is about wealth creation, probably the most critical step in personal finance and the starting point for all subsequent processes.</p><p style=\"\">When we refer to wealth creation, we are talking about personal budgeting and how to manage your income and expenses effectively and hopefully generate positive savings. As this is probably the first time that you think about personal budgeting, this course will outline the four actionable steps in wealth creation: 1) identify what you have, 2) record your revenues and expenses, 3) organize and analyze information, and 4) budget your savings and expenses.</p><p style=\"\">In the early stage of the course, you will learn basic accounting principles and how to identify things that you have such assets and liabilities or even something that you may not be aware of.</p><p style=\"\">In the middle stage, we will talk about types of people and how each type of people earns their income. You will also learn how you should view your revenues and expenses and organize them in the structured and meaningful way.</p><p style=\"\">In the later stage, you will learn special techniques used in personal budgeting and, most importantly, you will be exposed to the personal budgeting framework that you should keep in mind while developing your own budget.</p><p style=\"\">Throughout the course, I will use one of the most powerful personal financial software, out there in the market, You Need a Budget or &quot;YNAB&quot;), to strengthen your understanding of the concepts.</p><p style=\"\">You should be able to develop your own effective personal financial budget after taking this course and, more importantly, you will develop a good personal finance mindset that will pay you dividends for the rest of your life.</p>", 
    "end_date": null, 
    "title": "Personal Finance Volume I: Wealth Creation", 
    "price": "25.00", 
    "instructors": "Pisit Putthacharoenwat", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475198_6f7e_7.jpg", 
    "course_url": "https://www.udemy.com/personal-finance-volume-i-wealth-creation/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-13T18:11:09Z"
}