{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">The Financial Life Hack of Your Dreams</strong>  </p>  <p style=\"\">  \t      Drowning in debt? (Who isn’t, right?) Unfortunately, doing bank heists and selling crystal meth are out as solutions. So how do you do it?  </p>  <p style=\"\">  \t      Join professor Art Carden of Samford University as he presents ways to <strong style=\"\">reign in your out-of-control finances.</strong>  </p>  <p style=\"\">  \t      For starters, he’ll explain <em style=\"\">the magic of compound interest</em>—the crockpot method of turning a pittance into a prodigious pile of cash. He’ll also go over the economics of day-to-day purchase decisions. Like, will you really save money buying those marked down shoes? And do the expenses of running a car in the long run dwarf the killer ‘cash back’ deal you got up front? (And should you even be buying a car in the first place?)  </p>  <p style=\"\">  \tProfessor Carden tells it like it is: how to “do the math” in order to make smarter decisions. And why, if something is too good to be true, you should RUN. He’ll also discuss investing in stocks, bonds, ETF’s and other financial instruments. And, in everyday matters, deciding when to splurge and when to chill.  </p>  <p style=\"\">  \t      Call it common sense economics or personal finance life hacks. Either way, you’ll learn how to corral your own situation from this personal finance ninja.  </p>", 
    "end_date": null, 
    "title": "Personal Finance: Obliterate Debt, Accumulate Wealth", 
    "price": 0, 
    "instructors": "Professor Art Carden", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/257236_111c_3.jpg", 
    "course_url": "https://www.udemy.com/personal-finance-learn-liberty/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-07T19:24:24Z"
}