{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Research shows that 45% of divorces are because of money issues. Even couples who aren't married can be affected by the powerful effect money problems can have on a relationship.  </p>  <p>  \t  Most people were not taught financial literacy in school. Many did not learn how money works from their parents who may not have learned it from theirs.  And yet, this is a topic that affects every single one of us as we have to navigate through a world that’s structured around money.  </p>  <p>  \t        Financial literacy is extremely important if you’re a new couple – or about to become one.  Lack of basic financial knowledge and differences in money beliefs has been noted as one of the top factors in why couples separate or divorce.  </p>  <p>  \t        Couples spend time and money planning where they’ll live, what a wedding would be like, and how they’d like to grow a family.  But they seldom take the time before moving in together to see if they have the same outlook about money.  </p>  <p>  \t        How about you?  </p>  <ul>  \t<p>  \t\t        ·Are you a spender or a saver?  How about your partner?  \t</p>  \t<p>  \t\t        ·Do your jobs have a way of providing for your future?  If not, how will you do it?  \t</p>  \t<p>  \t\t        ·Do you make enough money to support the life style you want?  \t</p>  \t<p>  \t\t        ·Do either of you have debt – credit card, student loans, home, car, money owed to family and friends?  \t</p>  \t<p>  \t\t        ·Do you know how money really grows – in what you own and what you owe?  \t</p>  </ul>  <p>  \t        If you’re not sure about the answers to these questions, this course is for you.  If you want to avoid being a divorce statistic, you might want to check out these lessons - basic financial concepts and an examination about what you both believe about money.  Your beliefs matter more than you might suspect.  Ever wonder why most big lottery winners go bankrupt within 7 years?  Because their beliefs about money weren’t in alignment with the money they had.  </p>  <p>  \t        I’ve called the various subjects ‘Secrets’ because they have not been common knowledge to most of us growing up.  Each section/Secret is presented in four formats so that you can learn and absorb the content in the way you learn best.  </p>  <ul>  \t<p>  \t\t        ·Video  \t</p>  \t<p>  \t\t        ·Audio  \t</p>  \t<p>  \t\t        ·PowerPoint  \t</p>  \t<p>  \t\t        ·Text  \t</p>  </ul>  <p>  \t        The course will take you about two hours of screen time.  You will need more time to do the worksheets which are designed to help you and your partner communicate about your beliefs and the specifics of your finances.  Time is precious for all of us so I did not include homework or quizzes of any kind. These are practical life strategies that you will want to learn and put into practice as you see fit.  I do recommend completing the worksheets and reviewing the materials repeatedly until you have mastered and implemented the lessons.  </p>  <p>  \t        I’m a former high school math teacher who never learned what is contained in this course until I discovered it for myself as a soon to retire adult.  Because I was never taught the basics in school or at home (or taught it to my students), I’ve been passionate about sharing what I’ve learned from some of the best minds any chance I get.  I will be available at least twice a week (probably more) to answer questions you might have as you take the course.  </p>  <p>  \t        Enjoy and congratulations on your new relationship!  </p>", 
    "end_date": null, 
    "title": "Personal Finance 101 for New Couples Who Don’t Want to Split", 
    "price": "30.00", 
    "instructors": "Marianne Douglas", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/179220_c0a4_8.jpg", 
    "course_url": "https://www.udemy.com/finances-for-new-couples/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-09T02:04:10Z"
}