{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t            This course should be used as a first step in your personal budgeting journey, and will teach you how to effectively collect and interpret information to create a personal budget in order to understand your spending habits. This course was co-written and developed by a Certified Public Accountant (CPA) and a data analyst, and as a result, we have combined our interests in finances and data analytics to provide you with the tools and techniques to simply analyze your own financial position.  </p>  <p style=\"\">  \t            This course is taught in three main sections, which answer the following questions:  </p>  <ul style=\"\">  \t<li style=\"\">Why should you budget today?</li>  \t<li style=\"\">How do you create, collect information for, and interpret your budget?</li>  \t<li style=\"\">What is net worth, why does it matter, and how do I calculate it?</li>  </ul>  <p style=\"\">  \t            By enrolling in this course, you will gain the ability to analyze your spending and savings habits, and even pinpoint which areas you need to cut back.  You will also understanding new financial tools to better manage your finances.  </p>  <p style=\"\">  \t            This course includes a downloadable PowerPoint version of the lecture, as well as a personal budget Excel template created by the course author for student use during and after the class.  </p>", 
    "end_date": null, 
    "title": "Personal Budgeting Made Easy", 
    "price": "20.00", 
    "instructors": "Myke Garrity", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382658_48f1_2.jpg", 
    "course_url": "https://www.udemy.com/personal-budgeting-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T02:26:12Z"
}