{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course covers all the important topics about money. Are you in debt? Have you ever considered purchasing a vehicle or even a house? Do you know how to buy the right health insurance policy? Do you have an emergency fund? Do you want to build your credit? Do you know how to file your taxes properly (and for free)? Have you considered investing in the stock market or building your retirement fund properly? All of these questions are answered in-depth in this great new course on personal finances!!!</p><p><strong>Let Your Money Work For You! Join This Course Today!</strong></p><p>This course will teach you more secrets that many financial advisers avoid. For example, you might want to consider purchasing health insurance and getting the right policy. But which policy do you get? Do you pay a large premium and a low deductible or a high deductible and a low premium? Should you get catastrophic health insurance? These are questions that everyone needs to consider so that they can not only cover themselves in emergency situations, but they can prepare for the future and save the most amount of money. All of these things are covered in this course and much more! See what your missing out on!</p><p><strong>Get Out Of Debt! Invest Your Funds! Build Your Bank Account Back Up! Start Today!</strong></p><p><strong></strong>What are you waiting for? Start your course today and master the art of personal finances with this college course.</p><p><strong></strong></p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Personal Finances: How to Get Out of Debt and Invest Wisely", 
    "price": "20.00", 
    "instructors": "Kody D'Amours", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489258_a797.jpg", 
    "course_url": "https://www.udemy.com/personalfinances/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-29T07:22:48Z"
}