{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\n\t <strong>What is This Course About?:<br>\n\t The course provides young adults with common money matters that they will be encountering in daily life, including a clear picture how to be better prepared.  Each section concludes with quick tips and takeaways which the viewer can put to use.<br>\n\t </strong>\n</p>\n<p>\n\t<strong>Who This Course For:</strong><br>\n\tYoung adults aged 18 to 23.  Its great for college students, kids still living at home, or starting out on their own.\n</p>\n<p>\n\t <strong>How Long Will The Course Take:<br>\n\t The Video portion of the course is just under an hour long.  You will also receive a money skills ebook, which breaks down common money tasks in a step by step manner.  This content may be used as a supplemental reference for your future use.</strong>\n</p>\n<p>\n\t<strong>Instructor Details:<br>\n\t This Course was designed and written  by a Rob McGlynn, a banking and financial professional with extensive experience teaching young adults personal finance stills.  </strong>\n</p>\n<p>\n\t <strong>Heather Linea provides the questions, tips, and discussions for the individual topics. The additional participants are young people from various backgrounds added to the discussions.</strong>\n</p>\n<p>\n\t <strong>What To Expect From This Course:</strong>\n</p>\n<p>\n\t The Course is broken up into 5 sections which are presented by young adults along with the host. The participants discuss common money matters that young people need to be aware of. After each section, quick tips are presented. The questions and tips were pre-written, and the discussions were pre-structured to provide the most relevant situations which young adults encounter.\n</p>\n<p>\n\t <strong>You will see a series of young people discussing common money matters.</strong>\n</p>\n<p>\n\t <strong>What Will You Gain From Taking This Course:</strong>\n</p>\n<ul>\n\t<li>Make smarter financial choices</li>\n\t<li>Avoid credit card &amp; debt problems</li>\n\t<li>Sidestep money disasters that many fall into</li>\n\t<li>Avoid bad contracts, rip-offs, and ID Theft</li>\n\t<li>Stay on top of your bills and cash flow</li>\n\t<li>Be more financially savvy than your peers</li>\n\t<li>Have more options in how you live</li>\n</ul>\n<p>\n\t Why Take This Course?\n</p>\n<p>\n\t    You might end up making the same naive mistakes I've seen so many people make, and end up l<u>iving your life at the mercy of banks and bill collectors…. and a slave to your job until you’re 75 </u>just to stay afloat?\n</p>\n<p>\n\t    Or, instead, <strong><u>do you want to be one of the people who builds an awesome lifestyle, by learning the skills that help you control your own financial future? </u></strong>\n</p>\n<p>\n\t    Unfortunately, I bet no one ever taught you the skills that financially successful people know.\n</p>\n<p>\n\t    You are about to discover how to ….\n</p>\n<p>\n\t <strong> </strong>\n</p>\n<p>\n\t <strong> </strong><br>\n\t    My name is Rob McGlynn, I have been a corporate banker for the past 20 years.  I have my MBA, passed the CPA exam, etc. OK, I admit it, I have a odd passion for finance.   I am tired of seeing companies taking advantage of uninformed young people. I know all their tricks.  So I am revealing the key skills and tips you need to know get the best deals and build a better future for yourself.<br>\n\t<br>\n\t<strong><u>In One Hour, my course will show you how to be Financially Fierce.</u></strong><br>\n\t    Knowledge is power, and<u> I am going to show you how to be financially fierce.</u>\n</p>\n<p>\n\t<strong>Can you handle yourself or are you a pushover?  Maybe you can handle yourself in a street fight, but in today's world, you are far more at risk of getting your butt kicked by a bank, cellular provider, employer, apartment management company, etc. The nasty part is <u>those kind of 'injuries' can take many years to recover from.  </u> You need the financial 'street smarts'  to recognize when you're being financially ripped off (before you sign on the dotted line).</strong>\n</p>", 
    "end_date": null, 
    "title": "Personal Finance Management Skills for Young Adults", 
    "price": "20.00", 
    "instructors": "Rob McGlynn", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25799_7987_5.jpg", 
    "course_url": "https://www.udemy.com/money-management-skills-for-young-adults/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-02T15:47:04Z"
}