{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Scope</strong>  </p>  <p style=\"\">  \t        Learn simple and practical principles that will empower you to save money every year.  You will learn how to:  </p>  <p style=\"\">  \t        1. Identify opportunities where you may save money  </p>  <p style=\"\">  \t        2. Ask the right questions to understand price drivers  </p>  <p style=\"\">  \t        3. Challenge cost, price, fees without fear  </p>  <p style=\"\">  \t        4. Manage a price discussion without jeopardizing relationships  </p>  <p style=\"\">  \t        5. Have fun in the process while keeping more money in your pocket  </p>  <p style=\"\">  \t        Yes, this is negotiation made practical, simple, and effective... Easy!  Years of personal and business experience are summarized in this course to give you the core of money-saving secrets  </p>  <p style=\"\">  \t<strong style=\"\">Who will benefit from this course?</strong>  </p>  <p style=\"\">  \t        If you spend money and are not used to challenge prices, request discounts, or negotiate this course will be beneficial to you.    If you fear asking questions, or being rejected, or believe that some expenses just need to be paid then this course will be beneficial to you.  </p>  <p style=\"\">  \t        Student, professional, salesman, casual shopper, serial shopper, wife, husband...Everyone buys or sells something at some point, low cost items, also more expensive items.  If you practice the principles described in this course, use them gradually and starting with small items, you will soon be prepared to handle bigger opportunities.   You will receive back the cost of the course in savings sooner than you expect.  </p>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Structure and duration</strong>  </p>  <p style=\"\">  \t        The course is delivered in five major sections:  </p>  <p style=\"\">  \t        1. Introduction.  Learn in this section why it is important to know how to manage a price discussion, what are some of the types of opportunities you may encounter, and examples of them.  </p>  <p style=\"\">  \t        2. Steps to a price discussion.  This section covers four simple steps that will help you manage a price discussion.  </p>  <p style=\"\">  \t        3. Principles.  The principles elaborate on the concepts reviewed in the prior section.  These are described individually to gradually build the story and facilitate retention.  </p>  <p style=\"\">  \t        4. Examples.  Several examples are listed to consolidate the principles and describe how you may approach real-life scenarios.  </p>  <p style=\"\">  \t    5. Summary and next steps.  </p>  <p style=\"\">  \t        All course will take approximately two hours.  </p>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Materials and delivery</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>Course is delivered through videos over slides, using visual content (slides) as support to the audio content.  You can easily just listen to and follow the course while you are in the train, car-pooling, plane, bus, or at your leisure in front of your computer.  </p>", 
    "end_date": null, 
    "title": "Practical Ways to Spend Wisely & Increase Savings Each Year", 
    "price": "45.00", 
    "instructors": "Ed Torquemada", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314376_944b_9.jpg", 
    "course_url": "https://www.udemy.com/pratical-ways-to-spend-wisely-and-increase-savings-each-year/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-06T16:02:43Z"
}