{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong>***UPDATED FOR 2016***</strong></p>\n\n<p><em><strong>Now join the exclusive 4,800+ group of students who have changed their financial lives by taking this course to Retire In Your 20s By Getting Paid Monthly!</strong> </em></p>\n\n<p>Do you want to discover proven profitable penny stock trading strategies?</p>\n\n<p>What would you do with an extra $5,000 a day profits?</p>\n\n<p>Would you pay of debts? Fund your retirement account? Put your kids through college debt free?</p>\n\n<p>My name is Mubarak Shah, and in this course with over 20 different video lessons and over 2.5 hours of content, I will spill everything you need to know to earn huge profits trading penny stocks.</p>\n\n<p>How can I claim you will be successful in penny stock trading after taking my course? I myself am a successful Penny Stock Trader and as well as a Teacher.</p>\n\n<p> I am also the founder and owner of InPennyStock, one of the fastest growing educational Penny Stock Trading community sites. </p>\n\n<p>I will teach you everything from the basics to the advanced, and set you up to continue working on improving and perfecting your trading and strategies. </p>\n\n<p>In these videos, I give you surefire proven strategies for trading, and how to become a successful and profitable penny stocks trader.</p>\n\n<p>The profitable patterns that are mentioned in these videos have been successfully duplicated to give you the freedom to easily build a consistent and profitable trading system.</p>\n\n<p>By taking this course you will be able to win more trades and make greater profits - finally taking control of your financial future. Imagine the possibilities of daily profit from mastering penny stock trading! </p>\n\n<p>Do not waste another minute! Get started on your path to a profitable and stress-free penny stock trading lifestyle by signing up for this course NOW.</p>\n\n<p>By taking this course you will acquire a professional trader mindset! Revealed to you will be a set of techniques and tools professionals use in the market every day to create great wealth.</p>\n\n<p>Study and devote time to this course and you will be in an excellent position to profit from the markets and to achieve the financial freedom you desire.</p>", 
    "end_date": null, 
    "title": "Retire In Your 20s-How To Get Paid Monthly With Stocks 2016", 
    "price": "20.00", 
    "instructors": "Mubarak Shah", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440014_4029.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-paid-monthly-with-stocks/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-06T00:20:39Z"
}