{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Upgraded on December 2015. </strong>The content of this course is updated on a regular basis and it is getting better and better each month, growing in value and resources.<br>__________________________________________</p><p>***** <strong>Top 50 Udemy Authors in the Business Finance Industry</strong> - <em>eSkillsToday Award</em> *****</p><p>***** <strong>Ricardo is one of the best Instructors and my favorite when we are talking about Passive Income and Business Development. Hands down.</strong> - <em>Mike Robinson</em> *****</p><p>__________________________________________</p><p><strong>Who is this course for and why you should take it (in 1 minute):</strong></p><p>Hello and welcome to the Course, where I’ll take you through the entire process of thinking on a different new way, the way that rich successful people do, from scratch.  My name is Ricardo Ribeiro and I’m an awarding winning Instructor in the Business Finance Industry, with more than 15 years experience, owner of several successful businesses, with thousands of dollars made on Passive Income, and an enthusiast of Personal &amp; Business Development.</p><p>This certified course is for you that seeks to improve your life. Throughout the course we will cover techniques used by Successful people and professionals in NLP and Coaching throughout the world, and walk you through a step-by-step process for creating new habits in your life while removing others, that you will successfully improve the way you see the world and your relation with money and… I’ll even include a few “secrets of the pros.”</p><p>--------</p><p><strong>Millionaire minds think different, and so will you.</strong></p><p>Do you know why some people are such a success and make such money and you don't? Why everything they touch turn into gold? Why they seem to have born with a lucky star?</p><p>Well, I do. <strong>What I will be telling you on this course will change your life forever</strong>. It is proven that Millionaire Minds think different from others.</p><p><strong>You will learn what is the SECRET of rich people, and how, at the end of this course you can start thinking and being one of them.</strong></p><p>This is the course for you. Do you want to have the ability to create more money in your life? want to improve your life in general and be happier? If you want to change your life for better, start having success and stop counting cents every month, <strong>I will share the secret of rich people, for you to achieve all your goals in life and create wealth</strong>.</p><p>You will have the confidence to launch that business or investment you've always wanted but were afraid, make more money and feel better about yourself and others.</p><p>This course was created using only <strong>the best Coaching and NLP - Neuro-Linguistic Program techniques</strong> that are available, and that is real groundbreaking and helpful to you as you will only learn what it is proven, by the personal development community, to works best. <strong>This means that you will save yourself from long and hard hours taking seminars, courses or reading hundreds of books, like I did.</strong></p><p>You will see <strong>significant improvements on all areas of your life</strong>, health, wealth, career, relations (family and friends), knowledge, love, creativity, travel and personal grow.<strong></strong></p><p><strong>At the end of this Certified Course, you will be able to take control of your life and improve your financial situation in a way that you thought it wasn't possible</strong>. It is structured in the simplest and cleanest way in order to be understandable and to engage you into completing all the self reflexion exercises that are asked.</p><p>You will be provided with <strong>powerful and useful tools, resources and eBooks for achieving your success</strong>, for you to gain conscience of what you are doing wrong and it is keeping you from fulfill your goals, and what you can start doing right now so that you can use all your potential and and achieve success.</p><p>I'm here to help you and I'm available to answer your questions and advice you along the way. Together we can make sure you have great success in your life. </p><p>Thanks for your interest in this course. I put my hearth and soul on everything I do so you have my personal guarantee that you will absolutely love it as the happy students already enrolled, or <strong>you have 30 days money back guaranteed with no questions asked</strong>, so… you have nothing to loose. </p><p>I hope you’re as excited as I am!  If you’re ready to learn more and sign up for the course, <strong>go ahead and hit that Enroll button</strong>, or take a test drive by using the Free Preview feature. See you in the course!</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Rich Mind...Rich Man - Poor Mind...Poor Man. Shift Your Mind", 
    "price": "20.00", 
    "instructors": "Income Mastering Ricardo Ribeiro", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489710_5460_9.jpg", 
    "course_url": "https://www.udemy.com/become-millionaire-achieve-goals-secret-formula/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-29T19:15:37Z"
}