{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>In a few hours, you will learn the stock market basics that will make you a more intelligent beginner investor.</strong><strong> You’ll learn how to invest in the stock market to close the retirement income gap.</strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong>You need to read this course if…</strong>  </p>  <p>  \t    ·You&#039;ve lost money in the stock market.  </p>  <p>  \t    ·You want to learn how to profit from the stock market but you are scared that you will lose all your savings and retirement with ‘risky’ stock market investing.  </p>  <p>  \t    ·You’re sick and tired of the crappy returns you&#039;ve been getting in the stock market and know that there has to be a better way.  </p>  <p>  \t    ·You’re looking for a no-nonsense course with easy to understand explanations on how to make money in stocks.  </p>  <p>  \t    ·You’re worried about running out of money during retirement and want to save more for your retirement future  </p>  <p>  \t    ·You would like to learn how Wall Street really works, so you can join them in making profitable stock investments, because we all know, we can’t beat Wall Street so why not join them and take our share of the pie.  </p>  <p>  \t<br>  \t     Not only will I teach you how to make money in stocks, I will show you how to keep it and become self assured in your ability to choose where to put the money that you work so hard for. <br>  \t     The stock market can be a terrifying place for the beginner investor if they aren&#039;t equipped with the stock market investing basics that are explained in a common sense, step by step process. <br>  \t<br>  \t<strong>My three step process is the beginner’s guide to investing. It will teach you:</strong>  </p>  <p>  \t<strong>1. How to make trading and investing decisions confidently.</strong>  </p>  <p>  \t<br>  \t     Most beginner traders and investors fail because they do not have confidence in their ability to make their own investing decisions. <br>  \t     With a little time and dedication, you can learn to make your own trading decisions successfully and confidently. <br>  </p>  <p>  \t<strong>2. How to find a stock with high profit potential in less than 10 minutes.</strong>  </p>  <p>  \t<br>  \t     You do not have to spend hours studying balance sheets and calculating P/E ratios before you decide whether to buy or sell a stock. <br>  \t     I will show you a simple, effective and repeatable method for picking stocks that fit your risk tolerance and budget as a beginner investor.  </p>  <p>  \t<strong>3. Why most beginner investors fail and how to change that.</strong>  </p>  <p>  \t<br>  \t     It’s not because you’re dumb, it’s because you&#039;ve been missing some very important information. <br>  \t     It’s not your fault that you haven’t had access to stock market investing education geared to beginners; most educators assume that you already have some knowledge of the stock market. <br>  </p>  <p>  \t<strong>Scroll up and click the buy button!</strong>  </p>", 
    "end_date": null, 
    "title": "Saving For Retirement: An Easy Stock Market Investing System", 
    "price": "20.00", 
    "instructors": "Thembi Buthelezi", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341012_d226_2.jpg", 
    "course_url": "https://www.udemy.com/saving-for-retirement-an-easy-stock-market-investing-system/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T01:04:31Z"
}