{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you in your 20's? Do you want to achieve financial independence? How would you like to do the things that matter most to you, yet be rest-assured that you are in good financial shape? If you said \"yes\" to all three questions, then pat yourself on the back and continue!</p>    <p>A good friend of mine once said \"nothing will ruin your 20's more than thinking you should have your life together already.\"</p>    <p>Your 20’s is a time for development. It should be about setting habits and setting a framework that will benefit you through the rest of your life. You may not have it all figured out yet, and that is okay! This course can help you set a trajectory before you reach age 30!</p>    <p>In this program, we will cover a number of “tools” that will help you set yourself up for financial success! We will cover many key pieces of money advice, as well as set a game plan that you can easily apply to your life. This course will provide you with some technical education, but more importantly, it will help you shape your mindset!</p>    <p>Are you past your 30's? No problem! These principles can be applied at any age!</p>    <p>Please follow me on this journey as I share the principles and practices that helped me achieve financial wellness!</p>    <p>Sign up today and take control of your finances! This program comes with a 30 day money back guarantee. Also, once you purchase the program, you will have lifetime access! </p>    <p>Sign up today and take a step toward financial wellness!</p>", 
    "end_date": null, 
    "title": "Setting Yourself Up for Financial Success By Age 30", 
    "price": "30.00", 
    "instructors": "Devin Czech", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398654_3f8d.jpg", 
    "course_url": "https://www.udemy.com/setting-yourself-up-for-financial-success-by-age-30/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T01:04:31Z"
}