{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>****BRAND NEW COURSE JUST LAUNCHED IN NOVEMBER FROM A TOP UDEMY INSTRUCTOR PLUS FEBRUARY 2016 UPDATE****</p><p><strong>The ability to save money is critical as it is the behavior that funds your investments and investments are what fund your biggest goals and dreams. </strong></p><p>Unfortunately, many people do not receive the key educational information and best practices that make the difference between success and failure when it comes to saving money.</p><p><strong>THIS COURSE WILL TEACH YOU BEST PRACTICES IN ORDER TO SAVE A LARGE SUM OF MONEY OVER TIME WITHOUT LIVING LIKE A PAUPER.</strong></p><p><strong>Not boring theory. You will learn practical tips and best practices</strong> from an instructor who started with nothing <em>(</em><em>Actually $10,000 in student loans living in a 1-bedroom apartment above the garbage cans)</em> to building a million dollar investment portfolio. All of it started by using the techniques and best practices shared in this course to become an expert saver of money.</p><p>No get rich quick scheme or a course that is designed to sell you consulting services this course has one mission and that is all about sharing of experience and wisdom so you can personalize your learning and hit your own goals!.<br></p><p><strong>Some of the things you will learn are:</strong></p><ul><li>The SMART Process to saving and prodigious wealth.</li><li>What percentage of income to save to for success.</li><li>Is there such as thing as good debt?</li><li>The proper use of credit cards.</li><li>How to manage small and large purchases to reduce expenses..</li><li>Budgeting tools that work.</li><li>An overview of popular online tools to help you save and manage expenses.</li><li>The importance of automating both your saving and your bill paying.</li><li>The top 5 mistakes that are financial killers and how to avoid them.</li><li>How time and the magic of compounding can help you reach your goals.</li><li>How the instructor uses the principles that you can adapt to your own life.</li><li>Key action steps to take now plus a bonus step to insure success.</li></ul><p><span></span></p><p>Disclaimer Note: This course is for educational and informational purposes only. There will be no recommending of any particular investments such as a particular stock or mutual fund, particularly as this course is focused on saving money and reducing expenses. Consult with a Professional for specific advice. Course is for education purposes only and instructor will have no liability related directly or indirectly to any loss or damage.</p><p><strong>No risk to sign up with the Udemy 30-day money back guarantee</strong> and impact could be life-changing. Learn from my experience and rapidly move ahead faster with the knowledge I will share with you. Don't delay.<br></p><p>Please click the <strong>TAKE THIS COURSE button i</strong>n the upper right corner and let's get started!</p><p>Many thanks and I appreciate your interest and hope to see you in the course!</p><p>-Steve Ballinger</p>", 
    "end_date": null, 
    "title": "Smart Financial Strategies to Hit Goals and Retire Early", 
    "price": "20.00", 
    "instructors": "Steve Ballinger, MBA", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664242_334c_2.jpg", 
    "course_url": "https://www.udemy.com/save-money-big-goals-early-retirement/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T00:27:05Z"
}