{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Hi, my name is Matt Bernstein, successful Udemy instructor with over 45,000+ students across 186 countries. But, I'm going to make the proper assumption that you have no idea who I am.<br></p><p>So listen, I have a booming voice and like to get straight to the point.</p><p>From an investing standpoint, my most successful investments in 2008 were, Google and Apple. In 2012 they were, Facebook, Tesla, and Netflix.</p><p>Now, you’re thinking, “that’s great for you, how am I going to succeed?”</p><p><strong>At the end of the course you'll learn how to…</strong></p><ul><li>Discover and invest in stocks that outperform the DOW and S&amp;P 500. </li><li>Maximize your return on investment.</li><li>Understand the history of the stock market so you will not be doomed to repeat other people's mistakes.</li><li>Decide whether a financial advisor is right for you.</li><li>Think rationally about the stock market and think long term.</li><li>Determine your risk appetite investing in stocks.</li><li>Calculate textbook stock valuations.</li></ul><p><strong>Who should take this course? Who should not?</strong></p><ul><li>Students with full-time incomes, who want to supplement with a portfolio income.</li><li>Students wanting to invest for retirement and maximize their return on investment.</li><li>Students who are saving for their children's college education.</li><li>Students must develop patience and discipline to know that success does not happen overnight, you have to put in the work.</li></ul><p><strong>As a very small token of my appreciation:</strong></p><p>When you scroll down the page, you'll see some lectures are available to watch for free.</p>", 
    "end_date": null, 
    "title": "Stock Market Investing Strategies", 
    "price": "20.00", 
    "instructors": "Matt Bernstein, Skillhance, LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/188058_289a_16.jpg", 
    "course_url": "https://www.udemy.com/investing-fundamentals-how-to-develop-an-investors-mindset/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-24T22:57:27Z"
}