{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Whoever tells you the government is cutting back... THEY&#039;RE WRONG.</p><p style=\"\">In 2015 the U.S. Government will give out an average of $22,996 in free money to each family. That&#039;s an increase from $21,816 in 2014,  In 2016 It is going to increase again to $24,159.   Do this sound like a cut back?????</p><p style=\"\">The government has over 17,000 programs that hand out free money and fee services to people of all incomes and all ages.  Here are some facts about these programs that the average person does not know about:</p><p style=\"\">- Uncle Sam hands out over $1.7 TRILLION PER YEAR per year and spends next to NOTHING ON ADVERTISING to let people know these programs.</p><p style=\"\">-  Only 20% of this money is set aside for low income people. For most programs it does not matter what your income is, they are for people who want to do things or solve problems.<br style=\"\"></p><p style=\"\">           -  Low income programs cover people making up to $44,000 per year.</p><p style=\"\">           -  80% of the free money available is NOT CALLED &quot;GRANTS&quot;.</p><p style=\"\">           -  Most of the free money programs only require a 2-3 page of &quot;fill in the blanks&quot; application.</p><p style=\"\">- The government represents over 35% of our economy and has programs that can help every member of our society no matter what your age, income, or education level.<br style=\"\"></p><p style=\"\">I had a very successful business helping rich people make even more money by taking advantage of these programs.  Now I devote my life to help the average person know about the free money and help that is available to them too.  </p><p style=\"\">After 35 years of studying these programs I&#039;ve developed a course for those who want to  begin learning the system of applying to the 25 BEST FREE MONEY PROGRAMS that America has to offer.</p><p style=\"\">These TOP 25 programs can help the most people of all incomes. These are programs you should know about if you need:</p><p style=\"\">Money And Help For A Business</p><p style=\"\">Money And Help For Paying Bills and Getting Out OF Debt</p><p style=\"\">Money And Help To Buy Or Fix Up A Home</p><p style=\"\">Money And Help For Health Care Issues</p><p style=\"\">Money And Help For Raising Kids or Caring or Caring For Seniors</p><p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p style=\"\"><strong style=\"\">EVERY STUDENT HAS PERSONAL ACCESS TO THE INSTRUCTOR AND HIS RESEARCHERS</strong><br style=\"\"></p><strong style=\"\">As a student you are able to ask instructor as many questions as you want about the details of applying to any government program.  Answers are returned within 48 hours.</strong><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Stop Struggling To Get By: Apply To Top 25 Grant Programs ", 
    "price": "20.00", 
    "instructors": "Matthew Lesko", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473194_d80e_3.jpg", 
    "course_url": "https://www.udemy.com/stop-struggling-to-get-by-apply-to-top-25-grant-programs/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T23:54:06Z"
}