{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Student Review of How to Use Your Health Insurance:</p><p>\n                                        <strong>Good Health Insurance Benefits course</strong>\n                                    </p><p><em><strong>\"A good course in the\n basic terminology and principles needed for those looking to purchase \nhealth insurance in this complicated market. I think the \nbest part of this course is that Dr. Wagner encourages her students to \ncontact her with ANY questions and she promises to get back to them \nwithin 48 hours.  That alone is worth getting this course in my opinion\".</strong></em> Mike Hartman<br></p><p>**************************************************************************************************<br></p><p>How do you use your health insurance benefits?</p><p>Will you get a membership card in the mail?</p><p>How do you know what your out of pocket costs is?</p><p>Do you know the difference between the premium and the deductible?</p><p>Having health insurance for the first time can be confusing if you are not used to having those benefits. Oftentimes when people don't understand something new, they will not use it. This course will educate you on what your benefits are and how to use them. <br></p><p>This course will give you detail explanation of the following topics:</p><ul><li>How having insurance is affecting new consumers who are not used to having insurance</li><li>Medical Insurance Terminology so you understand what the words mean</li><li>Importance of having Health Insurance</li><li>Whether or not you can change your health insurance policy after the enrollment period</li><li>Ways to save money and much more. </li></ul><p>16.4 million people in the United States got health insurance through \nthe individual mandate, Affordable Care Act (aka Obamacare) in 2015. One\n of the biggest problems in 2014 was that people didn't know how to use \nit.<br></p><p>This course is comprised of video, audio and downloadable documents to help you understand the insurance you now possess. </p><p>This course will be of great value not only to people who are newly insured but also those who are seeking to get health insurance if they meet one of the qualifying events to get insurance throughout the year. <br></p><p>  <br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Strategies to Maximize Your Health Insurance Benefits", 
    "price": "20.00", 
    "instructors": "Taffy Wagner", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471162_c5a1_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-your-health-insurance-benefits/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T19:45:38Z"
}