{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Student loan debt is the number one financial issue facing Millennials, and it is a shame that student loan repayment is so confusing. College graduates are just expected to know how repayment works, and who they need to pay. </p>    <p>There are so many different repayment programs that it can make your head spin. And to add insult to injury, many recent college graduates struggle with the ability to pay student loans back. I remember that when I was just out of school, I struggled with repayment up until I found gainful employment. And even when I found gainful employment, I sometimes struggled with the various ins-and-outs of repayment. </p>    <p>Never fear! I have a solution for you, and that is this program. This program is designed to be a “one-stop shop” explanation as to how student loan repayment works, and how the different repayment programs work. </p>    <p>Whether you are a college student, a recent graduate, or a parent of a college student, there is an abundance of valuable information included in this presentation! You will learn how the student loan repayment process works. You will also learn what your options are, whether you have federal student loans or private student loans! </p>    <p>If you are repaying your student loans at this time, or if you will be soon, then this presentation is for you! Consider this to be your guide to the student loan repayment process.</p>    <p>I know exactly how student loans affect people (I have experienced it myself). I have won the battle against student loans, and I can help you win too! Sign up today and take control of your student loans! This program comes with a 30 day money back guarantee. Also, once you purchase the program, you will have lifetime access! </p>    <p>Sign up today and take a step toward financial wellness!</p>", 
    "end_date": null, 
    "title": "Student Loan Repayment Options", 
    "price": "30.00", 
    "instructors": "Devin Czech", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481716_ff41_2.jpg", 
    "course_url": "https://www.udemy.com/student-loan-repayment-options/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T00:46:24Z"
}