{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>College testing costs can really add up, especially since many college-bound teens take and then re-take standardized exams like the SAT or ACT. It's not uncommon for some families to spend hundreds or even thousands of dollars on expensive test-prep courses -- not to mention fees to take the exams and then more fees to send test scores to multiple schools. </p>\n\n<p>This course, Take the SAT or ACT Free!, gives students, parents, high school guidance counselors and others the knowledge they need to put college-bound teens on the right track when it comes to standardized testing for those on a budget. </p>\n\n<p>The course highlights three main strategies that let students take college entrance exams at absolutely no cost. A fourth strategy covers a low-cost approach to taking the SAT or ACT. </p>\n\n<p>Students will find this course loaded with information and practical advice for those who choose to take standardized exams - as well as those who skip such exams. If you opt to take the PSAT, SAT Subject Tests, SAT, ACT or AP exams, you'll learn everything you need to know about picking the best test for you and the eligibility guidelines for taking standardized tests free of charge. Be prepared to discover a slew of money-saving tips for college entrance testing and test prep over a series of 15 lectures, which include 9 videos lasting about one hour, 4 articles and 2 quizzes that test your knowledge of what you've learned.</p>\n\n<p>Best of all, this course reveals key benefits and little-known ways students can take advantage of free testing to get extra perks like free college applications and free tuition. For low-income and middle-income students in particular, this course will save your family thousands or even tens of thousands of dollars on college expenses -- far beyond just the fees you would have paid for SAT or ACT exams. </p>", 
    "end_date": null, 
    "title": "Take the SAT or ACT Free!", 
    "price": "30.00", 
    "instructors": "Lynnette Khalfani-Cox", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/804604_4d9e_2.jpg", 
    "course_url": "https://www.udemy.com/take-the-sat-or-act-free/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-26T18:04:35Z"
}