{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Why should you take this course?</strong></p>  <p>    Entrepreneurs often worry about not having enough money to fund retirement.  In many cases, retirement planning is the last item on a very long to-do list. The lack of security and steady paychecks from regular employment make it all the more important to put a plan in place.  This course is specifically designed to teach entrepreneurs how to use the solo 401(k) to secure their financial future. </p>    <p><strong>You will learn:</strong></p><ul><li>29 lectures and 1.5 hours of content</li><li>How consistently saving money in a solo 401(k) results in hundreds of thousands of dollars for you to enjoy in retirement</li><li>How to reduce your taxes year after year by making contributions as both employer and employee</li><li>A unique way to turbo charge your savings by hiring your spouse</li><li>How to calculate your self-employment taxes-a major step in determining how much you can place in your 401(k) as the employer </li><li>, How to set up a plan </li><li> The fee structure involved when you open and maintain a plan.  You’ll learn what’s reasonable and how to compare fees</li><li>The investment choices offered in many plans</li><li>How your solo 401(k) relates to the stock market</li><li>What you need to know about investment time horizons and your risk tolerance</li><li>Where to open a solo 401(k)</li><li>The rules for loans and how to determine the amount you can borrow</li><li>The rarely known tax penalty for not making distribution on time</li><li>How 401(k)  minimum distributions are made and what happens to your 401(k) in the case of your death</li></ul>                            <p>    This course is designed to give you the confidence you need to manage a solo 401(k).  You’ll experience a classic classroom setting.  The course contains plenty of examples and quizzes to reinforce each concept.  After completing this course, you will gain a “Cradle to Grave” knowledge of these plans—your key to saving thousands of dollars and reducing your taxes.</p>", 
    "end_date": null, 
    "title": "The Ultimate Guide to Solo 401(k)s for Entrepreneurs ", 
    "price": "25.00", 
    "instructors": "Shawn Jones-Oxendine", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673876_f56c.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-guide-to-solo-401ks-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T23:50:00Z"
}