{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>So, you wanna trade Forex?</strong> <strong>Make money and get rich?</strong> All that, of course, from the comfort of your home. Wouldn't that be nice? Just imagine! You wake up in the morning, go to the kitchen, make yourself a cup of coffee, sit in front of your screens and stare at the EURUSD chart trying to get a \"feel\" for which way the market is heading.  You do not have to worry about being late to the office and commuting in that horrendous traffic, changing trains, planes, bicycles and god knows what else just to get to work on time and as cheaply as possible. Thats for losers! You are different...you are a Trader! Equipped with 500 bucks, an MT4 platform, couple of free Forex news sites and the Will to conquer the World, you are well on your way to......NOWHERE!      <br></p><p>This course is not for everyone! This course is for people who want to know how Forex Brokers work against their client's best interests. The course will reveal how Forex Brokers operate and expose the different ways in which that can harm you.  While I will not get into the very basics of explaining what is a pip and what is a currency pair, most of the content is critical for Forex Traders and applicable to newbies and experts alike.<br></p>  <p>  \t                                        - Learn why there are so many Brokers out there and why they are all the same.  </p>  <p>  \t                                        - Learn what Forex Brokers do, to make you lose money even if you have a profitable strategy  </p>  <p>  \t                                        - Learn all the tricks Forex Brokers will employ to get your deposit and make sure you lose it  </p>  <p>  \t                                        - Understand why it is unlikely that you will be able to trade for a living  </p>", 
    "end_date": null, 
    "title": "The Truth About Forex: Forex Brokers and why you will lose!", 
    "price": "20.00", 
    "instructors": "Alex  Davidoff", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/246988_85b3_3.jpg", 
    "course_url": "https://www.udemy.com/forex-trading-the-truth-you-will-never-hear/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-20T08:55:30Z"
}