{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Learn the essential tools you and all high-school students need when starting out on your journey of earning and using money wisely.</span>  </p>  <p style=\"\">  \t<strong style=\"\">Build A Strong Foundation In Understanding The Basics To Earning And Using Money Wisely</strong>  </p>  <ul style=\"\">  \t<li>Find out exactly how much you should save and spend from your income</li>  \t<li>Discover the secrets of how banks work and how to benefit from them</li>  \t<li>Learn the essentials of tax</li>  \t<li>Understand the techniques of how professionals approach money and get rich</li>  \t<li>Find out how to start earning money right away with a job or business</li>  \t<li>Discover the latest ideas in how to use your money to maximise happiness</li>  \t<li>Get free downloadable documents that you can edit right away</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Powerful Money Skills That Every Adult Wishes They Were Taught</strong>  </p>  <p style=\"\">  \tThis course has been designed from the ground up to specifically help high-school students.  Too many people aren't taught personal finance skills and have to learn the hard way - by making mistakes.  Avoid those mistakes and gain important money skills right now.  </p>  <p style=\"\">  \tThis is the first time a course like this has been presented online.  It was designed and taught by James to high-school students around Australia, but now you can join in too using this online course.  This online version has been built based on feedback and lessons from the classroom version, as well as parents all over the world.  </p>  <p style=\"\">  \t<strong style=\"\">Content And Overview</strong>  </p>  <p style=\"\">  \tSuitable for high-school students and adults wanting a skill refresh, this course has 1.5hrs of video divided into 45 lectures.  These are bite-sized lectures that each cover a different skill, and a short quiz follows each one so you can check your understanding.  The course is designed to be done over a few weeks so you can spread out each of the 8 topics rather than do them in one big hit and end up confused.  </p>  <p style=\"\">  \tStarting with teaching you how the professionals think, we then get into the basics of saving and how thinking long-term is the key to success.  We'll teach you the exact amount to save and spend, and the answer is surprising!  </p>  <p style=\"\">  \tOnce these important basics are mastered we then go deeper into understanding how banks work so that you can make them work for you.  Compound interest is the holy grail to getting rich so we make sure you understand why and how.  We'll then cover the art of making a budget and even give you a free template to use yourself.  </p>  <p style=\"\">  \tThe power of advertising is covered so that you understand the tricks used and don't fall victim to spending too much of your money on things you don't need.  </p>  <p style=\"\">  \tAfter this we'll look at how you can actually start earning money right away, because by this stage you'll be super excited to have an income and start growing your tree of wealth.  We'll teach you how to get a job like a pro as well as starting a business so you can make a choice and have options.  You'll also receive a free resume template to help you get started.  </p>  <p style=\"\">  \tIt is vital to understand debt and credit cards before you get trapped by them.  We dedicate a whole topic to this so you have a true understanding and avoid the trap.  But we also teach you when debt can be helpful.  </p>  <p style=\"\">  \tWe'll then cover tax so you aren't surprised by this, and find out what it's used for and the various ways you will have to pay it in your lifetime.  Lastly the final topic teaches the latest research on happiness and using money to maximise this.  </p>  <p style=\"\">  \tIf at any time you have questions during the course the instructor will be monitoring the online discussions to help you out.  At the end of the course you'll receive a verifiable certificate to show the world what a master of personal finance you have become.  </p><p style=\"\">So enrol in this course now to learn the secrets that most adults wish they were taught.</p>", 
    "end_date": null, 
    "title": "The Ultimate Beginners' Guide to Handling Finances", 
    "price": "20.00", 
    "instructors": "James Gutteridge", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348894_e718_2.jpg", 
    "course_url": "https://www.udemy.com/money-wise-students/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T02:07:11Z"
}