{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course &quot;The Financial-Relief Mindset:&nbsp; Rich or Poor -- YOUR Choice!&quot; describes the requisite Mindset for creating Financial ease.&nbsp; It discusses the differences in the attitudes, ideas and actions that comprise an Abundance Mindset from the attitudes, ideas and actions that make up a poverty Mindset.</p><p style=\"\">In addition, this course presents information on the Stress and dis-ease that arise when Financial pressures are active ... and provides practical, workable solutions for how to relieve that stress.&nbsp; PLUS this course provides simple, straight-forward techniques for creating a Positive Mindset of Abundance.</p><p style=\"\">&quot;The Financial-Relief Mindset:&nbsp; Rich or Poor -- YOUR Choice!&quot; is presented in a variety of formats.&nbsp; These include video, audio, quizzes, workbooks, inventories, textbook, and other written resources.&nbsp; Because it is an interactive experience, this course will take as long as YOU dedicate to working with your mind and changing your scripts.&nbsp; That being said, viewing the materials should take 1-2 hours.&nbsp; It is the hope of this instructor that your USE of these materials -- you applying them actively in your life -- will span your lifetime!</p><p style=\"\">Why take this course?&nbsp; You would want to take this course if<br style=\"\"></p><ul style=\"\"><li style=\"\">&nbsp;You are unhappy with the stress that Financial realities are creating in your life</li><li style=\"\">&nbsp;You are serious about reducing stress and pressure</li><li style=\"\">&nbsp;You value simple, practical techniques that allow you to change successfully</li><li style=\"\">&nbsp;You want to have MORE in your life</li><li style=\"\">&nbsp;You know the importance of what you tell yourself ==&gt; self-fulfilling prophecy</li><li style=\"\">&nbsp;You want to know MORE about the ultimate results of what you tell yourself<br style=\"\"></li><li style=\"\">&nbsp;You are tired of financial struggle ... and desire to leave that struggle in the past</li></ul><p style=\"\">If any (or all) of these apply to you, I encourage you to take this course.&nbsp; I further urge you to commit to yourself to USE this course -- to make the material contained herein YOUR OWN.&nbsp; In this way, you increase the probability of embracing Financial abundance and of putting Financial Stress and Pressure firmly OUT of your life.<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "The Financial Relief Mindset: Rich or Poor -- YOUR Choice!", 
    "price": "30.00", 
    "instructors": "Marlene Shiple", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47119_c317_7.jpg", 
    "course_url": "https://www.udemy.com/abundance-mindset-to-relieve-financial-stress/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-23T21:33:10Z"
}