{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p> <strong style=\"\">The Science of Getting Rich </strong>is for all those who want to understand how riches, wealth, money and the acquirement of such material wealth is gained. There are laws which govern these things, and that is what this course covers. It is based on the 1910 book by Wallace D Wattles <em style=\"\">The Science of Getting Rich</em> - and you are given this ebook in lecture one, and we study it together.</p><p> Despite the book initially being written over 100 years ago, the contents of this book have been described as &#039;timeless wisdom&#039; - remember that universal laws e.g. the law of gravity and the laws which govern riches... are ALWAYS TIMELESS. People who take the time to study this material, in prosperity programs such as on this course put themselves ahead of the game because most people think riches happen by &#039;chance&#039; - no, they don&#039;t. You can command wealth. If you apply the steps and ideas outlined in this course, you will with &#039;mathematical certainty&#039; improve your financial situation.</p><p> You don&#039;t need to be a mathematician to do this course, nor have any previous financial experience. The course is for beginners, who are new to the teachings of prosperity, and it&#039;s suitable for those who know a bit, because you can always learn more. Prosperity programs should be repeated. Sometimes (as soon as people start to see the results), they forget and &#039;go back&#039; to doing what they were doing before - you always need to be reminding yourself of the steps and making sure that you are keeping up with the steps.</p><p> The course will take about an hour to complete. Ongoing, the ebook which is (approx 45 pages) should be read regularly - weekly or (better still, daily) as this will reinforce the information to be retained.</p>", 
    "end_date": null, 
    "title": "The Science of Getting Rich", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302494_70ba_4.jpg", 
    "course_url": "https://www.udemy.com/science-of-getting-rich/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:32:13Z"
}