{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course, <strong>I plan to go educate you on every aspect of personal finance, as well as how you can immediately begin saving thousands of dollars every year and feel great about your financial future for the rest of your life</strong>. In case you couldn't tell, finance is incredibly exciting to me, and I hope the knowledge taught in this course will <strong>bring you all of the same success it's brought me, saving nearly $15,000 every year using the knowledge I'll be teaching you</strong><strong>.</strong></p>\n\n<p>Although many courses on here are taught via lecture slides and voice-overs, I personally hated learning that way and found it very hard to focus. I'm not going to just read off a slide while I sit in my underwear, <strong>I'm going to speak directly to you throughout the course in order to keep your attention and have some fun</strong>, in addition to walking you through various programs, easy PowerPoint slides, and processes through live screen recordings, <strong>with nearly 3 hours of engaging, extremely high-quality 1080p HD video content </strong>(filmed on a camera I spent way too much money on, just for this course)<strong>. </strong></p>\n\n<p>You should enroll in my course not only because I've been creating highly in-depth budgets in order to <strong>live a very comfortable lifestyle</strong> for the past 5 years, but because <strong>I will provide you with all of the necessary tools and every ounce of knowledge for you to do the same</strong>. Everything from Excel templates to negotiation tools, I made learning the lessons taught in this course as efficient as possible. In addition to that, <strong>I will always be available as a mentor for my students</strong> to answer questions and guide you along the way.<br></p>\n\n<p>Whether you're a college student ready to break out into the real world, or an experienced working professional looking to save more money to ensure a more comfortable retirement, <strong>I can assure you anyone will find value in this course that will last a lifetime.</strong></p>\n\n<p>I can assure you that the cost of the course alone will be saved within your first month of budgeting. If you're not completely happy with it, let me know and <strong>I will personally find a way to ensure I've helped you in one way or another</strong>. If there's really nothing I can do to help you financially, then you're always welcome to take advantage of Udemy's money-back guarantee.<br><br>Thank you, and I hope to be teaching you soon!<br><br></p>", 
    "end_date": null, 
    "title": "The Ultimate Guide to Personal Finance & Saving Thousands", 
    "price": "25.00", 
    "instructors": "Justin Kelsey", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628126_6287_3.jpg", 
    "course_url": "https://www.udemy.com/personalfinance101/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T18:00:34Z"
}