{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t          I&#039;ll start by saying that this course <strong style=\"\">doesn&#039;t cost a thing</strong>. Because it is an <em style=\"\"><strong style=\"\">investment</strong></em> that you will make a return on right away after only a bit of work. Huge upside and<strong style=\"\"> no downside</strong>!  </p>  <p style=\"\">  \t            Have you ever wondered how to make money easily online? I mean <em style=\"\">really </em>easily, not the &quot;Only one month of studying and then you can make six figures online after ten years!&quot; sort of &quot;easy&quot;. You&#039;ve probably seen people boasting about their online jobs hundreds of times to try and lure you into some sort of pyramid scheme, and seen &quot;Housewife makes $1000 per day using <em style=\"\">one weird trick</em>&quot; ads an order of magnitude more in popups around the internet or in forums. I&#039;ll bet you&#039;ve even tried a few of these methods, too, haven&#039;t you? And I&#039;ll also bet that their over-inflated promises and false dreams have left you with a bitter taste in your mouth once they all fell flat. Yeah, we&#039;ve all been suckered into something at one time or another, and it always ends up making you wonder: &quot;Is there really an easy way to make decent money online at all?&quot;  </p>  <p style=\"\">  \t                      Well, my answer is a resounding <strong style=\"\">YES!  </strong>  </p>  <p style=\"\">  \t                      I&#039;ve been running over the thought &quot;Is there an easy way to make money online?&quot; for years and I&#039;ve done a great deal of searching. I&#039;ve tested methods from forums, I&#039;ve researched methods from ads, I&#039;ve begun methods to do with e-commerce sites, I&#039;ve tried using popular video sites for ad revenue, and they all either failed or were too difficult and time consuming to be worth it! And then one day, entirely by chance, I stumbled upon the easiest and most entertaining way to make great money online that is incredibly easy to get started and I&#039;ve kept it my little secret... <strong style=\"\">until now!  </strong>  </p>  <p style=\"\">  \t                      In this course I have compiled my method in the most easy-to-digest and quickest form. A lot of courses are hard to complete because they are so long, but I&#039;ve gone to great lengths to make this course short, sweet, and to-the-point and I&#039;ll hold your hand every step of the way so you can start making money on the same day you start! The course takes 1 to 2 hours to complete every step entirely and understand how to use all of the information effectively, but I&#039;ll show you all of the ins and outs so after this time period, you can make your first 100 dollars in the first day or two!  </p>  <p style=\"\">  \t                      To be honest, if you could pick any course on Udemy to be essential, I would say this one is a good choice. Everyone falls on hard times sometimes and needs more money for Christmas gifts, surprise expenses, birthdays, etc, and making enough money for these things is often unclear and difficult, so the knowledge this course provides you with can very possibly save your livelihood in the possibly not-so-distant future.  </p>  <p style=\"\">  \t                      I&#039;ll see you inside!  </p>", 
    "end_date": null, 
    "title": "The Game Changer: Make a Living just by Clicking!", 
    "price": "20.00", 
    "instructors": "Liam Hanley", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321414_6a3a_9.jpg", 
    "course_url": "https://www.udemy.com/make-2000-dollars-per-month-by-clicking/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-17T08:52:08Z"
}