{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Think and Grow Rich</strong> is a book first written in 1937 by <strong style=\"\">Napoleon Hill.</strong> It has been referred to as a <em style=\"\"><strong style=\"\">‘timeless classic’</strong></em> because business people, high-flying people and entrepreneurs to this very day still refer to the contents of this book. This course is for all those who have read Think And Grow Rich (or who have heard of the book), who want to apply the 13 principles which is talks about.  </p>  <p style=\"\">  \t  Even if you’ve read the book once – its not enough. The content is so heavy, that it is highly recommended that students read the book several times. But even if you have read the book several times, this too, isn’t sufficient. One must then APPLY the content to their life. This course will help you to apply the content of Think And Grow Rich. View this course as your mastermind group.  </p>  <p style=\"\">  \t  We give you a <strong style=\"\">PDF copy </strong>of the book “Think And Grow Rich by Napoleon Hill, Revised and Expanded by Lisa Newton” your course tutor, who then has a lecture aimed at helping you to apply the contents of the material in each chapter. The course will help you to really analyze, break down, get to grips with, use and apply the content of each chapter. It’s not enough to just read the chapter. You must understand what you’ve read…and apply it.  </p>  <p style=\"\">  \t  Even if you’ve read the book, if you cannot recite the 13 principles which Hill outlined – then you don’t really know this book. And this is why this course is like a study course. We are going to study THINK AND GROW RICH together. And we’ll have an open forum where we can discuss ideas together.  </p>  <p style=\"\">  \t  The format of the course – download the book, read a chapter, watch the course lecture on the chapter, re-read the chapter and have a go at the end of chapter task. In total (assuming you take a chapter per day), the course will take approx 2 weeks to complete. Its not a sprint, but a marathon. We would recommend that you don’t rush the material, and if you prefer to take one week to really study and analze the chapter – then do so. Or, even if you do take one day – once complete, return to the beginning and do it again.  </p>  <p style=\"\">  \t  This course will help you to really understand how to THINK AND GROW RICH. If you’ve read the book, but nothing happened, then this course is for you. If you’ve heard about the book, but not read it – this course is for you. If you are interested in understanding what makes a person rich, how do they do it? How do you become wealthy? How can you get rich? What are the rich doing that everyone else isn’t doing … then this course is for you.  </p>  <p style=\"\">  \t  Be aware that Hill took 25 years of his life to interview and study over 500 of the most successful men and women of his time. He took this analysis and broke it down, in a way that the normal, everyday, average man and woman could read and could replicate those same results – if they so want to.  </p>  <p style=\"\">  \t  So, (as you’ll see in chapter 2), a BURNING DESIRE is one of the first requisites to accumulate great wealth. And in order to do this course – it helps, if you have a burning desire. There is nothing new under the sun. The laws of success are just as relevant today, as they were in 1937. Many millionaires have this book on their bookshelf. Don’t just read the book – join us on this course and let us really STUDY THE BOOK together.  </p>", 
    "end_date": null, 
    "title": "Think and Grow Rich", 
    "price": "25.00", 
    "instructors": "Lisa Newton", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302496_e6cd_2.jpg", 
    "course_url": "https://www.udemy.com/thinkandgrowrich/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:34:07Z"
}