{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong><em>Course Fully Updated for May 2016. </em></strong></p>\n\n<p><strong><em></em></strong><strong><em>Be sure to see what other students are saying below!</em></strong></p>\n\n\n\n\n\n<p>  \t<em>\"Join Over 1,100 Students From All Over The World Who Have Enrolled!\"</em>  </p>\n\n\n\n\n\n<p>  \t        In this course I will teach you a practical yet simple approach to trading that I use and have taught to others ranging in age from 14 to 70 years of age.  </p>\n\n\n\n\n\n<p>  \t                               I have been trading the forex for over 10 years and have seen a lot with regards to forex education, gimmicks and auto trading methods and software. There is a great deal of fx education but a lack of practical and consistent trading approaches.  </p>\n\n\n\n\n\n<p>  \t                                               I will not be teaching you the history, indicators and all the other stuff (fluff) out, that will not get you making money. You can find this type of training for free online. However, I will be teaching you what my trading concept is, how to implement it and manage it. I have included trade examples from start to finish.</p>\n\n\n\n\n\n<p>  \t                                               Would you like to learn an approach to trading the currency market (forex) that:  </p>\n\n\n\n\n\n<ul>  \t<li>Is <strong>simple</strong>... <em>(so simple a teenage can do it)</em></li>  \t<li>Is <strong>not time consuming</strong>... <em>(because after all you do have a life and a job)</em></li>  \t<li>Is <strong>not full of complicated stuff</strong>... <em>(just learn what you need to succeed)</em></li>  \t<li>Is not going to take years of practice to <strong>get results</strong>... <em>(want to see results within months of starting)</em></li>  \t<li>Is something <strong>you can start today</strong>... <em>(you can learn this approach today)</em></li>  </ul>\n\n\n\n\n\n<p>  \t                                                 If you answered, \"Yes\" to the statements above this course is one that you will benefit from. I have made this course simple for you to follow along.  </p>\n\n\n\n\n\n<p>  \t                                                 Here is what you will get:  </p>\n\n\n\n\n\n<ul>  \t<li>Over 2 hours of training videos with <strong>ZERO FLUFF</strong></li>  \t<li>Course lecture notes - the important things to remember</li>  \t<li>A couple quizs to make sure you understand everything as you learn</li>  \t<li>My personal rules of thumb when I am trading</li><li>Examples of trades from start to finish</li>  \t<li>Access to see some of my personal trades - If you complete 100% of the course</li>  \t<li>My personal risk free guarantee. Take the course for 30 full days, risk free - there's a full, no questions asked ever refund policy!</li>  </ul>\n\n\n\n\n\n<p>  \t<em>\"Enroll in this course now and <strong>learn a skill you will have forever</strong> for being able to generate money from the forex market.\"</em></p>\n\n\n\n\n\n<p>  \t<em><strong>Click the blue \"Take This Course\" button in the top right corner of this page to enroll now.</strong></em>  </p>", 
    "end_date": null, 
    "title": "Trade The Forex Market In Your Spare-Time For Huge Profits", 
    "price": "30.00", 
    "instructors": "Michael Coleman", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358866_9ca2_14.jpg", 
    "course_url": "https://www.udemy.com/how-you-can-make-consistent-profits-trading-the-forex/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-29T03:39:49Z"
}