{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tThis E-learning module aims to help you understand various types of health insurance, specifically the  basic insurance schemes provided by CPF Board to protect you. CPF stands for Central Provident Fund. It is the social security savings plan for Singapore. In this module, we will cover the following: Understanding Health Insurance; Types of Health Insurance and Understanding CPF Insurance Schemes.</p><p>Health insurance prevents you and your family from suffering a financial loss as a result of an accident, illness or disability. There are different types of health insurance policies to help you and your family cope with expenses during these times. Do note that some health insurance policies are short term, i.e. they may cover you for only a limited period. Do check that your product covers the duration that you need. If you buy a short term policy, check whether there is guaranteed renewability if this is important to you. </p><p>Health insurance is marketed as a standalone policy or added as a rider onto life insurance by charging extra premium. Depending on the type of health insurance, premium may be level throughout the policy duration or it may increase with age.<br></p><p><strong>MediShield </strong>is a basic medical insurance scheme designed to help pay part of the expenses arising from the insured’s hospitalisation and certain outpatient treatments for major illnesses at approved medical institutions. It is most suitable for hospitalisation at Class B2/C level in restructured hospitals in Singapore.</p><p><strong>MediShield Life – Starting 1 November 2015</strong></p><p>The Ministry of Health (MOH) is working to further enhance MediShield to provide all Singaporeans with greater peace of mind and assurance against large bills.</p><p>These enhancements are aimed at:</p><p>1.\tBetter coverage of large bills so that Singaporeans who incur large bills will pay less;</p><p>2.\tLife-long, universal coverage. There will be no more maximum coverage age. Those currently uninsured and uninsurable will be brought into MediShield Life protection. Pre-existing conditions will also be covered.</p>  <p>This module contains several case studies which will help you make relevant comparisons among various plans and take up cover which will meet your needs.  </p><p>The material covered in the course is mainly applicable for Singaporeans and people living in Singapore.</p>", 
    "end_date": null, 
    "title": "Types of Health Insurance", 
    "price": 0, 
    "instructors": "Ferris Wee, Peggy Chan, Institute for Financial Literacy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/53004_752f_4.jpg", 
    "course_url": "https://www.udemy.com/basics-of-health-insurance/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-09T01:01:48Z"
}