{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Make Money with Uber and Lyft</strong> is a course aimed to help people to generate extra income. In this course, I will use video lectures to show you a step by step on how to get started and sign up for Uber and Lyft. At the end of this course, you will be able to make money by driving for Uber and Lyft.</p><span></span><p><strong>What are the requirements?</strong></p><p>Applicants must be 21 years of age or older</p><p>Applicants must have had a valid driver's license for at least 3 year.</p><p>Clean driving record</p><p>Pass a criminal background check.</p><p>Be insured on the vehicle you intend to drive</p><p><strong>What am I going to get from this course?</strong></p><p>I will teach you the how to be an Uber and Lyft driver using step by step video lectures. In this course, I will teach you the necessary information and skills to set up an account and become a driver for both Lyft and Uber in the next 24 hours. </p><p><strong>What is the target audience</strong></p><p><strong></strong>I designed this course anyone who is 21 years and who can meet all the necessary background checks and legal requirement.</p><p>This course is designed for drivers that want generate extra income by driving for Uber and Lyft ride share companies.</p><p>This course is for those who are not familiar with Uber and Lyft ride share apps. </p>", 
    "end_date": null, 
    "title": "Uber and Lyft Rideshare", 
    "price": "20.00", 
    "instructors": "Dr. Alemayehu Midekisa (PhD)", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/782394_cf0b_4.jpg", 
    "course_url": "https://www.udemy.com/uber-and-lyft-rideshare/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-04T18:47:37Z"
}