{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you ever wondered \"what is the difference between all of these different student loan programs?\" Direct Loan? Federal Family Education Loan? Perkins Loan? Stafford Loan? PLUS Loan? What do all of these even mean?!</p>    <p>There are many different student loan programs available, and the student loan world can be a very confusing place for new students and their parents. </p>    <p>I remember when I was an 18 year old applying for school and financial aid. I was astounded at how many programs there were. I was like “why can’t we have just one simple program?”</p>    <p>That is why I developed this online program. This program covers the basics about student loans. It will discuss private loans, federal loans, as well as the key differences between the various federal loan programs. This presentation will also discuss a variety of topics ranging from deferment, to student loan bankruptcy.</p>    <p>If you are in college, going to be in college, or if you are the parent of a present or future college student, then this course is for you! Also, if you are a high school teacher responsible for educating high school juniors and/or seniors, this may be a great course to bring to the classroom!</p>    <p>I know exactly how student loans affect people (I have experienced it myself). I have won the battle against student loans, and I can help you win too! Sign up today and take control of your student loans! This program comes with a 30 day money back guarantee. Also, once you purchase the program, you will have lifetime access! </p>    <p>Sign up today and take a step toward financial wellness!</p>", 
    "end_date": null, 
    "title": "Understanding Student Loans", 
    "price": "30.00", 
    "instructors": "Devin Czech", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472382_c132_3.jpg", 
    "course_url": "https://www.udemy.com/student-loans-101/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T00:36:36Z"
}