{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Many people borrow money at certain points in their lives, usually when their savings are not enough to pay for “big-ticket” items such as a HDB flat or a car. In such cases, borrowing money to buy important items like a home may be necessary.</p>    <p>Borrowing is also a major responsibility as too much debt can easily get us in trouble. The number of persons seeking counselling for debt issues is already increasing every year, and credit card debt in Singapore is one of the fastest growing forms of debt which has grown at an average rate of 11.5% a year (Credit Bureau Report 2011).</p><p>We will first look at reasons why people borrow money. Then, we will consider various types of loans, their features and associated costs.</p><p>Learn about:</p><ul><li>Secured Loans</li><li>Unsecured Loans</li><li>Term Loans</li><li>Revolving Credit</li></ul><p>There are also several Excel demonstrations on the calculation of interest rates for the various types of loans.</p><p>Learn about these various types of loans in order to better manage your spending and debt.</p><p><strong><strong></strong></strong></p><p>We will cover some broad categories of loans namely term and revolving credit. We will also study how to derive the actual interest payable mathematically. This will help us choose the type of loans suitable for our needs.</p><p>Do get your own personal loan details ready.</p><p><br></p>", 
    "end_date": null, 
    "title": "Understanding Loans", 
    "price": 0, 
    "instructors": "Peggy Chan, Institute for Financial Literacy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61844_41ea_4.jpg", 
    "course_url": "https://www.udemy.com/understanding-loans/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-25T02:23:36Z"
}