{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      Course has been updated on 2/13/15 with a new lecture on healthcare insurance coverage Premium Tax Credit.  </p>  <p>  \t          ===================================================================</p>    <p><strong style=\"\">This course is only for people who want to spend a little bit of time learning how to do taxes and save money. If you want to pay a lot of money to someone else to do your taxes, this course is not for you.</strong></p><p>Students of this course get to ask me any questions about tax preparation in discussion forum, I will answer as soon as I can and in many cases create extra videos for the course with the answers.</p><p>In this course you will learn:</p><ul style=\"\"><li>How to do a US tax return a single people without dependents</li><li>What tax benefits you qualify for</li><li>How to plan for taxes so you pay less tax during the year</li></ul><p>I will add new lectures to this course to keep it ever green and reflect the most recent tax laws, at no extra cost to you.</p>===================================================================<p>  \t<strong style=\"\">Do you feel puzzled and frustrated just thinking about doing taxes? Do you want to figure out how to do your taxes correctly and confidently?</strong>  </p>  <p>  \t    Before serving my first client at H &amp; R Block, one of the biggest tax preparation companies, I had 130 hours in class training and did tens of practice case studies. Over <strong style=\"\">75% of my clients come back to me tax season after tax season.</strong>  </p>  <p>  \t    In this course I will teach you about tax preparation terms and concepts in plain English. You get to do a couple of case studies for practice, so by the end of my course doing your own taxes will become a familiar process, may be even fun, like it is for me – like doing a piece puzzle.  </p>  <p>  \t<strong style=\"\">My course consists of screen cast videos</strong> (yes, you will see what I see on my screen!) <strong style=\"\">and text lectures.</strong> We will go over income documents and expenses records and withholding. I will explain which tax benefits you get no questions asked, and which ones you need paperwork for.<strong style=\"\"> I will show you the whole tax preparation process over my shoulder.</strong>  </p>  <p>  \t    I created <strong style=\"\">t</strong><strong style=\"\">his course for single people who want to save money by doing their taxes themselves </strong>rather than paying top dollar at the retailer.  </p>  <p>  \t    If that describes you, go ahead, enroll into my course today, there is a 30 day money back guarantee.  </p>  <p>  \t    Want a quick preview? I made of lectures available for fee to help you decide.  </p>  <p><em style=\"\">Give yourself a fresh start by enrolling in this life-changing course now.</em></p><p><em style=\"\">Every moment you delay, you lose out. Simple as that.</em></p><p>All future updates to this course are free - you are &quot;locked-in&quot; at the current low price of $100 but you will never pay more if you <strong style=\"\">enroll today at this low price. </strong></p>", 
    "end_date": null, 
    "title": "US Taxes For Singles: How To DIY, Save Big & Pay Less Tax", 
    "price": "35.00", 
    "instructors": "Larissa Fontenot", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378382_2bbe_5.jpg", 
    "course_url": "https://www.udemy.com/taxpreparationcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T05:47:16Z"
}