{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>COURSE UPDATED 21-05-2016</strong></p>\n\n<p>  \t                 \"<em>An investment in knowledge pays the best interest</em>.\"<strong> </strong>-<strong> Benjamin Franklin</strong>  </p>\n\n<p>  \t    Do you want to learn the \"<strong>Investment Secrets</strong>\" of the greatest investors of all time?  </p>\n\n<p>  \t                                         People interested in learning about investing drown in the never-ending waterfall of financial news and get-rich-quick schemes, they no longer know <strong>what works and what doesn't</strong>. This is why they miss focus and generally lose money.  </p>\n\n<p>  \t                                         Do you ever get overwhelmed by this <strong>information overload</strong>? Do you ever feel lost in the jargon and the many strategies which the investing world has to offer? Then this course might be able to help you!  </p>\n\n<p>  \t                                         This investment course teaches you a powerful strategy which the greatest investors of our time, like <strong>Warren Buffett</strong> and Seth Klarman, use to earn <em>billions</em> on the stock market: Value Investing.  </p>\n\n<p>  \t           Where many courses only scratch the surface, this course goes in-depth with quizzes to test your knowledge, <strong>ebooks </strong>to deepen your understanding, a <strong>spreadsheet </strong>to speed up important calculations, and a checklist to make better investment decisions.  </p>\n\n<p>  \t               Concepts are introduced gradually, so that even a beginner will be able to follow along and <strong>become a confident investor in no-time</strong>! Value investing is a powerful, low-risk, proven strategy which allows you to consistently earn above-average returns. Upon successful completion of this course you will be able to:  </p>\n\n<p>  \t                                        ✔ Understand all aspects of Value Investing, the strategy of the pros  </p>\n\n<p>  \t                                        ✔ Calculate the \"intrinsic value\" of any stock  </p>\n\n<p>  \t                                        ✔ Understand why the majority of investors lose money (and how you can avoid this!)  </p>\n\n<p>  \t                                        ✔ Find and identify attractive investment opportunities  </p>\n\n<p>  \t                                        ✔ Manage your own portfolio with confidence  </p>\n\n<p>  \t                                      ✔ Discover the truth about risk versus reward  </p>\n\n<p>  \t                                        ✔ Consistently earn above-average returns using a simple, low-risk, proven strategy  </p>\n\n<p>  \t                                        ✔ Protect and grow your hard-earned savings with minimum effort  </p>\n\n<p>  \t                                        ✔ Quickly know when to buy and sell  </p>\n\n<p>  \t                                        ✔ Plus much more!  </p>\n\n<p>  \t               Enroll now and experience the original <em>Value Investing Bootcamp </em>course on Udemy.  </p>\n\n<p>  \t               I spent <strong>10 years</strong> learning this stuff and months to compress all this knowledge into this course, it's really a steal! If this course helps you to buy just 1 good stock or avoid 1 bad stock, you'll already have earned your money back.  </p>\n\n<p>  \t               If you are serious about investing your hard-earned savings, and you should, then enroll <em>right now, </em>because every day that you wait is a day that the value of your savings is decreasing due to inflation.  </p>\n\n<p>  \t<strong>Over 8877 students went before you, so click \"Take This Course\" to join them and Start Growing Your Wealth TODAY!</strong>  </p>", 
    "end_date": null, 
    "title": "Value Investing Bootcamp: How to Invest Wisely", 
    "price": "20.00", 
    "instructors": "Nick Kraakman", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/203732_88ed_3.jpg", 
    "course_url": "https://www.udemy.com/value-investing-bootcamp-how-to-invest-wisely/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-23T08:05:48Z"
}