{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you are <strong>worried</strong> about going into debt in college, then <strong>worry no more</strong>. Village Scholarships “Defeat College Debt – 7 Baby Steps” program uses a common sense approach that every high school / college student can use to eliminate college debt. My name is Antonio Adams and I am the Founder/CEO of Village Scholarships, an organization designed to automate the scholarship process so that anyone can create or receive a scholarship.</p><p>Most of us know the cost of a college education has ballooned over the past few decades. And its true other opportunities for funding have stagnated or declined. That is why, it is more important than ever that high school / college students get a strong handle on personal finance, that is why we created this course. <br></p><p>In this course, you will learn the importance of having and forecasting a budget, assessing future returns on college investments, starting an emergency and so much more. This course is three hours in length with nearly 60 lectures, full of rich material. The course is structured with lectures and exercises to help you create your college game plan. Take part and join the Village Today!</p><p>The more people we are able to help the sooner through this class, the sooner we will be able to launch our Scholarships Platform. Village Scholarships set to launch in the summer and no  later than August of 2016. </p>", 
    "end_date": null, 
    "title": "Village Scholarships Defeat College Debt - 7 Baby Steps", 
    "price": 0, 
    "instructors": "Antonio Adams", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705914_1979_4.jpg", 
    "course_url": "https://www.udemy.com/defeat-college-debt-7-baby-steps/", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T19:23:03Z"
}