{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you ever <strong>struggled with debt</strong>? Do you wonder why you don't seem to <strong>have enough money to meet expenses</strong>? Or perhaps you do have some funds set aside, but ask yourself <strong>why you can't make it grow fast enough</strong>? In all of these cases, despite knowing what you want, your ability to achieve it somehow eludes you. This course is designed to <strong>clear away any wrong mindsets you have about money </strong>- mindsets you probably aren't even aware of - that are preventing you from financial success. It offers a unique approach to <strong>achieving your financial goals</strong>. Get ready for the <strong>transformational experience </strong>of walking down new paths of thinking that will lead you to <strong>healthier mindsets and wealthier outcomes</strong>. <em></em></p><p><em>T</em><em>he Intermediate Level course (Wealth Mindset 1: Transform How You Think About Finances) focuses on correcting any wrong mindsets that you may have, and helps you to adopt the new wealth mindsets that will be the foundation of future financial success. </em></p><p><em>The Advanced Level course<strong> </strong><em>(Wealth Mindset 2: How \"Making Money\" Becomes Enduring Wealth) </em>takes <strong></strong>those newfound wealth mindsets and shows you how to apply them to the principles, goals, and strategies of wealth creation.</em><strong><em></em></strong></p>", 
    "end_date": null, 
    "title": "Wealth Mindset 1: Transform How You Think About Finances", 
    "price": "20.00", 
    "instructors": "James Pao", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615196_bbb8.jpg", 
    "course_url": "https://www.udemy.com/wealthmindset/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T20:18:52Z"
}