{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p><em><strong>LATEST: Course Updated Again for March 2016</strong></em><p>Let's face it, we go to high school and college and have some of the best years of our life! While there, we are required to take courses in Math, Science, English and many other subjects, some of which we will never use again! Why is it that Personal Finance, which is arguably the most important subject that we will ever need to know, is rarely taught to us in school?</p><p>In this course, through entertaining stories and examples, you will be guided through important lessons that <em>School Didn't Teach Us About Personal Finance</em>. The ultimate goal of this course is to teach you practical lessons that will allow you to Earn, Save and Budget more money!</p><strong>This Course Reveals Things Like: </strong>• Proven methods to <strong>improve your Credit Score</strong>!• Ways that you can use your passion and talent to generate <strong>extra income</strong>.• How to create a Budget that will help you to <strong>grow your wealth</strong> without sacrificing your quality of life.• A step-by-step guide for <strong>opening an Investment account</strong> and making your first Stock purchase.• Tips on <strong>purchasing your first home</strong> and navigating through the home buying process.• And a whole lot more!<p>Whether you want to learn how to Earn Additional Income, Budget, Save, Invest, Buy a Home, Buy Stocks, Increase your Credit Score, Pay Down Student Loans or find out more about a Retirement plan, this course is for you! Enroll in this course now to get started. With Udemy's money back guarantee, you have nothing to lose and everything to gain! Looking forward to the opportunity to interact with you and to help you make more money in your life!</p>", 
    "end_date": null, 
    "title": "What School Didn't Teach Us About Personal Finance", 
    "price": "30.00", 
    "instructors": "Khari Parker", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/463100_16d0_8.jpg", 
    "course_url": "https://www.udemy.com/lostcurriculum/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T15:56:17Z"
}