{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p><em><strong>LATEST: Course Updated Again for March 2016</strong></em><p>Let's face it, we go to high school and college and have some of the best years of our life! While there, we are required to take courses in Math, Science, English and many other subjects, some of which we will never use again! Why is it that Personal Finance, which is arguably the most important subject that we will ever need to know, is rarely taught to us in school?</p><p>In this course, you will learn the basics on <strong>Saving, Investing and Credit Cards</strong>.</p><strong>This Course Reveals Things Like:</strong><span></span><li> Why it is important to open a savings account</li><li> The benefits of placing your money in a Money Market Account (MMA) and Certificate of Deposit (CD)</li><li> Proven methods to improve your Credit Score!</li><li> Instructions on how to get a Free Credit Report annually</li><li>… And a whole lot more!</li><span></span><strong>If  you didn't learn about saving, investing or credit cards in school then, this course is for you!</strong> Enroll in this course now to get started. With Udemy's money back guarantee, you have nothing to lose and everything to gain! <strong>Looking forward to the opportunity to interact with you and to help you make more money in your life!</strong>", 
    "end_date": null, 
    "title": "What School Didn't Teach Us About Saving, Investing & Credit", 
    "price": "20.00", 
    "instructors": "Khari Parker", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472970_3072.jpg", 
    "course_url": "https://www.udemy.com/saveinvestcredit/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T17:29:59Z"
}