{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you know someone who seems to have endless willpower and someone who doesn't seem to have any? Have you ever wondered why this is? </p><p>Have you ever wondering why some people save every penny and other people spend every dime they have?</p><p>By the end of this course you'll understand the role that willpower plays in your personal finances and you'll learn evidence based methods to gain more willpower in order to save more money.</p><p><strong>Psychology influences the way you handle money. Will you let it handle you?</strong></p><ul><li>Learn why people have differing amounts of willpower</li><li>Understand the role that willpower plays in your finance</li><li>Learn how to make changes in your life in order to improve your willpower so that you can save more money!</li></ul><p>You'll learn how willpower influences the decisions you make everyday that influence your money and your quality of life. By the end of the course you'll be able to understand the basics of willpower, review scholarly results on the effect of willpower on personal finances, and learn evidence based practices to increasing the amount of willpower you have.</p><p>Please note that this is a course on willpower more than it is a course on basic finances. I have links to courses that provide basic financial literacy if you need it. The emphasis in this course is on learning how to build up your willpower so that you can make the good financial decisions you know you should be making.</p><p>Are you ready to boost your willpower?</p>", 
    "end_date": null, 
    "title": "Willpower and Wealth: How to Attract More of Both", 
    "price": "20.00", 
    "instructors": "Michelle Samuel", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/217812_2d2b.jpg", 
    "course_url": "https://www.udemy.com/willpower-attraction/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-13T21:42:15Z"
}