{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Millions of students dream of winning college scholarships to help pay for the college or university of their dreams. But getting scholarships in recent years has become increasingly competitive, difficult and time-consuming, just like the college admissions process. </p>\n\n<p>This course shows interested parties – including students of all ages, parents, mentors, high school counselors and college access professionals – exactly how to give students an advantage in the hunt for college scholarships. The course explains, with real-life examples and practical advice, not just how to win more free money for college, but also how to make the scholarship process faster, easier, more targeted and less stressful. </p>\n\n\n\n<p>The instructor is a nationally known finance expert who draws upon her professional and personal experiences in guiding her own daughter toward winning more than $500,000 in college scholarships. </p><p>Take this information-packed course and you'll gain access to 20 lectures, including 12 videos lasting about one-hour in total, and 8 brief articles and resources that you can read, download, customize and use in your own search for scholarships. The downloads and additional reading materials provided will focus your scholarship hunt and help you earn the scholarships, grants and other resources you need to pay for college – and not have to take out huge student loans.</p>", 
    "end_date": null, 
    "title": "Winning College Scholarships", 
    "price": "30.00", 
    "instructors": "Lynnette Khalfani-Cox", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785356_bfce_5.jpg", 
    "course_url": "https://www.udemy.com/winning-college-scholarships-d/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T20:18:28Z"
}