{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>この講座では多くの不動産トラブルについて代理人を務めてきた、弁護士の佐久間大輔先生が、、不動産オーナーによく振りかかる、トラブルとその対処方法についてご紹介しております。</p><p>不動産の買い物は、人生の中で、最も大きな買い物と言っても過言ではありません。<br>そのような人生最大の買い物で、トラブルがあったら目も当てられませんよね？<br>この講座を受講することで、不動産オーナーによく発生する売買上、賃貸上のトラブルなどについて紹介し、その対処方法を学ぶことができます。</p><p>トラブル対処の基本は、疑義が発生しそうな事柄については、契約書を取り交わしておくことですが、やはり契約書を取り交わしていても、紛争が発生してしまう事があります。</p><p>例えば、以下のような事例はどうでしょうか。<br>購入した住宅の敷地内（土壌）から、フッ素が検出された、<br>購入した住宅の離れで、過去に自殺騒ぎがあった、<br><br>これらは、実際に裁判で争われた事例のひとつです。詳しくは、講座の動画を参照してください。<br></p><p>不動産の取得を考えられている方のための転ばぬ先の杖、是非、この講座を受講してみてください。</p><p><strong>【講師プロフィール】</strong></p><p>つまこい法律事務所<br>佐久間 大輔</p><p>1970年生まれ、1993年中央大学法学部卒業、1997年東京弁護士会にて弁護士登録、2013年つまこい法律事務所開設。 <br>労災・過労死事件を中心に、労働事件、一般民事事件を扱う。 日本労働法学会所属。</p><p>過労死や労災、労働問題について執筆。以下、単行本を紹介。</p><p>・労働法実務解説7　安全衛生・労働災害（旬報社、2016年）<br>・シリーズ働く人を守る 精神疾患・過労死 第2版（中央経済社、2012年）<br>・過労死時代に求められる信頼構築型の企業経営と健康な働き方（労働開発研究会、2014年） <br>・労災・過労死の裁判（日本評論社、2010年）<br><br>労災・過労死、安全衛生・メンタルヘルスなどについて講演をした一例。 <br>・労働問題に精通した弁護士が繰り広げるモギ法廷～ストレスチェックに関連する想定事例を素材として（日本産業衛生学会近畿地方会産業医部会）</p><p>・弁護士が説くメンタルヘルス対策のポイント（産業保健法学研究会）</p><p>・労災をめぐる最新判例動向解説－最近の過労死裁判例と企業の補償・予防義務（労働開発研究会）</p><p>・安全衛生・労働災害をめぐる法律問題、過労死・メンタルヘルスをめぐる法律問題（東京都労働相談情報センター）</p><p>・最近の過労死裁判例と企業の補償・予防義務（メンタルリスク・マネジメント・セミナー）</p><p>・労災・過労死事案の損害賠償訴訟の実務（東京三弁護士会）</p><p>・労災－安全配慮義務違反に基づく損害賠償請求、過労自殺と労働者のメンタルヘルスをめぐる諸問題（東京弁護士会）</p><p>・労災・職業病の法律実務（日本弁護士連合会）</p><p>・医師の働き方を考える（日本産業衛生学会）</p><p>・過労死・過労自殺（静岡県社会保険労務士会）</p><p>・労災・職業病をめぐる法律問題（埼玉弁護士会）</p><p>・産業カウンセリングに関わる労働法令、産業カウンセラーのための生きた労働法知識－過労死・過労自殺（日本産業カウンセラー協会）</p>", 
    "end_date": null, 
    "title": "不動産オーナーの為のトラブル対処法（知らないと損する法律講座）", 
    "price": "20.00", 
    "instructors": "株式会社 キバンインターナショナル", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736742_7374.jpg", 
    "course_url": "https://www.udemy.com/rhcrbjxw/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T12:38:31Z"
}