{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    Traditional CRM tools are fast becoming obsolete. They often don’t have the necessary breadth to satisfy the growing demand for omnichannel customer engagement. What businesses need is a comprehensive approach to engage with customers consistently, across all touchpoints and functional activities, not just via stovepipe solutions for e-commerce, point-of-sale, marketing, social media, sales force automation, or customer service in isolation.\r\nThis course will give you detailed insight into SAP Hybris solutions, and you’ll see how SAP Hybris is reshaping Customer Engagement &amp; Commerce (CEC) as a new software category beyond traditional CRM. In various demos and system exercises, you can experience how these solutions help to improve sales, enhance brand loyalty, optimize customer service, and increase marketing performance in the new digital age and along the customer journey. In addition, you’ll learn how SAP Hybris solutions can be adapted and integrated within the SAP Hybris front office and to back-office systems like SAP ERP or SAP S/4HANA.\r\nThe content of this course is brand new and also serves as enablement material for the SAP Hybris field organization and for our partners (as “SAP Hybris Experience Workshop”). Due to its popularity, you can now access the content via openSAP.\r\nPlease note: Weeks 2 and 3 contain additional units, and you’ll need more time to complete the content.\n\n                                            Syllabus\n                        Week 1: SAP Hybris Strategy &amp; CommerceWeek 2: SAP Hybris Billing &amp; MarketingWeek 3: SAP Hybris Sales &amp; ServiceWeek 4: SAP Hybris Integration &amp; TechnologyWeek 5: Final Exam\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Experience SAP Hybris Solutions", "price": 0, "instructors": "Sven Feurer and Marcus Ruebsam", "institution_name": [], "commitment": "5-7 hours", "subject_name": ["Business & Management"], "course_url": "https://open.sap.com/courses/hyb1", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["openSAP"], "start_date": "2016-06-20T00:00:00Z"}