{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    Marketing ist eine zentrale Funktion, die mit allen Unternehmensbereichen verknüpft ist. Ohne Marketing funktioniert gar nichts. Nur, wer den Kunden versteht und weiß, wie er denkt, kann auch die richtigen Produkte produzieren und verkaufen. Marketing geht jeden etwas an – ob Ingenieure (Produktpolitik), Werber &amp; PR-Leute (Kommunikationspolitik), Controller (Preispolitik) oder Verkaufsmanager (Distributionspolitik)! Aber was ist Marketing eigentlich?\r\nViele Laien setzen Marketing mit „Werbung“ gleich. In der Unternehmenspraxis dagegen ist Marketing (vom englischen „market“ für Markt bzw. vermarkten) eng mit der Markt- und Unternehmensstrategie verknüpft und umfasst mehrere Facetten: Zunächst versteht man heute unter dem Marketing eines Unternehmens alle marktbezogenen Aktivitäten gegenüber den (potenziellen) Kunden sowie den Aufbau und Erhalt von Kundenbeziehungen.\r\nMarketing beschränkt sich somit nicht nur auf die Bereiche Verkauf und Werbung, sondern umfasst eine Vielzahl an Aktivitäten, u.a. die systematische Informationsgewinnung über Märkte oder die Gestaltung des Produktangebots, die Preissetzung, die Kommunikation und den Vertrieb. Aus unternehmensinterner Sicht müssen außerdem die Voraussetzungen geschaffen werden, damit marktbezogene Aktivitäten effizient umgesetzt werden können. Dies wird insbesondere durch die Führung des gesamten Unternehmens nach der Leitidee der Marktorientierung erreicht. Marketing wird folglich auch als gedankliche Leitlinie für unternehmerische Entscheidungen verstanden und stellt eine zentrale betriebswirtschaftliche Funktion innerhalb eines marktorientierten Unternehmens dar.\r\nLernziele\r\n\r\nSie sind in der Lage, verschiedene Formen und Aufgaben des Marketings zu unterscheiden und relevante Marktforschungsfelder zu bestimmen.\r\nMittels betriebswirtschaftlicher Werkzeuge können Sie Kaufentscheidungsprozesse analysieren und diese Erkenntnisse für die Produktentwicklung und für Marketing-Prozesse nutzen.\r\nSie sind in der Lage, wichtige Marketing-Strategien zu identifizieren und zielorientiert anzuwenden.\r\nDurch die Anwendung theoretischer Modelle können Sie Produktneuentwicklungen in verschiedene Phasen unterteilen und auf diese Weise organisieren.\r\nSie sind in der Lage, die zentralen Dimensionen des Marketings (die sog. “4 Ps” Produkt-, Preis-, Distributions- und Kommunikationspolitik) zu unterscheiden und für Marketing-Prozesse zu nutzen.\r\n\n\n                                            Syllabus\n                        \r\nMarketing - Philosophie und Grundlagen\r\nDer Marketing-Management-Prozess als Rahmenwerk\r\nDas Marketing-Umfeld analysieren: Märkte, Konsumenten und Wettbewerber als Fokus der Marktforschung\r\nMarketing-Strategie: Marktsegmentierung und Wettbewerbsstrategien\r\nProduktpolitik - das Herz des Marketing\r\nKommunikationspolitik - Marketing ist mehr als Werbung!\r\nPreispolitik - Strategien und Konzepte zur Steigerung der Unternehmensprofitabilität\r\nDistributionspolitik - Produkte und Dienstleistungen zum Kunden bringen\r\n\n                                    ", "end_date": "2014-07-01T00:00:00Z", "title": "Grundlagen des Marketing", "price": 0, "instructors": "Marc Oliver Opresnik", "institution_name": ["Fachhochschule Lübeck"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.iversity.org/courses/grundlagen-des-marketing", "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["iversity"], "start_date": "2014-05-06T00:00:00Z"}