{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    This is part-I of a course on Marketing Management. The objective of the course is to introduce the participants to principles and practices, theoretical building blocks of marketing, its role as an organizational engine and the evolving marketing process of today. At the end of the course, a participant will be able to understand and manage the core marketing management function. \n\n                                            Syllabus\n                        Week-1 Introduction to Marketing o Defining Marketingo Core concepts in Marketingo Evolution of Marketingo Marketing Planning Processo Contemporary Issues and Practices\r\nWeek-2 Scanning the Business Environmento The value chaino Core Competencieso Strategic Planning Processo PESTELo Competition Analysiso SWOT Analysis\r\nWeek-3&amp;4 Marketing Information System and Marketing Researcho Role of Marketing Information System in Managerial Decision Making Processo Components of Marketing Information systemso The Marketing Research Process: An overview Defining the Management Decision Problem and Marketing Research Problem Framing Research Objectives and developing the research plan Exploratory vs. Conclusive Research\r\nWeek-5&amp;6 Buyer Behavior o Consumer Behavior Consumer buying process model What Influences Consumer Behavior Key Psychological Processes The Buying Decision Process: The Five Stage Model Other Theories of Consumer Decision Making o Industrial Buyer Behavior Concept of Buying Center Industrial buying process model Influence of Economic and Behavioral Factors Influence of Procurement Organization Role of Negotiation Process\r\nWeek-7&amp;8 Generic Marketing Strategieso Defining Market Segmentation o Bases of segmentation o Evaluation and Targeting Market Segmentso Brand Positioning and Differentiation\n                                    ", "end_date": "2016-03-14T00:00:00Z", "title": "Marketing Management-I", "price": 0, "instructors": "Shashi Shekhar Mishra and Jayanta Chatterjee", "institution_name": ["IIT (Indian Institute of Technology, Kanpur)"], "commitment": "2-3 hours", "subject_name": ["Business & Management"], "course_url": "https://onlinecourses.nptel.ac.in/noc16_mg02", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["NPTEL"], "start_date": "2016-01-18T00:00:00Z"}