{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    Organizations large and small are inundated with data about consumer choices. Knowing how to interpret data is the challenge -- and marketers in particular are increasingly expected to use analytics to inform and justify their decisions.\n\nThis course gives you the tools to measure brand and customer assets, perform regression analysis, and design experiments as a way to evaluate and optimize marketing campaigns. Real-world examples with companies such as Snapple, IBM, and Netflix show how marketing analytics informs important decisions. This course is ideal for learners who want to grow their knowledge, develop their career portfolio, and improve the effectiveness of their marketing campaigns.\n\nWeek 1: Marketing Resource Allocation \nWeek 2: Metrics for Measuring Brand Assets \nWeek 3: Customer Lifetime Value\nWeek 4: Regression Basics\nWeek 5: Marketing Experiments\n\n                                            Syllabus\n                        Marketing Resource AllocationWelcome! John Wanamaker, father of modern advertising, once said, \"Half the money I spend on advertising is wasted; the trouble is, I don't know which half.\" In this first module, we'll begin figuring out how to reduce that waste and track effectiveness. We'll discuss what marketing analytics is and why it's important, and I'll share the resource allocation framework, which shows how to apply analytics to make the most of your marketing budget.  By the end of this module, you will be able to use basic tools to determine effective resource allocation--to know where to spend your advertising dollars. Let's get started!dddMetrics for Measuring Brand AssetsFirms spend millions on branding for one reason: It allows them to charge more for their products and services. In this module, we'll explore this valuable, if intangible, asset.  We'll discuss how to build and define a brand architecture and how to measure the impact of marketing efforts on brand value over time. By the end of this module, you'll be able to measure and track brand value. So let's get started!Customer Lifetime ValueWhat do your customers mean to you? In this third module, we'll explore Customer Lifetime Value, or the future net value of a customer relationship. This forward-looking measure of the customer relationship helps you connect marketing strategies to financial consequences. By the end of this module, you'll be able to evaluate strategic marketing alternatives based on whether they improve customer retention and lifetime value. Let's get started!Regression BasicsWelcome to Module 4! Ever wonder how two different variables, say, sales and promotions, relate? In this module, we'll look at regression, which allows us to understand that relationship. We'll discuss how to interpret regression outputs, explore confounding effects and biases, and distinguish between economic and statistical significance. By the end of this module, you'll be able to use regression to connect the dots between customer behavior and business decisions. This is tricky stuff, but we'll make sense of it together. Let's go!Marketing ExperimentsEver wonder if price cuts really drive sales? Do an experiment! Experiments allow you to understand the effectiveness of different marketing strategies and forecast expected ROI. Welcome to Module 5! In this final module, we'll explore how to design basic experiments so that you can assess your marketing efforts. We'll help you avoid a gap between your test results and field implementation, and explore how web experiments can be implemented cheaply and quickly.  By the end of this module, you'll be able to design and conduct effective experiments that test your marketing campaigns. Then, check out the video interviews with top marketing analytics professionals. They reveal insights and provide tips to help you make the most of your marketing analytics efforts.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Marketing Analytics", "price": 0, "instructors": "Rajkumar Venkatesan", "institution_name": ["University of Virginia"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/market-analytics", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}