{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    Pricing is one of the most important but least understood marketing decisions. Learn and practice concepts, techniques, and get to grips with the latest thinking on assessing and formulating pricing strategies. Analyze how firms attempt to capture value, as well as profits, in the revenues they earn. \n\nAfter this course, you will be able to contribute to the process of formulating pricing strategies for your own products and services, or those of your firm. This course has an additional focus on pricing dynamics and the reaction to and by competitors, taking a highly pragmatic approach and one that is directly applicable to your day-to-day professional life.\n\nThis course is made up of the following four modules:\n\n1 - In this module we will start with the importance of pricing, especially for the bottom line. Having this in mind, and after showing how pricing is the most important driver of profitability, when you finish this module you will be able to execute cost, competition and customer-based pricing. You will also be able to use the concepts of price elasticity and optimal price while setting prices for your products and services.\n\n2 - After finishing this module you will be able to take advantage of four different methods to determine the willingness to pay from customers. Whether using Market Data or Experiments (Observation based) or Expert or Customer Surveys (Survey based), you'll be able to use this information in order to identify the optimal price.\n\n3 - What we see in the real world is that companies don't only charge one price for all their products, but rather set different prices for different products with respect to different customer segments. After looking at the benefits of price discrimination (and the significant revenue and profit potential behind it), you will be able to figure out what type and how to implement price discrimination for your products and services.\n\n4 - In this final module we will look at pricing psychology. You will then be able to \"manipulate\" customers so they perceive a higher value in the products and services that you deliver, or so that they feel less pain by paying the price of purchasing your products. You will have in your toolkit multiple ways to maximize your sales, revenues, and profitability. We will also conduct a couple of experiments with volunteer customers to see how price affects perceptions, and how you can profit from it.\n\n                                            Syllabus\n                        Demand Curve and PricingIn this module we will start with the importance of pricing, especially for the bottom line. Having this in mind, and after showing how pricing is the most important driver of profitability, when you finish this module you will be able to execute cost, competition and customer-based pricing. You will also be able to use the concepts of price elasticity and optimal price while setting prices for your products and services.Determining Willingness to PayAfter finishing this module you will be able to take advantage of four different methods to determine the willingness to pay from customers. Whether using Market Data or Experiments (Observation based) or Expert or Customer Surveys (Survey based), you'll be able to use this information in order to identify the optimal price.Playing the Pricing Piano or Price DiscriminationWhat we see in the real world is that companies don't only charge one price for all their products, but rather set different prices for different products with respect to different customer segments. After looking at the benefits of price discrimination (and the significant revenue and profit potential behind it), you will be able to figure out what type and how to implement price discrimination for your products and services.Pricing PsychologyIn this final module we will look at pricing psychology. You will then be able to \"manipulate\" customers so they perceive a higher value in the products and services that you deliver, or so that they feel less pain by paying the price of purchasing your products. You will have in your toolkit multiple ways to maximize your sales, revenues, and profitability. We will also conduct a couple of experiments with volunteer customers to see how price affects perceptions, and how you can profit from it.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Pricing Strategy", "price": 0, "instructors": "Martin Boehm", "institution_name": ["IE Business School"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/pricing-strategy", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}