{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    Perhaps you are familiar with research. You might have learned about research or maybe you conduct research in your life. How is that different from research in Public Relations practice? In this course, you will learn the foundations of research in PR.  PR research is applied research. \n\nPractical application of research allows you to improve the organization’s performance. Research can be used in many ways in Public Relations practice. For example, you can use research to analyze and assess a need for the organization, ensure your objectives are realistic and connected to your outcome, identify and describe the relevant publics, brainstorm and test messages and channels, monitor the progress of your PR efforts, show impact and effectiveness of your program. This course will provide you the basic knowledge to plan, design, and conduct research to solve a PR problem.  \n\nThis course is designed for students wanting to pursue careers in public relations as well as a refresher for entry level PR practitioners wanting to brush up on their knowledge of the field. Come join me in this tour of research in PR where you will learn to use research as the backbone of your strategic decisions based on evidence.\n\n                                            Syllabus\n                        Introduction to Public Relations ResearchWelcome! In this section, we are covering the foundation of research. What makes a research academic and what makes it applied? We will learn how Public Relations research is similar to and different from academic research. This allows you to use research to move PR for strategic decision making as part of a management function. Finally, we will also discuss overview of research methods used in PR research.Formative ResearchNow that we have had an overview PR as applied research, let’s explore formative research in PR. First we will discuss issue management as issues are what you are trying to address through research. Second, we will focus on how to set objectives and write problem statement. These are fundamental to ensuring your program is effective and efficient. Third, we will discuss formative research in particularly how to plan and conduct situational analysis. The key components of situational analysis allow you to ensure you carry out programs backed by research. Research ToolsImportant parts of the Public Relations research are the research tools. In this section, we will learn about two quantitative methods such as survey and content analysis and two qualitative research methods such as interview and focus groups. The key elements of PR research are being able to take research methods and apply it specifically to PR contexts and issues. We will study the steps of research and its use in PR.Evaluation ResearchNow we have come full circle! We began with a PR problem, engaged in formative research and carried out our research using various research tools. Now we want to know did it work? Evaluation allows you to connect your objective to your outcome. In this section, you will be able to develop your PR evaluation metrics that helps you connect your outcome to your objectives. This ensures and allows you to assess the impact and show the effectiveness of your efforts.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Public Relations Research", "price": 0, "instructors": "Iccha Basnyat", "institution_name": ["National University of Singapore"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/prresearch", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}