{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Learn Push workflow and production techniques from Ableton Certified trainer and award winning producer Mitch Lee.<br></p>\n\n<p><strong>Learn to create and produce with the Ableton Push</strong></p>\n\n\n\n<ul><li>Drum Programming</li><li>Notes, Chords and Scales</li><li>Sampling Workflow</li><li>Recording Audio</li><li>Arranging and Mixing</li></ul>\n\n<p><strong>Understand production workflow</strong> </p>\n\n<p>The Ableton Push has changed the way Ableton users produce and perform. Workflow is everything and understanding how best to maximize this instrument is what this course is all about.</p>\n\n\n\n<p><strong>Content and Overview</strong></p>\n\n\n\n<p><strong>Drum Programming</strong><br>Drum programming is one of the many strengths of the Ableton Push. You will learn how to program drums 3 different ways. We start with finger/pad drumming techniques and explain how to setup your loop lengths and quantize settings for best results. Then we create a house beat while explaining step sequencing with the Push. Finally we conclude with the Hybrid Technique of finger/pad drumming and step sequencing. The main workflow technique we showcase through all three methods is Subtractive Drum Programming.</p>\n\n\n\n<p><strong>Notes, Chords and Scales</strong><br>The isometric keyboard on the Push allows users to create melodies with ease. The scale function creates a fast way to create melody or bass lines in any key or scale you desire. Learning a few different chord shapes will allow you to play many chords in any scale. The melodic step sequencer is another creative tool for creating baselines and melodic lines you might not normally make.</p>\n\n\n\n<p><strong>Sampling Workflow</strong><br>With the latest 9.5 release of Live, Ableton has completely changed the sampling game for Push users. The upgrade to the simpler instrument has taken the sampling process on the Push to an incredible new level. Offering a number of new tools inside of simpler along with the ability to warp samples allows us to time stretch instantly and manipulate samples any way we please. Chopping samples is just the beginning, learn to sample fast, from vinyl and other formats.</p>\n\n\n\n<p><strong>Recording Audio</strong><br>There are a number of Push users who also play other instruments like guitar and bass. Understanding how to record and loop with the Push is a real mystery for some users. Learn to how to use a foot pedal to punch in and out and record live instruments with the Push. Mitch also explains how to connect a hardware synth and control it with the Push.</p>\n\n\n\n<p><strong>Arranging and Mixing</strong><br>The Push is an incredible arrangement tool. Learn how to setup your clips in Ableton and learn Mitch’s macro arrangement technique with the Push. Take your ideas and loops and make them into sections of your tracks fast and efficiently. Learn what mixing facilities are available to Push users. Being able to meter on the Push 2 has made it much easier to get your mixes to a place where you can fine tune and make your tracks sit properly. The Push turns into a tactile tool for adjusting and tweaking your tracks while processing and working with plugins and vsts.</p>\n\n\n\n<p><strong>What am I going to get from this course?</strong></p>\n\n\n\n\n\n<ul><li>Over 40 lessons and over 5 hours of content!</li><li>Learn the Ableton Push from Ableton Certified Trainer and award winning producer Mitch Lee</li><li>Project files, drum racks and sample packs to help you follow along with the lessons</li><li>Created for beginners and Intermediate Push users</li><li>Workflow is at the heart of every lesson</li></ul>", 
    "end_date": null, 
    "title": "Ableton Push - Workflow and Production", 
    "price": "45.00", 
    "instructors": "Mitch Lee", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802124_2298_2.jpg", 
    "course_url": "https://www.udemy.com/ableton-push-workflow-and-production/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T18:16:25Z"
}