{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\"></p><p style=\"\">In this practical training course you will learn how to use tools you have already for electronic music production. Electronic music got it&#039;s secrets and we need to learn more and use other people experience in order to be more flexible and make music we like. Let me share some of my knowledge with you.&nbsp;</p><p style=\"\">Some of the history.</p><p style=\"\">As a electronic music producer, I always need to learn new music production software known as DAW (Digital audio workstation). Every production software got it&#039;s signature functions and also downside. Cakewalk was my first music production software. It was a good soft at the moment and I liked it a lot, I bought it in 1998. In time I moved to Logic 5 which known as Logic Pro now. Early 2000 Logic become very stable and most powerful music production software ones Apple took over the company. Since than Logic became OS only DAW and many people moved to Mac because of it. So, I did to and I glad I did!&nbsp;</p><p style=\"\">Than somewhere in 2005-2006 I needed the simple solution to make a Dj mix and be able to bit-mach 2 tracks for continues dance music mix using just a software. I was traveling and wanted to use my lap top only... This is how I discovered Ableton Live for the first time. I showed my technique to some people and right after, one body literally went to the music store and bought a copy of Ableton Live.</p><p style=\"\">This days, Ableton Live is the only production solution for me, simply because, the creative flow is endless. I was always saying that, if you are individual electronic music producer with lots of creative ideas you need to use Ableton Live.</p><p style=\"\">Some professional music producers will start in Ableton Live, create the music then move all files to Logic Pro and finish the track in Logic. For me it was very long process when I realized the production power of Ableton Live and start learning this new software. Believe or not it took me almost a year. But in the end I am able to create music ideas flawlessly.&nbsp;</p><p style=\"\">In this course I will not show you how to copy and past or save files in Ableton Live, but I will show you the creative process and how we can use default software tools and 3rd party plugins in order to make unique music we want.</p><p style=\"\"></p><p style=\"\"><strong style=\"\">Instruments intro</strong></p><p style=\"\">I would like to refer to some of my favorite virtual instruments such as Arturia Virtual Collection V3, Native Instruments and my personal samples. Arturia V3 include several well known analog synths from past - Moog Modular, Mini Moog, etc. It&#039;s almost impossible to discover all possibilities of Moog, so many variations could be created using this instrument, which is good for any electronic music production. In Native Instruments, I like to talk about Reaktor 5. Many individual synths included in Reaktor 5 bundle, almost every synth inside Reaktor 5 trigger cool idea in your head. I would also recommend Alchemy from Camel Audio. This synth will bring any music on different level.</p><p style=\"\">If it&#039;s not enough, you can always use Ableton Live instruments or rewire Logic Pro and record Logic default instruments with Ableton Live using Sound Flower.</p><p style=\"\"><strong style=\"\">Effects intro</strong></p><p style=\"\">For production effects I love to use almost all default Ableton Live effects and Native Instruments Guitar Rig 5. Compressors from Crysonic and Elysia. Other dynamic effects &amp; EQ from Flux and Fab Filters.</p><p style=\"\"><strong style=\"\">Using instruments to create bits and samples</strong></p><p style=\"\">Like no other DAW Ableton Live has 2 ways to create music. Grid and arrangement windows. Every other professional DAW will provide only arrangement view and you have to guess and copy past loops. It is more convenient to use Ableton Live for creative purpose. &nbsp; &nbsp;</p><p style=\"\"><strong style=\"\">Using freez</strong></p><p style=\"\">This is just amassing function, this function could be found in other DAW like Logic Pro. However since we using Ableton Live, I would love to show you few very nice features which changed the way I look into music production now.&nbsp;</p><p style=\"\">Recording from instrument to audio</p><p style=\"\">Very simple and effective way to transform virtual instrument into audio file and continue editing</p><p style=\"\"><strong style=\"\">Applying effects</strong></p><p style=\"\">Working with effects could little tricky. I like to use minimum amount of reverbs and delays. I also like to use dynamic effects for almost every track inside my arrangement. In the end, Mastering effects may harm reverbs and delays and create unwanted sound. Right amount of effects should be added.</p><p style=\"\"><strong style=\"\">Arranging the track</strong></p><p style=\"\">Track arraignment could not be easier with Ableton Live. Jut hit record and start improvise with created loops, than go to arraignment view and continue working.&nbsp;</p><p style=\"\"><strong style=\"\">Bouncing mixdown track</strong></p><p style=\"\">I want to give you some effective tips which I&#039;ve learn during production. What you need to do before bouncing the mixdown.</p><p style=\"\"><strong style=\"\">Mastering track</strong></p><p style=\"\">Mastering is most important final part of music production. Usually producers sending Mixdown version to Mastering house, however many people master there music in house. It takes time to learn mastering and consider your own music, like you trying to master music from other people. This is the only way to make good master out of your own track. I will show you what and how I use mastering plugins or mastering my own music. The answer to the question - Why should we master our own music? Is simple. Nobody will understand your &quot;electronic&quot; music like yourself. Sound engineers may not like and/or understand this type of music which is very important. I&#039;ll try on my own than spend $50-$70 for online mastering. Unless you can find mastering house which dos the job in similar music genre.&nbsp;</p><p style=\"\"></p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Arthur Explicit - creative flow in Ableton Live", 
    "price": "50.00", 
    "instructors": "Arthur Explicit", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29795_d512_6.jpg", 
    "course_url": "https://www.udemy.com/arthur-explicit-creative-flow-in-ableton-live/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-16T01:31:48Z"
}