{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\"><strong style=\"\">This is a class about the joy of Circuit Bending.</strong> </p><p style=\"\">In this class we will first talk about what Circuit Bending is, and how it works. Then, we will actually circuit bend an old keyboard from beginning to end, going <strong style=\"\">step-by-step through the entire process</strong>. In the end, we will have a cool new keyboard capable of brand new sounds, and I&#039;ll even make a track with it.</p><p style=\"\">This might just be the weirdest class I&#039;ve ever made. In this class we will hit the road, going to some thrift shops to look for bendable instruments, I&#039;ll do some time-lapse videos of taking things apart (complete with Benny Hill), and we will melt down some Spongebob Squarepants. <strong style=\"\">You will have to join the class to see how that all unfolds.</strong></p><p style=\"\"><strong style=\"\">And of course, once you sign up for this class, you automatically get huge discounts on many of my other classes - stay to the end to find out how!</strong></p><p style=\"\">You will not have another opportunity to learn Circuit Bending in a more comprehensive way that this. Start here.</p><p style=\"\"><em style=\"\">J. Anthony Allen is an Ableton Certified Trainer, and a PhD in Music Composition and master of Electronic Sounds. His music has been heard internationally in film, radio, video games, and industrial sound, as well as the concert hall and theater.</em></p><p style=\"\"><em style=\"\">He currently as an adjunct professor of composition at the University of St. Thomas, Macphail Academy of Music, and the CEO of Slam Academy in Minneapolis.</em></p><p style=\"\"><em style=\"\">Praise for other classes by J. Anthony Allen:</em></p><em style=\"\"><em style=\"\"><li style=\"\"><em style=\"\">&quot;I&#039;ve had Live Lite for a while but never quite understood how to use it because of the different options in how to arrange audio. This course explains exactly how to do that and get the most out of Live.&quot;</em></li><em style=\"\"><em style=\"\"><li style=\"\">&quot;Great overview - I would start here for sure if you are just getting your feet wet with live. clear and to the point. session walkthroughs are great. looking forward to more&quot;</li><li style=\"\">&quot;I have never had any formal training in music at all. Trying to learn all the notes and how everything translated was a serious challenge. After going thru this class, Dr. J has totally brought down the barriers. The content was very useful and was easy to grasp for me.&quot;</li></em></em></em></em>", 
    "end_date": null, 
    "title": "Circuit Bending: Making Music By ReWiring Devices and Toys", 
    "price": "20.00", 
    "instructors": "Jason Allen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535120_33d5_3.jpg", 
    "course_url": "https://www.udemy.com/circuit-bending/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T14:04:18Z"
}