{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<ul><li><strong>¿Quieres mejorar y aumentar el numero de estudiantes y su motivación? <br></strong></li><li><strong>¿Queires aumentar tus ventas? <br></strong></li><li><strong>¿Tus videos tienen ese feo eco y resonancia inadecuada?<br></strong></li><li><strong>¿Tu voz suena baja en los videos que grabas?<br></strong></li><li><strong>¿Sientes que tu voz no tiene brillo en las grabaciones?<br></strong></li></ul><p><strong><em><br></em></strong></p><p><strong><em>Con este curso podrás mejorar la voz en tus videos hasta alcanzar la calidad profesional que has estado buscando pero no la obtienes por mas pruebas que realices... Se lo importante que es el audio en un video. Te ayudaré de forma fácil y rápida a tener calidad de audio cinematográfica en tus videos... Para eso utilizaremos dos programa de edición profesionales: Adobe Audition 3.0 y Vegas Pro 11.0 que previamente debes tener instalado en tu computadora... </em><em></em></strong><br></p><p><strong>La palabra hablada es una de las formas de comunicación mas utilizada desde siempre, ya sea por teléfono, mensajes de voz, radio, o JUSTAMENTE EN LOS VIDEOS...</strong></p><p><strong>En la enseñanza en linea o video-tutoriales, no tenemos la intercomunicación con el estudiante en el momento, pues necesitamos motivarlo desde el inicio. El se puede encontrar en su hogar, pero tambien en lugares abiertos y que te escuche de forma clara es esencial para ampliar y aumentar tus posibilidades de llegar a mas audiencia. Ya sea como profesional, profesor e instructor sobre un determinado tema...</strong></p><p><strong>Ademas también te ayudare a mejorar la calidad visual de tus videos a traves de Vegas Pro.</strong></p><p><strong>No lo dudes, este curso hará crecer tu audiencia y ganar confianza en tus alumnados, ademas de mostrarte mas profesional en el tema que dictes. Recuerda que tienes competencia. DESTACATE!</strong></p>", 
    "end_date": null, 
    "title": "Como Grabar La Voz En Tus Videos Como Un Profesional", 
    "price": "20.00", 
    "instructors": "Locutor / Productor. Mauro Martinez", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765682_b29b_3.jpg", 
    "course_url": "https://www.udemy.com/como-grabar-la-voz-en-tus-videos-como-un-profesional/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T18:20:45Z"
}