{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong style=\"\">1200+ students enrolled, lifetime access and a 30 day money back guarantee in case you&#039;re not satisfied with the content!*</strong>  </p>  <hr style=\"\">  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Please note: Free previews of 3 lectures available!</strong> Just scroll to the curriculum section to see where we start, how a kick drum sound is processed and what the possible result could sound like.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Latest Update: </strong>To help you getting started, my version of the Ableton Live Session can now be downloaded. Just look at the material of lecture &quot;Setting Up The Live Session&quot;!<strong style=\"\"></strong>  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Summary:</strong>  </p>  <p>  \t                           This course will teach beginners how to set up a session for recording in <em style=\"\">Ableton Live</em>, records sounds created with items from your household and turn them into a finger-drumming rack.  </p>  <p>  \t                                                                               You will learn to cut samples, process them with <em style=\"\">Simpler</em>, shape sounds with envelope and filter and play them with your computer keyboard or a midi controller. With clever arrangement and some practice, you will be able to play the processed sounds with both hands simultaneously and create basic drum loops accompanied by simple melodic elements.  </p>  <p>  \t                                     Therefore we will:  </p>  <ul style=\"\">  \t<li style=\"\">set up a live session to work with</li>  \t<li style=\"\">set up your input source</li>  \t<li style=\"\">choose proper items to record</li>  \t<li style=\"\">shape drum- and percussion sounds</li>  \t<li style=\"\">process a bass sounds</li>  \t<li style=\"\">use looping techniques to get pads and lead sounds</li>  \t<li style=\"\">spice up the sounds with <em style=\"\">Simpler</em>&#039;s built in audio fx and <em style=\"\">Ableton</em>&#039;s midi fx</li>  \t<li style=\"\">arranging the sounds for playback on keyboard or midi controller</li>  \t<li style=\"\">play the rack!</li>  </ul>  <p>  \t                                     Finger drumming is a fun way to develop simple rhythmical ideas and improve your coordination, even if you have never played an instrument. The recordings are made from items you&#039;ll find at home.  </p>  <p>  \t                                     The course consists of video modules only. Some lectures have downloads available to help you in your process. Choose whatever items you like to use during the course. Watching and understanding the videos will take about 2 hours, but I recommend to execute all tasks show in the lessons directly after watching. Still, after you gathered your items and installed a version of Ableton, the course can be completed in about 3 to 4 hours without any problems.  </p>  <p>  \t                               If you&#039;re completely new to the topic, I recommend to watch the lectures once to understand the basic idea and then re-watch it to support you in settingup, recording, processing and playing, step by step.  </p>  <p>  \t<strong style=\"\">No special equipment needed! You will most likely own everything needed to complete this course!</strong>  </p>  <hr style=\"\">  <p>  \t            *May not be available for app-in purchases, please check conditions before buying. <br style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Create a Finger-Drumming Rack in Ableton Live (Basics)", 
    "price": "20.00", 
    "instructors": "Marc \"Selec\" Zimmermann", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/231258_afe0_3.jpg", 
    "course_url": "https://www.udemy.com/create-a-finger-drumming-rack-in-ableton-live-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T21:17:17Z"
}