{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong style=\"\">Many people have asked me how I create my audio visualizations for courses like the Mindful Approach to Time Management. </strong></p><p>It&#039;s something I taught myself over a number of years. I&#039;ve now developed a methodology that works every time to get your listener into an altered and heightened state of mind. <br style=\"\">  </p><p>If you are a coach, healer or therapist, this Audio Visualization course will allow you to reach a wider audience and generate passive income while you sleep from your recordings.  <br style=\"\">  Follow these easy to follow steps in this course and you too will be able to create stunningly sounding audio tracks to take your listeners on meditative journeys and into altered states of consciousness. <br style=\"\"></p><p>This  course consists of over an hour of instructional video with sample  visualizations so you can experience the trance state you will be able to  induce in your listeners. <br style=\"\">  <br style=\"\">  The videos cover both technical aspects of how  to use Audacity, which is a fabulous and free audio editor, and how to layer  the sounds and use your voice to create the change of state in the listener  with Audio  Visual Presentation. <br style=\"\">  <br style=\"\">  The course also contains some bonus audio  tracks you can use in your own recordings.</p>", 
    "end_date": null, 
    "title": "Creating Audio Visualizations with Audacity", 
    "price": "50.00", 
    "instructors": "Tom Evans", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/31366_7341_6.jpg", 
    "course_url": "https://www.udemy.com/creating-meditative-visualizations/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-05T09:41:03Z"
}