{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>Become a great producer with this course on FL Studio for Beginners and learn important basics of this production software.</strong>  </p>  <p>  \t          You are a DJ and want to take the next step into music business?  </p>  <p>  \t    You want to produce the next number 1 track?  </p>  <p>  \t    Nowadays genres like dance or electro are very popular and it has never been easier for people like you and me to produce music on our own.  </p>  <p>  \t          FL Studio is great for making your ideas for your own track come true. Many famous artists like Avicii, Afrojack or Martin Garrix already work with this software.  </p>  <p>  \t      On the basis of its intuitive and readily understandable user interface FL Studio can be learned very easily and quickly.  </p>  <p>  \t          This training is for all those who want to take the first step in music production and learn how to work with FL Studio from the very start.  </p>  <p>  \t    After a short introduction on general basics, I will tell you about the structure of the software and how to use it in an effective way. We will create a sample project together and carry out the most important steps in the production of a new track. Furthermore the use of essential effects and how to influence the dynamics of the mix will be explained in an easy and understandable way.  </p>  <p>  \t  The last chapter provides some additional information about useful procedures and functions of FL Studio, which make it easier to gain your own workflow.  </p>  <p>  \t    All in all you have to complete 10 chapters and it takes about 1,5 hours to finish this course and thus learn how to work on your own projects.  </p>  <p>  \t    The course is structured like this:  </p>  <p>  \t    1. Intro  </p>  <p>  \t    2. General Introduction  </p>  <p>  \t    3. FL Studio - A step by step introduction  </p>  <p>  \t    4. Working with FL Studio  </p>  <p>  \t    5. Additional Information  </p>  <p>  \t    6. Good to Know  </p>  <p>  \t    7. Outro  </p>  <p>  \t    Each topic is devided into several subchapters.  </p>  <p>  \t    So have fun with this course and become a great producer yourself.  </p>", 
    "end_date": null, 
    "title": "Digital Music Production with FL Studio for Beginners", 
    "price": "20.00", 
    "instructors": "Benjamin Meyer", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358434_f870_2.jpg", 
    "course_url": "https://www.udemy.com/digital-music-production-with-fl-studio-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-28T13:46:53Z"
}