{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><em>**Introductory pricing - Price will increase on March 1st, 2016</em></p><p><em>**2/1/16 - Over 250 new students!! </em></p><p><strong>Are you new to programming drums?... In just 2 short and inspiring hours you'll be creating better tracks that will impress your clients... Watch the free sample lectures below!<br></strong></p><p>Want to produce stunning songs? It all starts with compelling drums!</p><p><strong>We're skipping the \"boring fundamental stuff\". This course IS NOT about that...</strong><br></p><p>Instead, we've chosen a handful of practical drum production tricks/approaches that we use to make $1,000+ tracks for our clients! You're about to go from beginner to intermediate :) </p><p>Each lesson gives shows the step-by-step process, discusses the creative decisions that were made, and allows you to hear the technique put to use in a real song. </p><p>The purpose of this course is to help music creators like you learn the secret tips and tricks that make tracks sound unique and relevant. These techniques can be applied to any modern music genre including but not limited to: Electro, Hip Hop, Pop Rock, Indie, Future Pop, Alternative RnB, etc. </p><p><em>This course is easy to follow and is beneficial for music creators of ALL levels especially beginners!</em></p><p><strong>Do I need specific DAW?</strong></p><p>Nope! Although we use Logic X you can use any DAW that you want! </p><p><strong>Why should you take this course? </strong></p><p>Your personal <em>production brand</em> is simply a combination of the techniques you know and you perception of how to best execute them. We promise that you'll absolutely LOVE learning all of these different approaches to producing drums and will be inspired to make better music. </p><p><strong>Who are we? </strong></p><p>This course was created by us, The Songwriting Team. We're a full time production company that creates relevant music for 200+ clients in over 20 countries. We understand what goes into making songs that clients want to pay for. We have a passion for making music and love sharing our knowledge with the world. </p><p><strong>READY FOR A FRESH APPROACH? Enroll now by clicking the big green button.</strong></p><p><strong><em>Let's do this!</em></strong></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Drum Production Bible: Secret Methods For Modern Beat Making", 
    "price": "35.00", 
    "instructors": "The Songwriting Team", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639892_37e2_2.jpg", 
    "course_url": "https://www.udemy.com/drum-production-bible-secret-methods-for-modern-beat-making-vol-1/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T01:40:50Z"
}