{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>\"As an effort to better serve you and meet the demand for this course you can enroll for $10 for the month of March ONLY! Prices will increase August 4, 2016 accordingly.\"</strong></p><p><strong><em>Please continue reading to see how I can help you improve your beats in 2016.</em></strong></p><p>Would like to attract the attention of major labels, artists, and music supervisors?<br></p><p>Would you like to know what 5% of all producers actually getting placements know?</p><p>Would you like to learn the secret to making banging beats?</p><p>Would you like to learn several pro production techniques to improve your sound?</p><p><em>This course is going to help you do that and so much more.  We will be covering how to sequence your drums like a pro and create drum patterns that will separate you from your competition.</em></p><p>I have placements on TV shows such as:</p><ul><li>Real House Wives of Miami</li><li>Fuse News</li><li>Guy Court</li><li>and more..</li></ul><p>and have worked with artists who's mixtapes have been hosted by: Dj Smallz, Dj Ames, and Dj Wreck!</p><p><strong>You can do this and more once you get your drums sounding right!</strong></p><p>People think that it's all about marketing when it comes to getting placements... let me tell you it's all about producing quality music. </p><p>In this course you we will help even a beginner producer take their beats to the next level in any program.</p><p>We cover the basics of drum creation, which you will learn quantization basics, drum sequencing theory, and several other basic beat making fundamentals that will help you understand how to produce music.</p><p>Then in section on actually creating beats you will be able to learn all my best techniques and tips on building a beat from scratch.  </p><p>And finally you will learn the ins and out on turning your \"beat\" into a profitable song! </p><p><em>Don't waste any more time trying to learn how to take your beat to the next level on your own! Learn from my 10 years of experience and improve your production quality in just 2 short hours!</em></p><p>By the way, this is a risk free opportunity! So not only will you learn pro production techniques but if for what every reason, with in the next 30 days you don't like the course information, <strong>you can get a 100% NO QUESTIONS ASKED full money back refund from udemy if this course doesn't meet your expectations!! </strong>(And believe me I wouldn't say that if I didn't know that what's in this course will change the game for you!) </p><p>So you really have nothing to lose. Join a community of music producers killing the competition and become the hottest in you city too!</p><p>Enroll today now! And remember every second you wait someone else is working that much harder to out place you. So get the competitive edge you need and gain the freedom you always wanted to create music full time. </p><p>Believe me, improving your drums is the first step, and with this course you will learn every you need to be great! Click on \"take this course\" now and I'll see you on the other side!</p><p><br></p>", 
    "end_date": null, 
    "title": "Drum Sequencing Techniques: Improve Your Urban Hip Hop Drums", 
    "price": "20.00", 
    "instructors": "Joseph Evans Jr", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630124_6a7c_12.jpg", 
    "course_url": "https://www.udemy.com/drum-sequencing-101/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T06:05:37Z"
}