{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>To me, there is a huge missing gap from online production videos with helping beginning electronic musicians go from being stuck in a loop to writing more full-fledged beats. So it was my intention with this first video to deliver you with the solid foundations of what makes for great programmed drums, and provide you with the skills needed to begin writing more interesting, musical drum parts for your tracks. By getting these very simple foundational ideas under your belt, you begin to understand more about how EDM is structured, how to make beats quickly, and you find yourself making much more creative beats. At least, that's my hope here :) The course is designed for those beginners who want to transition to an intermediate skill level but don't know how. I've made it fast so that you spend less time watching me build these ideas, and more time exploring how they work. In the series, I use examples from a wide variety of Genres-- from Hip Hop to Techno, House, and Future Bass-- to show that these core principles apply across styles. There is over 2 hours of content here, teaching you the core skill of writing beats regardless of which DAW you use. The idea here is to get your skills up to the next level as quickly as possible, and set you up for part 2 of this series, where we explore some of the more creative uses of these foundational ideas. These lessons took years of study for me to discover-- I hope that you take advantage of all that I've learned and boiled down here for you, and get your skills up and running quickly!If you have a computer, a DAW that you're familiar with, a few good drum samples and a way to hear everything, then I will show you how to make beats that make the rest of your music shine.</p>", 
    "end_date": null, 
    "title": "Drum Programming 101: How to write great drum parts", 
    "price": "30.00", 
    "instructors": "Dave Jolley", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559422_c67f_2.jpg", 
    "course_url": "https://www.udemy.com/drum-programming-101-how-to-write-great-drum-parts/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T13:59:17Z"
}