{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t          In this course you will learn How To Do Mashups and Edits, and that is the best way to start to understand how Electronic Music Production works.  </p>  <p style=\"\">  \t          The course works also as an introduction to Music Production techniques, so even if you don´t know how to work with the software you own, this course gives you the first ideas about what music softwares can do.  </p>  <p style=\"\">  \t          Mashups and Edits, are somehow easy to do, but many people do it wrong, not on the beat and with hard transitions. At the end of this course you will be able to do them perfectly, on the beat and with smooth transitions, plus you will learn some introductory tips about EQ, Limiter, Reverb, Pitch, Filter, Automation and BPM Change, that are useful to do quality Mashups and Edits.  </p>  <p style=\"\">  \t          I run the course on Logic Pro, but if you do use any other music software/DAW you can follow the course easily by using the similar plug-ins and techniques I use on Logic Pro on your software.  </p>  <p style=\"\">  \t          During the course I use different Logic Pro built-in plug-ins and some third party plug-ins, so you can familiarize already with some different plug-ins and how they work (don´t be afraid about the third-party plug-ins, you don´t need to buy them, it&#039;s mainly to show you the added value of them comparing to some of the Logic ones.  </p>  <p style=\"\">  \t          The Mashup and Edit I chose for this course are the ones I used already live in the clubs, so they were tested live, with an awesome reaction by the crowd, and supported by many DJs and Producers.  </p>  <p style=\"\">  \t         As a bonus, at the last lecture, I give for download the final result of the course, that is the mashup, the edit and the Logic Pro Template that I use for Mashups  and Edits.  </p>  <p style=\"\">  \t         If it is the case, thanks for watching!  </p>", 
    "end_date": null, 
    "title": "Electronic Dance Music Production: How To Do Mashups & Edits", 
    "price": "20.00", 
    "instructors": "Tiago Teejay", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/197014_2ccc_11.jpg", 
    "course_url": "https://www.udemy.com/edm-how-to-do-mashups-edits/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-10T18:55:26Z"
}