{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Have trouble getting started with a track? Have you </span><strong style=\"\">ever finished</strong><span style=\"\"> one?</span>  </p>  <p style=\"\">  \t  Do you find yourself listening to the <strong style=\"\">same 8 bar loop</strong> over and over again, unable to make a full song out of it?  </p>  <p style=\"\">  \t  Do you struggle to get the ideas in your head onto your computer?  </p>  <p style=\"\">  \t  Do you find yourself lost and unfocused? That you don’t have enough time to spend creating music?  </p>  <p style=\"\">  \t  Do you find yourself unable to <strong style=\"\">write, arrange, and structure</strong> songs?  </p>  <p style=\"\">  \t  If this sounds like you, join me in this video course as I create a song entirely from scratch with an <strong style=\"\">easy to follow step-by-step method</strong> that will have you <strong style=\"\">making tunes for</strong> <strong style=\"\">life.</strong>  </p>  <p style=\"\">  \t  In this video course, I share the easy to follow process that I use to create tracks that <strong style=\"\">eliminates creative blocks and guarantees a finished song</strong> when you’re done with it.  </p>  <p style=\"\">  \t  This video course is broken up into <strong style=\"\">easy-to-follow </strong>sections so that you can choose to work alongside me or digest it all before diving in.  </p>  <p style=\"\">  \t  After watching this course you’ll have the <strong style=\"\">confidence and ability</strong> to get started with a song, arrange it, and then finish it. Over and over again.  </p>  <p style=\"\">  \t<strong style=\"\">Let’s turn those 8 bar loops into 16, 32, and entire songs!</strong>  </p>  <p style=\"\">  \t  ---  </p>  <p style=\"\">  \t<strong style=\"\">Caution!</strong>  </p>  <p style=\"\">  \t  While this is an introductory course for electronic music arrangement, this is <strong style=\"\">not</strong> and introductory course for how to use a DAW (Digital Audio Workstation). If you are not comfortable in whatever software you use to make music, I recommend you do that first.  </p>", 
    "end_date": null, 
    "title": "Electronic Music Arrangement: Escape the 8 Bar Loop", 
    "price": "20.00", 
    "instructors": "Zachary Citron", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/248284_94bf_5.jpg", 
    "course_url": "https://www.udemy.com/electronic-music-arrangement-escape-the-8-bar-loop/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-22T19:11:32Z"
}