{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>GarageBand Masterclass</strong></p>\n\n<p>Do you want to create awesome music for your band, killer audio for your videos or courses, and professional quality voice overs? Have you ever tried recording and producing your own audio projects to find it difficult and time consuming?</p>\n\n<p><strong>What this course is about:</strong><br></p>\n\n<p>This <em>GarageBand Masterclass</em> is aimed to help you understand the fundamentals of using GarageBand for the Mac. This amazing piece of software can help you create a multitude of audio projects, and this is just the course to help you get started!</p>\n\n<p>GarageBand is very easy-to-use software for creating beats, music, voice overs, sound effects, and even ringtones. GarageBand has an extensive resource of libraries and presets to get you up and running in no time. It lets you have complete control over audio adjustments so you can get the right sound you're looking for.</p>\n\n<p><strong>Don't wait to enroll in this premium course today!</strong><br></p>\n\n<p>When you enroll in this course, you will have the benefit of getting quality instruction on how to use GarageBand, direct contact with the instructor, discussion forums with other students, and evergreen content upgrades. Plus, Udemy offers a <em>30-Day Money Back Guarantee</em>; if you do not like this course, you can get your money back! <strong>Don't hesitate, enroll today!</strong></p>\n\n<p>Jeremy Deighan<br></p>\n\n<p>ps - I am here for my students and I always welcome any feedback, questions, discussions, or reviews on my courses. Please visit my profile to see how you can contact me in the most convenient way for you!</p>", 
    "end_date": null, 
    "title": "GarageBand Masterclass: Learn GarageBand Today", 
    "price": "30.00", 
    "instructors": "Jeremy Deighan", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786240_eb69_3.jpg", 
    "course_url": "https://www.udemy.com/garageband-course/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T15:33:35Z"
}