{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>What some of the students are saying about this course:</p><p><em>\"Everything was explained very carefully and a lot of things now makes more sense. Thanks\"</em></p><p>Anson Gebadi *****</p><p><em>\"Not only does Robbie know his stuff inside out, he knows how to communicate his ideas clearly so that I can take action immediately.\"</em></p><p>Michael Choke *****</p><p><em>\"The course is great even if you're an absolute beginner! The course instructor is amazing, and all lessons are easy to grasp and meaningful. I totally recommend this course to anyone who wants to get into music production!!\"</em></p><p>Maanav Khaitan *****</p><p><em>\"Thank you for this course. This course give a good overview of Garageband. The Parts of Mixing Basics and Sound Processing in particular I really liked. Overall a great course\"</em></p><p>Wieland Persoon ****</p><p><strong>***2016 Version Updated*** This course is fully up to date with Garageband 10</strong></p><p><em>The purpose of this course is to help you get a better understanding of the basics of Garageband, and the principles of music production. With this knowledge, you will be much better prepared for my other courses that build projects from scratch.</em></p><p>Are you a total beginner at Garageband?</p><ul><li>Are you interested in making your own music and sharing with your friends?</li><li>Do you wish you could just produce music like your absolute favorite artists?</li><li>Do you have little experience in music production but would love to learn more?</li><li>Do you want to go beyond the basics and create something that you are proud to share with your friends and family?</li><li>Have you been to a music concert or festival and dreamed of being on that stage one day?</li></ul><p>If you have answered YES to all the previous questions, then this is the course for you!</p><p>Through this course, I will show you how to get started with Garageband, and the essential knowledge that every music producer must know.</p><p>Don’t worry! This is not one of those super beginner courses that just teaches you how to save and open files in Garageband. By the end of this course, you will understand how to:</p><ul><li><em>shape instruments into your desired sounds</em></li><li><em>Mix your instrument tracks properly</em></li><li><em>Apply the theories of music and sound design</em></li><li><em>Properly use effects, synths, and equalizers</em></li><li><em>save and open files in Garageband :)</em></li><li><em>Apply these concepts in creating your very own music!</em></li></ul><p><em></em></p>", 
    "end_date": null, 
    "title": "Garageband Tutorial: Produce like a Pro with Garageband", 
    "price": "20.00", 
    "instructors": "Robbie Shaw", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/744100_f91c.jpg", 
    "course_url": "https://www.udemy.com/garageband-tutorial-produce-like-a-pro-with-garageband/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T21:07:43Z"
}