{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Garageband Tutorial: Create a Hip Hop Song in Garageband!</strong></p>\n\n<p>Do you want to produce your own hip hop tracks, lyrics, and instruments? Have you always wanted to make a hit song, but found that recording and producing it to be difficult and time consuming? Did you open Garageband on your computer only to feel overwhelmed by all the tools and buttons in the software?</p><p><strong>What this course is about:</strong><br></p>\n\n<p>This Garageband course is here to help you build out your own complete hip hop song within Garageband for the Mac. This amazing piece of software can help you create a variety of different hip hop tracks, and this is just the course to get your started!</p><p>Garageband is very easy-to-use software for creating beats, music, instrumentals, drum tracks, and even melodies. Garageband has an extensive resource of libraries and presets to get you up and running in no time. It lets you have complete control over audio adjustments so you can get the right sound you're looking for.<br></p><p>You will learn everything, from the basics of writing a hip hop song to the fundamentals of this software. By the end of this course, you will have a complete understanding of how to create your own beats, lyrics, melodies, as well as edit, mix, and master it down into an audio file you can share with the world.</p>\n\n<p><strong>Don't wait to enroll in this premium course today!</strong>\n</p>\n\n<p>The instructors in this course have put together their combined experience in the music and audio production industry to provide you with the hottest course on creating hip hop songs. Plus, Udemy offers a <em>30-Day Money Back Guarantee</em>; if you do not like this course, you can get your money back! <strong>Don't hesitate, enroll today!</strong></p>", 
    "end_date": null, 
    "title": "Garageband Tutorial: Create A Hip Hop Song in Garageband!", 
    "price": "20.00", 
    "instructors": "Joseph Evans Jr, Jeremy Deighan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/816082_d02e_7.jpg", 
    "course_url": "https://www.udemy.com/garageband-tutorial-create-a-hip-hop-song-in-garageband/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-08T04:32:30Z"
}