{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<strong></strong><strong></strong><strong>Wie Du Deinen Gesang mit einfachen Mitteln in top-professioneller Qualität aufnehmen kannst!</strong><p><strong>Du liebst es zu singen, aber Deine Aufnahmen klingen einfach nicht so, wie Du es Dir vorstellst?</strong> Nicht so wie bei den Profis im Radio und im Fernsehen? Du bist deswegen frustriert und willst endlich Aufnahmen von Dir bekommen, die Dir selbst und anderen gefallen, ohne dass Du deswegen in ein teures Tonstudio gehen musst?</p><p><strong>Für wenig Geld kannst Du Dir heute die Geräte beschaffen, für die Du noch vor ein paar Jahren ein Vermögen hättest ausgeben müssen.</strong> Es gibt nur ein winziges Problem: <strong>Mit diesen Geräten umgehen zu lernen ist kein bisschen einfacher als damals</strong>. </p><p>Du kannst Dich jahrelang durch einen Dschungel von <strong>Bedienungsanleitungen, Mythen</strong> und <strong>dummem Geschwätz</strong> wühlen und bekommst immer noch keine vernünftige Aufnahme hin. So wie ich viele, viele Jahre lang. <strong>Oder Du konzentrierst Dich auf das Wesentliche</strong> und lernst dadurch <strong>innerhalb weniger Stunden</strong>, wofür andere Jahre oder Jahrzehnte brauchen. </p><p>In meinem Kurs \"<strong>Gesang professionell aufnehmen</strong>\" zeige ich Dir<strong> in kürzester Zeit die wichtigsten Tricks und Kniffe </strong>und erkläre Dir, <strong>worauf es wirklich ankommt</strong>. Und zwar sowohl bei der Aufnahme von <strong>Pop-, Jazz- oder Rock-Gesang</strong>, als auch bei <strong>klassischem Gesang</strong>. </p><p><strong>Du hörst sofort, was Du eventuell verbessern musst, weil Du nichts mehr auf die schlechte Aufnahme-Qualität schieben kannst.</strong></p>Wer erzählt Dir das?<p>Mein Name ist <strong>Matthias Ernst Holzmann</strong>. Ich singe seit etwa 1984 Pop- und Jazz-Songs und bin seit 1995 auch <strong>professioneller Opernsänger</strong>. Mit meinem Lounge-Song \"Schnorchelabenteuer\" <strong>bei Zyx-Dance war ich kürzlich in den deutschen DJ-Charts</strong> und <strong>gleichzeitig mit meiner Arien-CD \"Operatic Arias\" in den deutschen und britischen iTunes-Charts.</strong></p><p><strong>Ich singe seit mehr als 30 Jahren und habe nur deshalb überhaupt singen gelernt, weil ich frühzeitig damit angefangen habe, mich selbst aufzunehmen und anhand dessen zu korrigieren</strong>. </p><p><strong>Mit Gesangslehrern konnte ich nie etwas anfangen.</strong> Während andere also in der Regel ein <strong>Gesangsstudium</strong> absolvieren, um ein Engagement als Opernsänger zu bekommen, habe ich es mit mehr oder weniger selbst beigebracht, während ich ganz normal von \"9 to 5\" arbeiten ging.</p><p>Seit ein paar Jahren arbeite ich auch als Studio-Sprecher (Hörbuchsprecher, Synchronsprecher, usw.)</p><p><strong>Mein Versprechen an Dich: </strong>Wenn Du alle Geräte beisammen hast (Gesamtkosten weniger als 500 Euro), kannst Du innerhalb weniger Stunden Deine erste professionelle Gesangaufnahme erstellen. Wenn dabei <strong>Fragen</strong> auftauchen, kannst Du sie <strong>im Kurs stellen</strong> und bekommst <strong>innerhalb von 24 Stunden eine Antwort</strong>.</p><p>Du wirst absolute Klarheit über Deinen Gesang bekommen und schneller singen lernen als mit jedem Gesangslehrer dieser Welt - wenn Du Talent hast.</p><p><strong>Bist Du bereit für die wichtigste Investition Deiner Sänger-Laufbahn? Dann sehen wir uns gleich im Kurs!</strong></p><p><em><br></em></p>", 
    "end_date": null, 
    "title": "Gesang professionell aufnehmen", 
    "price": "50.00", 
    "instructors": "Matthias Ernst Holzmann", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647106_0ed6_2.jpg", 
    "course_url": "https://www.udemy.com/gesang-professionell-aufnehmen/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T18:58:38Z"
}