{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Getting your tracks to sound as big and loud as commercial EDM tracks is not easy.  It takes a production skills, great sound design, a well balanced mixdown, and mastering chops to get to the insane loudness levels of today's EDM tracks.  Whatever your opinion on the loudness war, loudness is essential when it comes to EDM; especially if you're looking to get signed or get spins in the clubs and that's a fact of life.</p>\n\n<p>Mastering EDM for loudness can be done in a number of different ways.  In this course, you'll learn the tricks of the trade, the plugins and the techniques used to achieve maximum loudness.  </p>\n\n<p>Whether you're looking to master house, trance, mainroom, or anything in between, this course will show you how to master your electronic music to be loud, clear and punching through those club systems.  </p>\n\n<p>When mastering for loudness you'll be using tools like</p>\n\n<ul><li>Mid/Side EQ</li><li>Multiband compression</li><li>Saturation</li><li>Parallel processing</li><li>Limiting</li></ul>\n\n<p>and some other goodies to achieve that \"wall of sound\" effect that many EDM tracks possess and that can sometimes be very difficult to achieve.</p>\n\n<p>This course was made using Ableton live, its native plugins and number of free plugins to master a festival style EDM track for maximum loudness.  Don't worry if you don't use Ableton Live because you can use ANY DAW.  Links to download the free plugins used in the course will be provided for you when you sign up as well so you'll be good to go!</p><p>So if you're looking to push your tracks to commercial level loudness while still maintaining listening quality, and if you want to stop worrying about your tracks not being loud enough, then this course is definitely for you!<br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "How To Master Your EDM Tracks For Maximum Loudness", 
    "price": "20.00", 
    "instructors": "Fuad Murad", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823908_232c.jpg", 
    "course_url": "https://www.udemy.com/how-to-master-your-edm-tracks-for-maximum-loudness/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-16T19:35:43Z"
}