{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">30 day money back guarantee!</em>  </p>  <p style=\"\">  \t                The &quot;How To Make a Remix in Eight Steps&quot; Udemy course was created to introduce new producers to the process of remixing and to give intermediate producers a few new tips to bring their remixes up to the next level.  Taught by a rising DJ/Producer who&#039;s been doing this for 2-3+ years and counting, this course is <strong style=\"\">filled with tips and tricks that he wishes he would&#039;ve known</strong> when embarking on his quest to re-imagine his favorite artists&#039; tracks.  </p>  <p style=\"\">  \t                This course is structure to be a no-nonsense introduction to the foundations of remixing, which is why <strong style=\"\">it has been designed to take no longer than an hour to complete</strong>. Each lecture is either a 2-6 minute narrated slideshow or a short .pdf with bullet points filling you in on everything you need to know.  </p>  <p style=\"\">  \t                This course is structured to teach you the concepts of remixing, whether you create hip-hop, R&amp;B, or EDM.  That being said, as the instructor produces EDM music on a daily basis, if you produce EDM you may benefit from a few EDM-specific insights.  </p>  <p style=\"\">  \t<strong style=\"\">So if you want to learn how the remix process works quickly or want to take your remixing skills up another level, then the &quot;How To Make a Remix In Eight Steps&quot; Udemy course is the course for you!</strong>  </p>", 
    "end_date": null, 
    "title": "How To Remix a Song in Eight Easy Steps", 
    "price": "30.00", 
    "instructors": "Colin Warn", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408686_ec51_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-remix-in-eight-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T04:31:43Z"
}