{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \tTo listen to the full track we will be creating, please go to lesson 8 below and hear the music. This course is designed so that you can create your very own retro Techno House track using Ableton Live and a free VST plug in Soft Synth. Combined with a free pack to download created by me with all of the sounds and beats. In this course you will learn what sounds are used to create this genre of music and how to arrange them correctly to produce a recording which replicates the classic Techno sound of the late 80&#039;s. The course materials are strictly my samples pack, a free VST synth that you are required to download from the internet and Ableton Live. The course is laid out in very easy to follow videos starting with the beats and then progressing into digital samplers and soft synths. It then goes into other area of production such as automation and filtering sounds, and finally into a mixing and mastering session at the end to create the final product. The course should take you no longer than 2-3 hours to complete if you follow my guidelines. The reason to take this course would be to give yourself a better understanding about Dance Music production in general should you need it and to help you understand how to select the correct sounds for a certain genre.  </p>", 
    "end_date": null, 
    "title": "How to produce a Retro Techno House Record in Ableton Music", 
    "price": "20.00", 
    "instructors": "Rob Webster", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/75360_2529_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-produce-a-retro-techno-house-record-in-ableton/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-07T19:56:41Z"
}