{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course is for those who wish to explore the modern deep house musical genre within Ableton Live 9. This course is structured in a simple and easy to follow manner by importing single drum hits and arranging them to create an original beat pattern. The course then progresses into bass line creation within the Operator rack. We then begin to add other sounds such as an arpeggio and some more percussive sounds. An additional bass line sound is added with the use of a third party vst which can be downloaded for free. We then go through to the final arrangement and mix down. We also explore a basic mastering session to bring the tutorial to an end by using various plug ins within Ableton. The materials used in this are digital samples such as pre-recorded drum hits, a chord pad sample which we will tune to the key of the track and an organ bass sound where we will assign that sound to the keyboard via the simpler and then play in some rhythmic patterns and bass lines.</p>\n\n<p>You should take this course if you want to try a new genre or if you are interested in Dance Music as a producer but not quite sure where to start. This course is suitable for those who have more than a basic knowledge of Ableton.</p>\n\n\n\n<p><br></p>\n\n\n\n<p>It lasts for around 2 hours and by the end of it you will have an advanced knowledge of how to create this type of music using the correct effects and the appropriate techniques which are applied to the arrangement of the track.</p>", 
    "end_date": null, 
    "title": "How to produce a Modern Deep Garage House track in Ableton", 
    "price": "20.00", 
    "instructors": "Rob Webster", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/791588_83c4_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-produce-a-modern-deep-house-track-in-ableton-live-9/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-13T18:27:57Z"
}