{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tAre you a fan of electronic music and want to learn to create it? Maybe you&#039;re a musician who&#039;d like to learn a little more about production. Whatever the case, this comprehensive course has you covered. Using Ableton Live as a medium, you&#039;ll learn fundamental production skills that can be carried through to future projects and applied to all genres of music.  </p>  <p>  \tThe course offers both theoretical AND practical teachings, both combined logically. If you&#039;re looking for something comprehensive yet easy to understand, at an unbeatable price - then this is for you.  </p>  <p>  \t<strong style=\"\">In this course we cover a few things, including:</strong>  </p>  <ul style=\"\">  \t<li>Ableton Basics (how to use it, etc)</li>  \t<li>MIDI and Samples</li>  \t<li>Drums (drum samples, programming, examples)</li>  \t<li>Bass (the importance of bass, programming, examples)</li>  \t<li>Synths and Leads (basic theory, melody, simple sound design)</li>  \t<li>Sound Design (basic synthesis, tricks and tips)</li>  \t<li>Arrangement (putting our song together)</li>  \t<li>EQ and basic mixing</li>  </ul>  <p>  \t  By the end of this course, you&#039;ll have your very own song to take away. In addition to that, you&#039;ll have enough knowledge to go ahead and produce your very own unique song.  </p>  <p>  \t<strong style=\"\">How long will this course take to complete?</strong>  </p>  <p>  \t  This is a fairly comprehensive course that will take a number of hours to complete. Most people finished the FL Studio course in less than two weeks.  </p>  <p>  \t<strong style=\"\">Course Structure</strong>  </p>  <p>  \t  This course is structured in a unique way due to the song creation process. I&#039;ve organized everything to be in the most effective logical order to grasp understanding of each section.  </p>  <p>  \t<strong style=\"\">Why take this course?</strong>  </p>  <p>  \t  You might be wondering why you&#039;d pay real money for this course when there&#039;s thousands of videos on Youtube.  </p>  <p>  \t  The fact is, there&#039;s few people offering complete and comprehensive courses of this nature. There&#039;s nothing wrong with learning from YouTube, and there is some great content out there. If you want to learn the practical way, then I recommend taking this course.  </p>", 
    "end_date": null, 
    "title": "Introduction to Electronic Music Production with Ableton ", 
    "price": "25.00", 
    "instructors": "Sam Matla", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59131_351d_2.jpg", 
    "course_url": "https://www.udemy.com/electronic-music-production-with-ableton/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-09T22:26:11Z"
}