{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>In this course for Ableton Live 9, and Ableton Live Lite 9, you will learn how to navigate and manage your workflow from a preset arrangement to the final steps of export. I will go over how to do the basics tasks, and walk you through the skills you need to know, to take your song/arrangement to the final steps. </p><p>This course is designed for beginners, however it is useful for any experience level. You will learn about organization, and I will share with you my tips from using Live, after producing over 300 songs with the program. </p><p>I make short lessons to follow along, so if you only have a little amount of time, you can take a lesson here and there. I make things to the point, quick and simple. </p><p>My goal is to help you learn in a easy and direct route, to cut your learning curve, and get you up and running with Ableton Live as efficiently as possible. </p><p>You will learn all the basics, all the main pieces. My lessons are what I teach, so if you miss something, it will be easy for you to find the lesson, and watch it again. </p><p>I want you to be comfortable with using Ableton, so I have spent the time to go over in this course, exactly what you need to know, and in the order that you need to go in, so that you can fix the song/arrangement incrementally. </p><p>I give you lots of tips and tricks, that are in almost every lesson, with all the experience that I have accumulated now ready for your consumption. Take advantage of my 20+ years of music industry experience, along with vast knowledge of sequencing, arranging, compositions, and my easy style of teaching. </p><p>I had a lot of fun making this course, and I hope that you enjoy it, as much as I enjoyed making it. Also please leave your feedback and comments, as I treasure that and greatly appreciate how this course was able to help improve your skills and abilities. </p>", 
    "end_date": null, 
    "title": "Introduction to Ableton Live", 
    "price": "20.00", 
    "instructors": "Sam Gill", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589448_db25.jpg", 
    "course_url": "https://www.udemy.com/beginning-with-ableton-live/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T14:14:54Z"
}