{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t El curso da un repaso general por las órdenes y menús más básicos para poder generar rápidamente un proyecto musical. En él se dará un vistazo a los diferentes menús, partes y ventanas que el programa nos presenta. Se explicará de una manera rápida el contenido y la función de cada uno de los elementos, a la vez que se construye un tema musical muy básico.  </p>  <p>  \tEs un software alemán desarrollado por apple Inc. para la edición de audio de la forma más profesional. Especialmente indicado para músicos, productores y DJ´s, está pensado tanto para la composición musical como para la música en directo. La interfaz consiste en una sola ventana con diferentes secciones: Vista ¨sesion¨ pensada para sesiones en directo o grabaciones improvisadas y la vista ¨arrangement¨ más orientada a la composición y edición en estudio.  </p>  <p>  \tEste curso es impartido por Miguel Sar, artísticamente conocido como Tadeo. Actualmente director artístico en Fluzo Studios, he realizado infinidad de trabajos a nivel profesional. Comenzó su andadura profesional en el año 1996, desde ese momento y hasta la actualidad viene realizando funciones de disc-jockey, productor, mezclador y masterizador de música. Además de poseer dos sellos discográficos, publicar mas de una veintena de discos y ser un artista de carácter internacional, en los últimos tres años viene ofreciendo varios cursos de mezcla y síntesis del sonido enfocado tanto a principiantes como a profesionales que quieren ampliar conocimientos o depurar su técnica dentro del estudio, para conseguir un sonido limpio y potente que respete las normas del rango dinámico.  </p>", 
    "end_date": null, 
    "title": "Iníciate con Ableton Live", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/182602_e8ee_2.jpg", 
    "course_url": "https://www.udemy.com/iniciate-con-ableton-live/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-14T17:17:32Z"
}