{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Kick&amp;bass — is a basis of ANY electronic dance track. <br>Need more reasons to learn how to make it professionally? <br></strong></p><p>Powerful kick&amp;bass will make 50% of your track. Bad kick&amp;bass will ruin any track, doesn't matter how cool is the melody and design... </p><p>In this course you will learn all major skills for mixing kick&amp;bass sounds for your dance track. All professionals use them on every track, so you should do that to achieve pro-sound. </p><p>You think, you know how to make kick&amp;bass? Do you tune your kick to the tone of the track? Can you provide transparent and powerful kick&amp;bass sound in a club, on home sound system and in headphones? Can you find the best kick&amp;bass length for particular BPM?<br></p><p>If you are confusing with this questions — try this course. You will have better sound: more powerful, loud, clean and groovy.</p><p><strong>Why you should look for this video:</strong></p><ul><li>Kick &amp; Bass is a basis of any dance track</li><li>I give you direct experience as a music producer &amp; trainer </li><li>You will have modern information on the topic</li></ul><p><strong></strong></p><p><strong>How much time you need to have results:</strong><span></span><span></span></p><p>This is 110 min course. Spend 3-5 hours on practice and you will learn all professional skills for mixing kick&amp;bass. Sure this techniques will be growing with you and it needs time for full understanding. But I can confidently say that right after you will start to use this tricks, your sound will become much better!<br></p><span></span>", 
    "end_date": null, 
    "title": "Kick & bass mixing in electronic music", 
    "price": "20.00", 
    "instructors": "Nikita Om", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672886_47f1_4.jpg", 
    "course_url": "https://www.udemy.com/kick-bass-complete/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T03:30:00Z"
}