{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>As EDM producers, we all know that the kick drum can make or break your track.  We also know that finding the right kick drum sample that fits perfectly in the mix can be one of the hardest things to do.</p><p>We've all been in that situation where we go through hundreds of samples, process them for hours and days only to end up disappointed.  </p><p>Well what if I told you that for the price of one sample pack, you can take a course that will teach you how to synthesize your own amazing kick drums that will fit perfectly in the mix every single time?  That's exactly what this course is all about.</p><p>In this course, I'll walk you through how to make your own kick drum using Sylenth 1 starting with a simple sine wave and ending up with huge kick samples.  We'll even test drive the samples out with melody and percussion loops so we can actually hear how they sound in action.  I'll then take you through all the effects and plugins to use to tweak your kick drum sounds.</p><ul><li>Distortion</li><li>EQ</li><li>Compression</li><li>Limiting</li><li>Transient control</li><li>Tube saturation</li></ul><p>It's all there.  You can literally make hundreds of variations with all the little tips and techniques.<br></p><p>If you've ever wondered how to make your own kick drums and what effects and plugins to use to make them sound as tight, powerful, punchy and awesome as possible, then this course is definitely for you.</p><p>Making your own kick drum samples is also tons of fun.  You can spend hours tweaking away and making different variations and coming up with kick drums better than anything you've heard before. </p><p>So stop going through hundreds of samples and save yourself a ton of time and headaches.  When you sign up, you get lifetime access to the course and a 30-day full money-back guarantee.  <br></p><p><br></p>", 
    "end_date": null, 
    "title": "Kick Drum Synthesis With Sylenth 1", 
    "price": 0, 
    "instructors": "Fuad Murad", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848248_8216.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-kick-drum-sylenth1/", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T17:15:05Z"
}