{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t            This course is designed for beginner users of Logic Pro 9 and Logic Pro X, who want to learn the professional way of sampling for Hip-Hop/Rap music. If you are a current Logic user and have always wanted to learn the skill of sampling, this course will teach you everything you need to know so you can publish your own beats.  </p>  <p style=\"\">  \t          This course is very detailed and is broken up into five sections. The first portion will cover Logic&#039;s ESX24, which is the sampler plug-in that is already preinstalled in the software. The next section will cover how to import drum sounds into the sampler, so that you can create your own personal drum kits. After, the course will teach some great techniques on how to sample sections from songs. This will allow you to construct a melody out of these samples so that you can overlap it with a Hip-Hop style beat. During this course, I will teach you how to properly mix your melodies and drum sections. Lastly, this class will teach how to master and finalize a sampled beat within the software.  </p>  <p style=\"\">  \t    If there are any questions, please ask! I read my inbox everyday, so I will be able to respond very quickly.  </p>  <p style=\"\">  \t        I am sure you will find this course to be an easy and fast tool for learning the professional way of sampling with Logic. I am looking forward on helping you achieve your goals with your music production. Good Luck!  </p>", 
    "end_date": null, 
    "title": "Learn how to Sample for Hip-hop in Logic Pro", 
    "price": "20.00", 
    "instructors": "Michael Marino", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/174626_f1d1_6.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-sample-for-hip-hop-in-logic-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-28T21:30:07Z"
}