{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><em><strong>About this course:</strong></em></p><p>  \t                             Compressors are the most mysterious of all studio processors, and yet they are one of the most important in today's music production. Whether you're into recording, mixing, mastering, live sound, broadcast, or podcasts you need to know how to use compressors. In this class you'll learn everything about using compressors. We'll take you from basic understanding of compression through the subtle differences between the most popular compressors.  </p>  <p>  \t                    Learning these differences and knowing where to apply them can take an OK recording/mix and make it a great recording/mix. We'll teach you a fool proof system to set up any compressor on any instrument – it's all about setting up the controls in the correct order, knowing what's possible and using your ears.    We'll also show you tried and true compressor/instrument combinations to get genre specific sounds. Because compressors are the most complex and abundant studio dynamics processors, that's where we'll spend most of our time. But because there are many ways to control dynamics, you'll also learn how to use expanders, gates and limiters.  </p>    <p>  \t<strong>  In this class you'll learn... </strong>  </p>  <p>  \t                   Basic compressor controls. Advanced compressor controls. Different types of compressors. What compressors are commonly used for certain instruments. How to setup any compressor on any instrument.  </p>  <p>  \t<em>  What to listen for when setting up a compressor on:</em>   \t                   Drums (Kick, Snare, Toms, Overheads, Room Mics). Drum Busses. Bass Guitars. Synthesizers. Acoustic Guitars (rhythm and lead). Vocals (lead, backgrounds, harmonies). Voice Overs.  </p>  <p>  \t<em>Advanced techniques like: </em>  \t<strong></strong>Sidechain compression. Serial compression. Parallel compression. Multiband compression. Mix bus compression. Mid-Side (MS) compression. Automating the controls.  </p>  <p>  \t<strong>You'll also learn how to...</strong>  </p>  <p>  \t<strong></strong><em>Use Expanders and Gates on:</em><strong>   \t</strong>Live drums to reduce bleed. Drum samples to change their envelope. Bass and electric guitar to get rid of hiss and hum. Vocal tracks to reduce breath noise. Voiceover tracks to reduce room noise and AC hum.  </p>  <p>  \t<em>Advanced Expander/Gate techniques like:</em>   \t                   Sidechaining a synth pad with a percussion loop to add motion. Using gating and compression together in a channel strip. Use envelope modulators like SPL's Transient, Waves' TransX  and Logic's Enveloper.  </p>    <p>  \t<strong>  Engineer Ian Sutton background:</strong>  \t                           Engineer/Producer Ian Sutton has worked with hundreds of artists and bands, including +44 (Mark Hoppus &amp; Travis Barker) Fallout Boy, Rob Halford, and Frankie J, just to name a few. Ian will thoroughly walk you through one of his most recent pop rock mixes, revealing all sorts of creative mixing and production techniques he's acquired throughout years of study and practice.  </p>  <p>  \t                           Ian Sutton is a graduate of The Conservatory of Recording Arts and Sciences. He is Certified Pro in Apple's Logic and Avid's Pro Tools. Ian has also worked with the likes of +44 (Mark Hoppus &amp; Travis Barker), Fallout Boy, Frankie J, Rob Halford of Judas Priest, T-Pain, Deepak Chopra, Jerry Lewis, Los Tucanes de Tijuana and many more.  </p>  <p>  \t<strong>             IMPORTANT!! What happens if you don't get professional help?</strong>  \t                           Well ask yourself this, 3 months from now how much better will my mixes sound? The reality is without proper training they won't sound much different. Yes, you can spend hours, days, and weeks trying to find YouTube clips online, but they only do so much. This mixing class has 4 hours of instruction from a professional Recording Studio with over 25 years of experience servicing some of the biggest bands in the world. Invest in something that matters, your passion in creating music! We're the answer to help you get better.  </p>", 
    "end_date": null, 
    "title": "Learn Compression & Dynamics Processing: The Complete Guide!", 
    "price": "50.00", 
    "instructors": "Signature Sound, Ian Sutton", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404741_6c76.jpg", 
    "course_url": "https://www.udemy.com/compression/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T21:42:31Z"
}