{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><em style=\"\"><strong style=\"\">About this course:</strong></em></p><p>Compressors are the most mysterious of all studio processors, and yet they are one of the most important in today&#039;s music production. Whether you&#039;re into recording, mixing, mastering, live sound, broadcast, or podcasts you need to know how to use compressors. In this class you&#039;ll learn the fundamentals of mixing with compression.</p><p>Learning these differences and knowing where to apply them can take an OK recording/mix and make it a great recording/mix. We&#039;ll teach you a fool proof system to set up any compressor on any instrument – it&#039;s all about setting up the controls in the correct order, knowing what&#039;s possible and using your ears. We&#039;ll also show you tried and true compressor/instrument combinations to get genre specific sounds. Because compressors are the most complex and abundant studio dynamics processors, that&#039;s where we&#039;ll spend most of our time. </p><p><strong style=\"\">In this class you&#039;ll learn...</strong></p><p>Basic compressor controls. Advanced compressor controls. Different types of compressors. What compressors are commonly used for certain instruments. How to setup any compressor on any instrument.<em style=\"\"></em></p><p><em style=\"\">What to listen for when setting up a compressor on:</em> Drums (Kick, Snare, Toms, Overheads, Room Mics). Drum Busses. Bass Guitars. Synthesizers. Acoustic Guitars (rhythm and lead). Vocals (lead, backgrounds, harmonies). Voice Overs.<strong style=\"\"></strong></p><p><strong style=\"\">Engineer Ian Sutton background:</strong><strong style=\"\"></strong><strong style=\"\"></strong> Engineer/Producer Ian Sutton has worked with hundreds of artists and bands, including +44 (Mark Hoppus &amp; Travis Barker) Fallout Boy, Rob Halford, and Frankie J, just to name a few. Ian will thoroughly walk you through one of his most recent pop rock mixes, revealing all sorts of creative mixing and production techniques he&#039;s acquired throughout years of study and practice.</p><p>Ian Sutton is a graduate of The Conservatory of Recording Arts and Sciences. He is Certified Pro in Apple&#039;s Logic and Avid&#039;s Pro Tools. Ian has also worked with the likes of +44 (Mark Hoppus &amp; Travis Barker), Fallout Boy, Frankie J, Rob Halford of Judas Priest, T-Pain, Deepak Chopra, Jerry Lewis, Los Tucanes de Tijuana and many more.<strong style=\"\"></strong></p><p><strong style=\"\">IMPORTANT!! What happens if you don&#039;t get professional help?</strong> Well ask yourself this, 3 months from now how much better will my mixes sound? The reality is without proper training they won&#039;t sound much different. Yes, you can spend hours, days, and weeks trying to find YouTube clips online, but they only do so much. This mixing class has 3+ hours of instruction from a professional Recording Studio with over 25 years of experience servicing some of the biggest bands in the world. Invest in something that matters, your passion in creating music! We&#039;re the answer to help you get better.</p>", 
    "end_date": null, 
    "title": "Learn Compression: The Beginners Guide to Mixing!", 
    "price": "20.00", 
    "instructors": "Signature Sound, Ian Sutton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541484_2e2d.jpg", 
    "course_url": "https://www.udemy.com/learn-compression-mixing/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T18:13:09Z"
}