{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Delay is quite possibly the most used, yet misunderstood creative tool in the mixing engineer’s arsenal. Every major record you’ve heard in the past 40-60 years has had some instance of delay on it. Beginning at an explanation of the brief history of Delay along with some basic functions, all the way to advanced techniques as well as a primer of the physics behind the tool, in this class you’ll learn everything you need to know about the Delay tool!<br></p>We’ll be focusing on common applications of the Delay tool, found in contemporary music, as well as some techniques to help simulate a vintage sound in your mix! We’ll also go through how to setup your Delay on any instrument and explain why the order of operation is important. We’ll spend the majority of this course examining techniques, since this is an application dependent tool, but we’ll also touch on some effects like Flangers and Choruses, that can be made using a Delay tool with some post-processing.<p><br><strong>In this class you'll learn...<br></strong>Digital Delay use. Analog Delay functionality. Creating depth in a 2-Dimensional plane. Simulating a doubled track. Different models of Delay. Physics of Sound Waves. Differentiation of Reverb and Delay. How to setup Delay.</p><p><em><strong>What to listen for when using a Delay on:<br></strong></em>Drums. Guitars (lead and rhythm). Piano. Vocals (lead, backgrounds, harmonies).</p><em><p><em><strong>You’ll also learn advanced techniques like…<br></strong></em>Throwing Delay using Automation. Artificial Stereo Spread. Acoustic environment simulation. Embellishment of an element within a mix.</p></em>", 
    "end_date": null, 
    "title": "Learn Delay: The Complete Guide to Mixing with Delay!", 
    "price": "50.00", 
    "instructors": "Signature Sound, Elmo Arteaga", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691706_14b2_2.jpg", 
    "course_url": "https://www.udemy.com/mixing-with-delay/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T03:39:47Z"
}