{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>***2016 Version Updated*** This course is fully up to date with Garageband 10.1</strong></p><ul><li><em>Are you a total beginner at Garageband?<br></em></li><li><em>Are you interested in making your own music and sharing with your friends?<br></em></li><li><em>Do you wish you could just produce music like your absolute favorite artists?<br></em></li><li><em>Do you have little experience in music production but would love to learn more?<br></em></li><li><em>Do you want to go beyond the basics and create something that you are proud to share with your friends and family?<br></em></li><li><em>Have you been to a music concert or festival and dreamed of being on that stage one day?<br></em></li><li><em>Do you LOVE Daft Punk?</em></li></ul><p>If you have answered <strong>YES</strong> to all the previous questions, then this is the course for you!<br></p><p>In <strong>one week</strong>, you will learn how to recreate one of Daft Punk’s most famous songs, even if you have no musical experience.</p><p><strong>Don’t worry!</strong> This is not one of those super beginner courses that just teaches you how to save and open files in Garageband. By the end of this course, you will have learned how to:</p><ul><li><em>Shape instruments into your own desired sounds</em></li><li><em>Mix your instrument tracks properly</em></li><li><em>Create energetic build-ups and transitions</em></li><li><em>Apply the theories of music and sound design</em></li><li><em>Listen to your favorite music and understand how to recreate it</em></li><li><em>Properly use effects, synths, and equalizers</em></li><li><em>save and open files in Garageband :)</em></li><li><em>Apply these concepts in creating your very own music!</em></li></ul><p>You will learn so much from this course. And even if you don’t feel that this course is for you, there’s always a <strong>30-day money back guarantee</strong>. So you have <strong><em>absolutely nothing to lose</em></strong>!</p><p><strong>What if I want to learn Garageband on my own?</strong></p><p><strong></strong>Yes, there are tons of videos on Youtube that teaches you how to produce your own music in Garageband, but it’s hard to see your progress with these videos. It’s like trying to learn the guitar with a new teacher every week. Half the time, you will be stuck learning the same thing over and over again. Save yourself the time, and learn from my years of experience. This course moves from lesson to lesson so that you are able to fully grasp how to produce music in Garageband within one week. Remember, <strong><em>your time is valuable</em></strong>! Don’t waste it sifting through hours of Youtube footage.</p>", 
    "end_date": null, 
    "title": "Learn Garageband: Recreate Daft Punk with Garageband!", 
    "price": "20.00", 
    "instructors": "Robbie Shaw", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737362_1559.jpg", 
    "course_url": "https://www.udemy.com/learn-garageband-recreate-daft-punk-in-one-week/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T23:44:47Z"
}