{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \tHere&#039;s what some students are saying about this course:  </p>  <p style=\"\">  \t&quot;This course is amazing. I&#039;ve tried to learn Massive through tons of Youtube videos and other sources previously. This course taught me so much more in the first couple of sections than all of my previous efforts combined. Dylan takes time and goes through every single slider, knob, and setting and describes it&#039;s function and usefullness. I&#039;m about half-way through the lectures, and I can&#039;t wait to get to Section 8 where the knowledge is applied.&quot;  </p>  <p style=\"\">  \t- J. DiPalmo  </p>  <p style=\"\">  \t&quot;Dylan&#039;s experience on the topic and his ability to analyze and simplify complex materials, compounded with solid presentation skills, rich articulation and enthusiasm throughout this lecture series, resulted in a 5-star winner product.&quot;  </p>  <p style=\"\">  \t- A. Stergiopoulos  </p>  <p style=\"\">  \t&quot;Great intro to sound design using massive.. Dylan does a great job explaining the concepts without drowning you in a sea of technical information.&quot;  </p>  <p style=\"\">  \t - F. Carvalho  </p>  <p style=\"\">  \t  &quot;I am new with sound production and this course inspired me to keep learning. Mr Bowes knows his stuff and he teach based on his own experience instead of just following the course outline. Thanks man.&quot;  </p>  <p style=\"\">  \t - Akmal  </p>  <p style=\"\">  \t  --  </p>  <p style=\"\">  \t<strong style=\"\">      This course is a comprehensive training course in the popular and powerful &quot;Massive&quot; VST plug-in from Native Instruments. Using 100% high-definition screencasts, you will learn the ins and outs of this software.</strong>  </p>  <p style=\"\">  \t      In 1 week, you will be able to create huge, earth-shaking basses, lush pads, screaming leads, and even some crazy FX presets.  </p>  <p style=\"\">  \t      I created this course because learning the principles of true sound design opened up a <strong style=\"\">world of possibilities</strong> for my productions. Massive helped get me there. Now I want to show you how to get there too.  </p>  <p style=\"\">  \t      You&#039;ll get access to <strong style=\"\">52 video tutorials</strong>. That&#039;s over <strong style=\"\">10 hours of content</strong>. Plus I include all of the preset files that we build in the course for free. All for a really great price with a 30 day money-back guarantee. You can&#039;t beat that.  </p>  <p style=\"\">  \t      You know that you&#039;re sick of being a preset-picker. Learn sound design and get over that production plateau that has been making you hate your mediocre mixes.  </p>  <p style=\"\">  \t      You will become a <strong style=\"\">master</strong> of Massive.  </p>  <p style=\"\">  \t   --  </p>  <p style=\"\">  \t   A few words about the methodology of this course. The first third of the course features lectures that describe elements of the software including the user interface, navigating presets, and how to control parameters. The middle portion of the course delves into sound design techniques and modulation assignments. The last third features in-depth tutorials about building specific sounds. If you already have a pretty good handle on Massive (or other soft synths) then you may want to skip the introductory portions. I designed this course to take the student from complete novice to expert. In other words, I wanted a student who has no experience with sound design or synthesizers to feel comfortable. However, I also provide lots of deep content for more experienced users. Plus, if you&#039;re like me, hearing someone else explain what I thought I already knew is still very helpful. All that to say, feel free to jump around in the chronology of the course. But don&#039;t take the fundamentals for granted.  </p>  <p style=\"\">  \t      --  </p>  <p style=\"\">  \t      P.S. You can follow me on <a href=\"http://twitter.com/emptutorials\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Twitter</a> for deals, discounts, and lots of great production tips. And don&#039;t forget to check out my <a href=\"https://www.udemy.com/createaremixinlogicpro9/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">other course</a> on creating a remix. Thanks! -DB  </p>", 
    "end_date": null, 
    "title": "Massive Tutorial: Master \"Massive\" in One Week", 
    "price": "20.00", 
    "instructors": "Dylan Bowes", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59408_6751_11.jpg", 
    "course_url": "https://www.udemy.com/massive-tutorial-master-massive-in-one-week/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-11T08:13:22Z"
}