{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Join Over 200 Awesome Producers Who Have Taken This Course</strong>  </p>  <p style=\"\">  \t            Start mastering your EDM tracks like a pro with no expensive or fancy 3rd party plugins whatsoever.  Just like my current 200+ students. Everything is done using Ableton Live.  <strong style=\"\"><em style=\"\">All you need is your DAW.</em></strong>  </p>  <p style=\"\">  \t<em style=\"\">Note - If you&#039;re looking for the &quot;magic plugin&quot; that transforms your tracks from amateur to professional then please do not take this course.  This course will teach you how to use native plugins to finalize your mix and create professional sounding masters.</em>  </p>  <p style=\"\">  \t<em style=\"\">--------------------------------------</em>  </p>  <p style=\"\">  \t<strong style=\"\">About This Course</strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\"></strong>Over 200 amazing producers</li>  \t<li>No expensive plugins at all required - only free plugins!</li>  \t<li>Excellent reviews and feedback, a 5 star rating</li>  \t<li>All future lectures and upgrades are included for free</li>  \t<li>Unconditional Udemy 30 day money-back guarantee </li>  \t<li>Periodical, free advice and tips from me to help improve your production skills</li>  \t<li>Every once in a while I send out freebies and goodies for my students!</li>  </ul>  <p style=\"\">  \t            SEE HOW I GET  </p>  <ul style=\"\">  \t<li>Professional sounding EDM tracks using only native plugins, forget about expensive plugins.  Everything is done in Ableton Live</li>  \t<li>Loudness, punch, depth and clarity</li>  \t<li>Balanced and polished sounding tracks</li>  </ul>  <p style=\"\">  \t            ...all in an easy to follow course with everything clearly explained.  </p>  <p style=\"\">  \t            Today, you can start making your tracks sound better, more professional, easily and quickly without expensive plugins or complicated techniques.  </p>  <p style=\"\">  \t            Take the guesswork out of mastering your next electro house hit.  Learn all the techniques, tools and tricks used by the pros to achieve a clear, punchy and loud final mastered version of your track.  This course will cover basic mastering tools such as:  </p>  <ul style=\"\">  \t<li>EQ</li>  \t<li>Compression</li>  \t<li>Saturation and Harmonic Exciting </li>  \t<li>Limiting</li>  </ul>  <p style=\"\">  \t                 As well as more advanced techniques such as:  </p>  <ul style=\"\">  \t<li>Mid/Side EQ</li>  \t<li>Multiband Dynamics</li>  \t<li>Parallel Compression</li>  \t<li>Volume Matching</li>  \t<li>Peak &amp; RMS Monitoring</li>  \t<li>Dithering</li>  \t<li>Spectrum Analysis</li>  </ul>  <p style=\"\">  \t                 The course is structured in such a way to help you understand the flow of the mastering process and the reasoning behind each of the individual steps and techniques involved.  </p>  <p style=\"\">  \t                 The course should take 1 day to complete and will give you a comprehensive understanding of the mastering process.  </p>  <p style=\"\">  \t                 If you&#039;ve ever felt that your songs don&#039;t stand up to commercially released tracks in terms of clarity, punch, loudness and power, or you need a deeper understanding of the mastering process, this course is perfect for you.  What makes this course unique is that you&#039;re shown the mastering process using <strong style=\"\">native plugins</strong> in <strong style=\"\">Ableton Live, </strong>which means you can forget about fancy plugins that you may or may not have.  </p>  <p style=\"\">  \t      ------------------------------  </p>  <p style=\"\">  \t      Learn EDM mastering now and I guarantee you&#039;ll make your tracks sound better.  </p>  <p style=\"\">  \t<strong style=\"\">Click The Green Button On The Top Right Corner And Take This Course Now!</strong>  </p>", 
    "end_date": null, 
    "title": "Mastering EDM in Ableton Live Using Native Plugins", 
    "price": "20.00", 
    "instructors": "Fuad Murad", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/80928_6776_5.jpg", 
    "course_url": "https://www.udemy.com/mastering-electro-house/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-19T22:48:10Z"
}