{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Every producer and mastering engineer has their own favorite plugins that they like to use.  Each set of plugins has its advantages, even native plugins have some advantages.  However, some plugins just go above and beyond in terms of quality, sound, flexibility and ease of use.  Fabfilter plugins do just that.</p><p>Using Fabfilter plugins to master your tracks can transform the way you approach mastering.  Not only are they some of the best sounding plugins on the market, they're also extremely flexible in what they can do and offer beautiful interfaces to make your mastering sessions a joy.</p><p>In this course, you'll learn how to master your tracks using Fabfilter plugins to tackle a problematic mixdown.  We'll dive deep into Fabfilter's various plugins and their settings to address mastering goals that we will set together as we listen to the track. All major aspects of mastering are covered in this comprehensive course including</p><ul><li>Stereo processing</li><li>Mid/side EQ</li><li>Harmonic distortion</li><li>Compression</li><li>Limiting</li><li>Parallel processing</li></ul><p>We'll take it one step at a time as we listen to the track to finish and set goals.  We will then proceed to address each of our goals and issues and walk through the proper settings and plugins to use.  Each step is clearly explained with attention to how and why to use the plugins and settings to achieve what we want.<br></p><p>So if you're looking to use Fabfilter plugins (which you absolutely should) to master your tracks to a professional level, then this course is definitely for you.  You'll get lifetime access to the course and a full moneyback guarantee if you're not completely satisfied.</p><p>And if you don't use Fabfilter plugins to master your tracks, you can still gain a ton of useful information from the course as it covers all major topics of mastering in detail.  Whether you're just starting to learn about mastering, or an expert looking to add to your bag of mastering tricks, this course is very well organized and easy to follow.<br></p>", 
    "end_date": null, 
    "title": "Mastering EDM With Fabfilter Plugins", 
    "price": "25.00", 
    "instructors": "Fuad Murad", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/835672_4dc1.jpg", 
    "course_url": "https://www.udemy.com/mastering-edm-with-fabfilter/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-29T22:11:34Z"
}