{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>When it comes to mastering EDM, few names are as synonymous with industry standard quality as Waves.  With a virtually endless selection of plugins to choose from, you can achieve anything and everything you can imagine in terms of mastering.</p><p>Mastering electronic dance music can be tough, but by having a clear plan of action and the right set of plugins, you can get a grip on the mastering process and understand why and how to use the tools you have at your disposal.</p>\n\n<p>In this course I’ll walk you through mastering a hard hitting disco house track from start to finish using some of the best plugins Waves has to offer.  </p>\n\n<p>We’ll dive deep into EQ, linear phase processing, multiband compression, peak and rms levels, Analog emulation and much more.  Some of the things you will learn in this course include:</p><ul><li>Why and how to use linear phase EQ to balance frequencies, improve clarity and reduce muddiness</li><li>Using linear phase multi band compression to balance dynamics and polish up your sound</li><li>Using analog emulation and saturation to introduce warmth, character and richness</li><li>Monitoring peak and RMS levels to ensure an accurate mastering session</li><li>much much more...</li></ul><p>\n\n</p><p>If you’ve ever gotten lost in the ocean of plugins from Waves and want to learn which ones to use to    master your tracks professionally, then this course is definitely for you.  As always, your instructor will always be around for any questions, comments and discussions so you don't have to worry about a thing!</p>\n\n<p>Sign up today to get access to this course for life as well as a full money back guarantee if you’re not completely satisfied.</p>", 
    "end_date": null, 
    "title": "Mastering EDM With Waves Plugins", 
    "price": "20.00", 
    "instructors": "Fuad Murad", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/843078_1207.jpg", 
    "course_url": "https://www.udemy.com/mastering-edm-with-waves-plugins/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-08T23:45:22Z"
}