{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Mastering electronic music is not easy.  In fact, it's downright hard\n as hell.  Getting your tracks to sound loud, punchy, rich, full and \nclean all at the same time can have you pulling your hair out in no-time\n or worse, abandoning a project altogether.  </p>\n\n<p>Luckily, there are so many mastering plugins and tools out there \ndesigned to make our lives easier when it comes to mastering our EDM \ntracks.  One of the best plugins to master your tracks is Izotope Ozone.\n  It comes packed with features to help you glue your mix, balance \nfrequencies, add richness and character and get your tracks sounding as \nloud and proud as the big boys.</p>\n\n\n\n<p>In this extensive course, I'll take you through each of Ozone 7s \nmodules and dive deep into the techniques you need to create incredible \nsounding masters for any electronic piece you produce.  This is a \ntell-all course that will teach you exactly how i and other mastering \nengineers work to transform less than perfect mixdowns into polished \nmasters ready for the world to enjoy.</p>\n\n\n\n<p>You'll be learning things like:</p>\n\n\n\n<ul><li>EQ techniques for a cleaner mix, tighter bottom end, and a top end that sparkles</li><li>Multiband compression for a more balanced track that plays well on any system</li><li>Stereo imaging that will result in a wider, richer master that translates well on different systems</li><li>Using distortion and saturation for extra richness and character</li><li>How to get your tracks loud without distortion</li><li>Using Ozone's new vintage modules to add vibe and warmth</li></ul>\n\n\n\n\n\n\n\n<p>Whether you're new to Ozone or have been using it for years, this \ncourse is guaranteed to teach you something new with a fresh approach to \nmastering your own tracks with Ozone 7, or even other people's tracks.\n</p>\n\n\n\n<p>You also get to be in direct contact with me at any time and have \nlifetime access to the course once you enroll.  You can ask questions, \npost comments and start discussions with myself and other students in \nthe course.  </p>\n\n\n\n<p>Whether you produce house, trance, deep house, trap or anything in \nbetween, there's something in this course for you.  And don't worry if \nyou own a different version of Ozone.  you can use the techniques in \nthis course for any previous or newer version of Izotope Ozone!</p>\n\n\n\n<p>So if you're looking to upgrade your knowledge of audio mastering, \nsharpen your mastering skills or dip your feet in the world of mastering\n for the first time, this course is exactly what you're looking for. </p>", 
    "end_date": null, 
    "title": "Mastering EDM With Izotope Ozone 7", 
    "price": "20.00", 
    "instructors": "Fuad Murad", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/832994_b470.jpg", 
    "course_url": "https://www.udemy.com/mastering-edm-ozone7/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-26T23:58:39Z"
}