{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Mastering electronic music is not easy.  In fact, it's downright hard as hell.  Getting your tracks to sound loud, punchy, rich, full and clean all at the same time can have you pulling your hair out in no-time or worse, abandoning a project altogether.  </p><p>Luckily, there are so many mastering plugins and tools out there designed to make our lives easier when it comes to mastering our EDM tracks.  One of the best plugins to master your tracks is Izotope Ozone.  It comes packed with features to help you glue your mix, balance frequencies, add richness and character and get your tracks sounding as loud and proud as the big boys.</p><p>In this 2.5 hour course, I'll take you through each of Ozone 6's modules and dive deep into the techniques you need to create incredible sounding masters for any electronic piece you produce.  This is a tell-all course that will teach you exactly how i and other mastering engineers work to transform less than perfect mixdowns into polished masters ready for the world to enjoy.</p><p>You'll be learning things like:</p><ul><li>EQ techniques for a cleaner mix, tighter bottom end, and a top end that sparkles</li><li>Multiband compression for a more balanced track that plays well on any system</li><li>Stereo imaging that will result in a wider, richer master that translates well on different systems</li><li>Using distortion and saturation for extra richness and character</li><li>How to get your tracks loud without distorion</li><li><strong>PLUS: a <em>bonus</em> technique that few, if any engineers or producers will admit they use or tell you about.  <em>I'LL TELL YOU ABOUT IT!</em></strong></li></ul><p><br></p><p>Whether you're new to Ozone or have been using it for years, this course is guaranteed to tach you something new with a fresh approach to mastering your own tracks, or even other people's tracks.<br></p><p>You also get to be in direct contact with me at any time and have lifetime access to the course once you enrol.  You can ask questions, post comments and start discussions with myself and other students in the course.  </p><p>Whether you produce house, trance, deep house, trap or anything in between, there's something in this course for you.  And don't worry if you own a different version of Ozone.  you can use the techniques in this course for any previous or newer version of Izotope Ozone!</p><p>So if you're looking to upgrade your knowledge of audio mastering, sharpen your mastering skills or dip your feet in the world of mastering for the first time, this course is exactly what you're looking for. </p><span></span><p><br></p>", 
    "end_date": null, 
    "title": "Mastering EDM With Ozone 6", 
    "price": "20.00", 
    "instructors": "Fuad Murad", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707512_5110_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-edm-with-ozone-6/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-27T09:02:33Z"
}