{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t      Beginners, take this course and start creating awesome sounding drum mixes for your personal music projects - <em>sound better and get noticed more</em> - or if you&#039;re an experienced engineer, refresh your skills and knowledge<em> - keep your reputation and identity as a pro mixing engineer!</em>  </p>  <p>  \t<em>We&#039;ve been recording and mixing music professionally for over 2 decades, learn from the pro&#039;s. 30 day money back guarantee, no questions asked. It&#039;s our personal promise that this course will improve your mixes.</em>  </p>  <hr>  <p>  \t      About this course:<br>  \t      This class is a step by step guide to mixing an acoustic drum set for beginners. The videos for this class will walk you through the thought process of an audio engineer as he edit&#039;s and mixes a drum kit. Within this class we&#039;ll explore mixing buses, phase issues, quantizing and sampling, and mixing techniques using plug-in effects. In no time you will have the skills and knowledge to start getting great sounding drum mixes  </p>  <p>  \t      We highly encourage student/teacher interaction, so If at any point you have questions or would like to start a discussion, don&#039;t hesitate to ask the instructor. This class is recommended for beginner to intermediate engineers and/or producers using any type of DAW.  </p>  <p>  \t<strong><br>  \t        The class is divided into 3 Sections:</strong><br>  \t<strong>Section 1 </strong>explores session preparation, an essential first step to any mix. Buses and auxiliary channels are used to organize and simplify the mix. Phasing issues between drum elements - which can kill the power of a drum kit - are identified and resolved. Finally, a rough mix is built by panning and balancing levels between tracks, establishing a solid foundation for the progression of the mix.  </p>  <p>  \t<strong>Section 2 </strong>explores the next crucial step to a professional sounding mix: editing. The drums will be quantized by using Beat Detective in Pro Tools - manual quantizing will also be examined. The drum sound will be beefed up through the use of sampling, a popular technique used in modern mixing. Then the sound will be cleaned up by &quot;gating&quot; some of the drum elements using Strip Silence in Pro Tools, creating a professional, polished sound.  </p>  <p>  \t<strong>Section 3 </strong>gets into the actual mixing part of the process. Balance, space, and power are added to the drums through the use of compression, equalization, reverb, and parallel compression.  </p>  <p>  \t<strong><br>  \t              By the end of this course you’ll be able to</strong>  </p>  <ul>  \t<li>Use Aux tracks and buses to sum tracks.</li>  \t<li>Identify and correct phase issues.</li>  \t<li>Quantize drums to the grid.</li>  \t<li>Add triggered drum samples.</li>  \t<li>Gate tracks using modern non-linear editing techniques.</li>  \t<li>Use compression to shape the sound of the each part of the drum kit.</li>  \t<li>Use equalization to enhance the tone of each part of the drum kit.</li>  \t<li>Use reverb to add space and depth to the drum kit.</li>  \t<li>Use parallel compression to enhance the sound of the drum kit.</li>  </ul>  <p>  \t<strong><br>  \t              IMPORTANT!! </strong><strong>What happens if you don&#039;t get professional help?</strong><br>  \t      Well ask yourself this, 3 months from now how much better will my music sound? The reality is without proper training it won&#039;t sound much different. Yes, you can spend hours, days, and weeks trying to find YouTube clips online, but they only do so much. This mixing class has over 1.5 hours of instruction from a professional Recording Studio with over 25 years of experience servicing some of the biggest bands in the world. Invest in something that matters, your passion in creating music! We&#039;re the answer to help you get better.  </p>  <p>  \t                P.S The final sound of a mix is very subjective. For example, some may love a big roomy sound for the drums, others might prefer a dryer, tighter sound.  With that in mind, the reasoning behind each mix move will be explained so that you can take the techniques learned here and apply them to your own mix.  </p>", 
    "end_date": null, 
    "title": "Mixing Music: Learn how to get an awesome sounding drum mix!", 
    "price": "20.00", 
    "instructors": "Signature Sound", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176918_fc8b_8.jpg", 
    "course_url": "https://www.udemy.com/music-mixing-production-drums/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T22:21:11Z"
}