{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">So you&#039;re a producer, DJ or an aspiring musician...?</strong>  </p>  <p style=\"\">  \t Then this course is for you. It&#039;s about mixing electronic music. Wether it&#039;s mixing your own productions or maybe a remix you are working on or a demo track for a record label. To make your mixes shine, add that punch and quality to your sound.  </p>  <p style=\"\">  \t <strong style=\"\">What Makes &quot;Good&quot; Mixing?</strong>  </p>  <p style=\"\">  \t In this online mixing course you&rsquo;ll learn how to use the four clear principles of good mixing. And all the techniques and exercises are carefully designed to fit within that structure. Every time you do one, you are building technique in one of those four principles.  </p>  <p style=\"\">  \t <strong style=\"\">Practice Makes Perfect?</strong>  </p>  <p style=\"\">  \t When people tell you that you need to practice mixing, it&#039;s hard to know what that means. Well, this course gives you one full mix available for you to download to get all the practice you need, to find your own style, and to build the confidence to know what a great mix should sound like. Go through them day by day, or just pick any one to get started writing.  </p>  <p style=\"\">  \t <strong style=\"\">Who&#039;s This For?</strong>  </p>  <p style=\"\">  \t This electronic mixing course is designed for <strong style=\"\">producers, DJs and musicians </strong>at any level, from this course you will learn how to mix from good to great in just five minutes a day!  </p>  <p style=\"\">  \t If you&#039;re also taking <a href=\"http://udemy.com/deep-house\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Deep House Course</a>, then these are perfect techniques to get you into the mixing in the first week of that course while you&#039;re planning out your book.  </p>  <p style=\"\">  \t Shown in Logic, but applicable to any DAW, this online mixing course is perfect fit for anyone on any DAWY, the same principles apply and these exercises will help you learn how to mix great tunes whatever platform you are using. The techniques can be applied to a range of electronic music genres.  </p>  <p style=\"\">  \t By the end of this course you will have acquired a greater understanding of the mixing process.  </p>  <p style=\"\">  \t So give it a go and I really hope to see you inside this course.  </p>", 
    "end_date": null, 
    "title": "Mixing Electronic Music with Logic Pro", 
    "price": "20.00", 
    "instructors": "Mohamed Kamal", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28195_269d_7.jpg", 
    "course_url": "https://www.udemy.com/mixing-electronic-music/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-30T15:33:41Z"
}