{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Build a strong foundation in Mixing with this course for beginners.</strong></p><ul><li>Create New Sessions</li><li>Organize Tracks</li><li>Track Bussing</li><li>Speed Up Your Workflow Using Keyboard Shortcuts</li><li>Learn the Fundamentals in Mixing and Mastering</li></ul><p><strong>A Powerful Skill at Your Fingertips</strong><br>Learning fundamentals of mixing electronic music in Pro Tools puts a powerful and very useful skill at your fingertips. Pro Tools is the Photoshop for professional music production and mixing. EDM genres are plentiful, and being able to learn mixing will give you a strong background to more easily pick up new projects.</p><p><strong>Content and Overview</strong><br>Suitable for beginners, through this course you’ll learn the fundamentals of mixing. Included are quizzes to enhance our video training.<br>Starting with the basics on setting a new mix session, we touch on the importance of proper gain staging, as well as keyboard shortcuts for a speedier workflow.<br>Our focus is not a tutorial, but a comprehensive course of what you need to know.</p><p>Students completing this course will have the “know-how” to mixing in Pro Tools for any music project.</p><p><strong>What are the requirements?</strong></p><ul><li>Computer literacy skills on Mac or PC</li><li>Access to a copy of Pro Tools 11 or higher is ideal</li><li>Exact plugins used in the video are not mandatory</li></ul><p><strong>What am I going to get from this course?</strong></p><ul><li>14 courses and 3 hours of content!</li><li>Understanding the use of EQ’s and Filters</li><li>Learning Compression and Distortion</li><li>Use effects for depth and width</li></ul><p><strong>What is the target audience?</strong></p><ul><li>Aspiring producers who want to learn mixing</li><li>Audio engineers wanting to learn electronic music</li><li>Self-taught Pro Tools users who need a more comprehensive step-by-step learning path</li></ul>", 
    "end_date": null, 
    "title": "Mixing EDM", 
    "price": "50.00", 
    "instructors": "Music Tech Courses Pulsating Waves", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/742350_8a24_6.jpg", 
    "course_url": "https://www.udemy.com/mixing-edm/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T16:00:17Z"
}