{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">We will be mixing and mastering a track from start to finish in this course. </p><p style=\"\">You will get an in-depth, real world view of exactly how to mix and master your own music. </p><p style=\"\">You will learn the art and science behind various types of compression (regular compression, sidechain compression, multiband compression) and some recommended settings that can be used depending on the type of sound you are treating with compression. </p><p style=\"\">You will also learn about various types of EQ treatment, such as regular parametric EQ and Mid-Side EQ. You will learn about how to EQ a wide range of sounds including different drums and percussion (kicks, snares, etc.), different bass sounds, melodic instruments and FX. </p><p style=\"\">You will learn how to use saturation and distortion to add extra harmonics to certain sounds in your mix to make them sound fuller or stand out more above the other instruments. </p><p style=\"\">You will learn how to mix a complex track that consists of more than 10 different bass sounds and more than 10 different drums tracks. </p><p style=\"\">You will see how we can group tracks together and process an entire group of tracks at once. </p><p style=\"\">You will learn how to work with reference tracks to compare your own work with. </p><p style=\"\">You will also learn how to build your own mastering chain and how to master your track so that it will stand up against other professionally produced tracks on the dancefloor. </p><p style=\"\">The style of music produced in this course could be called dubstep, although it features many influences from ambient electronica and drum and bass, especially neuro or neurofunk style drum and bass. </p><p style=\"\">Despite the track being a specific type of electronic music, you will be able to apply all of the mixing and mastering techniques you learn in this course to other genres of electronic music, such as electro house, techno, glitch hop, trip hop, mid tempo music and many other styles. </p><p style=\"\">The Digital Audio Workstation (DAW) used in this course is Ableton Live, but if you use a different DAW, and you&#039;re comfortable with producing music in it, you can apply all of the techniques in your DAW of choice. </p><p style=\"\">Along with full access to all of the video tutorials, you will be able to download the Ableton Live project file used in this course to take a close look at each of the tracks and see exactly how the song was mixed. </p>", 
    "end_date": null, 
    "title": "Mixing And Mastering Electronic Music In Ableton Live", 
    "price": "30.00", 
    "instructors": "Luke Ward", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456982_f184_3.jpg", 
    "course_url": "https://www.udemy.com/mixing-and-mastering-electronic-music/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T18:49:53Z"
}