{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Mixing and mastering deep house is an art and a science at the same time.  Deep house tracks are unique in that they are simple yet sophisticated and rely on dynamics and subtle touches to evoke our emotions.</p><p>Rarely does a mixing and mastering course come along that walks you through every step, every plugin, every thought and  every nuance that goes into producing a professional deep house track.</p><p>Well, that's exactly what this course does.  It's packed with hours worth of the best, most up-to-date techniques you need to mix and master a deep house track from start to finish using both native and 3rd party plugins.  It does NOT matter which DAW you use or what plugins you have, with the skills and techniques in this course, you'll be to transform your rough mix into a polished master ready for release.</p><p>Every detail of the mixing and mastering process is thoroughly explained to make sure you're not left confused, lost of frustrated in any way.  At the same time, extra care has been taken to make sure that everything is kept simple and easy to understand with a focus on efficiency and workflow.</p><p>Things you'll learn in this course include:</p><ul><li>Project and arrangement setup</li><li>Mixbus Processing</li><li>Send/return channel setup</li><li>Vocal tuning and mixing</li><li>Automation and creative mixing techniques</li><li>Parallel compression and processing</li><li>Advanced EQ, compression, reverb and delay techniques</li><li>Professional mastering techniques </li><li>much much more...</li></ul><p>So if you produce deep house music, or any other dance music genre, you will find course unlike any other you've ever taken.  The mixing and mastering process is broken and explained in full detail without being overwhelming, boring, or frustrating in any way.  You'll get to see and hear the thought process behind every plugin setting and every decision.  </p>", 
    "end_date": null, 
    "title": "Mixing & Mastering Deep House", 
    "price": "50.00", 
    "instructors": "Fuad Murad", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/857134_acbb_3.jpg", 
    "course_url": "https://www.udemy.com/mixing-mastering-deep-house/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-23T03:59:53Z"
}