{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t                    Welcome to Mixing EDM! This course is a complete walkthrough of an EDM song I recently mixed for a client. Not only will you get step by step videos showing you exactly how I mixed this song, but by enrolling in this course you’ll also get the raw audio files that were used in the mix so you can practice along while I&#039;m teaching, which is an excellent way to expand your creativity and workflow.  </p>  <p>  \t                    This is officially our 5th course and its pretty epic for several reasons, here are a few. In this course you’ll learn how to:  </p>  <ul style=\"\">  \t<li>Setup a session for a great EDM workflow.</li>  \t<li>Tame and sculpt the low end of this song to keep the bass pumping and moving because as we all know in dance music the kick and the bass are just as important as the melody.</li>  \t<li>Use distortion and pitch shift effects to make your synths sound huge and powerful.</li>  \t<li>Use EQ and compression to give instruments and vocals their own sonic space in the mix. Use popular effects and their settings to get the right style of sound for this music, which is really really important.</li>  </ul>  <p>  \t                    On top of that all we’ll be available to answer any questions you have about mixing electronic dance music. With a community of over 1000 students and a ton of great reviews across all of our courses we promise a great learning experience.  </p>  <p>  \t                    On a final note if the class wasn&#039;t a good fit, no worries, we have a 30 day hassle free money back guarantee!  </p>", 
    "end_date": null, 
    "title": "Mixing Music - Learn how to mix an EDM Song like a Pro!", 
    "price": "50.00", 
    "instructors": "Signature Sound, Ian Sutton", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366008_797b.jpg", 
    "course_url": "https://www.udemy.com/mixing-electronic-dance-music/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T18:58:51Z"
}