{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Darf ich ein kleines Geheimnis verraten? Ich habe nie ein Instrument gelernt und kann nur sehr langsam Noten lesen. Trotzdem wurden meine Werke auf verschiedenen deutschen und englischen Labels released.</p>\n\n<p>Einer der Gründe dafür ist, dass es heute nicht mehr zwangsläufig nötig ist, Klavier oder Gitarre beherrschen zu müssen, um komplexe Kompositionen in die Musikproduktions-Software aufzunehmen. MIDI-Effekte helfen uns, mehr Bewegung und Variation in unsere Songs zu bekommen oder aus wenigen Noten viele Noten zu machen.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Genau darum geht es in diesem Kurs: Ich möchte zeigen, wie aus wenigen Noten nur mithilfe von MIDI-Effekten ein aufwendiger Song samt Beat und mehreren Instrumenten werden kann. Dazu werden wir uns die in Ableton Live verfügbaren MIDI-Effekte anschauen, einige Noten als Ausgangspunkt wählen und dann mittels Anwendung der Effekte komponieren.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Der Kurs kann in 2 bis 4 Stunden absolviert werden, je nach eigenem Anspruch! In jedem Kapitel gibt es eine kurze Hausaufgabe, die in der Summe ein kleines Projekt aus Noten zum arrangierten Song machen. Alles was nötig ist, ist ein wenig Lust auf Musik, Spaß am Ausprobieren sowie eine DAW, die über MIDI-Effekte verfügt (z. B. die kostenlose Demo-Version von Ableton Live). </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Hast du Lust, MIDI-Effekte kennenzulernen und aus wenigen Noten einen kompletten Song zu komponieren? Möchtest du lernen, deinen Werke mehr Bewegung und Abwechslung zu geben? </p>\n\n\n\n\n\n\n\n<p>Dann schreib dich heute ein!</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong>Letztes Update</strong>: Juni 2016</li></ul>", 
    "end_date": null, 
    "title": "Musikproduktion im Heimstudio: Komponieren mit MIDI-Effekten", 
    "price": "25.00", 
    "instructors": "Marc \"Selec\" Zimmermann", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/748282_2fad_2.jpg", 
    "course_url": "https://www.udemy.com/komponieren-mit-midi-effekten/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-31T23:39:26Z"
}