{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Learn to use and understand the audio compressors in a complete, effective and fun way! Audio compressors are one of the most important tools for the producer, engineer and musician. Unfortunately, its function is somewhat mysterious for many of them. Even many professionals don't know how to use them in the right way, but that's because nobody explained them how compressors work from a practical and clear point of view.</p>\n\n<p><strong>But with this course you can master the principles of audio compression and have total confidence when using compressors! You can learn:</strong></p>\n\n\n\n<ul><li>What an audio signal is</li><li>Why do we use decibels (dB)</li><li>What are the dynamics</li><li>What's an envelope and how is it related to compression</li><li>What is the purpose for each knob in an analog or digital compressor</li><li>How all this can improve your audio quality</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>A complete approach to audio compressors!</strong></p>\n\n\n\n<p>There are many Youtube tutorials out there, but any of them offers you a <strong>complete and well structured</strong> learning system like this course. You could spend hours looking for tips and answers on the web and finish with many doubts, but you can get the knowledge you need to get the work done with this condensed course. You'll be guided by an instructor with more that 15 years of experience training audio and music professionals at college level, some of them working for companies like Sony Music, Televisa and even Grammy Award winners, so teaching quality is warrantied.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Course overview</strong></p>\n\n\n\n<p>First you will learn the basics you need to understand audio. With listening examples and graphs you will see the importance of compressors. Then you will learn how compressors work from inside, that is, you'll know the internal \"blocks\" or sections that every compressor has, and how these sections are related to the knobs and buttons.</p>\n\n\n\n<p>Then you will see the techniques in action, learning how a compressor is manipulated and, the most important, how it helps you to <strong>control and improve your sound!</strong></p>\n\n\n\n<p>You will learn techniques for:</p>\n\n\n\n<ul><li>Vocals</li><li>Guitars</li><li>Drums</li><li>Bass</li><li>Piano</li><li>Master bus</li></ul>\n\n\n\n<p>And with this knowledge <strong>you will be able to apply compression to any kind of instrument with any kind of compressor!</strong></p>\n\n\n\n<p>Take the freedom to shape your own sound, and forget about those discussions with engineers and producers. Do not rely on plugin presets, take control yourself!</p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>Who should take this course?</strong></p>\n\n\n\n<p>The course is great for all levels, from beginners with little experience to active professionals looking to improve their skills. These techniques and principles can be applied on every musical genre, instrument or sound and work with analog or digital hardware compressors or computer plugins as well.</p>\n\n\n\n<p>You only need a compressor or DAW (Pro Tools, Logic, Reason, Garageband, etc.) to start practicing the techniques.</p>\n\n\n\n<p>There's a 30 day money back warranty, so you don't have anything to lose and many things to learn!</p>", 
    "end_date": null, 
    "title": "Professional Audio Compression Techniques for musicians, DJs", 
    "price": "20.00", 
    "instructors": "Marco Galvan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540708_eb9c_2.jpg", 
    "course_url": "https://www.udemy.com/professional-audio-compression-techniques-for-musicians-djs/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T22:57:50Z"
}