{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Course Description<br><br></strong>Learn how to produce a Progressive House music tune following my step by step instructions where we will start with a blank project and work our way through the stages of completing a tune.  I will also provide information about what to do once your track is complete.</p><p><strong>Essential production techniques for Progressive House</strong></p><ul><li>Mixing elements for balance</li><li>EQing elements for space</li><li>Fast arrangement technique</li><li><span></span>Chord progression patterns</li><li><span></span>Vocal sample placement</li><li><span></span>Layering samples</li><li><span></span>Sidechaining</li><li><span></span>Sound design for sound effects</li></ul><p><strong><br></strong><strong>Everything you need to take your music to the next level</strong></p><p>We will start from a blank slate and guide you as we create a Progressive House tune together.  Learn how to organize your projects to work more efficiently, create a balanced sound through panning and EQing, layer samples for a more interesting effect, create your own sound effects using Logic's ES2 and speed up your arrangement process with simple tips.</p><p><strong>Content and Overview</strong><br></p><p>If you’re new to music production or just need more information on how a progressive house tune is constructed, then this course is for you.  I designed this course for beginners to easily understand the concepts of music production.</p><p>We'll cover basic mixing techniques to get your tune to sound balanced, use Logic's effects such as EQ, Modulation, and Delay to create space in your mix as well as go over creating your chord progressions and patterns. </p><p>Included in this course is a completed Logic Pro project file complete with all of the sample files as well as 5 additional chord progressions for you to use and learn from.</p>", 
    "end_date": null, 
    "title": "Progressive House Music Production with Logic Pro", 
    "price": "20.00", 
    "instructors": "Mbase Music", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651978_b364_3.jpg", 
    "course_url": "https://www.udemy.com/progressive-house-music-production-course-logic-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-27T02:51:19Z"
}