{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<span><em style=\"\">&quot;Carl Eden you are a hero, all these silly vids on yotube are telling one to spend hundreds or thousands of dollars on vst plugins or whatever, imagine how simple it was. thank you from the bottom of yours truly&quot;</em></span>  </p>  <p style=\"\">  \t <span><em style=\"\">&quot;Just what I was looking for! Thanx a million! You say it straight and to the point! Great course! Be blessed!&quot;</em></span>  </p>  <p style=\"\">  \t    Do you dream of selling your songs? Would you like your tracks to sound like a real, world-class drummer played on them recorded in one of the finest studios in the world? The start of a great song is a great drum track with a fantastic feel, pristine sound and bespoke, fluent fills, however only the few can afford the skills of a real, talented drummer plus time in the studio.  </p>  <p style=\"\">  \t          In this course I give you all the skills and knowledge you need to program original, professional and organic beats and mix the results for maximum impact within your songs. Learn the recording and mixing tricks of the pros and all without ever having to pick up a pair of drum sticks!  </p>  <p style=\"\">  \t          Absolutely no prior knowledge is needed and, by the end of the course, you will be creating and mixing drum tracks that shine and that give your songs the edge that&#039;s needed to stand out.  </p>  <p style=\"\">  \t          All you need is any sequencer software that can load soft synths and that utilises a piano-roll-style editor (ie. all of them including Cubase, Ableton, Logic, Sonar and Reaper). Where third party plugins are used, links are given to freeware alternatives.  </p>  <p style=\"\">  \t          And, with a one month money-back guarantee in case you are not completely satisfied, you have absolutely nothing to lose so sign up now and begin to create commercial-sounding drum tracks today.  </p>", 
    "end_date": null, 
    "title": "Programming Amazing Drum Tracks: a Guide for Non-Drummers", 
    "price": "45.00", 
    "instructors": "Carl Eden", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313786_a7f2_4.jpg", 
    "course_url": "https://www.udemy.com/create-amazing-sequenced-drum-tracks-that-pop/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-05T13:18:45Z"
}