{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>If you&#039;re recording on a USB microphone, you&#039;re probably recording a podcast, voice over or even recording a vocal take. </p><p>This is where this course comes in. This course is designed to take you to the next level of recording &amp; editing great sounding audio, so your recordings would be accepted even for broadcast and TV. </p><p><strong style=\"\">Grasping the know-how to produce great audio will open more opportunities to what you can do. When you mastered the art, you can:</strong></p><ul style=\"\"><li>Record and sell yourself as a voice talent</li><li>Be more sought after with your podcast quality</li><li>Produce better home recorded vocals &amp; demos</li><li>Create better sounding videos that your fans would love watching</li><li>Be seen as a pro through your media work. (People hate substantial video with bad audio quality!)</li><li>Create better YouTube videos with great audio </li></ul><p><strong style=\"\">This course is structured to bring you from buying your first microphone to exporting your recording. Here&#039;s the flow from start to end. </strong></p><ol style=\"\"><li>First, you&#039;ll learn which microphone you should invest in. Different microphones give you different sounds.</li><li>Then we&#039;ll talk about what software you should use. </li><li>Recording techniques and editing your recordings is then really important</li><li>After that we&#039;ll clean up your audio to make sure they sound GREAT</li><li>Before we export your recordings, you&#039;ll learn how to use commercial effects to spice your recordings or vocals.</li><li>Finally, learn the best way to output your audio and share it out with the world.</li></ol><p>If that&#039;s not enough, you can count me in for any questions you have regarding recording, editing and producing your voice over or vocal recordings. I&#039;m always connected, so I&#039;ll be at your service. </p><p>See you in class.</p>", 
    "end_date": null, 
    "title": "Record & Edit With Your USB Microphone Like A Pro", 
    "price": "20.00", 
    "instructors": "Reuben Ch'ng", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496728_8c9a.jpg", 
    "course_url": "https://www.udemy.com/record-edit-with-your-usb-microphone-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-08T13:20:19Z"
}