{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Music creators like you have songs to share with the world. No matter what your genre, you're passionate about your music, and you care about the quality of your sound.</p><p>But when it comes to recording music, many musicians and songwriters struggle with technological hurdles and steep software learning curves. And the expense of hiring a professional recording studio is simply too much for most independent music creators to bear.</p><p>This course aims to overcome this challenge by helping you get the skills and confidence you need to record and produce your own music at home.</p><p><strong><br></strong></p><p><strong>Record and Mix Your Own Music in This Comprehensive Step-By-Step Guide for Music Creators</strong></p><ul><li>Discover the equipment you need and how to set it up to get the best results</li><li>Learn how to record acoustic and electric instruments (guitars, bass, vocals, etc.)</li><li>Extend your music production options with tools like MIDI and sample loops</li><li>Polish your recordings with simple yet effective editing techniques</li><li>Understand the basics of compression, EQ, and reverb and when to use them</li><li>Create a release-ready final mix with powerful and versatile mixing and mastering tools</li></ul><p><strong><br></strong></p><p><strong>Make great-sounding music recordings at a fraction of the cost</strong></p><p>Technology has changed the music industry landscape. Music creators can now produce their own music for commercial release at a fraction of the cost. Unsigned artists, bands and DIY indie labels now have unprecedented power to record their own music, distribute their music worldwide, and connect directly to their audience.</p>We created this course for songwriters and musicians who want to record their own music at home. Whether you want be able to record high-quality demos, or you want to record music for commercial release — knowing how to record and mix your own music will help you get your music heard.<p><strong><br></strong></p><p><strong>Content and Overview</strong></p><p>This course is a hands-on, project-based course suitable for musicians and songwriters with little or no previous recording experience. We designed this course especially for beginners — so you don't need to know anything special about recording gear, signal flow, or mic placement before starting this course. </p><p>We simply expect that you're a musician, and that you'll be recording yourself throughout this course. And we strongly recommend you take this course with a specific song in mind to record! Songs that feature guitar, bass, percussion, keyboards and vocals are best suited for this course, but you can adapt any instrumentation. If you don't have a song ready to record, you can record the sample project song we'll provide to you.</p><p>Throughout this course, we'll walk you through every step of recording your song:</p><ul><li>You'll learn how to set up your audio interface to work seamlessly with your computer and REAPER, the digital audio workstation (DAW) software we'll be using throughout this course. You'll also learn how to optimize REAPER for music recording, so you can improve your workflow and get the results you want faster and with less effort.</li><li>Using either your own song or the sample song we'll provide to you, you'll learn how to use XLR microphones,  audio interfaces and other tools to record acoustic and electric musical instruments. Once you understand the basics, you'll feel confident combining these tools to capture and preserve the quality of your sound.</li><li>We'll demonstrate some helpful audio editing techniques so you can fix timing and tuning issues, compile your best performances, and edit out unwanted sections from your song. You'll also learn how create a release-ready final mix by using compression and EQ, adding reverb, and automating level changes.</li><li>Finally, we'll cover everything you need to know to export your final mix into your preferred digital format. Whether you need to send demos to your bandmates, upload your songs for digital distribution, or create stems for others to remix, you'll learn how to export your mix to a digital format that suits your needs.</li></ul><p><br></p><p>This comprehensive course includes complete project files and other downloadable resources, such as:</p><ul><li>A checklist of recommended equipment</li><li>Sheet music, lyrics and chords for our sample project song</li><li>A customized configuration file to optimize REAPER for music recording</li><li>An audio troubleshooting checklist</li><li>Free kick and snare drum samples and percussion loops</li><li>Helpful PDF reference documents and \"cheat sheets\"</li></ul><p><br></p><p>At the end of each section, we'll also give you a project checklist so you can practice the skills you've just learned. By the end of this course, you'll have recorded, edited and mixed a complete song you'll be proud to share with the world!</p>", 
    "end_date": null, 
    "title": "Recording Your Own Music: A Step-By-Step Guide for Musicians", 
    "price": "50.00", 
    "instructors": "Kathleen Farley, Michael Chambers", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551046_2f45_3.jpg", 
    "course_url": "https://www.udemy.com/recording-your-own-music-a-step-by-step-guide-for-musicians/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T13:51:44Z"
}