{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<em style=\"\">UPDATE: Course updated on September 15th 2014. Audio files downloadable so you can practice mixing the same song used in the course.</em> <em style=\"\">Send us your final mix and we&#039;ll provide feedback.</em>  </p>  <hr style=\"\">  <p>  \tTake this course and start creating professional sounding recordings and mixes for your personal music projects - <em style=\"\">sound better and get noticed more</em> - or for your clients - <em style=\"\">build your brand and make more money!</em>  </p>  <p>  \t<em style=\"\">We&#039;ve been recording and mixing music professionally for over 2 decades, learn from the pro&#039;s. 30 day money back guarantee, no questions asked. It&#039;s our personal promise that this course will improve your mixes.</em>  </p>  <hr style=\"\">  <p>  \tAbout this course:<br style=\"\">  \tIn this class we&#039;ll teach you some of the best recording and mixing techniques used to get professional sounding acoustic guitar and vocal productions. You&#039;ll have access to the raw tracks of the song used in the class, so you can start putting everything you learn into practice right away.  </p>  <p>  \t        We also highly encourage student/teacher interaction, so If at any point you have questions or would like to start a discussion, don&#039;t hesitate to ask the instructor. Once you finish send us your mix and we&#039;ll provide you with some feedback (its ok to send us more than one final mix). This class is recommended for beginner to intermediate engineers and/or producers using any type of DAW.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t        Whats covered in this class?</strong><br style=\"\">  \t                        This is an in-depth step by step guide to what you need to know to get a great sounding recording and mix. The videos for this class will walk you through the thought process of a professional audio engineer as he records and mixes a singer/songwriter playing acoustic guitar. As we lead you through the recording and mixing process, we&#039;ll explore the basics of acoustics and sound treatment, microphone types, polar patterns, mic&#039;ing techniques, ways to avoid sound leakage, and the best way to use effects, including EQ, compression, reverb, delay, and saturation. Two major recording styles are shown: live recording and multi-tracking.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t        The class is divided into 3 Sections:<br style=\"\">  \t</strong><strong style=\"\">Section 1</strong> covers the pros, cons and considerations taken into recording a song live. Many fundamentals of recording are covered here, including acoustics, microphone types, polar patterns, and a mic&#039;ing strategy that will give you the best sounding recording.  </p>  <p>  \t<strong style=\"\">Section 2</strong> introduces a different recording style -- multi-tracking using overdubs. New musical elements are added and several different mic&#039;ing techniques are introduced. There is a greater focus on using effects while mixing including EQ, compression and saturation.  </p>  <p>  \t<strong style=\"\">Section 3</strong> is all about vocal harmonies -- not only how to record them, but how to write them even if you have no musical training!  </p>  <p>  \t<strong style=\"\">1 week to get great sounding recordings and mixes<br style=\"\">  \t</strong>Working 30 minutes a day will allow you to finish this course in <strong style=\"\">1</strong><strong style=\"\"> week</strong>.<strong style=\"\"> </strong>If you want to improve your recordings and mixes and build new skills and incorporate new techniques this class will allow you to do that.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t        IMPORTANT!! What happens if you don&#039;t take this recording and mixing class?</strong><br style=\"\">  \t        Well ask yourself this, 3 months from now how much better will my music sound? The reality is without proper training it won&#039;t sound much different. Yes, you can spend hours, days, and weeks trying to find YouTube clips online, but they only do so much. This mixing class has over 2+ hours of instruction from a professional Recording Studio with over 25 years of experience servicing some of the biggest bands in the world. Invest in something that matters, your passion in creating music! We&#039;re the answer to help you get better.  </p>", 
    "end_date": null, 
    "title": "Record & Mix Music like a Pro - Acoustic Guitars and Vocals!", 
    "price": "35.00", 
    "instructors": "Deborah Reeves, Signature Sound", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/77724_8573_22.jpg", 
    "course_url": "https://www.udemy.com/music-production-recording-mixing/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-12T21:01:55Z"
}