{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Here's what some of my students are saying about this course:</strong></p><p>\"<em>This course has been very helpful. I previously had no clue what you needed to remix a song, but within minutes I had a good understanding of how to get started. Dylan Bowes is an excellent teacher, and I cannot wait to complete this course.</em>\" - JT B.</p><p>\"<em>This course is fantastic - the lectures are set out extremely well and Dylan presents the material in simple terms. Great for beginners and experienced users of Logic Pro</em>.\" -P Dwyer</p><p>\"<em>This course was great. The instructor was knowledgeable and helpful and the video lectures taught me a lot. Would definitely recommend!</em>\" - Susana M.</p><p>---</p><p>This course is a comprehensive guide to creating remixes using Logic Pro. After taking this course, you'll have <strong>everything you need to know</strong> to get started making remixes!</p>    <p>We'll walk through finding remixes opportunities, setting up remix stems in your project, changing stem tempos, creating instrument tracks, using insert effects, midi sequencing, mixing and mastering your track, and everything else in between. </p><p>Using 100% high definition video lectures, you'll watch as I remix a pop tune from start to finish. </p><p>I'll provide all of the midi and audio files I use to remix the song for your reference. I'll also provide the Logic project file at the outset so that you can follow along with my work.</p>    <p>This course is perfect for anyone who wants to get started making remixes. </p><p>If you've never opened up Logic before, we will make you feel right at home and show you the basics of working with Logic. Or, if you have some experience remixing but want to improve your skills, we'll give you some new tips and tricks to make the most out of your experience with Logic Pro.</p>", 
    "end_date": null, 
    "title": "Remix Tutorial: How to Remix in Logic Pro X", 
    "price": "20.00", 
    "instructors": "Dylan Bowes", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/39515_0ebc_13.jpg", 
    "course_url": "https://www.udemy.com/createaremixinlogicpro9/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-02T01:01:20Z"
}