{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t  In Sound Design Fundamentals: Sampling, we will examine the essentials of Sound Design using <strong>Ableton Live</strong> and Propellerheads' <strong>Reason</strong> software and focusing on principals of Sampling. We will explore three fundamental topics:  </p>\n\n<ul>  \t<li>Using samples for generating sounds, and the legal implications of sampling (And two pro tips for avoiding all the legal issues)</li>  \t<li>Using samples to generate new sounds through manipulation and synthesis</li>  \t<li>Using samplers to control drum sounds and sequence dynamic drum patterns.</li>  </ul>\n\n<p>  \t    This classes uses the same system I've used for years in my college courses for teaching sound design: Identify and master the 4 main pieces of any synthesizer (or in this case, the sampler), and you will be flying when you first approach any other unit in the future.  </p>\n\n<p>  \t    This system keeps the technical jargon to a minimum and gets you making your own sounds quick.  </p>\n\n<p>  \t<em>J. Anthony Allen is an Ableton Certified Trainer, and a PhD in Music Composition and master of Electronic Sounds. His music has been heard internationally in film, radio, video games, and industrial sound, as well as the concert hall and theater.</em>  </p>\n\n<p>  \t<em>He currently as an adjunct professor of composition at the University of St. Thomas, Macphail Academy of Music, and the CEO of Slam Academy in Minneapolis.</em>  </p>\n\n<p>  \t<em>Praise for other classes by J. Anthony Allen:</em>  </p>\n\n<ul>  \t<em><em>  \t<li><em>\"Dr Allen does it again with his music theory for electronic musicians series. This course really opened up everything I learned from the 1st section and now I understand more about the composition side of things for music. I highly highly recommend this course to anyone!!! Really opened my eyes to many things I wasn't aware of.\"</em></li>  \t<em><em>  \t<li>\"The Best Teacher ever, who makes you understand the ins &amp; outs of Music Theory by all mean without giving what you don't want to know.\"</li>  \t<li>\"I have never had any formal training in music at all. Trying to learn all the notes and how everything translated was a serious challenge. After going thru this class, Dr. J has totally brought down the barriers. The content was very useful and was easy to grasp for me.\"</li>  \t</em></em></em></em>  </ul>", 
    "end_date": null, 
    "title": "Sampling: Using Sampling for Sound Design & Production", 
    "price": "20.00", 
    "instructors": "Jason Allen", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/353144_6410_3.jpg", 
    "course_url": "https://www.udemy.com/sound-design-fundamentals-sampling/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T18:54:32Z"
}