{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tWant to produce dance music, but struggling to figure out your mixer&#039;s from your mixdowns? Sound like a Pro and be fully on your way to producing club banger smash hits with this brilliant course! The <strong style=\"\">first 20 minutes</strong> of this course are <strong style=\"\">absolutely free!</strong> Preview what gets taught with absolutely no risk!  </p>  <p>  \t<span>With o</span><strong style=\"\">ver 400 students</strong><span> currently enrolled, this course is designed for absolute beginners to producing dance music . It will teach you the basics of using FL Studio and how to create Electronic Dance Music. It will teach you the meaning behind terms such as &quot;tempo&quot;, &quot;BPM&quot;, &quot;sidechaning&quot; and so forth.</span>  </p>  <p>  \t              By the end of the course you will have a full grasp of how to use FL Studio, and how to produce basic sounds such as leads, basses, pads and arps. You will have a full understanding of the FL Studio User Interface, and will be able to navigate around it with ease.  </p>  <p>  \t          If you just watch the videos this course will take around 2 hours or so to complete, but to fully build your track to an exceptional level, you should set aside at least 6 hours to work on this alone. Reading the written material within the course will also take more of your time.  </p>  <p>  \t            My method of teaching relies on you ensuring that you know each piece of the course extremely well, in-depth and in detail. Hence each lecture is incredibly short and is laser-focused on one specific subject or idea. I cannot hope to ever tell you how to create a Beatport chart-topping banger, but I can at least ensure and guarantee that you have the knowledge and tools to potentially do so.  </p>  <p>  \t    I have also included a full and uncut copy of my eBook as well, called <strong style=\"\">&quot;The Elements of Dance Music&quot;,</strong> on top of all the content already included with the course!<br style=\"\">  \t<br style=\"\">  \tAnd, if the course doesn&#039;t completely satisfy, you are backed by <strong style=\"\">Udemy&#039;s 30-Day Money Back Guarantee</strong>  </p>", 
    "end_date": null, 
    "title": "Sound like a Pro: The Basics of FL Studio & EDM Production", 
    "price": "25.00", 
    "instructors": "Stephen Loader", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/111454_5d8b_13.jpg", 
    "course_url": "https://www.udemy.com/the-basics-of-fl-studio-and-dance-music-production/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-27T22:18:57Z"
}