{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>The Professional Way: Learn Electronic Music Production [Complete]</strong><br></p>\n\n<p>  \t  <strong>A</strong>ll what you need to know to produce electronic music professionally. Without any waste of time, straight to the point. Included some great tips and shortcuts for Logic that will definitely let you work faster.  </p>\n\n<p>  \t  This course is good for anyone, using Apple's Logic is recommended to get the best out of it but in case you own another software to produce, and you already know the basics of it (your daw or \"digital work station\") still you will learn a lot about music production itself, something you can apply on any daw.  </p>\n\n<p>  \t  I also included two bonus videos dedicated to the Logic essential tips and tricks to speed your work, as well as two walkthroughs in detail of two of my released tracks, two projects available for download for you to inspect and other material as pdf about the good yet affordable gears and virtual instruments that help you to produce professionally.  </p>\n\n<p>  \t  With this course, I wanted to create something handy but complete at the same time.  </p>\n\n<p>  \t  Starting from scratch you will get through all the techniques and notions you'll need to produce music professionally, without any waste of time.  </p>\n\n<p>  \t  I wanted to share with you what I consider more important, thinking about how happened my learning process and what discoveries played a significant role in my improvements.  </p>\n\n<p>  \t  I reassume  in these lessons all the things i've learned so far from my years lasted experience and research on forums, web, dvds, magazines, producers' interviews and advice from pros.  </p>\n\n<p>  \t  It's not a big news that today you can learn a lot from the web, even for free, on websites such as youtube, wikipedia, specified forums and so on. But it requires time, a lot of time to put all together.</p>\n\n<p>  \t  And not all the time you get the right advice, or a complete package that can fulfill your needs, on the contrary at the beginning more you learn from those and more you mess with different ideas and notions, which come for the majority from brave beginners eager to have their youtube channel.  </p>\n\n<p>  \t  This electronic music production course has the purpose of selecting the good proven stuff out there, using my years of experience and practice, and propose it straight to you, cutting hours and hours of time, so that you have within your hands a complete package that provides you all the knowledge to start produce your own music, sure to follow the right path.  </p>\n\n<p>  \t  Enjoy,  </p>\n\n<p>  \t  MET  </p>", 
    "end_date": null, 
    "title": "The Professional Way: Learn Electronic Music Production", 
    "price": "25.00", 
    "instructors": "Matteo Montipo", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/31388_c11d_10.jpg", 
    "course_url": "https://www.udemy.com/electronicmusicproduction/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-05T15:32:34Z"
}