{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t    Este es un curso diseñado para partir desde cero en el mundo de la ecualización. Abarcaremos los fundamentos para que puedas conocer de una manera práctica y efectiva los conceptos que te permitirán usar ecualizadores como lo hacen los ingenieros de audio experimentados.  </p>\n\n<p>  \t<strong>Aprende técnicas profesionales de ecualización.</strong>  </p>\n\n<ul>  \t<li>Conoce conceptos como: frecuencia, decibeles, rango audible, entre otros.</li>  \t<li>Escucha de manera analítica los instrumentos que quieras ecualizar.</li>  \t<li>Ecualiza voz, bajo, batería, guitarra y más.</li>  \t<li>Usa filtros para limpiar tu audio o crear efectos especiales.</li>  </ul>\n\n<p>  \t<strong>Puedes aprender a ecualizar y obtener los resultados que buscas en tu audio.</strong>  </p>\n\n<p>  \t    El curso incluye además material descargable para que puedas practicar. No se requiere de equipo especial.  </p>\n\n<p>  \t      Los conceptos aprendidos pueden ser utilizados tanto en vivo como en estudio y se pueden aplicar a cualquier tipo de música o estilo, podcast, videoconferencia, etc.  </p>\n\n<p>  \t    Aprende paso a paso y de una manera clara y concisa. Este curso ha sido diseñado cuidadosamente por uno de los instructores de audio líderes de Latinoamérica, con más de 15 años de experiencia docente, numerosas certificaciones profesionales y ex-alumnos trabajando con artistas de talla internacional o ganadores del premio Grammy.  </p>\n\n<p>  \t<strong>Contenido general</strong>  </p>\n\n<p>  \tComenzaremos aprendiendo qué es la frecuencia y cómo afecta a lo que escuchamos. Después realizaremos demostraciones para asimilar mejor el efecto que tiene cada rango de frecuencias en el sonido. Una vez que cubramos esto, comenzaremos a explicar cómo funcionan los filtros y qué efectos podemos lograr con ellos. En seguida aprenderemos la diferencia entre ecualizadores y filtros, sus tipos y características. Finalmente realizaremos demostraciones prácticas sobre casos comunes de ecualizacion y mostraremos cómo ecualizar con Audacity, para quienes no cuenten con ningún otro programa de audio.  </p><p>Puedes encontrar cientos de tutoriales aislados y guías en Internet, pero en este curso aprenderás de manera sistemática y clara todo lo necesario para aprender a ecualizar de una manera efectiva y con cualquier tipo de EQ.</p>", 
    "end_date": null, 
    "title": "Técnicas profesionales de ecualización de audio", 
    "price": "20.00", 
    "instructors": "Marco Galvan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/335274_5c32_2.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-usar-un-ecualizador-como-un-profesional/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-04T00:31:19Z"
}