{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>¡Aprende a usar y a entender los compresores de audio de una manera completa, efectiva y divertida! Los compresores de audio son una de las herramientas más importantes para el productor, para el ingeniero de audio y el músico. Desafortunadamente, su funcionamiento es algo misterioso para muchos de ellos. Incluso existen profesionales que no los saben usar adecuadamente, pero esto se debe a que nadie se los explicó de una manera práctica y clara.</p>\n\n<p><strong class=\"redactor-inline-converted\">¡Con este curso puedes dominar los principios de la compresión de audio y tener confianza total al usar compresores! Aprenderás:</strong></p>\n\n\n\n<ul><li>Qué es una señal de audio</li><li>Qué son los decibeles (dB) y por qué los usamos</li><li>Qué es la dinámica</li><li>Qué es la envolvente y cómo se relaciona con la compresión</li><li>Cuál es la función de cada perilla y botón en un compresor digital o análogo</li><li>Cómo podemos usar esto para mejorar la calidad de nuestro audio</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">¡Un curso completo sobre compresión!</strong></p>\n\n\n\n<p>Existen muchos tutoriales en YouTube sobre el tema, pero ninguno de ellos ofrece un sistema de aprendizaje <strong class=\"redactor-inline-converted\">completo y estructurado</strong> como este curso. Podrías pasar horas buscando respuestas y tips en la red y terminar con muchas dudas, pero por otro lado, puedes encontrar la información que necesitas en este curso condensado. Serás guiado por un instructor con más de 15 años de experiencia entrenando a profesionales del audio y de la música a nivel licenciatura. Con algunos de sus ex-alumnos trabajando en compañías como Sony Music, Televisa e inclusive ganadores del premio Grammy, por lo que la calidad de enseñanza está garantizada.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Descripción del curso</strong></p>\n\n\n\n<p>Primero aprenderás las bases que necesitas para entender el audio. Con ejemplos gráficos y auditivos entenderás la importancia de los compresores. Después aprenderás cómo funcionan los compresores internamente, esto es, conocerás sus etapas internas y cómo éstas se relacionan con los controles del compresor. Después verás las técnicas en acción, aprendiendo cómo manipular un compresor y, lo más importante: <strong class=\"redactor-inline-converted\">¡cómo te ayuda a controlar y mejorar tu sonido!</strong></p>\n\n\n\n<p>Aprenderás técnicas para:</p>\n\n\n\n<ul><li>Voces</li><li>Guitarras</li><li>Batería</li><li>Bajo</li><li>Piano</li><li>Bus principal</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>¡Con este conocimiento serás capaz de <strong class=\"redactor-inline-converted\">aplicar compresión a cualquier tipo de instrumento y con cualquier tipo de compresor</strong>! Obtén la libertad de darle forma a tu sonido, no dependas de presets y ajustes automáticos de plugins, ¡toma el control tú mismo!</p>\n\n\n\n<p><strong>¿Quienes deben tomar este curso?</strong></p>\n\n\n\n<p>El curso es adecuado para todos los niveles, desde principiantes con poca o nula experiencia hasta profesionales buscando mejorar sus habilidades. Estas técnicas y principios pueden ser aplicados para cualquier género o estilo musical y funcionan con compresores físicos y virtuales (plugins).</p>\n\n\n\n<p>Sólo necesitas un compresor o DAW (Pro Tools, Logic, Reason, Cubase, Garageband, etc.) para empezar a practicar las técnicas.</p>\n\n\n\n<p>Tienes garantía de 30 días, así que ¡no hay nada que perder y sí mucho que aprender!</p>", 
    "end_date": null, 
    "title": "Técnicas Profesionales de Compresión para músicos y DJ's", 
    "price": "20.00", 
    "instructors": "Marco Galvan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776336_8a4c.jpg", 
    "course_url": "https://www.udemy.com/tecnicas-profesionales-de-compresion-para-musicos-y-djs/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T20:54:15Z"
}