{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Hey! My name is ODi Productions and I'm a professional Music Producer and Audio Engineer. I've worked in the music industry for <strong>over 8 years</strong> and am grateful to have worked with everyone from indie musicians to Platinum-selling artists. Aside from commercial experience, I have a YouTube channel with <strong>over 3,600,000+ views </strong>(90% of those are from my instrumentals). Those views have resulted in <strong>hundreds of instrumental sales</strong>. </p><p>Making industry-standard beats has always been my bread and butter, and today I'm happy to share with you the secrets that I've picked up in my years of experience. In this online video course, I'm going to reveal <strong>my EXACT process for every single beat I make</strong>, but in an easy-to-follow manner that even a child could follow.</p><p>I'm not going to teach you just how to use a program, you can find that anywhere. (Logic Pro is used in the examples, but FL Studio, Ableton Live, Pro Tools, all welcome!)</p><p>Instead, <strong>I'm going to teach you how to make music that sells</strong>. Music that evokes the emotions while following a tried-and-true formula that many of today's top producers use in every hit single. <strong>You can use this same method for ANY electronic music genre: from Hip-Hop, to Pop, to EDM, and even R&amp;B.</strong></p><p>What you're paying for is not only my formula which has resulted in hundreds of instrumental sales and millions of YouTube views, but also <strong>my 1-on-1 coaching</strong> that will be available to you throughout your music journey, even long after the tutorials are done. </p><p><strong>I answer every single question, message, and comment that is left on my course.</strong></p><p>This small investment you make today will repay itself over and over again in the future.</p><p><strong>Click</strong> that \"Take this Course\" button and let's begin!</p>", 
    "end_date": null, 
    "title": "Ultimate Electronic Music Production Guide: HipHop, EDM, Pop", 
    "price": "20.00", 
    "instructors": "ODi Productions", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542620_d7be_2.jpg", 
    "course_url": "https://www.udemy.com/ultimate-electronic-music-production-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T22:25:07Z"
}