{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>For years I've been teaching Ableton Live in the college classroom. As a University Professor, my classes are sought after, and, frankly, expensive. I believe Ableton Live can be learned by anyone, and cost shouldn't be a barrier. This class uses the same outline and syllabus I've used in my college classes for years, at a fraction of the cost.</p><p>This is Part 5: MIDI &amp; Audio Effects</p><p>This is a really deep class - tons of content, tricks, and tips. I'll go through all of the Ableton Live Instruments in this class, with considerable detail on each one. We will also talk about synthesis tricks and tips, getting most out of your samplers, and tons of production tips. Topics include:</p><ul><li>MIDI Effects</li><li>Arpeggiator</li><li>Chord MIDI Effect</li><li>MIDI Effect Racks</li><li>Note Length MIDI Effect</li><li>Pitch MIDI Effect</li><li>Random MIDI Effect</li><li>Scale MIDI Effect</li><li>Velocity MIDI Effect</li><li>Audio Effects</li><li>The three types of Audio Effects</li><li>ALL Ableton Audio Effects (and how to use them!)<ul><li>Simple Delay</li><li>Ping Pong Delay</li><li>Filter Delay</li><li>Grain Delay</li><li>Chorus</li><li>Flanger</li><li>Reverb</li><li>Beat Repeat</li><li>Looper</li><li>EQ Three</li><li>EQ Eight</li><li>Auto Filter</li><li>Amp</li><li>Cabinet</li><li>Corpus</li><li>Dynamic Tube</li><li>Erosion</li><li>Frequency Shifter</li><li>Overdrive</li><li>Phaser</li><li>Redux</li><li>Resonator</li><li>Saturator</li><li>Vocoder</li><li>Compressor</li><li>Glue Compressor</li><li>Limiter</li><li>Multiband Dynamics</li><li>Gate</li><li>Auto Pan</li><li>External Audio Effect</li><li>Vinyl Distortion</li><li>Spectrum</li><li>Tuner</li><li>Utility</li></ul></li></ul><p>I will be making 6 (six!) complete classes in order to bring you the most comprehensive manual on Ableton Live production techniques ever created. Each class has Sets, sessions, and experiments for you to try on your own and follow along with.</p><p>And of course, once you sign up any part, you automatically get huge discounts to all the upcoming parts of this class. You will not have another opportunity to learn Ableton Live in a more comprehensive way that this. </p><p><em>J. Anthony Allen is an Ableton Certified Trainer, and a PhD in Music Composition and master of Electronic Sounds. His music has been heard internationally in film, radio, video games, and industrial sound, as well as the concert hall and theater.</em></p><p><em>He currently as an adjunct professor of composition at the University of St. Thomas, Macphail Academy of Music, and the CEO of Slam Academy in Minneapolis.</em></p><p><em>Praise for other classes by J. Anthony Allen:</em></p><em><em><li><em>\"I've had Live Lite for a while but never quite understood how to use it because of the different options in how to arrange audio. This course explains exactly how to do that and get the most out of Live.\"</em></li><em><em><li>\"Great overview - I would start here for sure if you are just getting your feet wet with live. clear and to the point. session walkthroughs are great. looking forward to more\"</li><li>\"I have never had any formal training in music at all. Trying to learn all the notes and how everything translated was a serious challenge. After going thru this class, Dr. J has totally brought down the barriers. The content was very useful and was easy to grasp for me.\"</li></em></em></em></em>", 
    "end_date": null, 
    "title": "Ultimate Ableton Live: Part 5 - MIDI & Audio Effects", 
    "price": "20.00", 
    "instructors": "Jason Allen", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554972_ae61_3.jpg", 
    "course_url": "https://www.udemy.com/ableton5/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T01:41:05Z"
}