{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong></strong>Hey! My name is ODi Productions and I'm a professional Music Producer and Audio Engineer. I've worked in the music industry for <strong>over 8 years</strong> and I am grateful to have worked with everyone from indie musicians to Platinum-selling artists. I currently run an online mixing and mastering company called RecordingNOW.<strong></strong></p><p>Aside from commercial experience, I have a YouTube channel with <strong>over 3,000,000+ views.</strong></p><p><strong></strong>Today, I'm proud to share with you my ULTIMATE Mixing and Mastering Vocals Guide for Logic Pro. My goal is to transfer my 8+ years of experience onto YOU and give you all the Studio Secrets that I've picked up along the way.</p><p>Basically, <strong>I'm going to walk you step-by-step through my EXACT process for Mixing and Mastering</strong>. The same process I use for my paying clients of RecordingNOW. <span></span></p><p>Although the examples in this course are a Vocal track and Logic Pro, I teach <strong>the RIGHT fundamentals</strong> that can be applied to any sound and any music program.</p><p>I'm going to teach you the basics of Equalizers, Compressors, Reverbs, and Limiters, while also giving you <strong>REAL examples of settings </strong>you can use in your own songs.</p><p> What you're paying for is not only my awesome online course, but also <strong>my 1-on-1 coaching</strong> that will be available to you throughout your music journey, even long after the tutorials are done. </p><p><strong>I answer every single question, message, and comment that is left on my course.</strong></p><p>This small investment you make today will repay itself over and over again in the future.</p><p><strong>Click</strong> that \"Take this Course\" button now and let's begin!</p>", 
    "end_date": null, 
    "title": "Ultimate Mixing and Mastering Guide: Vocals", 
    "price": "20.00", 
    "instructors": "ODi Productions", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543364_0b01.jpg", 
    "course_url": "https://www.udemy.com/ultimate-mixing-and-mastering-vocals/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T17:58:21Z"
}