{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>With studio rates forever increasing and the popularity of home studios going through the roof we have designed a course to enable singers, engineers, and producers to learn how to best make the most of perhaps limited equipment and space to deliver professional quality sounding vocal recordings. This course walks you through every aspect of delivering a polished final result, from what to expect from a professional recording studio and how best to apply your skills when singing, all the way through to mixing your recorded vocal and bouncing down your work to the correct file format for your purpose. Vocal production for singers and logic X users focusses on what to do once your vocal has already been recorded however there are some great tips to improve the quality of your actual recordings too.</p><p>&#039;Vocal production for singers and logic X users&#039; takes around 2 hours to complete and has 8 sections of step by step tuition delivered by engineers from the world famous Steelworks Studios in sheffield. This course will teach you how to make your recorded vocals sound as good as they possibly can and show you some of the tricks of the trade needed to add that extra sparkle to your voice. &#039;Vocal production for singers and logic X users&#039; is also just as useful for people who are training to be engineers and producers. </p><p>Accompanying the course there is a file containing all the keyboard shortcuts used by the professionals to support the course delivery, a logic project for you to follow the step by step tuition with, a folder of raw audio material that can be imported in to any DAW (Digital Audio Workstation), a summary of each chapter and introduction to the next course Vocal Recording for singers and logic X users.</p>", 
    "end_date": null, 
    "title": "Vocal Production for Singers and Logic X users", 
    "price": "30.00", 
    "instructors": "Eliot Kennedy's  Steelworks Academy, Ruth Amos, Luke Filsell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449630_f068_4.jpg", 
    "course_url": "https://www.udemy.com/vocal-production-for-singers-and-logic-x-users/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T17:53:19Z"
}