{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t Today, many musicians are wearing multiple hats, including engineer &amp; artist. Unlike most audio courses you&#039;ll find, &quot;Vocal Recording: A Complete Production Guide&quot; goes beyond simple tips to bring you through the entire process of creating hit-sounding vocals, from prepping the session &amp; performing, to setting up a great mix session &amp; mixing the vocals into the track. By hearing techniques from both the singer &amp; engineer&#039;s point of view, you&#039;ll be able to create your own hit tracks within hours!  </p>  <p>  \t &quot;Vocal Recording: A Complete Production Guide&quot; is for anyone who is an artist looking to hone their engineering and recording skills. It&#039;s for engineers who would like to improve on their studio techniques and developing a productive relationship with performing clients. It&#039;s for any singers who want to feel more comfortable in the studio. Lastly, it&#039;s for anyone who is interested in capturing the true nature of the song they wrote and presenting it in the best light possible.  </p>  <p>  \t This course will take you under 2 hours. Each chapter includes an in-depth discussion and how-to, focusing on one of the 8 steps in recording hit-sounding vocals. In addition, each chapter comes with a summary video for reference in addition to a PDF summary for your convenience.  </p>", 
    "end_date": null, 
    "title": "Vocal Recording: A Complete Production Guide", 
    "price": "50.00", 
    "instructors": "Cheryl B. Engelhardt, Enrico De Paoli", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/113564_a628_8.jpg", 
    "course_url": "https://www.udemy.com/vocalrecording/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-31T22:31:01Z"
}