{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>In the age of social media, everyone has a voice.</p>\n\n<p><br>And if you want to make your content sound amazing, this course is for you.</p>\n\n<p> It is the only place where you will see <strong class=\"redactor-inline-converted\">real life examples</strong> of different recording equipment and associated cost. Immediately you will see where you should invest your money.</p>\n\n\n\n<p>I understand, you have a burning passion for writing, teaching, creating.<br>You want to make your ideas tangible, release it to the world.<br>And yet sound recording, a crucial part of content creation, is seen as an obstacle, an unfortunate necessity.</p>\n\n\n\n\n\n<p>Tell me, how many times after listening back to your recordings, you felt like it is an impossible task, and just wanted to hit delete?</p>\n\n\n\n\n\n<p>Or not even that.<br>How many times you wanted to start a podcast, online course, a YouTube channel, but when it came to audio equipment and recording, you were lost?</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why is this course right for you?</strong></p>\n\n\n\n\n\n<p>Over and over I see people confused about recording setup and sound equipment. They don’t know where to start.<br>This course solves that issue.</p>\n\n\n\n\n\n<p>You will learn basics of sound recording, audio equipment, and fundamental recording techniques.</p>\n\n\n\n\n\n<p>You will learn that recording is a fun and exciting process, not a necessary barrier to jump.</p>\n\n\n\n\n\n<p>And what is most important you will learn from <strong class=\"redactor-inline-converted\">real life examples.</strong></p>\n\n\n\n\n\n<p>I worked with bands; I have done audio for games and movies.<br>The theory is fine; I enjoy reading and learning too.<br>But there is no better way to learn than doing and testing.</p>\n\n\n\n\n\n<p>I understand that it is not always possible to test what works best for you. You just want to start.</p>\n\n\n\n\n\n<p>And that is why I recorded and filmed many examples of different recording equipment.<br>From basic and cheap options to expensive, semi-pro.<br>It will give you a clear idea where you should invest your money, and where you should begin.</p>\n\n\n\n\n\n<p>You will not find this anywhere else;<em> it is the only sound recording course that offers you a real picture of your options.</em></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">The course structure</strong></p>\n\n\n\n\n\n<p>Learn the basics – that is my mantra.<br>You will start with learning about the most important piece of your equipment – the microphone.<br>In several lectures you will understand the differences between microphones on the market, you will learn the essential characteristics of a microphone.<br>But what is more important, you will see what choice you have available to you right now.</p>\n\n\n\n\n\n<p>You will progress onto other recording equipment, gear that is sometimes overlooked, nevertheless, important.</p>\n\n\n\n\n\n<p>In the middle of the course, you will see and hear how each of the options sounds like and how easy it is to set it all up.<br>You will start thinking which way you wish to go.</p>\n\n\n\n\n\n<p>You will learn important recording techniques.<br>Some basic ones and other less known tricks too.</p>\n\n\n\n\n\n<p>You will also find information on the psychology of a recording, and theory behind some recording terms.</p>\n\n\n\n\n\n<p>Each section will start with an introduction where you will see what lies ahead.<br>After the main content, you will finish with section summary.<br>You will also find a Call To Action, a short video with a small task that you can do.<br>And a Quiz to test your knowledge.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">AND THAT IS NOT ALL!</strong></p>\n\n\n\n\n\n<p>I know that time is the asset.<br>I composed this course because I wanted to give you ‘straight to the point’ information, no unnecessary talk.</p>\n\n\n\n\n\n<p>So after your first viewing, you may find it all a bit overwhelming.</p>\n\n\n\n\n\n<p>Don’t worry!</p>\n\n\n\n\n\n<p>I included <em class=\"redactor-inline-converted\">Closed Captions</em> and graphics throughout the course to make the learning easier.<br>We are visual creatures; we learn most with our eyes.<br>So I made the course as visually pleasing as possible.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">And yet it is still not all!</strong></p>\n\n\n\n\n\n<p>Sometimes you need to remember something in an instant.<br>And you don’t have time to rewatch the lecture, or maybe you can’t remember where to find the information.</p>\n\n\n\n\n\n<p>I took the main points of the course, stripped it down to basics, and <strong class=\"redactor-inline-converted\">I created an ebook just for you.</strong></p>\n\n\n\n\n\n<p>You will find it in the Course Summary lecture.<br>Use it anytime you want.</p>\n\n\n\n\n\n<p>Choosing your first sound recording equipment is hard, I know that.<br>So the best way is to listen and test different ways.</p>\n\n\n\n\n\n<p>My goal is to show you the possibilities, the options and the <strong>real cost of buying a recording gear.</strong></p>\n\n\n\n\n\n<p>This knowledge will put in miles ahead of the competition; it will make your content stand out from the crowd.</p>\n\n\n\n\n\n<p>In the age of social media, everyone has a voice.<br>Unfortunately, there is a lot of noise out there.</p>\n\n\n\n\n\n<p>Take the first step, make the world sound a little better.</p>\n\n\n\n\n\n<p>Mike</p>", 
    "end_date": null, 
    "title": "Your First Home Recording Studio – Audio Engineering Basics", 
    "price": "35.00", 
    "instructors": "Mike Migas", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848572_4c93.jpg", 
    "course_url": "https://www.udemy.com/your-first-home-recording-studio-audio-engineering-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Production"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T21:19:53Z"
}