{"selfpaced": true, "topic_name": ["STEM"], "description": "\n\n                    \n                    \n                    Are you a teacher of young learners? Are you involved in young people’s extra-curricular activities? Then this course could be for you. Whatever subjects you normally teach, you and your learners are surrounded by modern digital technology. Much of the technological change has been driven by young people, and their creativity has never been more influential. Facebook, Google, and Youtube were started by people in their teens and twenties. Many jobs of the future will be in information technology, underpinning so many other sectors such as agriculture, tourism, telecommunications, and financial services.\r\nThis course will help you to encourage today’s young digital consumers to become tomorrow’s digital creators. It is based around Scratch, a popular system adopted by millions of young learners worldwide as it fosters youthful curiosity, promotes creativity, and provides a basis for lifelong programming learning.\r\nYou’ll be truly amazed at how fast your learners get up to speed with coding skills! And if you’ve never written a line of code in your life, don’t worry. This course will get you started one step at a time!\r\nThis course is part of the Africa Code Week initiative, which aims at empowering African youth with the coding skills they need to thrive in the 21st century workforce and become key actors of Africa’s economic development. This online course is offered in addition to the hundreds of classroom events being held in parallel. Whether you are based in Africa or not, and whether you can attend one of these events or not, you can still take your first steps towards mastering a simple and fun programming language!\n\n                                            Syllabus\n                        Unit 1: Introducing Scratch and the Art of CodingUnit 2: Creating an Interactive Digital EnvironmentUnit 3: Coding Geometric Shapes and FreehandUnit 4: Planning and Designing Games\n                                    ", "end_date": "2015-10-29T00:00:00Z", "title": "Africa Code Week: Teaching Programming to Young Learners", "price": 0, "instructors": "Brendan Smith", "institution_name": [], "commitment": "", "subject_name": ["Education & Teaching"], "course_url": "https://open.sap.com/courses/acw1-1", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["openSAP"], "start_date": "2015-10-01T00:00:00Z"}