{"selfpaced": false, "topic_name": ["STEM"], "description": "\n\n                    \n                    \n                    Assessment for Learning (AfL) is a term that’s widely used in education, but applied in ways that are variable in their effectiveness. This free online course - designed for STEM teachers in primary and secondary schools, and sixth form and further education colleges - will help you understand and use it more effectively.\n\nUnderstand Assessment for Learning in theory and practice\n\nThrough this course, you’ll understand:\n\n\n  the theory and science behind effective Assessment for Learning;\n  how to use Assessment for Learning to elicit evidence about what’s going on in your learners’ minds;\n  how to use this evidence formatively with your learners in your laboratory and classroom;\n  and how to write, judge and use the hinge questions that are central to Assessment for Learning in STEM.\n\n\nEnjoy your teaching more\n\nAs the course progresses, you’ll be encouraged to try things out in your laboratory and classroom; actively reflect on what you discover in the process; and share your experience as part of the course discussions.\n\nYou’ll also be invited to read some of the scientific literature about Assessment for Learning. Your learners will gain as a result - and you’ll enjoy your teaching more.\n\nLearn with Dylan Wiliam, Christine Harrison and Andrea Mapplebeck\n\nThis course has been developed by the National STEM Learning Centre. It gives you the opportunity to learn with three leading experts in STEM education and assessment:\n\n\n  \n    Dylan Wiliam: Emeritus Professor of Educational Assessment at University College London and author of Embedded Formative Assessment;\n  \n  \n    Christine Harrison: Senior Lecturer in Science Education at King’s College London, past Chair of the Association for Science Education and former secondary school teacher;\n  \n  \n    Andrea Mapplebeck: Educational Consultant, Formative Education Ltd and former secondary school teacher.\n  \n\n\nContinue learning with the STEM Teaching program\n\nThis course is one of three in the STEM Teaching program - a suite of high-impact professional development from the National STEM Learning Centre. Completing the program will enable you to master different elements of STEM teaching and earn a FutureLearn Award as evidence of your continuing professional development (CPD).\n\nAbout the National STEM Learning Centre\n\nThe National STEM Learning Centre provides world-class professional \ndevelopment activities and resources to support the teaching of STEM \n(science, technology, engineering and mathematics) subjects. The Centre \nis a purpose-built, state of the art facility based at the University of York \nbacked by an unrivalled team of experts in the fields of education and STEM.\n\n\n                                    ", "end_date": "2016-12-12T00:00:00Z", "title": "Assessment for Learning in STEM Teaching", "price": 0, "instructors": "Dylan Wiliam and Chris Harrison", "institution_name": ["National STEM Learning Centre"], "commitment": "3 hours", "subject_name": ["Education & Teaching"], "course_url": "http://www.futurelearn.com/courses/assessment-for-learning-stem?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-10-31T00:00:00Z"}