{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you ready for the quickest, most exciting and empowering cleanse and yoga practice you can do--in so little time you'll be overjoyed to see fast changes and a new healing lifestyle emerging--and I'm about to save you so much time, money and energy while you make awesome shifts in your life. It's time, so: </p><p>Get ready to rock your body to the next level in the easiest possible way, starting today! </p><p>I'm Sadie Nardini, one of the world's well-known yoga and authenticity trainers, and I'm here to guide you through 14 days of simple, but super-effective action steps to help you look and feel amazing in just two weeks. </p><p>You're busy. We're all busy. No one needs more work added into their lives. </p><p>Luckily, this program will seamlessly and smoothly fit into your schedule. You'll get tons of results without spending hours in the gym or cooking. I made it so effortless for you to make the changes you seek, and even if you're feeling great, this course will give you the extra boost you need to feel even better. What's better than that?</p><p>I have honed the exact techniques that, in literally minutes a day, will move you out of fatigue, excess bloating and weight gain, or any plateau you have reached in your fitness or personal growth. </p><p>You are are about to have so much fun doing it too. </p><p>Now let's rock your new fit, fierce and fabulous lifestyle together!</p><p>See you there!</p><p>Sadie <br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "14 Day Ultimate Detox and Yoga Course!", 
    "price": "20.00", 
    "instructors": "Sadie Nardini", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655142_fb1d_2.jpg", 
    "course_url": "https://www.udemy.com/ultimatedetoxyoga/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T01:44:37Z"
}