{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tThis fun and simple real-world detox, empowerment and excess weight loss online yoga class is taught by Sadie Nardini, one of yoga&#039;s rising celebrity teachers, and an expert in combining specific yoga workouts with diet &amp; healthier living.  </p>  <p>  \tThis online yoga class is designed to teach you a <strong style=\"\">14 day routine</strong> that you can follow throughout your life to reduce weight, maintain your body more free of toxins and extra weight. Her pioneering method of teaching shows you exactly how effective yoga can be while keeping you relaxed, enthusiastic, and entertained. Simply follow her guidance by taking one step at a time for 14 days. After you&#039;re done you&#039;ll feel refreshed, youthful, and ready to start again!  </p>  <p>  \t<strong style=\"\">A new bonus workout has just been added for the 14 day program!</strong> It will help you shake things up, and give you an option that you can use anytime, during or after the 14 days!  </p>  <h5>What is Ultimate Wellness?</h5>  <ul style=\"\">  \t<li>Transformation happens on many fronts: in the way you treat your body through fitness and food, in the quality of the relationships with yourself or others you cultivate, and the quality of the choices you make.</li>  \t<li>Sadie offers you yoga, not just as a way to stay fit, but yoga as a multifaceted practice that helps you lead a healthy, happy and empowered life. This is what Sadie calls &quot;Ultimate Wellness.&quot;</li>  </ul>", 
    "end_date": null, 
    "title": "14-Day Yoga Detox and Empowerment Course", 
    "price": "30.00", 
    "instructors": "Sadie Nardini", 
    "commitment": "19.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8139_bbe5_11.jpg", 
    "course_url": "https://www.udemy.com/yoga-for-weight-loss-and-core-strength-with-sadie-nardini/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-06-17T14:17:05Z"
}