{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Course Description</strong></p>\n\n<p>This 5 Days Office Yoga Challenge is created to practice yoga at your work.\nIt contains 5 sections and each one presents one business day. The idea is to\nincorporate yoga as your everyday habit so you will be able to feel great\nbenefits of it.</p>\n\n<p><strong>Who is this course for?</strong></p>\n\n<ul><li>This course is for all of you who work a lot especially in the office or any\nother job which requires a lot of sitting. This is for all of you who feel\ntension in your shoulders and upper back. But it's also for all of you who want\nto improve your breath rate, focus and concentration. </li><li>This course is for all of you who have high level of stress (managers, doctors...).</li><li>Yoga teachers looking for something different, knowledge and inspiration to refresh their classes.</li><li>Practitioners all levels, from beginners to advanced. If you've never practiced yoga before, you\\re also very welcome.</li></ul>\n\n<p><strong>Important </strong>- If you suffer from some injuries, please see your doctor before taking this course.<br></p>\n\n<p><strong>What am I going to get from this course?</strong></p>\n\n<ul><li>Course presents one working week, from Monday to Friday. There are 5\nsections. Each one contains video lecture with downloadable material and it's\nsuggestion how to practice yoga at work. All lectures are also suitable to\npractice in the comfort of your living room.</li><li>Discover new way to practice yoga.</li><li>It will take you only 10 minutes per day from Monday to Friday to finish the\ncourse. So, you need only 50 minutes to complete it. If you are interested to\npractice on weekends, just pick any lectures you want. I suggest to pick\ndifferent lectures every weekend.</li></ul>\n\n<p><strong>What are the requirements?</strong></p>\n\n<ul><li>Chair</li><li>Comfortable clothes, no shoes, no socks.</li><li>Willing to incorporate healthy habit in your life.</li></ul>\n\n<p><strong></strong></p>\n\n<p>Course is structured in five sections. Each one is suggested for one\nbusiness day. That’s why I named it 5 Days Office Yoga Challenge.</p>\n\n<p><strong>Why take this course?</strong></p>\n\n<p>Taking this course and practicing continuously, day by day, week by week, you\nwill feel great benefits of yoga. After some time you will feel lower level of\nstress, better self-control, better breath rate, focus and concentration. You\nwill see the difference but people around you, your boss and your colleagues also will. And don't forget, key to\nsuccess in yoga is consistency!</p>", 
    "end_date": null, 
    "title": "5 Days Office Yoga Challenge", 
    "price": "25.00", 
    "instructors": "Marija Bukarac", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/717068_8b96.jpg", 
    "course_url": "https://www.udemy.com/5-days-office-yoga-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-05T13:57:18Z"
}