{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>*****************************************************************************************</p>\n\n<p><strong><em>Course Updated on 2nd May 2016. Earlier the course was having only 47 yoga poses; now we have added 3 more. Now its 50 Yoga poses to bring harmony into your life. Enjoy the new lectures while practising the old poses...</em></strong></p>\n\n<p>*****************************************************************************************<br></p>\n\n<p>Yoga has become a very popular form of exercise, however, some styles focus primarily on physically working the back, for instance: the most important Yoga poses in this case will differ from others, remaining the most important Yoga poses for another kind of Yoga. There are also very difficult one might focus on in other styles of Yoga designed to stretch and strengthen other specific parts of the body, and many that work the entire body, treating the body as left and right equals yin and yang.</p>\n\n<p>  \t                                  Yoga poses are the best way to maintain the body flexible, supple and toned up without exerting any force on the body. There is a certain subtlety in this ancient eastern system of body maintenance which keeps one in tune with nature.  </p>\n\n\n\n<p>  \t                                  Modern lifestyle takes its toll in terms of physical and mental health. Hypertension and diabetes are common ailments and the beneficiaries are pharma firms. Resources that should be spent on other productive channels are wasted in shoring up a tiring body that becomes an open invitation to premature aging and a host of diseases.  </p>\n\n\n\n<p>  \t                                  There are specific Yoga poses for the floor parts of Yoga exercise, as well as the more familiar standing Yoga poses.  </p>", 
    "end_date": null, 
    "title": "50 Yoga Poses To Promote Harmony in Your Life", 
    "price": "20.00", 
    "instructors": "✯ Dreamosa ✯", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/336316_5cd8_5.jpg", 
    "course_url": "https://www.udemy.com/yoga-poses-to-promote-harmony-in-life-dreamosa/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T06:21:52Z"
}