{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t                Are you ready to get toned, or &#039;cut&#039;, and powerful - in just a few days?  Do you feel you just don&#039;t have the time to dedicate to a gym but still want a bangin&#039;, healthy body?  <span>Do you have just 30 minutes a day to get the same fitness benefits of working out for 2 hours? Then this new-generation workout plan is for you.</span>  </p>  <p>  \t<strong> </strong><span>I&#039;ve designed my YogaCut program to incorporate only the most contemporary, effective and efficient movements and sequences to maximize your time on the mat - to get you far healthier and fitter than you&#039;ve ever been, <strong>in just 20 - 30 minutes a day!</strong></span>  </p>  <p>  \t<span>Utilizing the latest discoveries in yogic physiology and anatomy combined with the scientifically verified and optimized H.I.I.T. (High Intensity Interval Training) technique, YogaCut is designed for shockingly effective results!</span>  </p>  <p>  \t                If you&#039;ve had a hard time squeezing in your yoga or workout, <span>want more benefits like </span><strong>weight loss, body toning, lean, strong muscles, detox, cardio and core strength,</strong><span> or have plateaued in your fitness progress, then you&#039;re going to love this course.</span>  </p>  <p>  \t<span>I&#039;ll guide you through one week where you&#039;ll move through a yoga-influenced HIIT workout. You&#039;ll learn how to continue on into a fitness lifestyle that takes <strong>less time than checking your email</strong>, but makes you <strong>look</strong> and <strong>feel</strong> <strong>as good as if you worked out for 2 hours a day</strong>. </span>  </p>  <p>  \t                The Yoga Cut modules are specifically designed to teach you in a clear, easy way, 4 powerful yoga + HIIT (high intensity interval training) routines.  I&#039;ll also give you new action steps you can follow throughout your life to lose unhealthy extra weight, reduce toxins and generally feel better on all levels! <br>  \t<br>  \t               Here are the results you can get from the YogaCut program:  </p>  <p>  \t            - <strong>Maximized workout efficiency</strong>, making the most of time spent on the mat<br>  \t            - <strong>Burn more fat</strong>, during, and - most <strong>AMAZINGLY</strong> - in the 24 hours AFTER the completion of the workout<br>  \t            - <strong>Cardio training, or pushing the anaerobic threshold</strong>, thereby increasing heart health while decreasing blood pressure<br>  \t            - <strong>Peace of mind:</strong> you can do this instantly -- no equipment or props needed - just you and your body<br>  \t            - <strong>Whole-body toning</strong>.  Keep the MUSCLES, lose the FAT - grow stronger, leaner, denser muscle while burning off excess fat deposits<br>  \t            - <strong>Create a metabolic fire: </strong>Increase natural metabolism resting rate<br>  \t            - Time saved going to the studio or gym: <strong>Your YogaCut program is available ANYtime, ANYwhere! You can even download it.</strong><br>  \t            - <strong>It grows as your fitness does:</strong> always be challenged to your next level.<br>  \t<br>  \t            - And that&#039;s just the start.  By implementing the diet and lifestyle suggestions you will experience even more benefits, including improving the quality and fun in your self-relationship, as well as interpersonal relationships and increased focus and clarity about direction and goals, to name a few.  <br>  \t<br>  \t          It&#039;s time to set your path.  Get ready for a new you - body, mind and spirit!  </p>", 
    "end_date": null, 
    "title": "7 Day Yoga Cut - High Intensity Interval Yoga!", 
    "price": "45.00", 
    "instructors": "Tyler McCoy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287486_04fd_5.jpg", 
    "course_url": "https://www.udemy.com/7-day-yoga-cut/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-25T16:11:24Z"
}