{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This seven day Chakras for Beginners course is a holistic approach created to\r\nhighlight the power of the chakras and chakra balancing through meditation,\r\njournal writing, yoga postures, and breathing techniques. Studying the chakras\r\nseparately one day at a time breaks down the information so the depth of each\r\ncan be easily digested. This Chakras for Beginners course will show you how effective\r\nconsistent practice with clear intention can be for finding and keeping peace.\r\n\r\n</p><p>Studying the energy within guides you to find a deeper understanding of\r\nyourself. Following my instruction you will learn what the chakras are and how\r\nfocusing on balancing chakra will bring you greater self-understanding,\r\nself-confidence, and less stress.</p>\r\n\r\n<p><br>\r\nSo what is a chakra?</p>\r\n\r\n<p><br>\r\nThe term chakra translates to wheel or disk. Within our body there are seven\r\nmajor chakras, which can be thought of as energy centers. Each chakra\r\ncorrelates to our levels of consciousness, from the most primitive to\r\ntranscendent. The seven chakras are: Muladhara (root), Svadhisthana\r\n(sweetness), Manipura (lustrious gem), Anahata (unstuck), Vissudha\r\n(purification), Ajna (Command Center), and Sahasara (thousand fold). The first\r\nchakra starts with the most primitive level of consciousness and gradually\r\ndevelops until you reach the seventh chakra and highest level of consciousness.&nbsp;</p>", 
    "end_date": null, 
    "title": "7 Day Yoga Routine: Increase Energy & Balance Your Chakras", 
    "price": "50.00", 
    "instructors": "Liza Laird", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/18273_8928_7.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-the-chakras/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-21T19:53:13Z"
}