{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Course 1 is the 1st part of a 3 Part Series.   It contains 2.5 hours of yoga video routines and sequences realized in 3 camera angle for easy to follow video lessons. These lessons will prepare your body for Course 2 and 3. If you are interested in registering for all 3 levels, please&nbsp;<a class=\"external-link\" href=\"http://www.udemy.com/yoga-with-perumal-complete-courses-1-3\" target=\"_blank\" rel=\"nofollow\" style=\"\">click here</a>. You don&#039;t have to purchase all levels to experience the benefits of Yoga with Perumal so feel free to start with this introductory Course 1.</p>  <p style=\"\">Course 1 is a step-by-step progressive approach in order&nbsp;to improve mobility, breathing and circulation&nbsp;while&nbsp;strengthening muscles, tendons and ligaments. Practicing Course 1&nbsp;instills calm, clarity, increased energy while reducing stress. <br style=\"\"></p>  <p style=\"\">Course 1&nbsp;is made of pranayama breathing techniques, preparatory exercises for joints, stretching and relaxation techniques for meditation. Here is an ability to grow progressively from yoga sequence that may be followed at one’s own pace from beginner level at Course 1 or&nbsp;through advanced level at Course 3. </p>  <p style=\"\">The videos are designed to provide a comprehensive view of each pose since provided are 3 different camera angles for all postures to show lateral, frontal, and overhead views. Included are supportive manuals to each lesson.</p>  <p style=\"\">In Course 1 you will find:&nbsp;</p>  <ul style=\"\">  <li style=\"\">4 progressive complete lessons listed as 1A, 1B, 1C and 1D.<br style=\"\"></li>  <li style=\"\">7 Short Courses on pranayama breathing, joint preparation and stretching.</li><li style=\"\">84 pages of detailed manuals from Course 1A - 1D and the Short Courses.</li>  </ul>  <p style=\"\">1A - 1D is 30 - 45 minutes in length. If there is only 5 - 25 minutes of practice time then work with the Short Courses. After&nbsp;mastering Course 1 continue with Course 2 and 3.<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Authentic Yoga Experience Series 1", 
    "price": "25.00", 
    "instructors": "Perumal Koshy", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20320_ad0c_16.jpg", 
    "course_url": "https://www.udemy.com/yoga-with-perumal-course-series-1/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-28T15:40:02Z"
}