{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Practicing and studying&nbsp;<strong style=\"\">Yoga with Perumal</strong>&nbsp;is for&nbsp;<strong style=\"\">personal growth, health, energy optimization&nbsp;</strong>and<strong style=\"\">&nbsp;stress reduction</strong>.&nbsp;</p>  <p style=\"\">This Course 2 Series is the second part of a&nbsp;<strong style=\"\">3 Part Series</strong>. If you are interested in registering for all 3 Courses, please&nbsp;<a href=\"http://www.udemy.com/yoga-with-perumal-complete-courses-1-3\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\"><strong style=\"\">click here</strong></a>. We recommend that you start with Course 1 and proceed to this intermediate course, of Course 2.</p>  <p style=\"\">In this Course 2 Series, you will be taken through a step-by-step, progressive approach to allow you to achieve the right state of flow in order&nbsp;<strong style=\"\">to improve mobility, breathing and circulation&nbsp;</strong>while<strong style=\"\">&nbsp;strengthening muscles, tendons and ligaments</strong>&nbsp;leading to genuine mental and physical well-being. If you practise these videos, you should feel&nbsp;<strong style=\"\">results of calm and clarity along with highly increased energy while experiencing stress reduction</strong>.</p>  <p style=\"\">Yoga with Perumal is made up of 6 parts that act as an underlying fixed foundation. The 6 parts of Yoga with Perumal are pranayama, preparatory, salutation, strength, stretching and meditation. Each part follows a particular order to act as synergistic to the other. Whether you are taking Course 1, 2, or 3 of the series, each course includes a combinaton of these six parts for your total training.&nbsp;The most important aspect of Yoga with Perumal is the ability to grow progressively from yoga forms and a sequence that may be followed at one&rsquo;s own pace from beginner through advanced. Again, please go at your own pace!</p>  <p style=\"\">Each video lecture is designed to give you the most comprehensive view of each pose since I provide&nbsp;<strong style=\"\">3 different camera angles for all asana (postures) to show you a lateral, frontal, and overhead perspective</strong>. Each video also has supportive text to reveal any hidden aspects of yoga and is accompanied by a supportive manual for total understanding of each pose.&nbsp;</p>  <p style=\"\"><strong style=\"\">In this course, you will find:&nbsp;</strong></p>  <ul style=\"\">  <li style=\"\">the <strong style=\"\">complete Course Series 2</strong>, which includes 4 long progressive lessons named 2A - 2D.</li>  <li style=\"\">the <strong style=\"\">complete Short Series</strong> on Pranayama, Preparatory, Saluation and Stretching.</li>  <li style=\"\"><strong style=\"\">amazingly detailed manuals</strong> for both Course 2A - 2D and of the Short series to provide additional information on the video lessons.</li>  </ul>  <p style=\"\">The Course Series 2 is a step-by-step development form that progresses from least challenging to most dynamic postures. Course 2A - 2D videos areapproximately 45 - 60 minutes in length so if you only have 5-25 minutes of practise time, work with the Short Series.&nbsp;It is always best to start at the beginning of each Short Series before going to the higher levels.&nbsp;</p>  <p style=\"\">Once you have mastered Course 1 &amp; 2, I hope you will continue your practice with the final course series on Course 3, and continue mastering the Short Series that is found in each of the different courses.&nbsp;</p>  <p style=\"\"><strong style=\"\">Thank you for your interest in Yoga with Perumal and I hope you enjoy the series!</strong></p>  <div style=\"\"><strong style=\"\">&nbsp;</strong></div>  <p style=\"\"><span class=\"auto-style2\" style=\"\">&nbsp;</span></p>", 
    "end_date": null, 
    "title": "Authentic Yoga Experience Series 2", 
    "price": "50.00", 
    "instructors": "Perumal Koshy", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20321_8e78_13.jpg", 
    "course_url": "https://www.udemy.com/yoga-with-perumal-course-series-2/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-28T15:40:02Z"
}