{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Would you like to increase your energy, decrease stress,  improve your digestion and sleep like a baby? Madhuri will teach you how to  live a life of radiant health and vitality through simple and effective Ayurveda yoga practices  in this Yoga Classes for Beginners.  Ayurveda is a natural, comprehensive healing science that originated over 5000  years ago based on living in harmony with nature. It is an essential and  integral component of understanding your own unique nature and how to do  specific yoga asanas (postures) and pranayama (breath work) to balance your  dosha or Ayurvedic constitution!</p><p style=\"\">This Yoga  Classes for Beginners course consists of an introductory lecture on Ayurveda yoga principles,  3 Ayurveda yoga  classes that you can do time and time again for the 3 doshas, vata, pitta and  kapha. These classes are designed for various purposes; to de-stress and relax,  to invigorate and energize and to cool and calm. You will be given an Ayurvedic  dosha checklist to self assess your own prakruti (original nature) and vikruti  (current state) to help you understand what kinds of foods, activities and  lifestyle choices are most suited for you. You will learn 3 pranayama  (breathing practices) to calm and relax, invigorate and cool you down,  depending on what you may need. Madhuri will guide you through an ancient  mantra and meditation that everyone can do even if you&#039;ve never meditated  before. What you will learn in this course is accessible, practical, deeply  healing and the benefits are lifelong.</p><p style=\"\">      </p><p style=\"\">Take this Yoga  Classes for Beginners and learn Ayurveda yoga to increase your energy, decrease  stress, improve your digestion and sleep like a baby and more.</p>  <p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Ayurvedic Yoga for your Dosha", 
    "price": "40.00", 
    "instructors": "Madhuri Phillips", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21267_572a_5.jpg", 
    "course_url": "https://www.udemy.com/ayurvedic-yoga-for-your-dosha/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-16T18:41:32Z"
}