{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Namaste beautiful Yogi. Welcome to Interval Yoga Beginner Series.This is Part One, Level One of the series. There are three progressively more challenging and more intense parts of this course that you can join at your pace and convenience as you feel ready to move forward. You can practice along with this course for anywhere from 30 to 90 days before moving on to Part Two where we will progressively deepen the intensity and level of the classes. In this program you will have 5 classes a week and a challenge at the end of each week that I strongly encourage you to complete. Some of the challenges require a week long commitment of a couple of minutes a day. Although the commitment for the challenges is minimal expect great results from them! The course as a whole is designed to make you stronger, fitter, more flexible and more grounded. </p><p> This is the introduction to your transformational journey that will present meal and lifestyle ideas along with an introduction to Interval Yoga.</p><p>Interval Yoga is a comprehensive approach to Yoga and High Intensity Interval Training (\"HIIT\") that you can do in your own living room for a minimal amount of time. So if you have a busy schedule this is the perfect system for you. The ancient practice of Yoga has the capacity to literally change the nerve passages in the body which can transform the way we see our world. You will find yourself much more calm and peaceful in your day to day activities. In addition practicing Yoga will tone your muscles and increase your flexibility. HIIT is the most effective way to train and condition the body.  It was created in Japan by Dr. Izumi Tabata. He created a system of training that was originally geared towards college athletes. The system prove to be extremely quick and effective in building a strong, lean, muscular physique in a short amount of time. I have taken it a step further and I have combined two seemingly opposite in their approach systems into one comprehensive and synergistic system that can give you the ability and means to create functional strength, endurance, flexibility, mindfulness and power while reducing stress and achieving your perfect weight.  It is all done with minimum or no equipment, minimal space requirements and less than 30 minutes a day on most days. All I ask from you is to be dedicated and committed and the sky is the limit. </p><p>I have put this program together in order to introduce you to a new lifestyle that will transform you into the Beautiful Yogi that you are! After the Part ONE, Month One you can move on to part Two and Part 3 of this Comprehensive Beginner yoga and HIIT Journey. As you are moving through the course you will feel yourself becoming more relaxed in your day to day activities. You will see the transformation of your body as it becomes leaner and more muscular along with becoming more flexible.  By the time that your finish this 12 week program (all 3 parts of this course) you will be able to move on to my Level 2 classes and you will be on your way to becoming a lean, muscular high conscious and aware Beautiful Yogi. Remember, this is a journey so enjoy it! These Yoga classes and HIIT workouts should be fun! Along with your diet and lifestyle ideas. Everything is designed to be simple and enjoyable and highly effective in order for you to get yourself in shape and become the optimum YOU. So enjoy and remember Yoga is the journey!</p>", 
    "end_date": null, 
    "title": "Beginner Yoga and HIIT Course Part One", 
    "price": "25.00", 
    "instructors": "Ali Kamenova", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/740698_107e_3.jpg", 
    "course_url": "https://www.udemy.com/beginner-interval-yoga-and-hiit-course/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T07:16:54Z"
}