{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<strong>FOR TEACHERS:</strong><p>Increasingly, people are turning to yoga to help them feel comfortable in their own bodies. As a yoga instructor, you want to be able to offer clientele safe and fun modifications compared to traditional poses. This course will give you the tools you need to learn Chair Yoga and start offering it in your classes. Included are three full-length chair yoga practices, as well as a breakdown of 30 yoga poses. It's a great course for anyone looking to teach yoga to seniors or people with reduced mobility.</p><p><strong>FOR PARTICIPANTS:</strong></p><p>Looking for a <strong>safe and gentle</strong>, yet effective yoga practice that doesn't have you performing those “pretzel-like\" yoga positions? A practice where you can enjoy all the benefits of traditional yoga while being comfortably supported by a chair?</p><p>This Chair Yoga course has you in mind. If limited mobility or injuries are holding you back from enjoying your body to the fullest, then you owe it to yourself to give this course a try. It's an amazing way to <em>safely stretch and strengthen</em> your body.</p><p>To see if Chair Yoga is right for you, identify any of the following limitations you might have:</p><ul><li>Living with chronic pain…</li> <li>Limited mobility due to illness, injury or disease…</li> <li>Inflammation in the joints…</li> <li>Working at a desk all day…</li> <li>Never done yoga before…</li> <li>And difficulty standing for long periods of time.</li></ul><p><strong>If You're Experiencing Any of These Limitations… </strong></p><p>Chair Yoga might be the perfect practice to help you slowly develop balance and stability—while improving strength and flexibility.</p><p>People with limited mobility often think yoga is not accessible to them. It absolutely can be. By moving slowly and mindfully, you can <em>open up tight areas of your body in a safe and supportive way</em>. </p><p>Kassandra walks you step-by-step through each of the poses. Her detailed instructions allow you to follow along without having to keep your eyes glued to the screen. You can practice at your own pace in the <em>comfort of your home</em>, and you'll get the feeling of being in the studio. It won't feel like you're “missing out\" on anything. You'll also find it's<em> more time and cost effective</em> than a regular class<em>.</em></p><p><strong>This Course Includes 3 Easy Classes:</strong><em></em></p><ul><li><strong>Slow Flow - Level 1: </strong>Starts off slow so you can build a strong foundation. You'll stay seated on the chair for the entire practice and focus on opening up your neck, shoulders, and hips.</li> <li><strong>Balance &amp; Stability - Level 2: </strong>Slightly faster paced. You'll integrate some standing poses while using the chair for balance and stability. This is the perfect class for people who are working at slowly regaining their strength and mobility back.</li> <li><strong>Quick Energizer - All Levels: </strong>Designed to <em>quickly </em>give you a boost of energy through several simple poses including: twists, side bends, and forward folds. It's the perfect class to do on your lunch break at work or any time you're feeling lethargic.</li></ul><p><strong>Downloadable Content and Free Bonus Included</strong></p><p>Each video lesson is downloadable so you can put them on your tablet or smart phone. Watch them anywhere! What's more, you'll also receive a <strong>FREE</strong> <strong>BONUS </strong>“Yoga at Home – 100 Yoga Poses\". In this eBook you'll see illustrated pictures of Kassandra's favorite 100 yoga poses with complete instructions (no chair poses in this).</p><p>Included is a <strong>Money-Back Satisfaction Guarantee</strong>. If for ANY reason you aren't satisfied within 30 days, we'll happily refund every penny. In fact, go ahead and TRY the course out right now. See for yourself. If it's not everything and more… get your money back promptly.</p><p>This course has already impacted many people. You don't have to be flexible or strong to receive the benefits of Chair Yoga. As long as you're willing to give it a chance and practice consistently… your life <em>will</em> change.</p><p><strong>Please consult with your physician before beginning any exercise program. By participating in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself, and agree to release and discharge Yoga with Kassandra from any and all claims or causes of action, known or unknown, arising out of Yoga with Kassandra's negligence.</strong></p>", 
    "end_date": null, 
    "title": "Chair Yoga - Learn To Teach & Practice Chair Yoga", 
    "price": "25.00", 
    "instructors": "Yoga Instructor Kassandra Reinhardt", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415538_d829_5.jpg", 
    "course_url": "https://www.udemy.com/chair-yoga/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-07T03:20:42Z"
}