{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em>\"As a therapist for twenty years, I have reviewed many publications, classes, books etc. to help clients. This class is the most thorough combination of helpful strategies I have ever seen! Absolutely wonderful and a very positive way to help with emotional issues as well as depression.</em></p>\n\n<p><em>Don't let the yoga aspect keep you from taking this class. Although a valuable component, it doesn't have to be used to still make this class one of the most powerful emotional programs I have ever seen.\" Dr. J Stone</em></p>\n\n<p><strong>Tired of waking up feeling down and sad?</strong></p>\n\n<p><strong>Ready to try a natural and soulful and uplifting experience?</strong></p>\n\n<p>Are you standing on the verge of change, a major breakthrough in your life? Do you want to let go of whatever it is that is preventing you from feeling good enough, loveable enough, skilled enough or attractive enough?</p>\n\n<p>If the answer is yes, I want to assure you that you can be free of these feelings. You can be happy and you can fall in love with yourself and be loved fully by another.</p>\n\n<p>In my experience, yoga and meditation are the most powerful tools that will help you to transform your life.</p>\n\n<p>Sara Lazer a Neuroscientist, recently studied the affects of 8 weeks of daily meditation on depression sufferers by measuring changes in their brain using MRI mapping. The results showed conclusively that meditation changes the brain.</p>\n\n<p>It slows down age related degeneration of the brain.</p>\n\n<p>It increases areas of the brain that regulate emotions.</p>\n\n<p>It increases the areas of the brain related to empathy &amp; compassion.</p>\n\n<p>It increased areas of the brain relating to the control of stress.</p>\n\n<p>All of the participants reported that they felt more positive and this was reflected in the changes in their brains. Meditation works!</p>\n\n<p>Researchers at Oxford University say that mindfulness-based cognitive therapy stopped as many people from sliding back into depression as strong medication. Meditation is as good as anti-depressants for tackling depression</p>\n\n<p><strong>This is a Low Risk Program</strong></p>\n\n<p>This course is only $50 and it's 100% guaranteed so you will get your money back if it doesn't work for you. So there is no risk and so much to gain by registering for this course today.</p>\n\n<p>I will also be there to support you through out the program by answering questions and being active in discussions and I will send you interesting articles and additional lectures as they are developed.</p>\n\n<p><strong>How This Course Is Structured:</strong></p>\n\n<p>This is a 7-module program that focuses on 7 key topics proven to heal depression.</p>\n\n<p>Each of the topics includes a meditation and a yoga practice.</p>\n\n<p>Each key includes valuable information &amp; practices from Yoga Therapy, Cognitive Behavioral Therapy, Somatic Psychotherapy, Spiritual Integration Therapy and experts in Diet &amp; Nutrition.</p>\n\n<p>Whilst studying and deepening your understanding about your depression, you will progress through a series of structured yoga and meditation practices to help you to rewire your brain.</p>\n\n<p><strong>What Are the Requirements To Guarantee Your Success?</strong></p>\n\n<p>You have a genuine desire to want to wake up feeling good about who you are.</p>\n\n<p>You are committed to working with a daily practice of Yoga &amp; Meditation.</p>\n\n<p>You are open to the possibility that you can overcome depression and that feeling peaceful and joyous is possible.</p>\n\n<p><strong>What Will I Get Out of This Program?</strong></p>\n\n<p>34 Recorded Lectures, PDF transcripts, 6-audio recorded meditations, 3-video recorded yoga classes. (over 10 hours of content valued at $1,080)</p>\n\n<p>Learn how to reduce your symptoms of depression and increase your feelings of well being.</p>\n\n<p>Learn why your mind is making you feel depressed and how to change it to feel positive, relaxed and at peace.</p>\n\n<p>Understand why your brain has become biologically wired to support your depression and how you can rewire it to support positive thoughts and feelings.</p>\n\n<p>Learn what your common thinking errors are and how to change them.</p>\n\n<p>Learn powerful tools and practices that generate positive thinking &amp; feeling pathways in the brain.</p>\n\n<p>Learn 3 therapeutic breathing techniques that will calm and relax your mind, body and emotions after only 5 minutes of practice.</p>\n\n<p>Listen to a guided relaxation that teaches you how to release tension and stress in the body naturally without the use of drugs.</p>\n\n<p>Learn easy techniques that harmonize your feelings and change your perspective about yourself. Finally, love who you are!</p>\n\n<p>Work with a powerful tool that changes your negative feelings/emotions to positive feelings/emotions.</p>\n\n<p>Say goodbye to the 'inner critic', the critical voice in your head.</p>\n\n<p>Implement a diet and exercise plan to help you to release endorphins, the 'feel good' hormones</p>\n\n<p>Take away gentle daily yoga &amp; meditation practices designed by a Yoga Therapist (with 15 years experience) to heal your experience of depression.</p>\n\n<p>Focus on moving forward as opposed to thinking about the past.</p>\n\n<p>Receive guidance on how to connect with your inner peaceful essence.</p>\n\n<p>Learn how to release your depression naturally without medication.</p>\n\n<p>Work with techniques that focus on you developing love for yourself.</p>\n\n<p>Have the support of a twice qualified yoga teacher and counselor with over 15 years experience specializing in mental health</p>\n\n<p><strong>How is This Program Different From Other Approaches?</strong></p>\n\n<p>This program not only focuses on the mind &amp; the emotions, but also on the spiritual and the physical, which is different to other approaches. It is a balanced mix of philosophy and practices from eastern and western traditions.</p>\n\n<p><strong>Who is this Program For?</strong></p>\n\n<p>This program is for anyone who suffers from anxiety and/or depression or emotional issues who wants to create powerful change in their lives. There is no such thing as a quick fix solution. But if you are ready to commit to change then this program is for you.</p>\n\n<p>People who have tried other approaches including medication and therapy but still suffer from depression. NB I do not advise going off your medication while you are doing this program. It is important that you consist with your health provider before you reduce your medication.</p>\n\n<p>People who are ready to do the legwork to create positive change in their lives.</p>\n\n<p>This program is perfect for those who want to continue with therapy but feel they need additional support.</p>\n\n<p><strong>This Program is Not Suited For...</strong></p>\n\n<p>Because this program includes meditation, unfortunately, it is not suitable for those who suffer from psychotic episodes or delusions. If you do fall in this category, please work with someone one-on-one who can give you personalized support and will monitor your progress.</p>\n\n<p><strong>Register for this program NOW and transform your life!</strong></p>\n\n<p>I look forward to sharing this journey with you.</p>\n\n<p>Much love, Teagan</p>", 
    "end_date": null, 
    "title": "Conquer Your Depression With The Power of Yoga & Meditation", 
    "price": "50.00", 
    "instructors": "Teagan  Fea", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289738_b746_14.jpg", 
    "course_url": "https://www.udemy.com/the-7-keys-to-healing-the-pain-of-depression/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-28T18:59:16Z"
}