{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Wanna know what to do when it’s just you and the mat?!</strong> Then your in the right place.</p><p>Inspired by my most popular class I teach every week this program<strong> shows you how to develop a personal practice</strong> you can do wherever you are.</p><p>It gives you <strong>two yoga practices</strong> to choose from to start as your foundation and then the <strong>tools and techniques to modify, tweak it and go beyond</strong> so you build a practice that’s unique to you.</p><p>If you've every struggled remembering a sequence, not to worry, in this program I break it down through interactive ways and games to help master any sequence.</p><p>I also cover the benefits and provide solutions to overcome the obstacles that come up.</p><p>The program is comprised of talking &amp; demonstrative style videos and contains lots of additional PDF’s you can download and print out to help you establish a consistent yoga practice.</p><p>Having a personal practice allows you reconnect, re-energise and relax your whole body mind and spirit.</p><p>It’s fruits are bountiful! Not only does it help in reducing stress, improve wellbeing, helping in letting go and feel grounded.</p><p>But the ultimate benefit of having a personal practice is you are equipped with the self knowledge on how to practice on your own! This brings you the chance to really see what you need and to create and move from there, it fuels self expression, creativity but most of all to be the master of your destiny!</p>", 
    "end_date": null, 
    "title": "Create a personal home yoga practice", 
    "price": "25.00", 
    "instructors": "Basia Nowacki", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/745650_0ad1_2.jpg", 
    "course_url": "https://www.udemy.com/create-a-personal-home-yoga-practice/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-29T07:00:03Z"
}