{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course has two goals. 1. To supply you with a \"toolbox\" of resources so that you can practice yoga when you are waiting somewhere and use your time wisely! 2. To cultivate patience and improve your state of mind. </p><p>The first section has eight videos will teach you seated and standing poses and exercises that you can do anywhere you go! The videos are instructional and you can do them as often as you like, stringing them together or picking and choosing the videos. A savanna practice is included to do at any time.</p><p>The second section has two videos that will teach you breathing exercises (pranayama). Breath training helps to focus the mind and directly affects our emotions. When you're upset you breathe differently then when you're relaxed. These two help promote relaxation and are very beneficial to do when you're flustered, nervous or angry.</p><p>The third section has three videos that are intended only for practice in order to help you gain patience. This could mean patience with yourself and situations that you find yourself in. This is done by building up to challenging poses like locust and goddess and also holding poses for longer than average and moving slowly. By doing this you're training your brain to rest and observe to find comfort in challenging poses. Once you develop this attitude on the mat, when you are experiencing life off the mat you'll be able to respond in a healthy manner and cope better. </p><p>There are some resources in the course for you to view and help supplement what is taught in the videos. </p><p>This course can be completed in a day, or you can take your time to get through it. It is a resource that you can keep coming back to and I encourage you to do that to get the most out of it!</p>", 
    "end_date": null, 
    "title": "Cultivating Patience through Yoga, Meditation and Breathing ", 
    "price": "20.00", 
    "instructors": "Jessica Ann", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107628_ec7e.jpg", 
    "course_url": "https://www.udemy.com/cultivating-patience/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-18T19:25:32Z"
}