{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Do you find the kids bored during the class?</p><p>Do the kids seem too hyper or too low and tired?</p><p>Do the kids seem over worked mentally?</p><p>If these all applies t the kids in your class, then i have an important and fun tool for you in this course to learn.</p><p>Animal yoga is an imitation of animals in the yoga poses, while we engage the kids to act out the sound of the animal or the nature of the animal.</p><p>This bring controlled laughter and fun tot he class, while the kids spend their time constructively.</p><p>These exercises can be done anywhere, as partly standing and sitting as well.</p><p>It is recommended to be the first 5 minutes of the class or the closing 5 minutes of the class, or anytime you find the kids with low focus or being too hyper.</p><p>These exercises bring the fun and refreshing element for the brain and the body, so the ids can focus better.</p><p>Your disciplining problems in the class will disappear as the kids behavior get more calmer and focused.</p><p>These exercises are great for any age, and even adults, and workplace even for executives for team-building.</p><p>Enjoy the 5-minute-mini break and feel the refreshing experience. Yes if children learn to stop and stretch and breath during the day, they will get a better performance out of their days and as adults will keep these healthy habits, and likely avoiding smoking addictions.</p>", 
    "end_date": null, 
    "title": "Fun Yoga for Kids", 
    "price": "20.00", 
    "instructors": "Dr Zsuzsanna Fajcsak", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/744738_1108.jpg", 
    "course_url": "https://www.udemy.com/fun-yoga-for-kids-by-drzsu/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-28T12:43:24Z"
}