{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Welcome to my Course about the fall season and symbolism in autumn. </p><p>My name is Hannah and I love creating fun and meaningful yoga courses.</p><p>I’ve been teaching live yoga classes for over a year now after receiving my 200-Hour teacher training at one of San Diego’s most authentic Vinyasa yoga studios, and I’ve seen the difference that teaching fun yoga is making in many of my friends and family members lives.</p><p><strong><em>After completing this course, you will be able to:</em></strong></p><p>•\tDemonstrate physical poses that will build strength, flexibility, and balance</p><p>•\tMove consciously with your breath</p><p>•\tActivate and share your light within</p><p>•\tBecome more at peace with transitions</p><p><strong><em>This Course consists of 4 sections:</em></strong></p><p>•\tFall Color and Transition</p><p>•\tCelebration of Light Through Diwali</p><p>•\tDeath, Yoga, and Day of the Dead</p><p>•\tCostumes and Identity</p><p><strong><em>In each section you will find:</em></strong></p><p>•\twritten discussion about the topic </p><p>•\tvideo explanation with key ideas to reflect on </p><p>•\tbreakdowns of foundation and alignment to keep you safe and activated during key poses</p><p>•\tphysical yoga sequence video that includes warm-up, Sun-Salutations, key poses, inversions, cool down, final resting pose with music.</p><p><br></p><p>I designed this course for individuals and families who want to celebrate life, abundance, and themselves, by reducing stress, and building strength and flexibility for a balanced body.  </p><p>If you are challenged by facing the time change and cooling weather and you want to explore a fun way to exercise and feel energized than this course is for you!</p><p>Thank you for your interest in my course and I look forward to hearing more about your path to finding peace!</p>", 
    "end_date": null, 
    "title": "Fun Yoga for Autumn ", 
    "price": "35.00", 
    "instructors": "Hannah Faulkner", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659770_6028_2.jpg", 
    "course_url": "https://www.udemy.com/fun-yoga-for-autumn/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T06:23:00Z"
}