{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">En cada clase irá descubriendo, progresivamente, cómo armonizar la <em style=\"\">respiración (pranayama)</em> con los <em style=\"\">movimientos y las asanas (posturas) </em>de un modo fluido y agradable a la vez que metódico, <em style=\"\">finalizando cada sesión con una relajación guiada por el profesor.</em> </strong>La repercusión sobre su bienestar no se hará esperar. <strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t    Si lo que está buscando es <strong style=\"\">poder prácticar cómodamente desde dónde quiera y cuándo quiera, de forma guiada por un profesional del yoga,</strong> este es su curso. Aprenderás cómo utilizar sus herramientas naturales (cuerpo, mente y respiración) para sentirse mucho mejor.  </p>  <p style=\"\">  \t<strong style=\"\">Aprenderá:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">- más de 30 asanas báscias del Hatha yoga y</strong> a fluir en su práctica.<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">- 15 técnicas distintas de pranayama o respiración consciente</strong>  </p>  <p style=\"\">  \t<strong style=\"\">- experimentará 24 relajaciones y visualizaciones guiadas diferentes</strong> que le darán una conciencia renovada de su cuerpo y de su mente.<em style=\"\"> Algunas de estas relajaciones-visualizaciones son: el lago en calma, alfombra mágica, regreso a la infancia, el globo, el lugar ideal de descanso, arco iris, meditación en el sol, mente redonda llena de luz, peso - oleaje de calma, la llama interior, la puerta... y muchas más.</em>  </p>  <p style=\"\">  \t    Nos encontramos en la práctica.  </p>  <p style=\"\">  \t    NAMASTE  </p>", 
    "end_date": null, 
    "title": "Hatha vinyasa yoga para principiantes e iniciados. Fluye", 
    "price": "40.00", 
    "instructors": "Valvanera Berenguer", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/161430_c6e8_5.jpg", 
    "course_url": "https://www.udemy.com/curso-de-yoga-on-line-para-principiantes-e-iniciados/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-10T21:23:29Z"
}