{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><p>This Yoga Postures\r\nCourse consists of 8 practice session films that build on each other. Each one\r\nis a complete practice. They slowly teach the alignment of the Honest Yoga\r\nEssentials Series which is the eighth video. Vow to heal yourself and witness\r\nthe changes after this commitment. In this Yoga\r\nPostures for Beginners Training Students will build a series of postures\r\nand learn correct alignment. Great for athletes that want to build a mindful\r\nfocus in their sport. The Honest Brand New Beginner Course teaches the\r\nfundamental principles of yoga that work quickly to improve your posture,\r\nalleviate pain, and focus your mind. After your very first video, you will feel\r\nrelaxed and energized. After eight, you will understand why yoga is the oldest,\r\nmost effective system of wellness in existence. We strongly encourage all\r\nbeginners to attend this Yoga Postures course\r\nand welcome intermediate students to help them deepen their understanding of\r\nthe yoga process. This series takes the “weird” out of yoga helping beginners\r\nto understand why and how the postures are practiced. You will build strength,\r\nstamina and flexibility.</p>\r\n\r\n<p>You will also receive documents on yoga\r\nstudio etiquette and a list of the postures you are learning &amp; their\r\nbenefits.</p>&lt;/p&gt;\r\n", 
    "end_date": null, 
    "title": "Honest Yoga: Brand New Beginners ", 
    "price": "25.00", 
    "instructors": "Danielle Vardakas- Duszko", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21452_8e60_3.jpg", 
    "course_url": "https://www.udemy.com/honest-yoga-brand-new-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-19T07:03:08Z"
}