{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">INTRODUCTORY PRICE $89. GOOD FOR A LIMITED TIME</strong>  </p>  <p>  \t<em style=\"\">I like the way Colette breaks down exactly step-by-step the results we are looking for in every movement and which muscles we are stretching and why because it helps me do the exercise correctly and benefit from the workout instead of just going through the motions. -Sue</em>  </p>  <p>  \t<em style=\"\">It amazes me that after one hour of the Barry -Method class I felt better than I have in years, and I feel this is going to be more effective than any other therapy I have been through in rehabilitating my back and core strength. I look forward to my next session this week! Most Effective Therapy -Kurt P.T.</em>  </p>  <p>  \t<em style=\"\">I’m approaching 40 and my friends tell me I look better now since I’ve been training with her then I did in my 20’s!! Colette’s one on one program is absolutely addicting!! You have to try this ~ and you won’t find anyone better to train with then Colette! Thank you Colette for everything!! You’ve changed my life!!!” -Lisa</em>  </p>  <p>  \t<strong style=\"\">. . . . . . . . . . . . . . . . . .<br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">EXCELLENT AND INSIGHTFUL!</strong></strong>  </p>  <p>  \t    &quot;Brilliant course! This course would assist anyone, whether beginner or more advanced in their yoga practice. Colette really knows her stuff and is clearly an experienced and insightful teacher. This knowledge also fires up the motivation to practice regularly! I will definitely be recommending this course to my yoga friends and look forward to practicing more (I have added the asanas to my daily yoga practice!)&quot; Regards, Mia Randall, meditation author.  </p>  <p>  \t     Join us for the fun and challenge of using a Theraball with Wall Yoga. Come full circle, while learning how to steady your mind and body with over eleven innovative Theraball/Wall Yoga exercises by Colette Barry.  </p>  <p>  \t     With the buoyancy of ball work and the immovable force of the wall, you can move and balance your body to reach muscles you&#039;ve never thought possible!  </p>  <p>  \t<strong style=\"\">  . . . . . . . . . .</strong>  </p>  <p>  \t    Besides developing good overall muscle tone for your entire body, the ball provides numerous other benefits that range anywhere from rehabilitating back, hip, and knee injuries, to delivering a powerful workout to improve core stability, posture, and muscle balance. You also improve your flexibility and your cardiovascular system by using a low-impact workout.  </p>  <p>  \t    Following are a few of the most important benefits for anyone wanting to use the ball and wall work and get a little background on what exactly you&#039;re supposed to be working.  </p>  <p>  \t<strong style=\"\">  . . . . . . . . . . . . .</strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\"> BACK AND SPINE HEALTH</strong></strong>  </p>  <p>  \t    The ball is great if you have back problems because it supports your lower back as you exercise and stretch. And that&#039;s exactly why physical therapists and chiropractors started using the ball for therapy. So many people suffer from back strain and injuries these days, that thinking of anyone you know who hasn&#039;t is a challenge. What other object can you think of that you can simply lay your body over and feel instant relief?  </p>  <p>  \t<strong style=\"\"> CORE STABILITY</strong>  </p>  <p>  \t    With so much talk these days about working your &quot;core&quot;, you may be wondering what your core actually is. Well, the core is the muscles in your body that stabilize and support all your movements. Your core, or what people used to call your &quot;midsection&quot;, is made up of the deep abdominal and back muscles that work as stabilizers for your entire body. These muscles are the &quot;deep&quot; muscles because, although you cannot see them, they maintain the core stability in your body.  </p>  <p>  \t    Training on the ball is one way to work this group of hard-to-reach muscles. Just by sitting on the ball, you&#039;re able to activate the stabilizer muscles and not only improve your posture, but you also feel more in-touch with your center of gravity. This is just one of the many benefits you get from adding exercise balls to your fitness program.  </p>  <p>  \t  . . . . . . . . . . <br style=\"\">  \t <br style=\"\">  \t <strong style=\"\">SCROLL BELOW TO READ MY BIO.</strong>  </p>  <p>  \t <a href=\"https://www.facebook.com/YogaTrends\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Facebook</a> I<a href=\"https://twitter.com/Yoga_Trends\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\"> Twitter </a>I <a href=\"http://www.linkedin.com/profile/view?id=12412275&amp;trk=nav_responsive_tab_profile_pic\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">in</a> I <a href=\"https://plus.google.com/115557081514735774286/posts\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Google +</a>  </p>  <p>  \t <a href=\"https://www.udemy.com/barry-method-yoga/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Barry Method on a Gravity System</a> I<a href=\"https://www.udemy.com/wall-yoga-the-best-thera-ball-workout/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\"> Wall Yoga the Best Theraball Workout</a> I <a href=\"https://www.udemy.com/wall-yoga-the-three-dimensional-yoga/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Wall Yoga the Three Dimensional Workout</a> I <a href=\"https://www.udemy.com/wall-yoga-ultra-butt-and-legs-workout/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Wall Yoga Ultra Butt and Leg Workout</a> I <a href=\"https://www.udemy.com/wall-yoga-binding-poses-for-beauty-and-strength/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Wall Yoga Binding Poses for Beauty and Strength</a> I <a href=\"https://www.udemy.com/barry-method-the-perfect-workout-package/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Barry Method the Perfect Workout Package</a> I <a href=\"https://www.udemy.com/wall-yoga-weights-chair-and-props-workout/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Wall Yoga Weights, Chairs and Props Workout</a>  </p>  <p>  \t    A disclaimer: If you are ill, injured or have a medical condition, please seek professional medical advice before beginning any of the practices outlined herein. The instructor disclaims any liability for any injury occurring in the practice of the program<strong style=\"\">.</strong>  </p>  <p>  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p>  \t<em style=\"\">All rights reserved by Yoga Trends</em>  </p>", 
    "end_date": null, 
    "title": "How to Toughen and Tone Your Body with My Thera Ball Tricks!", 
    "price": "20.00", 
    "instructors": "COLETTE BARRY", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/100292_9e53_12.jpg", 
    "course_url": "https://www.udemy.com/wall-yoga-the-best-thera-ball-workout/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-02T01:44:54Z"
}