{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t <strong style=\"\">INTRODUCTORY PRICE $89.   GOOD FOR A LIMITED TIME</strong>  </p>  <p>  \t <em style=\"\">&quot;I like the way Colette breaks down exactly step-by-step the results we are looking for in every movement and which muscles we are stretching and why because it helps me do the exercise correctly and benefit from the workout instead of just going through the motions.&quot; -Sue</em>  </p>  <p>  \t <em style=\"\">&quot;It amazes me that after one hour of the Barry -Method class I felt better than I have in years, and I feel this is going to be more effective than any other therapy I have been through in rehabilitating my back and core strength. I look forward to my next session this week! Most Effective Therapy&quot; -Kurt P.T.</em>  </p>  <p>  \t <em style=\"\">&quot;I’m approaching 40 and my friends tell me I look better now since I’ve been training with her then I did in my 20’s!! Colette’s one on one program is absolutely addicting!! You have to try this ~ and you won’t find anyone better to train with then Colette! Thank you Colette for everything!! You&#039;ve changed my life!!!” -Lisa</em>  </p>  <p>  \t <strong style=\"\">. . . . . . . . . . . . . . . . . .<br style=\"\">  \t </strong>  </p>  <p>  \t <strong style=\"\"><strong style=\"\">THIS IS AN EXTREMELY RATIONAL WAY TO APPROACH YOGA!</strong></strong>  </p>  <p>  \t <strong style=\"\">  &quot;Wall Yoga, the body awareness, stability, and leverage of the body achieved by utilizing perpendicular planes allows the postures and breathing to be optimized. Based on my understanding of physics and physiology, this is an extremely rational way to approach yoga. Plus, Colette is so encouraging! You work with the client until they get it right and you are very patient.&quot;- Dr. Casparian</strong>  </p>  <p>  \t       Are you yearning for a new experience in your yoga and fitness practice that would challenge you to a new level of control and physical strength?  </p>  <p>  \t       Wall Yoga is the &quot;Three Dimensional Yoga&quot; that is guaranteed to give you the body and stamina you&#039;ve been seeking.  </p>  <p>  \t <strong style=\"\">EXPERIENCE</strong><strong style=\"\"> THE &quot;GROUNDING RADIATING EFFECT&quot; WITH THE WALL!</strong>  </p>  <p>  \t       Experience the Tri-Fold effect of the wall and ground pressing inward, as your natural energy presses outward, shifting bones and tissue into perfect alignment! .  </p>  <p>  \t <strong style=\"\"><strong style=\"\">PERFECT ALIGNMENT PRODUCES PERFECT RESULTS!</strong></strong>  </p>  <p>  \t       Learn from fitness experts Colette and Dr. Phil Barry who have 20+ years of experience owning and operating a rehab and fitness facility in Cleveland, Ohio.  </p>  <p>  \t       Join now and view our eight favorite tried-and-true &quot;Wall Yoga&quot; routines that will plant your feet (and body) on the right path to wellness and radiant energy! .  </p>  <p>  \t <strong style=\"\"><strong style=\"\">IN THIS PROGRAM -</strong></strong>  </p>  <ul style=\"\">  \t <strong style=\"\">  \t<li>Watch Dr. Phil and Colette explain the&quot;Aging Culprits&quot;that can bind your body and steal your youth. Learn how you can prevent this!</li>  \t<li>Learn Colette&#039;s quick and easy &quot;5 Anchor Points&quot; to lock your body in perfect alignment and receive the maximum benefit every time you step on your yoga mat!</li>  \t<li>In less than one hour, you will learn fitness techniques that will last you a lifetime!</li>  \t</strong>  </ul>  <p>  \t <strong style=\"\">  .</strong>  </p>  <p>  \t <strong style=\"\"><strong style=\"\">EXCELLENT AND INSIGHTFUL!</strong></strong>  </p>  <p>  \t       &quot;Brilliant course! This course would assist anyone, whether beginner or more advanced in their yoga practice. Colette really knows her stuff and is clearly an experienced and insightful teacher. I found learning about the ‘three culprits to aging’ fascinating - the importance of a flexible spine in keeping your body young is explained in a wonderful way! This knowledge also fires up the motivation to practice regularly! Colette’s Wall Yoga helps to get mobility back into the thoracic spine region (very important to help combat aging) – it also helps to align the body correctly from the feet to the head. I do a lot of office work and have been doing the Wall Yoga Side Stretch and Wall Yoga Chaturanga at several points throughout the work day to release my back from sitting at the computer! I would advise any other office-based workers to try this, as it really helps. I have also tried to stand up a bit more throughout the day, as I didn’t realize that sitting down a lot is not good for the back (thank you also to Dr. Phil Barry who Colette interviews in this course!). I will definitely be recommending this course to my yoga friends and look forward to practicing more (I have added the Asanas to my daily yoga practice!).&quot;  -Regards, Mia Randall, meditation author  </p>  <p>  \t <strong style=\"\">UTILIZING PROPER ALIGNMENT - PHYSICAL THERAPIST</strong>  </p>  <p>  \t       This is truly a 3 dimensional body stretching and strengthening program that teaches and utilizes proper muscle alignment and control. it is user friendly, easy to follow and you can easily do this in the comfort of your home at any time of the day. As a physical therapist, I particularly liked the method of teaching that reviews the important parts our body that are culprits leading to potentially sore or painful areas of our body that over time will cause us difficulties if not properly addressed by a type of overall body program as this one. This program utilizes both verbal and visual demonstration as well as some modifications as necessary. - Valerie, Physical Therapist  </p>  <p>  \t <strong style=\"\">  .</strong>  </p>  <p>  \t <strong style=\"\"><strong style=\"\">WALL YOGA - BETTER RESULTS. FASTER</strong>.<br style=\"\">  \t </strong>  </p>  <p>  \t     . . . . . . . . . . <br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">SCROLL BELOW TO READ MY BIO.</strong>  </p>  <p>  \t<a href=\"https://www.facebook.com/YogaTrends\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Facebook</a> I<a href=\"https://twitter.com/Yoga_Trends\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"> Twitter </a>I <a href=\"http://www.linkedin.com/profile/view?id=12412275&amp;trk=nav_responsive_tab_profile_pic\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">in</a> I <a href=\"https://plus.google.com/115557081514735774286/posts\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Google +</a>  </p>  <p>  \t<a href=\"https://www.udemy.com/barry-method-yoga/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Barry Method on a Gravity System</a> I<a href=\"https://www.udemy.com/wall-yoga-the-best-thera-ball-workout/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"> Wall Yoga the Best Theraball Workout</a> I <a href=\"https://www.udemy.com/wall-yoga-the-three-dimensional-yoga/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Wall Yoga the Three Dimensional Workout</a> I <a href=\"https://www.udemy.com/wall-yoga-ultra-butt-and-legs-workout/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Wall Yoga Ultra Butt and Leg Workout</a> I <a href=\"https://www.udemy.com/wall-yoga-binding-poses-for-beauty-and-strength/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Wall Yoga Binding Poses for Beauty and Strength</a> I <a href=\"https://www.udemy.com/barry-method-the-perfect-workout-package/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Barry Method the Perfect Workout Package</a> I <a href=\"https://www.udemy.com/wall-yoga-weights-chair-and-props-workout/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Wall Yoga Weights, Chairs and Props Workout</a>  </p>  <p>  \t       A disclaimer: If you are ill, injured or have a medical condition, please seek professional medical advice before beginning any of the practices outlined herein. The instructor disclaims any liability for any injury occurring in the practice of the program.  </p>  <p>  \t <em style=\"\">All rights reserved by Yoga Trends</em>  </p>", 
    "end_date": null, 
    "title": "How to Get a Lean, Strong Body - Fast! Effective and Simple!", 
    "price": "20.00", 
    "instructors": "COLETTE BARRY", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/83866_4f18_19.jpg", 
    "course_url": "https://www.udemy.com/wall-yoga-the-three-dimensional-yoga/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-26T07:47:07Z"
}