{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Have you been curious about starting a home yoga practice?</p>\n\n<p>Do you love yoga...but find it hard to practice at home on your own?<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>It can be challenging to begin - and sustain - a home yoga practice.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">In this practical, down-to-earth course, we will look at ways to set up a home yoga practice that anyone can follow.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">By the end of this course, you will know exactly what to do and be able to enjoy the rich rewards of a home yoga practice.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Please note that this is not a \"how to do yoga\" course - but rather, a \"how to start a home yoga practice\" course.</strong> You will have access to a downloadable resource filled with yoga poses as well as numerous other resources to get your started in your home practice.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>As a certified 500-hour yoga teacher, I've learned the value of a home yoga practice - and know about the fear and uncertainty that arises from getting on the mat at home, alone. Together we'll tackle each question, concern, and fear that may arise and by the end of the course, you'll know exactly what to do in your home practice and, even better, be looking forward to it!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">In this course we will look at:</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Why you should start a home yoga practice</li><li>Yoga classes vs. Home practice</li><li>Challenges to starting a home practice</li><li>The Eight Limbs of Yoga</li><li>Creating a space</li><li>Finding the right time - and length of time - for practice</li><li>Props and Music</li><li>Making a Commitment Statement</li><li>Tuning in to what you need each day in your practice</li><li>Setting an intention</li><li>What to do in your home practice</li><li>What not to do in your home practice</li><li>How to start and end your practice</li><li>Types of yoga poses</li><li>Some ways to approach your practice</li><li>Beyond asana/poses: meditation, pranayama, etc.</li><li>Tips for getting on the mat</li><li>How to evolve and continue your home practice </li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>There will be simple exercises throughout the course that will help you get your practice up and running.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">ABOUT THE INSTRUCTOR:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>* Over 4,000 Udemy students since March 2016!</em></strong></p>\n\n\n\n\n\n\n\n<p>Lauren Lapointe is a certified 500-hour professional Kripalu yoga teacher who also holds certifications in Yin Yoga and Vinyasa Flow Yoga. She is known for her joyful and heart-centered approach to yoga and strongly believes that yoga is available to everyone – all bodies and fitness levels –and is not just a physical practice but a mindful and compassionate way of life. Her classes emphasize the mind/body connection through the breath and encourage self-reflection and acceptance. <br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>“Lauren’s dedication and love of the practice moves and motivates all who take her yoga classes.” Betsy Freeman</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"When Lauren Lapointe introduced me to her gentle but challenging yoga teachings, I knew I had finally found a yoga teacher that understood not only my individual needs and challenges on the mat, but each and every student’s in the class as well.  The gentle but energetic practice Lauren leads us through in class is always stimulating for not only the body but the mind as well.  She reminds us to come back to the breath while we seek our own personal edge throughout the practice.  Under Lauren’s instruction, I can not imagine a day without some form of yoga practice, even if it’s a 2-minute time out to remind myself to come back to the breath while I let my mind still, regroup, and meet life’s daily challenges again. Regardless of where you are in your yoga journey, beginner or life long enthusiast, Lauren will enhance your yoga practice and inspire you over and over again to return to the mat.\" - Nancy Alford-Gill</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"I highly recommend starting any employee retreat or training program with Lauren's yoga session.  The employees were able to completely relax and prepare their minds for the very busy day.  Lauren's voice is soothing and she has the ability to get <u>anyone</u> to a relaxed state of mind.\" - Lesley Hanak, Vice President for Human Resources, Savannah College of Art and Design</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\n“Lauren brings a balance of energy and calm, of yin and yang\nto the mat. Her Yin-Yang Yoga workshop at Dancing Dogs Yoga was an amazing,\ninsightful, and mindful practice. We will invite her back soon!” - Shelley\nLowther, owner Dancing Dogs Yoga, Savannah GA<br></em></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><u>How to sign up:</u></strong><br><strong class=\"redactor-inline-converted\">Simply click the “Take this course” button on the top right-hand side of this page – and come join the fun and the learning!</strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><u>Other benefits:</u></strong></p>\n\n\n\n\n\n<ul><li>This course is available <strong class=\"redactor-inline-converted\">on-demand </strong>– which means you can access it anytime.</li><li>This course <strong class=\"redactor-inline-converted\">100% refundable</strong> for the first thirty days if for some reason you are not satisfied (and please let me know if you aren't - I am always open to feedback.)</li><li>You will have the opportunity to <strong class=\"redactor-inline-converted\">ask the instructor questions</strong> anytime! I love to interact with you so please let me know if you have any questions at all.</li></ul>", 
    "end_date": null, 
    "title": "How to Start a Home Yoga Practice", 
    "price": "20.00", 
    "instructors": "Lauren Lapointe", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/787948_b494_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-home-yoga-practice/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T00:44:29Z"
}