{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>For the last 2 years, Holland America Cruise Lines has invited Sui Huang to be their Guest Tai Chi Instructor to teach Tai Chi (a/k/a Taiji in China) and Qi Gong to their passengers on their Grand Cruises lasting several months at a time.</p><p>She found that the “Easy Taiji” worked as well for most all of the passengers who had no previous experience as did her regular students. It is the same course now being offered at Udemy.</p><p>Compared to other forms of fitness workouts, Tai Chi is one of the gentler ones you will find. The easy, slow, flowing movements enable people to enjoy its benefits well into their golden years.</p><p>Tai Chi is essentially a slow form of a Chinese Martial Art practiced by millions of people around the world because it has been shown to be helpful for many of the ailments that can affect your body. </p><p>In China, it is believed that Tai Chi can delay aging and prolong life, increase flexibility, strengthen muscles and tendons, and aid in the treatment of heart disease, high blood pressure, arthritis, Alzheimer’s, dementia, depression, and many other illnesses.</p><p>Tai Chi is often described as “meditation in motion,” but it might as well be called “medication in motion.” This mind-body practice can help treat or prevent many age-related health problems. And, it may be the perfect activity for the rest of your life. </p><p>With Tai Chi, not only do you learn a new skill, but it has been scientifically proven that some of the movements have been shown to benefit people suffering from Arthritis. \nEven if you don't have Arthritis, the moves are good exercise and will increase your fitness.<br></p><p>You can get started with Tai Chi even if you aren’t in top shape. This gentle form of exercise is slow and doesn’t leave you breathless, yet it addresses the key components of fitness—muscle strength, flexibility, balance, and, to a lesser degree, aerobic conditioning.</p><p>Since everyone’s body functions a bit different, her method of teaching involves showing you the moves as they “should be” performed, however, you are encouraged to do the moves in the most comfortable way your body moves and will allow.</p><p>In the course you will learn the following: some of the fundamental moves of the Yang style, how to do the Tai Chi walk, correct breathing and moving procedures, the names of each move, and also learn a little Chinese in the process.</p><p>Sui is here to help you enjoy a centuries old Chinese tradition of maintaining your health…..fitness….. and flexibility. So don’t delay in achieving your goals! Get started learning now….. the Easy way! </p><p>Sign up Today!</p>", 
    "end_date": null, 
    "title": "Introductory Tai Chi: Learn the \"Easy\" way!", 
    "price": "50.00", 
    "instructors": "Sui Huang", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510542_bd12.jpg", 
    "course_url": "https://www.udemy.com/introductory-tai-chi-learn-the-easy-way/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-25T00:59:54Z"
}