{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this super-fun, video-based course you'll learn the basics of Laughter Yoga. The course also gives you access to the very lively Laughter Yoga With Michael Dale Facebook where you can join other participants in the 40-Laughter Yoga Challenge and have an awesome time!</p><p>When you do Laughter Yoga you feel absolutely amazing. The most extraordinary thing of all is that you don't even need a sense of humour! The human body can't tell the difference between real and fake laughter! There's literally nothing stopping you from releasing all your worries and stress and feeling amazing. The answer to all these things and so much more is literally underneath your nose! HA-HA-Ha! </p><p>Laughter Yoga is also a fantastic abdominal workout. In fact 10-minutes of belly laughing is equivalent to 30-minutes of abdominal exercise! That means no more boring crunches and sit-ups! HA-HA-HA! </p><p>You'll also get access to my crazy-fun Laughter Yoga Facebook Group. It's a closed group for participants only where you can connect with others on the course and complete the 40-Day Laughter Yoga Challenge. </p><p>The Laughter Yoga Challenge is to do 10-minutes (or as close as you can get) of deep belly laughing every day for 40 days. <br>After each laughing session you're invited to invent a new laugh and post a 10-second video of you doing it in the participant only Laughter Yoga With Michael Dale Facebook Group. <br>That's 40, 10-second videos in 40 days! </p><p>Your first video get's you a free copy of the founder of Laughter Yoga, Dr Kataria's book, Laugh For No Reason.<br></p><p>You can also start a laughter chain and nominate people to join it by tagging them. That's when you do a 10-sec laugh video of a particular laugh and people copy it and post their versions!!! SUPER-FUN!!!</p><p>There's also Live Laughter Yoga Hangouts to look fwd to as well and if that wasn't enough you get a free 30-minute laughter session with me as a bonus for signing up.</p><p>What are you waiting for? Give Laughter Yoga a go today! </p><p>What have you got to lose? </p><p>At the very least you'll have a great laugh!</p>", 
    "end_date": null, 
    "title": "Laughter Yoga For Beginners ", 
    "price": "25.00", 
    "instructors": "Michael Dale", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644636_9015_4.jpg", 
    "course_url": "https://www.udemy.com/laughter-yoga-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T11:53:15Z"
}