{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em><strong>+++++++++++</strong></em>\n</p>\n\n<p><strong><em>We one of the top Udemy Instructors in the Personal Development Field. our courses have been taken by over 21,000 happy students from 162  Countries.</em></strong><br></p>\n\n\n\n\n\n\n\n<p><strong><em>We we are actively involved and answer questions within 24h.</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><em><strong>++++++++++</strong></em></p>\n\n\n\n\n\n<p>Become a Certified Laughter Facilitator and lead group sessions that combine laughter exercises and yogic breathing. Laughter programs are a great addition to your coaching, speaking or yoga/wellness practice!<br></p>\n\n\n\n\n\n\n\n<p><strong>What is a Laughter Session?</strong> Laughter sessions challenge you to laugh, intentionally, for 30 minutes. Facilitators lead a group through exercises that bring out a child-like playfulness while breathing, clapping, moving, and, of course, laughing. The structured laughter quickly leads to genuine, and often contagious, laughter. The laughter sessions begin with a brief discussion about the psychology of happiness and the benefits of laughter, followed by breathing exercises, laughter games, and relaxation techniques. Participants leave feeling energized!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Benefits of Laughter: </strong>Laughter has many psychological, emotional, and physical healing benefits, including: lowering blood pressure, releasing stress, boosting the immune system, toning core muscles, natural pain killer, stimulates creativity, productivity, and motivation, exercising your heart and lungs, and elevating mood, dissolves distressing emotions such as anxiousness, anger, or sadness. </p>\n\n\n\n\n\n\n\n\n\n<p>Clinical research has also proven that laughter lowers the level of stress hormones (epinephrine, cortisol, etc) in the blood. This causes a reduction in the feelings of stress. The yogic breathing portion of laughter sessions has additional stress-busting benefits. It is a gentle aerobic exercise that oxygenates the body and blood, which leads to participants feeling energized. Theses are just some of the many benefits of laughter and yogic breathing. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What you will receive:\n\n  </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>A complete blueprint for conducting laughter sessions in schools, nursing homes, corporations, wellness studios or integrate with your current workshops or private sessions\n\n  </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Dozens of laughter and breathing exercises to use to design your customized laughter session or include with your current programs\n\n  </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li> Detailed research, facts and concepts to teach about the psychology of happiness and the benefits of laughter\n\n  </li><li>\n\n Tips for designing your program, engaging your audience, and memorizing your exercises\n\n  </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>\n\nBusiness tips for designing your sessions and determining locations to hold and market them\n\n  </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li> Strategies for implementing laughter sessions in your practice, whether you’re a speaker, coach, counselor, activity director, yoga instructor, teacher or other professional.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Laughter Facilitator Certification", 
    "price": "30.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/852002_c1d4.jpg", 
    "course_url": "https://www.udemy.com/laughter-facilitator-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-17T15:32:26Z"
}