{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Welcome to my course, about finding contentment through sound and movement.</p><p>My name is Hannah with Half Moon Yoga and Art.</p><p>Do you love traveling and learning about new places, people, and artworks?</p><p>Do you look for an opportunity to stretch, strengthen and balance your body while traveling or when you’re too busy to make it to a live yoga course?</p><p>Did you enjoy the movie, The Sound of Music?</p><p>Well, if you’re looking for an interesting, exciting, and new yoga experience, than this course is for you!</p><p>We will be traveling through the city and surrounding areas of Salzburg while imitating poses that relate to what we see and the overarching themes about contentment and sound. </p><p>For example, Maria reminds us to think of our favorite things like “raindrops on roses… [or] wild geese that fly with a moon on their wings” when we are feeling sad.  We will be practicing poses like wild goose and rose as we ponder positivity. </p><p>Further, the hills fill my heart with the sound of music as we also hear bees buzzing, church bells rising with the breeze, cuckoos from the clock, and yodeling from the marionette poses.</p><p>After completing this course, you will be able to:</p><p>•             Demonstrate physical poses that will build strength, flexibility, and balance such as side plank, tree, and triangle</p><p>•             Move consciously with your breath</p><p>•             Practice an attitude of contentment</p><p>•             Feel the calming and energizing effects of sound vibrations</p><p>This Course consists of 4 sections:</p><p>•             written discussion about the topic</p><p>•             video explanations with key ideas to reflect on</p><p>•             breakdown slides of foundation and alignment to keep you safe and activated during a key pose</p><p>•             physical yoga sequence video that includes warm-up, key poses, inversions, cool down, savasana along with musical background and narration.</p><p>I designed this course for individuals who want to have an interesting and fun yoga experience that activates your entire body and mind.</p><p>If you are challenged with being bored in yoga classes or videos by doing the same Sun Salutations or sequence, than this course is for you.</p><p>Thank you for your interest in my course and I look forward to hearing more about your progress through yoga!</p>", 
    "end_date": null, 
    "title": "Lessons from Abroad: Salzburg", 
    "price": "20.00", 
    "instructors": "Hannah Faulkner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/735984_b9fb.jpg", 
    "course_url": "https://www.udemy.com/lessons-from-abroad-salzburg/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-20T20:19:40Z"
}