{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t    This beginner level trauma informed breathing and yoga course is geared specifically for people who are recovering from a traumatic event in their lives.  Using video, audio and PDF&#039;s, this course teaches 2 simple and proven styles of effective breathing practices which improve mood, decrease anxiety and depression, and help practitioners mange Post Traumatic Stress by reconnecting mind, body and soul.  This class teaches simple yoga postures and offers a guided relaxation which help our body to reduce physical tension and emotional suffering.  </p>  <p>  \t    -practice proven simple and mindful breath techniques  </p>  <p>  \t    -experience simple and effective yoga sequences  </p>  <p>  \t    -take time to rest, renew and restore  </p>  <p>  \t    -build trust  </p>  <p>  \t    -gain confidence  </p>  <p>  \t    -improve mood  </p>  <p>  \t    -enhance sleep  </p>  <p>  \t    -develop conscious clarity  </p>  <p>  \t<strong>Proven transformational trauma informed breathing and yoga practices help you recover.</strong>  </p>  <p>  \tHas someone recommended you try yoga?  Do you ever feel overwhelmed with your traumatic story?  Do you ever wish you could just feel more relaxed?  Do you need some “me time”?  This course sets the stage for self compassion, self respect and opens the door for the next level of your personal healing journey to happen.  </p>  <p>  \t    This course was created out of an intention to offer a simple, self compassionate breathing and yoga course which most anyone who is able to get up and down from the floor can do.  This course isn’t too hard, or too long, and is perfect for those newer or curious about trying yoga.  If you are willing to move slow and mindfully and with your breath, and to work with the intuition of healing, this is the place for you.  </p>  <p>  \t    With trauma comes emotional and sometimes physical pain.  This class is unique in that it is targeting the parts of ourselves needing time, space and attention to recover.  </p>  <p>  \t    We all have ups and downs in life, and this course is useful for the times when we need a little extra support. External modes such as abusing food, excessive drinking, dangerous drugs, over-excercising, overspending, or whatever <em>it </em>is will <em>never</em> be enough to sustain our vitality. We all need to practice cultivating peace from someplace deep within our own being.  </p>  <p>  \t    In this class you will spend time exploring breath techniques and you will move consciously with respect for your body.  You will benefit physically and emotionally by taking time to nurture yourself.  At the end of this course you will feel relaxed, centered and will be more mindful. When you take better care of ourselves, we are able to help others from a place of genuine authenticity-and that helps us heal.  </p>", 
    "end_date": null, 
    "title": "Manage Post Traumatic Stress with Yoga for Trauma Survivors", 
    "price": "20.00", 
    "instructors": "Sarah Higgins", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312932_c4fc_3.jpg", 
    "course_url": "https://www.udemy.com/manage-post-traumatic-stress-with-yoga-for-trauma-survivors/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-03T15:55:26Z"
}