{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>You see the OM (AUM) symbol everywhere. You may see the OM symbol on jewelry or clothing. You may even chant OM during yoga class or during yoga meditation.</p><p>But do you really know what OM means and what it represents? </p><p>By the end of this mini-course you will understand: </p><p>* How the sound and symbol of OM originated </p><p>* How to pronounce the sound OM (AUM) </p><p>* What each part of the sound or vibration represents </p><p>* What each part of the OM symbol represents </p><p>* How to use OM as a meditation mantra during your meditation practice</p><p>Tradition (Hindu scriptures) tells us that OM is the primordial sound which caused the creation of the material universe. OM is also sometimes referred to as the sound from which all other sounds (and words) originate. Some even believe that the sound and symbol of OM has some sort of mystical power.</p><p>This course is a combination of talking head classes, presentations and quizzes. Also there are two OM meditation audio files that can be used as background meditation music, yoga music or you can even chant along with the OM chanting in the music.</p><p>Understanding the power of OM will invigorate and enhance your yoga practice, your meditation practice and your life in general. Chanting OM (even silently) has been attributed to experiencing deep relaxation, improved health, and being able to meditate for longer periods of time.</p><p>OM is truly THE universal mantra.</p>", 
    "end_date": null, 
    "title": "OM Meditation: The Sound & Symbol of Yoga and Meditation", 
    "price": "20.00", 
    "instructors": "Greg de Vries", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598310_63f2_2.jpg", 
    "course_url": "https://www.udemy.com/understandingom/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T15:07:38Z"
}