{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Course Description</p>  <p>Are you looking for a fun and interesting way to experience yoga?</p>  <p>If you answered yes, than this course is for you!  </p>  <p>Paris is known as the “City of Light” and the “City of Love.”</p>  <p>You'll learn be introduced to a range of movements and poses, designed to bring you an enormous amount of health and well-being benefits that relate to this fun theme.</p>  <p>We will be learning alignment steps and performing fun poses like Eiffel Tower and Giraffe as we ponder Self-Empathy.  </p>  <p>We will also be symbolically opening our heart through Wild Thing, Wheel, Camel, and Bow Pose.</p>  <p>You will have the chance to take modifications that are best for your level as we ease into each pose.</p>  <p>In this course you will learn ways to love yourself and gain confidence in who you are as we explore the Petal of Yoga Philosophy, Niyama, referring to how we treat ourselves.</p>  <p>We will practice Marichyasana pose as it is resembles of a Henry Moore sculpture in Paris and the concept of Self-Acceptance.  </p>  <p>Johnny Depp states, ““I think everybody’s weird. We should all celebrate our individuality and not be embarrassed or ashamed of it.”</p>  <p>The course is self-paced and offers you flexibility of schedule. Choose to practice at a time and place that suits you, safe in the knowledge that help is always at hand.  Please message me at any time with questions.</p>  <p>Although it has been created for intermediate leveled yoga students, there are options for beginners to take the easier modified version of most poses.</p>  <p>Although some people prefer to practice using a yoga mat, this is not essential. In fact, you need nothing more than a shirt and shorts to get started - whatever you prefer to wear is just fine, just make sure you can move freely and are not restricted.</p>  <p><u>In this course you will be able to</u>:</p>  <ul><li>Realize an inner calm as you learn to become self and body aware</li><li>Practice with confidence, knowing you are fully supported by the course instructor</li><li>Learn about Niyama as one of the Limbs of Yoga Philosophy</li><li>Experience a full range of both classic and fun new poses, asanas, including back bends, forward folds, twists, inversions, strength building, muscles stretching, and balancing poses.</li><li>Move consciously with your breath</li></ul><p>This Course consists of 5 Lectures Including:</p><p><span></span></p><ul><li>Written discussion about the topic</li><li>Video introduction with key ideas to reflect </li><li>Quiz to check for understanding</li><li>Bonus video for another fun and interesting yoga journey</li><li>Breakdowns of foundation and alignment to keep you safe and activated during the key poses</li></ul>          <p><span></span>Physical yoga sequence video that includes warm-up, Sun-Salutations, key poses, inversions, cool down, savasana.</p>    <p>I designed this course for individuals who love to or want to travel to Paris and learn key tips about being happy in your own skin while building strength and flexibility for a balanced body.  </p>  <p>If you are challenged by boring or repetitive yoga sequences than this course is for you!</p>  <p>Thank you for your interest in my course and I look forward to hearing more about your experience.</p>", 
    "end_date": null, 
    "title": "Paris Inspired Love Yourself Yoga", 
    "price": 0, 
    "instructors": "Hannah Faulkner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/773348_de39_2.jpg", 
    "course_url": "https://www.udemy.com/paris-inspired-love-yourself-yoga/", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-24T21:33:24Z"
}