{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This exciting new 12 week <strong>Postnatal Transformation Yoga Program</strong>\n combines the core- and body- strengthening effects of a dynamic-flowing\n Yoga practice with therapeutic techniques to release excess tension and\n open the body as well as the healing power of Yin Yoga. The program is \nespecially designed for the needs of mothers who want to reconnect to \ntheir body and get back in shape after pregnancy and birth giving. \nClassic Yoga Poses and Sequences like Sun Salutations are modified and \nadapted to the postnatal body. \n\n  \n\n</p>\n\n<p>The program consists of 12 Yoga classes with different physical and/or spiritual topics. There are 4 types of classes:\n\n  </p>\n\n\n\n\n\n\n\n<p>1) Flow Sessions (5 classes): These dynamic sessions contain a \nvariety of poses and breathing techniques to help you reconnect to your \ncore and pelvic floor muscles. The sessions build upon each other and \nintensity will increase gradually. \n\n  \n\n</p>\n\n\n\n<p>2) Therapeutic Sessions (3 classes): By using props (belts, blocks, \nballs…) you will learn to release tension from those areas which tend to\n become tight and painful in moms (neck and shoulders, back…) and to \nsupport the healing process. \n\n  </p>\n\n\n\n\n\n\n\n<p>3) Yin Yoga Sessions (2 classes): This very gentle, meditative \npractice targets the fascia (connective tissue) in long-held yoga poses \nand will open up blocks and tensions on a very deep level of both body \nand mind. \n\n  \n\n</p>\n\n\n\n<p>4) Pelvic Floor Muscle Sessions (2 classes): You will learn to get in\n touch with your pelvic floor muscles and to activate them using props \nand muscle-reflex loops to build strength and stability and reduce the \nrisk of involuntary urine leaks, back pain or organ prolapse.\n\n  </p>\n\n\n\n\n\n\n\n<p><strong>BONUS: Yoga-Quickies\n\n  </strong></p>\n\n\n\n<p>·      “Reverse Sun Salutations”: Short flowing sequence for a quick practice (under 15 minutes).\n\n  </p>\n\n\n\n\n\n<p>·      “Short n Sweet”: Complete but short session (under 30 minutes) for busy days \n\n  </p>\n\n\n\n\n\n<p>·      “Baby Meditation”: Mini-Meditation with your Mini-Me</p>\n\n\n\n\n\n", 
    "end_date": null, 
    "title": "Postnatal Transformation Yoga Program - Mastering", 
    "price": "35.00", 
    "instructors": "Ilke Krumholz-Wagner", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/820304_4b65.jpg", 
    "course_url": "https://www.udemy.com/postnatal-transformation-yoga-program-part-3/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-12T21:11:18Z"
}