{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Prenatal Yoga will help you experience your pregnancy more harmoniously, release the  pains you might be experiencing, and prepare you for birth with confidence. It  puts us in touch with our baby through deep breathing and well-being. As we  breathe, so we live!</p><p style=\"\">    </p><p style=\"\">These prenatal yoga classes emphasize on the basic principles of Prenatal Yoga and  prenatal yoga poses. Even if you have never done yoga before, if you are in  your second or third trimester of pregnancy, this course is for you! I provide  step-by-step guidance to help you understand the fundamentals of using yoga to  connect with yourself and your baby and to achieve the following through the  prenatal yoga poses:</p><p style=\"\"><ul style=\"\"><li style=\"\"><span style=\"\">strengthen the legs to better carry your upper body</span><br style=\"\"></li><li style=\"\"><span style=\"\">give flexibility to your perineum</span><br style=\"\"></li><li style=\"\"><span style=\"\">loosen the back pains</span><br style=\"\"></li><li style=\"\"><span style=\"\">help with sciatica</span><br style=\"\"></li><li style=\"\"><span style=\"\">relax the nervous system</span><br style=\"\"></li><li style=\"\"><span style=\"\">strengthen the immune system</span><br style=\"\"></li><li style=\"\"><span style=\"\">help you keep balance as your gravity  center shifts</span><br style=\"\"></li><li style=\"\"><span style=\"\">give you daily tips such as getting up  and lying down</span><br style=\"\"></li><li style=\"\"><span style=\"\">bond with your baby in-utero</span><br style=\"\"></li></ul></p><p style=\"\">And overall, give you strength, help you trust yourself, and guide you  in your ability to be at ease and remind you to breath deeply.</p><div style=\"\">    <p style=\"\"><strong style=\"\">Thank you for your  interest and I hope this course will benefit you greatly during your pregnancy.  </strong></p>    <p style=\"\">Disclaimer:&nbsp; If you are in your  first trimester, you should not take this course. While yoga in  pregnancy is safe, if you have any pain or medical conditions such as vaginal  bleeding, high blood pressure, increased shortness of breath, dizziness or  feeling faint, uterine contractions, chest pain, fluid leaking from your vagina, rapid  heartbeat or difficulty walking, please consult your doctor before taking this  course.</p></div><p style=\"\">                                </p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Prenatal Yoga - Basic Class", 
    "price": "20.00", 
    "instructors": "Tatiana Abbey", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/19910_394a_5.jpg", 
    "course_url": "https://www.udemy.com/prenatal-yoga-basic-class/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-21T22:26:46Z"
}