{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  This course is a guided to tour for finding health, peace, relaxation, and healing in European spas and wellness centers.  </p>  <p>  \t<br style=\"\">  \t  The European sauna is a hidden treasure that many foreign tourists don’t know about, or have wrong impressions of. Many of the best saunas are visited only by locals who know the customs and rituals that maximize their health and well-being.<br style=\"\">  \t<br style=\"\">  \t  In this course, you will travel into these special facilities with an experienced guide - an American who has lived for seven years in Europe and makes weekly visits to the sauna.<br style=\"\">  \t<br style=\"\">  \t  In <strong style=\"\">The Secret Rules of the European Spa and Sauna </strong> you will get the knowledge so that you will be comfortable finding and fitting in to the wellness culture that Europeans (and few others) enjoy.<br style=\"\">  \t<br style=\"\">  \t  When you are in Europe, you will feel confident knowing what is expected of a sauna visitor. You will be able to fully relax and enjoy the hidden sauna and resort culture when traveling across Europe. <br style=\"\">  \t<br style=\"\">  \t  These lessons build upon one another and you will learn how to dress, what to bring, when and where to undress, how to interact with other sauna guests, learn what a Saunameister does, and know how to best enjoy a sauna infusion ceremony.<br style=\"\">  \t<br style=\"\">  \t  You will be able to truly sauna like a local!<br style=\"\">  \t<br style=\"\">  \t  The course features extensive tips and patient guidance through all the steps that may be uncomfortable or even strange to someone who did not grow up in a wellness culture that includes occasional nudity.<br style=\"\">  \t<br style=\"\">  \t  The course includes the 10 golden rules of sauna etiquette that will help you avoid embarrassing situations.<br style=\"\">  \t<br style=\"\">  \t  There is a guided Google Earth video tour of some of the top sauna facilities in Europe. Form elaborate Asian-themed sauna houses to neighborhood spas that only the locals know about.<br style=\"\">  \t<br style=\"\">  \t  You will learn the four phases of a sauna session so that you can achieve the greatest health benefits from a sauna visit.<br style=\"\">  \t<br style=\"\">  \t  The course covers special topics like the Banya, honey and salt infusions and the celebrated Aufguss rituals with aromatics.<br style=\"\">  \t<br style=\"\">  \t  Dig in, you are going to love this course.  </p>", 
    "end_date": null, 
    "title": "Secret Rules of the European Spa and Sauna - Ultimate Guide", 
    "price": "20.00", 
    "instructors": "Chris Chance", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410750_6a2e.jpg", 
    "course_url": "https://www.udemy.com/secret-rules-of-the-european-spa-and-sauna-ultimate-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T10:37:00Z"
}