{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t      New Bonus : A Daily Fitness Tip. Stay updated with the latest techniques for fitness  </p>  <p>  \t      -----------------------------------------------------------------------------------------------------------------  </p>  <p>  \t      Join the  community of <strong>7</strong><strong>00+ delighted</strong> students. Get a life time relief. We call this <strong>Relief Yoga.</strong>Course up-to-date as of 12-10-2015.  </p>  <p>  \t                          Solution to Urban Life Stress by Mind-Body Relaxation is a series of unique methods as <strong>discovered by the guru in the Himalayan caves</strong>. It provides a sneak-peek into how the Yoga routine can transform your body and mind.  </p>  <p>  \t  Modern life has different challenges compared to previous generation. We are prone to spending a considerable amount of time in front OF TV OR COMPUTER, LISTENING TO THEIR IPODS OR PLAYING VIDEO games and as a result, we spend less time on physical activity. Add to that the richer, processed food we eat AND <strong>THE PRESSURE TO PERFORM WELL AND STAY COMPETITIVE</strong>, is it any wonder so many are <strong>STRESSED</strong>. Suffer <strong>INSOMNIAS, EATING DISORDERS, ADHD (Attention Deficit Hyper activity disorder)</strong> and sometimes aggression. But <strong>yoga can solve or help all the problems</strong> seen in the present stage  </p>  <p>  \t  Students who have embraced the course are <strong>CALMER, MORE ALERT, BETTER LISTENERS, MORE CREATIVE,</strong> more <strong>PHYSICALLY FOCUSED WITH STRONGER AND HEALTHIER BODIES</strong>. Inspired to be successful in whatever they choose to do. More able to channel <strong>THEIR SPEED, AGILITY AND STABILITY</strong> which helps improve their performance in not only their professional lives but also in sports such as hockey, football, running, athletics, swimming, dancing, skating etc.  </p>  <p>  \t<strong>1. Increases concentration </strong>  </p>  <p>  \t<strong>2.</strong>Constant practice <strong>decreases the amount of harmful hormones</strong> produced in the body at the time of stress or tension.  </p>  <p>  \t<strong>3.</strong> Practicing proper 'asanas' or a posture helps <strong>reduce back pain</strong> and <strong>other joint pains</strong>.  </p>  <p>  \t<strong>4.</strong> Reduces respiration problems.  </p>  <p>  \t<strong>5.</strong> Helps in <strong></strong><strong>WEIGHT REDUCTION</strong>  </p>  <p>  \t<strong>6.</strong> <strong>Increases the immunity</strong> of the body.  </p>  <p>  \t                 1. <strong>Find a sense of balance</strong> in your life. became an individual who has balanced work and play life, has developed passion and practicality in relationship and responsibility. Loves this life more!  </p>  <p>  \t<strong>7.</strong> <strong>Find the inner peace</strong> , Stop struggling, stop running. Go on with your life, slowly and calmly while rediscovering the real you. Find yourself through meditations. This contributes to inner peace.  </p>  <p>  \t<strong>                8</strong>. <strong>Find peace of mind</strong>.  Solve your own puzzle and clear the mind and make it clutter free. It will fell like you are awashed of worries and uncertainties.  </p>  <p>  \t<strong>                9</strong>. <strong>Find the strength in you</strong>. Through asanas and sessions, you change physically as well. Became more flexible and fit. Know the ways of your body and I appreciate everything about it.  </p>  <p>  \t<strong>               10</strong>. <strong>Establish true relationships</strong>. You are aware that having a fast paced life makes you run and walk away from true human relationships. Everything then becomes only about business. And Yoga will propel you , change your ways, change your life.  </p>  <p>  \t                To make this more interesting and providing a sense of calm and serenity these exercises are performed in collaboration with your breath. The combination leaves you in the <strong>state of meditation, relaxing your mind</strong>. This really <strong>helps you to focus</strong>.  </p>  <ul>  \t<li>Performing this short sequence of exercises before you start your daily routine <strong>keeps your day pleasant</strong>. Helps you enjoy every minute ahead. Let's you focus on your tasks giving you optimal output from your efforts.</li>  \t<li>On the other hand if performed at the end of the day, it helps you to let go of all the stress, lets you <strong>forget the strain on your body and your mind</strong> caused buy the day to day tasks.</li>  </ul>  <p>  \t                                       So join your hands and follow this routine religiously for your own betterment.  </p>  <p>  \t                                      Rise and Shine  </p>", 
    "end_date": null, 
    "title": "Solution to UrbanLife Stress by Mind-Body Relaxation 15 mins", 
    "price": "20.00", 
    "instructors": "Ivan Stanley", 
    "commitment": "26 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/270066_f73b_4.jpg", 
    "course_url": "https://www.udemy.com/life-transforming-yoga/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-28T09:22:39Z"
}