{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em></em><strong><em>How to create a stress free world using yoga, meditation, breathwork and lifestyle techniques</em></strong><em></em>  </p><p>Have you ever felt depleted because you were doing too much for everyone else except yourself? Ever felt disempowered because you've tried all the tools and still feel overwhelmed and let's just say it.....stressed?  <em><strong>I totally feel you. </strong></em> I created an online stress detox course to restore vitality and heal stress from the inside out using yoga, meditation, breathwork and journal exercises.  This course came to be because I was a super-stressed out YOGA TEACHER! I thought relaxation was something I got to feel after I did the work of the yoga class. But one day I realized it didn't have to be that way. The whole class could be relaxing if I chose to <strong>slow down, move with my breath and find ease</strong> in the poses. This not only revolutionized the way I practice yoga but also affected the way I move through life.   When I slow down, remember my breath and find the ease in my day-to-day activities, I experience a deeper enjoyment of life, and paradoxically, I accomplish more. In this course, I offer the tools of yoga and meditation that helped me do less so I could accomplish more.  <em><strong>What you get in this course:</strong></em> </p><ul><li>Valuable information about the science and physical symptoms of stress</li><li>4, 20-minute yoga sets focused on relaxation, joint support, hips and shoulders</li><li>4 meditations targeted to increase calm and mental clarity</li><li>4 breathing exercises to support vitality</li><li>5 lifestyle support exercises to create a stress-free environment</li><li>Journaling prompts that help you identify and cure your own stress</li></ul> This is an experiential course which means that you have to <strong>USE the tools</strong> in order to <strong>experience transformation</strong> in your life. Do the work, get the desired results.  <em><strong>Some extras because...why not?</strong></em>  In addition to this stellar program, you'll receive regular program updates encouraging you along your stress detox as well as unlimited private messaging if any questions or insights arise along your journey. Of course there is a <strong>30-day money back guarantee </strong>if you're not satisfied with the content.   <em><strong>It's really easy to get started. Here's how it works.</strong></em><ul><li>Click the <strong>TAKE THIS COURSE</strong> button.</li><li>If you don't have a Udemy account then you will be asked to create an account after clicking “Take this Course.”</li><li>Once you've created an account, you will be prompted to enter your payment information and then you have <strong>unlimited, lifetime access</strong> to the course including future program and content upgrades!<em><strong></strong><strong></strong><strong></strong></em></li></ul><p><em><strong></strong></em></p><p><em><strong>Once you've invested in the course, and yourself, what then?</strong></em></p> Begin the course by watching the first four lectures located in the first section, working through the accompanying journal exercises. Then, write down personal goals that you would like to receive from the course.  The next four sections are techniques to reduce stress, and I recommend that you practice one technique, fully and completely, per day. <strong>You have to do the exercise to get results.</strong>  Once you get to the final section, set aside a chunk of time for the final journal exercise in which you craft a strategic plan to counteract daily stress.  I look forward to seeing you in my course!<p>~ Robin</p>", 
    "end_date": null, 
    "title": "Stress Detox: Yoga, Meditation, & Breathwork", 
    "price": "25.00", 
    "instructors": "Robin D Bruce", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507142_9568.jpg", 
    "course_url": "https://www.udemy.com/stress-detox-yoga-meditation-breathwork/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T14:01:07Z"
}