{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is a Summary of traditional Yoga Meditation Practices, which explores a 1-page outline of the practices of our Abhyasa Ashram and Himalayan meditation tradition. Your guide in the course is Swami Jnaneshvara Bharati (Swami J for short), along with Swami Ma Tripurashakti Bharati (Ma Tri) who has done the creative design of the course.</p><p>Throughout this course we emphasize the Yoga principles and practices of the ancient sages of meditation and contemplation, particularly as transmitted to us through Swami Rama of the Himalayas, and the long lineage of predecessors. We use the word Yoga in its traditional meaning as a path of liberation or freedom from the bondage of attractions, aversions, and false identities, systematically revealing the eternal, unblemished Center of Consciousness and its Union with the One absolute, Nondual Reality. </p><p>This one page Summary is a brief, yet thorough outline of the central themes of the practices of our ashram and tradition; practices which lead you in the direction of Self-realization or Enlightenment. The course is a practical expansion of that one-page Summary that we have widely used in online meetings, at our ashram in the US, as well as in meditation retreats and classes around the world.</p><p>Our immediate goal is to lead you to directly intuiting your true nature, as a center of pure consciousness, and then allowing the depth and breadth of meditation to naturally come over time.</p><p>Most of the course is video lectures, complemented by several extensive PDF files and audio Resources. The course has four major sections: Self-Observation, Internal Dialogue, Systematic Meditation, and a fourth section on Complementary and Evolving Practices.</p><p>Please approach the course with the view of it being a practical tool for deepening your Meditations, and that this is not a mere intellectual study. We encourage you to expeditiously, yet comfortably move through the course, watch the video portions, and then, once familiar with the principles, come back and reflect on the many attached Resources more deeply. In other words, please remember that while there is a lot of depth here, which can make the process seem to be not easy, there is always an underlying simplicity.</p>", 
    "end_date": null, 
    "title": "Summary of Yoga Meditation Practices", 
    "price": 0, 
    "instructors": "Abhyasa Ashram, Swami Jnaneshvara Bharati, Swami Ma Tripurashakti Bharati", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761704_ea34_7.jpg", 
    "course_url": "https://www.udemy.com/abhyasa-summary/", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T20:04:47Z"
}