{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course, by renowned yoga instructor and spiritual leader, Seane Corn, will guide you to the deeper dimensions of yoga.</p><p>You’ll discover your unique and vast potential, as well as your capacity for connection, empowerment, and consciousness.</p><p>As you progress from a physical to an energetic practice, you’ll use yoga poses to tune into the body-mind connection within.</p><p>In other words, you’ll develop a yoga practice that heals you not only physically, but also emotionally and energetically.</p><p><strong>Align Your Body and Chakras to Create a Strong Mind-Body Connection</strong></p><ul><li>Establish and Deepen a Yoga Practice for Body and Mind</li><li>Unblock the Seven Chakras for Emotional and Energetic Wellness</li><li>Develop a Profound Connection with Your Inner Self</li></ul><p><strong><br>Use Yoga to Encourage Physical, Emotional, and Energetic Healing</strong></p><p>Seane Corn has created this course to help you connect with your physical body before going deeper into your energetic body.</p><p>You’ll begin with foundational lessons in vinyasa flow yoga. As you create a foundation with this ancient practice, you’ll release tension and deepen your mind-body connection.  </p><p>Once you learn to harmonize breathing, movement, and awareness, you’ll release stuck emotions by working with your edges. This will lead to both physical and emotional strength and wellbeing.</p><p>After harnessing the benefits of a physical practice, you’ll use yoga as a gateway to your chakras (seven energy centers in the body) to energetically heal.  </p><p><strong>Contents and Overview</strong></p><p>You’ll begin this course with Seane’s body-mind flow so that you can build yoga poses from the ground up. This will ensure the process will be safe and effective.</p><p>You’ll also master proper breathing with a lesson on ujjayi pranayama before you dive into vinyasa flow yoga and experience an all-levels practice.</p><p>When ready, you’ll move onto lessons on how to further deepen your yoga experience, and you’ll also have the opportunity to move through an advanced practice.</p><p>After you’ve completed the body-mind flow, you can move on to the chakra flow section of the course. At this point, you’ll be ready to go even deeper into the mind-body connection you’ve already established.</p><p>You’ll learn about the chakras, how they absorb and reflect information, and how they impact your health.</p><p>When your seven chakras are blocked, you’ll feel unbalanced and unwell, so you’ll tackle how to open up and balance each chakra for physical and emotional wellness.</p><p>By the time you complete this course, you’ll have a thorough understanding of the connection between the mind and body, as well as the impact that your thoughts have upon your health.</p>You’ll realize that there’s no separation between body and mind, and you’ll know how to heal yourself by witnessing your thoughts, aligning your chakras, and allowing abundance to flow into your life.", 
    "end_date": null, 
    "title": "The Yoga of Awakening by Seane Corn", 
    "price": "50.00", 
    "instructors": "Sounds True, Seane Corn", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/787672_9095_2.jpg", 
    "course_url": "https://www.udemy.com/seane-corn/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-09T19:18:17Z"
}