{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t        Get ready to skyrocket your teaching and success...  </p>  <p style=\"\">  \t        With Sadie Nardini, E-RYT and Tyler McCoy, founder and master instructor of Core Strength Vinyasa Yoga and founders of Core Anatomy.  </p>  <p style=\"\">  \t        ***  </p>  <p style=\"\">  \t<em>It's not the destination that matters most...it's the journey.</em>  </p>  <p style=\"\">  \t        ***  </p>  <p style=\"\">  \t        Did you know that 90 percent of every yoga pose can, and should be aligned BEFORE the student ever gets into the final asana? And 90 percent (or more) of yoga teachers don't do this correctly--or at all.  </p>  <p style=\"\">  \t        Are you leading students through the journey? Or just focusing on aligning the poses themselves? This is a huge misstep that 90% of teachers make which can cost them safety, money, respect and the interest of many more students.  </p>  <p style=\"\">  \t        This can mean the difference between being a good-enough yoga teacher, and a great, sought-after one in your community--and beyond!  </p>  <p style=\"\">  \t        If you don't know about the myofascial meridians, and are still cuing from the outer body only, which, unless you've taken our trainings, you probably are, you are missing a huge chunk of knowledge that you and your students need to progress optimally.  </p>  <p style=\"\">  \t        You won't find the information contained in the Journey Training anywhere else, and yet it is the foundation of any powerful next-generation yoga teacher. This course is drawn from our studies with many different yoga lineages, as well as years of training with the myofascial (muscle-fascia) meridian anatomy from Leslie Kamonoff (bestselling Yoga Anatomy author and yoga movement and breathing educator) and Tom Myers, Anatomy Trains author and anatomist.  </p>  <p style=\"\">  \t        Take it from this teacher-turned-studio owner...because of these trainings!  </p>  <p style=\"\">  \t<strong><em>Dear Sadie, </em></strong>  </p>  <p style=\"\">  \t<em>I know that you are busy. I keep following you on Facebook.  Why shouldn't I?  Do you have any idea how you have changed my life?  4 years ago I was waitressing and teaching 4 classes a week in community centers. I was frustrated, trying to figure out how to take my teaching to the next level.  Found you online started studying with you and BOOM! Now I have a studio that is doing awesome and I even have just started my first 200hr teacher training program in Northern Ontario.  It's crazy.  Who knew this could be me?  YOU DID!!</em>  </p>  <p style=\"\">  \t<em>Just last night I had a group of new people come in and one girl came up after and said, \"That was the most fun I've ever had in a yoga class, and I've taken lots of yoga\". That was AWESOME!!\" She then signed up for a month--actually all four of them did!! I smiled and of course thought, \"Thank you, Sadie!!\"</em>  </p>  <p style=\"\">  \t<strong><em>Joanne, owner, Bend Yoga Studio</em></strong></p>  <p style=\"\">  \t        Did I mention...this training is <em>FUN</em>?  </p>  <p style=\"\">  \t        ***  </p>  <p style=\"\">  \t        The Journey Training is a compliment to, and a progression of, the Rockstar, and Evolution Trainings, in that order. Where the Rockstar is about all the body's muscle meridians and sequences to work them, and the Evolution deals with how to cue the Core Strength Myofascial Meridian in every pose, the Journey Training focuses entirely on the transitions: how to cue them, adds beginner options within most poses, and how to move from pose to pose, and within each pose to get the most powerful outcome and alignment to occur.  </p>  <p style=\"\">  \t        You do not have to take all three, but it is suggested, as this gives you the most rounded understanding of the outer and inner body meridians, how to sequence them, adjust them, cue them in every type of pose, and how to clarify your own Core Message so you're the most dynamic, attractive and authentic teacher you can be.  </p>  <p style=\"\">  \t        Specifically, when you get the The Journey Training, you'll receive:  </p>  <ul>  \t<li><strong>A HUGE RESOURCE:</strong> 20 + hours of clear, professional video shot at Yoga Yoga Westgate in Austin, Texas. You'll feel that you're right there in the room with us and your training community!</li>  \t<li><strong>FREEDOM:</strong> A training you can do at your own pace, at home, whenever you want. There is no time limit to complete it! </li>  \t<li><strong>INSPIRATION:</strong> An incredible amount of new tips, tools and poses for you to try out in the classroom, and watch your students grow along with you!</li>  \t<li><strong>CUEING CLARITY:</strong> A focus on how to instruct yoga poses through the crucial transitions from floor into the pose, and from pose to pose, where 90% of the pose is actually aligned. </li>  \t<li><strong>MORE STUDENTS:</strong> A fresh way of cueing: from the ground up, so that any level of student who is capable of some yoga movement can attend your classes and feel empowered--not left behind. You heard it from Joanne....Now <em>your</em> class sizes can increase too!</li>  \t<li><strong>REAL ANATOMY KNOWLEDGE:</strong> Many trainings teach you what the hamstrings are, or what the quads do in Chair Pose, for example. But what you really need to know is how to use anatomy to move students the best, while avoiding strain, weakness or injury. We've got your next-level, clear and simple anatomy-of-yoga-movement (something that's rarely taught in TTs) all covered in the Journey Training. </li>  \t<li><strong>MORE MONEY:</strong> When you have an area of expertise that most other students and teachers do not, you become more in-demand for your classes, and can now hold more big ticket workshops, retreats, and trainings. This translates to more money in the bank, more freedom for you personally, and more possibilities for you as an instructor to travel, and become known in your community and beyond as the professional that you are. </li>  \t<li><strong>ORIENTATION WHILE TEACHING:</strong> So many teachers are all over the place. \"put your back heel down, reach your arms up, Warrior One. Tuck the tailbone, relax the shoulders, navel to spine, face the hips forward\". Most of these are improper instructions anyway, or don't do anything for the pose but cause more compression. </li>  \t<li>In the Journey Training, we reveal our <strong>Teaching Template</strong>: clear instructions on exactly what to focus on, in what order, to activate the student's body most cleanly, powerfully, safely--and without disorienting them.</li>  \t<li><strong>VARIATIONS FOR BEGINNERS AND UP:</strong> It's always a challenge when you have different levels of students in class. Here you'll find creative adaptations so you can still keep the class flowing, even while you provide variations for your beginners--and the more advanced students too. This is a rare skill, but when you develop it, you'll retain more students for longer, because everyone will have room to grow in your classroom. </li>  \t<li><strong>CREATIVE SEQUENCES:</strong> We provide our signature Core Warmups, Core Strength Sun Salutations, and more fresh Vinyasa flow sequences and poses so you can see how to move students through this new transitional-type instruction in a moving, invigorating, and fun experience for yourself and your class.</li>  \t<li><strong>A CERTIFICATE OF COMPLETION:</strong> When you complete the training, you'll receive a Certificate of Completion that means you can add The Journey Training and that you are Core Strength Vinyasa Yoga-trained to your bio (Full Core Strength Vinyasa Yoga certification is given only after completing Sadie and Tyler's in-person 200 or 300-hour Core Strength Vinyasa Yoga RYT Certification programs through Yoga Alliance).</li>  </ul>  <p style=\"\">  \t       ***</p>  <p style=\"\">  \t       Namaste! We can't wait for you to go on this Journey with us....and with you!  </p>  <p style=\"\">  \t <em>Sadie and Tyler</em>  </p>", 
    "end_date": null, 
    "title": "The Journey Training", 
    "price": "50.00", 
    "instructors": "Sadie Nardini, Tyler McCoy", 
    "commitment": "19 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/99098_1173_5.jpg", 
    "course_url": "https://www.udemy.com/the-journey-training/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-29T14:43:21Z"
}