{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Welcome to <em style=\"\"><strong style=\"\">The Yoga For Dancers System</strong></em>, created for dancers at <em style=\"\">any level</em> in their career who want to become <strong style=\"\">healthier</strong>, <strong style=\"\">less stressed</strong>, and <strong style=\"\">more successful</strong> in their field. This system is a series of warm up routines, cool down routines, guided meditations, full-length yoga classes, and other helpful resources designed specifically for dancers.</p><p><strong style=\"\">The Yoga For Dancers System</strong> is structured as a course, so that you can learn about all the components before you implement them into your dance training and performance schedule. Don&#039;t worry, <em style=\"\">you won&#039;t be required to memorize anything for this course</em>! All the yoga routines, meditations, and classes are meant to be <strong style=\"\">downloaded onto a device</strong> (or multiple devices) of your choice so that you can practice them wherever and <strong style=\"\">whenever works best for you</strong>.</p><p>This system was designed with <strong style=\"\">dancer&#039;s specific needs in mind</strong>, and it is structured to perfectly intertwine into a-day-in-the-life of a dancer. The dancer yogini or yogi will be able to pick and choose what to practice and when depending on their current needs.</p><p><strong style=\"\">The course is structured into 6 sections.</strong> </p><p>1. An Introduction</p><p>2. Warm Ups</p><p>3. Cool Downs</p><p>4. Meditations </p><p>5. Full-Length Classes</p><p>6. Bonus Material</p><p>Each section has an introduction PDF guide that explains in depth what the section is about, why it is important, and how to use it. All movement based yoga lessons are given to you in <strong style=\"\">both video and audio format</strong>, and all guided meditations are provided in audio format. So, if you&#039;re on the go, traveling, etc., then you will be able to keep all the classes and meditations on your phone or iPod so they can come with you too!</p><p>If you are passionate about dance, but you&#039;re always tired and stressed out, then invest in yourself today! <strong style=\"\">Get your mind and body in sync</strong> with one another by implementing a carefully crafted yoga &amp; meditation practice into your life. <strong style=\"\">You</strong> have the power to make your dreams as a dancer come true, and <strong style=\"\">The Yoga For Dancers System</strong> can definitely help you achieve them! Live a <strong style=\"\">happier</strong> and <strong style=\"\">healthier life</strong> with yoga and mediation by joining us in <strong style=\"\">The Yoga For Dancers System</strong>!</p>", 
    "end_date": null, 
    "title": "The Yoga For Dancers System", 
    "price": "20.00", 
    "instructors": "Christina D'Arrigo", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426358_52ff_2.jpg", 
    "course_url": "https://www.udemy.com/yoga-for-dancers/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T22:14:40Z"
}