{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tWhether you want to make a great living in the mind/body field, or create another stream of income for yourself doing anything you love, this simple, mega-effective course is for you!<br>  \t<br>  \tI make six figures a year teaching yoga and wellness, traveling all over the world, and basically designing my own fantastic schedule.<br>  \t<br>  \tYeah....I can't believe it either!<br>  \t<br>  \tWhen most people find this out, they say the same thing:<br>  \t<br>  \t\"I wish I could make that much doing what I love!\"<br>  \t<br>  \tWell, I'm here to tell you how.<br>  \t<br>  \tI didn't start out with anything special, besides a natural interest in helping others. I didn't have money, training, Internet savvy or special favors. I did, however, have a corporate job I hated, and very little energy left over to put toward my dreams.<br>  \t<br>  \tIt took me about 10 years to live into these 10 Steps to Success that I, along with two other world-changing, success-building experts, are about to show you, but allow us to save you a lot of time, and help you get really clear, super effective, and, if you dive into these 10 steps--more financially abundant--from turning your boring work hours into inspiring, fun, and adventurous life's work instead.<br>  \t<br>  \tIt takes very little of your time and can spark a huge shift in how you organize your time and energy, and how you view, and attract money.<br>  \t<br>  \tLet my friends, social media and wellness expert Tyler McCoy and Ava Taylor Founder of YAMA Talent, the first talent agency for mind/body professionals, a key strategist on my team, and a master of message and branding, help you clarify what you were born to offer, and how to make more money doing it as a lifestyle.<br>  \t<br>  \tWe've distilled the secrets, both cutting-edge and ancient, that took us a decade to discover, into a supercharged 10 Step map that you can use to clarify, then live your dreams--and reap the benefits, financial and otherwise, from getting to the core of who you are, and what you're meant to do to express that into the world.<br>  \t<br>  \tIn this course, which gives you hours of targeted video inspiration, and then written homework to put the tools into action in your own way, you'll learn how to:<br>  </p>  <ul>  \t<li>Bust old, limiting fear blocks and sabotaging ideas around success, money and self-worth.</li>  \t<li>Figure out what your life's work needs to be so you're loving the work you do.</li>  \t<li>Craft that knowledge into a specific career path.</li>  \t<li>Find creative ways to Do It Yourself, without delay</li>  \t<li>Design a powerful brand and personal/professional message</li>  \t<li>Provide yourself with passive income streams that pay you--even while you sleep!</li>  \t<li>Empower yourself to direct life into something you're passionate about, instead of remaining stuck.</li>  </ul>  <p>  \t<br>  \t...And so much more.<br>  \t<br>  \tSee our Intro video for more, and I hope you join us for this life-altering information. Your future self will thank you for spending one dinners' worth of cash on it!<br>  \t<br>  \tOurs sure did.<br>  \t<br>  \tSadie, Tyler and Ava.<br>  \t<br>  \tSadie Nardini is one of the most recognized yoga and lifestyle teachers on the planet, catch her on TV show, Rock Your Yoga on nationally syndicated Veria Living TV, or nab her new book, with Random House, the 21-Day Yoga Body - November 2013.  As the Founder of Core Strength Vinyasa Yoga, and a prolific online presence with an audience of over 500,000 on Facebook and millions on YouTube, Sadie is one of the leaders in building a virtual audience.<br>  \t<br>  \tTyler McCoy is an international yoga and lifestyle professional that travels the world sharing his expertise, and is formulating Core Strength Vinyasa Yoga's next incarnation with Sadie. He is a visual artist who specializes in video and photography, and has been instrumental in building Sadie's visual brand. His cutting-edge social media knowledge is in high demand from those seeking an understanding of how to create more passive income.<br>  \t<br>  \tAva Taylor, Founder of YAMA Talent, the world's first management company, consulting firm and booking agency dedicated to nurturing yoga teachers and businesses. An avid yogi and a tenacious, creative entrepreneur with her finger on the pulse of the rapidly expanding yoga industry, she is well connected, and the go-to strategist for top professional yoga teachers, studios and brands looking to be relevant in the yoga marketplace.  Notable clients include:  adidas, Anue, Hanes Hosiery, Lole, Gaiam, Ganesha Performance, MBT Shoes, Minute Maid, Montage Resorts, NESH, Shining Shakti, smartwater, Yoga Journal, Dakrasheta, Dr. Oz, flavorpill, Harper's Bazaar, Hay House, Lionsgate, Martha Stewart's Whole Living, Pregnancy Magazine, My Yoga Online, The New York Times, Random House, Exercise TV, Fit Vid and Veria Living TV as well a dozen influential yoga studios around the country.<br>  \t<br>  \tCommitted to running an ethics based business, her personal mission is to be a catalyst for better living, and to bring the tools of wellness to communities of all kinds. Ms. Taylor has been featured in the New York Times and sits on the Board of Advisors for Veria Living TV, and The Lineage Project which brings mindfulness practices to At Risk youth in NYC.  </p>", 
    "end_date": null, 
    "title": "The Yoga Of Success: 10 Steps To Being Empowered", 
    "price": "30.00", 
    "instructors": "Sadie Nardini, Tyler McCoy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/71460_fb87_8.jpg", 
    "course_url": "https://www.udemy.com/the-yoga-of-success/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-30T03:10:57Z"
}