{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Has life become too serious for you? Do you find yourself going days or weeks without laughing?</p>\r\n<p>I certainly used to. I was in a job I hated and that filled my head with negativity and my body with rigidity.</p>\r\n<p>In 1998 while in Mumbai, India, I read a newspaper article about a group of people that gathered every day in a nearby public park to laugh. It piqued my interest because they shared no jokes and didn&#039;t use any form of comedy. Instead they laughed purely for the sake of feeling good, just because.</p>\r\n<p>I was puzzled but chose not to go and investigate. It would have taken a full one hour, and I was too busy complaining I was too busy. I mean, why would sane adults do this anyway? What was the point? This was ridiculous and they had to be crazy. Anybody can laugh like that. Ha ha ha. Done.</p>\r\n<p>I quickly forgot about it all, and was so convinced I could laugh anytime anywhere that it took me 6 years to realize that I never did.</p>\r\n<p>Eventually my heart took me back to Mumbai and its laughter clubs. I learned to laugh every day as a yogic practice using an exercise regime created by a medical doctor in 1995 called <a href=\"http://www.laughteryogaamerica.com/4fun/body-mind/how-laughter-yoga-and-the-laughter-wellness-program-work-5098.php\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Laughter Yoga</a>. This was a big turning point for me. I discovered how good laughing could make me feel and how easy it was to laugh, even when everything in my life seemed to be going astray. It was so profound that it triggered a cataclysmic reaction in my brain. The mask fell. I stopped being who I thought I should be and started being who I really wanted to be. I learned to always take full responsibility for my actions and how they made me feel. This&nbsp;did not change my life. It still is much better than that. It changed me.</p>\r\n<p>The more I practiced and taught this exercise regime, the more I discovered complementary techniques that help to bring joy into everyday life. I also started to understand the underlying wisdom from both the East and the West that all these techniques pointed to. In time I combined this knowledge into a method that I call <a href=\"http://www.laughteryogaamerica.com/4fun/body-mind/how-laughter-yoga-and-the-laughter-wellness-program-work-5098.php\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Laughter Wellness</a>. It includes the Laughter Yoga approach of simulated laughter exercises, and expands its approach by offering a clear process that is easy to follow, and adding a greater variety of&nbsp;techniques and activities, insights, games, dances, songs and more &ndash; all glued together with lots of laughter.</p>\r\n<h5>What&#039;s in it for you</h5>\r\n<p>This introductory course will introduce to you the founding principles and key techniques of <a href=\"http://www.laughteryogaamerica.com/4fun/body-mind/how-laughter-yoga-and-the-laughter-wellness-program-work-5098.php\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Laughter Yoga and the Laughter Wellness method</a>, and&nbsp;how they can help you as an individual laugh more (we won&#039;t go into how to teach group sessions).</p>\r\n<ol>\r\n<li>It will remind you of the scientifically proven benefits of laughter. These are still best summarized by the quote in&nbsp;King James Bible &quot;<em>A merry heart does good like a medicine, but a broken spirit dries the bones.</em>&quot;&nbsp;(Proverbs 17:22)</li>\r\n<li>It will help you remember how easy it is to laugh, and how good it can make you feel. You will learn&nbsp;many ways and techniques to create and maintain a personal and daily laughter practice.</li>\r\n<li>It will&nbsp;show you how to use laughter as a skillset to maintain a positive attitude even in the face of adversity, and redefine stress as a challenge, not a threat.</li>\r\n<li>It will&nbsp;share valuable insights on how to best use the power of your mind with the actions of your body to add more laughter and joy into your life, as well as become a better version of who you are.</li>\r\n<li>It will&nbsp;share valuable insights on how to achieve a healthy, happy and successful life&nbsp;from the ancient wisdom of Yoga and modern scientific findings from the world of positive psychology.</li>\r\n</ol>\r\n<h5>Course requirements</h5>\r\n<p>No particular equipment, clothing, or physical abilities are required.</p>\r\n<p>What your personal history is doesn&#039;t matter. Who you are now is perfect and most appropriate.</p>\r\n<p>All can practice and benefit, with or without limbs, because this method revolves primarily around the breath and attitude (it&#039;s of course going to be more fun if you have limbs because these allow for more movements.)</p>\r\n<p>All you need is a big smile and the willingness to try something new that only adds and doesn&#039;t take anything away. This is a &quot;<em>yes, and</em>&quot; approach to life, not &quot;<em>yes, but.</em>&quot;</p>\r\n<p>My goal is not to persuade you of anything, but rather to make you conscious of what is available to you.&nbsp;As Zig Ziglar once said, &quot;<em>no man is clever enough to remember everything he knows.</em>&quot; There is always value in being reminded of what&#039;s important.</p>", 
    "end_date": null, 
    "title": "The Yoga Of Laughter: From Stressed Out To Blissed Out!", 
    "price": "20.00", 
    "instructors": "Sebastien Gendry", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17789_c1d8_6.jpg", 
    "course_url": "https://www.udemy.com/laughter/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-15T16:12:04Z"
}