{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">&quot;This one online teacher training course taught me more than my 200 and 500-hour trainings <strong style=\"\">combined</strong>--and for a fraction of the price. Now my class sizes have tripled by using the information that Sadie and Tyler have so brilliantly designed and so generously offered. </em>  </p>  <p style=\"\">  \t<em style=\"\">Run, don&#039;t walk to get this priceless resource for yourself. </em>  </p>  <p style=\"\">  \t<em style=\"\">Yeah. It&#039;s that good!&quot;</em>  </p>  <p style=\"\">  \t~Kim, studio owner, NYC  </p>  <p style=\"\">  \t********  </p>  <p style=\"\">  \tHi there--it&#039;s Sadie &amp; Tyler!  </p>  <p style=\"\">  \tDid you know that, by our professional estimation, around 95% of yoga teachers everywhere are giving instructions that can injure students over time (or in one class), and leaks away half the benefits of EVERY pose they teach? And they don&#039;t even know it!  </p>  <p style=\"\">  \t     After taking this training course...you won&#039;t be one of them.  </p>  <p style=\"\">  \t     And, what&#039;s more, over 90% of any yoga pose should be aligned BEFORE you get into the pose, not after you&#039;re already there. Forget coming into Warrior 2, and then talking about alignment--it&#039;s too late!  </p>  <p style=\"\">  \t    Tyler and I, two anatomy and yoga experts who travel the world teaching students and teachers alike how to ROCK their yoga practice in creative, savvy, next-level and ridiculously effective ways, are here to teach you the crucial new world of internal vs. external yoga cueing and aligning your students properly through the transitions.  </p>  <p style=\"\">  \t    What&#039;s cool is that you can keep what and how you already teach, but now you&#039;ll have a totally transformed turboboost to apply during what used to be thought of as the less important in-between times.  </p>  <p style=\"\">  \t     We now know that the spaces in-between postures are actually the magic key to giving your students 2-3 times the results, safety and power! You MUST know the 7 Core Cues, in order, to be able to ignite the transitions optimally.  </p>  <p style=\"\">  \t     We want you and your students to practice yoga for a lifetime, not until the neck, wrists, shoulders, low back, hips or knees give out--something MOST yoga instruction today is causing--not helping!  </p>  <p style=\"\">  \t     With this incredible training that you won&#039;t find anywhere else, you&#039;re about to join the top level of yoga teachers in the world, who know the latest anatomy, biomechanics and yoga movement language of Core Strength Vinyasa Yoga. This is a style that COMPLIMENTS your existing style, so you don&#039;t have to give it up--we just help you shore it up--to make your style much more effective, dynamic and safe! It&#039;s awesome.  </p>  <p style=\"\">  \t     And yes! If you&#039;re a yoga student wanting to learn how to ensure your yoga practice is giving you all the benefits, with WAY less chance of injury, you will also get a ton out of this training.  </p>  <p style=\"\">  \t     Thousands of teachers count CSV Yoga as their secret--or not so secret--weapon to attract more students, and become one of the most sought-after teachers in their areas and beyond.  </p>  <p style=\"\">  \t     Tyler and I have studied with the great anatomy and yoga masters, and formulated our 7 Core Cues of Core Strength Vinyasa Yoga to help distill decades of complex anatomy knowledge into 7 simple concepts you can use to ROCK your yoga classes, and every pose you teach...every time. This is the latest in our method, and it&#039;s going to blow your mind.  </p>  <p style=\"\">  \t     The 7 Core Cues are based on the understanding of myofascial meridians (the fact that your muscles run in holistic, whole-body lines, not singular muscles as many people think), and unique bone and joint alignment where EVERY student is different, and our standard cueing has to change or we can hurt people, and also the knowledge of Laws of Physics and why we need to use them or our poses get super heavy and joint compressive. Yuck-asana!  </p>  <p style=\"\">  \t     You have not learned this information in your yoga teacher training...or even any you&#039;ve taken with Sadie and/or Tyler here on Udemy, and yet it&#039;s the next-level for any yoga instructor wanting to transform their offerings into the best they can be.  </p>  <p style=\"\">  \t     We&#039;re excited for you to begin!  </p>  <p style=\"\">  \t     Sadie and Tyler.  </p>", 
    "end_date": null, 
    "title": "Total Transformation Yoga Teacher Training: Anatomy & Flow!", 
    "price": "30.00", 
    "instructors": "Sadie Nardini, Tyler McCoy", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/213278_9f3e_4.jpg", 
    "course_url": "https://www.udemy.com/total-transformation/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-08T17:24:28Z"
}