{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t   Nuestro organismo presenta una variedad de recursos para desarrollar los distintos aspectos de la vida, siendo uno de los mas fundamentales hoy nuestro aspecto mental y su fortaleza. Una de las principales consecuencias de ello pasa por la relación que vamos sosteniendo con el cuerpo y su naturaleza mas orgánica en relación al estrés que va tomando progresivamente un mayor lugar como indice de enfermedades y origen de otras afecciones sicosomáticas que impiden desplegar esa relación en su máximo potencial y va mermando nuestras capacidades de relacionarnos de manera armónica con nuestra faceta productiva, en nuestras relaciones, con nuestras familias y parejas.  </p>  <p style=\"\">  \t   En este curso podrás aprender técnicas precisas para administrar esa relación, adquiriendo herramientas sutiles y sencillas que fundadas en la respiración conciente, te darán autonomía para resolver el problema del estrés, administrar de manera óptima tus energías y responder en cada frente de la vida con oportunidad y eficacia, fluyendo con sus estímulos y dandole espacio a tu creatividad y buena salud. Todo, a partir de un proceso de oxigenacion profunda que se entiende desde los fundamentos del Yoga como un pilar basal para comprender nuestra relacion con el cuerpo físico y sus necesidades, dejando lo que no nos aporta y adiestrando a la mente para apoyar nuestro crecimiento sin desbordarse ni colapsarnos.  </p>", 
    "end_date": null, 
    "title": "Técnicas de respiración para manejar el estrés de tu cuerpo", 
    "price": "20.00", 
    "instructors": "Eduardo Escalante", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/264656_1968_4.jpg", 
    "course_url": "https://www.udemy.com/tecnicasrespiracion/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-19T16:13:23Z"
}