{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Ich möchte Dich einladen, mich in die inspirierende und spirituelle Atmosphäre Balis zu begleiten. Dieser Kurs führt Dich in die grundlegenden Prinzipien des Vinyasa Flow Yoga ein. Vinyasa Flow Yoga ist ein dynamischer Yoga Stil, der Atmung, Beweglichkeit und Ausdauer miteinander verbindet. Jede Bewegung hat einen Atemzug und somit fließt Du mit Deinem Atem durch die einzelnen Übungen. Der \"Flow\" ist ein Zustand, in dem Atem und Bewegung perfekt zusammenspielen und Dir ein Gefühl von Leichtigkeit, Freude und Energie gibt. Die einzelnen Übungen in diesem Kurs werden getrennt voneinander vorgestellt, damit Du den Übungsablauf verinnerlichen und in Deiner eigenen Geschwindigkeit üben kannst</p>\n\n\n\n<p>Der Kurs besteht aus 65 einzelnen Yoga Übungssequenzen, thematisch geordnet in 10 Kategorien für den einfachen Aufbau Deiner Yoga Stunde. Die einzelnen Sequenzen sind unterschiedlich lang und variieren jeweils im Schwierigkeitsgrad. Somit ist der Kurs für Anfänger als auch Fortgeschrittene bestens geeignet und kann flexibel in den Alltag integriert werden. Wähle je nach Zeit 1-3 Lektionen aus jedem Abschnitt aus und übe jeden Tag neue Yogasequenzen und Abfolgen. Aber auch das regelmäßige Üben einer einzelnen Lektion wird Dich spürbar mit mehr Energie und Kraft versorgen und einen positiven Effekt auf Deine Gesundheit haben.</p>\n\n\n\n<p>Als Yoga Anfänger bietet Dir der Kurs eine Vielzahl an einzelnen Lektionen, um in Deine Yoga Praxis zu starten und die verschiedenen Positionen zu erlernen. Als Fortgeschrittener Yogi kannst Du selbst die Länge und den Schwierigkeitsgrad der Übungssequenzen variieren und somit die Ausführung der einzelnen Übungen perfektionieren. Der Kurs soll Dich dazu ermutigen, auf Dich selbst zu hören und Dir mit meiner Hilfe genau die Yoga Stunde zu erstellen, die Du gerade brauchst. Du bestimmst selbst, was du üben möchtest, wie lange und auch in welcher Intensität.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Vinyasa Flow Yoga für mehr Beweglichkeit und Energie", 
    "price": "35.00", 
    "instructors": "Anna Nothdurft", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/880092_7825_4.jpg", 
    "course_url": "https://www.udemy.com/vinyasa-flow-yoga/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-16T15:24:34Z"
}