{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>REVOLUTIONARY COURSE - ALREADY WITH 500+ WARRIOR YOGA STUDENTS!...</strong></p>\n\n<p><strong>\"Men, It's Time To rise!\"</strong></p>\n\n<p>This is a call to action - For too long, the awesome practice of Yoga has been marketed towards, and therefore dominated by women in the West!</p>\n\n<p>It's great that women are finding the benefits of Yoga, and are getting into their bodies, and into their power, but what about us men?</p>\n\n<p>Don't you feel sometimes just a little tired, disillusioned, and demoralised. That life isn't quite the way you want it to be? Things might even be going well, but you still feel there's something missing. Maybe the women in your life sense your lack of conviction too?   </p>\n\n<p>The Truth is :</p>\n\n<p><strong>Yoga was invented by men, for men, and historically in India has been largely practiced by men, so reclaim your rightful place!</strong></p>\n\n<p><strong>It's only right that Men share at least 50% of the Yoga Community! </strong>After all Yoga is primarily about balance...balance of the masculine and feminine qualities in us all.<strong> </strong></p>\n\n<p><strong></strong>The world needs both men, and women to reap the benefits of Yoga. </p>\n\n<p><strong>You deserve to be really healthy, to  feel good, to attract the perfect partner, and perfect life, and most important of all, to be rooted in an inner confidence</strong>. A state of mind that comes from really knowing yourself, where you're going, and the courage and drive to just go for it!</p>\n\n<p>Yoga, and meditation makes all this possible... <strong></strong></p>\n\n<p><strong>What is Yoga really</strong>? Yoga is NOT really about stretching, and poncing around, looking good in a leotard! It is nothing to do with what you look like externally...</p>\n\n<p><strong>Yoga is abou</strong>t <strong>empowerment</strong> <strong>- it connects us with the deep power within us, our potency</strong>. It is the key to feeling how awesome it is to be a man, and to share your <strong>awesome passion</strong> with the world!</p>\n\n<p><strong>What is a Warrior?</strong> A true warrior is nothing to do with violence!</p>\n\n<p>A warrior is he who has the <strong>passion, strength and determination </strong>to stand up for what he believes in, and make a difference. What do you believe in? We live in a cynical world - a world which the warrior is here to reclaim, in order to bring forth a better way...a new world of equality, where everyone has the opportunity to realise their true potential!</p>\n\n<p>This course highlights a deeper understanding of the <strong>10 Keys to being a True Man, and powerful Kundalini Yoga exercises to ensure you embody them. </strong></p>\n\n<p>I have been practicing Kundalini Yoga for 12 years, and teaching extensively for over 10 years. This makes me one of the<strong> most experienced Kundalini Yogis in the South West of England. </strong>So I know the value of these teachings, and now I want to share them with you, because the world needs more real men, <strong>the world needs more warriors!</strong></p>\n\n<p><strong>Prepare to become a Warrior! This is what you will reclaim...</strong> </p>\n\n<ol><strong></strong><li><strong>Maturity </strong>- To be a real man, in a world of 'boys' pretending to be men, we must move beyond immaturity, from reactivity to responsibility.</li><li><strong>Purpose </strong>- Find your life's purpose, your mission, and you move from confusion to  meaning, and this strike's contentment deep into the heart of every man.<strong></strong></li><li><strong>Drive </strong>- In a world of continuous bombardment of information, and entertainment, we must learn to move beyond distraction to unprecedented direction and focus.<strong></strong></li><li><strong>Passion</strong> - Fuel your inner fire and keep it burning, in order to feel alive!</li><li><strong>Potency </strong>- Channel and redirect your sexual energy (testosterone) and actually use that same energy that fuels lust to fuel your creative projects and endeavours! </li><li><strong>Courage</strong> - To be a Warrior, you must be brave enough to meet life's challenges, in fact you must learn to welcome them in, to love them, for a man is living most authentically, when he is on the edge!<strong></strong></li><li><strong>Success </strong>- Live an abundant life, and find your freedom, for this is no end to the dreams you can, and will manifest once you do these practices, and implement this way of thinking into your life. We create our own reality, when we hold true to our mission, and believe in our unique abilities.<strong></strong></li><li><strong>Authenticity</strong> - Reclaim your honour, in a world that has diminished the integrity of honesty, and respect - stand tall, and be a virtuous knight for the new age upon us, which we can now choose to co-create.</li><strong></strong><li><strong>Presence </strong>- When you get this down, you become a master of attraction and clear communication, this will make you a beacon for women to be drawn to you, and ensure you power in your business as well. <strong></strong></li><li><strong>Mastery </strong>- The ultimate goal - Learn to master your mind, and the world falls at your feet, for you have achieved true Wisdom, a rare thing indeed, and yet it is absolutely within your reach. </li></ol>\n\n<p><strong>It comes down to one question...\"How Alive Are You?\"....\"Men It's Time To Rise!\"</strong></p>\n\n<p><strong>BE A MAN AND ENROLL NOW TO BECOME THE WARRIOR YOGI THE WORLD NEEDS!</strong></p>\n\n<p><strong>Women </strong>- If you are reading this, perhaps you are already thinking you would like to enroll your partner into this course. If you know the benefits that Yoga brings you, but your partner is not interested, then this course can be a bridge to bring him into sharing your passion, and in the process making him realise more of his potential. Don't you wish, sometimes, your partner was 'more of a man'? This course will be bring out the greatness in him. Enroll your partner and see your relationship flourish!</p>\n\n<p>*** <strong>Women</strong> – This course is designed for men, but if you identify with the masculine, or if you feel you need to, in order to balance out your strong feminine nature, then the choice to enroll yourself, is of course, yours. Prepare to be more purpose driven, focused, and achieve a sharp clarity of mind. In fact you might so strong and clear, that you will wonder why you ever got confused, conflicted or contrary. ***<strong></strong></p>\n\n<p>“Whatever you are physically...male or female, strong or weak, ill or healthy--all those things matter less than what your heart contains. If you have the soul of a warrior, you are a warrior. All those other things, they are the glass that contains the lamp, but <em>you</em> are the light inside.\"  ― Cassandra Clare,  <em> Clockwork Angel </em> </p>\n\n<p><strong>30 Day Money Back Guarantee</strong></p>\n\n<p><strong>Created June 2015 - Updated October 2015</strong><strong></strong></p>", 
    "end_date": null, 
    "title": "Warrior Yoga For Men: 10 Keys To Health, Wealth and Success", 
    "price": "25.00", 
    "instructors": "Mark Keane", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472166_630f.jpg", 
    "course_url": "https://www.udemy.com/warrioryoga/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T19:47:25Z"
}