{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<strong>Attention weightlifters and athletes…</strong><p>Do you have any nagging aches and pains in your body after a day of lifting? </p><p>You know… the ones you get from repeating the same movements over and over. Lifting patterns that leave you sore. If you want your training to be sustainable in the long run, cross training with yoga is a must.</p><p>Lifters tend to deal with muscle soreness in a few areas of the body: the chest, shoulders, hips, hamstrings, quads, and calves. How would it feel to finally have an option that allows your body to recover and get your muscles primed for another day of activity and lifting? … That <em>reduces</em> the muscle aches and relaxes your entire body?</p><p>Yoga for Weightlifters was designed with these things in mind. Not only will it help you become a better lifter by strengthening these muscle areas, it can also help you:</p><ul><li>Improve your posture and joint health…</li> <li>Eliminate aches and pains from heavy lifting and repeated muscle use…</li> <li>Increase flexibility quickly…</li> <li>Firm, tone and lengthen your muscles…</li> <li>And, feel more relaxed and limber.</li></ul><p>Start your day off right with one of the best “medicines” you'll find by integrating even just <strong>20 minutes</strong> every day. You'll feel more energized, calm, and at peace.</p><p><strong>Here's What a Few Students Have to Say… ------------------------------------------------------------------------------------------------------------------------------------------</strong> “Great flows for recovery and getting the muscles ready for the next day. Reduces muscle ache from squats/pulls and the classics.” <em>-- Graeme Baird</em><strong></strong></p><p>“It's easy to spend all of our time trying to lift more and more, without taking the time to make sure our body is in the right condition to keep doing so. Working on mobility is such an important aspect that is often over looked. This is a great way to make sure we can keep lifting to the best of our abilities! As I tend to go to the gym in the morning, this is a nice way to wind down in the evenings and set me up for the next day.” <em>-- Richard Hart</em><strong> </strong>---------------------------------------------------------------------------------------------------------------------</p><p><strong>This Course Includes 4 Easy Classes:</strong></p><ul><li><strong>Beginner Vinyasa Flow: </strong>In this 30 minute class you'll stretch and strengthen the key areas of your body required for proper form and alignment in weightlifting. It will help “open up” the tight areas of your body including the chest, shoulders and hips.<strong></strong></li> <li><strong>Intermediate Vinyasa Flow: </strong>Kick it up a notch with a 35 minute class that will strengthen your core while reaching deeper into your hips and hamstrings to cultivate strength. You'll also develop your balance which will allow you to develop proper alignment throughout your body.<strong></strong></li> <li><strong>Stretch &amp; Relax: </strong>This class winds you down and helps target the deep connective tissue that will <em>permanently </em>increase your flexibility. That means in the gym, you will have increased range of motion and relief from the aches, pains and tightness. And improved joint health.<strong> </strong>What's more, it will enable your body to “let go” … and provide full restoration to all the stress and anxiety that gets built up every day in your life.<strong></strong></li> <li><strong>Post-Workout Practice: </strong>And finally… if you'd like a <strong>quick 15 minute</strong> post-workout class to “prevent” muscle soreness… you have that option here. It's the perfect way to unwind your body after it takes a “beating” from pumping all that heavy iron. <strong></strong></li></ul><p>This course is designed for <em>all levels </em>including beginners, intermediate and advanced yoga practitioners. Kassandra will walk you step-by-step through each of the poses. Her detailed instructions allow you to follow along without having to keep your eyes glued to the screen. You can practice at your own pace in the <em>comfort of your home</em>, and you'll get the feeling of being in the studio. It won't feel like you're “missing out” on anything. You'll also find it's<em> more time and cost effective</em> than a regular class<em>.</em></p><p><strong>Downloadable Content and 2 Free Bonuses Included</strong></p><p>Each video lesson is downloadable so you can put them on your tablet or smart phone. Watch them anywhere! What's more, you'll also receive <strong>FREE</strong> <strong>BONUS #1: </strong>“Yoga at Home – 100 Yoga Poses”. In this eBook you'll see illustrated pictures of Kassandra's favorite 100 yoga poses with complete instructions. <strong>FREE BONUS #2 includes: </strong>An extra Yoga for Weightlifters video not originally included with the other classes.</p><p>Included is a <strong>Money-Back Satisfaction Guarantee</strong>. If for ANY reason you aren't satisfied within 30 days, we'll happily refund every penny. In fact, go ahead and TRY the course out right now. See for yourself. If it's not everything and more… get your money back promptly.</p><p>This course has already impacted many people. You don't have to be flexible or strong to receive the benefits of yoga. As long as you're willing to give it a chance and practice consistently… your life <em>will</em> change. Don't you owe it to yourself to feel completely stress-free and relaxed after a day of heavy lifting?</p><p><strong>Please consult with your physician before beginning any exercise program. By participating in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself, and agree to release and discharge Yoga with Kassandra from any and all claims or causes of action, known or unknown, arising out of Yoga with Kassandra's negligence.</strong><strong></strong></p>", 
    "end_date": null, 
    "title": "Yoga for Weightlifting, Powerlifting & Body Building", 
    "price": "25.00", 
    "instructors": "Yoga Instructor Kassandra Reinhardt", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402356_5a41_5.jpg", 
    "course_url": "https://www.udemy.com/yoga-for-weightlifters/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-23T17:19:49Z"
}