{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong></strong><strong>\"Gib jedem Tag die Chance, der beste deines Lebens zu werden.\" Mark Twain</strong></p><p>Mit diesen Online Yogastunden nehmen wir Dich mit auf eine einzigartige Yoga Reise nach Indien. <strong>Im traumhaften Indien haben wir</strong> <strong>acht abgestimmte Kurzprogramme a' 30 Minuten</strong> gedreht und für jedes Kurzprogramm haben wir einen Schwerpunkt gesetzt. Die Übungen sind zudem in Übungen für den Morgen (Kraftvoll) und Übungen für den Abend (Entspannend) unterteilt. Du kannst die Einheiten in Deiner eigenen Geschwindigkeit abhandeln und auch die Programme selbst kombinieren, da jedes Kurzprogramm in sich abgeschlossen ist. Wir geben vor jedem Programm eine genaue Anleitung, was Dich im ausgewählten Kurzprogramm erwartet, dass Du der Yoga Sequenz im Detail folgen kannst.</p><p><strong>Die einzelnen Yoga Programme finden in unterschiedlicher Umgebung statt</strong> (z.B. am Strand oder im Gebirge) und Du kannst in mit jeder Sequenz in eine neue Welt eintauchen. Es erwartet Dich authentisches Yoga in einer authentischen Umgebung. So kann man einfach 30 Minuten eine Auszeit nehmen und den Alltag vergessen und eine Sequenz auch nach persönlicher Stimmung auswählen. Die Yoga Übungen werden musikalisch untermalt durch sphärische Klänge einer Caisa Trommel und mit Silvios angenehmer Stimme steht der Entspannung nichts mehr im Wege. Man kann sich sofort in eine andere Welt versetzen. <br></p><p>Für jeden der nach Feierabend richtig entspannen möchte, gibt es am Ende des Kurses auch noch zwei geführte Meditationen. Hier besteht die Möglichkeit auch nur mit Musik zu meditieren.</p>", 
    "end_date": null, 
    "title": "YOGABASICS Yoga für einen perfekten Tag", 
    "price": "25.00", 
    "instructors": "Silvio Fritzsche", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659192_fc64.jpg", 
    "course_url": "https://www.udemy.com/yogabasics-yoga-fuer-einen-perfekten-tag/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T18:15:20Z"
}