{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Course is dedicated to those who want to deepen their practice, as well as gain more knowledge and experience in Asanas and Pranayama. You will experience and learn: </p><ul style=\"\"><li>Breathing control exercises ( Full yogic breath, 3 step breathing and Kapalabhati to cleanse your respiratory system and energy channels) </li><li>Proper warm-up (with sequences including Sun Salutations (Surya Namaskar) + Leg rises + Headstand preparation) </li><li>12 basic Asanas with breath control (to focus on your inner space) Inverted postures (to return venous blood and bring rest to the heart, to provide rich blood supply for the brain, and to strengthen your back muscles) </li><li>Forward and backward bends (to improve digestion, maintain a youthful figure, and rejuvenate spinal nerves) </li><li>Balancing postures (to increase concentration, as well as physical and mental balance) Three levels of relaxation in Savasana , Yoga Nidra Technique</li></ul><p>Course is taught by an internationally certified Sivananda yoga teacher.</p><p>A Russian native, Jenny, has been practicing yoga since her adolescence. Having spent many years in India, she found multiple benefits and a joy of living when she incorporated Yoga into her everyday life. Inspired by the environment and culture, she eventually found herself at the world-renowned Sivananda Yoga Ashram, in Kerala, where she was guided by a skilled guru on her Teachers&#039; Training Course.</p><p>Her guru, Prem Sadasivananda, hails from New York and is a direct disciple of Swami Vishnudevananda. It was he who endowed her with her spiritual name, Vijaya, which means “almighty” or “victory”. Her Asana classes were taught by Sri Mani Raman Chaitanya, the head of the Sivananda Centre in New Dehli.</p><p>After attaining her certification to teach, she established a new trend of Skype Yoga, which allows to teach students worldwide, erasing boundaries of time and distance. She has also stayed on the map conducting multiple workshops and retreats in both Asia and Europe.</p><p>Her students appreciate her gentle style of teaching and encouraging vibe she brings to class.</p>", 
    "end_date": null, 
    "title": "Yoga - Asanas and Pranayama", 
    "price": "20.00", 
    "instructors": "Ilya Terentyev, Jenny Stark", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563488_35c9_4.jpg", 
    "course_url": "https://www.udemy.com/yoga-asanas-and-pranayama/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T08:27:08Z"
}