{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t    New Bonus : A Daily Fitness Tip. Stay updated with the latest techniques for fitness  </p>  <p>  \t    -----------------------------------------------------------------------------------------------------------------  </p>  <p>  \t          Join the community of over <strong>1000 DELIGHTED STUDENTS</strong>. Course up-to-date as of 12-10-2015.  </p>  <p>  \t                -------------------------------------------------------------------------------------------------------------------  </p>  <p>  \t<strong>     This is what our students say :  </strong>  </p>  <p>  \t                 “love the phase, of the teacher explaining about asanas.<strong> worth every cent paid</strong>.\"  </p>  <p>  \t                 - Jaiyaramakrishnan Mahendran  </p>  <p>  \t                 “This course is <strong>very well designed and It has benefited me a lot</strong>. The presentation and explanation about each asan (exercise) is very nice and perfectly explained.\"  </p>  <p>  \t                 - Shweta Sathe  </p>  <p>  \t                ---------------------------------------------------------------------------------------------------------------------  </p>  <p>  \t                        Did you know that on an average we spend about <strong>100$ a month</strong> on our health between the age of 15-35 years on curative medicines and techniques? And gradually <strong>this average starts rising!!</strong>. Though this is not an unnecessary expense, but <strong>What if you could save it ?</strong>Yes this is possible through <strong>20-40 mins of preventive techniques </strong>in technical terms the Asanas, Pranayams etc in Yoga. And the best part is <strong>you do not require any prior knowledge</strong>. In fact it is better if you come with an empty cup. Now do your math and find out how much you have spent till date and how much you can save. Join a community of 1000+ active students. An<em>unconventional</em>course in <strong>Pranayama, Ashtanga Yoga, Iyengar Yoga </strong>and <strong>Acro Yoga</strong>.  </p>  <p>  \t                        This<strong>4 week, go at your own pace course </strong>consists of modules for each day which has exercises for the <strong>Eyes, Neck, Shoulders</strong>and the <strong>Back, Breathing techniques </strong>followed by <strong>Sun Salutations,</strong>or <strong>Surya Namaskar,</strong>and <strong>Shavasana</strong>.  </p>  <p>  \t                        This course is designed to teach you a <strong>routine </strong>that you can follow throughout your life to maintain your body and rid it of toxins and extra weight.  </p>  <p>  \t                        We believe that it takes atleast a month of dedicated effort and sincerity to start and sustain a positive, new habit. This 4 week course is designed such that you see positive changes in your mental and physical well-being .  </p>  <p>  \t                        Through an easy to understand and accessible teaching style,<strong>Guru Ivan Stanley </strong>shares his personal experiences and unique views, demonstrates unorthodox techniques and effective tips that guarantee changes in your mental and physical well-being.  </p>  <p>  \t<strong>BENEFITS </strong><strong></strong>of this course:  </p>  <p>  \t                        ·Positive changes in your mental and physical wellbeing .  </p>  <p>  \t                        ·Improvement in strength, stamina &amp; flexibility.  </p>  <p>  \t                        ·An energetic, healthy mind and body.  </p>  <p>  \t            .Reduce belly fat  </p>  <p>  \t            .Glowing skin  </p>  <p>  \t            .Weight loss  </p>  <p>  \t                        Improvement in confidence in your own physical &amp; mental ability and stamina.  </p>  <p>  \t                        This course can be practiced during the any period of the day with a 3 hour gap after a meal or half hour gap before a meal.  </p>  <p>  \t<strong>What am I going to get from this course?</strong>  </p>  <p>  \t                        ·Over 23 lectures and 16 hours of content!  </p>  <p>  \t                      -<strong>On the start of every week i. e. Day1 you learn new techniques with detailed instructions and then Day 2 -Day 5 you go through repetitions for practice.</strong>  </p>  <p>  \t                        ·20 days workshop featuring fundamentals of Yoga.  </p>  <p>  \t                        ·6 hours of yoga video routines &amp; sequences  </p>  <p>  \t                        Anyone seeking to transform his or her body, mind and health in just 4 weeks. You must be capable of some exercise. Please consult your doctor in case of any health issues.  </p>  <p>  \t                        Through the concept of muscle memory and reviving some of the habits of new born babies, Guru Ivan Stanley shares his personal experiences and unique views, demonstrates unorthodox techniques and effective tips that guarantee positive changes in your mental and physical well-being. Non-practitioners, beginner and advance students are welcome.  </p>", 
    "end_date": null, 
    "title": "Yoga for Beginners: Get Healthier in 4 Weeks ", 
    "price": "20.00", 
    "instructors": "Ivan Stanley", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260870_45ac_4.jpg", 
    "course_url": "https://www.udemy.com/yoga-program-for-mind-body-transformation/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-14T07:20:57Z"
}