{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Welcome to my Course about Alignment and Foundation.</p>  <p>There are many benefits of striving for perfection in your body to enhance your quality of life.</p>  <p>The Asana (physical poses) practice of yoga has 5 Major Alignment Principles:</p>  <ul><li>Foundation (where your body touches the earth)</li><li>Activated Legs (internal rotation of inner thighs)</li><li>Lengthened spine (tailbone in and down or lower belly tucks in)</li><li>Arm strength (exterior rotation upper arms)</li><li>Muscle Energy (core strength)</li></ul>          <p>Vienna is one of the world's most livable cities and it is known for its quality of life.  The name comes from the name Vindobona meaning \"white base/land.\"  This bright base of land is the foundation of one of the most prosperous cities in the world and a model for city planning today.</p>  <p>Alignment is the study of relationship. How everything is connected to everything else.  Similar to the way that the Viennese use their contacts and connections in business, music, art, dancing, and nature to enjoy a well-rounded life.  When we are able to bring our body into alignment and harmony, the fragmentation disappears, integration is achieved, and unity is established.</p>  <p>In this course we will notice symbolism and details throughout this exciting city as we connect these to the details within our body.</p>  <p>We will explore these concepts more through:</p>  <ul><li>a written discussion about the topic</li><li>a video explanation with key ideas to reflect on</li><li>a yoga sequence video that includes music, warm-up, key poses, cool down, and a final resting pose.</li></ul>      <p>Thank you for your interest in my course and I look forward to hearing more about your path to Alignment by joining my yoga journey now.</p>", 
    "end_date": null, 
    "title": "Yoga Lessons From Abroad: Vienna", 
    "price": "20.00", 
    "instructors": "Hannah Faulkner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/720970_33ba.jpg", 
    "course_url": "https://www.udemy.com/yoga-lessons-from-abroad-vienna/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T17:02:56Z"
}