{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t   Yoga is a system of physical and mental disciplines practiced to attain control of body and mind. Such control is attained through a series of postures and breathing exercises.  </p>  <p style=\"\">  \t <em style=\"\"><strong style=\"\">Yoga and Meditation for Everyone</strong></em> is a course designed for beginners and students at intermediate level by <strong style=\"\">Yogacharya U E Warrior</strong>.  The course has been designed to help people of all ages. Towards the end of the lectures a day to day regimen is available as a pdf document for downloading.  </p>  <p style=\"\">  \t   Yogacharya U E Warrior is a trained yoga teacher and has had his basic yoga training under his holiness, Swami Satyananda Saraswati, founder of the Bihar School of Yoga, Monghyr, Bihar. He received yoga <em style=\"\">teacher&#039;s</em> training under the guidance of Yogacharya Dr. N Vijyaraghavan, Director of Satyananda Yoga Research centre, Calicut (Recognized by University Grants Commission) and affiliated to international yoga fellowship movement..  The highly experienced expert has been conducting yoga workshops for years which has helped hundreds to become fit.  </p>  <p style=\"\">  \t   The course has been divided into seven video lectures / demonstrations.  Students are expected to practice along with the lectures. It is suggested that beginners learn two lectures per day.  </p>", 
    "end_date": null, 
    "title": "Yoga & Meditation for Everyone", 
    "price": "20.00", 
    "instructors": "A Ravi Shankar, Yogacharya U E Warrior", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121470_fe29_6.jpg", 
    "course_url": "https://www.udemy.com/yoga-meditation-for-everyone/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-18T04:14:39Z"
}