{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<h5>Dear Yoga Student,</h5>\n<p>\n\t                If you suffer from back or neck pain, or if you constantly struggle with painful backbends in yoga class, then I’d like to tell you about a very unique way you to use targeted yoga practices therapeutically at home to heal your spine.\n</p>\n<p>\n\t                Here’s what’s going on…\n</p>\n<p>\n\t                As a yoga teacher, one of the top reasons people come to class is to heal their injured back or neck. Truth be told, almost all yoga practices are in some way connected to the spine, so it makes sense that yoga has become so popular for back and neck care.\n</p>\n<p>\n\t                Sometimes people have slipped disk or been in an accident, but even more often, people have been working sedentary jobs for years and their spine is weak, stiff, and downright frustrating.\n</p>\n<p>\n\t<strong>Telltale Signs That You’ve Got a Back Problem (or will soon enough):</strong>\n</p>\n<ul>\n\t<li>It’s painful (or impossible) to bend forward</li>\n\t<li>Bend bends are painful (or impossible) even in the most-gentle of yoga poses</li>\n\t<li>You suffer from radiating pain up your back or down into your bum or legs</li>\n\t<li>Your shoulders are hunched forward</li>\n\t<li>Your spine feels locked-up in the lumber (lower back), thoracic (middle back) or cervical spine (neck area)</li>\n</ul>\n<h5>Here’s My Story…</h5>\n<p>In 2007, I severely injured my lower back. Maybe it was stress; maybe it was repetitive motion exercises; maybe I lacked core strength needed to support my spine and was suffering from muscle imbalances.\n</p>\n<p>\n\t                Whatever the causes, it got worse and worse until one day I literally couldn’t get out of bed. Up until then, I’d never missed a day of yoga teaching, but there was no way I could go to work. I was unable to get up form bed or turn my head side to side.\n</p>\n<p>\n\t                More than just painful, it was also humiliating. I had to take a quadruple dose of painkillers just to waddle around the house—and I’m a yoga teacher!\n</p>\n<p>\n\t                I visited a medical doctor and 2 specialized body workers to get some help. The doctor said I’d be better in 5 days which proved to be absolutely NOT true. Both bodyworkers were helpful and did soothing deep tissue work, but ultimately, it didn’t heal my back.\n</p>\n<h5>Here’s What I’ve Learned…</h5>\n<p>\n\t                 When it comes to healing strong, I’ve learned, it’s really up to you to find good help, but to take responsibility for the healing process because nobody can do it for you.\n</p>\n<p>\n\t                Healing strong is NOT just about relieving the pain. That’s important too of course, but healing strong means you regain all your lost mobility so you can be just as active as before—if not more so.\n</p>\n<p>\n\t                Let me be clear: if your goal is to simply make the pain go away, that can be done easily with pills and injections.\n</p>\n<p>\n\t                But since you’re here today, reading this letter, I’m going to assume that you want you’re looking to be as good as new—am I right? If so, you’ll have to take matters into your own hands.\n</p>\n<p>\n\t                Some good news…<br>\n\t                  I DID heal my back very successfully using modified yoga poses, deep stretches, and strength practices. The strength practices were vital and often overlooked. And this is why I’m writing to you today.\n</p>\n<p>\n\t                My friend and colleague, Kimberly Johnson and I are leading a small group through our first-ever online Yoga for Back &amp; Neck Care Workshop.\n</p>\n<h5>Join this Exclusive Workshop…</h5>\n<p>This virtual course is designed for students of all levels, beginners all the way up to the teacher level, and the program is all about helping you understand your unique body and practice yoga in a way that heals you—not hurts you.\n</p>\n<p>\n\t                Here’s what you’ll learn:\n</p>\n<ul>\n\t<li>How to identify muscle imbalances in the body (one of the leading causes of spinal injuries)</li>\n\t<li>How to safely correct imbalances</li>\n\t<li>How to improve strength and flexibility</li>\n\t<li>How to understand your unique body, posture, and tendencies</li>\n\t<li>How a simple 15-minute daily practice can completely change your posture and the health of your spine</li>\n\t<li>Nutrition and lifestyle tricks for relieving inflammation, optimizing your flexibility, and reducing recovery time</li>\n\t<li>Simple self-treatment solutions for a sore body</li>\n</ul>\n<p>\n\t                Kimberly is part of the training staff at my Yoga Teacher Training courses; and normally, she only teaches live, in-person events either in Brazil or Thailand…\n</p>\n<p>\n\t                … but she and I have been working on this program for nearly 5 months, and we’ve got a format and a structure that works awesome online, in many ways, it’s superior to a live class—and it’s so much more convenient and affordable.\n</p>\n<p>\n\t                You’re going to love it. Here’s how it works…\n</p>\n<h5>Yoga for Back &amp; Neck Care Workshop Overview</h5>\n<p><strong>CORE LESSONS </strong> – Each week, we start with a Core Lesson where we’ll all get together on a live webinar. You can join via your computer or telephone—or even just listen online to the streaming audio. We have so many options, you’ll find it very easy and convenient to join in—and of course, it’s always recorded so you can go back and watch again at your convenience.\n</p>\n<p>\n\t                In the Core Lesson, we keep it very practice and very fun.\n</p>\n<p>\n\t                The first part of the class is called “Body Discovery” where Kimberly will teach us how our spine works, why our core muscles are so important, how to correct our postures, and simple tricks for driving and typing that can save you a world of pain later on.\n</p>\n<p>\n\t                You’ll listen and learn—but you’ll also see diagrams, photos, and videos so everything is very easy to digest. It’s like being in a classroom, but better because all the materials are organized for you to keep forever including class notes, video and audio archives.\n</p>\n<p>\n\t                Each Core Lesson has a theme, and that theme plays right into the second part of the class, The Yoga Practice.\n</p>\n<p><strong>THE YOGA PRACTICE</strong> (video, audio, pose charts) – There are 5 Core Lessons and 5 Yoga Practice Series, each just 15 minutes long. So during week 1, you’ll learn and practice yoga series 1. During week 2, you’ll learn and practice week 2’s series throughout the week.\n</p>\n<p>\n\t                By the end of the course, you’ll have mastered 5 powerfully simple yoga series and you can then start alternating and using as needed. Some people just love the core strength class and they just do that one. Other students are really blocked in their hips, so they put all their focus there.\n</p>\n<p>\n\t                And then some people, like me, get hooked on the simplicity of simply alternating Yoga Practice Series each day, so Mon-Friday, each day, you take 15 minutes for a wonderful, balancing yoga practice you can do at home.\n</p>\n<p>\n\t                And what are the results? Yoga for Back &amp; Neck Care will help you:\n</p>\n<ul>\n\t<li>Relieve back &amp; neck pain</li>\n\t<li>Increase your mobility &amp; range of motion</li>\n\t<li>Become stronger</li>\n\t<li>Become more flexible</li>\n\t<li>Achieve greater balance</li>\n\t<li>Stabilize your joints</li>\n</ul>\n<h5>Frequently Asked Questions…</h5>\n<table>\n<tbody>\n<tr>\n\t<td>\n\t\t<strong>Is this for beginners?</strong>\n\t</td>\n</tr>\n<tr>\n\t<td>\n\t\t<p>\n\t\t\t                This is an all-levels course which means we have brand new beginners all the way to yoga teachers.\n\t\t</p>\n\t</td>\n</tr>\n</tbody>\n</table>\n<table>\n<tbody>\n<tr>\n\t<td>\n\t\t<strong>If I’m a beginner, where can I ask questions?</strong>\n\t</td>\n</tr>\n<tr>\n\t<td>\n\t\t<p>\n\t\t\t                You are welcome to ask questions at ANY of the class times, but just so you know, there is a special forum thread just for beginners. Kimberly and I personally answer questions there, so you’ll get all the help you need.\n\t\t</p>\n\t\t<p>\n\t\t\t                The same goes for teachers. We’re keeping the course very small, so you’ll have time to ask us teaching questions live during class or else in the teacher’s area in the forum.\n\t\t</p>\n\t</td>\n</tr>\n</tbody>\n</table>\n<table>\n<tbody>\n<tr>\n\t<td>\n\t\t<strong>Is this course about extreme flexibility?</strong>\n\t</td>\n</tr>\n<tr>\n\t<td>\n\t\t<p>\n\t\t\t                No, this course is about healing your body through yoga, finding strength and balance.\n\t\t</p>\n\t</td>\n</tr>\n</tbody>\n</table>\n<table>\n<tbody>\n<tr>\n\t<td>\n\t\t<strong>What if I’m not tech savvy?</strong>\n\t</td>\n</tr>\n<tr>\n\t<td>\n\t\t<p>\n\t\t\t                Being tech savvy is really overrated in my opinion, so we’ve created the program so that anyone can easily access all the materials from any computer. It’s fast and easy, and our support team can help with any questions. Basically, if you can send an email and you can use a phone, you’ll have no problems at all.\n\t\t</p>\n\t</td>\n</tr>\n</tbody>\n</table>\n<table>\n<tbody>\n<tr>\n\t<td>\n\t\t<strong>If I have questions for Lucas or Kimberly, will they really answer them?/strong&gt;</strong>\n\t</td>\n</tr>\n<tr>\n\t<td>\n\t\t<p>\n\t\t\t                Yes, 100% for sure. We kept the course small for just this reason. The only caveat is that we are not medical doctors and cannot give medical or treatment advice.\n\t\t</p>\n\t</td>\n</tr>\n</tbody>\n</table>\n<table>\n<tbody>\n<tr>\n\t<td>\n\t\t<strong>Why is there such limited space in the course?</strong>\n\t</td>\n</tr>\n<tr>\n\t<td>\n\t\t<p>\n\t\t\t                Kimberly and I are both used to working with very small in-person groups. Through this new virtual course format, we can work with more students, for sure, but there’s no way we can accept everyone.\n\t\t</p>\n\t\t<p>\n\t\t\t                Currently, we have over 1600 people on the waiting list and we can’t even accept 10% of those students.\n\t\t</p>\n\t</td>\n</tr>\n</tbody>\n</table>\n<h5>Here’s What You’ll Experience…</h5>\n<p>Weekly Core Lesson that include Body Discovery and Yoga Practice modules. You can join us live via webinar, webcast or telephone… or you can simply wait and access the archives in video or mp3 format.\n</p>\n<p>\n\t                Each week, you’ll also get a NEW Yoga Practice Series on video and audio so you can practice at home.\n</p>\n<p>\n\t                Along with each Yoga Practice Series, you’ll also get a Yoga Pose Chart to go with each series. You can print this out and use it as quick reference while you practice.\n</p>\n<p>\n\t                In between the Core Lessons, we’re going to have 2 “Ask Kimberly” call-in days where Kimberly will talk with you and help you with any specific challenges you might be having. As with everything, complete recordings of these calls will be made available to you forever.\n</p>\n<p>\n\t                Next, you get 24/7 access to the Yoga for Back &amp; Neck Care forum. There is a section for beginners, one for teachers, one about posture and so much more. This forum is where you can get answers from your teachers, but also from other students which can be extremely helpful.\n</p>\n<p>\n\t                This program is 100% digital so you’ll have immediate and on-going access to all the course training for as long as you want. There is nothing to ship in the mail and everything is compatible for both PC and Mac and mobile device ready.\n</p>\n<h5>PLUS… Get 2 *Limited Time* Bonuses</h5>\n<p>\n\t<strong>PHOTO ANALYSIS</strong> -I’m very happy to announce we have a limited number of early bird bonuses. The bonus is a “Photo Analyses” available for the first 100 people who join the course. Here’s how it works:\n</p>\n<ul>\n\t<li>You take 3 pictures of yourself form the side</li>\n\t<li>You send us the photos (we’ll give you instructions) and you’ll get a posture analysis emailed to you personally.</li>\n</ul>\n<p>\n\t                Just this alone will teach you so much about your body that this one bonus is more than worth your cost of attending the course.\n</p>\n<p>\n\t<strong>TWO EXPERT AUDIO SEMINARS</strong> – As a final bonus, I’m going to give you instant access to 2 of my best audio lectures on the spine. The first is called, “Secrets of the Psoas.” The 2nd is called “Ouch My Back Hurts.” Both are excellent and you’ll get access to those as soon as you login to the members area.\n</p>\n<h5>Who is This Course For?</h5>\n<p>\n\t                 The Yoga for Back &amp; Neck Care Workshop is a 5-week program that will help you understand your unique body, practice yoga efficiently and effectively—and see huge results in the health of your spine.\n</p>\n<p>\n\t<strong>It’s designed for:</strong>\n</p>\n<ul>\n\t<li>People who struggle with back &amp; neck pain</li>\n\t<li>“Desk job” workers who feel stiff and want solutions</li>\n\t<li>Yoga students who have painful, restricted back bends</li>\n\t<li>Yoga teachers who want to add to their toolkit and better serve their students</li>\n\t<li>Real people like you who looking to live happier, pain-free lives</li>\n\t<li>YES! Beginners welcome</li>\n</ul>\n<h5>Don’t Worry… It’s Not a Big Time Commitment</h5>\n<p>\n\t                 No big time commitment needed! The yoga workshop itself is fun and fast-paced. And remember, all the materials are archived, so even if you’re busy one week, you can always go back to the previous lesson at you convenience.\n</p>\n<p>\n\t                And here’s the best part: we’ll learn a ton of great tools in our 5 weeks together, but to maintain your practice, all you need is a teeny tiny commitment of 15 minutes per day. Just 15 minutes per day!\n</p>", 
    "end_date": null, 
    "title": "Yoga for Neck and Back Care", 
    "price": "20.00", 
    "instructors": "Lucas Rockwood", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32104_4591_4.jpg", 
    "course_url": "https://www.udemy.com/yoga-for-neck-and-back-care/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-10T10:31:35Z"
}