{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Le yoga Prénatal permet   de vivre harmonieusement sa grossesse, de soulager ses maux et de se   préparer à l&#039;accouchement. Il nous met en relation avec notre bébé grâce   au souffle approfondi et à notre bien-être.Les cours commencent à partir du deuxième trimestre.Ils sont ouvert à tous ! Pas d&#039;expérience antérieure nécessaire!</p><p>Le cours est organisé pour vous donner les bases fondamentales du   Yoga Prénatal selon la Méthode De Gasquet intégré avec du Yoga Hatha &amp; Vinyasa qui prend en compte à la fois le corps (Asanas), la respiration (Pranayama), et la relaxation profonde. </p><p>Mon approche est simple et détaillée pour vous apporter les bienfaits suivants:</p><ul style=\"\"><li>Renforcer les jambes pour mieux porter le reste du corps</li><li>Rendre le périnée flexible et le plancher pelvien fort</li><li>Soulager les douleurs du dos</li><li>Aider avec la sciatique de grossesse</li><li>Relaxer tout le système nerveux</li><li>Renforcer le système immunitaire</li><li>Garder l&#039;équilibre pendant que le centre de gravité change</li><li>Vous donner des gestes simples pour s&#039;assoir, se relever, se coucher, porter</li><li>Créer le lien avec votre bébé in-utero</li></ul><p>C&#039;est un moyen à la fois de retrouver son énergie vitale, de se   renforcer, de relâcher les tensions, de trouver un équilibre, de   s&#039;ouvrir à une flexibilité du corps et de l&#039;esprit! Et surtout de vous faire confiance en apprenant à avoir une meilleure écoute de soi. Enfin, de continuer à respirer profondément tout au long de cette période.</p><p>Merci de votre intérêt pour ce cours et j&#039;espère qu&#039;il contribuera à votre bien-être pendant votre grossesse!<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Yoga Prénatal Tous Niveaux", 
    "price": "30.00", 
    "instructors": "Tatiana Abbey", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41451_de13_6.jpg", 
    "course_url": "https://www.udemy.com/yoga-prenatal-tous-niveaux/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-13T09:22:05Z"
}