{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p></p><p>The way to actually learn yoga and deepen your practice of yoga is to do the same poses day after day for a period. Then you can learn how your body responds to the physical poses, you can relax and watch your mind in the calm of knowing what comes next, and you can grow with the pose on many levels.</p>  <p>This 4 week yoga immersion course offers you a way to learn yoga in the truest sense, poses and philosophy, how to live your life in yoga, not just a pose on a mat.&nbsp;</p>  <p>The pose sequence for the class is exactly the same for each day of that commitment, with additional teachings and support offered each day. The course is designed for practicing poses for six days and on the seventh, you&#039;ll rest the body and energize your mind with teachings of philosophy, yoga off the mat and even a bit of yoga cooking.</p>  <p>Learning yoga is like learning a language, daily practice is much better than cramming before an exam.&nbsp;</p>  <p>  </p><p>This level is called <strong style=\"\">Ginger</strong>&nbsp;as it is warm, spicy, hot, healing, juicy and has intense energy.</p>  <p>  </p><p>In addition to the daily 30 minute practice, each day includes a video teaching on a yoga topic with related reading materials. The topics include how to watch your thoughts and notice negative self-talk, how to incorporate yoga in your daily life, how to practice yoga breathing techniques and how to meditate wherever you are.</p>  <p>You will need to have a yoga mat, a space in your house that is at least enough enough for the mat. If you have yoga blocks, that would be helpful, but if not, you can use books or a chair. Come to the 30 minute pose practice with an empty stomach and open mind. The best time to practice is first thing in the morning, but whenever you can make it to your mat, that is the time for you. You watch the philosophy video and read the material anytime during the day, perhaps just before you practice the poses, or alternatively, just before you go to bed.</p><p></p>  ", 
    "end_date": null, 
    "title": "Yoga @ Home with Meta - Immersion for Experienced Students", 
    "price": "25.00", 
    "instructors": "Meta Hirschl", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/55644_9602_4.jpg", 
    "course_url": "https://www.udemy.com/yoga-home-with-meta-immersion-for-experienced-students/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-21T21:43:17Z"
}