{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>En este intento por dar luz a nuestros chakras, te enseñaremos a recuperar esa energía vital que necesita nuestros chakras.</p>    <p>Los chakras no son el aura. Los chakras son centros de energía que están a lo largo de nuestro cuerpo y fuera de nuestro cuerpo. Tener los chakras en balance se compara con una fuente de energía que sube en espiral y nos conecta con la energía universal. ¿Cómo desarrollar, activar y equilibrar los chakras?<br> <br> </p>  <p>Para recuperar la energía natural de los chakras hemos preparado siete rutinas de al menos 7 minutos para cada chakra donde haremos asanas en nuestra practica de yoga, afirmaciones, mantras y mudras para la sesión de meditación.</p>    <p>Ademas añadimos terapia de sonido para llegar a cada uno de estos chakras y te recomendaremos las gemas de la terapia de cristales que potenciaran tu sesión.</p>    <p>¿Por qué y como los Cristales ayudan?<br> <br> </p>  <p>Por su estructura molecular que vibra y está en resonancia con la estructura molecular de nuestro cuerpo físico.<br> Por el color. El color es una longitud de onda. Vibra en una frecuencia determinada que se corresponde con cada color de los chakras.<br> <br> </p>  <p>Por su Geometría Sagrada. Sabemos que el lenguaje universal está expresado en símbolos. En los cristales, podemos encontrar todas estas figuras, comprendiendo que su decodificación dependerá de nuestro trabajo interno respecto de nosotros mismos.</p>    <p>Busca tu mat y empecemos.</p>", 
    "end_date": null, 
    "title": "Yoga para activar tus chakras en español.", 
    "price": "20.00", 
    "instructors": "kAca yoga kAca Yoga", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765872_2937.jpg", 
    "course_url": "https://www.udemy.com/yoga-para-activar-tus-chakras-en-espanol/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T22:09:31Z"
}