{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t              Learn to relax your mind and body in this Yoga Nidra course. This is not the physical practice that most of us associate with the term \"yoga\" so don't worry if you feel you can't do a regular yoga class.  This is <strong><em>not</em></strong> that type of yoga class. This is effortless relaxation.  This course is for <strong>ALL LEVELS</strong> including those who have never tried any form of yoga before or are reluctant to go into a yoga studio. Here, you will learn to relax and we can all use a bit of that. If you have never tried Yoga Nidra, you have no idea what you have been missing.  </p>  <p>  \t              Yoga Nidra has been used to treat anxiety, stress, insomnia, chronic pain and PTSD among many other ailments. It is currently being used by the military to treat veterans. Here you will be guided into a deep, systematic relaxation of the entire body. The practice of Yoga Nidra is accessible to all.  </p>  <p>  \t              I've also added two Bonus Videos at the end that you can do whenever you don't have a lot of time. One is a restorative yoga pose that most people should be able to do. This course is yours for life and you can come back to the practice whenever you need it.  </p>  <p>  \t              If you are a yoga teacher, learn the practice for yourself and go out and share it with your students. You can also get CE credit with Yoga Alliance. Earn extra money by running Yoga Nidra workshops!  </p>", 
    "end_date": null, 
    "title": "Yoga Nidra for Complete Relaxation", 
    "price": "20.00", 
    "instructors": "Maria De Noda", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378902_55c4_3.jpg", 
    "course_url": "https://www.udemy.com/yoga-nidra-for-complete-relaxation/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-28T01:53:45Z"
}