{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">What you&#039;ll get:</strong><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \tThis course includes a 30 minute yoga class to help you develop flexibility, core strength, and stress relief. Learn to focus and breathe in classical yoga poses that help you look at yoga in a new way. This class teaches you the key alignment techniques to be aware of for a safe practice, without distracting from the flow of the class.  </p>  <p>  \t<strong style=\"\">You also get access to 4 short how-to videos</strong> focusing on the alignment of each pose to do back to back or when you have only a few minutes in your day. Those poses are:  </p>  <ul style=\"\">  \t<li>Dancer</li>  \t<li>Tree</li>  \t<li>Warrior 1</li>  \t<li>Crocodile</li>  </ul>  <p>  \t<strong style=\"\">Some of the poses this 30 minute video will cover are:</strong>  </p>  <ul style=\"\">  \t<li>chair</li>  \t<li>boat</li>  \t<li>pigeon</li>  \t<li>cat-cow</li>  \t<li>twists</li>  \t<li>downward facing dog</li>  \t<li>plank</li>  \t<li>bridge </li>  </ul>  <p>  \t The 30 minute class starts with warm up poses, goes through sun salutations, a cool down and ends with shavasana (relaxation). It focuses on core strengthening, and exercising key muscles that are the source of discomfort. Ending with relaxation allows the body a few minutes to absorb the practice and let the mind settle to continue daily activities with ease and focus. It incorporates muscle strengthening poses for your core, back and legs.  </p>  <p>  \t<strong style=\"\">Bonus Video:</strong>  </p>  <p>  \tThis course also includes a short how-to video for a kids&#039; yoga pose so you can do this with your kids, or just to add some fun play into your life.  </p>  <p>  \t<strong style=\"\">Who is your teacher?</strong>  </p>  <p>  \tJessica Walsh is a certified 200 hour yoga teacher through the Himalayan Institute. She has been studying yoga since she was 16.  She holds yoga classes for kids and adults locally, private sessions, and recently started producing videos to share her teaching with the world.  </p>  <p>  \t<strong style=\"\">Disclaimer:</strong>  </p>  <p>  \tPlease consult your doctor before starting this practice to learn any limitations you might have.  </p>", 
    "end_date": null, 
    "title": "Yoga for Energy!", 
    "price": "20.00", 
    "instructors": "Jessica Ann", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107634_6942_7.jpg", 
    "course_url": "https://www.udemy.com/yoga-for-energy-and-peace-of-mind/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-18T19:27:50Z"
}