{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Yoga basics course contains detailed lessons to help you keep up great health and peaceful living.</strong></p><p style=\"\"><strong style=\"\">Yoga is a divine and ancient practice which is proven to give amazing results when practiced regularly. This course structure is designed after considering all the angles from which a person new to Yoga can experience a flow which is easy to follow.</strong></p><p style=\"\"><strong style=\"\">Through the practice of Yoga you attain inner peace and tranquility which you carry throughout the day.</strong></p><ul style=\"\"><li style=\"\">You will have 8 lessons filled with simple and effective Yoga postures to help you follow the lessons in a  very easy manner .You need to practice each lesson for 3 days. </li><li style=\"\">As the lessons progress new postures are added</li><li style=\"\">You are provided with 8 practice sheets to practice at your own pace and comfort after attaining proficiency, which is preferably after 24 days</li><li style=\"\"><span style=\"\"></span>15 individual lessons are available on all the postures which can be referred after you start independent practice</li></ul><p style=\"\"><strong style=\"\">Benefits of the course :</strong></p><ul style=\"\"><li style=\"\">Regular practice along with proper diet helps you to keep diabetes under control</li><li style=\"\">Clear instructions and demonstration help even beginners to follow easily</li><li style=\"\">No wastage of time as you need to start the lesson and just follow, leading to live class experience</li><li style=\"\">Individual lessons and practice sheets are great tools to save time and practice effectively</li></ul>", 
    "end_date": null, 
    "title": "Yoga basics : 24 day course", 
    "price": "20.00", 
    "instructors": "Vishnu Sharma", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/492426_4c72.jpg", 
    "course_url": "https://www.udemy.com/yogafordiabetes/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-03T08:57:42Z"
}