{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  Do you know that your bedroom could be blocking you from sleeping well?  </p>  <p>  \t  Or that what you eat and drink can jolt you awake at 4 am, or ruin your deep sleep?  </p>  <p>  \t  Are you over wondering if you&#039;ll sleep, when, how well every night? Wouldn&#039;t you like to know for SURE that you&#039;ll sleep like a dream tonight--and every night?  </p>  <p>  \t  And, finally--are you sick and tired of feeling, well, tired all the time? I sure was.  </p>  <p>  \t  Do you know that sleep is the ONLY time your brain and body can fully repair? And are you sleeping enough to prevent disease, make your fitness efforts count, and wake up feeling bright and alive and ready to handle all your decisions and responsibilities?  </p>  <p>  \t    If not, then this course can totally turn all of this around--in just ONE WEEK! Plus, did I mention? You&#039;re going to have so much fun doing it with me?  </p>  <p>  \t    I used to sleep terribly, and I got all the crushing tiredness, lack of focus, irritability and physical decline that goes along with it. I looked old, I felt old.  </p>  <p>  \t    Then I took my years of yoga, meditation and feng shui expertise, and created a simple, uber-effective, 7 Day Process to get anyone to sleep fast, deeply and easily.  </p>  <p>  \t    Thousands of my clients have done the same, and I&#039;m about to save you, like them,  so much time and money and potential illness by giving you what should be priceless --but what I&#039;m going to give you is only $59. That&#039;s less than the cost of one good meal, to sleep great for a lifetime.<span> </span>  </p>  <p>  \t<span>Grab it, and learn how to have excellent sleep, whenever you choose--without drugs, tons of time or energy.</span>  </p>  <p>  \t    Let&#039;s do this! It doesn&#039;t get any easier or work any better than this.  </p>  <p>  \t    xoSadie  </p>", 
    "end_date": null, 
    "title": "YOGA FOR INSOMNIA: 7 DAYS TO SLEEP LIKE A DREAM!", 
    "price": "20.00", 
    "instructors": "Sadie Nardini", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329346_7668.jpg", 
    "course_url": "https://www.udemy.com/yogaforinsomnia/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T14:10:50Z"
}