{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Yoga with a dancing bear! Popping like popcorn! Balancing poses with a gingerbread man!<strong> Discover a whole new world of proven and beloved songs, activities and tools that teach children the love of yoga and movement and relaxation.</strong></p><p>Whether you are already teaching kids yoga, or just need a place to start, you will walk away with many great activities, songs, tips and lots of proven ideas that you can immediately incorporate into the classroom.</p><p><strong> This workshop includes background, philosophy and many ways to incorporate yoga throughout the school day and is ideal for preschool teachers, kids yoga teachers, elementary school teachers and anyone</strong> who wants to begin or continue incorporating yoga and mindfulness in the classroom or at home. </p><p>A Sample of What You Will Learn:    • A whole new range of proven, beloved and highly requested activities and songs to immediately bring into kids' classes. Learn to “sleep\" like a pony in the barn, “hang\" upside down like a bat in a bat cave and much more. * Effective and fun breathing activities that help children wind down, focus and self regulate. * How to incorporate relaxation time in the classroom in ways that will be successful and that children will love, request and look forward to.  </p><p>  <em>\"Bari Koral is the preeminent authority for Kids music for Yoga for young children.  Kids love to dance, move and sing to Bari's well-crafted, wonderfully produced recordings. Her yoga/music and movement curriculum is widely used by educational programs worldwide. But most importantly... kids and teachers just plain love it.\" </em> -Greg Scelsa: Greg &amp; Steve </p>", 
    "end_date": null, 
    "title": "Yogapalooza! Music & Activities for Kids Yoga w/ Bari Koral", 
    "price": "25.00", 
    "instructors": "Bari Koral", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501216_0a7e_3.jpg", 
    "course_url": "https://www.udemy.com/yogapalooza/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-13T16:58:43Z"
}