{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Welcome to my course, yoga journey, about finding peace through reflection and movement.</p>  <p>My name is Hannah and I love combining, sharing, and teaching my passions of yoga, art, travel, and self-discovery. </p>  <p>Yoga turned into a life changing practice for me when I began to practice four years ago. I felt the effects of moving my body with my breath, along with building muscles, flexibly, and balance.  </p>  <p>I’ve been teaching live yoga classes for over a year now after receiving my 200-Hour teacher training at one of San Diego’s most authentic Vinyasa yoga studios, and I’ve seen the difference that teaching yoga and self-discovery is making in many of my friends and family members lives.</p>  <p>After completing this course, you will be able to:</p>  <ul><li>Demonstrate physical poses that will build strength, flexibility, and balance</li><li>Move consciously with your breath</li><li>Activate the light/energy within</li><li>Open your heart to feel emotions that arise in the moment</li></ul>        <p>This Course consists of 4 sections.</p>  <p>In each section you will find:</p>  <ul><li>written discussion about the topic </li><li>video explanation with key ideas to reflect on </li><li>breakdowns of foundation and alignment to keep you safe and activated during key poses</li><li>physical yoga sequence video that includes warm-up, Sun-Salutations, key poses, inversions, cool down, savasana.</li></ul>        <p>I designed this course for individuals who want to live their life to the fullest by balancing their emotions, reducing stress, and building strength and flexibility for a balanced body.  </p>  <p>If you are challenged by change, suppressing emotions, or controlling the voice in your head and you are looking for an outlet for your feelings and freedom from your pain, than this course is for you!</p>  <p>Thank you for your interest in my course and I look forward to hearing more about your path to finding peace by joining my yoga journey now.</p>", 
    "end_date": null, 
    "title": "Yoga Journey to Finding Peace", 
    "price": "30.00", 
    "instructors": "Hannah Faulkner", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631904_526f.jpg", 
    "course_url": "https://www.udemy.com/yoga-journey-to-finding-peace/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T02:02:59Z"
}