{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>&nbsp;Le Yoga <strong style=\"\">P<strong style=\"\">ostnatal vous permettra de vous remettre de l&#039;accouchement en douceur, de soulager les maux des suites de couches, de reprendre contact avec votre énergie vitale, votre force et votre équilibre intérieur.</strong></strong></p><p><strong style=\"\"><strong style=\"\">Dans ce cours, je vous guiderai dans des exercices pour protéger votre perinée dans sa periode de recupération et pour renforcer vos muscles abdominaux profonds. Nous ferons egalement quelques poses avec bébé qui sont ludiques et qui vont apporteront de nombreux benefices. Avec aussi des massages doux pour bébé et des poses a faire avec le coussin d&#039;allaitement.<br style=\"\"></strong></strong></p><p><strong style=\"\"><strong style=\"\">Le cours est organisé pour vous donner les bases fondamentales du   Yoga Postnatal selon la Méthode De Gasquet intégré avec du Yoga Hatha   &amp; Vinyasa qui prend en compte à la fois le corps (Asanas), la   respiration (Pranayama), et la relaxation profonde.&nbsp; </strong></strong><strong style=\"\"><strong style=\"\">Meme si vous n&#039;avez jamais fait de Yoga auparavant, si vous êtes à plus de 6 semaines après l&#039;accouchement, ce cours est pour vous!<strong style=\"\"><strong style=\"\"><br style=\"\"></strong></strong></strong></strong></p><p><strong style=\"\"><strong style=\"\"><strong style=\"\"><strong style=\"\">Il est recommandé de ne pas  faire d’exercices pendant les 6 semaines qui suivent l’accouchement. Cependant, je préconise une remise en  forme du périnée et des muscles abdominaux profonds dans les 40 jours qui  suivent la naissance  </strong></strong></strong></strong></p><p><strong style=\"\"><strong style=\"\">Mon approche est simple et détaillée pour vous apporter les bienfaits suivants:</strong></strong></p><p><strong style=\"\"><strong style=\"\">  </strong></strong></p><ul style=\"\"><li><span><span></span></span>Protéger le périnée pendant sa période de récupération</li><li><span><span></span></span>Renforcer les muscles abdominaux profonds</li><li><span><span></span></span>Remonter les organes</li><li><span><span></span></span>relâcher les tensions du dos </li><li><span><span></span></span>re-muscler le bas du dos</li><li><span><span></span></span>rééquilibrer le bassin</li><li><span><span></span></span>relaxer le système nerveux</li><li><span><span></span></span>créer un lien d’attachement avec votre bébé<span></span></li><li><span><span>&nbsp;</span></span>faire quelques exercices à pendant l’allaitement</li><li><span><span>&nbsp;</span></span>vous amuser avec votre bébé a l’aide de posture simple et de massages  doux</li></ul>                                      <p><strong style=\"\"><strong style=\"\"><p><strong style=\"\"><strong style=\"\">C&#039;est un moyen à la fois de retrouver son énergie vitale, de se   renforcer, de relâcher les tensions, de trouver un équilibre, de   s&#039;ouvrir à une flexibilité du corps et de l&#039;esprit! Et surtout de vous   faire confiance en apprenant à avoir une meilleure écoute de soi. Enfin,   de continuer à respirer profondément tout au long de cette période de vie si particulière!<br style=\"\"></strong></strong></p><p><strong style=\"\"><strong style=\"\">Merci de votre intérêt pour ce cours et j&#039;espère qu&#039;il contribuera à votre bien-être et a celui de votre bébé!</strong></strong></p>    <p>Attention: Si  vous avez eu une césarienne, des points de sutures ou quelques complications  que ce soit a la naissance, consulter d&#039;abord votre medecin,<br style=\"\"></p></strong></strong></p>  <p><strong style=\"\"><strong style=\"\"><p>Si  vous présentez les symptômes suivants, vous ne devez pas faire ce cours: Saignements vaginaux, hypertension artérielle, un souffle court plus élevée que d’habitude, vertiges ou<span>&nbsp; malaises</span>, contractions utérines, douleur dans la poitrine, fuite de liquide provenant du vagin, fréquence cardiaque élevée (pouls rapide), des difficultés a marcher</p>    <p>  </p></strong></strong></p>                                      <p>Appeler  immédiatement votre docteur si vous remarquez l’un de ces symptômes</p>  ", 
    "end_date": null, 
    "title": "Yoga Postnatal Tous Niveaux", 
    "price": "30.00", 
    "instructors": "Tatiana Abbey", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/55517_f2ae_5.jpg", 
    "course_url": "https://www.udemy.com/yoga-postnatal-tous-niveaux/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-21T13:08:48Z"
}