{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Learn the anatomical foundations of a healthy, sustainable chaturanga (yoga&#039;s push-up pose)! Chaturanga tends to be practiced very frequently and repetitively in many yoga classes, and yogis commonly injure their shoulders, elbows, and/or wrists by performing this pose in a poorly-aligned manner.</p><p style=\"\">Learn to practice and teach a chaturanga that builds <strong style=\"\">true shoulder strength</strong> instead of one which <strong style=\"\">wears our shoulders down</strong>!</p><ul style=\"\"><li style=\"\">Learn the bones of the shoulder girdle</li><li style=\"\">Explore the 4 separate joints of the shoulder girdle</li><li style=\"\">Understand how these joints move in a healthy way</li><li style=\"\">Apply this knowledge to your practice &amp; teaching of chaturanga and related yoga poses</li><li style=\"\">Learn how to practice a chaturanga that meets your personal strength edge</li></ul><p style=\"\"></p><p style=\"\">This course was filmed live with yoga students, and the material is presented in an engaging, friendly manner with students&#039; in-person questions included. The full course consists of a 55-minute experiential anatomy lecture on the shoulder girdle and how this area of the body moves well followed by an 85 minute yoga practice which applies this new anatomical knowledge directly to chaturanga and related yoga poses.</p><p style=\"\">This course is designed for any yoga student or yoga teacher who is interested in learning more about their body in an experiential, embodied, and fun way. At the end of this course you will have deepened your understanding of your own anatomy and you will have greatly enhanced your knowledge and expertise as a yoga teacher.</p>", 
    "end_date": null, 
    "title": "Yoga Anatomy of the Shoulders for Healthy Chaturangas", 
    "price": "50.00", 
    "instructors": "Jenni Rawlings", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530922_fd70_6.jpg", 
    "course_url": "https://www.udemy.com/yoga-anatomy-of-the-shoulders-for-healthy-chaturangas/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T05:30:42Z"
}