{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Du findest hier</strong> <strong class=\"redactor-inline-converted\">zwei volle Yogaeinheiten</strong>, die gut aufeinander aufbauen. Beide sind wie ein üblicher Yoga Kurs gestaltet &amp; beinhalten Körper- &amp; Atemübungen sowie jeweils eine Meditation und eine Tiefenentspannung am Ende. Ideal um Dir eine kleine Auszeit zu gönnen. </p><p><strong class=\"redactor-inline-converted\">Bonus</strong>: Die Meditation der zweiten Einheit &amp; Yoga Nidra gibt's kostenlos als Mp3 Download dazu. So kannst Du die Übungen auch mal zwischendurch durchführen. </p>\n\n<p><strong class=\"redactor-inline-converted\">Die erste Einheit</strong> behandelt das Spüren des eigenen Körpers und Du lernst Dir der wichtigsten Bewegungen für Deine spätere Yoga Praxis bewusst zu werden. Für eine physiologische Ausführung von Yoga Übungen ist es sehr wichtig ein grundlegendes Verständnis und Gefühl für die Bewegungen Deines Körpers zu erlangen. Dazu gehören zum Beispiel die Bewegungen der Brustwirbelsäule oder des Beckens.  Das Spüren des eigenen Körpers, seiner Beweglichkeit &amp; Dynamik hilft Dir außerdem dabei Dich selbst nachhaltig und bewusst in die Entspannung und zu größerer Achtsamkeit zu führen. </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Die zweite Einheit</strong> lässt Deinen Körper &amp; Geist flexibel werden. Durch angenehme Dehnungen werden Deine Bewegungen geschmeidiger und muskuläre Verkürzungen können nach und nach vermindert werden. Dadurch gelingt die Ausführung von vielen Yogaübungen einfach leichter und besser. </p>\n\n\n\n\n\n\n\n<p>Lass Dich ein auf eine intensive Reise durch Deinen Körper und profitiere durch die entstehende Achtsamkeit und Ruhe im Alltag. Finde mit Yoga zu Deiner inneren Natur, schalt den Kopf ab und komm in Deiner Mitte an. In unseren schnelllebigen Zeit werden Pausen immer wichtiger. Doch Heutzutage sind Pausen ganz bewusste Entscheidungen und Termine, die man mit sich selbst treffen muss. </p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bei beiden Yogaeinheiten geht es nicht darum Muskeln zu kräftigen oder Deinen Körper zu optimieren, sondern Dich so anzunehmen wie Du bist und den inneren Kritiker auszuschalten.</strong> </p>\n\n\n\n<p>Beide Kurse werden durch die wunderbaren <strong class=\"redactor-inline-converted\">Mantra Gesänge von Satyaa und Pari </strong>bereichert.</p>\n\n\n\n\n\n\n\n\n\n<p>Du brauchst lediglich eine Yogamatte, eine Decke, ein kleines Handtuch und jeweils 90 Minuten Stille.</p>", 
    "end_date": null, 
    "title": "Yoga für Anfänger & Fortgeschrittene - Praxis", 
    "price": 0, 
    "instructors": "Jennifer Griffiths", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736804_8a1a_6.jpg", 
    "course_url": "https://www.udemy.com/yoga_der_selbstwahrnehmung/", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T13:33:25Z"
}