{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Ever feel exhausted, tight and sore after a long run?</strong></p><p>I love running but hate the way it can make my joints and muscles feel. By cross training with yoga you will be able to get rid of aches and pains and prevent injury from occurring, which is crucial if you want to make running sustainable. <br></p><p>If you struggle with ANY of these symptoms when running… this practice can help eliminate the problems you face so <em>you're entire lower body can feel strong and limber once again</em>.</p><p>Yoga for Runners is divided into sessions that allow you to easily target specific areas that are achy and painful in your body. Each class runs around 15 minutes and is designed so you can mix and match to form longer, full yoga sessions. For example, you can combine the Yoga Warmup class with Hips, Quads and a Yoga Cool Down to form a complete 60 minute practice. If you have limited time… each class can be enjoyed on its own if you need to quickly address a tight area in your body.</p><p><strong>Benefits You Can Get From This Course:</strong></p><ul><li>Feel “lighter” during your runs and create a more efficient stride by eliminating the tightness in your lower body…</li> <li>Prime your muscles for a jog…</li> <li>Become a more agile and comfortable runner…</li> <li>Gain flexibility and reduce your risk of injury and muscle fatigue…</li> <li>Improve your physical and mental state…</li> <li>And, it's easy to follow and great for people with limited mobility.</li></ul><p>Yoga for Runners is designed for <em>all levels </em>including beginners, intermediate, and advanced yoga practitioners. <strong>It's designed to maximize your results in just 15 minutes a day</strong>. Kassandra walks you step-by-step through each of the poses. Her detailed instructions allow you to follow along without having to keep your eyes glued to the screen. You can practice at your own pace in the <em>comfort of your home</em>, and you'll get the feeling of being in the studio. It won't feel like you're “missing out” on anything. You'll also find it's<em> more time and cost effective</em> than a regular class<em>.</em></p><p><strong>Downloadable Content and Free Bonus Included</strong></p><p>Each video lesson is downloadable so you can put them on your tablet or smart phone. Watch them anywhere! What's more, you'll also receive a <strong>FREE</strong> <strong>BONUS </strong>Yin Yoga for Hips &amp; Hamstrings full class video not originally included with the other classes.</p><p>Included is a <strong>Money-Back Satisfaction Guarantee</strong>. If for ANY reason you aren't satisfied within 30 days, we'll happily refund every penny. In fact, go ahead and TRY the course out right now. See for yourself. If it's not everything and more… get your money back promptly.</p><p>This course has already impacted many people. You don't have to be flexible or strong to receive the benefits of Yoga for Runners. As long as you're willing to give it a chance and practice consistently… your life <em>will</em> change. Don't you owe it to yourself to feel completely stress-free and relaxed when you run?</p><p><strong>Please consult with your physician before beginning any exercise program. By participating in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself, and agree to release and discharge Yoga with Kassandra from any and all claims or causes of action, known or unknown, arising out of Yoga with Kassandra's negligence.</strong></p>", 
    "end_date": null, 
    "title": "Yoga for Runners - Crosstraining For Athletes", 
    "price": "25.00", 
    "instructors": "Yoga Instructor Kassandra Reinhardt", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430412_64eb_4.jpg", 
    "course_url": "https://www.udemy.com/yoga-for-runners/", 
    "currency": "USD", 
    "subject_name": [
        "Yoga"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T22:45:56Z"
}