{
    "selfpaced": false, 
    "topic_name": [
        "Bioinformatics"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/bioinform\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/bioinform-001/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    bioinform-001\n                                                                    bioinform-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    The DNA sequencing revolution has exploded and new, inexpensive technologies have led to sequences being determined faster than they can be analyzed. Bioinformatics brings together biology, math and computer science into a quickly emerging discipline that turns the computer into a scientific research lab. The relevance of bioinformatics extends to many disciplines, including health science, molecular biology, genetics, drug discovery, biochemistry, cell biology and education. Its impact is significant. Many scientific researchers with advanced degrees are going back to school to learn computer techniques that have become as essential to new discovery as pipettes and flasks.This course will introduce some important basic bioinformatics concepts while allowing for the adventurous to explore some topics in further depth if desired. \n\n                                            Syllabus\n                        Week 1: Biological Databases\n\n·        \nDatabase\nStructure\n\n·        \nSearching\nPubMed\n\n·        \nThe\nNCBI Public Sequence Database\n\n·        \nSequence\nRetrieval\n\nWeek 2 - BLAST and Sequence\nAlignment\n\n·        \nPairwise\nSequence Alignment\n\n·        \nBLAST,\nDatabase Searches\n\n·        \nAssessing\nHomology\n\nWeek 3 – Protein Bioinformatics\n\n·        \nDetermining\nMolecular Weight, Isoelectric Point\n\n·        \nPredicting\nSecondary Structure\n\n·        \nThe\nPDB Database\n\n·        \nProsite\nDomain searches\n\n·        \nPredicting\nCellular Localization\n\nWeek 4 – Prokaryotic Genomes\n\n·        \nBacterial\nGene Prediction\n\n·        \nProkaryotic\nGene Structure\n\n·        \nViruses\n\nWeek 5 – Eukaryotic Genomes,\nHuman Variation\n\n·        \nEukaryotic\nGene Structure\n\n·        \nEnsembl\nDatabase\n\n·        \nSingle\nNucleotide Polymorphisms\n\n·        \nDNA\nFingerprinting\n\n\n                                    ", 
    "end_date": "2014-07-14T00:00:00Z", 
    "title": "Bioinformatics: Life Sciences on Your Computer", 
    "price": 0, 
    "instructors": "Bob Lessick", 
    "institution_name": [
        "Johns Hopkins University"
    ], 
    "commitment": "4-8 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/course/bioinform", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-06-09T00:00:00Z"
}