{
    "selfpaced": false, 
    "topic_name": [
        "Bioinformatics"
    ], 
    "description": "\n\n                    \n                    \n                    A big welcome to “Bioinformatics: Introduction and Methods” from Peking University! In this MOOC you will become familiar with the concepts and computational methods in the exciting interdisciplinary field of bioinformatics and their applications in biology, the knowledge and skills in bioinformatics you acquired will help you in your future study and research.\n\n                                            Syllabus\n                        Introduction and History of BioinformaticsWelcome to “Bioinformatics: Introduction and Methods! Upon completion of this module you will be able to: become familiar with the essential concepts of bioinformatics; explore the history of this young area; experience how rapidly bioinformatics is growing. Our supplementary materials will give you a better understanding of the course lectures through they are not required in quizzes or examsSequence AlignmentUpon completion of this module, you will be able to: describe dynamic programming based sequence alignment algorithms; differentiate between the Needleman-Wunsch algorithm for global alignment and the Smith-Waterman algorithm for local alignment; examine the principles behind gap penalty and time complexity calculation which is crucial for you to apply current bioinformatic tools in your research; experience the discovery of Smith-Waterman algorithm with Dr. Michael Waterman himself.Sequence Database SearchUpon completion of this module, you will be able to: become familiar with sequence databse search and most common databases; explore the algoritm behind BLAST and the evaluation of BLAST results; ajdust BLAST parameters base on your own research project.Markov ModelUpon completion of this module, you will be able to: recognize state transitions, Markov chain and Markov models; create a hidden Markov model by yourself; make predictuions in a real biological problem with hidden Markov model.Next Generation Sequencing (NGS): Mapping of Reads From Resequencing and Calling of Genetic VariantsUpon completion of this module, you will be able to: describe the features of NGS; associate NGS results you get with the methods for reads mapping and models for variant calling; examine pipelines in NGS data analysis; experience how real NGS data were analyzed using bioinformatic tools. This module is required before entering Module 8.Functional Prediction of Genetic VariantsUpon completion of this module you will able to: describe what is variant prediction and how to carry out variant predictions; associate variant databases with your own research projects after you get a list of variants; recognize different principles behind prediction tools and know how to use tools such as SIFT, Polyphen and SAPRED according to your won scientific problem.Mid-term ExamThe description goes hereNext Generation Sequencing: Transcriptome Analysis, and RNA-SeqUpon completion of this module, you will be able to: describe how transcriptome data were generated; master the algorithm used in transcriptome analysis; explore how the RNA-seq data were analyzed. This module is required before entering Module 9.Prediction and Analysis of Noncoding RNAUpon completion of this module, you will be able to: Analyze non-coding RNAs from transcriptome data; identify long noncoding RNA (lncRNA) from NGS data and predict their functions.Ontology and Identification of Molecular PathwaysUpon completion of this module, you will be able to: define ontology and gene ontology, explore KEGG pathway databses; examine annotations in Gene Ontology; identify pathways with KOBAS and apply the pipeline to drug addition study.Bioinformatics Database and Software ResourcesUpon completion of this module, you will be able to describe the most important bioinformatic resources including databases and software tools; explore both centralized resources such as NCBI, EBI, UCSC genome browser and lots of individual resources; associate all your bioinformatic problems with certain resources to refer to.Origination of New GenesUpon completion of this case study module, you will be able to: experience how to apply bioinformatic data, methods and analyses to study an important problem in evolutionary biology; examine how to detect and study the origination, evolution and function of species-specific new genes; create phylogenetic trees with your own data (not required) with Dr. Manyuan Long, a world-renowned pioneer and expert on new genes  from University of Chicago.Evolution function analysis of DNA methyltransferaseUpon completion of this case study module, you will be able to: experience how to use bioinformatic methods to study the function and evolution of DNA methylases; share with Dr. Gang Pei, president of Tongji University and member of the Chinese Academy of Science, the experiences in scientific research and thought about MOOC.Final ExamThe description goes here\n                                    ", 
    "end_date": "2016-09-12T00:00:00Z", 
    "title": "Bioinformatics: Introduction and Methods 生物信息学: 导论与方法", 
    "price": 0, 
    "instructors": "Ge Gao 高歌 and Liping Wei 魏丽萍", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/bioinformatics-pku", 
    "duration": "14 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}