{
    "selfpaced": false, 
    "topic_name": [
        "Bioinformatics"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course. \n\nThe purpose of this course is to enable students to analyze and interpret data generated by modern genomics technology, specifically microarray data and next generation sequencing data. We will focus on applications common in public health and biomedical research: measuring gene expression differences between populations, associated genomic variants to disease, measuring epigenetic marks such as DNA methylation, and transcription factor binding sites.\n\nThe course covers the necessary statistical concepts needed to properly design experiments and analyze the high dimensional data produced by these technologies. These include estimation, hypothesis testing, multiple comparison corrections, modeling, linear models, principle component analysis, clustering, nonparametric and Bayesian techniques. Along the way, students will learn to analyze data using the R programming language and several packages from the Bioconductor project.\n\nCurrently, biomedical research groups around the world are producing more data than they can handle. The training and skills acquired by taking this course will be of significant practical use for these groups. The learning that will take place in this course will allow for greater success in making biological discoveries and improving individual and population health.\n\nBefore your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.\n\n                                    ", 
    "end_date": "2014-06-09T00:00:00Z", 
    "title": "PH525x: Data Analysis for Genomics", 
    "price": 0, 
    "instructors": "Michael Love and Rafael Irizarry", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.edx.org/course/harvardx/harvardx-ph525x-data-analysis-genomics-1401", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-04-07T00:00:00Z"
}