{
    "selfpaced": false, 
    "topic_name": [
        "Bioinformatics"
    ], 
    "description": "\n\n                    \n                    \n                    This free online course will provide healthcare professionals with a basic grounding in genomic medicine. It will introduce you to new genomic technologies, which are revolutionising medicine and will, in time, provide the mainstay of patient diagnosis, treatment and disease prevention.\n\nDiscover the potential of genetics in healthcare\n\nThe course will give you an awareness of genomic technologies and the data they generate. With ready access to genomic data promised by transformational NHS initiatives such as the 100,000 Genomes Project, genomic data will be integral to all sectors of medicine.\n\nBy the end of the course, you will understand the power and the challenges associated with these new technologies and data, enabling you to make appropriate referrals and evidence-based management decisions, and use genomic results for patient benefit, without compromising patient safety.\n\nLearn with experts in clinical genetics and education\n\nThe course draws on the experience of experts in clinical genetics and education at St George’s, University of London, St George’s University Hospitals NHS Foundation Trust and the Genomics Education Programme from Health Education England.\n\nAs clinical geneticists who undertake diagnosis and care of patients with genetic conditions on a regular basis, the course educators are able to explain the relevance of novel technologies to clinical practice both now and in the future.\n\nDemonstrate your continuing professional development (CPD)\n\nThe course has been approved for distance-learning continuing professional development (CPD) by the:\n\n\n  Royal College of Physicians (RCP): for 10 Category 1 (external) CPD credits.\n  Royal College of Paediatrics and Child Health (RCPCH): from 09 October 2015 to 09 October 2017, for a total of 10 CPD credits.\n  Royal College of General Practitioners (RCGP): for 10 hours of CPD activity.\n\n\nTo qualify for these CPD credits, you will need to buy a Certificate of Achievement as evidence of completing the course. This online course was created in May 2015 and revised in October 2015.\n\nContinue learning with the Genomics in Healthcare program\n\nThis course is the first of three in the Genomics in Healthcare program from St George’s, University of London. Completing all of the courses will enable you to study genomic technologies at a postgraduate level, whether for CPD or as a gateway to further study.\n\n\n                                    ", 
    "end_date": "2016-10-17T00:00:00Z", 
    "title": "The Genomics Era: the Future of Genetics in Medicine", 
    "price": 0, 
    "instructors": "Shereen Tadros, Katie Snape and Kate Tatton-Brown", 
    "institution_name": [
        "St. George's University"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/the-genomics-era?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-12T00:00:00Z"
}