{"selfpaced": false, "topic_name": ["STEM"], "description": "\n\n                    \n                    \n                    Technology is everywhere, if we like it or not. And nearly all future jobs require us to understand it. To respond to this, governments are including computing in national curricula for students of all ages. In the UK already every primary school teacher has to teach computing concepts and in many other countries more and more of us will be required to teach computing or at least integrate computing concepts, ideas and processes into our teaching. So let's get ready for this.\r\nIf you are a primary school teacher who needs ideas, tools or resources on how to teach computing, this MOOC is here to help you. We will be exploring the ideas, concepts, processes and skills that are important in computing and then introduce you to the tools and resources that can help you teach these concepts and processes in the classroom.\r\nThe course is designed as an introductory course, for you to use as a starting point to explore some of the ideas and tools further. It is relevant to primary school teachers of all levels of experience. A basic amount of knowledge on operating computers and other technology devices is expected but you don't need prior knowledge of computing. The course lasts for 5 weeks and requires around 2 hours of work per week.\r\nThe course has been designed by teachers for teachers and will feature interviews, presentations, and activities from teachers, professors, students and computing professionals.\r\nEnrol in the course and join the discussion on our social media channels via the Facebook group and Twitter using #CScourse.\r\nThis course is an adapted version of the How to Teach Computing: An Introduction to Concepts, Tools and Resources for Secondary Teachers course. If you have previously participated in this course you will be familiar with a number of sections of the course for primary teachers.\n\n                                    ", "end_date": "2015-05-25T00:00:00Z", "title": "How to Teach Computing: An Introduction to Concepts, Tools and Resources for Primary Teachers", "price": 0, "instructors": "", "institution_name": ["European Schoolnet Academy"], "commitment": "", "subject_name": ["Education & Teaching"], "course_url": "http://www.europeanschoolnetacademy.eu/web/how-to-teach-computing-", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Independent"], "start_date": "2015-04-20T00:00:00Z"}