{"selfpaced": false, "topic_name": ["STEM"], "description": "\n\n                    \n                    \n                    This is a hands-on workshop that explores various strategies that middle and high school teachers can use to integrate engineering practices into science lessons and laboratory\ninvestigations that they already do. We will start by comparing and contrasting the research methods employed by scientists and engineers, then demonstrate ways that teachers can facilitate, sequence, and assess lessons designed to help students understand and apply engineering principles. These principles include learning to (1) design within constraints, (2) analyze and interpret data, (3) construct models, and (4) conduct iterative tests. Upon completing this course, teachers will possess a deeper understanding of engineering and be able to effectively teach engineering processes to their students.\n\n                                            Syllabus\n                        Week One: Learning from FailureOne of the best ways to introduce and understand engineering practices is by studying real-life examples, including what went wrong. We'll look at some famous engineering failures (and successes) and explore teaching applications.Week Two: Science and Engineering ThinkingThe Next Generation Science Standards explicitly call out the differences between science and engineering. We'll use exhibits from the Exploratorium museum floor to illustrate some of these differences, and ask you to re-imagine your own science activity from an engineering perspective.Week Three: Modeling ActivitiesA hallmark of the Exploratorium Teacher Institute is that we have developed lots of \"snacks\" over the years: hands-on teaching activities (thoroughly tested by students and teachers) that explore scientific phenomena using easy-to-obtain materials. This week, we'll share some of our favorites and ask you to try them out at home. Week Four: Develop Your Own Engineering ActivityIt's your turn! Take what you've learned in the class and create your own mini-lesson. You can adapt one of our activities or come up with your own and get feedback and tips from other students in the class.\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Re-Engineering Your Science Curriculum", "price": 0, "instructors": "Linda Shore, Eric Muller, Julie Yu and Paul Doherty", "institution_name": ["Exploratorium"], "commitment": "3-4 hours", "subject_name": ["Education & Teaching"], "course_url": "https://www.coursera.org/course/teachengineering", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-04-06T00:00:00Z"}