{"selfpaced": false, "topic_name": ["Artificial Intelligence"], "description": "\n\n                    \n                    \n                    Have you ever wanted to build a new musical instrument that responded to your gestures by making sound? Or create live visuals to accompany a dancer? Or create an interactive art installation that reacts to the movements or actions of an audience? If so, take this course!\n\nIn this course, students will learn fundamental machine learning techniques that can be used to make sense of human gesture, musical audio, and other real-time data. The focus will be on learning about algorithms, software tools, and best practices that can be immediately employed in creating new real-time systems in the arts.\n\nSpecific topics of discussion include:\n\n• What is machine learning?\n\n• Common types of machine learning for making sense of human actions and sensor data, with a focus on classification, regression, and segmentation\n\n• The “machine learning pipeline”: understanding how signals, features, algorithms, and models fit together, and how to select and configure each part of this pipeline to get good analysis results\n\n• Off-the-shelf tools for machine learning (e.g., Wekinator, Weka, GestureFollower)\n\n• Feature extraction and analysis techniques that are well-suited for music, dance, gaming, and visual art, especially for human motion analysis and audio analysis\n\n• How to connect your machine learning tools to common digital arts tools such as Max/MSP, PD, ChucK, Processing, Unity 3D, SuperCollider, OpenFrameworks\n\n• Introduction to cheap &amp; easy sensing technologies that can be used as inputs to machine learning systems (e.g., Kinect, computer vision, hardware sensors, gaming controllers)\n\n\n                                            Syllabus\n                        Session 1: Introduction What is machine learning? And what is it good for?\r\nSession 2: Classification This session will cover fundamentals, how to use Wekinator for classification, and an introduction to classification algorithms: kNN, Decision trees, AdaBoost, SVM.\r\nSession 3: Regression In this session we will discuss the fundamentals of regression, using Wekinator for regression, and neural networks for more complex types of models.\r\nSession 4: Dynamic Time Warping In this session you will learn what dynamic time warping is and what it's useful for, as well as how to use Wekinator for dynamic time warping.\r\nSession 5: Sensors &amp; Features Part I: Basic Signal Processing For Learning This session will cover retrieving data from devices: Streaming data vs events; Smoothing noisy signals; Throttling, downsampling, and upsampling; First and second order differences; Buffering &amp; chunking.\r\nSession 6: Sensors &amp; Features Part II: Intro To A Few Fun/Popular Types Of Sensors &amp; Sensing Systems This session will introduce Kinect, Leap, and basic physical computing sensors such as accelerometers, gyros, FSRs, ultrasonic distance sensors, and photosensors.\r\nSession 7: Wrap Up This session will provide a wrap up for the course, and will discuss practical tools, books, and resources students can access for furthering their work in this field.\n                                    ", "end_date": "2016-03-23T00:00:00Z", "title": "Machine Learning for Musicians and Artists", "price": 0, "instructors": "Rebecca Fiebrink", "institution_name": ["Goldsmiths University of London"], "commitment": "", "subject_name": ["Computer Science"], "course_url": "https://www.kadenze.com/courses/machine-learning-for-musicians-and-artists/info", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Kadenze"], "start_date": "2016-02-03T00:00:00Z"}