{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>If you are not seeing the email channel as a money making machine, you have the wrong strategy </em><strong>~ Hans Smellinckx </strong></p><p>A recent study conducted by the <em>The Radicati Group</em>, a technology research firm, shows that there are <strong>3.9 BILLION</strong> accounts. They predict that this number wlll grow to 4.9 BILLION by 2017.</p><p>They say email is the Jason Bourne of online apps: somebody's always trying to kill it. It can't be done. So it's safe it assure <strong>we still have email marketing for a long time</strong>.</p><p><strong>List building is probably the fastest and most secure method of creating a stable source of recurring income. </strong></p><p>My name is <em>Max </em>and I'm a <strong>list builder.</strong> I've been collecting email addresses since 2009. I've always known about the relevance of <strong>owning your own list </strong>and the window of possibilities that opened when you start building yours, but It wasn't until I got the chance to <em>see email marketing from the inside </em>that I decided to do something about it. </p><p><em>For 3 years</em> I worked as the <em>educational content publisher </em>and <em>support team manager</em> of an <em>email service provider</em> (ESP) in the Netherlands called<strong> INinbox. </strong>Once of the benefits of working there is<strong> getting an unlimited account</strong>, with unlimited subscriber and unlimited emails with no costs associated. I've been building my lists with that account, and up until this date I have <strong>over 85.000 subscribers</strong> combined. </p><p><strong>Working at an ESP, and building my own lists </strong>has given me a lot of insight into the rightful practices of email marketing. <em>What tools to use, what emails to send, where to publish your forms, how to drive in traffic, how to maximize open rates</em> and a lot of other questions have been answered along the hand of years of experience. </p><p>I'm now one of the teachers and co-founders of <em><strong>iMarketXL</strong></em>, an education brand focused on providing our students the <strong>essential skills</strong> needed to build an entire <strong>online business</strong> from scratch.</p><p>In our latest addition to our teaching palette, list building is going to provide you with all the tools, resources and strategies needed to <strong>start building your own lists</strong> in a unique and comprehensive <strong>3 phase process </strong>in which you will see me build yet another list of subscribers from scratch.</p><p><em>Every day in which you're not building you list is a wasted one.</em> Don't waste another one, start building your list <strong>TODAY. </strong></p>", 
    "end_date": null, 
    "title": "(NEW) Complete 2016 List Building & Email Marketing Course", 
    "price": "35.00", 
    "instructors": "iMarket XL, Max Stryker", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502938_59d8.jpg", 
    "course_url": "https://www.udemy.com/build-your-list/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T13:49:54Z"
}