{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Do you want to double or triple the conversion rate of your sales copy? Great, because in this course, I’ll show you 10 proven &amp; tested hacks that work right now!</p>    <p>You’ll learn these strategies to acquire more customers and get better<em> </em>results almost overnight!</p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Learn Proven Tricks from 6-Figure Copywriters Like Jay Abraham </strong></p>    <ul><li>Boost your conversion rates </li><li>Acquire more customers </li><li>Grow your revenue &amp; business</li></ul><p><br><strong>Contents &amp; Overview</strong></p>    <p>This course will introduce you to 10 Copywriting Hacks that work in 2016.</p><p> First, we’ll cover the art &amp; science of headlines that convert in lesson No. 1. We even provide you with a headline swipe file, which includes top performing headlines, allowing you to boost your conversion rate immediately. </p>    <p>Next, we’ll cover how to use something called a ‘grabber’ to get the attention of your audience as well as the correct way of using testimonials in your sales message. <br> <br> Then, I’ll show you how to appeal to the Life-Force 8, how to inject scarcity, and how to use a 100% free tool to double your sales copy conversion rate (hint: what you are about to discover is something copywriting legends charge thousands of dollars for).</p>    <p>Moreover, I’ll introduce you to the concept of ‘Action Words’ to stir emotions and how to showcase the value of your physical or digital product to make the price appear more attractive. <br> <br> Last but not least, you’ll discover why you have to offer a 90-days refund guarantee and how to incorporate FAQ’s in your sales copy to answer common objections potential buyers have.</p>", 
    "end_date": null, 
    "title": "10 Copywriting Hacks That Work in 2016", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/770920_ca86_2.jpg", 
    "course_url": "https://www.udemy.com/10-copywriting-hacks-that-work-in-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-22T19:45:14Z"
}