{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Start getting more action from your email list! But first, let me ask you a question...</p>\n\n<p><strong>Have You Ever Been Frustrated Because You’re Getting Lackluster Email Marketing Results?</strong>\n\n  </p>\n\n\n\n<p>Face it. You can be the best email marketer on the planet. And you can have the best intentions in the world, with the best subscribers you could ever ask for.\n\n  </p>\n\n\n\n<p>But if you don’t get enough clicks, or make enough sales? Then you’ll never make email marketing work.\n\n  </p>\n\n\n\n<p><strong>So Ask Yourself How This Would Feel.</strong>\n\n  </p>\n\n\n\n<p>How would it feel if instead of being sad and discouraged because your email marketing isn’t working, you suddenly were getting 10x more results with your same email marketing list?\n\n  </p>\n\n\n\n<p>So you could finally be awesome to your subscribers, and even increase sales, and your authority and reach shot through the roof at the same time?\n\n  </p>\n\n\n\n<p>Would that feel good? So you could finally get powerful results with your email marketing list??\n\n  </p>\n\n\n\n<p><strong>If That's The Case, You're Going To Love This Course!</strong>\n\n  </p>\n\n\n\n<p>So you can tap into these 10 awesome methods to get more juice from your current list.\n\n  </p>\n\n\n\n<p>Not only that, but you'll increase sales, and get more clicks, without being a jerk to your subscribers.\n\n  </p>\n\n\n\n<p><strong>So How Much Is This Course Worth?</strong>\n\n  </p>\n\n\n\n<p>Well, if you hired an email marketing expert to optimize your campaigns then it would easily cost you at least a few hundred bucks. Probably, a few thousand bucks.\n\n  </p>\n\n\n\n<p>Plus there's the time aspect of it. Imagine if you spent years of your life studying email marketing like I have? How much is your time worth?\n\n  </p>\n\n\n\n<p>Plus, you get free lifetime updates, so you can agree you're getting in for a pittance of its true value!\n\n  </p>\n\n\n\n<p>If any of this sounds good, then I'll see you on the inside!\n\n  </p>\n\n\n\n<p><strong>At This Point You Have Two Choices...</strong>\n\n  </p>\n\n\n\n<p>You can continue doing what you're doing now. Keep failing with your email marketing, and get lackluster results. But be honest, how has that been working so far?\n\n  </p>\n\n\n\n<p>Or, you can enroll in this course. So you can finally use these 10 awesome email marketing optimization hacks, so you can get more from your existing list. Your future is bright. And I'm so confident in your ability to succeed!\n\n  </p>\n\n\n\n<p><strong><em>Enroll Now So You Can Finally Deploy These 10 Awesome Ways To Increase Sales And Clicks With Your Email Marketing List!</em></strong></p>", 
    "end_date": null, 
    "title": "10 Cool Ways To Get More Action From Your Marketing Emails", 
    "price": "20.00", 
    "instructors": "Mike DeVincent", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/825842_7c41_3.jpg", 
    "course_url": "https://www.udemy.com/10-cool-ways-to-get-more-action-from-your-marketing-emails/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-19T07:58:03Z"
}