{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Are You Frustrated Because You're Not Sure What To Send To Your Email List?</strong><br></p>\n\n<p>Have you ever been annoyed, because when you sat down to write an engaging email to your subscribers, you drew a big fat blank?</p>\n\n\n\n<p>Or maybe you're sick and tired of sending promotion after promotion, and you're just not connecting with your list?</p>\n\n\n\n<p>Do you feel bad that you're not connecting with your subscribers, and you never send them anything cool?</p>\n\n\n\n<p>Have you ever felt like there has to be more to email marketing and list building - but you're just not able to build that rapport, prestige, authority, and respect that you hoped you could achieve?</p>\n\n\n\n<p><strong>Are You Just A Churn And Burn Marketer? Or Are You Seeking Something More?</strong></p>\n\n\n\n<p>You probably realize by now that email marketing can be the best thing for your business, if only you had awesome content ideas to share with your subscribers!</p>\n\n\n\n<p>You know that emailing your subscribers frequently is a genius idea - but you're just not sure what to send!</p>\n\n\n\n<p>It's not fair to your end users when you send promotion after promotion, and maybe you're annoyed that you haven't sent an email to your subscribers all week, or all month?</p>\n\n\n\n<p>Maybe you want to provide better content, but you're just not sure where to start?</p>\n\n\n\n<p><strong>If That's The Case, You're Going To Love This Course!</strong></p>\n\n\n\n<p>I know what it's like when you just don't have enough high quality content to send to your list.</p>\n\n\n\n<p>See, I've struggled in the past developing good content ideas to share with my subscribers.</p>\n\n\n\n<p>That's why you're going to cherish this course...</p>\n\n\n\n<p>Because I'm sharing with you 15 different content ideas that you can deploy to your subscribers starting today!</p>\n\n\n\n<p>This is a comprehensive list, my private \"goto\" list of 15 content ideas that you can use over and over again, and your subscribers will actually thank you for it.</p>\n\n\n\n<p><strong>How Would It Feel If You Had A Raging River Of Email Content That Was Adored?</strong></p>\n\n\n\n<p>Imagine if you finally knew what to send to your subscribers, and it wasn't just lame one off promotions?</p>\n\n\n\n<p>How would it feel if your subscribers knew you, liked you, and trusted you?</p>\n\n\n\n<p>Would it feel good to send emails to your list that they actually enjoyed reading?</p>\n\n\n\n<p>If that's the case, I truly believe you're going to love this course.</p>\n\n\n\n<p><strong>Enroll In This Course If You Want To Provide Value To Your Subscribers!</strong></p>\n\n\n\n<p>You realize by now if you can benefit from this course.</p>\n\n\n\n<p>If you're sick and tired of not emailing your subscribers because you're not sure what to send, or even worse, if you're a \"churn and burn\" marketer looking for a better way, enroll in this course now!</p>\n\n\n\n<p>I'm confident that you'll enjoy, and I'll see you on the inside!<br></p>\n\n\n\n<p><strong><em>Enroll Now So You Can Immediately Build Massive Authority And Relationships With Your Subscribers! Works In All Industries, In Any Niche, And Even Helps To Generate Email Sales!</em></strong></p>", 
    "end_date": null, 
    "title": "15 Cool Ways To Interact With Your Email Subscribers", 
    "price": "20.00", 
    "instructors": "Mike DeVincent", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648604_895e_2.jpg", 
    "course_url": "https://www.udemy.com/15-cool-ways-to-interact-with-your-email-subscribers/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T06:34:07Z"
}