{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>&gt;&gt;150 New Students in the 1st hour &amp; 600 new students in 24 hours!&lt;&lt;</strong></em><br></p><p>Learn simple and tactful methods on writing emails to <strong>boost your open rates</strong> and <strong>trigger your subscribers</strong> to be interested with your offer all the time!</p><p><strong>You can do this effortlessly without annoying your subscribers.</strong></p><ol><li><em>How to write Promotional Emails - Examples, Ideas and Best Practice!</em></li><li><em>Marketing With Scarcity: How You Can Apply The Most Effective Selling Technique</em></li><li><em>How to Write Effective Email Marketing Content</em></li><li><em>How to Write Last Call Email and Create a Sense of Urgency</em></li><li><em>And the list goes on..</em></li></ol><p><strong>A Powerful Skill at Your Fingertips </strong></p><ul><li>You've heard about the importance of using email marketing in your business, but perhaps you haven't gotten started with email marketing yet?</li><li>Have you struggled to find an effective email marketing strategy?</li><li>You want the massive leverage that email marketing provides, but just need someone to guide and mentor you, <strong>step-by-step</strong>?</li><li>You see a lot of different opinions about email marketing and listbuilding but aren't sure where to turn for authoritative advice about email marketing?</li></ul><p><strong>All of this information and more is included for you in this course!</strong> Take this course now to get lifetime access with no risk backed by Udemy's 30 day money back guarantee!</p><p>In this course, you will discover the power of email marketing to dramatically increase sales for your business - for ANY kind of business!</p><p>I walk you through <strong>step-by-step</strong>, giving you a chance to <strong>watch over my shoulder</strong>,<strong> </strong>from a 15 year veteran of the email marketing world, how the expert and profitable internet marketers <strong>Attract Buyers</strong>!</p><p>You've got absolutely <strong>nothing to lose</strong> and so much to gain!<br></p><p><strong>Act on your feelings of love, hope, and faith to gain access to everything you need to be successful with email marketing! Take this course now!</strong><br></p>", 
    "end_date": null, 
    "title": "15 Of The Best Email Marketing Techniques You've Ever Seen ", 
    "price": "40.00", 
    "instructors": "Pat Robinson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/717362_3f26_7.jpg", 
    "course_url": "https://www.udemy.com/emailmarketing2016/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-05T18:02:00Z"
}