{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is designed to teach you the core skills that you will need to master blogging on the social web in a digital world. </p><p>Why can I help you achieve a lifestyle business built on a online platform.</p><p>Since launching my blog 6 years ago with only a $10 investment in my domain name, I learnt the art and science of attracting traffic without paying Google and Facebook a cent, I also perfected the skills for creating content that went viral and built global credibility and trust.</p><p>Along the way I collected a loyal and passionate tribe of nearly 400,000 Twitter followers.</p><p>The last step was to turn that traffic, trust and engagement into leads and sales. Today I travel the world speaking and have a lifestyle business that gives me freedom and financial independence.</p><p>I have had nearly 20 million visitors since launching and today my blog receives over 5 million views a year.</p><p>I will reveal how achieve to blogging success based on real life and business lessons from years of blood sweat and tears. </p><p>This course shows you how to build a digital platform that can take you to new heights of creativity, global engagement and business opportunity.</p><p>We will also show you how to create an online business from your knowledge from your own blog.</p><p>You will learn how to share your story with the world  in a way that will build trust and credibility.</p><p>It's your time to share your knowledge with a world that needs your inspiration.</p><p><br></p>", 
    "end_date": null, 
    "title": "7 Key Steps to Blogging Mastery", 
    "price": "50.00", 
    "instructors": "Jeff Bullas", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559886_e803.jpg", 
    "course_url": "https://www.udemy.com/7-key-steps-to-blogging-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T23:50:55Z"
}