{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul>  \t<p>  \t\t                  <strong><strong>**This course is completely updated and tailored to help you achieve great results in 2016! Let's make this year a great one guys**</strong></strong></p><p>I will offer Skype support to any student who asks for it. Send me a private message and we will set up a time for the call.  \t</p>  \t<p>  \t\t  Over 13,000 students have witnessed real-life changes as a result of taking (and acting upon) our courses. You could be next!</p>  </ul>  <p>  \t<em><em>-------------------------------------------------------------------------------------------------------------</em></em>  </p>  <p>  \t<strong>Would you like to learn how to craft great articles for your blog, freelance endeavor, or to drive traffic to your website ?</strong>  </p>  <p>  \t                            Would you like me to teach you the secrets and little known techniques to achieve this is no time at all ?  </p>  <p>  \t                            Can you follow the easy instructions I will lay down for you to increase your writing speed, quality and earnings?  </p>  <p>  \t                            If you answered « yes » to any of the questions above, congratulations. This course is definitely for you.  </p>  <p>  \t                            Let me help you !  </p>  <p>  \t                            In this course,I will teach every step of the process. This course also comes with an ebook to help breeze through the course.  </p>  <p>  \t                            Better yet, the learning curve for this course is very short.  </p>  <p>  \t                            ·Do you need/want more visitors to your website?  </p>  <p>  \t                            ·Do you have a passion for writing, and would like to turn this passion into money?  </p>  <p>  \t                            ·Are you busy and want to get things done as fast as possible?  </p>  <p>  \t                            ·Do you want your articles to rank higher in search engines, and be picked up by more readers than you can count?  </p>  <p>  \t                            If you answered « yes » to <em>these </em>questions, then consider <strong>this course to be your blueprint to success.</strong>  </p>  <p>  \t                            Having a great website, blog or product starts with making it look as good as possible, and beautiful prose is how you achieve this.  </p>  <p>  \t                            Upon enrolling, you will get my personal help. I will answer any question that you may have in the member's area, and I also offer Skype support if needed.  </p>  <p>  \t                            I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk !  </p>  <p>  \t                            You can get started right after you have taken my course -That means <em><em><strong>TODAY!</strong></em></em>  </p>  <p>  \t                            Click the \"Take This Course\" button now. That's your first step to becoming an expert freelancer, blogger, or article marketer. Every minute that goes by without action is one potential reader gone forever.  </p>  <p>  \t                            Cheers!  </p>  <p>  \t                            Howard  </p>", 
    "end_date": null, 
    "title": "Article Marketing For Entrepreneurs: Drive Sales and Traffic", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359812_f098_3.jpg", 
    "course_url": "https://www.udemy.com/write-great-articles/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T16:42:22Z"
}