{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Creating and producing content is the best way to drive organic traffic online. If you want to attract more visitors and customers, you'll need to be great at delivering outstanding content. The problem is, making great content is extremely difficult and time-consuming.</p><p>Until now!</p><p>In this course, you'll learn how to:</p><ul><li>Conduct keyword research to find what people are actually searching for, and use it to plan out a content blueprint. </li><li>Learn and evolve from your current audience with surveys and analytics data.</li><li>Look like a professional by creating quality images, audio and video</li><li>Produce content quickly and efficiently</li></ul>    <p>This course contains over 30 lectures and 3 hours of content. It's designed for anyone who wants to generate traffic to your website, blog or business</p><p>By the end, you'll have valuable skills that will help you generate an endless number of content ideas. How to dissect and figure out what your audience does and doesn't want. And then how to take all of that research and build standout content in less time than you ever thought possible.</p><p>I'll also be there to help answer any questions that you have. Anything you need to become a content marketing rockstar, I'll be there to assist you any way that I can!</p><p>Sign up now to receive lifetime access to this course, and learn how to generate thousands of new visitors you can market and sell to for years to come!</p>", 
    "end_date": null, 
    "title": "Become a Content Marketing Rockstar!", 
    "price": "20.00", 
    "instructors": "Ryan Wiley", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/602688_f50a_4.jpg", 
    "course_url": "https://www.udemy.com/become-a-content-marketing-rockstar/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-04T18:24:42Z"
}