{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Please Note:</strong> Google News made a change in April 2015 which greatly reduced the traffic they send to small news publishers. It is much harder for small publishers to make any money and I do NOT recommend this course to those of you who are new to news and looking for a way to make income online. Those who are already running a news site may find some useful information here. Those starting out should check out HeckYeah dot org for ideas on how to acquire revenue generating websites.</p><p>  \t    This course will teach you how to make money by becoming a Google News approved news source. A relatively tiny number of websites have the distinction of being syndicated by Google News and this course will teach you how to build a simple website and get accepted by Google.  </p>  <p>  \t    Created with absolute beginners in mind, students are guided through every step of the process, from choosing your domain name to sourcing a hosting package and right through to comprehensive WordPress skills.  </p>  <p>  \t    Every hour of every day, Google News articles earn hundreds of thousands of clicks from all over the world and generate spectacular revenues for their respective site owners. This course will take you through every step required to appear in Google News, ideally on the very first page.  </p>  <p>  \t    Successful Google News sites have the potential to earn hundreds of dollars each day because the appear in the Google News portal. You can enter the world of Google News in your time and at your own pace, using an easy step-by-step approach with no specific time constraints.  </p>  <p>  \t    News Chest is quite simply the web's most comprehensive resource on the subject of building, running and selling Google News Sites for maximum returns.  </p>  <p>  \t    As a secondary source of revenue or a new career direction outright, Google News Mastery could be your ticket to the big time.  </p>", 
    "end_date": null, 
    "title": "Become a Google News Publisher - Get your Site Approved Now", 
    "price": "45.00", 
    "instructors": "Jeff Hunt", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311670_8f7f_4.jpg", 
    "course_url": "https://www.udemy.com/become-a-google-news-publisher-get-your-site-approved-now/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T17:44:22Z"
}