{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong></strong><strong>Better Blogging and Wordpress Strategies</strong> is an all-in-one training course for your business or personal brand. Starting with detailed instructions for Wordpress installation, learn how successful bloggers are able to consistently produce a steady stream of high-quality content to <strong>maximize online exposure</strong>.  </p>  <p>  \t<em><strong>    I’ll walk you through every step of the process</strong></em>, which includes going through my pre-blog checklist, making offline preparations, writing your first blog post, detailed instructions for <strong>installing Wordpress, creating an editorial calendar and posting schedule, search engine optimization, understanding web analytics and lots more.</strong>  </p>  <p>  \t        When done effectively, blogging allows you to demonstrate your expertise in your given field and legitimizes your organization to users online. <strong>Avoid common pitfalls</strong> that plague many beginning bloggers by following the steps carefully outlined in this comprehensive course. By utilizing best blogging practices from the start, <em><strong>you can build your blog on a solid foundation that will support your overall online presence and raise awareness for your business or brand.</strong></em>  </p>  <p>  \t<strong>    Think of me as your blogging personal trainer, as I hold your hand through the process.</strong> Through the members dashboard, you can even ask me specific questions. For beginners, you’ll receive the guidance you need to get started from scratch. For intermediate-level bloggers, this course will help you drop bad blogging habits and set you on the right track to <strong>blogging success</strong>. And with updates scheduled to be maintained regularly, this can truly be described as a “living training course” that grows with you.  </p>  <p>  \t<em>“Lisa is able to explain even the most technical details in way that is easy to understand. This course is packed with helpful pointers that can only have been attained through years of professional experience. She makes it feel like she’s going through the process with you, guiding you every step of the way.”</em>  </p>  <p>  \t<strong>-<a href=\"https://www.linkedin.com/in/michaelprieve\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Michael Prieve</a> / Editor-In-Chief, Celebuzz.com at SpinMedia, Inc.</strong>  </p>", 
    "end_date": null, 
    "title": "Better Blogging & Wordpress Strategies for Business & Brands", 
    "price": "25.00", 
    "instructors": "Sociable Video Training, Lisa Timmons", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/195276_c165_6.jpg", 
    "course_url": "https://www.udemy.com/betterblogging/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-07T20:06:13Z"
}