{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  Blogging is an integral part of any social media strategy. Your blog becomes your own corner of the social web by helping you contribute original content and add fresh updates to your social media platforms.  </p>  <p>  \t  Blogging can help you:  </p>  <ul style=\"\">  \t<li>Market your business</li>  \t<li>Establish yourself as a thought leader</li>  \t<li>Get the word out about your causes</li>  \t<li>Become more attractive to potential employers</li>  </ul>  <p>  \t<strong style=\"\">But where do you start? </strong>  </p>  <p>  \t<strong style=\"\">Which blogging platform should you use?</strong>  </p>  <p>  \t<strong style=\"\">What should you blog about?</strong>  </p>  <p>  \t<strong style=\"\">For that matter, what the heck is a blog?</strong>  </p>  <p>  \t  Blogging for Success assumes nothing – providing anyone with the knowledge and confidence to plan a successful blog right out of the gate.  </p>  <p>  \t  This course offers an introduction to the technology behind a blog and explores the different blogging platforms available.  </p>  <p>  \t  The course demonstrates types of blogs and blogging styles, as well as appropriate writing tones for specific audiences.  </p>  <p>  \t  Join author and new media expert Deltina Hay as she helps you plan a successful blog by demonstrating real-world examples, and guiding you in answering critical blogging questions.  </p>  <p>  \t  Blogging for Success also shows you how to create good web content for your blog. The course explores how people read online content, and shows you how to make your content easier to read and more likely to get noticed.  </p>  <p>  \t  The course also takes a look at ethics issues like copyright concerns, disclaimer and disclosure statements, and codes of ethics relevant to your profession and your industry.  </p>  <p>  \t  Included as a special bonus is the introduction to Deltina&#039;s WordPress.com Essentials course, and a full lesson from that course about starting your blog using WordPress.com.  </p>  <p>  \t  Worksheets and resources included!  </p>  <p>  \t<strong style=\"\">Don&#039;t put that blog off any longer. Take the course today, and plan the blog you&#039;ve always wanted.</strong>  </p>", 
    "end_date": null, 
    "title": "Blogging for Success: How to Plan the Perfect Blog", 
    "price": "20.00", 
    "instructors": "Deltina Hay", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206596_4bb5_4.jpg", 
    "course_url": "https://www.udemy.com/blogging-101/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-28T16:07:37Z"
}