{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong></strong></p><p><strong>Become a published author and blog your book in 30 days</strong></p><p><strong>Is this the year that you write your book?</strong></p><ul><li>Do you long to be an author but don't think you have the time?</li><li>Do you have lots of content that could be turned into a book?</li><li>Could you write a blog for 30 days that could be used for your bookk?</li><li>Have you already written a book and want to maximise it's reach by blogging it?</li></ul><p><strong>If the answer is yes, then this course is for you. In just 30 </strong>days,<strong> you could take the content from your blog (and a few other places) and turn that into a book that you sell on Amazon.</strong></p><p>Planning and getting really clear about what the right book is will make becoming a published author and blogger so much easier. This course helps you to</p><ul><li>Develop the right idea</li><li>Create a brilliant and easy to follow outline</li><li>Design a chapter framework</li><li>Get you ready to write to first draft</li><li>Blog your book in 30 days</li><li>Create compelling content</li><li>Edit to final draft</li><li>Publish on Amazon's Kindle</li><li>Re-purpose your book and re-blog it to build your personal brand</li></ul><p>In this course, you will learn how go from no idea through to blogging your book, how to use the content from your blog to create a book.</p><p>You will also learn how to deconstruct your book and blog it either for the first time or again.</p><p>You will be given resources and plans to make the whole process easy and stress-free.</p>Already a published author?<p>You may already have a book and want to promote it via your blog, if that is the case, then this course is also for you.</p><p>You will become a published author in no time at all.</p>", 
    "end_date": null, 
    "title": "Blog your book in 30 days - become a published author", 
    "price": "20.00", 
    "instructors": "Jacqui Malpass", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393976_edb8_2.jpg", 
    "course_url": "https://www.udemy.com/blog-your-book-in-30-days/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T14:06:37Z"
}