{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong></strong><strong></strong><strong>UPDATED April 2016: </strong><strong> </strong>My Udemy courses have been taken by 1,000s of students and have been awarded 100s of positive reviews. <br></p>\n\n<p><strong>My “WHY” – </strong>You know that feeling you get when you help someone? I want to feel that way 1,000,000 times.<strong> </strong></p>\n\n<p><strong><em>Come with me on a journey to increasing your blog traffic without Advertising</em></strong><br></p>\n\n\n\n<ul><li>Are you blogging and not getting enough organic traffic?</li><li>Are you producing consistent content and feel like no one is reading your content?</li><li>Do you want to increase your blog's organic traffic by 153% or more ?</li></ul>\n\n\n\n<p>If you answered YES to any of the above question, this course is for you. May be you are blogging for money or blogging for business, this course will teach you the strategies I have used to <strong>increase website traffic</strong> for 100s of clients. I have covered specific tools and processes I have used in last 10 years. This course covers these main areas</p>\n\n\n\n<p><strong>A) Producing compelling blog content</strong></p>\n\n\n\n<ol><li>How to find popular topics in your niche and write what your readers want to read </li><li>What tools you can use to optimize your content for readers and Google (SEO) </li></ol>\n\n\n\n<p><strong>B) How to promote your blog using strategies like</strong> </p>\n\n\n\n<ol><li>Social media marketing </li><li>Email outreach and marketing </li><li>Content repurposing </li><li>Content curation </li><li>Communities websites</li></ol>\n\n\n\n<p><strong>C) How to measure your efforts &amp; increase blog traffic</strong></p>\n\n\n\n<ol><li>Use google analytics to find hidden opportunities </li><li>How to identify whats already popular with your blog readers  </li></ol>\n\n\n\n<p>After taking this course you will know exactly how to increase your blog traffic by 153% or more. I have used these steps to produce results for several clients and I will share the real life case studies (and examples) with you<br></p>\n\n<p><strong>Enroll now and lets start this journey together! </strong></p>", 
    "end_date": null, 
    "title": "Blogging For Business: 3x Traffic Without Ads", 
    "price": "20.00", 
    "instructors": "Ali Mirza", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582744_5d83_4.jpg", 
    "course_url": "https://www.udemy.com/blog-organic-traffic/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T05:30:01Z"
}