{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Are you looking to increase free traffic to your website or course landing page?  Do you want to learn simple content marketing, lead generation and inbound marketing strategies so you can sell more services, courses and books without spending a fortune?</strong>  You are in the right place because this high quality and interactive course by Louise Anne Maurice of 90 Day Guru E-Learning was created for you and <strong>recently updated April 1, 2016.</strong></p>\n\n<p><strong>Content Marketing for Coaches, Consultants, Online Teachers and Authors </strong><strong>is for you if:</strong></p>\n\n\n\n<ul><li>You are currently a Kindle Author, Udemy Instructor, Life Coach or Consultant and see the potential of <strong>knowing how to use Inbound Marketing Strategies to sell more books, courses and services</strong> but you want the best step-by-step guidance for how to get started.</li><li>You want <strong>Lead Generation best practices, content marketing strategies and simple formulas for making an inbound marketing plan that you'll follow</strong> and have already been tested and proven to work.</li><li>You would like <strong>free and simple ways to get more traffic to your book page, course page and website that will boost your book sales, paid course and program enrollments.</strong></li><li>You would like to know how you can use content marketing to build your expert status and to take advantage of <strong>free traffic to your website, sales pages and book pages.</strong></li><li>You are ready to develop an inbound marketing plan but just need to know the <strong>content marketing and lead generation</strong> foundation pieces so you feel more confident that you are doing it right.</li></ul>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong>Why take <strong>Content Marketing for Coaches, Consultants, Online Teachers and Authors</strong>?</strong></p>\n\n\n\n<ul><li>This is why you are here because you want to know about <strong>Inbound Marketing specifically for Kindle Authors, Udemy Instructors, Life Coaches and Consultants.</strong> </li><li>The best part is; every piece of advice, strategy and logical approach to content marketing and lead generation has been tested; none of this is theory.</li></ul>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong>What is covered in</strong> <strong><strong>Content Marketing for Coaches, Consultants, Online Teachers and Authors</strong>?</strong></p>\n\n\n\n<ol><li>Learn inbound marketing, content marketing and lead generation strategies to increase free website traffic so you can sell more books, courses and services.</li><li>Discover inbound marketing sales strategies for Kindle Authors, Udemy Instructors, Coaches and Consultants that drive traffic to your website, book or course page</li><li>Develop a content marketing strategy to easily sell more books, courses and services without spending thousands of dollars</li><li>Walk away with Lead Generation Strategies and Ways to Increase Website Traffic for Authors, Online Teachers, Life Coaches and Consultants who don’t want to spend thousands on marketing but want to sell a ton of books, courses and services.</li><li>Receive step-by-step content creation strategy that can then be leveraged for video marketing, article marketing, website marketing, blog marketing, webinar marketing and podcast marketing.</li><li>Lead generation coaching and consulting that can help you develop your inner skills so you can confidently create content and sell that content fearlessly.</li><li>Follow a simple formula to apply what you have learned about inbound marketing, content marketing, lead generation and increasing traffic to your website.</li></ol>\n\n\n\n<p>****************************************************************************************************************</p>\n\n\n\n<p><strong>How does</strong> <strong><strong>Content Marketing for Coaches, Consultants, Online Teachers and Authors</strong> benefit you?</strong></p>\n\n\n\n<ul><li>I understand <strong>inbound marketing that sets you up for success</strong>. I have owned an online business since 2009.</li><li>In this course, you learn the exact steps you need to know to use <strong>content marketing so you can develop an inbound marketing plan that you can follow for success. </strong></li><li>You get lead generation and website traffic insights that only a professional with my background can give you.</li><li>You get the <strong>inside track </strong>on what you need to do to succeed online plus what you need to do to follow through.</li><li>If that's something you would like to achieve, you have selected the right course to take. If you complete this entire course and <strong>implement everything you learn you will have a completed inbound marketing plan and content marketing plan </strong>that you can follow.</li><li>Remember, it doesn't matter if you are new or already in full swing, I've been there and I can show you exactly what you need to do to make it happen.</li></ul>\n\n\n\n<p>****************************************************************************************************************</p>\n\n\n\n<p><strong>When Can You Take </strong><strong>Content Marketing for Coaches, Consultants, Online Teachers and Authors</strong><strong>?</strong><strong></strong></p>\n\n\n\n<ul><li>What are you waiting for? If you’re looking for a course to learn content marketing strategies that increases free traffic to your website using inbound marketing and lead generation insights, then look no further.</li><li>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</li><li>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; <strong>NO EXTRA COST TO YOU.</strong></li><li><strong>REMEMBER</strong>: If you are not completely satisfied, you can get a full money back refund, so long as you request it within 30 days of purchase – No questions asked.</li><li>Click on the <strong>\"Take This Course\"</strong> button and start learning instantly</li></ul>\n\n\n\n<p>****************************************************************************************************************</p>\n\n\n\n<p>Still not convinced? Make sure you watch some of the <strong>FREE PREVIEWS</strong> available to learn more about the course and more about me your instructor. Plus you can check out some of the reviews. Here is just one of the many examples:</p>\n\n\n\n<p><strong>What people are saying about <strong>Content Marketing for Coaches, Consultants, Online Teachers and Authors</strong> created by Louise Anne Maurice of 90 Day Guru E-Learning?</strong></p>\n\n\n\n<p><em>\"Excellent marketing course with great examples and material. Thank you for mapping out the plan and making this really simple to follow. I know when I really enjoy a course because I am so involved in the lectures and do the exercises. The best part - the instructor is there to help me, the course is always up-to-date and I can take this course as many times as I want.\"</em></p>\n\n\n\n<p>****************************************************************************************************************</p>", 
    "end_date": null, 
    "title": "Content Marketing for Coaches Consultants Teachers Authors", 
    "price": "20.00", 
    "instructors": "90 Day Guru® E-Learning, Louise Anne Maurice", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/561948_a9ea_5.jpg", 
    "course_url": "https://www.udemy.com/inbound-marketing-content-marketing-lead-generation-traffic/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-22T19:59:48Z"
}