{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>Learn The Secrets To Becoming A World Class Content Marketer!</strong></em></p><p>Do you find yourself struggling to attract visitors or an audience to your website or online business?</p><p>Are you sitting at your desk wondering how other people are able to build an email list and get thousands of visitors to their site with such ease?</p><p>Do you want to learn the strategy that every significant website owner is investing in to grow their audience and increase their reach?</p><p>That strategy is... Content Marketing.</p><p>People using the web are looking for valuable content that solves their problems.  People want to be educated and entertained.  People want to consume information about the things they are interested in.</p><p>And you can build a significant online presence by creating that content! </p><p>It doesn't matter if you have a small site or a team of people working for you, you can achieve more authority and credibility in your niche by delivering the information that your intended audience wants.</p><p>This course will teach you how to be that trusted advisor and how to be the \"go to\" source of top information in your niche.</p><p>In my Easy Content Marketing for Wordpress course you'll learn:</p><ul><li>How to create a content marketing strategy</li><li>How to find and reach your ideal audience</li><li>How to pick the right content medium for you</li><li>How to build a content marketing machine</li><li>How promote your content and grow your audience</li></ul><p>Most importantly, what you'll learn in this course will help you build a bigger audience and grow your website traffic and your brand to new heights.</p><p>Content Marketing is not a magic bullet. It takes time, hard work and dedication to get results which means this course is not for everyone.  If you're looking for \"hacks\", \"shortcuts\" or \"black hat tips\" then this course is not for you.</p><p>However, if you're interested in getting results, if you're willing to put in the effort required then this course will show you how to reach total strangers on the internet and turn them into visitors, leads and customers all via the power of content marketing.</p><p>I am going to share with you my 10+ years of hard earned experience in various forms of content marketing to help shorten your path to success.</p><p>We all know that content marketing strategies and technologies are moving fast and it can be very hard to keep up to date on everything that's happening.</p><p>And that's something that I'm going to solve for you by regularly updating this course with new videos. As changes happen in the content marketing landscape or some new tactic appears that can help you get better results, I'll break it down for you in simple and easy to understand ways.</p><p>This course is backed by Udemy's 30 day guarantee and my personal promise that for just a small investment of your time, you'll be shocked at just how much you'll grow your audience and extend your authority in your chosen market.</p><p>Enroll now and start your journey to becoming a well respected trusted authority because of the great content you're producing!<span></span></p>", 
    "end_date": null, 
    "title": "Content Marketing for Wordpress: Build a Website Audience", 
    "price": "20.00", 
    "instructors": "Sean Kaye", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497262_94c5_2.jpg", 
    "course_url": "https://www.udemy.com/easy-wordpress-content-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-09T01:26:09Z"
}