{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Content Marketing is the only form of marketing that will work in the 21st Century.</p><p>Recently, we have seen companies grow from <strong>zero to millions</strong> of dollars purely as a result of the content they produce.<span></span></p><p>Everyone knows that<strong><em> putting out great content translates into sales and success</em></strong> and yet people find it so difficult. So many business-people struggle with this great – and FREE – opportunity to grow their businesses.</p><p><em>By the end of this course you will be able to create content that WORKS!</em></p><p>My name’s Rob Cubbon. My website has received over 1,500,000 visitors and has signed up over 25,000 email subscribers in the last 5 years. All as a result of the content I produce. I have not spent a penny on advertising or on any other form of promotion. </p><p>This course will show you <em>how to identify the best content types and subjects</em>, create great content and communicate with an audience so you can <strong>turn them into customers</strong>. </p><p>I will show also you all the <em><strong>technicalities</strong></em>. I will show you exactly how to craft an attractive blog post in WordPress. And I will show you how to make your site optimized for social sharing as well as optimized for search engines like Google.</p><p>This course is for anyone who wants <strong><em>FREE CUSTOMERS!</em></strong> </p><ul><li>Have you tried various types of content marketing before? </li><li>Haven’t seen any tangible results? </li><li>Think you \"can't\" do it?</li></ul><p>This is the course that will show you how easy it is to produce great, engaging, sharable content. And how to enjoy doing it.  </p>", 
    "end_date": null, 
    "title": "Content Marketing: Attract Customers With Zero Advertising", 
    "price": "30.00", 
    "instructors": "Rob Cubbon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565228_01fa.jpg", 
    "course_url": "https://www.udemy.com/content-marketing-get-customers-with-zero-advertising/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T16:05:25Z"
}