{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Almost every adventure travel company will be doing “content marketing” in some form or another, even without knowing it. If you’re maintaining social media, sending out an email newsletter or running a travel blog, that’s all content marketing. But it’s not content <strong>strategy</strong>.</p><p>The clue is in the name: this course is about doing all those things <em>strategically</em>, avoiding channel overload and tactical confusion. Most importantly it’s about understanding our goals and how to measure them.</p><p>Although “content marketing” has been much discussed over recent years, there are still huge questions around how content strategy can be done effectively, and how its results and outcomes should be measured.</p><p>In this course we explore how content marketing is done properly, and how to bring it all together into a unified content strategy.</p><p><br></p><p><strong>About AdventureEDU Educator Matthew Barker</strong></p><p>Matthew Barker is a U.K. based digital marketing consultant and strategist specializing in travel and destination marketing. He is head of strategy at I&amp;I Travel Media which sits at the nexus of digital publishing and travel consumer marketing, working on content strategies for tourism brands and providers of all sizes. His work deals with the challenges of creating and delivering content to hard-to-reach audiences in an ever noisier environment, in nurturing audiences into sales and in using robust analytical methodologies to measure these processes and their returns to a high degree of accuracy.</p><p>He is a semi-permanent traveller who has spent much of the past 10 years working in four continents, is a frequent speaker at industry events and discussions and is regularly published in the trade media. He is also a co-founder of Outbounding .org, a community of prominent travel writers, publishers and bloggers.</p>", 
    "end_date": null, 
    "title": "Content Marketing Strategy For Adventurous Brands", 
    "price": "50.00", 
    "instructors": "AdventureEDU .", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657984_03f0.jpg", 
    "course_url": "https://www.udemy.com/content-marketing-strategy-for-adventurous-brands/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T17:44:42Z"
}