{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Content marketing is the act of creating free high quality content which delivers value to your target audience, enabling you build trust , rapport and authority. Relationship building is key to any sales process and using an effective content marketing strategy you will be able to establish you and your brand as authorities within your Niche.</p><p>Many start ups, business owners, entrepreneurs and creative professionals are aware that content marketing is the way forward but lack a clear vision of how to get started, others know how to get started and are well aware of the benefits but put off doing it because they are afraid the workload will be overwhelming.</p><p>The truth is delivering outstanding content is time consuming - however having a solid understanding of the basics and having a solid planning framework to follow makes the process significantly easier. </p><p>Content Marketing Mindset provides you with a solid framework which will lay the foundations for you having a solid practical working knowledge of how to plan and launch, analyze , grow, outsource and automate the entire process.</p><p>You will learn:</p><ul><li>How To Identify Your Target Audience</li><li>What A Customer Avatar Is</li><li>How To Build An Avatar</li><li>Find Out Where Your Customers Hangout Online</li><li>Find Out How Your Customers Behave Online</li><li>Find What Your Customers Aims Are Online</li><li>Find What Stops Your Customers Taking Action</li><li>What The Relationship Is Between Social Media And Content Marketing</li><li>Why You Need A Content Plan</li><li>How To Create Your Awesome Content Plan</li><li>What A Content Hub Is And Why You Need One</li><li>How To Use Social Media To Distribute Your Content</li></ul><ul><li>What Kind Of Content Works Best On Each Platform</li><li>What Makes Each Social Media Platform Unique</li><li>How To Grow Your Campaign Using Analytics</li><li>How To Use Facebook Fanpage Analytics</li><li>How To Use Twitter Analytics</li><li>How To Use Google Analytics </li><li>How To Amplify Your Campaign X 10 </li><li>How To Find Top Influencers In Your Niche To Work With</li><li>How To Prepare To Submit A Guest Post To A Top Influencers High Authority Blog</li><li>How To Outsource Guest Posting To High Authority Blogs For Just $5</li><li>How To Automate The Process Using Software </li></ul><p>As well as the video content you will also receive a 20 page guide to creating a content plan called \"Your Awesome Content Plan\" - which breaks the process down even further.</p><p>I am also available to help all of my students who are welcome to contact me directly with any questions they may have related to this course, social media or content marketing in general.<br></p><p>All Students are invited to join our secret VIP Facebook group \"Social Media Marketing Lounge\" where I will providing further training, updates, free software and eBooks, invites to exclusive events only available to group members.</p><p>Sociocaster Founder  Adi Suandharu has been kind enough to give every student who takes this course a basic Sociocaster account - which is worth $37! Sociocaster is multi platform social media management tool which will make automating your content marketing campaign significantly easier! </p><p><br></p>", 
    "end_date": null, 
    "title": "Content Marketing Mindset", 
    "price": "20.00", 
    "instructors": "Gary O'Toole", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/799816_9504.jpg", 
    "course_url": "https://www.udemy.com/content-marketing-mindset/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T15:09:16Z"
}