{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Build Your Email Marketing List and Sales Funnels With ConvertKit By Taking This Easy Course Packed With Useful Information So You Can Succeed! This course is taught by email marketing experts Phil Ebiner and Dennis Smith.</strong></p>\n\n<p><strong></strong><strong><em>Email Marketing is not dead. Read below to find out why it is more effective than Facebook and Twitter. Start list building today with ConvertKit.</em></strong></p><p><strong></strong></p><p><strong></strong></p>\n\n\n\n\n\n\n\n<p><strong>Latest ConvertKit Course Review:</strong></p><p><strong>Well done content, talking from a real experience, everything needed to start taking advantage from the excellent e-mail list service portal. Additional bonuses like how to create funnels (with examples!) are just a cherry on a pie.<br></strong></p><p><strong><em></em></strong><strong></strong><strong>*****  BRAND NEW! 1ST UDEMY COURSE ON CONVERTKIT *****</strong><br><strong>30 Day 100% Risk Free Offer!</strong></p>\n\n\n\n\n\n\n\n<p><strong></strong>✔ <strong>Easy to Learn Material</strong><br>✔ <strong>5 Reasons ConvertKit Is Better</strong><br>✔ <strong>Email Marketing Gets Better Customer Engagement Than Facebook</strong><br>✔<strong> Email Marketing is very affordable in cost!</strong><br>✔ <strong>New Udemy Email Marketing Course!</strong></p>\n\n\n\n\n\n\n\n<p>Did you know know email marketing is not dead? Here's some stats that prove that marketing your business using email is stronger than ever. Check out these stats and see why you should be taking this course and learning how <strong>ConvertKit</strong> can help you achieve results.</p>\n\n\n\n\n\n\n\n<ul><li>According to a recent survey email is 40 times more effective for marketers than Facebook and Twitter. Now that's a serious ass kicking when it comes to marketing your business.</li><li>Studies have also found that the average order is about 17 percent higher than those that come through social media sites such as Facebook.</li><li>No better way to build an audience of clients or customers. By consistently offering valuable content, you build loyal followers.</li><li>With an ROI of around 4,300% (according to the Direct Marketing Association), email almost pays for itself, not to mention the fact that it's “eco-friendly.\"</li><li>Email marketing is still the most cost-effective way of promotion.</li><li>You can track email data easily and watch your response rates as they climb or fall.</li><li>Higher engagement means higher conversion rates that boost your bottom line.</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>Here's what we will cover in this Udemy course...</strong><br>Learn how to setup your ConvertKit account, imports subscribers from MailChimp, Aweber, Constant Contact and other email marketing apps. Then you will learn how to create your first forms, build email sequences and send out your first Broadcast email marketing campaign. This course will also cover some email marketing tips to build a list of followers including lead magnets and successful funnels..</p>\n\n\n\n\n\n<p><strong><em>Don't forget to check out the free preview lectures to sample my course. </em></strong>Are you ready to learn with Phil and I? </p>\n\n\n\n\n\n<p><strong>By the end of this course students will know:</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>What ConvertKit Is</li><li>How-to get your ConvertKit account setup</li><li>How-to create forms and landing pages</li><li>How-to send out your first Broadcast Message</li><li>How-to read ConvertKit reports</li><li>Building a Sales Funnel</li><li>Winning Lead Magnets</li><li>Tips for growing your own mailing list</li><li>Email Marketing Advice</li><li>ConvertKit Recommended but not needed to take this course</li></ul>\n\n\n\n\n\n\n\n\n\n<p>Don't wait another day to start building your list.<br><strong>CLICK \"TAKE THIS COURSE\" TO GET STARTED NOW!</strong></p>", 
    "end_date": null, 
    "title": "ConvertKit - Email Marketing for Online Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Dennis J. Smith, Phil Ebiner", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699524_dbfc_3.jpg", 
    "course_url": "https://www.udemy.com/convertkit/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-16T23:12:43Z"
}