{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Let me share my copywriting secrets with you.</strong>  </p>  <p>  \t      Copywriting can boost your sales, improve your market penetration <em style=\"\">and</em> your margins. Good copywriting can do a whole lot better. And world class copywriting can transform your performance out of all recognition. I’m going to show you how.  </p>  <p>  \t<strong style=\"\">A unique insider’s view</strong>  </p>  <p>  \t      I&#039;ve been a top copywriter for  30 years or more, with clients ranging from startups to major corporations. Names like IBM, Vodafone, Lloyds, PricewaterhouseCoopers, the BBC , Travlex, Oracle, one of the world&#039;s top business schools, a number of big pharma companies and lots in the financial services arena. Not to mention one of TV&#039;s Secret Millionaires.  </p>  <p>  \t<strong style=\"\">A shoulder to lean on</strong>  </p>  <p>  \t      Just like my other courses, I&#039;m always available to answer your queries, or to explain things further, usually within 24 hours; I love to help. And, just like my other courses, this one will grow over time as students suggest new topics. It&#039;s a  LIVING course that’s yours for life.  <strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">How is this course <em style=\"\">different</em>?</strong>  </p>  <p>  \t      There are lots of great courses on copywriting. Pity they never get much further than sales copy. They bang on about the consumer when there’s a whole, profitable B2B marketplace out there.  </p>  <p>  \t      In this course, I focus on a whole range of business copywriting. Sales copy?  Sure, in spades. But I also cover things like press releases. How to write them and what to DO with them once you have written  them. Like getting published.  </p>  <p>  \t      We&#039;ll look in detail at how to write case studies, web copy that’s optimized, White Papers, and how to become a Voice in Your Industry - where editors will actively seek  out your expertise. And I&#039;ll introduce you to the most powerful sales-lead generation secret  of all time. Complete with real-life examples. That&#039;s something else you get in this course, real-life examples to download, so you can see for yourself  how the finished article  looks  and how it feels.  </p>  <p>  \t<strong style=\"\">Who’ll benefit?</strong>  </p>  <p>  \t      Who will benefit? Well, entrepreneurs and start-ups. Small business owners, of course. And so will any person responsible for their company&#039;s marketing; wanting to improve their skills and their promotion prospects. And finally, anyone who&#039;s taken my course <em style=\"\">How to Become a Successful Freelance Copywriter, Working from Home</em>. This course will really boost your business writing skills.  </p>  <p>  \t      And remember, this is a Udemy course, so you have the security  of a no-quibble, 100% money-back guarantee. You&#039;ve nothing to lose, so join me right now in what I can promise will be a fascinating journey.  </p>", 
    "end_date": null, 
    "title": "Copywriting secrets - How to write copy that sells", 
    "price": "20.00", 
    "instructors": "Len Smith, Sean Kaye", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325666_fe45_2.jpg", 
    "course_url": "https://www.udemy.com/copywriting-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T13:47:01Z"
}