{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<h5 style=\"\"><span style=\"\">Why Copywriters are the Smartest People Online</span></h5>  <p style=\"\">Not long ago everyone wanted to work at home because of the &ldquo;pajama draw&rdquo;. The idea of getting up when you want to, working in your pajamas and avoiding the traffic jams does have its appeal.</p>  <p style=\"\">Nowadays people are working online for the large income opportunities that far outweigh a limited global job market.</p>  <p style=\"\">Many fail&hellip;sad&hellip; The reason they fail is blatantly obvious; their sales copy was either written by them or someone that has no idea what they are doing.</p>  <p style=\"\">Those that succeed <strong style=\"\">use professional copywriters.</strong> Words matter! Whether it is a simple email campaign or a 6 page sales funnel, copy sells&hellip; not the product.</p>  <p style=\"\">The online marketing world is a gold rush. &nbsp;One thing always stays the same, in any gold rush, boom, bubble, secular ascent, whatever you want to call it, there comes a point where an inordinate amount of money begins flowing towards those selling the shovels, no matter if the diggers are getting rich or not. <em style=\"\"><strong style=\"\">Copywriters are selling shovels.</strong></em></p>  <h5 style=\"\">Two Reasons to become a Copywriter</h5>  <p style=\"\"><em style=\"\">&nbsp;<strong style=\"\">1.)&nbsp;&nbsp;&nbsp; You want to be among the top internet entrepreneurs - not counted among the mass of failures.</strong></em></p>  <p style=\"\"><strong style=\"\"><em style=\"\">&nbsp;2.)&nbsp;&nbsp;&nbsp; The absurd amount of money copywriters make causes you to drool.</em></strong></p>  <h5 style=\"\">How are We Going to Make You a Pro-Copywriter?</h5>  <p style=\"\">Step by step this course will transform you from someone who writes copy to a sought after, knowledgeable and effective pro-copywriter. You will learn:</p>  <ul style=\"\">  <li style=\"\"><strong style=\"\">Direct Response for print and web.</strong></li>  <li style=\"\"><strong style=\"\">Building your portfolio.</strong></li>  <li style=\"\"><strong style=\"\">Effective email marketing.</strong></li>  <li style=\"\"><strong style=\"\">Scripting for radio, tv and web video.</strong></li>  <li style=\"\"><strong style=\"\">Mastering the elusive call to action that kills.</strong></li>  <li style=\"\"><strong style=\"\">Managing your copywriting business.</strong></li>  <li style=\"\"><strong style=\"\">Take your pick of the highest paying jobs.</strong></li>  </ul>  <p style=\"\">We will teach you how to brand yourself into high demand. We turn down most job offers and you will too! It does not matter if you are brand new or a seasoned writer.</p>  <p style=\"\">This comprehensive course will <strong style=\"\">reveal EVERY tactic</strong> learned over the past 25 years of successful copywriting. Not only will they be revealed, they will be mastered by you to ensure maximum success in one of the most lucrative independent careers.</p>  <p style=\"\"><strong style=\"\">Take a look at the lectures below to see some of the great things you will learn&hellip;</strong></p>", 
    "end_date": null, 
    "title": "Copywriting for Pros", 
    "price": "50.00", 
    "instructors": "Mike Collins, Scott Stembridge", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20282_4537_5.jpg", 
    "course_url": "https://www.udemy.com/copywriting-for-pros/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-28T17:02:29Z"
}