{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>There’s a highly overlooked strategy to grow your business…one that most business owners overlook.</strong></p><p>Every day, you and I have a million different options on how we can grow our businesses:\n</p><ul><li>Find more traffic</li><li>Convert more customers</li><li>Build more products</li><li>Redesign our website</li><li>Split-test our confirmation page</li></ul><p>And on and on.\n</p><p>When faced with this infinite number of choices, what do we do?\n</p><p>A little bit of everything!\n</p><p><em>“I know…I’ll start a Twitter account…then post on my Facebook page a couple times a week…and try to promote myself on Tuesdays…”</em></p><p>Pretty soon, we wake up and notice we’re jumping from tactic to tactic. No time to focus. No time to go deep on the things that matter. It’s no surprise that we’re tempted by clickbait articles like “10 ways to grow your business.” As if another shiny tactic will help.\n</p><p>The truth is, you’ll always have an overwhelming number of options to grow your business. It’s your job to decide on the most important levers to pull — the ones that move the needle — and say “no” to the ones that can wait until later.\n</p><p>Which is why I want to challenge you on something you might be overlooking.\n</p><p>Other business owners think about building the best product, designing a beautiful website, and creating awesome customer service. All good things.\n</p><p>In fact, you might have the best product, the best web design, even the best customer service. But what’s the first thing a potential customer sees?\n</p><p>It’s not your product. It’s not your whiz-bang technology. It’s not your customer service.\n</p><p>The first thing that anyone sees in your business is what they read on your website and your emails.\n</p><strong>The first thing they see is your<br>copywriting</strong><p>Nothing else comes close. Your copywriting is truly the “tip of the spear” — the first cut, the one that matters. It is what your users see. It drives what they feel.\n</p><p>But what do you see on 90% of other websites?\n</p><p>The same copy. The same hype. The same generic BS. Everyone shouting the same over-the-top promises in ALL CAPS.\n</p><p>And the worst part is, that me-too copy isn’t even you. If you actually sat down with someone — a reader, a customer, a friend — and had a real conversation with them, you could help them as one real person to another. But somehow, when you write something online, it turns into the same Frankenstein language that everyone else uses.\n</p><p><em>“With products ranging from X to Y, we are committed to world-class excellence and stand behind —” ZZzzZZzzZ.</em></p><p><em>“Lose 20lbs using our Fast-Fast-Loss Formula” — Scam.</em></p><p><em>“Breathe. Love. Live.” — What the hell is this?</em></p><p>Great copy doesn’t sound like some stilted business school professor, scammy internet marketer, or airy-fairy headband-wearing life coach wrote it. It sounds natural (because it IS natural — like the words you’re reading right now!).\n</p><p>And when you get it right, you connect. You go beyond just transactions or mechanical A/B tests and connect emotionally with your audience. You can make a Call to Action — to read, comment, or even buy — and people WANT to do it. They’re delighted to. They’re waiting for someone to ask!\n</p><p>No, you don’t have to be some professional writer to do this.<br>Writing isn’t some mutant power that a lucky few are born with. It’s a skill you can learn.\n</p><p>No, you don’t need to be a master of split testing, either.<br>I’ve already done millions of dollars worth of testing and can share my results with you.\n</p><p>YES — once you write copy that’s “good enough,” you can move on.<br>And you’ll reap the rewards for years to come — automatically. </p>", 
    "end_date": null, 
    "title": "Copy Mindsets: Mastering the Inner Game of Copywriting", 
    "price": "20.00", 
    "instructors": "Basim Salim", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766508_98c2_2.jpg", 
    "course_url": "https://www.udemy.com/copy-mindsets/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T13:15:35Z"
}