{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>You know bad writing when you see it. You know that bad writing is flowery and verbose and full of convoluted sentences. You know that bad writing is filled with typos, grammatical mistakes, inconsistencies and poor reasoning.</p>\n\n\n\n\n\n<p><strong>But do you know what bad copywriting looks like? </strong>Do you know bad copywriting when you see it, or when you write it? This course teaches you the ten most common blunders that new and amateur copywriters make. </p>\n\n<p>I’m Alan Sharpe, and I’m your instructor. I’ve been writing copy, and I’ve been teaching other folks how to write copy, since 1989. I’ve seen all of these mistakes, and I’ve even made a few of them myself.<br></p>\n\n\n\n\n\n<p>The main benefit of taking this course is that you’ll learn how to spot the ten most common mistakes that wreck otherwise good copy. Once you learn them, you’ll avoid them.\n\n  </p>\n\n\n\n\n\n<p>You and I are going to look at 10 copy killers. Here they are: </p>\n\n<ol><li>Slow in getting to the point</li><li>No single-minded proposition</li><li>No logical flow</li><li>Redundancies</li><li>Generalities</li><li>Features only</li><li>Navel gazing</li><li>Claims without proof</li><li>No offer</li><li>No call to action</li></ol>\n\n\n\n\n\n<p>Some of these mistakes you already know about, and you don’t make them anymore. But a few of these blunders may have crept into your copy unawares. You’ll be glad to learn what they are, and you’ll be glad to know how to avoid ruining your copy with any of these common mistakes.\n\n  </p>\n\n\n\n\n\n<p>I designed this course mainly for aspiring copywriters and new copywriters. The perfect student is someone who is new to copywriting, and who is worried about making mistakes that make them appear incompetent. But this course is also for intermediate and senior copywriters who want to make sure their copy is clear, concise, and compelling.\n\n  </p>\n\n\n\n<p>\n\n  You’ll see from the course description that there are ten copywriting blunders to avoid. But there’s actually an eleventh mistake as well. And that’s the mistake of not taking this course. Despite what some people say, what you don’t know CAN hurt you. These copywriting blunders will wreck your copy, and sink your career. </p>\n\n<p>So take this course.<br></p>", 
    "end_date": null, 
    "title": "Copywriting Blunders: Do You Make these 10 Common Mistakes?", 
    "price": 0, 
    "instructors": "Alan Sharpe", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/872210_0da3.jpg", 
    "course_url": "https://www.udemy.com/copywriting-blunders-do-you-make-these-10-common-mistakes/", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-08T10:32:08Z"
}