{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course, I share lessons I've learned in over 30 years of writing. What is the number one mistake that writers repeat over and over - not understanding their audience! Great copy starts with an understanding of your audience.</p>\n\n<p>It takes a little extra work up front. But, it makes the actual writing easier, more authentic and more effective.</p>\n\n<p>I don't' care if your objective is to get more opt-ins, more conversions, more readers or simply to communicate clearly. The way to achieve these goals starts with the Audience.</p>\n\n<p><strong>Why is the Course so Short?</strong></p>\n\n<p>Don't mistake the length of the course with the value. I've taken many classes that had 20 or 30 hours of lecture. I mistakenly thought this made the course a good value – in some kind of dollars per hour formula. Let's see: $99 for 30 hours, that's only $3.30 per hour - what a deal!</p>\n\n<p>In most cases, I never completed the course because there was too much filler material that was of little value.</p>\n\n<p>In hindsight, maybe I should have looked for the shortest course - one focused on my exact need. It might also indicate lessons presented quickly and efficiently.</p>\n\n<p><strong>Why Did You Create This Course</strong></p>\n\n<p>In the Instructor Description, I chose the words: copywriter, inventor, and entrepreneur. I could have included a lot more hats I've worn. If you're curious, read more in the bio section at the bottom.</p>\n\n<p>There's nothing I enjoy more than sharing lessons I've learned. When I decided to create an online course, I considered the various roles I've occupied:</p>\n\n<p>Executive<br>Project Mgmt<br>Logistics<br>Pricing <br>Finance<br>Marketing<br>Innovation<br>Intellectual Property Mgmt</p>\n\n<p><strong>Finding Your Passion</strong></p>\n\n<p>I even created a logical decision matrix to determine the sweet spot of where my interest intersected with a market opportunity. The decision matrix is a tool I've used for years when faced with making a decision in a complex environment with multiple variables.</p>\n\n<p>These sorts of matrices should always be used as a suggestion, not as an absolute. The top rated item in my matrix was some sort of business/financial analysis. But after I started down that path, I quickly realized my heart just wasn't' there.</p>\n\n<p>What was the flaw in the matrix? One of the rating factors was interest (passion) for the topic. Perhaps I should have given that factor a much higher weighting. (Of course, there is always a risk that one is simply fudging the weighting factors to reach a conclusion that agrees with a gut feel.)</p>\n\n<p>Any solo-business endeavor requires a tremendous amount of work. You really need to find a topic that you're passionate about. If you're just choosing a business idea because it makes sense on paper, that's risky.</p>\n\n<p>I decided writing was my passion even though it wasn't the perfect logical decision on paper. Writing was the only activity where I consistently found the ability to become totally immersed, and then look at the clock and wonder, “Where did the morning go?\"</p>\n\n<p><strong>Why Should You Trust Me?</strong></p>\n\n<p>Just because I love writing, does that mean I'm an expert? More importantly, does it mean I can teach you anything about writing? Note, my bio did not include advanced degrees in Marketing or Mass Communications from prestigious universities.</p>\n\n<p>However, in over 30 years of professional employment, I've been held a variety of positions, at all levels of an organization. The one constant - every job required extensive writing.</p>\n\n<p>Over 30 years ago, my first professional job assignment was to write a technical document for testing antenna systems. I produced the document on schedule per the contractual requirements. Upon later reflection, I realized what a crappy job I had done.</p>\n\n<p>Fast forward to more recent history: I was writing copy for retail packaging. In retail, you have about 5 seconds to get someone's attention. (similar to web copy) If you succeed in those first 5 seconds, you have about 30 additional seconds while the consumer reads your words on the front panel. If you're lucky they might even pull the package from the shelf and read the back for an additional 30 seconds.</p>\n\n<p>In this brief time, you have to convince them that you understand their issue and your product is uniquely capable of satisfying their need. That can be incredibly challenging.</p>\n\n<p>That's two extreme examples. Over the course of my career found myself in a variety of roles that challenged me to produce all kinds of copy:</p>\n\n<p>Web Sites<br>Blogs<br>Email Campaigns<br>Business Plans<br>Executive Briefs<br>Proposals<br>Marketing Collaterals<br>Press Releases<br>Direct Response Scripts<br>Technical Specs<br> <br> </p>\n\n<p>Whenever I had a new writing challenge, I sought advice in books, seminars, experts in the field and simply following the examples of others. I assimilated all these and got better over time.</p>\n\n<p><strong>My Methodology</strong></p>\n\n<p>Without realizing it, I was formulating my unique approach over the years. Is “my\" approach totally different from every other method on the market – of course not. You're going to find commonalities, variations and some overlap in all courses about writing.</p>\n\n<p>The trick is finding a course and instructor you can relate to, and most importantly - one that teaches lessons you will actually apply.</p>\n\n<p>Once I decided to create a course for copywriting, I had to document what I had learned and practiced over the years, in sort of a reverse engineering process. And, I had to decide what aspect of copywriting was most critical for an initial course and come up with a title.</p>\n\n<p>In all of my writing experiences, I found the most common and most critical element was an understanding of the audience. This is true for the Antenna Testing Spec I wrote over 30 years ago and also for the more recent Retail Package Copy. If I truly understood and considered the perspective and needs of the Audience, the writing would largely take care of itself.</p>\n\n<p><strong>My Objective</strong></p>\n\n<p>I created this course for people that aren't afraid of hard work, that want to learn fast, and don't have a lot of time to sit around listening to lectures.</p>\n\n<p>In short, this is the type of course I could have used years ago when I was trying to write better copy. I knew the product I was producing met the word count requirement, that's easy. But, how do I know it is going to accomplish its purpose? How do I get into the head of the reader and know how they will react?</p>\n\n<p>How often does your schedule let you take a “time-out\" to read a few books on writing techniques? Never!</p>\n\n<p>My objective for this course was to share the most valuable information as quickly as possible and let you get back to work.</p>\n\n<p>If all of this makes sense, you're probably the type of person that will benefit from LtWG – The Audience Course.</p>", 
    "end_date": null, 
    "title": "Copywriting to Connect with Your Audience", 
    "price": "45.00", 
    "instructors": "Ed Stanfield", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616660_59da_4.jpg", 
    "course_url": "https://www.udemy.com/ltwg-audience-course/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T15:32:15Z"
}