{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><span></span></p><ul><li>Over <strong>3500 happy students</strong> enrolled in my courses</li><li>Currently <strong>103 out of 124 4- and 5-star reviews</strong></li><li>No risk involved. Watch the <strong>PREVIEW VIDEOS</strong>!</li></ul>\n\n<hr>\n\n<p><strong>I'm Going To Teach You To BE A Crazy Good Copywriter</strong><br></p>\n\n<p>As a copywriter, I'm pretty sure I understand these two things about you as you review this course:</p>\n\n<ul><li>Your time is limited</li><li>You want me to get right to the point in this course description</li></ul>\n\n<p>With that in mind, let me use some simple bullet points to tell you exactly what I'm going to do to <strong>teach you to BE a great copywriter</strong>.</p>\n\n<p><em>I'm going to:</em></p>\n\n<ul><li><strong>Dig into 54 unique elements of copywriting</strong></li><li>Keep things simple and concise</li><li><strong>Show you how to use and act on ideas, not just learn them</strong></li><li>Stimulate your brain during the learning process using color and graphics</li><li><strong>Give you only the best ideas and strategies I know - I've removed any fluff</strong></li><li>Be excited to teach you this valuable and versatile skill</li><li><strong>Teach you a simple </strong><strong>system for mastering the art of copywriting</strong></li><li>Give you a professionally designed 100-page guide for you to reference</li><li><strong>Give you a professionally designed course review tool that I call <em>The Spark</em> (you're going to love this!)</strong></li></ul>\n\n<p><strong>FAQs</strong></p>\n\n<p><strong><em>Q:</em></strong> What makes <strong>The Copywriter's Brain</strong> unique from other copywriting courses?</p>\n\n<p><strong>A:</strong> <em></em>There are several elements to this course that make it very unique and different than most copywriting courses, but the core difference is that <em>it's learning <strong>system</strong></em>. Instead of simply teaching you a laundry list of ideas and strategies related to copywriting, <strong>The Copywriter's Brain</strong> uses visuals, simplicity, and a concept I call expression, in order to help you develop the mind of a copywriter. You learn the elements of the art of copywriting, see how they work, understand how they all fit together, and you drill them deep into your brain using some simple but powerful techniques that I'll teach you.</p>\n\n<p><em><strong>Q:</strong></em> Will I find value in this course, even if I don't want copywriting to be my profession?</p>\n\n<p><strong>A:</strong> <em></em><em>Absolutely!</em> Your ability to use words to excite, influence, and motivate others is a valuable skill that you can use in virtually <strong>any area of your life</strong> where your words have a huge impact on your results. Understanding how to harness the power of words (which I will teach you to do) will improve your ability to:</p>\n\n<ul><li><strong>Promote and sell anything - including yourself</strong></li><li>Drive loads of traffic to your blog</li><li><strong>Be a more effective and memorable teacher</strong></li><li>Create awesome videos for your product or service</li><li><strong>Give unforgettable presentations</strong></li><li>Communicate better with others</li></ul>\n\n<p><strong>Get Your Brain Transplant Today!</strong></p>\n\n<p>If you're ready to go beyond just <em>learning</em> about copywriting, but you want to <em><strong>think and write like a world-class copywriter</strong></em>, then join us today!</p>\n\n<p><em>This course comes with a 30-day, money-back guarantee, so try it out, you have nothing to lose!</em></p>\n\n<p>Be amazing!</p>\n\n<p>Derek</p>", 
    "end_date": null, 
    "title": "Copywriting: How To Be A Crazy Good Copywriter", 
    "price": "20.00", 
    "instructors": "Derek Franklin", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446846_3d5a_14.jpg", 
    "course_url": "https://www.udemy.com/how-to-think-and-write-like-a-copywriter/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T20:52:52Z"
}