{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">You can start a new career as a freelance copywriter......</strong></p>Just imagine, earning your living - a good living - without the hassle of commuting. Be your own boss. All you really need is a PC or Mac and a broadband connection - plus a desire to write and a bit of flair. Three months from now that could all become a reality. You will be a copywriter!<p style=\"\"><strong style=\"\">\"After just a few months I am writing sales copy for a huge experiential company, as well as technical copy for a well-respected tech-industry publication and building websites for small businesses.\" Martin Brennan.<span style=\"\"></span></strong></p><p>Unlike so many guides on the subject, it's not a jumped-up list of 'useful phrases'. It won't tell you 'how to make a million dollars overnight'. Instead it is a unique, detailed step-by-step guide to becoming a successful freelance copywriter working from home, from scratch. </p><p> <br style=\"\"> <strong style=\"\">Step by step</strong><strong style=\"\"><br style=\"\"> </strong><strong style=\"\">Follow each step and you can make between £300 ($450) a day and - with more experience - £500 ($750) a day. Not exactly a get rich quick formula, but a very respectable income. Especially for someone who is their own boss, has few overheads, doesn't have to commute to work, and chooses exactly how much or how little work they want to take on. Because my website has been live for some time now, I get more than I need and have to turn work away.</strong><br style=\"\"> <br style=\"\"> <strong style=\"\">Is it possible?</strong> <br style=\"\">Sure, and in this guide I will show you – in detail – everything you need to know. Things like:<br style=\"\">• How to begin from scratch and quickly build a portfolio<br style=\"\">• How to find clients - fast<br style=\"\">• How to market yourself<br style=\"\">• How to build a copywriter website in just five days - for free<br style=\"\">• How to find the most profitable projects and drop the rest<br style=\"\">• How much to charge<br style=\"\"> <br style=\"\"><strong style=\"\">In fact, I will even share my killer 'terms and conditions' that enable me to close more business at higher prices. I will:</strong><br style=\"\"> <br style=\"\">• Introduce you to the jargon – no getting caught out as a beginner<br style=\"\">• Show how to walk your clients through a brief, how to research topics, how to write for print and how to write for the web<br style=\"\">• We will look at different writing styles (or 'tone of voice' as the marketing people call it). <br style=\"\">• I will teach you questioning techniques for telephone interviews (I do all my work over the net and by phone) and show you some clever, low cost phone recording kit and transcription software so that you won't even have to take notes<br style=\"\">• Plus lots of tricks of the trade that save valuable time and mark you out as a real pro<br style=\"\"> <br style=\"\"><strong style=\"\">And give you stacks of links to real samples of different types of copy, templates, tick lists and so on, plus more detailed descriptions of some of the topics covered in this book (build your own free library). In fact, everything you need to get you started with confidence.</strong><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Copywriting - How to Become a Copywriter and Work from Home", 
    "price": "20.00", 
    "instructors": "Len Smith, Sean Kaye", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/12248_0b1d_12.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-copywriter-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-12-31T10:29:40Z"
}