{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Do you wonder why some businesses easily attract more clients, more sales and more sign-ups for their email lists ... while other businesses work just as hard and get nothing but headaches?<br><br>Have you written some copy that hasn't brought you the results you hoped for? <br><br>Are you getting ignored because your competitor out-performs you in marketing (even with an inferior product)? </p>\n\n<p>Would you like to become a better copywriter without investing thousands of dollars and months of your time?  </p>\n\n<p>That's what you get with this course. I've incorporated everything I use when I work with clients one-to-one.  </p><p>Imagine sitting down with a professional copywriter who will coach you create marketing materials to grow your business faster. Imagine having a pro who's looking over your shoulder, offering supportive guidance, as you write your website or sales letter.<br><br> And if you follow along and revise your own copy, your own marketing materials - your sales letters, websites, blog posts, and landing pages - will begin to attract more clients and sell more products than you ever believed possible. </p>\n\n\n\n<p>The course includes 5 easy-to-follow modules. Each module includes a series of videos with specific steps. You'll get what you need - and only what you need - to transform your marketing.<br></p>\n\n\n\n\n\n<p><strong>What are the requirements?</strong></p>\n\n\n\n\n\n<p>This course recommends that you have a computer (or laptop, tablet) and a high-speed Internet connection.</p>\n\n\n\n\n\n<p>You will benefit most if you have a specific project in mind, such as a website or sales letter, especially if you've started writing and you have a draft to revise.</p>\n\n\n\n\n\n<p><strong>What am I going to get from this course?</strong></p>\n\n\n\n\n\n<p>Over 12 lectures and 70 minutes of content!</p>\n\n\n\n\n\n<p>More clients and more sales from your sales letters and other marketing materials (if you follow the steps proactively, instead of just watching the videos)</p>\n\n<p>A higher percentage of visitors converting to prospects (and a higher percentage of prospects becoming actual buyers)</p>\n\n<p> \"Insider\" short-cuts and techniques that copywriters use to get more results with faster writing<br><br>A deeper understanding of what goes into good copywriting (so you get more value from a copywriter if you decide to hire a pro  - and you critique your own copy more objectively to grow your business faster)</p>\n\n\n\n\n\n<p><strong>By the end of the course,</strong> you'll enjoy more clients and more sales from the copy you've changed as you follow along.</p>\n\n<p>You'll understand how to write copy more effectively. Your marketing gets EASIER with every product, project and program, because these principles become second nature.   </p>\n\n\n\n\n\n<p><strong>Who should take this course:</strong><br></p>\n\n\n\n\n\n<p>Business owners who want to grow their business by getting more clients and more sales.</p>\n\n<p>Anyone who wants to become a better copywriter without spending thousands of dollars and spending several months with a copywriting training program.<br><br>Anyone who wants to learn enough copywriting to get maximum value from hiring a copywriter. </p>\n\n\n\n\n\n<p> </p>", 
    "end_date": null, 
    "title": "Copywriting For Non-Copywriters", 
    "price": "20.00", 
    "instructors": "Cathy Goodwin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/478458_5cb5_3.jpg", 
    "course_url": "https://www.udemy.com/copycritique/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T21:38:04Z"
}