{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Introduction:</strong><br></p>\n\n<p>\t In the online marketing world, well-known experts like Melanie Duncan, Amy Porterfield, and Ryan Deiss stress the importance of having a proper lead magnet to offer as an incentive for your readers to join your email list. Through months of lead magnet research for my own blogs, I've collected a ton of valuable information, checklists, and software suggestions that will make the creation process for a lead magnet easier for students of this course.</p>\n\n<p>\t<strong>The Purpose:</strong>  </p>\n\n<p>\t If you intend to grow your email list, it's imperative that you create an attractive free offer to giveaway to your website visitors in exchange for their email addresses. Creating an attractive free offer is a great way to showcase the value of what your blog has to offer.</p>\n\n<p>\t<strong>The Goal:</strong>  </p>\n\n<p>\t Create a simple PDF lead magnet that is specific to your target audience and gives value.</p>\n\n<p>\t<strong>The Intended Result:</strong>  </p>\n\n<p>\t Increase your monthly email subscriber rate.</p>\n\n<p>\t<strong> Additional Comments: </strong>  </p>\n\n<p>\t If you've done research on creating and launching a successful blog, you probably know by now (and have heard a million times) that <strong>the money is in the list.</strong>  </p>\n\n<p>\t Many beginner to intermediate bloggers don't know that there is an art to influencing people to join your email list. I've studied some of the most successful bloggers in the world to study the art of creating a lead magnet (free offer), that entices readers to give you their email addresses in exchange for this free offer.</p>\n\n<p>\t<strong> Course Structure: </strong>  </p>\n\n<p>\t This course consists of 10 initial video lessons and supplemental PDF resource guides. Additional video lessons will be added in the coming weeks to continue to add value to students.</p>\n\n<p>\t<strong>Call To Action:</strong>  </p>\n\n<p>\t Creating an attractive lead magnet is what we call \"low hanging fruit\" in the world of sales and marketing meaning it's relatively easy to accomplish. This course makes the process of lead magnet creation easy and fun.</p>\n\n<p>\t<strong>Enroll in this course today!</strong></p>\n\n<p>\tI look forward to working with you on the creation of your awesome lead magnet!</p>", 
    "end_date": null, 
    "title": "Create an Awesome Lead Magnet to Grow Your Blog Subscribers", 
    "price": "20.00", 
    "instructors": "Kari Sayers", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425342_bdc2_3.jpg", 
    "course_url": "https://www.udemy.com/calmcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T21:49:34Z"
}