{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>There are a million ways to build a website. Sometimes having so many options is paralyzing. With this course I walk you through the entire process of building a website from scratch. I&#039;ll show you every step I used to build my own website, and you can just follow along to build yours. I make all the tough decisions for you!<br style=\"\"></p><p><strong style=\"\">What is Squarespace?</strong><br style=\"\"><br style=\"\">The easiest and most cost-effective way to build a website is to use a platform. Squarespace is a template-based website platform that I use and recommend because of it&#039;s ease-of-use, beautiful templates, built-in eCommerce tools, and automatic responsive design (which is a fancy way of saying your website will look good on smart phones, tablets and desktop screens).</p><p>You can sign up for Squarespace with their 14-day free trial while you complete this course. If you&#039;re happy with your website you can sign up for one of their affordable accounts, or you can let your free account expire with no charge. I have done my research and Squarespace has very affordable and comparable pricing plans relative to competitors.</p><p><strong style=\"\">Content and Overview</strong></p><p>This is a hand-holding course. I want you to follow the course videos in order from start to finish so you&#039;ll be able to set up your Squarespace site, add pages, create an eCommerce store, a sales page, and a blog.</p><p>Every step you need to create a fully functional website is covered in this course.<br style=\"\"></p><p><strong style=\"\">Who is this course for?</strong><br style=\"\"></p><p>If you want a pretty &quot;typical&quot; website, this course if for you. A typical website includes multiple pages (Home, About, Contact) as well as an optional blog and/or eCommerce store.</p><p>This course and Squarespace is great for:</p><ul style=\"\"><li>Photographers</li><li>Artists</li><li>Bloggers</li><li>eCommerce Stores</li><li>Restaurants</li><li>Project Specific Sites</li><li>Portfolios</li><li>Musicians</li><li>Weddings/Events</li><li>Non-Profits</li></ul>", 
    "end_date": null, 
    "title": "Create a Gorgeous Website with Squarespace", 
    "price": "25.00", 
    "instructors": "Ryan Oakley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473304_98ba_2.jpg", 
    "course_url": "https://www.udemy.com/create-a-gorgeous-website-with-squarespace/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-11T04:16:49Z"
}