{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Many people in nonprofits organizations or small businesses have a positive and inspiring gift to share with the world but need to learn the skills of online marketing efficiently and practically.</p>\n\n<p>Our inspirational marketing plan course is “clear, concise, well-organized\" but also “transformational\" and “astonishing!\" It is based on the latest and proven effective marketing strategies, including content marketing and basic marketing research tips. Learn how to reach your highest potential and share your message with the world.</p>\n\n<p><strong class=\"redactor-inline-converted\">An Inspirational and Practical Guide to Marketing Your Vision Online</strong></p>\n\n<p>The course will begin with an overview of the importance of content marketing, a new approach to marketing online that will help you to become four times more successful than alternative approaches. We will walk you through the world of online marketing and recent changes on the web, how to build a vision and attract the right audience for success in any endeavor. Within one weekend you will be given everything you need to develop a clear marketing plan to help you keep up with greatest of companies in your field.</p>\n\n<p>This knowledge is perfect for those who want to take their organization or business to the next level, to expand their impact and online reach, and to create change by becoming leaders and innovators in their field.</p>\n\n<p>Within this course we will approach the following topics:</p>\n\n<ul><li>Creating a story that captures the heart of your organization</li><li>Identifying the right target audience(s)</li><li>Finding your unique “niche\"</li><li>Determining your core values</li><li>Creating viral content</li><li>Improving your website</li><li>Tracking progress long-term</li><li>Researching your brand and its messaging</li><li>Strategizing fundraising (including free templates)</li><li>Magnetizing your newsletter to build loyalty and friendship with supporters</li><li>Prioritizing and time managing your marketing activities</li><li>And more...</li></ul>\n\n<p>This course includes a combination of simple and easy-to-read handouts, samples of marketing best practices (i.e. plans, newsletters, research surveys), supplementary video clips and presentations, and quizzes.</p>\n\n<p>Along the way we will ask you to take charge of your participation by answering thoughtful questions; making the learning experience your own. This course is completable in a weekend, for anyone who is eager to re-inspire their marketing vision by Monday!</p>\n\n<p><strong>We hope that you will walk away from this course feeling rejuvenated to take charge of your success and help uplift the world with what you have to give.</strong></p>", 
    "end_date": null, 
    "title": "Create an Inspired Marketing Plan", 
    "price": "20.00", 
    "instructors": "Kalamali Lee", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/293870_dd73_4.jpg", 
    "course_url": "https://www.udemy.com/market-inspiration-with-the-world/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-04T14:23:47Z"
}