{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tIf you&#039;re tired of banging your head against the computer trying to manipulate text and pictures for your ebooks and digital products that you create in Microsoft Word, then this course is for you!  </p>  <p>  \tMicrosoft PowerPoint was originally designed as a slideshow presentation software, but with a flip to landscape, a creative content creator can easily use PowerPoint as a desktop publishing software. You don&#039;t need to buy expensive, complicated software if you already own a copy of Microsoft PowerPoint, 2007, 2010, or 2013.</p><p>In this course, I am going to show you how I&#039;ve created over 300 digital products using PowerPoint. I will show you examples of my work, as well demonstrate some of the basic tools in PowerPoint that I use to create ebooks and other digital products. I&#039;ll even share with you some marketplaces to check out where you can sell your digital creations and earn some pocket money. </p><p>This course is not an intensive &quot;how to use PowerPoint&quot;, but by the time you&#039;re finished, you won&#039;t be able to help, but see the potential of this powerful program as a desktop publisher. </p><p>This course includes videos and resource files to help you to start creating ebooks and digital products right away! Participate with other students in the discussion questions and challenges in order to learn, help others, and gain inspiration. </p><p>Grab a cup of coffee, a pair of earphones, and start your publishing journey today!</p><p><em style=\"\">***Promo video music by Kevin MacLeod</em></p>", 
    "end_date": null, 
    "title": "Create and Publish PDF eBooks with PowerPoint", 
    "price": "50.00", 
    "instructors": "Lisa Frase", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398388_e5d2.jpg", 
    "course_url": "https://www.udemy.com/publishebookswithpowerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T20:24:00Z"
}