{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\"><span>How To Create A Sales Funnel Internet Marketing Website In 1 Day</span></strong>  </p>  <p>  \tFollow My Exact System, Use My High Converting Templates &amp; Cheatsheet Blueprint  </p>  <p>  \t<strong style=\"\">You Will Learn:</strong>  </p>  <p>  \t1. How to set-up a nicely designed sales funnel site so you will save thousands of $$$ on hiring a designer.  </p>  <p>  \t2. How to add high converting functionality to your website so you will save even more $$$ on not having to hire a developer.  </p>  <p>  \t3. How to quickly and easily update and manage your own website without having to hire someone to do it for you.  </p>  <p>  \t4. How you can start earning money tomorrow by setting up websites for others. And lots more!  </p>  <p>  \t<strong style=\"\">Have you ever wanted to create your own website but don&#039;t know how to code?</strong>  </p>  <p>  \tGood news, you&#039;re in the right place!  </p>  <p>  \tThis course is designed to walk you step-by-step through setting up your own website without any experience or coding required.  </p>  <p>  \tSpecific action steps are included to walk you through setting up your website so by the end of this course you will have launched your very own internet marketing sales funnel website!  </p>  <p>  \tAs an internet marketer and web designer for over 15 years, I&#039;m here to help you get your website online. I&#039;m here to show you exactly how everything  works, and show you my exact tricks I use to build websites like this daily for clients. No fancy terminology or complex methods used here.  </p>  <p>  \tJust exactly what you need to know to set-up a fully functioning internet marketing sales funnel website.  </p>", 
    "end_date": null, 
    "title": "Create a Internet Marketing Sales Funnel in ONLY 1 Day", 
    "price": "50.00", 
    "instructors": "Lucius Kern", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429538_8c09.jpg", 
    "course_url": "https://www.udemy.com/create-a-internet-marketing-sales-funnel-in-only-1-day/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T03:53:18Z"
}