{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>There are a gazillion ways to build a website. Sometimes having so many options can feel overwhelming. With this course I will walk you step by step through the entire process of creating a gorgeous and professional author website from scratch.  I will show you the steps I used to build over 20 websites for myself and my friends who are authors. It will be as easy as following along to build yours. I did all the trial and error for you ahead of time. I&#039;ll make all the tough decision for you and show you the quickest and easiest path to success!</p><p><strong style=\"\">What is Strikingly?</strong></p><p><strong style=\"\"></strong>The easiest and most cost-effective way to build a website is to use a platform. Strikingly is a template-based website platform that I use and recommend because of it&#039;s ease-of-use, beautiful templates, built-in author tools, and automatic responsive design (which is a fancy way of saying your website will look good on smart phones, tablets and desktop screens).</p><p>You can sign up for the Strikingly free trial while you complete this course. If you&#039;re happy with your website you can either keep using your free site (with a strikingly domain) sign up for one of their affordable accounts, and customize your domain. When you upgrade you also get a few more great features. I have done my research (pulled my hair out creating wordpress websites that didn&#039;t work, spent lots of money hiring web designers that didn&#039;t deliver) and Strikingly has very affordable and comparable pricing plans relative to competitors.</p><p><strong style=\"\">Course Content Overview</strong></p><p>This is a step by step course. I want you to succeed, take action and get your author website up in a day. Some folks have done it in less than an hour!  Follow the course videos in order from start to finish so you&#039;ll be able to set up your Strikingly site, add pages, create a blog, a book sales page, and a email list.</p><p>Every step you need to create a fully functional website is covered in this course.</p><p><strong style=\"\">Who is this course for?</strong></p><p>If you want a gorgeous and professional author or writer website, this course if for you. A typical author website includes multiple pages (Home, About, Contact) as well as an optional blog.</p><p>This course and Strikingly is great for:</p><ul style=\"\"><li>Authors (Non-fiction and Fiction)</li><li>Writers</li><li>Bloggers</li><li>Publishers</li><li>Promoting a new book</li><li>Promoting a book tour</li></ul><p><strong style=\"\"></strong></p><p><strong style=\"\">What are the requirements?</strong></p><ul style=\"\"><li>A Strikingly account is required to complete the course. But you can use a free account to get started. </li></ul><p><strong style=\"\">What am I going to get from this course?</strong></p><ul style=\"\"><li>Step by step video tutorials</li><li>Build your own great looking and fully functional website</li><li>Add and modify pages and content</li><li>A place to sell your book/books</li><li>Start a blog</li><li>Modify and customize the fonts and colors on your website</li><li>Start an email list to connect with your readers</li></ul><p><strong style=\"\">What is the target audience?</strong></p><ul style=\"\"><li>This is a course for website beginners. If you can click on a browser you can create your website. No code or prior website experience necessary</li><li>Strikingly is particularly good for bloggers, writers, authors, publishers, and promoters of new books or book tours. .</li><li>This tutorial may not be well suited for folks that need a complicated website (i.e. membership site). If that&#039;s what you need, I would suggest hiring a professional web developer.</li></ul>", 
    "end_date": null, 
    "title": "Create a Gorgeous Author Website in One Day", 
    "price": "20.00", 
    "instructors": "Pamela Maass", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516152_1b98_9.jpg", 
    "course_url": "https://www.udemy.com/authorwebsite/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-31T16:44:47Z"
}