{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Independientemente de si <strong>estás buscando trabajo</strong> o ya tienes uno, un blog te puede ayudar a <strong>mejorar tu carrera profesional</strong>. </p><p>Si estás en la <strong>búsqueda de empleo</strong> de manera activa, <strong>un blog es el mejor curriculum</strong> que puedes tener. Hablar de tus conocimientos y experiencias laborales en un blog puede aportar muchísimo valor en un proceso de selección y puede marcar la diferencia entre un candidato y otro. </p><p>El mostrarte como <strong>experto en tu especialidad con un blog</strong>, te puede dar muchas más oportunidades para conseguir ese puesto de trabajo que tanto deseas.</p><p>En el caso de que ya tengas un puesto de trabajo, <strong>un blog te puede ayudar a posicionarte mejor dentro de la empresa</strong>, y optar a puestos más acordes con tus preferencias, gustos y expectativas.<br></p><p>Tener un blog es la mejor manera de <strong>desarrollarte como profesional</strong>. Un blog es tu mejor carta de presentación en internet. Todo el mundo podrá conocer tus puntos fuertes de tal manera que generarás <strong>muchas oportunidades laborales y de negocio</strong>.</p><p>Además, puedes llegar a un gran número de personas, es un escaparate abierto al mundo en el que puedes trasmitir y compartir tus conocimientos y pasiones.</p><p>Un blog es una herramienta muy potente para <strong>crear marca personal</strong> y definir tu <strong>identidad digital</strong>. La reputación online se construye a través de tu presencia en Internet y con un blog tienes la oportunidad de crear la presencia que tú quieras.</p><p>Si eres autónomo o tienes una empresa, <strong>un blog te puede servir para dar a conocer tus servicios</strong>, productos y hasta venderlos a través del mismo.</p><p>Pero sin duda, <strong>el mayor potencial de un Blog está en convertirlo en tu propio negocio</strong> generando clientes e ingresos de manera constante y dándote una libertad que con los medios tradicionales no podrías tener.</p>", 
    "end_date": null, 
    "title": "Cómo Crear un Blog de Éxito", 
    "price": "20.00", 
    "instructors": "Jorge Hernández", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792252_cfd9_2.jpg", 
    "course_url": "https://www.udemy.com/como-crear-un-blog/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T11:11:32Z"
}