{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Preisaktionen, Deals, Gratis-Tage, Select, Vorbestellungen, Facebook. Newsletter und so weiter: Der Kurs beschreibt, welche dieser Marketing-Mittel Ihnen <strong style=\"\">beim Verkaufen Ihres Buches wirklich helfen</strong> – und warum, wie und zu welchen Kosten Sie diese Aktionen einsetzen sollten. </p><p style=\"\">Dabei starten wir mit den <strong style=\"\">Grundlagen des eBook-Marketing</strong>. Wer ist überhaupt Ihr Kunde, welches Produkt verkaufen Sie – und welche Ziele verfolgen Sie?</p><p style=\"\">Danach behandeln wir alle Werkzeuge, die Ihnen für den <strong style=\"\">Erfolg Ihres eBooks</strong> zur Verfügung stehen. Wann funktioniert was, und was kostet Sie das? Alles wird am Bildschirm ausführlich erklärt.</p><p style=\"\">Schließlich fassen wir das Gelernte zu einem <strong style=\"\">Marketing-Plan</strong> zusammen, den Sie bestens auf Ihr eigenes eBook übertragen können. </p><p style=\"\">Die Vermittlung erfolgt durch Präsentationen und (vor allem) <strong style=\"\">Vorführungen am Bildschirm</strong>, die Sie live nachvollziehen können. Nach jedem Abschnitt wird Ihr neu erworbenes Wissen abgefragt.</p><p style=\"\">Wenn Sie diesen Kurs beendet haben, haben Sie alle Voraussetzungen dafür, dass Ihr Buch den Erfolg einfährt, den es verdient. Die praktischen Anleitungen und konkreten Bildschirm-Demos haben Sie im Laufe eines Wochenendes durchgearbeitet. Zum Abschluss erhalten Sie einen <strong style=\"\">komplett ausgearbeiteten Marketing-Plan</strong> für Ihr Projekt.</p>", 
    "end_date": null, 
    "title": "eBooks und Bücher bei Amazon & Co. erfolgreich verkaufen", 
    "price": "50.00", 
    "instructors": "Matthias Matting", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539210_928e_5.jpg", 
    "course_url": "https://www.udemy.com/ebooks-und-buecher-bei-amazon-apple-tolino-erfolgreich-vermarkten/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-28T11:30:53Z"
}