{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Welcome to the most comprehensive coaching course in E-book sales and publishing.</p><p>Today, with <strong>3 billion mobile internet users</strong> internet, there is a huge opportunity to sell affordable e-books to the masses. Average writers using a smart <strong><em>marketing system</em></strong> can access a large share of this market. In fact, you do not have to be a genius or a <strong>\"New York Times best seller\". </strong>You can learn how to use powerful marketing tactics to start your own successful <strong><em>e-book publishing business </em></strong>and deliver ordinary products through mass marketing.</p><p><em><strong>Industry Facts:</strong></em> Due to Internet Democratization, the power is shifting from large multi-million dollar publishing companies to smaller <strong>FAST MOVING</strong> companies who typically earn between<strong> $50 000 and $100 000 per month</strong>. This executive coaching course for publishers will teach you everything about starting, growing and selling your own publishing business. </p><p><strong>5 Reasons why this this course could be the best investment you ever made:</strong></p><p>1. Modeled on<strong> a</strong><strong> proven marketing </strong><strong>system which is already </strong><strong>making millions for other publishers. </strong>We teach you exactly how the Harvard Business Review, MIT and other best selling publications are distributed on the web - and how you can do the same in order to receive a solid income from readers around the world.</p><p>2. <strong>You save THOUSANDS </strong>in consultancy fees - since you will have access to a specialist marketing consultant who is also your course tutor. </p><p><strong>3. Accelerated learning:</strong> You can learn quickly about what works best in the publishing industry</p><p><strong>4. Templated, ready-made solutions: </strong>No need to re-invent the wheel. Start your business immediately after completing the course</p><p><strong>5. Business support:</strong> Use the Udemy forum to get free business support for your new publishing company. </p><p><strong><em>Here is what you will learn: </em></strong></p><p><strong>Learn which supply chains really matter for your ebooks:</strong></p><p>A market segmentation analysis reveals why you cannot give exclusivity to one vendor - and which supply chains to use. We debunk myths and disinformation about contracts, teach you how semi-exclusivity works - and empower you to become a multi-channel publishing operation. </p><p><strong>The best practical advise to publish on multiple platforms:</strong></p><p>Learn how to leverage <strong><em>Amazon Kindle, Google Play and the Apple iStore </em></strong>with specific tactics that work on each platform.</p><p><strong>Avoid costly mistakes: </strong>There is a tendency among new publishers to miss out on massive segments of the market by signing exclusive deals with Amazon's KDP select program. Instead of limiting yourself to only a fraction of the market through exclusivity, this course teaches e-book publishers to seize <strong><em>Maximum Market Share. </em></strong></p><p><strong>Leverage the power of outsourcing:</strong></p><p>Learn how to make <strong>700% profit </strong>on ebooks that other writers create for your publishing company. Work less yourself and hire more people to contribute towards your wealth. </p><p><strong>Selling your publishing company for a 7 figure deal within 12 months:</strong></p><p>After starting an e-book publishing start-up can be sold for as much as $500K. After consulting with several publishers on a successful formula, Adriaan Brits will share valuable tactics that will enable you to sell an e-book company every 12 months to cashed up investors. </p><p><strong><em>Next steps:</em></strong></p><p>Are you ready to soon launch your own e-books and that of other writers into a market of 3 billion users across <em>Amazon Kindle, Google Play and the Apple iStore </em>? Ready to apply some <strong>powerful principles</strong> to your own e-book publishing business and to see credible results? Join the insider's track to successful e-book publishing. You may also skip this course and start immediately with the <strong>\"$100K publishing empire\" </strong>by Adriaan Brits<strong>,</strong> which is a full executive coaching course covering all of the above plus more. </p>", 
    "end_date": null, 
    "title": "Ebook sales coaching for Kindle, iTunes and GooglePlay", 
    "price": "25.00", 
    "instructors": "Adriaan Brits", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/547816_f999_6.jpg", 
    "course_url": "https://www.udemy.com/ebook-sales-secrets-kindle-itunes-googleplay-kobo/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-07T11:43:37Z"
}