{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Build Your Email Marketing List Like A Champ With MailChimp By Taking This Easy Course Packed With Useful Information So You Can Succeed!</strong></p><p>  \t<strong><em>Email Marketing is not dead. Read below to find out why it is more effective than Facebook and Twitter. Start list building today with MailChimp's free plan.</em></strong></p>  <p>  \t<strong>***** COURSE MATERIAL IS UP-TO-DATE AS OF 05/01/2015 *****</strong>  </p>  <p>  \t<strong>30 Day 100% Risk Free Offer!</strong></p><p>✔ <strong>Easy to Learn Material</strong></p><p>✔ <strong>Over 4,700 students attending</strong></p><p>✔ <strong>Email Marketing Gets Better Customer Engagement Than Facebook</strong></p><p>✔<strong> Email Marketing is very affordable in cost!</strong></p><p>✔ <strong>New Material Added May 2015!</strong></p><p><strong><em>Five-Star Review: Perfect for beginners.</em></strong></p>  <p>  \t<strong><em>Building an email list is the most important marketing task, in my opinion. This is the second course I take from this instructor and I'm satisfied. Thank you and keep up the good work.</em></strong>  </p>  <p>  \t                           More than <strong>4,800 students </strong>are learning how to build their mailing list and grow their business with MailChimp.  </p>  <p>  \t                Did you know know email marketing is not dead? Here's some stats that prove that marketing your business using email is stronger than ever. Check out these stats and see why you should be taking this course and learning how <strong>MailChimp</strong> can help you achieve results.  </p>  <ul>  \t<li>According to a recent survey email is 40 times more effective for marketers than Facebook and Twitter. Now that's a serious ass kicking when it comes to marketing your business.</li>  \t<li>Studies have also found that the average order is about 17 percent higher than those that come through social media sites such as Facebook.</li>  \t<li>No better way to build an audience of clients or customers. By consistently offering valuable content, you build loyal followers.</li>  \t<li>The email in-box still happens to be the #1 preferred channel for permission-based marketing messages, by a wide margin.</li>  \t<li>With an ROI of around 4,300% (according to the Direct Marketing Association), email almost pays for itself, not to mention the fact that it's “eco-friendly.\"</li>  \t<li>Email marketing is still the most cost-effective way of promotion.</li>  \t<li>You can track email data easily and watch your response rates as they climb or fall.</li>  \t<li>Higher engagement means higher conversion rates that boost your bottom line.</li>  </ul>  <p>  \t<strong>                           Here's what we will cover in this course...  </strong>  </p>  <p>  \t                                     Learn how to setup your free forever MailChimp account, create your first mailing list, build forms and send out your first email marketing campaign newsletter. This course will also cover some email marketing tips to build a list of followers.  </p>  <p>  \t<strong>                           MailChimp is used by over 6 million users around the world.  </strong>  </p>  <p>  \t                               BONUS PDF REPORT - 5 Email Marketing Tools - Must finish the course to access this free report.  \t  \t<strong>6 Informative Videos including:</strong>  </p>  <ul>  \t<li>VIDEO 1 - Sign Up For MailChimp</li>  \t<li>VIDEO 2 - Create Your MailChimp Mailing List</li>  \t<li>VIDEO 3 - Creating Forms</li>  \t<li>VIDEO 4 - First Email Campaign</li>  \t<li>VIDEO 5 - Email Marketing Tips</li>  \t<li>VIDEO 6 - MailChimp Smartphone and Tablet Apps</li>  </ul>  <p>  \t                                          MailChimp QuizMailChimp Resources  </p>  <p>  \t<strong><em>Don't forget to check out the free preview lectures to sample my course. </em></strong>Are you ready to learn with me?  \t  \t<strong>By the end of this course students will know:</strong>  </p>  <ul>  \t<li>What MailChimp Is</li>  \t<li>How-to get your free account</li>  \t<li>How-to set up a mailing list</li>  \t<li>How-to send out your first campaign</li>  \t<li>How-to read MailChimp reports</li>  \t<li>How-to building your own mailing list</li>  </ul>  <p>  \t          Don't wait another day to start building your list.  </p>  <p>  \t<strong>CLICK \"TAKE THIS COURSE\" TO GET STARTED NOW!</strong>  </p>", 
    "end_date": null, 
    "title": "Email Marketing: List Building with MailChimp's Free Plan", 
    "price": "20.00", 
    "instructors": "Dennis J. Smith", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63244_1bb5_4.jpg", 
    "course_url": "https://www.udemy.com/emailmarketingwithmailchimp/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-01T18:50:26Z"
}