{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Are You Frustrated Because You’re Not Sure HOW To Write Email Copy?</strong><br></p>\n\n<p>Let’s face it, it’s easy to be a “churn and burn” marketer and just spam the heck out of your subscribers.</p>\n\n<p>But, you probably realize that writing in that way will never yield any fruitful rewards.</p>\n\n<p>You realize by now that the true rewards are reserved for those who interact with their end users in a way that invokes trust, confidence, rapport, and prestige.</p>\n\n<p><strong>If You’d Love To Pick My Brain, Ask Me Anything You Want About Email Copywriting, As Well As Learn What Mentality To Have As You Artfully Compose Emails, You’ll Love This Course!</strong></p>\n\n<p>I’m not going to hype this course with any fanfare or ballyhoo.</p>\n\n<p>You either realize what I have to offer (5 years of email marketing experience, countless subscribers who swear that my style rocks), or you’re just not interested in being a longterm email marketer.</p>\n\n<p><strong>So If You’re Frustrated That Your Email Subscribers Opt-Out...</strong></p>\n\n<p>Or even worse - if they mark you as spam, or just plain ignore you...</p>\n\n<p>Then enroll in this course now - so you can finally have the prestige and rapport that’s only possible when your susbcribers know you, like you, and trust you.</p>\n\n<p><strong>You’ll Also Have Me To Support You One On One!</strong></p>\n\n<p>I’m not ashamed to mention that I live on my computer 24/7.</p>\n\n<p>I come from the tech world where customer support was always the top priority; so I can’t help it! Helping you is literally ingrained in my DNA.</p>\n\n<p>So if you’d like to study alongside me, and have an email copywriting coach for the cost of a few peanuts...</p>\n\n<p>Then you’re going to love every second of this course, and the relationship we develop shall last indefinitely, if you let it.</p>\n\n<p>Talk later, and I’ll see you on the inside.</p>\n\n<p>Mike “The Email Poet” DeVincent</p>\n\n<p><strong><em>Enroll Now, So You Can Finally Interact With Your Subscribers In A Way That Builds Massive Rapport While Establishing Massive Goodwill And Prestige!</em></strong></p>", 
    "end_date": null, 
    "title": "Email Copywriting Strategy", 
    "price": "20.00", 
    "instructors": "Mike DeVincent", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661744_28aa_2.jpg", 
    "course_url": "https://www.udemy.com/email-copywriting-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T04:29:09Z"
}