{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Imagine this…</strong></p><p style=\"\">Waking up each day, typing up an email, pressing SEND and then watching the sales roll in.</p><p style=\"\">Could there be anything more satisfying than that?</p>This is why, as an entrepreneur, I believe that building successful email marketing campaigns has never been more important than it is now. But there&#039;s a problem; most people don&#039;t know how to do it right <p style=\"\"><strong style=\"\">How do you do it right? </strong></p><p style=\"\">By making sure you are maximizing conversions and click-through rates with every email you send. Just as managers of five-star restaurants spend hours combining the right ingredients for their recipes. </p><p style=\"\">Similarly, creating a five-star email marketing campaign involves more than laying out some content and crossing your fingers – emails with killer click-through rates have a special mix of the right content, a stellar layout, and the right underlying strategy. </p>   I know a thing or two about getting ROI from email marketing and I&#039;m going to share my system with you now.<p style=\"\"></p><p style=\"\">Keep in mind… you should know that you don&#039;t need a big email list or fancy software to start seeing amazing results from email marketing. You simply need a strategy.</p><p style=\"\"><strong style=\"\">Take this course now to get started.</strong></p>", 
    "end_date": null, 
    "title": "Email Marketing Profits: Generate Revenue From Your List", 
    "price": "20.00", 
    "instructors": "Basim Salim", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550854_14ca_2.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-profits-generate-revenue-from-your-list/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T08:15:56Z"
}