{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tAre you ready to CONNECT WITH YOUR AUDIENCE and FULFILL YOUR BUSINESS’ GOALS?  </p>  <p>  \tDo you want to create deeper relationships with your customers to build brand loyalty?  </p>  <p>  \tYou can in EXCEL WITH BUSINESS BLOGGING.  </p>  <p>  \tThis course offers an effective way to IMPROVE YOUR BLOGGING ACTIVITIES via a STEP-BY-STEP PROCESS  </p>  <p>  \tYou’ll FIND OUT WHY BLOGGING IS THE BEST MARKETING TOOL for your business, LEARN HOW TO PRODUCE COMPELLING CONTENT for your blog and DEVELOP THE SKILLS TO WRITE FOR AN ONLINE AUDIENCE.  </p>  <p>  \tThe Excel with Business Blogging course PROVIDES you with:  </p>  <ul>  \t<p>  \t\t·AN OVERVIEW OF BUSINESS BLOGGING: Learn how blogging gives your brand a personality  \t</p>  \t<p>  \t\t·CRITICAL WRITING TECHNIQUES: Find out how to get creative with your content.  \t</p>  \t<p>  \t\t·BLOGGING GUIDE: This guide acts as textbook for the course.  It provides you with additional information and emphasizes important concepts.  \t</p>  \t<p>  \t\t·CASES STUDIES: Discover effective methods from top business blogs.  \t</p>  \t<p>  \t\t·A CONTENT PLAN: Create a plan that addresses timing, quality, topics, legal risks and policies.  \t</p>  \t<p>  \t\t·AN EDITORIAL CALENDAR DEMO: We don’t just tell you about it, we arm you with the tools to set up your editorial content today.  \t</p>  \t<p>  \t\t·TEMPLATES: You’ll receive templates for your editorial roadmap calendar, blogging policy, blogging privacy policy and blogging comment policy.  \t</p>  </ul>  <p>  \tIT’S EVERYTHING YOU NEED TO KNOW ABOUT BUSINESS BLOGGING AND THE TOOLS YOU NEED TO GET STARTED …  </p>  <p>  \tDON’T MISS OUT ON THIS OPPORTUNITY...START TODAY.  </p>", 
    "end_date": null, 
    "title": "Excel with Business Blogging ", 
    "price": "20.00", 
    "instructors": "By Communications Worldwide, Brigitte Yuille", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/97246_3817_3.jpg", 
    "course_url": "https://www.udemy.com/excel-at-business-blogging/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-25T16:03:14Z"
}