{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t                        If you’re a blogger, author or online publisher looking for a competitive edge, consider reliability and accuracy.  </p>  <p style=\"\">  \t                        It takes just a little bit of consistent effort to achieve writing that readers can enjoy and fans recommend without hesitation, because you’ve cleared it of careless bloopers and mortifying blunders. With a simple fact checking routine, you’re elevated to a higher echelon of writers.  </p>  <p style=\"\">  \t              Instructor Marcia Yudkin has been a published author for more than 30 years. She has written for national magazines like the <em style=\"\">New York Times Magazine, Ladies Home Journal</em> and <em style=\"\">TWA Ambassador</em>, for big-name publishers like HarperCollins and Penguin and for National Public Radio.  </p>  <p style=\"\">  \t        She created the course because she witnessed how humiliating it can be when readers and important industry contacts catch a blogger or author making dumb mistakes, like putting Sydney in Austria rather than Australia or mixing up sudoku (the number game) and seppuku (ritual suicide).  </p>  <p style=\"\">  \t      “Fact Checking Made Easy” consists of 13 practical lessons totaling more than an hour and a half of video instruction. At its heart are three complete now-you-try-it exercises (and another partial one) where you give fact checking a go and then compare your findings with Marcia’s answers and analysis.<strong style=\"\"> It’s hand-on learning at its best.</strong>  </p>  <p style=\"\">  \t      Besides the video lessons and exercises, you have access to full written transcripts of the lessons, along with several handouts that make the learning process more convenient.  </p>  <p style=\"\">  \t  Among the points you learn in this course:  </p>  <p style=\"\">  \t  * How to create a fact-checking routine that catches errors and inconsistencies  </p>  <p style=\"\">  \t  * Where and how to check various kinds of facts - including an amazingly helpful, taxpayer-funded free research resource  </p>  <p style=\"\">  \t  * The difference between opinions that don’t warrant a fact check and statements that do  </p>  <p style=\"\">  \t  * Pitfalls in getting names and numbers correct  </p>  <p style=\"\">  \t  * The importance of recognizing and discounting biased or outdated sources of information  </p>  <p style=\"\">  \t  * How not to fall for and pass along hoaxes, baseless rumors and myths that have already gone around the Internet thirty thousand times  </p>  <p style=\"\">  \t  * The kinds of mistakes that run the greatest risk of landing you in legal trouble, and how to avoid those  </p>  <p style=\"\">  \t  * The best way to handle it if an error does nevertheless slip by you  </p>  <p style=\"\">  \t  Whether you write a blog, a newsletter, a book or ebook or simply private emails to potential joint-venture partners, avoid loss of face, build credibility and be a writer that people praise, instead of pointing out your should-have-known-that errors.  </p>  <p style=\"\">  \t  It’s fun, it’s practical, it’s important - and you get lifetime access to the course once you enroll.  </p>  <p style=\"\">  \t  So sign up for “Fact Checking Made Easy” today!  </p>", 
    "end_date": null, 
    "title": "Fact Checking Made Easy", 
    "price": "35.00", 
    "instructors": "Marcia Yudkin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/280150_804b_3.jpg", 
    "course_url": "https://www.udemy.com/fact-checking/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-13T13:28:34Z"
}