{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>With so many authors <strong>\"gaming\" the system </strong>to become a bestseller on Amazon, <strong>but never earning a cent</strong>, wouldn't you like to know how to create a bestselling book that actually <strong>earns you money</strong>?</p><p>I can show you how!</p><p>I have been speaking all over the country for the past few years about book marketing. My award-winning book, \"The Plan that Launched a Thousand Books: A DIY Guide to Creating Your Book Marketing Plan\" continues to receive rave reviews, as well as to establish my expertise in the industry and generate revenue through book sales and client engagements..</p><p>In <em>Failing Faster to Succeed as an Author</em>, I show you how to <strong>use market research</strong> to:</p><ul><li>create a marketing plan that reaches your ideal reader </li><li>identify topics that already have a buying audience</li><li>tailor your content to meet needs in the marketplace</li><li>design your book so that it stands out from the competition</li><li>use your book to increase your following.</li></ul><em></em><p>This course is designed to help you <strong>evaluate book ideas</strong> and quickly <strong>drop those that won't sell </strong>to create a book that already has an eager audience waiting for it by the time that it's released.<br></p><p>As you navigate this course, you'll gain insights and learn the strategies that I use to make my books and those of my clients market successes. Upon successful completion of this course, you'll be able to:<br></p><ul><li>Position yourself to attract the desired income from your writing efforts</li><li>Amplify your book's marketability and salability to drive results and grow your list</li><li>Develop a highly marketable book that fills a market need</li><li>Appreciate the factors that equate to success when establishing your brand</li></ul><p>Start learning how to <strong>#FailFaster</strong> today!</p>", 
    "end_date": null, 
    "title": "Failing Faster to Succeed as an Author", 
    "price": "50.00", 
    "instructors": "Tara R. Alemany", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471198_8fa0_3.jpg", 
    "course_url": "https://www.udemy.com/failing-faster-to-succeed-as-an-author/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T20:16:48Z"
}