{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Discover The Secret To Writing Super Fast Sales Letters Easily Without A Budget</strong><br></p>\n\n<p>What would you do if you could create awesome sales letters,\neven if you don’t have any experience?</p>\n\n\n\n<p>Would you be interested in learning the secret to creating super fast and super easy copy even if you’ve struggled before?</p>\n\n\n\n<p>Before you tap into these secrets… Let me ask you a quick\nquestion…<strong></strong></p>\n\n\n\n<p><strong>Are You Frustrated Because You\nHave Awesome Products To Promote…</strong></p>\n\n\n\n<p>But you just can't write your first sales letter to save your\nlife?</p>\n\n\n\n<p>Have you ever been irritated because you've suffered from\nwriter's block, even though you honestly want to help people by offering your\nproduct?</p>\n\n\n\n<p>Maybe you just can't figure out how to put pen to ink, even\nthough you've read every copywriting course on the planet?</p>\n\n\n\n<p><strong>If That's The Case - I Understand\nYour Frustration!</strong></p>\n\n\n\n<p>I know what it's like when you just can't write your first sales\nletter, even after struggling for hours, days, weeks, or even months!</p>\n\n\n\n<p>See, I've spent years of my life writing sales letters for\nmyself, so I could finally be my own boss and connect to my end users in a way\nthat worked.</p>\n\n\n\n<p>The best part? My copywriting template is literally the easiest\nway to write sales copy fast - so you can consistently and reliably pump out\nsales letter after sales letter by studying this course.</p>\n\n\n\n<p><strong>You'll Also Discover The Copywriting Secrets I've Learned After Sending Over One Million Promotional Emails</strong></p>\n\n\n\n<p>After sending one million promotional emails, I've learned some priceless email marketing strategy that quite frankly is impossible to obtain anywhere else!</p>\n\n\n\n<p>So, if you've ever sat down to write a promotional email, and came up empty, this one lesson alone will be worth more than a treasure trove stuffed to the brim with sparkling rubies...</p>\n\n\n\n<p><strong>That's Why You're Going To Love\nEvery Lecture In This Course...</strong></p>\n\n\n\n<p>So you can finally smash writer's block, and write your first,\nsecond and third sales letter instantly and automatically using this super simple copywriting method that's fast to use!</p>\n\n\n\n<p>Ask yourself how it would feel if you could easily write sales\ncopy, without banging your head on the wall or spinning your wheels for what\nseems like an eternity?</p>\n\n\n\n<p>Would it feel good if you could write sales copy that connected\nwith your demographic, and imagine if it only took you a few minutes?</p>\n\n\n\n<p><strong>If It Would Feel Good, Enroll For\nThis Course Now!</strong></p>\n\n\n\n<p>The reality is that It's taken me years to master this simple\nsales letter template that you get in this course, plus you'll also learn some\nof the most important copywriting lessons that will make your copywriting chops\neven more powerful.</p>\n\n\n\n<p>So you can easily tap into your end users, using a simple\ncopywriting tactic that works, all the while discovering the forbidden\ncopywriting strategies that most curmudgeonly \"copywriting experts\"\ndon't want you to know about!</p>\n\n\n\n<p><strong><em>Enroll Now To Download My Super Easy 11-Point Copywriting Template, And So You Can Finally Write Copy That Sells Even If You've Struggled Before And Have No Idea How To Sell!</em></strong></p>", 
    "end_date": null, 
    "title": "Fast Sales Copywriting For The Absolute Beginner", 
    "price": "20.00", 
    "instructors": "Mike DeVincent", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630928_157d_2.jpg", 
    "course_url": "https://www.udemy.com/fast-sales-copywriting-for-the-absolute-beginner/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T03:15:59Z"
}