{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Creating a marketing and communications plan to engage your donors, volunteers, partners and clients.</strong></p>\n\n<p>Harness the mission of your organization.  Communicate its impact. Create a call to action.  Start by determining where you are. Then decide where you want to go. Finally set a map for getting there.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will help you craft a marketing and communications plan that you can use all year long, tailored to your organizational goals, size of your team and scalable to your needs. Many nonprofits know what they want to say, but don’t know how to best reach their intended audience and provide opportunities for engagement.  This course provides you with tools and resources to help you create impactful messaging, outline how your audience is best communicated with, and actionable activities to support your overall organization marketing and communication objectives.  You will receive guidance on how to create your own plan and implement it! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Nonprofit teams that include marketing professionals or a one-person department, regardless of experience, will benefit from the comfortable discussion style with over <strong>2.5 hours of video lectures</strong>, Merrill Stewart, and Louanne Saraga Walters. You’ll become part of the discussion as you determine how you want to communicate your organization’s brand, unique factors and impactful purpose with a comprehensive marketing and communications plan. </p>\n\n\n\n\n\n\n\n\n\n<p>Full participation in Fundraising Success: Creating an Annual Marketing and Communcations Plan is approved for 3.0 points in Category 1.B – Education of the CFRE International application for initial certification and/or recertification.<br></p>", 
    "end_date": null, 
    "title": "Fundraising Success: Creating an Annual Marketing Campaign", 
    "price": "50.00", 
    "instructors": "Louanne Saraga Walters, Merrill Stewart", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754526_f058_5.jpg", 
    "course_url": "https://www.udemy.com/fundraising-success-creating-an-annual-marketing-campaign/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T18:31:52Z"
}