{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Do you know how many people are actually reading your messages (blogs, social media posts or articles)? </strong></p><p>Well, an average headline gets about 25% of people to click on it and read it. And even fewer actually end up finish reading your post. </p><p>So what about it if you have a poor headline?</p><p>Well, it's clear that <em><strong>the headline is the most important part of any message.</strong></em></p><p><em>Think about it...</em></p><p>How many headlines do you read a day?</p><p>This includes websites like Twitter, Facebook, email subject lines, magazines, newswebsites etc. </p><p>Maybe 100+ or more?</p><p>So, what can you do to beat the odds?<br></p><p><strong>Using proven formulas.</strong></p><p><em>Why would you use formulas when you can invent new ones? Because...</em></p> <ul> <li>...it takes <strong>FOREVER</strong> to create new ones.</li> <li>…it's <strong>SUPER HARD</strong> to create new ones.</li> <li>…<strong>EVERYONE</strong> uses formulas, <em>they work</em>.</li> </ul> <p>Think about it, a master of any profession uses the same technique over and over again to reproduce the success he has had. Similarly a mastery copywriter uses the same old headlines again and again. </p><p><strong>If a headline formula worked yesterday, chances are it will work again tomrrow.</strong></p><p>You might think that, you'll end up creating predictable boring headlines. True, but if you create attention grabbing headlines, you need to learn how to change the formula for your audience.</p><p>After seeing the formulas and examples of great headlines, and understand the science behind them, <strong>you'll be able to write headlines like a master copywriter.</strong></p><p>This is why I've created the ultimate headlines course that grab attention and get your message read.<br></p><p>Here is what is included in the course…</p> <ul> <li><strong>100 Headline Formulas:</strong> These are random formulas but based on proven headlines you read on a daily basis.</li> <li><strong>Examples of each formula: </strong>How to be creative with them to achieve the result you want.</li> <li><strong>What expectations each create. </strong>Know what psychological triggers they create.</li> <li><strong>A Strong Headline Follow-Up: </strong>How to keep readers alive so they read to the end.</li> <li><strong>Great Headline Best Practices:</strong> Learn to capture attention, create fascination, and create anticipation.</li></ul><p>So if you just want to get people to read your content, then you must master writing headlines. Therefore...</p><p><strong>This course is a must for every online marketer, digital entrepreneur or anyone writing copy.</strong></p>", 
    "end_date": null, 
    "title": "Get Clicked: 100 Attention Grabbing Headline Formulas", 
    "price": "20.00", 
    "instructors": "Basim Salim", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613390_d8a5_2.jpg", 
    "course_url": "https://www.udemy.com/get-clicked-100-attention-grabbing-headline-formulas/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T03:58:06Z"
}