{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><span><strong>In this course, I share everything I've learned from writing for 50+ companies &amp; authors on hundreds of guest posts that have driven millions of targeted visitors. </strong></span></p><p><span>Every step is laid out. From how to choose your blog topics, how to find bloggers and I even give you email templates to use when reaching out to bloggers for guest posts. </span></p><p><span>This student got his first post within a few days of starting the course: </span></p><p><span><em>\"In just a few days after enrolling the course and take action to implement the lessons, I got my first guest post accepted from high quality blog. Now I'm working on the second guest post, because I have got another good response from another high quality blog.\" -Muhamad<span> G.</span></em></span></p>  <p>  \t<strong>ADDED BONUS:</strong> ($289 Value)  When you purchase this course, you will receive the following at no extra charge.  </p>  <ul>  \t<li><strong>NEW</strong> Bonus list of 140+ high authority blogs accepting guest posts</li>  \t<li>The complete PDF Ebook</li>  \t<li>2 NEW bonus modules</li>  </ul>  <p>Think about your ideal customer. Who do they trust? What blogs do they read every day? If you don't know, that's ok. I'm going to show you exactly how to find out, then I'll show you how to use that information to grow your business.<br></p>  <p>  \t             I work with businesses across every industry and the one strategy that is consistently overlooked is <strong>guest blogging.</strong>  </p>  <p>  \t<strong>There is no better (or faster) way to gain the trust of your customers than having a website that they trust feature you and your ideas in a guest blog post.</strong>  </p>  <p>  \t             My approach to finding, pitching and getting featured on these websites isn't magical -  It generates results.  </p>  <p>  \t             In this course I will show you the EXACT strategies I've used to <strong>double</strong>, and in many cases, <strong>triple</strong> the number of new leads for myself and my clients.  </p>  <p>  \t             After this course, you'll know how to:  </p>  <ul>  \t<li>  \t  \t\t<strong>Identify the blogs your customers visit most</strong>  \t  \t</li>  \t<li>  \t  \t\t<strong>Get featured on those sites - You'll even receive email scripts</strong>  \t  \t</li>  \t<li>  \t  \t\t<strong>Save time by avoiding the wrong blogs - I'll show you how to spot the red flags</strong>  \t  \t</li>  \t<li>  \t  \t\t<strong>Pick a guest topic that will position you as the expert you are</strong>  \t  \t</li>  \t<li>  \t  \t\t<strong>The right way and the disastrous way to promote your guest posts</strong>  \t  \t</li>  </ul>  <p>  \t<em><strong>Why did I create this?</strong></em>  </p>  <p>  \t             It would be easy for me to keep everything to myself and let everyone else try and figure out what I've spent years developing. And I'd probably make a lot more money. But one of my fundamental values is to help as many businesses as possible.  </p>  <p>  \t             So since I can't take on every business as a client, I've done the next best thing. This course is packed with bite-sized action steps that you can use immediately. And you WILL see results. If you don't or you're unhappy for any reason - let me know within 30 days and I'll give you a full refund no questions asked.  </p>  <p>  \t<strong>Here's What Others Are Saying:</strong>  </p>  <p>  \t             The first big guest posting push I helped create for a client using Joel's system landed a post on ProBlogger and dozens of other great sites. - <strong>Will Hoekenga</strong>  </p>  <p>  \t             By applying the practices found in these lessons, I have increased traffic, personal productivity, and have been inspired beyond measure. You need this! <strong>-Lyle Phillips</strong>  </p>  <p>  \t             Joel did a splendid job of putting together a well-structured and actionable guide for guest blogging. The course is jam-packed with information and fully prepares someone to take on the world of guest posting. He offers real world viable examples and templates to get the party started.  I'd never heard of some of the tools that he presents in the course.  There are a couple that I hadn't thought of -- but you'll have to see for yourself. Fortunately, they're easily picked up and easily shareable with the rest of the population.  It is indeed a reasonable blueprint for conquering the guest posting world. <strong> -Seth Czerepak Master VDT Business Practitioner and Owner of Penetration Media</strong>  </p>  <p>  \t             Yes, I realize that you can take the entire course, implement what I teach to land your first guest post and still ask for a refund...but I'm trusting you to be cool. :)  </p>  <p>  \t             You have nothing to lose. I'm looking forward to seeing you inside!  </p>  <p>  \t             Joel  </p>", 
    "end_date": null, 
    "title": "Guest Blogging Blueprint: Multiply Your Traffic & Influence", 
    "price": "20.00", 
    "instructors": "Joel Widmer", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49021_fa56_6.jpg", 
    "course_url": "https://www.udemy.com/guest-blogging-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-09T00:42:10Z"
}