{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>You want your content to be seen by as many people as possible because you know that your content is helpful or entertaining. You dream of the day when thousands of people will read your content every day. You dream of making a difference through your writing.</p><p>However, you don't have that massive audience yet. You have tried promoting your blog posts but don't seem to be getting much engagement. You get a few visitors from your promotional efforts here and there but never get sustainable traffic.</p><p>What if your content could instantly be put in front of thousands of people, regardless of how many people are actually within your audience? With guest blogging, this goal is a reality.</p><p>The most successful bloggers are increasingly relying on guest posts to get more exposure. Their content gets seen by an entirely new audience of highly targeted individuals.</p><p>Not only are the most successful bloggers increasingly utilizing guest blogging, but newbie bloggers are utilizing guest blogging to get more exposure and credibility for themselves. You do not want to miss out on that action.</p><p>In this FREE no-risk course, you will discover how to write guest posts that get published on other people's blogs so you can get more visibility.<br></p><p>If you are ready to guest blog your way to success, then click \"Take This Course\" now.</p>", 
    "end_date": null, 
    "title": "Guest Blogging Your Way To Ultimate Visibility And Traffic", 
    "price": 0, 
    "instructors": "Marc Guberti", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690328_3970_2.jpg", 
    "course_url": "https://www.udemy.com/guest-blogging-success/", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T14:23:08Z"
}