{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>New videos added in April 2016</strong><br></p><p><strong class=\"redactor-inline-converted\">Please note that if you have already purchased Paperli Profits, <br>the videos in this course are also available there. This is a condensed <br>version for those of you who just need to quickly create Paperli <br>newsletters and don't need a full training on the software.</strong></p>In this course you will learn how to curate relevant content for your readers and send it to them by email as little or as often as you like. Once the structure is in place, you will only need to copy and paste a bit of code into your email service and the result will be a professional looking newsletter, complete with a custom call-to-action that you can change with each issue. The result will be regular newsletters that you can send to your email list, stress-free and quickly.\n\n<p>You may already be using Paperli to curate content, but not many people are taking advantage of the ability to use the resulting HTML code to send a custom newsletter. This course is for the busy person that dreads sending a regular email newsletter because it usually takes too long to come up with ideas for useful and interesting content. With this method, you will be able to send your newsletters out in less than half an hour from start to finish. </p>\n\n", 
    "end_date": null, 
    "title": "How To Stop Newsletter Dread With Almost Instant Newsletters", 
    "price": "25.00", 
    "instructors": "Carol Bremner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/536702_ef9f_4.jpg", 
    "course_url": "https://www.udemy.com/instant-newsletters/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-25T00:14:27Z"
}