{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<div style=\"\"><p style=\"\"><strong style=\"\">A  Business Is Only A Business If It Can Sell</strong></p>    <p style=\"\">So you have a great  product or a fantastic service. Unfortunately in today’s attention seeking  world that by itself is not enough. The truth is that it’s not the best product  that wins; it’s the one with the best marketing. Of course, if you want repeat  business, you also need a great product!</p>    <p style=\"\"><strong style=\"\">But  how do you get that new customer to just try you out?</strong></p>    <p style=\"\">Direct marketing still  works; it’s just that people seem to have forgotten how to do it – or perhaps  they never knew. Nowadays though, you are more likely to send out an email than  a letter in the post. What you want is a marketing piece that gets prospects to  pick up the phone or visit your website and buy from you. This copywriting course is for every  small business owner that has struggled to put together a flyer, sales letter,  email marketing piece or copy for their website.</p>    <p style=\"\">The answer is of  course with great marketing material. And that’s why I put this course  together. Don’t get me wrong, it isn’t going to turn you into a marketing  genius. But what it could do is give you a structure around which to work for and  some big “Ah Ha” moments as you look at your marketing material differently.  The concepts it explains on how to write copy are applicable to:</p></div><ul style=\"\"><li style=\"\">Direct mail</li>  \t<li style=\"\">Email marketing</li>  \t<li style=\"\">Flyers</li>  \t<li style=\"\">Brochures</li>  \t<li style=\"\">Web Site Copy</li>  \t<li style=\"\">Sales Video Scripts</li>  \t<li style=\"\">Advertisements</li>  \t<li style=\"\">Sales Presentations</li></ul><div style=\"\"><p style=\"\"><strong style=\"\">So  do you want to build a brand or sell some products?</strong></p>    <p style=\"\">Hopefully you want to  do both! But too many college educated marketers focus on “Brand Building”  rather than selling. The truth is a successful brand develops as a result of  lots of sales to happy customers. So you need to focus on winning sales not  marketing awards! And that’s what this copywriting course is all about – showing you the 20 components that goes  into any sales oriented marketing material.</p>    <p style=\"\">Not every marketing  piece contains all 20 though. But if you don’t know what should be in there,  how are you going to decide what to leave out? 12 components relate to the  structure and 8 to the content and how it should flow. By understanding how  they fit together and support each other you can create any size of marketing  material.</p>    <p style=\"\">The core content on how to write copy is in video format  and lasts for an hour and a quarter. It is easy to follow because it is broken  down into 9 separate videos:</p>    <p style=\"\"><strong style=\"\">Video 1: Introduction  To Copy Writing</strong></p>    <p style=\"\">In this video we start  by looking at what it is you are selling. Remember you don’t sell a product or  service; you sell a solution to a customer’s problem. To get to the core of the  problem you are going to create a couple of lists. From these you will be able  to write copy that directly targets the core desire of your target market – you  do have a target market don’t you?</p>    <p style=\"\"><strong style=\"\">Video 2: The Ultimate  Sales Formula</strong></p>    <p style=\"\">All sales messages  need to be wrapped around a simple 4 step sequence. Even though you can’t put  the same amount of information into a newspaper advertisement as a direct mail  piece, both still need to follow the formula if you are going to get results.  In this video we will look at what the 20 components of great copy are. Knowing  the formula and the purpose of the 20 components helps you to decide which bits  you need to include for different marketing pieces.</p>    <p style=\"\"><strong style=\"\">Video 3: Grabbing  Their Attention</strong></p>    <p style=\"\">Attention spans are  getting ever shorter, so you need to grab your audience&#039;s attention straight  away. This video explains the parts of your sales message that does just that.  You need to get this bit right if you want your target audience to pay  attention to the rest of your sales message. Just choosing the right type of  headline could make a huge difference in your conversion rates, but it has to  work with the elements that surround it.</p>    <p style=\"\"><strong style=\"\">Video 4: The Body Copy</strong></p>    <p style=\"\">Once you have their  attention, then they are more likely to read the rest of your copy. This video  takes you through the components that should be in your main body text and why  they are there! Every great story has a beginning, middle and end. Well, the  Body Text is the middle of your story! This is where you add information about  the benefits your prospect will get and how your solution is their best option.</p>    <p style=\"\"><strong style=\"\">Video 5: Social Proof  Your Offer</strong></p>    <p style=\"\">Imagine you are the  first person to take this course. What do you look for? Customer reviews  obviously. They are everywhere on-line these days. People want to know that  they are making the right decision when they buy, so naturally they want to  know who else thinks this is good. This video shows you how to embed social  proof into your marketing. So once you have taken this course, why not write a  review of it for me!</p>    <p style=\"\"><strong style=\"\">Video 6: The Call To  Action</strong></p>    <p style=\"\">Having an effective  “Call To Action” is the difference between sales and branding. Every marketing  piece that you create has to pay for itself by getting a prospect to do  something. That might be to buy straight away, or it may be to get them to  visit your website or call you, so that you can continue the sales process.  This video shows you how to create an effective call to action.</p>    <p style=\"\"><strong style=\"\">Video 7: Story Time</strong></p>    <p style=\"\">The best marketing  campaigns have stories and characters that you can relate to. The story is  about how someone just like your target customer had exactly the same problem  and how they fixed that problem using your solution. By creating an effective  character you actually build social proof and third party testimonials right  there into your copy. Stories bypass our critical filters and let you get your  message in at the unconscious level. This video will show you how.</p>    <p style=\"\"><strong style=\"\">Video 8: Value and  Risk</strong></p>    <p style=\"\">You have to  demonstrate through your copy why your customers should swap their money for  what you have to offer. You begin by building up your value proposition, but  that may not be enough. So you also have to assure them that their money is  safe and that they are not taking any risks when they put their trust in you to  deliver. Effective risk reversal could be the key to getting them to say yes,  so this video explains how you build that into your copy.</p>    <p style=\"\"><strong style=\"\">Video 9: Credibility  And Framing</strong></p>    <p style=\"\">This is the final part  of the jigsaw. In this video we will explore how to create credibility in print  and the importance of creating a contrast frame for your value proposition. The  truth is that your customers don&#039;t care about you, they care about what you can  do for them. But they need to be able to trust that you will deliver what you  say you will; especially if this is the first time they have bought something  from you.</p>    <p style=\"\"><strong style=\"\">Get  Started Today!</strong></p>    <p style=\"\">I hope you will find  the videos in this copywriting course informative and entertaining – after all it is much easier to  learn something if it’s fun! At the end of each video you will have some  homework to do! After all, you are learning this so that you can apply it to  your business. Even if you pay someone else to create your marketing materials  for you, this course will give you the information you need to have a  professional discussion with them.</p>    <p style=\"\">And of course it comes  with a&nbsp;<strong style=\"\">full money back guarantee</strong>&nbsp;– I explain why in video 8 by  the way!</p>    <p style=\"\">So why not get started  today and start to make more sales by using better marketing copy? That way the  course will have paid for itself in no time at all.</p></div>  ", 
    "end_date": null, 
    "title": "How To Write Marketing Copy That Sells", 
    "price": "25.00", 
    "instructors": "Eric Sutherland", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44091_a751_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-marketing-copy-that-sells/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-28T17:43:23Z"
}