{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>High-quality blog content is the first step of turning prospects into buyers.</p>    <p>If you want to scale your business by delivering true value to your audience while building your email list, generate free organic traffic and turn readers into customers, then this training is perfect for you.</p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Learn Proven Tricks From A Professional Content Marketer</strong></p>    <ul><li>Easy way to craft blog content that gets shared on social media </li><li>Proven &amp; tested strategies to create content that results in free traffic </li><li>How to stand out from the crowd and turn readers into customers</li></ul><p><br><strong>Contents &amp; Overview</strong></p>    <p>This course will introduce you to a proven &amp; tested system to craft high-quality blog content that gets shared on social media.</p><p> First, we’ll cover why you need high-quality content for your blog and how to create content that gets shared on social media like crazy. </p>    <p>Next, we’ll cover 4 proven &amp; tested blog post types your audience will love. If you want to discover how to get content with virtually zero effort, then you should look forward to Section 2 of this training!</p>    <p>Then, I’ll show you a number of great resources you can’t live without. You’ll discover free image resources, headline swipe files, design tools and how to identify top performing content in your market with the No. #1 content analysis tool. Last but not least, I’ll show you the best way to find top writers for your blog posts.</p>    <p>By the time you complete this course, you’ll know exactly how to craft outstanding blog content that will result in tons of shares on social media. </p>", 
    "end_date": null, 
    "title": "How To Create High-Quality Blog Content That Gets Shared ", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/760546_a631_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-high-quality-blog-content-that-gets-shared/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-12T10:51:44Z"
}