{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">\t This course is designed for the beginner to freelance writing. It takes you on the precise path I followed when I learned how to become a writer 16 years ago. </p><p style=\"\">Now, I'm able to share that journey with you, which will allow to make some side income or become a full-time, paid writer. The choice is up to you. </p><p style=\"\">This course is broken down into a few major steps, which are:</p><ol style=\"\"><li style=\"\">Finding paying magazines online</li><li style=\"\">Researching the back issues for story ideas</li><li style=\"\">Creating a query letter that sells</li><li style=\"\">Working with editors</li><li style=\"\">Increasing your income with joint ventures.<span style=\"\"></span></li></ol>If you follow these steps and are consistent with your marketing, you can be earning a five-figure income in one year or less.   <p style=\"\">\t My name is Nathan Segal and I have been working as a freelance writer for 16 years. In that time, I've published 831 articles and 7 books.</p>  <p style=\"\">\t My articles been published in many popular magazines, including: <em style=\"\">CE Tips (Consumer Electronics), Computer Graphics World, Database Journal, Mac Design, Photoshop User, Rangefinder, Smart Computing, The Computer Paper, Streaming Media World, CIO, HTMLGoodies,</em> and <em style=\"\">CreativeBloq</em>.</p>  <p style=\"\">\t I worked as an Associate Editor at <em style=\"\">WebReference</em> for five years. I also wrote several feature columns on 3D and video tutorials.</p>  <p style=\"\">\t Contrary to what people might think, I never intended to become a freelance writer.</p>  <p style=\"\">\t It happened when I was fired from a job.</p>  <p style=\"\">\t I had no prospects in sight and I had no idea what to do. Two weeks later my cousin came to visit. When he found out what happened, he asked me if I wanted to learn how to become a freelance writer. With no other options in sight I said: \"Yes.\"</p>  <p style=\"\">\t I followed every instruction my mentor gave me on how to succeed. Over time, I learned how to write, sell my work and get better assignments. Withing a year I was earning five figures. Several years later I had my best year when I earned over $100,000 and all of it came from freelance writing.</p>  <p style=\"\">\t Now I'm able to show you what I learned. Once you know how to market yourself you will put yourself at the head of the line when looking for work. Even better, you will be able to use this skill whenever you wish.</p>Testimonials \"Nathan Segal Was Always An Asset To my Team\"<p style=\"\">\t \"Nathan Segal was always an asset to my team. His knowledge of the IT industry, especially the graphics, 3D and photography areas, is top notch.\"</p>  <p style=\"\">\t \"I would recommend him in a heartbeat, and enjoyed working with him over the years through many tasks, from website redesign to technical writing, to working with freelance writers.\"</p>  <p style=\"\">\t Scott Clark\t Executive Editor, Jupitermedia</p>   \"As An Editor, He Was Always Able To Add That 'Special Touch' To My Articles\"<p style=\"\">\t \"In working with Nathan over the years, I have always found him to be straight and to the point.\"</p>  <p style=\"\">\t \"His goal has always been to produce the best product possible, whether it was writing, photography or Web design.\"</p>  <p style=\"\">\t \"As an editor, he was always able to add that 'special touch' to my articles to make them better.\"</p>  <p style=\"\">\t \"Nathan is a true team player. I enjoyed the time that I worked with him and appreciated his insight and experience.\"</p>  <p style=\"\">\t Lee Underwood\t Managing Editor/Site Manager, Jupitermedia</p>Here's what you get in this course:<ul style=\"\">\t<li style=\"\">\t \t\t Four fast methods which show you how to find paying magazines online \t \t</li>\t<li style=\"\">\t \t\t How to get great ideas for content using Amazon \t \t</li>\t<li style=\"\">\t \t\t How to create content fast, by interviewing experts. \t \t</li>\t<li style=\"\">\t \t\t How to write a query letter that sells your ideas to the editor \t \t</li>\t<li style=\"\">\t \t\t Want a fast way to get more work? Pitch a series of articles to the editor. \t \t</li>\t<li style=\"\">\t \t\t Get work fast by writing book reviews or profiles \t \t</li>\t<li style=\"\">\t \t\t How to get valuable software for free \t \t</li>\t<li style=\"\">\t \t\t Increase your income with list building and joint ventures. These are the fastest ways of growing your business over time. \t \t</li>  </ul>Solid Marketing Is The Fastest Way To Build Your Career And Sustain It Over Time \"5 Out Of 5 Stars: A Straightforward Nuts And Bolts Approach\"<p style=\"\">\t \"Nathan has identified the problems facing today's aspiring professional writers. Many do not treat their writing endeavors as a business.\"</p>  <p style=\"\">\t \"Being able to string words together in a comprehensible, enlightening, and entertaining manner is not enough.\"</p>  <p style=\"\">\t \"Being able to market oneself to vendors who will pay well in exchange for creating content that will satisfy their needs and wants is the key ingredient in achieving and sustaining a successful freelancing career.\"</p>  <p style=\"\">\t \"Nathan has proven that his strategies, techniques and tools work well and should be the foundation for others to follow. I have a feeling we will see and hear more from Nathan in the future and it would be wise for all of us to look, listen, and learn.\"</p>  <p style=\"\">\t David Hyland</p>   \"5 Out Of 5 Stars Review\"<p style=\"\">\t \"I have been writing for some time, but most of this writing has been done personally instead of professionally.\"</p>  <p style=\"\">\t \"This course, though short, was full of of so many resources for the would-be freelance writer. I was amazed at how easy this course was to use and understand. I was also impressed at how much could be placed in one course.\"</p>  <p style=\"\">\t \"This course is a ready reference guide for all writers and it is one I will keep around to assist me as I continue to write and possibly look to writing professionally in the future as well.\"</p>  <p style=\"\">\t Dad of Divas</p>Get Started Today ~ Only $19 Our 30 Day Money-Back Guarantee<p style=\"\">\t This course comes with a 30-day money-back guarantee. If for any reason you're not satisfied with your purchase, contact Udemy and you'll receive a full refund, no questions asked.</p>BONUS<p style=\"\">\t For everyone who purchases this course, you will receive a complimentary 30-minute coaching session where you can ask any question you like on how to market yourself as a freelance writer (value: $125). Simply contact me on Udemy and we'll arrange a time to get together.</p>Get Started Today ~ Only $19<p style=\"\">\t Yours in success,</p>  <p style=\"\">\t Nathan</p>  <p style=\"\">\t<strong style=\"\">P.S. </strong>This price offer is for a limited time only. It will increase in the near future so don't delay, sign up today.</p>", 
    "end_date": null, 
    "title": "How To Create A Successful and Sustainable Writing Career", 
    "price": "45.00", 
    "instructors": "Nathan Segal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374716_f47f_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-successful-and-sustainable-writing-career/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T23:17:49Z"
}