{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tLearn how to start a blog the right way!  </p>  <p style=\"\">  \t  Blog promotion is one of the biggest things that bloggers struggle with, but blogging doesn&#039;t have to be hard! This course compiles a few of the most effective techniques that I have used to promote Small Business Ideas Blog and <strong style=\"\">get thousands of social shares</strong> to some posts.  </p>  <p style=\"\">  \t  The goal for this course is not to overwhelm people with every blog marketing technique out there, but instead to focus on the <strong style=\"\">highest ROI techniques</strong> that influential bloggers are using today to quickly build a massive following. As a beginner, you need to be able to know how to promote your blog as quickly and effectively as possible.  </p>  <p style=\"\">  \t  Some concepts discussed include:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Blog Setup</strong> - How to get a professional blog set up quickly and inexpensively</li>  \t<li style=\"\"><strong style=\"\">Social Media</strong> - Where to focus your efforts on social media &amp; a few common pitfalls that cause bloggers to fail</li>  \t<li style=\"\"><strong style=\"\">SEO for blogging</strong> - Why SEO is much easier than most bloggers think and how to get ongoing traffic from the search engines</li>  \t<li style=\"\"><strong style=\"\">Outreach</strong> - How to connect and collaborate with other bloggers to scale your reach, even when you are just getting started</li>  \t<li style=\"\"><strong style=\"\">Guest Blogging</strong> - Is guest blogging dead? How to get featured on popular blogs and what to avoid when guest posting</li>  </ul>  <p>  \t  I also briefly go over some less common techniques that other A-list bloggers are using and my thoughts on them. The contents of this course are based on my own blogging experiences as well as a careful study of other highly successful blogs.  </p>", 
    "end_date": null, 
    "title": "How to Start a Blog: Blogging & Promotion Tips for Beginners", 
    "price": "50.00", 
    "instructors": "Brian Lang", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/401232_ab5d_2.jpg", 
    "course_url": "https://www.udemy.com/starting-a-blog/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T15:42:17Z"
}