{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>Searching for an Easy to Follow, Up-to-Date Copywriting Course?</strong>  </p>  <p>  \t<strong>Angry at The World Because You Have Such a Nice Product, Yet Get Less Sales Than Competitors with Lower Quality Products?</strong>  </p>  <p>  \t<strong>Don&#039;t You Want To Be Able To Tell Your Product’s Story At Its True Potential?</strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t      If that&#039;s you, then you need this copywriting course more than you need air.  </p>  <p>  \t      Look, I’m a normal guy, just like you and most people you know. I don’t like to think of myself as a “<em>copywriting guru</em>” as many experts call themselves. Then only thing that I have been privileged with, is to work for about 5 years in the advertising industry and test out dozens of copywriting ideas in tens of markets and see what works and what doesn’t.  </p>  <p>  \t<strong>HOW DOES THIS INTEREST ME?</strong> You might ask.  </p>  <p>  \t      Well it’s simple…<strong><em>instead of you spending thousands</em></strong> if not more on advertising to learn from your own mistakes, you will <strong><em>skip all the headaches</em></strong> I had and my years of trial and error. Consider this copywriting course your head-ache pill that you take before even feeling any pain.  </p>  <p>  \t      And just to make sure…  </p>  <hr>  <p>  \t<strong><em>Do you think I never had failed campaigns? Of course I had.</em></strong>  </p>  <hr>  <p>  \t<strong><em>Here are some other failures as well…</em></strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t      Michael Jordan lost over 300 games in his career.  </p>  <p>  \t      Dyson had 5,000 failed prototypes before making a vacuum.  </p>  <p>  \t      Edison failed 10,000 times before creating the light bulb.  </p>  <p>  \t<strong></strong>  </p>  <hr>  <strong>EXPERIENCE IS FAILURE.</strong>  <hr>  <p>  \t      But since we live in this information age, everything is now accessible and you can skip parts if not all of the trial phase by learning from someone who has been there done that.  </p>  <p>  \t      I’m not saying, you will be a world class writer after taking this copywriting course, but if you follow the rules and guidelines I laid out for you I guarantee you will be a damn good copywriter.  </p>  <p>  \t      Better than most copywriters I’ve seen at top 5 ad agencies anyway…  </p>  <hr>  <p>  \t<strong>SO HERE IS WHAT THIS COURSE WILL DO FOR YOU</strong>  </p>  <hr>  <ul>  \t<p>  \t\t      ·At least double your conversion rate  \t</p>  \t<p>  \t\t      ·At least double your sales  \t</p>  \t<p>  \t\t      ·At least double your Click-Through-Rate  \t</p>  \t<p>  \t\t      ·Make you get results and turn heads  \t</p>  </ul>  <hr>  <p>  \t<strong>DON’T BELIEVE ME?</strong>  </p>  <hr>  <p>  \t      Fine….  </p>  <p>  \t      If in 30 days you don’t get all and more of the results I said, feel free to ask for a 100% refund.  </p>  <p>  \t      It’s totally within Udemy’s refund policy. And I will ask it for you, that’s how sure I am of the quality and value of this course.  </p>  <p>  \t      BUT considering I have 3000 students so far with 45 reviews with an average of 5 stars I think my word means more than an empty promise to you.  </p>  <hr>  <p>  \t<strong>WHAT THIS COURSE COVERS (IN A NUTSHELL)</strong>  </p>  <hr>  <ul>  \t<p>  \t\t      ·Essential copywriting elements  \t</p>  \t<p>  \t\t      ·Creating head turning headlines  \t</p>  \t<p>  \t\t      ·Writing the perfect sales copy  \t</p>  \t<p>  \t\t      ·Tweaking your message to perfection  \t</p>  </ul>  <hr>  <p>  \t<strong>WHAT THIS COURSE IS BASED ON</strong>  </p>  <hr>  <ul>  \t<p>  \t\t      ·5 years of personal advertising experience  \t</p>  \t<p>  \t\t      ·Classic knowledge from the founders of copywriting (Ogilvy, Caples, Scwab)  \t</p>  \t<p>  \t\t      ·Updated knowledge from modern experts (Bencivenga, Makepeace, Kern, Godin)  \t</p>  </ul>  <hr>  <p>  \t<strong>TO SUMMARIZE </strong>  </p>  <hr>  <p>  \t<strong>What this course will do for you?</strong>  </p>  <ul>  \t<p>  \t\t      ·-get you more sales  \t</p>  \t<p>  \t\t      ·-make your message more effective  \t</p>  \t<p>  \t\t      ·-allow you to tell your story the way it deserves to be told  \t</p>  </ul>  <p>  \t<strong>What this course won’t do for you?</strong>  </p>  <p>  \t      ·-write sales copy by itself  </p>  <p>  \t<em>Besides following the lectures, taking notes, you have to </em><strong>PRACTICE</strong><em>.</em>And you won’t have to do it alone.  </p>  <hr>  <p>  \t      You can <strong>ask me anything in the discussions section</strong>.  </p>  <hr>  <p>  \t      I offer constant support along the way.  </p>  <p>  \t      I answer all questions within the same day to all my courses (Facebook, Twitter, Copywriting). <em>(Weekends as well…yes I am a workaholic).</em>  </p>  <p>  \t      So whenever you feel stuck, want feedback or just need a push in the right direction feel free to reach out.  </p>  <hr>  <p>  \t<strong> ALSO, I MADE IT EASY FOR YOU</strong>  </p>  <hr>  <p>  \t      I put a lot of effort in creating video animations so you will find this easy to follow and remember because of the fun and relevant visuals.  </p>  <p>  \t      Also you have additional resources in case you want to become even better at some of the topics covered.  </p>  <p>  \t      Print ready snapshots of the lectures that you can easily look at without having to scroll through the full videos.  </p>  <p>  \t      And quizzes that you can take and solidify your understanding of the principles and concepts of copywriting.  </p>  <hr>  <p>  \t<strong>Seriously NOW? What are you waiting for?</strong>  </p>  <hr>  <p>  \t      This is a <strong><em>no risk shot at making more money</em></strong> promoting what you love!  </p>  <p>  \t      So either click <strong>TAKE THIS COURSE</strong> at the top right of this page or continue to accept standard results. It’s Your Choice.  </p>  <p>  \t<em>Sincerely (and hopefully not too blunt),</em>  </p>  <p>  \t<em>Doru Catana </em>  </p>  <hr>  <p>  \t<strong>PS:</strong> <em>I really care about the quality of my courses and put a lot of work in research, formatting and also design (that’s why I publish one every few months) but what I do care even more about is getting people across the finish line and getting them to take action. So if you really want to get better at copywriting, I honestly encourage you to take this course.</em>  </p>", 
    "end_date": null, 
    "title": "How To Write an Effective Sales Messages & Promotions", 
    "price": "40.00", 
    "instructors": "Doru Catana", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296253_1e26_3.jpg", 
    "course_url": "https://www.udemy.com/winning-copywriting-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-08T10:32:08Z"
}