{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>Join over 2000 students who have already taken this course. Course last updated - 18th January 2016.</strong></p><p><strong>Latest review -</strong></p><p>\" This course provides you with an excellent step-by-step guide to launching your own business blog. Each lecture is succinct and provides you with all the necessary tools and software you need to create great content and distribute it effectively on social media. I would recommend this to any friend or colleague interested in starting a blog. Great course, Mike!\" --</p><p>Do you want to create <strong>a sales funnel</strong> that will generate its own leads for your start up or established business? <strong>Do you want to take away the grind of looking for new customers and have them look for you instead?</strong> 70% of my current clients came to me because of my business blog. Boom! You can achieve the same transformation.  This business blogging course will teach you how to blog successfully and how to use Social Media to promote your business blog and your business. It is an <strong>online version of the strategy I use with my consultancy clients who pay between $750 and $3000 per month</strong> for the strategy and implementation.</p><p>The course is made up of  over 2 hours and 30 minutes of course material broken down into 20 lectures and 15 quizzes.    </p><p>  \t                                            Take this business blogging course if you want to learn how to use blogging as your sales funnel for your business <strong>and you're ready to start living your new life now.   \t</strong>  </p>", 
    "end_date": null, 
    "title": "How to TurboCharge Your Business with a Blog", 
    "price": "50.00", 
    "instructors": "Mike Pitt", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40536_6dc6_12.jpg", 
    "course_url": "https://www.udemy.com/how-to-turbocharge-your-business-with-a-blog/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-07T17:54:42Z"
}