{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">&quot;Finally, Discover How to Create Successful and Engaging Podcasts That Instantly Will Brand You As The Expert and Drive Loads of Traffic Back To Your Products and Services…Starting Today!&quot;<br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t   Don’t know where to start?  Thinking “I’m a complete newbie, I can’t do this…”?  Well don’t! While podcast marketing is somewhat technical, we will cover the basic fundamentals to ensure you can create podcasts with ease.  This training course was created so you could quickly and easily implement this blueprint right away.In fact, most of this video course is screen-captured video, meaning you&#039;ll see everything on my screen as I walk you through the whole process.  </p>  <p style=\"\">  \t   There&#039;s No Theory Here!  </p>  <p style=\"\">  \t   Gone are the days where you could just put a product or service up and sell it.  Nowadays, you have to provide as much valuable content as possible to differentiate yourself from your competitors - who are likely not even doing this.  </p>  <p style=\"\">  \t   What this means is that if you do this, you will have a huge head start.  </p>  <p style=\"\">  \t   Now, branding yourself as the expert and as someone who is willing to give great content is absolutely crucial to gaining trust and converting sales.  </p>  <p style=\"\">  \t   Fortunately for you, this can easily be done through videos, podcasts, and more.  </p>  <p style=\"\">  \t   Today though, we’ll focus on podcasts.  </p>  <p style=\"\">  \t   Let’s take a quick look at some statistics here.  </p>  <p style=\"\">  \t   According to a research report done by Edison Research:  </p>  <p style=\"\">  \t   &quot;Just in the American market alone, the percentage of Americans who have ever watched or listened to a podcast is 45%, up from 43% one year ago. This is approximately 70 million Americans.”  </p>  <p style=\"\">  \t   Another interesting statistic…  </p>  <p style=\"\">  \t   “Over 80% of podcast consumers, who responded to a survey, agreed that “when price and quality is equal,” they don’t mind purchasing products on the podcasts they regularly enjoy.&quot;  </p>  <p style=\"\">  \t   So that is why the intro and outro are so important, which we’ll get into further down below.  </p>  <p style=\"\">  \t   Take a look at this one.  </p>  <p style=\"\">  \t   “90% of these respondents from the statistics above indicated that they had taken some kind of action as a result of podcast advertising or sponsorship, and over 40% reported purchasing behaviors, which indicates that they are receptive to the right message, in the right context.”  </p>  <p style=\"\">  \t   You see how powerful podcasts can be if done correctly?  </p>  <p style=\"\">  \t   You see how much traffic you could be missing out on by not having your own podcast?  </p>  <p style=\"\">  \t   So, if you’re not doing podcasts you could be missing out on this instant branding, and it’s really not hard to do once you surpass some of the technical requirements.  </p>  <p style=\"\">  \t   Want the answers to the questions above and more?  </p>  <p style=\"\">  \t   Buy this course!  </p>", 
    "end_date": null, 
    "title": "How To Start Your Own Podcast Network - Start Podcasting Now", 
    "price": "25.00", 
    "instructors": "How To Videos", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/212720_9272_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-your-own-podcast-network/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-08T01:03:49Z"
}