{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>When many people start blogging, they open up a new world of new connections and find a love writing about what they are most passionate about. Every blogger gets to a point in their career where they would like to turn their passion into profit. With this course, you will learn practical ways to get your blog to start paying your bills, and turn your blog into a real business. No matter what you blog about, from fashion, freelancing, business, and pets, this course will work for you! You will not find anything about Adsense here, but real life experience on how to get the time you spend online to pay off in the bank!</p><p><p>We cover the ways you know how, from Ads to Sponsorships, but we also go over ways that you may not have thought about before..... like:</p><p><ul><li><em>How To Contact A Business To Start Blogging For Them</em><br></li><li><em>Creating A Membership Site, No Matter What Type Of Blog You Have</em><br></li><li><em>Partnering With Other Bloggers To Create Info Products</em><br></li><li><em>And More!</em><br></li></ul></p>&lt;/p&gt;<p>Stepfanie Cuevas has been a blogger for over 7 years and has worked on social media campaigns with major companies from Kenmore to Redbox. On her blog and blogs on the Internet, she writes about everything from social media, parenting, to entrepreneurship. Stepfanie Cuevas frequently speaks at conferences about blogging and turning your blog into an income source that works for you. For more information, visit her at&nbsp;<a href=\"http://www.about.me/stepfaniecuevas.\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">http://www.about.me/stepfaniecuevas.</a></p>\r\n", 
    "end_date": null, 
    "title": "How To Get Your Blog To Pay Your Bills", 
    "price": "20.00", 
    "instructors": "Stepfanie Cuevas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20255_9bd4_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-your-blog-to-pay-your-bills/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-28T01:14:38Z"
}