{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">&quot;Your Sales Pages (Written, Video or Both) Are Your Online Sales People&quot;</strong>  </p>  <p>  \t        And like sales people, sales pages can either flop, sell a few, be average, good or truly outstanding.  </p>  <p>  \t        You can have all the other marketing strategies on the planet, but if your sales pages are not selling, you aren&#039;t going to make it.  </p>  <p>  \t        If you want to <strong style=\"\">skyrocket your online sales</strong>, build your important list or attract an avalanche of new clients then you must have sales page that are going to perform.  </p>  <p>  \t        One Billion .com&#039;s and Counting...  </p>  <p>  \t        With so many people trying to sell online a good sales page is not going to cut through the clutter. You need an outstanding page, written, video or both.  </p>  <p>  \t        This course is built on <strong style=\"\">12 proven steps that have generated millions in cash sales. Now you can create the same winning content for your sales pages. </strong>  </p>  <p>  \t        On this course you will learn:  </p>  <ul style=\"\">  \t<li><strong style=\"\">How </strong>and <em style=\"\">why</em> you must seize attention in a world full of distraction (I blow the lid on the myth about <strong style=\"\">&#039;Shrinking Attention Spans&#039; </strong>in your prospects)</li>  \t<li>How to create <strong style=\"\">killer headlines</strong> that instantly grab attention</li>  \t<li>How to identify the <strong style=\"\">pain</strong>, <strong style=\"\">problem</strong> or <strong style=\"\">frustration</strong> of your prospects (They will think you have been snooping through their private messages)</li>  \t<li>How to whip up a <strong style=\"\">buying frenzy </strong>in your prospects <strong style=\"\"><em style=\"\">before </em></strong>they even see your offer</li>  \t<li>How to <strong style=\"\">eliminate fear</strong> from any prospect so they will happily buy with you-more of the time</li>  \t<li>How to generate a <strong style=\"\">storm of urgency</strong> that compels prospects to <strong style=\"\">whip out their plastic</strong></li>  \t<li>How to use the <strong style=\"\">Law of Scarcity</strong> in your sales pages (This dramatically skyrockets results)</li>  \t<li><strong style=\"\"><em style=\"\">And so much more.</em></strong></li>  </ul>  <p>  \t<strong style=\"\">PLUS</strong>  </p>  <ul style=\"\">  \t<li>Contains REAL LIFE case studies and examples of content I have created that generated <strong style=\"\">274K in one day</strong>, over <strong style=\"\">5 million in 12 months</strong> and <strong style=\"\">multi-millions </strong>over 6 years.</li>  \t<li>The <strong style=\"\">psychology behind</strong> the 12 steps and how these steps <strong style=\"\">sell on an unconscious level</strong></li>  \t<li>This is just under <strong style=\"\">4 hours of PROVEN content making strategies</strong> that powerfully persuade your prospects unconscious buying process to <em style=\"\">buy now</em></li>  \t<li>With a 10 page workbook stuffed with <strong style=\"\">64 powerful questions</strong>, you will be able to create a persuasive sales page <strong style=\"\">within hours</strong> of completing the course.</li>  </ul>  <p>  \t        By the end of this course you will be able to write your very own powerful sales pages or script your own unique video sales letters.  </p>", 
    "end_date": null, 
    "title": "How to Write a Sales Page That Sells", 
    "price": "20.00", 
    "instructors": "Rob Hamilton", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420236_7aca_5.jpg", 
    "course_url": "https://www.udemy.com/skyrocketyoursales/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T14:34:51Z"
}