{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>A while back I was getting onto a train and struggling with my\n\nbags and eventually found a seat.<br>\n<br>\n\nFirst I got out the newspaper and struggled to read keeping my elbows tucked in,\n\nthat failed so I got out a novel but quickly got frustrated with the pages not staying open!<br>\n<br>\n\nOk I thought, get out the laptop and catch up on some of those pdf ebooks I\n\ndownloaded last week, that was ok for about half an hour until the battery died!<br>\n<br>\n\nAnyway in all that the time, the guy sitting next to me was really quiet and\n\nseemed quite relaxed, I glanced over and he had this really slim gray tablet thing on his lap\n\nand was reading.<br>\n<br>\n\nI'd never seen this before so interrupted him to inquire.<br>\n<br>\n\n'Oh it's my Kindle' he said, 'a what?' I asked<br>\n<br>\n\nHe replied 'I have to be honest I'm not one for gadgets but I love this,\n my wife bought it for my birthday as I like to travel light but miss \nreading stuff'.<br>\n<br>\n\n'Yea, but aren't you limited to what's available to read' I said<br>\n<br>\n\n'Well if you call 650,000 ebooks, 9000 blogs, newspapares and magazines as well\n\nas access to my personal documents then I suppose, yes!'<br>\n<br>\n\nI was stunned, so I came back with a smart reply..'I bet the battery runs out\n\nquick and you can only read it in a darkened room though?'<br>\n<br>\n\nHe replied 'Well there's up to 1 month's battery and you can read in \nbright\n\nsunlight because this latest Kindle's screen is 50% brighter than \nprevious ones, also I hate technology and gadgets so this is perfect for\n a non-techie like me.<br>\n<br>\n\nHe then asked me what I did for a living and I said 'information publisher',\n\n'tell me the titles of some of your books and I'll see if I can find them on Amazon to download' <br>\n<br>\n\nWell this WAS embarassing - I had NOTHING published in the Amazon Kindle\n format and had only just heard what one was! Dollar signs were going \naround in my head\n\nas to how much money I was LOSING by not having anything available on \nAmazon\n\nKindle.<br>\n<br>\n\nNow I'm not trying to sell you a Kindle here, but after also learning that there\n\nare now something like 4 million of these around the world if you are the same as me\n\nand have previously published ebooks or are thinking about it now then you're\n\nprobably worried that you may have already MISSED THE BOAT.<br>\n<br>\n\nI am now quickly catching up on how to join in on this amazingly lucrative\n\nopportunity  and have spent the last few weeks finding out exactly what's involved in\n\nbecoming a publisher on Amazon Kindle and can now share that hard work with you.<br>\n<br>\n\nI thought it would be too unfair to keep all these gold nuggets of information\n\nto myself, especially as this marketplace is HUGE and there's more than enough for\n\nEVERYONE.<br>\n<br>\n\nSo you can learn IMMEDIATELY what has taken me weeks to find out and be up and\n\nrunning WITHIN THE NEXT 24 HOURS. <br>\n<br>\n\nI'll show you how to find profitable niches that Amazon readers love, prepare\n\nyour ebook in the correct Kindle format and upload it to Amazon.<br>\n<br>\n\nAmazon Kindle stores your ebook, easily lets its readers find you, takes\n payment\n\nthen shares the revenue with you! Once uploaded you can leave it all on \nautopilot or drive traffic to your sales page, sit back and rake in the \nmoney!</p>\n<p>Sales\n\nFact: There's a HUGE demand for the <strong>Amazon\n\nKindle</strong>.\n\nThat's right...On November 19, 2007, Amazon released the Kindle First\n\nGeneration. Within five and a half hours it sold out! Keep in mind that\n\nthe device remained out of stock for another five months, until late\n\nApril 2008.</p>\n<p>You see, another\n\nhuge factor for Amazon Kindle’s growth, is it makes things easy for\n\nusers.</p>\n\n<table>\n<tbody>\n<tr>\n<td><img alt=\"\" height=\"25\" src=\"http://www.kindlewithatwist.com/images/icon_r2_c35.png\" width=\"25\"></td>\n<td>\n<p><strong>eBooks\n\nare Cheaper</strong></p></td></tr>\n<tr>\n<td><img alt=\"\" height=\"25\" src=\"http://www.kindlewithatwist.com/images/icon_r2_c35.png\" width=\"25\"></td>\n<td>\n<p>Users\n\ncan download the first chapter of any book for free, which can increase\n\nsales.</p></td></tr>\n<tr>\n<td><img alt=\"\" height=\"25\" src=\"http://www.kindlewithatwist.com/images/icon_r2_c35.png\" width=\"25\"></td>\n<td>\n<p><strong>iPhone\n\nowners can buy Kindle books and read them on their phones (This is\n\nhuge!)</strong></p></td></tr>\n<tr>\n<td><img alt=\"\" height=\"25\" src=\"http://www.kindlewithatwist.com/images/icon_r2_c35.png\" width=\"25\"></td>\n<td>\n<p>Kindle\n\nis portable and simple to use for everyone. (Made for reading...good\n\nfor people that are less techy)</p></td></tr>\n<tr>\n<td><img alt=\"\" height=\"25\" src=\"http://www.kindlewithatwist.com/images/icon_r2_c35.png\" width=\"25\"></td>\n<td>\n<p><strong>Besides\n\neBooks, you can read newspapers, magazines and blogs on your kindle.</strong></p></td></tr>\n<tr>\n<td><img alt=\"\" height=\"25\" src=\"http://www.kindlewithatwist.com/images/icon_r2_c35.png\" width=\"25\"></td>\n<td>\n<p>It’s Fast... just buy\n\na book and it is auto-delivered wirelessly in less than one minute.</p></td></tr>\n<tr>\n<td><img alt=\"\" height=\"25\" src=\"http://www.kindlewithatwist.com/images/icon_r2_c35.png\" width=\"25\"></td>\n<td>\n<p>And Much More</p></td></tr></tbody></table>\n<p><strong>Benefits\n\nfor YOU, the Publisher:</strong></p>\n<p>As\n\nyou've seen from above, you have access to a massive market of readers,\n\nwho want specific ebooks. Amazon Kindle has made it so easy for anyone\n\nto use their system, and because of that, the market just keeps growing.</p>\n<p>What\n\nabout security? Is it safe to put your ebooks online? Yes, ebooks\n\nbought at Amazon are protected by AZW DRM. This way Kindle readers\n\ncan't share your books with their friends.</p>\n<p>Problems\n\nyou may face: You may have written a great Book, but you don't know how\n\nto publish it onto Amazon Kindle. You're worried it's too technical and\n\nyou just don't know how to start.</p>\n<table>\n<tbody>\n<tr>\n<td><strong>- How do you make your Book\n\ndigital?</strong><br>\n<br>\n\n- How do you price your eBook?<br>\n<br><strong>- How do you promote your eBook?</strong><br>\n<br>\n\n- How do you improve your eBook, so that it adds value and sells?</td></tr></tbody></table>\n\n<p>If you've always dreamt\n                                    about being a published author but were worried about running the gauntlet\n                                    of submitting your work to publishers only to feel humiliated and rejected time\n                                    after time, this is your chance to get your own back and beat the big boys at\n                                    their own game!</p>\n<ul><li>\n<p>No more\n                                                submitting manuscripts that you have sweat blood over</p></li><li>\n<p>No more\n                                                thoughts of printing your own books and advertising them yourself\n                                                at huge expense and risk!</p></li><li>\n<p>No more\n                                                waiting for a letter or phone call, usually of rejection!</p></li></ul>\n<p>Are you tired of all the<strong> hype about making money online</strong> and throwing your hands up in\n                                    frustration, day after day? Continuously hearing about this method or that\n                                    method and how you will become instantly rich?<br>\n<span><br>\n<span><span>Unfortunately that’s the same story alot of us online have\n                                    experienced; empty promises that end up going no where.</span><br>\n<br>\n<span><span>What if I could show you a way to make money online that’s truly\n                                    legitimate, a no-nonsense method that’s growing at an unprecedented rate with\n                                    all signs indicating that it will be, now and into the future, for a long time\n                                    to come.</span><br>\n<br>\n<span><span>A proven business model with one of the largest companies in the\n                                    world, and that company is <strong>Amazon</strong>!</span><br>\n<br>\n<span>How would you like to tap\n                                    into one of the Hottest Niche Markets on the Web?<br>\n<span><br>\n<span>According\n                                    to top researchers, nearly $1 billion dollars worth of ebooks were sold last\n                                    year and by the year 2015 that number is expected to grow to over $3 billion\n                                    dollars...<br>\n<br>\n                                    Ebooks are changing the face of the publishing industry as we know it.<br>\n<span>Well I’ve done some\n                                    extensive research and have developed a Killer product for you today that will\n                                    reveal how you can make money online as a Kindle Publisher. A product that can\n                                    generate non-stop Kindle Sales month after month on\n                                    autopilot.</span></span></span></span></span></span></span></span></p>\n<p>The Secret for Generating a Long Term\n                                        Passive Income is Here... </p>", 
    "end_date": null, 
    "title": "Kindle With A Twist", 
    "price": "20.00", 
    "instructors": "Peter Twist", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25876_1951_4.jpg", 
    "course_url": "https://www.udemy.com/harness-the-selling-power-of-kindle/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-03T11:15:20Z"
}