{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">Looking to get started with E-book publishing but getting stuck with these questions?</strong></p><ul style=\"\"><li>&quot;How do I prevent competition from coming in and drowning me out of the market?&quot;</li><li>&quot;Won&#039;t people not buy my book if they&#039;ve never heard of me?&quot;</li><li>&quot;What are some examples of niches that are still viable -- and why?&quot;</li><li>&quot;How long should my book be? If it&#039;s really long, wouldn&#039;t it be really expensive to create?&quot;</li><li>&quot;Should I be pricing my book lower than my competitors? Is that how you get sales in the beginning?&quot;</li><li>&quot;How do I make my book look like it&#039;s been professionally done?&quot;</li><li>&quot;How do I make sure that my book will sell?&quot;</li><li>&quot;How do I get book reviews without harassing family members or friends?&quot;</li><li>&quot;What exactly should I pay to get a book written?&quot;</li></ul><div style=\"\"><strong style=\"\">The Kindle Evergreen program will answer to all of these questions</strong><p>This is the step-by-step system that&#039;s going to help you build a reliable, long-term source of income through publishing authentic, high-value books</p><p><strong style=\"\">Inside this program, you&#039;ll discover strategies like..</strong></p><ul style=\"\"><li>&quot;Evergreen-Positioning Method&quot; a 3 step framework that prevents you from being drowned out in trending, &quot;competitive&quot; niches</li><li>The Content repackaging strategy for flipping 1-off books in to multi-book series</li><li>Veteran Results From the Get-go - How to achieve reliable sales numbers with your very first book</li><li>&quot;Quote N Flip&quot; Simple, first-time-authors&#039; technique for building authority without any credentials</li><li>Commonalities of 2-year-running top-selling titles - How to engineer these things in to your books</li><li>The Book length Myth - Creating customer satisfying, inexpensive books that are priced at $2.99 or more</li><li>Writers Optimal Pricing Cheat Sheet - What to expect for how much you pay</li><li>&quot;Congruency Authorship Technique&quot; - Creating a Trust building Pen Name that Ensures sales without being deceptive</li><li>The automated system for creating authentic book descriptions that sell</li><li>3 communication laws that prevent freelancers from becoming business-sabotaging renegades</li><li>How to prevent Kindle Copyright Infringement Penalties - 2 tools for detecting plagiarism</li><li>The complete Book Launch checklist - Complete list of components for avoiding the &quot;cheap&quot;, &quot;self published&quot; look</li><li>The 5 Rules for Professional Book Cover Creation</li><li>2 non-exhausting, harassing-free methods for gaining book reviews</li><li>Introduction and importance of the 5 High-leverage rank boosting platforms for increasing sales</li><li><strong style=\"\">&quot;</strong>Stamp of approval strategy&quot; - 3 step quality control method to ensure customer satisfaction</li></ul><p>And many more! See you inside the course</p></div>", 
    "end_date": null, 
    "title": "Kindle Evergreen Book Publishing System", 
    "price": "25.00", 
    "instructors": "Brian Yang, Saeed Rajan", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436054_ef0d.jpg", 
    "course_url": "https://www.udemy.com/amazon-kindle-publishing/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T00:51:39Z"
}