{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Who is this course for?</strong></p>  <p>This course is for those who are interested in getting more traffic to their blog for free.</p><p><strong>What is this course about?</strong></p>  <p>The purpose of this course is to teach students how to get viral traffic to their blog for free. Students will be taught what makes a blog look more professional and trust worthy to their visitors. Students will be taught what viral blogging is, and how to find hot trending topics that have a better chance to go viral.</p>  <p>Students will be introduced to popular link sharing platforms and social media platforms that will significantly increase their chances of going viral, which will result in receiving a lot more traffic going to their blog.</p>  <p><strong>What kinds of materials are included in this course?</strong></p>  <p>Students will be able to view a total of 10 videos. Students will be giving a list of resources at the end of the course.</p>  <p><strong>How long will this course take to complete?</strong></p>  <p>This course will take thirty-four minutes to complete.</p>  <p><strong>How is this course structured?</strong></p>  <p>The first few videos of this course starts out on slower pace but then picks up later as the student continues to advance throughout the course, and start applying what they learned from the lessons. In order to receive the best results for this course students are highly encouraged after watching a video to apply what they learn from that videos content before they start moving on to the next set of videos.</p>  <p><strong>Why should students want to take this course?</strong></p>  <p>Students should want to take this course if they are looking for a free way to get viral traffic to their blogs. Getting more traffic to your blog can significantly increase conversion rates which can help increase the chances of your blog getting more sales, or AD revenue.</p>", 
    "end_date": null, 
    "title": "Learn how to get viral traffic to your blog for free", 
    "price": 0, 
    "instructors": "Tico Smith", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/795250_8f25_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-get-viral-traffic-to-your-blog-for-free/", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T23:45:05Z"
}