{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t         This course is designed for anyone trying to produce content to be published and distributed online.  </p>  <p style=\"\">  \t<strong style=\"\">What You&#039;ll Learn and Who It&#039;s Designed For</strong>  </p>  <p style=\"\">  \t       Mike Roberts will provide a practitioner’s framework that can be referenced when creating content designed to be shared on social channels. This class is designed to give content and social media marketers tons of free or affordable tools, 63 practical examples and case studies, 48 concepts, 20 research studies, and 55 actionable recommendations; all designed to specifically help you produce highly shareable content.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">This is World Class Content</strong>  </p>  <p style=\"\">  \t  I have presented this material at some of the most prominent industry conferences for audiences that pay thousands to attend. I have also taught this in the online marketing class that I teach at San Diego State. You get the same material far cheaper than any of them. I also teach you the exact processes that I use to develop extremely shareable content for some of the biggest and best known brands in the world. I pull back the curtain to show you every step of the process.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">The Course Structure and More About What it Covers</strong>  </p>  <p style=\"\">  \t       The first part of the course will give a suite of resources that will enhance topic research, content brainstorming, content development, internal workflow and approvals, content synergy with social media and how to measure value and effectiveness of a content marketing program. The second part of the course will focus on the distribution of content on a variety of channels and how to effectively promote content.<br style=\"\">  \t<br style=\"\">  \t       This class will cover the pain points most marketers are hitting today and then explore more advanced opportunities such as interactive content, personalized content, and dynamic content.<br style=\"\">  \t<br style=\"\">  \t  You&#039;ll walk away with a list of actionable takeaways that can be implemented right away and a road-map for those looking to mature their program.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Calculate the ROI.</strong>  </p>  <p style=\"\">  \t  How much is an increase in traffic to your website worth to you? How much would you pay to earn a large increase in followers, Likes, and social engagement. I would guess that the price for this course is significantly less. Also, you can refer back to this course again and again on into the future so it will pay off for years and years down the road.  </p>", 
    "end_date": null, 
    "title": "Learn to Triple your Traffic and Social Sharing", 
    "price": "25.00", 
    "instructors": "Mike Roberts", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/92842_873e_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-produce-viral-content/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-16T03:06:22Z"
}