{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Are You Writing Your Own Copy, But Frustrated by the Results? Then...</span>  </p>  <p style=\"\">  \t<strong style=\"\">Discover the Copy writing Short-Cut Which Forces Your Prospects to Read Your Entire Sales Letter and Buy, Even If You are Just Getting Started...</strong>  </p>  <p style=\"\">  \tMost marketers will tell you that you need to oursource your copywriting, because frankly they think you're not smart enough to do it right...  </p>  <p style=\"\">  \t<span style=\"\">Here's what you'll learn ...</span>  </p>  <p style=\"\">  \tHow I reveal my most coveted traffic secret to a room of hundreds of competitors and how this boosted my sales, even after I raised the price of my product on my sales page.  </p>  <p style=\"\">  \tHow to enter the mind of your prospect and why speaking to only one person, will triple your conversions and profitability.  </p>  <p style=\"\">  \tWhy speaking about too many things and giving people too many options will kill your opt-in rates.  </p>  <p style=\"\">  \tLearn the most important commandment for writing hypnotic sales copy and if you're nice, I might tell you the other nine.  </p>  <p style=\"\">  \t<span style=\"\">Learn </span>The two most powerful and persuasive words to use in your copy.  </p>  <p style=\"\">  \t<span style=\"\">Learn </span>Two questions you must answer in your copy to get and keep attention.  </p>  <p style=\"\">  \tRevealed 8 Proven formulas for headlines (I give you my top “fill in the blanks” headline formulas)  </p>  <p style=\"\">  \tRevealed bullet formulas that create fascination and desire for your product or service.  </p>  <p style=\"\">  \tThe “secret” guarantee that you can offer that can double or triple your sales <span style=\"\">…and much, much more.</span>  </p>", 
    "end_date": null, 
    "title": "Learn How to Write Powerful Business Promotional Copy Fast", 
    "price": "50.00", 
    "instructors": "Online Expert Academy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396404_72e4_2.jpg", 
    "course_url": "https://www.udemy.com/copywritingexpert/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-17T08:23:55Z"
}