{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Do you want to grow your mailing list? </strong></p><p><strong>Are you struggling to even get your first subscriber? </strong></p><p>Then <em>List Building: Definitive Guide To 1000 Subscribers</em> is for you!</p><p>We'll be using inbound marketing and content marketing to attract, capture and convert prospects by offering them incredible value with lead magnets and getting them to sign up on landing pages. </p><p>I will be taking you step by step by step through the entire process, we'll even create our first lead magnet together over the course of a 2 hour challenge. </p><p>I've included everything you need to get started:</p><ul><li>The theory behind lead magnets and landing pages</li><li>The story of how I got my first 1000 subscribers</li><li>The different types of landing pages you can create with REAL WORLD examples</li><li>An in-depth tutorial on how to create landing pages using Unbounce</li><li>Interviews with top experts like Oli Gardner from Unbounce</li><li>Cheatsheets, templates and checklists</li><li>You can even test your knowledge with multiple choice quizzes</li></ul><p>By the end of this course you'll be on the road to increasing your subscriber count, connecting with more people who care about your products and services and be seen as an authority in your niche. </p><p><strong>Sound exciting? </strong></p><p>Then lets do it! Enrol today but clicking the \"Enrol Now\" button to get started... <br></p>", 
    "end_date": null, 
    "title": "List Building: Definitive Guide To 1000 Subscribers for 2016", 
    "price": "20.00", 
    "instructors": "Lawrence Howlett", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/771916_4a3f_2.jpg", 
    "course_url": "https://www.udemy.com/1000subscribers/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-23T17:31:09Z"
}