{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Imagine for moment ...</strong></p><p><strong></strong>You are out on the golf course or out camping with your family. Before you begin your round of golf, or begin your weekend camping trip you check your sales either through Clickbank, Paypal, or your merchant account. You proceed to do the things you enjoy doing. At the end you check your account, and you realize you actually made money while you were golfing, or while you were camping!     <em>Seriously!</em><br></p>\n\n<p>  \t      This is the reality of many folks who have membership sites going for them! You don't even have to do anything before you go play that round of golf or go camping to see this happen!  </p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">Literally Make Money While You Are Having Fun</strong>  </p>\n\n<p>  \t      Now don't get me wrong having an email list is awesome, and it is something all online business owners should shoot for. The point is simply that with passive income membership sites you just go about your business, and make money! When I say your \"normal business\" I mean even fun stuff. What you would normally do for a hobby like playing golf, camping, going to watch your favorite sports team, taking your kids to the zoo, doing a mission trip with your church, volunteering at your kids school, etc.  </p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">Who Can Start A Membership Site?</strong>  </p>\n\n<p>  \t      Membership sites are great for any experience level! Actually if you are brand new to generating income online you should use this business model! It is an awesome way to make money. Your niche does not matter either!   \t  \t      Here are some examples of industries where membership sites can be found:  \t        * Sports training  \t        * Real Estate  \t        * Internet marketing  \t        * Fitness training  \t        * Dieting  \t        * Content for youth pastors  \t        * Cooking  \t        * Plus many more niche markets.  </p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">If you're truly serious about building a solid stream of income, this is the perfect course for you. No prior experience is required! The only things you'll need are a domain name and membership site software <em>(I'll tell you the best one to use).</em></strong>  </p>\n\n<p>  \t    I'm readily available to answer any questions you might have. Thanks for taking this course and enjoy the journey with me!  </p>", 
    "end_date": null, 
    "title": "Membership Site Plan: How To Earn Monthly Passive Income", 
    "price": "20.00", 
    "instructors": "Ricardo Soto", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431714_6925_6.jpg", 
    "course_url": "https://www.udemy.com/membership-site-plan-how-to-earn-monthly-passive-income/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T05:50:54Z"
}