{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t       That time when you’re first starting out can be one of the most confusing times in your online business journey.  </p>  <p style=\"\">  \t       You have lofty ambitions. And you certainly know that you want the freedom and fulfillment that will come along with running your own online business which is sustainable. Problem is…  </p>  <p style=\"\">  \t       You’re stuck at the starting line. And you’re stuck because you haven’t yet ironed down that big thing that every blogger has to decide at the outset:  </p>  <p style=\"\">  \t<strong style=\"\"> What is going to be your niche?</strong>  </p>  <p style=\"\">  \t       Now, in all likelihood, you already have some sort of idea which way you want to go. Or perhaps you have a few potential ideas. Thing is…  </p>  <p style=\"\">  \t       You’re doubtful. You’re unsure. You don’t really know if this idea you have is really a good one or not.  </p>  <p style=\"\">  \t       And so you remain paralyzed at this point. Stuck at the starting gate.  </p>  <p style=\"\">  \t<strong style=\"\">“It Seems So Complicated!”</strong>  </p>  <p style=\"\">  \t       That’s the problem with selecting a niche. Because it gets over-complicated by all kinds of fairly in-depth analysis like  </p>  <ul style=\"\">  \t<li style=\"\">Keyword research (which usually seems to involve buying some kind of tool just to do it)</li>  \t<li style=\"\">Competition research</li>  \t<li style=\"\">SEO Analysis</li>  </ul>  <p style=\"\">  \t       And it all seems to get pretty numerical real fast… almost as if you’re supposed to be some kind of spreadsheet ninja just to figure it out.  </p>  <p style=\"\">  \t       And this paralyzes a lot of people. When you’re first starting out, information overload is already fairly common. And now you’re being told that in order to even get started, you’re supposed to do all this complicated stuff just to have any idea whether you could pull it off or not?  </p>  <p style=\"\">  \t       Well, THAT SUCKS. And it doesn’t have to be that way.  </p>  <p style=\"\">  \t<strong style=\"\">Let Me Walk With You Through Selecting Your Niche</strong>  </p>  <p style=\"\">  \t       Since I try to simplify everything, I’ve done that with the topic of niche selection and evaluation.  </p>  <p style=\"\">  \t       It doesn’t have to be made overly complicated.  </p>  <p style=\"\">  \t       Of course, those things above are important – and I’ll show you how to do it. But, it is also important to have perspective. Because, there are other “big picture” considerations on what niche you should go into. It isn’t all a matter of keyword research.  </p>  <p style=\"\">  \t       One thing is clear… a decision has to be made. And you need to move forward. All the good things that come along with an online business can’t begin until we get this particular hurdle passed.  </p>  <p style=\"\">  \t <strong style=\"\">Inside, you will find:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">How to nail down your “why”, and why it is WAY more important than any keyword research</strong></li>  \t<li style=\"\"><strong style=\"\">An easy-to-follow decision flow chart to guide you through the process of evaluating a niche</strong></li>  \t<li style=\"\"><strong style=\"\">A niche evaluation worksheet, which filling out will walk you through many important aspects of the niche.</strong></li>  \t<li style=\"\"><strong style=\"\">Various techniques for determining the demand that would be there in the niche.</strong></li>  \t<li style=\"\"><strong style=\"\">The one factor which is more important than WHAT to blog about.</strong></li>  \t<li style=\"\"><strong style=\"\">How to research and find “competition”</strong></li>  \t<li style=\"\"><strong style=\"\">How to alleviate any potential indecision or paralysis which may be left over after this analysis.</strong></li>  </ul>  <p style=\"\">  \t       At the end of this course, you will have the opportunity to get direct feedback on your niche ideas. It is included with your enrollment.  </p>  <p style=\"\">  \t       In the end, you will have made a decision. And you’ll know your path and you’ll be on your way.  </p>", 
    "end_date": null, 
    "title": "Niche Confidence: Discovering And Evaluating Your Blog Niche", 
    "price": "35.00", 
    "instructors": "David Risley", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/173470_a87a_3.jpg", 
    "course_url": "https://www.udemy.com/blogging-niche/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-26T22:16:05Z"
}