{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>I honor those who are ready to take action. Each week the price of the course will incrementally go up. So if you are interested in getting in at the very best price its time to take action. The price is headed to $197 so there is no time like the present. :) I look forward to seeing you in the course!<br style=\"\"></p><p>About this course:<br style=\"\"></p><ul style=\"\"><li>Create a Podcast with no technical or audio background </li><li>Learn key techniques that will separate you from the amateurs </li><li>Full, free lifetime access All future extra lectures and upgrades are always included for free </li><li>Unconditional Udemy 30 day money-back guarantee - that&#039;s my personal promise of your success! </li><li>Bonuses and opportunities for live interaction that will increase your income even more!</li><li> Resource Guide with all of the very best places to save you thousands on equipment and services </li></ul><ul style=\"\"><li>SEE HOW I GET: </li><li>A full time living through my podcasts and voiceover work </li><li>Hundreds of thousands of listeners </li><li>....with absolutely no skills or background in audio at the beginning </li></ul><p style=\"\">You can create a marketing revolution for yourself, or business with no prior experience in this field. Whether your goal is an income, a hobby, or a business. Podcast Essentials shows the the foundation for creating a podcast with excellence. </p><p style=\"\">I will show you exactly what equipment you will need, where you can find it, and how to get the very best prices. </p><p style=\"\">Based on my momentum in the podcasting industry and voiceover world. I can show you exactly what you need to learn and buy without that expensive learning curve I had to go through myself. </p><p style=\"\">Whether you already have a Podcast or not, you can learn the Essentials that will take you much farther in your Podcasting Journey. It isn&#039;t just about talking into a microphone or recording your buddies. Podcasting is a fine art. You have to craft the perfect podcast to attract new listeners, clients, and customers. But if you follow my step by step guide you will have the essentials for true success. </p><p style=\"\">YOU&#039;LL LEARN: </p><ol style=\"\"><li>How to nail down a topic</li><li> Craft your Unique Story </li><li>All about Podcast branding and graphics </li><li>What format your podcast should use </li><li>The best places to find Voiceover artists for your introduction </li><li>All the pro tips on Podcast Equipment and what NOT to buy </li><li>Step by Step Mic Equipment Setup </li><li>Mic Techniques that will make your voice sound like honey or boom like thunder</li><li>Recording Tips Audio Editing from step 1 to done </li><li>... and much, much more! </li></ol><p>You can have your own niche podcast running in a matter of weeks! Podcasting gives your voice to the world and skyrockets your marketing in ways you will never imagine. But only if done properly with Podcast Essentials at the core. </p><p>Anyone can talk into a microphone but only those who take the time for the essentials can make a living doing it. </p><p>Click the &quot;take this course&quot; button, top right, now ... your bootstrap marketing all begins with Podcast Essentials. </p><p>Rye Taylor- Podcast Strategist and Voiceover Artist</p>", 
    "end_date": null, 
    "title": "Podcast Essentials: The Bootstrap Marketing Toolkit", 
    "price": "20.00", 
    "instructors": "Rye Taylor", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412230_818c_3.jpg", 
    "course_url": "https://www.udemy.com/podcastessentials/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T14:18:31Z"
}