{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>“Discover How To Hit Your Sales By Following The Simple And Proven Step-By-Step Professional Hitting Copywriting Methods To Creating Hypnotic Sales Copy That Turns Visitors Into Eager To Buy Paying Customers!”</strong><br>  \t<br>  \t  Tired Of Losing Money On Advertising Because Your Sales Letter Won’t Covert The Visitors To Your Website Into Paying Customers? <br>  \t  Then… This professional Copywriting course is designed for aspiring copywriters or webmasters who want to learn the art of persuasive  Follow the easy copywriting methods and techniques outlined in this brand new, straight to the point, and your visitors will go from suspicious readers to trusting, eager to buy customers at the blink of an eye…<br>  \t<br>  \t<br>  \t<strong>Extreme Importance &amp; Power of good sales copy!</strong><br>  \t<br>  \t  Let’s say you have a $97 product and a decent sales letter up on your website that converts visitors to buyers at 1%.  </p>  <p>  \t  Let’s also say that you drive 3000 unique visits to your website a month, so at 1% you would be making $2910 (minus advertising costs and expenses).  </p>  <p>  \t  That’s not bad! But after a while you get bored with that number and decide you want to double your income. Now there’s three ways  you can do that:  </p>  <p>  \t  You can double the price of your product from $97 to $194 (this will probably kill your 1% conversion and your overall profits would drop)  </p>  <p>  \t  You could try driving double the traffic to your website and see what happens (this is not always easy, as traffic does not come on demand – it can also be a costly choice)  </p>  <p>  \t  Or, you could work on improving your sales copy and increase your conversion rate to 2% (if you have a good product this is a very possible) Just imagine what you could do with the cash from more sales!  Think of how great it will feel when the family wants to go out to eat and you don’t have to tell them that going out to eat is not in the budget!  </p>  <p>  \t  That is how powerful good sales copy is.  </p>  <p>  \t  Just by tweaking and improving your sales letter you can go from:  </p>  <p>  \t<br>  \t<br>  \t  3000 visitors a month with a $97 product converting at 1% for a total of $2910 in sales to:  </p>  <p>  \t<br>  \t  3000 visitors a month with a $97 product converting at 2% for a total of $5820 in sales!  </p>  <p>  \t<br>  \t<br>  \t<br>  \t<strong>\"With Over 5-Hours of Video Training\"</strong>  </p>  <p>  \t<br>  \t<br>  \t  Here’s Just A Small Example Of What You’ll Learn In The “Professional Copywriter’s “ Course:  </p>  <p>  \t<br>  \t<strong>1. </strong>How to use persuasion methods in your sales message to get what you want when you want it!  </p>  <p>  \t<br>  \t<strong>2.</strong>The Basic elements of the sales letter and why it is important to follow them (once you get these fundamentals into your head, writing sales letters will become easier and easier)  </p>  <p>  \t<br>  \t<strong>3.</strong>The basic parts of a standard sales letter explained. Everything from the headline to the P.S. (Post Script)  </p>  <p>  \t<strong>4.</strong>    How to create attention grabbing headlines that grab your readers by their throat and lead them into your offer (the headline is considered by many to be the most important part of the sales letter)<br>  \t  And so much more…<br>  \t<br>  \t  This is going to be a refreshing change. That’s because The Professional Copywriters Course will give you a paint-by-numbers blueprint to follow to writing high converting Sales Copy that draws your customers from your killer headline to your persuasive call to action that will have your visitor depositing money directly into your bank account.  </p>", 
    "end_date": null, 
    "title": "Professional Copywriting Training", 
    "price": "40.00", 
    "instructors": "Earners Classroom", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/51536_0cb0_6.jpg", 
    "course_url": "https://www.udemy.com/professional-copywriting-course/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-27T19:19:08Z"
}