{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">My Udemy courses have been taken 100,000 times by over 25,000 students, have been awarded countless 5 stars reviews. </strong><em>That is all the proof we need that our methods work!</em></p>\n\n<p><em>LATEST: Course Up to date for 2016. Only fresh information.</em></p>\n\n<p>Hey,</p>\n\n<p>If you've been following me for a while then you know I have quite a few tricks up my sleeves. Recently, I added a killer method to my arsenal.</p>\n\n<p>In just a few minutes everyday, I write simple and short ebooks on just about any topic related to internet marketing. <strong class=\"redactor-inline-converted\">Then, I upload them to a simple platform and use them to drive insane amounts of traffic back to my website.</strong></p>\n\n<p>One simple 12 pages ebook I uploaded four days ago has added 550 people to my email list, and took me under 45 minutes to write.</p>\n\n<p>Imagine this..</p>\n\n<p>You write an ebook in 30 minutes using my special method (you'll be surprised at what it is), and you get traffic daily for at least 6 months afterwards.</p>\n\n<p>Skeptical ? <strong>Watch the promo video to get an insider look!</strong></p>\n\n<p>Join now and let's get started!</p>\n\n<p>All of our 25 courses come with an unbreakable 30 Days money-back guarantee, that is our personal promise of quality.</p>\n\n<p>Cheers!</p>\n\n<p>-Howard</p>", 
    "end_date": null, 
    "title": "Publish Ebooks For Traffic for Beginners + Case Study", 
    "price": "20.00", 
    "instructors": "Howard Lynch", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/825028_4dd1_2.jpg", 
    "course_url": "https://www.udemy.com/publish-ebooks-for-traffic-for-beginners-case-study/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-18T13:12:29Z"
}