{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t When people talk about website content writing these days, they&#039;re typically talking about the posts, articles, videos and podcasts that <strong style=\"\">companies use to attract visitors to their website.</strong>  </p>  <p style=\"\">  \t There are <strong style=\"\">a lot of great reasons to use online content to market your business</strong> - you can <strong style=\"\">attract more traffic</strong>, <strong style=\"\">establish your expertise</strong> and <strong style=\"\">earn the trust that turns your website&#039;s visitors into customers</strong>.  </p>  <p style=\"\">  \t Heck, even <strong style=\"\">Google</strong> changed their search engine so that sites with great content float to the top of their search results pages.  </p>  <p style=\"\">  \t However, <strong style=\"\">creating content can be challenging</strong>. It takes time. Not everyone enjoys writing and many folks just don&#039;t like to write at all. Writing content for website means trouble to them!  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">But what if</em></strong> there was a way to quickly and easily create the kind of content that attracts your target customers?  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">What if</em></strong> you could use that content to build so much credibility, authority and trust that potential customers are driven to take action by buying your products and services, following you on social media sites and signing-up to get your newsletters?  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">And, what if</em></strong><strong style=\"\"> doing this was easier than what you&#039;re trying to do now?</strong>  </p>  <h5 style=\"\">It&#039;s all possible with content curation.</h5>  <p style=\"\">  \t Content curation doesn&#039;t do away with the writing, but it <strong style=\"\">does make </strong><strong style=\"\">web content writing </strong><strong style=\"\">easier to quickly create powerful content</strong> that will:  </p>  <p style=\"\">  \t ●  Bring more traffic to your site  </p>  <p style=\"\">  \t ●  Increase the number of your social media fans and followers  </p>  <p style=\"\">  \t ●  Build your e-mail marketing list  </p>  <p style=\"\">  \t ●  Establish you as a top &quot;go-to&quot; expert in your industry  </p>  <p style=\"\">  \t ●  Keep you on top of your target customer&#039;s mind  </p>  <p style=\"\">  \t ●  Earn you good karma (and &quot;social credit&quot;) from your peers  </p>  <p style=\"\">  \t ●  Increase sales  </p>  <h5 style=\"\">What&#039;s that? You think content curation is the lazy man&#039;s way to do inbound marketing?</h5>  <p style=\"\">  \t Well, if you just listed a bunch of links, I would say that you&#039;re right. But content curation is much more than that.  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">Content curation is all about adding value to the links you curate and this course teaches you -- using step-by-step videos, worksheets and templates -- how to do just that.</em></strong>  </p>  <h5 style=\"\">The course is split into four parts:</h5>  <p style=\"\">  \t 1  <strong style=\"\">Content curation overview and examples:</strong> teaches you what content curation is, why you should use it and how you can use it;  </p>  <p style=\"\">  \t 2  <strong style=\"\">Creating content curated content:</strong> how to choose topics to curate, how to find and select content for each topic, how to add value to the content you find and how to construct the actual content;  </p>  <p style=\"\">  \t 3  <strong style=\"\">Content curation tips-and-tricks:</strong> a couple of handy lessons on extending the value of content curation; and  </p>  <p style=\"\">  \t 4  <strong style=\"\">Putting content curation into action:</strong> how to get started using content curation to start writing website content and blow up your business.  </p>  <h5 style=\"\">But wait, there&#039;s more!</h5>  <p style=\"\">  \t I&#039;ve also included a bonus video that teaches you all about inbound marketing and a content curated document which is all about content curation.  </p>  <h5 style=\"\">The best thing about this course:</h5>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">You can use it to quickly create powerful content, content that brings customers to your site and drives them to take action, again and again and again and again and (well, you get the idea)...</em></strong>  </p>  <h5 style=\"\"></h5>  <h5 style=\"\">p.s. Don&#039;t know a thing about me?</h5>  <p style=\"\">  \t Here are some nice things folks have said about other courses I&#039;ve created:  </p>  <p style=\"\">  \t &quot;Thanks for the fabulous Wordpress course. You put together a goldmine of information that has taken me from a mystified WordPress &quot;do it myselfer&quot; to someone who now knows exactly how to achieve the look I want.&quot; -- Darlene S., <em style=\"\">WordPress for Artists</em> customer  </p>  <p style=\"\">  \t &quot;When I was looking for freelance writing jobs in 2010, Matt provided an affordable and downloadable course that has helped me find part-time work since Day 1.&quot; -- Ben T., <em style=\"\">Earn More by Finding Freelance Writing Jobs Online</em> customer  </p>  <p style=\"\">  \t &quot;If I was new to the web and wanted to make money writing, I would kiss Matt’s feet for this resource. It removes every single “bwah?” moment. Click here, then click this...If you’re a writer who wants to make money online and you’re new to the scene? Run, do not walk, and buy this resource.&quot; -- Catherine C., <em style=\"\">Earn More by Finding Freelance Writing Jobs Online</em> reviewer  </p>  <p style=\"\">  \t &quot;Put simply, if you’re just getting started writing online, you need this program...Matt’s course takes the scary out of finding the work, and allows you to spend more time actually writing. If this had been around when I started I would have been all over it.&quot; -- Holly J., <em style=\"\">Earn More by Finding Freelance Writing Jobs Online</em> reviewer  </p>", 
    "end_date": null, 
    "title": "Quickly and Easily Create Content For the Web!", 
    "price": "30.00", 
    "instructors": "Matt Mansfield", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/14706_c641_5.jpg", 
    "course_url": "https://www.udemy.com/using-content-creation/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-03-02T13:18:58Z"
}