{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Here's What Some Of The Students Have Said About This Course:</p><p><em></em></p><p><em>I took this course because I needed a basic explanation on how to get people to read my blog on a regular basis as well as hopefully make money from doing what I love - blogging and traveling! This course is perfect for beginners. It thoroughly explains everything you need to know for growing a following and how to set up your blog to make money! Step by step with no gaps so you don't get lost. I quickly got followers (exponentially more) and was able to set up and get subscribers. Do yourself a favor and take it. Seriously.</em></p><p><em>- Elizabeth</em></p><p><em>I learned how to setup my website, SEO, the mindset of content creation, and how to implement a monetization strategy (because he gives his strategy away to us)...gotta love it!</em></p><p><em>- Mogue Courses</em></p><p><strong>So what's stopping you? What's holding you back from your success?</strong></p><p><strong>- From creating your blog</strong></p><p><strong>- Making $1k+ per month, every month</strong></p><p><strong>- Learning all of my secrets to doing so</strong></p><p><strong>I GIVE EVERYTHING AWAY YOU'LL NEED!</strong></p><p>... and that's just the half of what you'll get out of this course.</p><p>In this course, you will learn everything needed <strong>to set up a successful blog online in any area of choice as well as learn how to market your blog.</strong> This includes the domain/hosting set up, design of the site, and even an entire section devoted to growing your following by social media marketing and email subscribers. The tips and techniques used in this course are from my background in Web Design, Marketing, And Social Media Management, as well as insight from the best names in the business (KISSmetrics, Buffer, Alexa).</p><p> Instead of creating multiple courses covering all of these topics, <strong>I decided to make a super-course that will cover everything you need to create a successful, and profitable blog.</strong></p><p><strong>Course Outcomes:</strong></p><ul><li>How to set up your own hosting/domain</li><li>Knowing how to plan out a campaign</li><li>Complete guide of setting up your website</li><li>Best practices for monetization (MAKE MONEY!)</li><li>Social Media Marketing</li><li>Build Email Subscribers</li><li>Know why ad space is bad</li><li>How to obtain funds via direct deposit or Paypal</li></ul><strong>What You'll Benefit From This Course:</strong><ul><li>Increase Your Subscribers By 300%!</li><li>Start Making Money Doing What You Love</li><li>Learn Marketing, Web Design, Monetization</li><li>$1k to $10k per month, EVERY MONTH</li></ul><p><strong>I even include the best plugins to use for your blog as of August 2015 ABSOLUTELY FREE!</strong></p><p><strong>Still not convinced? Google Search: Highest Paid Bloggers. </strong></p><p><strong>Their success is not only reputable, it's also REPEATABLE. Their monthly earnings range from 2,000 - 80,000 USD per month. </strong></p><p>If you think you have what it takes to become a blogger, then <strong>THIS COURSE IS FOR YOU!</strong></p>", 
    "end_date": null, 
    "title": "Set Up a Successful Blogging Business from Home", 
    "price": "20.00", 
    "instructors": "Jake Hare", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565588_3bfe_2.jpg", 
    "course_url": "https://www.udemy.com/make-money-blogging/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T00:45:17Z"
}