{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>\r\n\t      Sales becomes simple &amp; straightforward when you&#039;ve first built trust.  A superior content marketing strategy accomplishes this feat.  I&#039;ve spent years in the trenches using special reports and white papers to attracting leads who quickly become six-figure clients.  In this course, I conversationally share this winning formula.\r\n</p>\r\n<p>\r\n\t      You&#039;ll discover:\r\n</p>\r\n<ul>\r\n\t<li>The <strong>six elements to a winning white paper</strong> that not only leave your readers itching for more, but also move them one step further in your the sales funnel.</li>\r\n\t<li>The <strong>two emotional appeals</strong> that must be conveyed on your offer page to entice visitors to become leads.</li>\r\n\t<li><strong>Sample action-inducing bullet points</strong> that create an overwhelming uneasiness that can only be relieved by your content.</li>\r\n\t<li>How delaying the delivery of your content by 1 minute can <strong>produce immediate results</strong>.</li>\r\n\t<li><strong>Which fields are absolutely critical</strong> (and which can be ignored) on your lead capture forms.</li>\r\n\t<li>How to make your promotional <strong>emails convert like crazy</strong>.</li>\r\n\t<li>What you must deliver to your leads within the first 24 hours, 7 days, and the first 30 days <strong>so you don&#039;t squander your immense opportunity</strong>.</li>\r\n</ul>\r\n<p>\r\n\t    Start learning now to shortcut your path to producing powerful B2B content marketing with white papers.\r\n</p>", 
    "end_date": null, 
    "title": "Smart B2B Content Marketing: The Winning White Paper Formula", 
    "price": "20.00", 
    "instructors": "Chris Crompton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48583_cb48_4.jpg", 
    "course_url": "https://www.udemy.com/b2b-content-marketing-white-papers/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-04T22:34:19Z"
}