{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Podcasting is big right now, and it can be a path for you to be very successful and a way to support your business, heck it could even be your business. There is not much competition and podcast listeners are growing like wild fire.</p><p>Now is the time to start your podcast because technology has made it VERY easy to get started and very inexpensive at the same time. Before it took thousands of dollars to make a great sounding recording, now it can cost you your current computer and a simple $30 microphone. </p><p>In &quot;Start Your Podcast&quot; you&#039;ll learn how to:</p><ul style=\"\"><li>Start a podcast the right way</li><li>Create podcast recordings</li><li>Edit your podcasts</li><li>Upload and publish podcasts</li><li>Create podcast images</li><li>Create custom compelling content for podcast, articles and more</li><li>Manage wordpress and plugins</li><li>Know how to market your podcast and content</li><li>Attract paid clients</li><li>Generate revenue with your podcast</li><li>How to be successful in podcasting</li><li>Get website traffic</li><li>Sweeten your audio</li><li>Selecting your niche</li><li>Use podcasting for your business</li></ul><div style=\"\">The whole course is video based with PDF resources for the slides for each presentation that has a keynote recording. You&#039;ll also receive access to valuable resources to guarantee your success in starting your own podcast. </div><p>The course will take many days to complete because it&#039;s packed full of actionable content you will need to apply to start your podcast. </p><p>The course is structured from a top down level, you&#039;ll learn the over arching main ideas that will be executed as you go on with the course. </p><p>Take &quot;Start Your Podcast&quot; to create your podcast the right way and now before it&#039;s too late. </p>", 
    "end_date": null, 
    "title": "Start Your Podcast In 10 Days And Build An Audience", 
    "price": "20.00", 
    "instructors": "Bobby Huang", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/352438_c06e_3.jpg", 
    "course_url": "https://www.udemy.com/start-podcast/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T00:30:53Z"
}