{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>For any business looking to build an audience, develop relationships, increase trust and authority, and ultimately sell products; email marketing is an absolutely essential activity.</p><p>Email marketing often takes a backseat to other forms of marketing, such as SEO and social media marketing. That’s a shame, as it does in fact have even more potential than either of those when it comes to building and reaching a massive number of people.</p><p>Not convinced? Then just take a look at the blog of any big e-mail marketer. Almost all of them will describe their email marketing and list building activities as the single most important aspects of their business.</p><p>One such blogger is Michael Hyatt. He had the following to say about email marketing and list building:</p><p><em>“I have literally built a multi-million dollar business on the strength of my email list. Ninety percent of my income comes from it. Even today, my email list is still my number one business priority and asset.”</em></p><p>Meanwhile, Douglas Karr from Marketing Tech Blog said:</p><p><em>“Without a doubt, our email list is the best investment we’ve ever made.”</em></p><p>And Michael Stelzner of Social Media Examiner says:</p><p><em>“Email is the most important channel for you to cultivate.”</em></p><p><strong>That’s from a site about social media; and yet the owner is recommending email marketing above that very tool!</strong></p>", 
    "end_date": null, 
    "title": "The Power of Email Marketing to Grow a List & Increase Sales", 
    "price": 0, 
    "instructors": "Skillhance, LLC, Matt Bernstein", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/798028_8464.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-strategies/", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-19T15:36:20Z"
}