{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><strong>**** UPDATED MARCH 21st, 2016 **** NEW LECTURES ****</strong><br></strong></p><p><strong>Need blog post ideas...?</strong></p><p>Starting a blog is easy, but writing high quality content on a daily basis can be a challenge. It takes many hours sometimes even weeks to come up a great blog post that will get you the traffic, engagement and sales you need to keep your business alive online.</p><p>If you don't have a consistent stream of blog posts that are being published day-by-day, week-by-week and month-by-month, you cannot compete with those who are writing content that is shared, loved and engaged with.</p><p>Wouldn't it be nice, if you took your blog post idea or the topic you are talking about and could choose from 1 of 220 blog post ideas that you can just pick and start crafting your blog post that will take you only less than a few hours?</p><p>This course gives you an ultimate list of 220 blog post ideas that will let you <strong>conquer the blank page.</strong></p><p>In this course I cover a solid list of useful strategies, techniques, and questions that can always keep a blogging idea on the tip of your tongue.</p><p><strong>By the end of the course, you should be able to:</strong></p><ol><li>Know the right way to write a blog post that puts your readers into focus</li><li>Write posts that are useful for your readers that get your blog noticed on social media</li><li>Connect with other blog influencers and have them promote your blog on their blog and social media.</li><li>Create entertaining posts that will keep your readers laughing and sharing your posts all the way.</li><li>Author newsworthy posts that compete with major news websites and be seen as an authority on a topic</li><li>Talk about in yourself in a way that gets your readers attracted to your human side</li><li>Make your posts go viral on the web and have millions of traffic to your website.</li><li>How to take your blog posts and multiply them so you have hundreds of additional blog posts.</li></ol><p><br></p>", 
    "end_date": null, 
    "title": "The Ultimate Guide to Writing Viral Blog Posts", 
    "price": "20.00", 
    "instructors": "Basim Salim", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468848_a25d_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-list-of-220-blog-post-ideas/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T11:24:30Z"
}