{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Have You Ever Been Frustrated Because You Work Hard As A Writer, But It Barely Pays Off?</strong><br></p>\n\n\n\n\n\n\n\n<p>If that's the case you're going to love this course.</p>\n\n\n\n\n\n\n\n<p>You're going to brainstorm the 7 coolest ways I know of to get paid as a writer.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So Ask Yourself How This Would Feel.</strong></p>\n\n\n\n\n\n\n\n<p>How would it feel if instead of being mocked and laughed at by your critics, you were finally starting to make writing pay off?</p>\n\n\n\n\n\n\n\n<p>Have you ever been heartbroken that your content just isn't making money? Maybe your loved ones are asking you what you're doing online all day... And you don't have a good answer?</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">If That's The Case, You're Going To Love This Course!</strong></p>\n\n\n\n\n\n\n\n<p>So you can access a massive list of websites who want to pay you for your content!</p>\n\n\n\n\n\n\n\n<p>Not only that, but you'll brainstorm alongside me as we talk about the coolest ways to get paid as a writer.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So How Much Is This Course Worth?</strong></p>\n\n\n\n\n\n\n\n<p>Well, if you hired someone to collect all of these websites that want to pay you, it would easily cost a few hundred bucks. </p>\n\n\n\n\n\n\n\n<p>Then there's the time aspect of it. Imagine if you had to spend days, or weeks putting all of this information together in one handy text file?</p>\n\n\n\n\n\n\n\n<p>Plus, you get free lifetime updates, so you can agree you're getting in for a pittance of its true value!</p>\n\n\n\n\n\n\n\n<p>If any of this sounds good, then I'll see you on the inside!</p>\n\n\n\n\n\n<p><strong>At This Point You Have Two Choices...</strong></p>\n\n\n\n\n\n<p>You can continue doing what you're doing now. Keep struggling as a writer, with no direction and no clue how to monetize your writing. But be honest, how has that been working so far?</p>\n\n\n\n\n\n<p>Or, you can enroll in this course. So you can finally take control of your own destiny as a writer. Your future is bright. And I'm so confident in your ability to succeed!</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>Enroll Now So You Can Finally Tap Into This Massive Treasure Trove Of Resources For Anyone Who Wants To Get Paid As A Writer!</em></strong></p>", 
    "end_date": null, 
    "title": "The 7 Best Ways To Get Paid As A Writer (Writer's Revenge)", 
    "price": "20.00", 
    "instructors": "Mike DeVincent", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/808514_be44_2.jpg", 
    "course_url": "https://www.udemy.com/the-7-best-ways-to-get-paid-as-a-writer-writers-revenge/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-30T20:34:42Z"
}