{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t <strong>*** UPDATED January 2016:</strong> <strong><em>Now includes FREE professional templates valued at $199 (the same ones we use on all of our sites)</em></strong></p><p>Bloggers Creed is a powerful series of videos which will take you  inside the world of becoming a pro blogger. We use a trademark system of  creating “Blog Assets™.\" They are unheard of within the industry and  will shake the current bloggers culture! These blog assets, also called  “Harvest Blogs™\" are used to generate sales using a small number of fans  and low traffic. This is a completely new approach to running or  starting a blogging business. This is for new and advanced bloggers.  </p>  <p>  \t Above all else, our videos are transparent, void of hype and contain  real-life examples. We'll take you on the inside showing how full-time  income was generated from new start-up blogs. Join bestselling author Ansel Gough and our community in launching or building your own blog and  Blog Assets™ using the methodology which is Bloggers Creed.  </p>  <p>  \t Course includes video training, worksheets, software, themes &amp; templates. Everything you need to launch a cash flow blog!  </p>  <p>  \t The course is designed to be completed in 4 weeks, but can be completed at your own pace. Many have completed it much faster.  </p>", 
    "end_date": null, 
    "title": "The New Way To Become A Pro Blogger—Without Many Subscribers", 
    "price": "25.00", 
    "instructors": "Ansel Gough", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/77930_806c_5.jpg", 
    "course_url": "https://www.udemy.com/the-new-way-to-become-a-pro-blogger-without-many-subscribers/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-13T09:21:45Z"
}