{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Do you want to <strong class=\"redactor-inline-converted\">earn a living as a freelance writer</strong>, earning money from home while doing something you actually love to do?<br></p>\n\n<p>This course will teach you <strong class=\"redactor-inline-converted\">exactly how I built a </strong><strong class=\"redactor-inline-converted\">freelance writing career online from absolute scratch</strong> and have been making my living from it ever since, even quitting my day job back in 2012. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I travel the world with my laptop</strong>, making money as I go, or sit at home in front of my computer and <strong class=\"redactor-inline-converted\">work to my own schedule. </strong>No horrible commute, no office politics, and no boss. Best of all, <strong class=\"redactor-inline-converted\">I'm getting paid to do something I love to do - WRITE! </strong></p>\n\n\n\n\n\n<p>If I can do it - <strong class=\"redactor-inline-converted\"><em>you can too. </em></strong>This course will teach you exactly how, with over-my-shoulder access to how I did it, plus pitching templates and all the tricks of the trade to ensure you rise above the competition.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">THIS COURSE IS PERFECT FOR YOU IF:</strong></p>\n\n\n\n\n\n<ol><li>You're stuck in a day job but want to earn a living writing instead</li><li>You want more time, money and freedom to spend as you please</li><li>You want a new career working from anywhere but don't know where to start</li><li>You're sick of spending all your time earning a pittance writing for content mills</li><li>You pitch for individual writing gigs on freelancing sites but don't have regular clients</li></ol>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">We are so confident that you will love the course that it comes with a 30-DAY MONEY-BACK GUARANTEE!</strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">THE COURSE ALSO COMES WITH:</strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">A Bonus eBook:</strong><br>The free bonus eBook is for absolute newcomers to freelance writing online. Learn how to build a solid reputation as a writer with no previous experience and no portfolio. You'll get a few clips and earn your first few dollars from writing online.</p><p><strong>*Bonus Lectures by Online Expert, Jerry Banfield!*</strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Templates &amp; Checklists:</strong></p>\n\n\n\n\n\n<ul><li>1x 'Client Pitching' email template</li><li>1x 'Single Post Pitching' email template</li><li>1x 'Working Agreement' template</li><li>1x 'Useful Resources' section linking to all the tricks and tools of the trade</li><li>13 'Actions Worksheets' to support each lecture</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">ENROLL IN THIS COURSE TO LEARN HOW TO:</strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Build a Solid Foundation as an Online Writer<br></strong>Learn how to charge more money and build a stellar reputation by choosing the right niches for you. Use the simple step-by-step tutorial to set up your own self-hosted, professional writer's website – then tweak the main pages to entice writing clients to hire you.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Effectively Market Yourself as a Freelance Writer</strong><br>Discover whether blogging is the right strategy for you, and how you can use guest posting to pull in writing clients. Then learn how to use the major social media websites (plus one surprise one!) to effectively market your writing services.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Expertly Write for the Online Market</strong><br>Perfect your craft by learning both basic and new online writing techniques. Discover how to write blog posts that capture readers' attention, go viral and make you invaluable to your clients. Study the art of effective press release writing (and distribution) and learn how to ensure all your online content is search engine friendly in the long-term.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Earn a Full-Time Living and Give Yourself a Pay Rise</strong><br>Discover the secret method that all the high earning freelance writers apply to their business. Then learn how to use this method to earn more money on a regular basis, while adding incredible value to your clients. Find out exactly how much to charge clients, how to pitch and who to pitch to, using simple instructions and customizable email templates.</p>", 
    "end_date": null, 
    "title": "The Complete Freelance Writing Online Course:Beginner to Pro", 
    "price": "50.00", 
    "instructors": "Kirsty Stuart, Jerry Banfield", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609006_6138_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-freelance-writer-online-and-quit-day-job/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T11:09:53Z"
}