{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>“This course is not sponsored by or affiliated with Udemy, Inc.”<br></p>\n\n<p>Oi, meu nome é Diego Davila, sou um instrutor de sucesso na Udemy com mais de 17.000 alunos espalhados em 152 países!</p>\n\n<p>Então, vamos direto ao ponto…</p>\n\n\n\n<p><strong>Até o final do curso, você vai aprender a …</strong></p>\n\n\n\n<ul><li>Criar um site WordPress para comercializar seus cursos Udemy (não é necessário ter conhecimentos de programação).</li><li>Criar um funil de marketing e um plano com estratégias que eu utilizo diariamente e funcionam muito bem!</li><li>Aumentar (talvez duplicar ou triplicar!) as tuas vendas na Udemy.</li><li>Vamos comprar um domínio para seu Site (investimento aproximado de R$7) e assinar o serviço de hospedagem para o seu Site (pago inicial de $0.01!!!). Com isso estaremos prontos para construir o teu site!<br><strong><br></strong></li></ul>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>Quem deve fazer este curso? Quem não deve?</strong></p>\n\n\n\n<ul><li>Instrutores que tem cursos na Udemy e querem aumentar as vendas e ganhar mais dinheiro.</li><li>Futuros instrutores que ainda não tem um curso na Udemy mas planejam criar um curso para começar a ganhar dinheiro online.</li><li>Pessoas que tem um emprego de tempo integral mas gostariam de aumentar significativamente os ingressos mensais trabalhando somente algumas horas por semana. </li></ul>\n\n\n\n<p>Lembra que devemos desenvolver a paciência e disciplina e saber que o sucesso não ocorre da noite para o dia, mas uma coisa é certa, se você investir o seu tempo e seguir os passos deste curso, o sucesso chegará, isso é certo!</p>\n\n\n\n<p>Da uma olhada no currículo do curso, e tem algumas Aulas que da para visualizar Gratuitamente, <strong>te convido a ver as 3 primeiras Aulas do currículo (gratis) </strong>para conhecer o site que vamos construir e ver como a tua vida financeira pode mudar a partir de hoje! </p>\n\n\n\n<p>Vamos começar!</p>", 
    "end_date": null, 
    "title": "Udemy Crie um Site para vender seus Cursos Udemy -unofficial", 
    "price": "20.00", 
    "instructors": "Diego Davila", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694030_58a6_3.jpg", 
    "course_url": "https://www.udemy.com/aumentarvendas/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T15:07:40Z"
}