{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Im März 2015 habe ich meinen ersten Kurs bei Udemy veröffentlicht. Fast genau ein Jahr später ist ein Umsatz von 20.000 € erreicht. Dieser Kurs (vorliegend der <strong class=\"redactor-inline-converted\">fünfte Teil</strong>) zeigt Ihnen minutiös und nachvollziehbar meine seriöse Langzeit-Strategie, mit der Sie ein solides Einkommen aus Ihrer Dozenten-Tätigkeit bei Udemy erzielen. Ich verspreche Ihnen bewusst keine konkreten Zahlen. Aber ich verspreche Ihnen:</p>\n\n<ul><li><strong class=\"redactor-inline-converted\">Spaß </strong>am Lehren</li><li><strong class=\"redactor-inline-converted\">Zufriedene </strong>Studenten</li><li>Eine Zeit-Investition, die sich für Sie <strong class=\"redactor-inline-converted\">rentiert</strong></li></ul>\n\n\n\n<p>Eines jedoch werden Sie garantiert nicht erreichen: passives Einkommen. Wer als Dozent bei Udemy erfolgreich sein will, muss <strong class=\"redactor-inline-converted\">aktiv sein</strong>. Einmalig einen Kurs zu erstellen genügt nicht. Sie müssen den Kurs vermarkten, ihn pflegen, mit Ihren Teilnehmern in Kontakt treten.  Bei all diesen Schritten wird der Kurs Sie unterstützen. Er ist deshalb in <strong class=\"redactor-inline-converted\">monatliche Abschnitte</strong> unterteilt, die wiederum aus je vier \"Wochen\" (Abschnitten) bestehen. Sie können einzelne Abschnitte selbstverständlich schneller durcharbeiten. Sie müssen auch nicht in der vorgegebenen Reihenfolge vorgehen: Alle Kursteile sind eigenständig und für sich allein nutzbar und buchbar.  Der Vorteil der Modularität: Sie müssen keinen teuren Gesamt-Kurs buchen, sondern können sich je nach Interesse für einzelne Teile entscheiden. Natürlich werden Sie als zahlender Teilnehmer für Folgekurse günstigere Preise erhalten. Im Kurs lege ich großen Wert auf</p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Verständlichkeit</strong>,</li><li>persönlichen Kontakt und</li><li>Ihren Erfolg</li></ul>\n\n\n\n<p>Der vorliegende fünfte Teil des Kurses behandelt unter anderem:</p>\n\n\n\n<ul><li>Wie Sie Ihren Kurs zur <strong class=\"redactor-inline-converted\">Freischaltung </strong>vorbereiten und den Freischalt-Preis reibungslos durchlaufen</li><li>Wie Sie die optimale <strong class=\"redactor-inline-converted\">Preisstrategie </strong>finden und umsetzen</li><li>Was Ihnen <strong class=\"redactor-inline-converted\">kostenlose </strong>Kurse bringen</li><li>Welche internen Marketing-Intrumente Udemy bereit hält und wie Sie diese nutzen</li><li>Mit welchen Mitteln Sie Ihren <strong>Newsletter </strong>aufpeppen (für Fortgeschrittene)</li></ul>\n\n\n\n<p>Die weiteren Monats-Teile werden <strong class=\"redactor-inline-converted\">etwa alle zwei Wochen</strong> erscheinen. Wie der Kurs sich entwickelt, hängt auch von seinen Teilnehmern ab. Ich habe zwar eine Art Drehbuch, doch wenn sich zwischendurch herausstellt, dass andere Fragen dringender sind, kann ich stets variieren – jedenfalls bis alle zwölf Monate erschienen sind. Dann sind hoffentlich wirklich alle Fragen beantwortet, die je zum Thema Online-Kurse aufgekommen sind. Das ist, Leser meiner Selfpublisherbibel wissen das, ein Anspruch, den ich an mich stelle: zu jeder Frage eine Antwort parat zu haben.</p>", 
    "end_date": null, 
    "title": "Udemy-Kurs (5): Die seriöse 12-Monats-Strategie - Unofficial", 
    "price": "20.00", 
    "instructors": "Matthias Matting", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814812_719c.jpg", 
    "course_url": "https://www.udemy.com/udemy-kurs-5/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T19:38:18Z"
}