{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong></strong></p>\n\n<ul><li><strong>This Course has gone Viral!<br></strong></li><li><strong>Over 2,000+ Students in 10 Days!!<br></strong></li><li><strong>15+ Rocking Near Perfect Reviews!!!</strong></li></ul>\n\n<p><strong>Do you want to Master the Art of Communicating Complex Ideas &amp; Getting People to Take Action? </strong>In this course you will learn how to turn your ideas into sticky, contagious pieces of content that get people to take Action!<em></em></p>\n\n<p><strong><em>See What some of the Students are Saying:</em></strong></p><p>\"Extraordinary course!\" Brooke Haggermaker </p>\n\n<p>\"Excellent primer on the thought process of developing content that influences people.\" Gerard DeSousa</p>\n\n<p>\"Great thought provoking ideas, explained very succinctly. Content is original, I've not come across these ideas before in regards to writing and can also be applied to other areas of communicating in your life as well eg concept of simplicity. Pace is good and this instructor is easy and interesting to listen to. I would recommend this course.\" Bethany Holt</p>\n\n<p><strong>Communicating Complex Ideas &amp; Getting People to Take ACTION Can Be Very Very Difficult! </strong></p>\n\n<p><strong>Have you ever:</strong></p>\n\n<ol><li>Explained your idea more than once?</li><li>Had a hard time getting someone's attention or keeping it?</li><li>Tried to convince someone of your idea but had a hard time getting them to agree?</li><li>Felt that people often didn’t understand or remember your ideas?</li><li>Problems getting people to care?</li><li>Noticed that even when your idea is liked, no one is taking action?</li></ol>\n\n<p><em><strong>Whether you are a CEO, a Marketer or a Stay at Home Mom you have Ideas you need to share: </strong></em></p>\n\n<ul><li><em>Selling your Boss on a Great New Idea</em></li><li><em>Creating a Viral Marketing Campaign </em></li><li><em>Trying to install certain values in your kids</em></li></ul>\n\n<p><em><strong></strong></em><em><strong> Transforming the way people think can be very HARD!</strong></em></p>\n\n<p><em><strong></strong></em>--------------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>The Good News is There is a Specific Way to Craft a Great Idea into a Story which Inherently Pulls the audience, Takes them on a Journey and Gets them to Act! </strong><br></p>\n\n<p>&gt; This is why you watch all of those Facebook Videos, can't help but to click on the Latest BuzzFeed Article and spend countless hours (most of us anyway) being Entertained. </p>\n\n<p><strong>Psychologically, we can not Resist Great Content.... and the Good News is that Sticky Content can be Manufactured.. and it can be Created by YOU!</strong></p>\n\n<p><em>I did  a lot of Research, A/B test and Growth Hacking and all of it pointed to 5 key Ingredients:</em></p>\n\n<ol><li>Great Ideas Tell Stories that are Simple and get to the Core Quickly</li><li>Great Ideas are so Tangible that you could almost Touch them</li><li>Great Ideas Make us Feel Something and Care</li><li>Great Ideas are Surprising and bring New Information</li><li>Great Ideas are Credible &amp; Trustworthy</li></ol>\n\n<p><strong>When done right, great ideas lead us to our own personal ‘Aha Moment’ a ‘Wow’ Experience'</strong></p>\n\n<p>In this course you will learn how to: </p>\n\n<ul><li>Transform your Ideas into a Sticky Stories which is the first step in Viral Marketing</li><li>Write Viral Copywrite that is Psychologically Irresistible</li><li>Create Content that is Memorable &amp; Shared</li><li>Create Stories that Lead to ‘Aha Moments’</li><li>Give your audience ‘Wow Experiences'</li></ul>\n\n<p><strong>We are going cover the Research and a number of Case Studies. </strong><strong>The course will focus on the 5 main techniques used to create sticky stories.</strong></p>\n\n<p>These techniques are often used by companies like Apple, Facebook, Google, who know exactly how to do this.</p>\n\n<p><strong>Viral Marketing is the next wave of marketing. It is no longer about hacking SEO or other systems. It is now all about hacking the human psyche.</strong> </p>\n\n<p><strong>-----------------------------------------------------------------------------------------</strong></p>\n\n<p><strong>Right Now there is a Tremendous Opportunity in Creating Very Sticky, Psychologically Irresistible Content. </strong></p>\n\n<p>&gt; This is becoming more and more popular everyday as more and more research comes out. This is the best time to do it, before there is an over abundance of sticky content.</p>\n\n<p><strong>Let’s Get Started! Take This Course Right Now!</strong></p>", 
    "end_date": null, 
    "title": "Viral Copywriting: How to Create Sticky Stories that Sell!", 
    "price": "20.00", 
    "instructors": "Stefan Kojouharov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680850_ed36_4.jpg", 
    "course_url": "https://www.udemy.com/viral-marketing-how-to-create-sticky-content-viral-ideas-made-to-stick/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T19:58:47Z"
}