{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t    AS OF NOVEMBER 2014, OVER 6500 SUCCESSFUL STUDENTS HAVE TAKEN THIS COURSE!  </p>  <p>  \t    These savvy students have saved themselves thousands of dollars, by learning how to create and build their own websites, instead of using expensive web design companies.  </p>  <p>  \t    In this course, you look over my shoulder and watch exactly what I do on screen, so that you:  </p>  <ul>  \t<li>Understand what Blogger is and how you can build websites for free</li>  \t<li>See how I build a variety of different websites that Google loves</li>  \t<li>Get your website up and running in only a couple of hours</li>  </ul>  <p>  \t    No experience needed. Follow my example step by step, with these short &amp; actionable videos.  </p>  <p>  \t    +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  </p>  <p>  \t    About this course:  </p>  <ul>  \t<li>Thousands of happy students so far</li>  \t<li>Everything shown to you step by step</li>  \t<li>Full, lifetime access</li>  \t<li>Watch on demand, as often as you like</li>  \t<li>All future lectures and upgrades are always included automatically for FREE</li>  \t<li>Unconditional, 30 Day Udemy Money Back Guarantee <em>(I&#039;m so sure you&#039;ll love this course and have your website up and running in no time - that if you don&#039;t, you can get all your money back at any time in the first 30 days!)</em></li>  </ul>  <p>  \t<strong>    WATCH OVER MY SHOULDER AS I SHOW YOU:  </strong>  </p>  <ul>  \t<li>What Blogger is and how you can use it to create websites for free</li>  \t<li>How to avoid getting confused with all the technical jargon and just take simple steps to get your website up and running</li>  \t<li>How to create a beautiful website in just a few hours</li>  \t<li>How to create different types of websites in just a few clicks</li>  \t<li>How to include a variety of tools, tricks and other cool stuff.</li>  </ul>  <p>  \t    There are literally thousands of online companies and web designers out there, eager to get you to part with your hard earned cash, to build you something that is actually very simple.  </p>  <p>  \t    Some of them probably have less knowledge and ability than some of the students who have completed this course!  </p>  <p>  \t    I want to uncover the tools and processes of creating a website and share them with you in a simple, honest and easy to understand way.  </p>  <p>  \t    Get your website up and running, or ask for a full refund of this course within 30 days.  </p>  <p>  \t<strong>    You Will Learn...  </strong>  </p>  <ol>  \t<li>How to create websites for free using Blogger</li>  \t<li>What all the different technical terms mean, in plain &amp; simple English</li>  \t<li>What sort of website you need to create</li>  \t<li>How to set up a Blogger Account</li>  \t<li>How to create your first Blogger website</li>  \t<li>How to use all of the different website functions</li>  \t<li>How to create Blog posts</li>  \t<li>How to edit the layout of your website</li>  \t<li>How to change the look and feel of your website</li>  \t<li>How to make your website optimised for Mobile screens on Smart phones and tablets (With one click)</li>  \t<li>How to create a website for a business</li>  \t<li>How to make a landing page website</li>  \t<li>How to create a niche news website</li>  \t<li>How to set up a custom domain for your website (This is the only additional cost you will need to pay for your website)</li>  \t<li>How to install custom themes &amp; templates</li>  \t<li>What SEO is and why Google LOVES Blogger sites</li>  </ol>  <p>  \t    ....and much, much more!  </p>  <p>  \t    Over 6500 happy students have watched over my shoulder, to see how they can use Blogger to create and build their own websites. Here&#039;s what they are saying about this course in the reviews:  </p>  <p>  \t<strong><em>&quot;I found this course extremely helpful and I had the foundation of my site up and running within a couple of hours&quot;</em> - Peter Adamson</strong>  </p>  <p>  \t<strong><em>&quot;I am very happy with the course and the patience Andrew has in guiding through a complex platform using simple steps. Thank you Andrew! Epic Win!&quot;</em> - Dutch Driver</strong>  </p>  <p>  \t<strong><em>&quot;I&#039;m an idea guy, not a techie. This is what I needed to create the perfect blog for my situation and for the needs of my clients&quot;</em> - John Kirton</strong>  </p>  <p>  \t<strong><em>&quot;...It then moves onto exploring the full functionality of Blogger through using examples built from start to finish......So the evidence is: My site is up and running and I refer back to the course on a regular basis&quot;</em> - David Addy</strong>  </p>  <p>  \t    REMEMBER - If you don&#039;t absolutely love this course, you can get a full refund within 30 days, in line with Udemy&#039;s refund policy.  </p>  <p>  \t    Let&#039;s create your new website and start this journey together!  </p>  <p>  \t    Click the &quot;<strong>Take This Course</strong>&quot; button at the top of this page, and I&#039;ll see you on the other side!  </p>", 
    "end_date": null, 
    "title": "Web Development For Beginners: Get A Website Live in Hours", 
    "price": "20.00", 
    "instructors": "Andrew Pyle", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/16327_732b_9.jpg", 
    "course_url": "https://www.udemy.com/howtocreatewebsitesusingblogger/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-04-13T20:43:49Z"
}