{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>  \tFive Star Student Reviews:</strong></p><p>★★★★★ <em>\"This was everything and more than I expected. Thanks so much for such a great course!\"</em> - Liam Jacob</p><p>★★★★★ <em>\"I can't recommend Website Profits System highly enough. I love the mindset training as well - Laura addresses my doubts and fears about creating your own products and selling them.\"</em></p><p>★★★★★ <em>\"Website Profits System is great. I love the workbooks. It's very strategic but at the same time very, very practical and step-by-step. Brilliant.\"</em><br><strong></strong></p><p><strong>WPS</strong> is a <strong>comprehensive 8-module</strong>, 70+ video online coaching program on how to <strong>create a successful online business</strong> - working from home and reaching a global audience with your expertise, products and services. </p><p>You get easy step-by-step tutorials on how to discover and define your brand, create a simple downloadable product and create a website to sell it and then most importantly, how to market it - building a large online audience and customer base.  </p><p>The course helps you master the 6 'P's of online success, they are: </p> <ol><li>Perspective</li><li>Product</li><li>Positioning</li><li>Presentation</li><li>Perfect Pitch</li><li>Promotions</li></ol><p>The 8 Modules cover the following topics:</p><p><em><strong>Module 1: Online Branding</strong></em></p><ul><li>How to establish your brand online to be <em>THE</em> go-to person </li><li>How to find and write your unique story (Everyone has one even if you don't see yours yet)</li><li>The 1 Paragraph that could be the difference between making a million or simply “surviving\".</li><li>How to cement your expert status so you can be placed above your competition as an authority.</li></ul><p><em><strong>Module 2: Your Money Website</strong></em></p><ul><li>Website and blog optimisation with the relevant key pages for maximum profitability </li><li>Your Free Offer created and positioned right to effortlessly attract new prospective buyers</li><li>Building your mailing list and adding new subscribers on autopilot<strong></strong></li></ul><p><em><strong>Module 3: Content Marketing</strong></em></p><ul><li><strong></strong>Crafting your MKL (Master Keyword List) which will allow you to have limitless ideas of what to include with your content, whilst being found in the search engines </li><li>The step-by-step blog content creation method this allows you to write a keyword rich, yet content heavy piece of content that will place you as an authority and person of value</li><li>My personal method for creating content on time so I don't burn out or get stuck for ideas</li><li>Creating your first professional video decoded – this is where I will show you how you can inexpensively create a powerful professional video that will bring in more clients, customers, and prospects to your site</li></ul><p><em><strong></strong></em></p><p><em><strong>Module 4: Traffic Generation </strong></em></p><ul><li><strong></strong>Exactly how to structure your content for SEO and social traffic</li><li>How to bring in traffic from social sites like Slideshare, YouTube, and other super-effective underground sites.</li><li>Strategies for content distribution that have stood the test of time and have survived everything Google has ever brought out for SEO!</li></ul><p><em><strong>Module 5: E-mail Marketing </strong></em></p><ul><li>How to structure your emails for maximum readability, retention of information, and overall customer happiness</li><li>How to create powerful affiliate promotions that get read &amp; bring in sales</li><li>The time-tested and proven strategy and complete 2-year blueprint for effective e-mail content<strong>.</strong></li></ul><p><em><strong>Module 6: Unique Info-Product </strong></em></p><ul><li>My blueprint for turning what you know into a profit-pulling product that your customers will love and buy</li><li>How to create a secure membership site for your content delivery</li><li>How to price your product so you don't under or over charge</li><li>The 4-step formula for creating a high-ticket product that can realistically bring you in £700-£20,000 a month</li></ul><p><em><strong></strong></em></p><p><em><strong>Module 7: Webinar Cash Machine </strong></em></p><ul><li>The 10-Step Formula for high-converting webinars</li><li>How to structure your content so it engages your audience while teaching them</li><li>How to automate your webinars so they run every week and make sales without you needing to be there</li></ul><p><em><strong>Module 8: Outsourcing &amp; Systems </strong></em></p><ul><li>How 2 powerful, simple, yet free project management tools can automate your business</li><li>Where to find the best outsource workers to look after your business whether you're actively growing your business or are on holiday for a month and taking a break</li><li>How to leverage <em>YOUR </em>key strengths so you are totally fulfilled and making the smartest use of your time</li><li>How to manage your time, energy and daily habits like the super-successful do</li><li>Easy Standard Operating Procedures Blueprint for your business…this is crucial for creating a highly scalable and <em>salable</em> business</li></ul><p><strong>Features:</strong></p><ul><li><strong>Your Roadmap for Success</strong>Step-by-step tutorials to get you from A to B – from obscurity to authority-figure with your online brand </li><li><strong> Coffee Break Training</strong>Manageable chunks of content that you can watch and learn from in 20 minutes or less </li><li><strong> iPad &amp; Phone Compatible </strong>Watch the video training on any mobile device or tablet, for your convenience &amp; flexibility </li><li><strong> PDF Action Guides &amp; Blueprints Too</strong>Complementing the video training, you can download the PDF slides, action guides &amp; blueprints </li><li><strong> Lifetime Access &amp; Updates</strong>Training will be updated from time to time, you get full lifetime access to the new and existing resources. You can access the training online on any computer (Mac or PC), anywhere in the world, 24/7 </li></ul><p><br></p><p>The course will take you anywhere between 1 week and 2 months to go through, as there is a lot of material - all you need to succeed in online business. This is your ultimate reference guide and you can come back to it anytime and re-watch the tutorials.<br><strong></strong></p><p><strong>Testimonial:</strong></p><p>“£15,000 Added to My Bottom Line!\" </p><p><em>“I went from a standing start and Laura's course has allowed me to easily market my products online and added over £15,000 to my bottom line in the past 6 weeks.</em> <em>I am so confident with what it does. I wanted to take my brand global and if you're looking to so the same, Laura's training allows you to effortlessly increase your brand while you get on with what you do best in your business. I would absolutely recommend it</em>\"</p> <strong>Lucy Johnson</strong>  Owner, Fully Booked Formula", 
    "end_date": null, 
    "title": "Website Profits: Create & Sell High-Ticket Digital Products ", 
    "price": "50.00", 
    "instructors": "Laura Wilson", 
    "commitment": "31 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403092_2139_3.jpg", 
    "course_url": "https://www.udemy.com/ibrandboost/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T19:03:45Z"
}