{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t    <strong>How-To Sell More and Earn More With WordPress Plugins and Marketing Tools I Used To Sell Over 1,000 Copies Of My Self-Published eBook.</strong>  </p>\n\n<p><strong>  \t      CLICK \"TAKE THIS COURSE\" TO GET STARTED NOW! JOIN THE 7,665 STUDENTS ALREADY ENROLLED.</strong></p>\n\n\n\n<p>  \t<strong>***** COURSE MATERIAL IS UP-TO-DATE AS OF 11/01/2015 *****</strong>  </p>\n\n\n\n<p>  \t    Learn how to sell more products, books, online courses and promote your business with affordable WordPress.  </p>\n\n\n\n<ul>  \t<li><strong>Popular WordPress Marketing Course on Udemy!</strong></li>  \t<li><strong>This course has over 7,665 students enrolled and learning how to market with WordPress!</strong></li>  \t<li><strong>20 Lectures packed full of tips</strong></li>  \t<li><strong>12 5-Star Ratings</strong></li>  </ul>\n\n\n\n<p>  \t<strong>5-Star Review - Worth the money</strong>  </p>\n\n\n\n<p>  \t<em><strong>A course that is ideal for people wanting to market their product or service but particularly book authors. Clear and well structured course.</strong></em>  </p>\n\n\n\n<p>  \t<strong>30 Day 100% Risk Free Offer!</strong>  </p>\n\n\n\n<p>  \t                                                       Do you want to learn how to market your business better online? Is your website lacking what is needed to reach out to your customers? Are you staying in touch with your current clients? How are you bringing them back to your website? Is your website connected to your social media? These are the tools I have used to sell 1,000 copies of my best selling book. <strong>COURSE BONUS: Receive a free full PDF copy of this same book when you finish this course.</strong><br>  \t<br>  \t<strong>                                         Here is some of what you will learn during this course:  </strong>  </p>\n\n\n\n<ul>  \t<li>What tools to use for creating landing pages.</li>  \t<li>Finding great themes, plugins and widgets for marketing.</li>  \t<li>Selling your products with e-commerce tools.</li>  \t<li>Start your own affordable email marketing list.</li>  \t<li>How to grow your mailing list with webinars or courses like this one. </li>  \t<li>How to promote your self-published Kindle book and getting ready to market your next book. </li>  \t<li>Finding great themes for your brick and mortar store, restaurant or food truck.</li>  \t<li>How to create forms like the one below so you can sell your product online.<br>  \t<br>  \t</li>  </ul>\n\n\n\n<p>  \t<strong>BONUS: </strong>Get a free PDF copy of my Best Selling Book.  </p>\n\n\n\n<p>  \t<em><strong>Don't forget to check out the free preview lectures to sample my course. </strong></em>Are you ready to learn?<br>  \t<br>  \t                Click On \"<strong>Take This Course</strong>\" and start earning more revenue now with these proven marketing techniques and affordable WordPress plugins and tools.  </p>", 
    "end_date": null, 
    "title": "WordPress Marketing: Profits With Powerful WordPress Plugins", 
    "price": "20.00", 
    "instructors": "Dennis J. Smith", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/257482_578f_5.jpg", 
    "course_url": "https://www.udemy.com/marketing-your-business-with-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-08T04:50:27Z"
}