{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is a nuts-and-bolts examination of the strategies and skills needed to present your books, articles, ideas, and/or yourself in a compelling and competitive manner to potential buyers. It centers on a standard part of any professional writing career, the Query.</p>  <p>Basically, the Query is a short letter (1-2 pages) addressed to an editor, producer, or agent that tries to get them interested enough in an author’s work to read the entire project.</p>  <p>The course consists of twelve video lectures detailing how to create Queries, taught by author Stefan Petrucha based on his two decades of experience in novels and graphic novels. Ranging from two to 12 minutes, they run just under two hours and are presented in three sections:</p>  <ul><li>Query Basics</li><li>Story Basics</li><li>Creating Summaries.</li></ul>      <p><strong>Query Basics</strong> describes how the Query developed, then defines and explores its five essential components: Content, Market, Bio, Availability and Project Status. A focus on marketing teaches students what buyers want, and how to give it to them.</p>  <p><strong>Story Basics</strong> hones in on the most challenging component, Content, where the professional author must pitch the core of their work in a brief, yet captivating manner. By focusing on Story as the basic unit of human communication, students will be able to quickly understand what does and doesn’t work.</p>  <p><strong>Creating Summaries</strong> explores how summaries evolved in different media (film, tv, publishing) and how that context effects the working writer. It then presents specific strategies for condensing story ideas, a process that can also become an effective way to reliably generate content. A final lecture concentrates on the biggest obstacle not only to creating summaries, but to good writing in general: Redundancy.</p>  <p>A free PDF of the book, <em>Writing for a Living</em> is also included.</p>", 
    "end_date": null, 
    "title": "Writing for a Living: The Query", 
    "price": "45.00", 
    "instructors": "Stefan Petrucha", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/583156_54b8_3.jpg", 
    "course_url": "https://www.udemy.com/writing-for-a-living-the-query/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T16:48:12Z"
}