{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<h5 style=\"\">“Write Highly Reactive Sales Letters <u style=\"\">In Tune</u> With Your Prospects And Get Them To Take Action!”</h5>  <h5 style=\"\">Whether you want to improve the conversions of your  sales letters, improve the value of an existing product or want to sell  your services as a freelancer, Sales Man Sales Letters is just what  you&#039;re looking for!</h5>  <p style=\"\">  \tYou know that feeling of settling in for the evening, curled up with a  fresh cup of hot chocolate and a delicious book that you just can&#039;t  seem to put down?  </p>  <p style=\"\">  \tYou read chapter after chapter, eagerly turning pages, ignoring the  world around you as you are completely absorbed in the fantasy story  that&#039;s unfolding with every turn of the page.  </p>  <p style=\"\">  \tThat feeling of being twisted and pulled by someone&#039;s words,  completely under the control of a fiercely compelling story that engages  you, entertains you and makes it virtually impossible to pull away  from, is the stuff that good copywriting is all about.  </p>  <p style=\"\">  \tAnd it&#039;s also why copywriters are some of the highest paid, in-demand  service providers both on and offline. It&#039;s their magical ability to  transform words into vivid images, to paint a clear picture of a scenery  or situation, and to take that control and funnel it into invoking an  emotional response from the reader.  </p>  <p style=\"\">  \tHow would you like to learn the deepest, darkest secrets to the  Internet&#039;s most sought after copywriters who have generated thousands of  dollars for every single page they write?  </p>  <p style=\"\">  \tWithin the pages of the Copywriters Secrets, you will be given an  in-depth look at how copywriters use the power of words to invoke  powerful emotion-driven responses that will drive your conversion rates  through the roof!  </p>  <p style=\"\">  \tWhether you are interested in becoming a high paid copywriter  yourself, or you simply want to learn the insider secrets to crafting  the highest quality sales page copy possible, the Copywriters Blueprint  is a complete guide to mastering the most important element to on and  offline business.  </p>  <h5 style=\"\">Here&#039;s a more detailed look at my step-by-step course:</h5>  <h5 style=\"\"><img src=\"file:///C:/jZip938E/images/case.jpg\" align=\"left\" height=\"275\" width=\"200\" style=\"max-width:100%;\">Using Power Words</h5>  <p style=\"\">  \tDiscover how  copywriters use a combination of &quot;power words&quot; pulled from their secret  swipe file of proven resources, to guarantee the success of every sales  page they create!  </p>  <h5 style=\"\"><img src=\"file:///C:/jZip938E/images/case.jpg\" align=\"left\" height=\"275\" width=\"200\" style=\"max-width:100%;\">Copywriting Structure</h5>  <p style=\"\">  \tDrive your sales  through the roof with a simple, yet powerful structure, that will reach  out to desperate buyers and invoke response driven emotions that will  set your visitors into a buying frenzy!  </p>  <h5 style=\"\"><img src=\"file:///C:/jZip938E/images/case.jpg\" align=\"left\" height=\"275\" width=\"200\" style=\"max-width:100%;\">Maximizing Your Conversions!</h5>  <p style=\"\">  \tWhat you NEED to avoid  if you want to blow the lid off conversions! These are critical elements  you need to know if you want to eliminate any chance of your marketing  campaign being a failure!  </p>  <h5 style=\"\"><img src=\"file:///C:/jZip938E/images/case.jpg\" align=\"left\" height=\"275\" width=\"200\" style=\"max-width:100%;\">Discover The Hot<br style=\"\">       &#039;Money Spots&#039;!</h5>  <p style=\"\">  \tLearn about the &quot;money  spots&quot; and how to ensure that you place your sales copy in such a way  that your reader is STILL engaged and put into your &quot;control cycle&quot; even  if they skim the page and fail to read the entire sales copy!  </p>  <h5 style=\"\"><img src=\"file:///C:/jZip938E/images/case.jpg\" align=\"left\" height=\"275\" width=\"200\" style=\"max-width:100%;\">Sell Your Services And Make Even More!</h5>  <p style=\"\">  \t  Discover how you can  make an outright fortune as an in-demand copywriter to the gurus, who  will pay thousands of dollars for every single page you write, even if  you are brand new to copy writing!  </p>", 
    "end_date": null, 
    "title": "Writing Sales Copy", 
    "price": "45.00", 
    "instructors": "Dr Boyer Cross", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62258_0dc8_5.jpg", 
    "course_url": "https://www.udemy.com/writing-sales-letter/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-26T01:45:09Z"
}