{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em style=\"\">What&#039;s the difference between <strong style=\"\">a person who can write copy</strong> and <strong style=\"\">a person who can&#039;t</strong>?</em></p><p>It&#039;s the same as the difference between a person with a <em style=\"\">successful pitch </em>and one <em style=\"\">without</em>: <strong style=\"\">One makes money while the other doesn&#039;t.</strong></p><p>Feel like your website could be <strong style=\"\">selling more</strong> of your product or service? </p><p>The problem - <em style=\"\">80% of the time</em> - IS IN THE <strong style=\"\">SALES COPY.</strong></p><p><strong style=\"\">Copywriters are an actual industry, some people make money by writing other people&#039;s copy. </strong><span></span></p><p>By taking this this course, not only you&#039;ll be able to finally start writing your own copy, but you&#039;ll be able to save thousands of dollars by making something every marketer making the internet their business should, work on their own copy.</p><p>After you learn the skill you&#039;ll be able to craft sales letters that convert for your website, product/service, email campaigns, or create other people&#039;s copy for a profit. </p><p>Avoid the common blunders other people make when writing sales copy, learn how to build trust first with your readers.</p><p>Master the art of difital persuasion to <strong style=\"\">make your copy seem objective</strong> and yet is truly one-sided toward your product/service</p><p>Structuring and organize your copy is crucial, With this structure, you can t<strong style=\"\">rigger the actions</strong> you want your prospects to take. Whether it&#039;s <em style=\"\">a purchase <strong style=\"\">o</strong></em><em style=\"\"><strong style=\"\">r </strong><strong style=\"\">an email subscription,</strong></em> you can choose this outcome by writing effective copy that flows. </p><p><strong style=\"\"><em style=\"\">The skill of copywriting </em></strong>will be passed to you alongside:</p><ul style=\"\"><li>Walkthroughs and examples of designing and writing a <strong style=\"\">live sales page. </strong></li></ul><ul style=\"\"><li>Lectures on the overarching and <strong style=\"\">fundamental principles of copywriting</strong></li></ul><ul style=\"\"><li>People getting it wrong: <strong style=\"\">Websites with poor copy</strong></li></ul><ul style=\"\"><li>Critiques of examples from my <em style=\"\"><strong style=\"\">personal swipe file</strong></em> (a file full of sales letters).</li></ul><ul style=\"\"><li>Powerpoint lectures outlining the essential <strong style=\"\"><em style=\"\">copywriting strategies and tactics </em></strong>to start writing not good, but great copy.</li></ul><ul style=\"\"><li><em style=\"\"><strong style=\"\">PDF files with questions</strong> to guide your writing</em></li></ul><p> There&#039;s also the <strong style=\"\">copywriters discussion forum</strong> where we will be able to answer all of your questions regarding copy. Also active students get a <strong style=\"\">FREE and PERSONAL REVIEW of your sales letter </strong>(you just need to ask in the discussion forums) – <em style=\"\">normally it would cost about $100. </em></p><p><span></span><strong style=\"\">We also give out assignments</strong>, which are evaluated and why not, graded. The more assignment you deliver<strong style=\"\">, </strong><em style=\"\"><strong style=\"\">the more times we can review your copy. </strong></em></p><p>Because the skill you are learning is writing-related, you should learn through writing, and remember i&#039;m offering <strong style=\"\">one-by-one assistance </strong>by critiquing your sales copy. </p><p>The skill you will learn in this class is<em style=\"\"><strong style=\"\"> not theoretical.</strong></em> It is a skill that requires actual writing.</p><p>Learning h<strong style=\"\">ow to write your own copy</strong> is essential and just like life itself, you have to keep pushing yourself and work past your mistakes until you <strong style=\"\">get it right. </strong></p><p><strong style=\"\"><em style=\"\">We&#039;ll just give you the training you need to do so. </em></strong></p><p><em style=\"\">SHOUTING OUT TO ALL CURRENT AND ASPIRING COPYWRITERS</em></p><p><em style=\"\"><strong style=\"\">If you can think of a better title for this course, send it on a message and get this course half price, regardless of the discount you may already see in the price. Just send us this link along with the new title.</strong></em></p>", 
    "end_date": null, 
    "title": "Write Great Copy: Headlines and Sales Letters", 
    "price": "20.00", 
    "instructors": "We Teach Marketing, Damon Verial", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505550_98d9.jpg", 
    "course_url": "https://www.udemy.com/sales-letters/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-18T21:42:50Z"
}