{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The course is designed for multimedia authors — producers, content-managers, educators, journalists, bloggers. It presents Maestro Concept, a technique used in order to assist the newsroom work in a project-based, teamwork-intensive manner by 'thinking like a reader'. </p><p>The Maestro Concept helps authors to build a story in 'lego way'. Different multimedia elements can be arranged and made up in different combinations according to interests of  target audience and author's aims.</p><p>The Maestro concept developed by Buck Ryan begins with a 'great story idea' that is generated through collaborative idea-group meetings to shape stories before they are written and integrates writing, editing, photography, art, and design. <br><br>The course aim is to present different aspects of multimedia production process. It shows authors step by step instructions how to develop their skills in multimedia storytelling. </p><p>We practice in </p><ul><li>Understanding our audience better</li><li>Producing our multimedia stories in professional way</li></ul><p>We examine different ways to engage our audience in our stories.</p><p>Практический курс ориентирован на авторов, кто уже знаком с основами мультимедийной журналистики и сторителлинга. Редакторы, блогеры, журналисты, контент-менеджеры, которые какое-то время активно практикуют создание мультимедийных историй, на определенном моменте развития ищут новые пути развития своих креативных идей. <br><br>Концепция Маэстро, являющаяся стержнем курса, разработана Баком Райаном, преподавателем Школы Журналистики и Телекоммуникаций Университета Кентукки. </p><p style=\"\"><strong>Задачей команды, работающей по принципам концепции Маэстро, является создание цельных историй, где каждый элемент дополняет другой и привносит дополнительный смысл в рассказ. Целью такой работы является увеличение количества времени, которое читатель уделяет конкретной истории, а также повышение вовлеченности читателя в материал. В русскоязычной практике такие истории чаще всего становятся «темами номера», «сюжетами», «мультимедийными проектами», «приложениями», «спецпроектами». </strong></p><p>Концепция Маэстро, по сути, является дизайнерским подходом к планированию редакционной работы. Редакционные обсуждения по принципам Маэстро проводятся в редакции для того, чтобы согласовать разноформатные элементы истории, а также скоординировать работу журналистов, фотографов, дизайнеров, аналитиков и т. д.<br></p><p style=\"\"><strong>Частью курса является Блокнот мультимедийного журналиста, который высылается по почте каждому участнику. Блокнот разработан совместно Баком Райаном и Оксаной Силантьевой. Он представляет собой навигатор, алгоритм, набор последовательных вопросов, помогающих автору грамотно выстроить свою мультимедийную историю.</strong></p><p>Курс ориентирован на практику, больше похож на мастерскую. Без выполнения заданий и участия в дискуссиях внутри курса участники не освоят материал в полной мере. Лекции и дополнительные материалы — всего лишь отправная точка для самостоятельной работы и профессионального обсуждения полученного опыта.</p>", 
    "end_date": null, 
    "title": "Маэстро мультимедийной истории", 
    "price": "30.00", 
    "instructors": "Oksana Silantieva, Buck Ryan", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674974_c9f4_2.jpg", 
    "course_url": "https://www.udemy.com/maestrocourse/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T21:10:52Z"
}