{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t  Practical course on multimedia journalism and storytelling. Valuable for journalists, content-managers, editors, students and tutors. This course will help to understand modern media practices and to acquire skill of telling stories on different media platforms.  </p>  <p style=\"\">  \t  You will think, structure information, and produce features &#039;in multimedia way&#039;. You will discover 15 different multimedia formats and principles how to choose them for your stories.  </p>  <p style=\"\">  \tПрактический курс ориентирован на журналистов, контент-менеджеров, редакторов, студентов и преподавателей, открывающих для себя мир мультимедийной журналистики и сторителлинга.  </p>  <p style=\"\">  \tЭто — базовый курс, раскрывающий основные элементы мультимедийных публикаций, принципы их планирования и создания.  </p>  <p style=\"\">  \tВ результате прохождения курса вы научитесь не только думать “по-мультимедийному”, видеть потенциал каждой темы, с которой работаете, но и научитесь самостоятельно создавать элементы для мультимедийных историй. Курс поможет опытному журналисту “традиционной редакции” понять, что ждет его при переходе на работу в редакцию мультимедийную. Студентам курс даст представление о многообразии мультимедийных профессий и специализаций, о разнообразных возможностях представления информации.  </p>  <p style=\"\">  \tВыполняя практические задания, каждый слушатель курса сможет определиться со своими склонностями, желаниями и планами профессионального развития.  </p>", 
    "end_date": null, 
    "title": "Практика мультимедийной журналистики и сторителлинга", 
    "price": "30.00", 
    "instructors": "Oksana Silantieva", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310030_687e.jpg", 
    "course_url": "https://www.udemy.com/multimediastories/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-29T13:29:13Z"
}