{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Practical course for editors and editors-in-chief of web-sites. This course will help to understand what web-editors are responsible for, how they can manage content, production processes and teams.  </p><p>You will think, structure, and manage your web-site 'in multimedia way'. You will discover effective practices of planning, producing and distributing content. The course is extremely helpful for senior editors who changed their office from newspaper or TV newsroom to a digital one.</p><p>Практический курс ориентирован на главных редакторов, контент-менеджеров, редакторов информационных сайтов. </p><p>Это — базовый курс, раскрывающий основные требования к редактору современного информационного сайта, дающий навыки эффективного управления медиапродуктом, различными потоками информации внутри редакции и вне её. </p><p>В результате прохождения курса вы научитесь только думать “по-мультимедийному”, видеть мультимедийный и кросс-медийный потенциал каждой темы, с которой работаете. Вы научитесь долгосрочному и краткосрочному планированию, анализу эффективности своих действий. Вы сможете аргументированно вести диалог с программистами, дизайнерами, штатными и внештатными журналистами. Курс поможет опытному редактору понять отличия работы на сайте от работы в газетной, телевизионной редакции или на радио. Начинающим редакторам курс поможет с самого начала выстроить свою работу эффективным образом. <br><br>Курс предполагает выполнение практических заданий и обсуждения результатов.</p><p><br></p>", 
    "end_date": null, 
    "title": "Стать менеджером мультимедийной редакции", 
    "price": "30.00", 
    "instructors": "Oksana Silantieva", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656276_a305.jpg", 
    "course_url": "https://www.udemy.com/mediamanager/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-31T12:25:41Z"
}