{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t        Практичсекий курс о том, как повысить посещаемость сайта СМИ за счет сервиса Яндекс.Новости.  </p>  <p>  \t        Вы молодой журналист пришли работать в интернет-журналистику и хотите узнать ее правила игры?  </p>  <p>  \t        Вы раньше работали в печатных СМИ, а теперь вас взяли руководить сайтом?  </p>  <p>  \t        Вы давно работаете в интернет-СМИ, но вас не устраивает его посещаемость?  </p>  <p>  \t        Вы начали делать новое онлайн-СМИ, но у вас нет денег на его продвижение и на покупку траффика?  </p>  <p>  \t        Вы хотите привлечь новую платежеспособную аудиторию на сайт абсолютно бесплатно и уже сегодня?  </p>  <p>  \t        В этом учебном курсе вы узнаете, как быстро и бесплатно нарастить посещаемость сайта СМИ за счет качественной аудиторией.  </p>  <p>  \t        В рамках этого курса мы рассмотри все особенности работы с сервисом Яндекс.Новости. на сегодняшний день это единственный автоматизированный российский сервис, который позволяет СМИ и блогам без особого труда нарастить аудиторию своего сайта и привлекать новых пользователей.  </p>  <p>  \t        Курс охватывает все аспекты работы этого сервиса, рассказывает об особенностях работы с ним и показывает, как вы самостоятельно, без привлечения программистов, можете настроить трансляцию своих новостей в поток Яндекс.Новости.  </p>  <p>  \t        Мы рассмотрим особенности отбора новостей сервисом, вы узнаете, какие новости без проблем попадут в топ 5 Яндекс, а какие никогда не получат внимания пользователей, даже если они очень интересные.  </p>  <p>  \t        Мы научим вас правильно работать с сервисом так, что бы у ваши новости привлекали внимание не только читателей, но и других СМИ.  </p>  <p>  \t        Вы узнаете, как обходить «подводные камни» и использовать возможности сервиса о которых мало кто знает для своего блага.  </p>  <p>  \t    Мы научим вас, как вы можете установить новый плагин, который упростит задачу трансляции новостей вашего сайта, на сервис Яндекс.Новости. Дадим пошаговую инструкцию, как вы можете самостоятельно установить данный плагин к себе на сайт.  </p>  <p>  \t        В данном курсе, в одном месте собрана вся информация, которая позволит вам быстро и просто подключить свой сайт к сервису Яндекс.Новости и начать получать дополнительный трафик уже ближайшее время.  </p>  <p>  \t        Данный курс, разработка проекта «Центр развития СМИ (Дмитрий Сурнин&amp;Co)». Все участники курса, также смогут принимать участие в бесплатных онлайн-консультациях, которые проводит Центр развития СМИ. Информацию о консультациях вы сможете узнать из сообщений в этом курсе.  </p>  <p>  \tThis course, the development of the project &quot;Center for Media Development (Dmitry Surnin &amp; Co)». All course participants will also be able to participate in free online consultations held Center for Media Development. Information on the consultation, you will be able to learn from the messages in this course.  </p>", 
    "end_date": null, 
    "title": "Яндекс. Новости: эффективное продвижение новостного контента", 
    "price": 0, 
    "instructors": "Oleg Gant, Наталья Белогрудова", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393800_302e_2.jpg", 
    "course_url": "https://www.udemy.com/yandex-news-101/", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T10:51:08Z"
}