{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>تعلم استخدام أفضل نظام لإدارة المحتوى في العالم \"وردبريس\" الذى يتيح لك إنشاء مدونات مجانية للاستخدام الشخصي أو التجاري وكن قادرا على إنشاء موقع إلكتروني بسهولة وسرعة</p><p>إذا كنت تهوى التسويق الإلكتروني أو تحب العمل عبر الإنترنت وتريد مجالا متميزا يمكنك أن تبدع فيه فإن التدوين ينبغى أن يكون على قمة أولوياتك نظرا لسهولته حيث يمكنك أن تبدأ العمل به من الغد بدون أى قيود</p><p>الوردبريس هو المعشوق الأول في العالم لكل من يسعى إلى تسويق مدونته والوصول بها إلى نتائج متقدمة في محركات البحث والحصول على مئات بل آلاف الزوار شهريا، وهو يناسب كل المجالات وكل اللغات بما فيها اللغة العربية.. تعلم وردبريس اليوم ولن تندم لأنك ستحتاجه وستستفيد منه فى عملك على الانترنت</p><p><strong>احترف التدوين باستخدام وردبريس من خلال الشرح العملي التطبيقي باللغة العربية</strong></p><p>فى هذا الكورس سوف تتعرف على</p><ul><li>تصميم مدونات وردبريس احترافية</li><li>القدرة على عمل مواقع شخصية أو للاستخدام التجاري بسرعة وسهولة</li><li>استخدام منصات نظم إدارة المحتوى العالمية</li><li>أرشقة المدونات في محركات البحث لسهولة تسويقها</li><li>ضبط المدونة لنشرها في مواقع التواصل الاجتماعي</li></ul><p>الشرح مبسط ويناسب كافة المستويات بحيث لا تتطلب أى خبرات في العمل على الانترنت أو معرفة سابقة للووردبريس لكي تستفيد منه</p><p>يمكنك البدء في التطبيق العملي أثناء مشاهدة الكورس حيث لا يتطلب التطبيق إلا توفر الاتصال بالانترنت فقط</p><p>يشمل الشرح ترجمة احترافية لكافة المصطلحات التى قد تواجهك عند استخدام وردبريس بحيث يمكنك استيعاب الشرح وتطبيقه بما يضمن امتلاكك لكافة الأساسيات التى تؤهلك لتصميم مواقع الانترنت باستخدام وردبريس عند نهاية الكورس</p><p>توفر المحاضرات حلولا عملية لكتابة محتوى للمدونة واختيار التصميم المناسب لها والتحكم في التصميم بما يتلاءم مع غرض الموقع الذى تقوم بتصميمه، كما أن المحاضرات قصيرة لا تتجاوز كل منها عدة دقائق لتثبيت المعلومات وتسهيل مراجعتها إذا كنت ترغب بإعادة مشاهدتها في أي وقت، وبشكل مجاني تماما</p>", 
    "end_date": null, 
    "title": "أساسيات التدوين باستخدام وردبريس Wordpress", 
    "price": "20.00", 
    "instructors": "Mohammed Fakhry", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563570_afc0_4.jpg", 
    "course_url": "https://www.udemy.com/wordpress-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T11:14:12Z"
}