{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><br></p><p style=\"\">إذا كان الكاتب التسويقي عبارة عن بائع سلاحه النص والكلمة والعبارة، فينبغي لمن يريد أن يتعلم هذا العلم أن يكون ملماً بأساسيات علم التسويق (الذي اختصرناه بكلمة تاجر) وخلاصة فن البيع المغوار الحديث الذي اختصرته بالهمزات الأربع ومن خلال هذه المحاور يتم بناء المحاكمة العقلية التسويقية البيعية التي تولد نصاً جالباً للربح وراسما لصورة ذهنية تسويقية تستمد قوتها من جذورها التي ترتبط بأزرار المشاعر وأزرار الحساسية والقيم الإنسانية المحركة لدوافع الشراء.</p><div>رغم ضخامة رؤوس الأموال وتوافر الإمكانيات نادراً ما نجد شركات عربية قادرة على مخاطبة شرائح المستهلكين في العالم واختراق أسواقهم، وقليلاً ما نجد كتبة تسويقيين مهرة على دراية بعادات التسوق والسلوك الشرائي وقادرين على صياغة نصوص إعلانية بلغة عربية أصيلة ينتج عنها زيادة في حجم المبيعات وفتحاً لأسواق عالمية جديدة. حتى أن الطفرة التجارية والاقتصادية التي يشهدها عالمنا العربي حالياً ترافقت بحملات تسويقية استنزفت الملايين، وللأسف، غالباً ما تصاغ باللغة الإنجليزية من قبل أجانب متخصصين في فن الصياغة التسويقية ثم يتم ترجمتها بشكل شبه حرفي إلى اللغة العربية فيأتي النص هزيلاً ضعيفاً لا يقوى على مخاطبة خيال القارئ العربي. </div><p>تعد هذه الدورة حصيلة أكثر من عشر سنوات من البحث الحثيث والدؤوب عن أسرار التميز في مخاطبة السوق والمراقبة القريبة لأسباب نجاح الشركات وفشلها، وآليات تحقيق الأرباح واستمالة شرائح سوقية جديدة، ويقدم بأسلوب مبسط زبدة ما ذُكر في أحدث كتب الصياغة التسويقية، وحصيلة الخبرة التي توصل إليها العديد من الكتبة التسويقيين المهرة وأسرار تميزهم ونجاحهم، بشكل يساعد الكاتب التسويقي العربي على التعرف على أسرار المهنة ويخط له طريق النجاح والتميز بها.</p><p>نتناول هنا للمكونات الرئيسية للنصوص الإعلانية وسرداً لأهم الأسئلة التي تعين الكاتب على تكوين صورة شاملة للمنتج والشريحة السوقية المستهدفة قبل شروعه في الكتابة، كما يتعرض لمهارات التعامل مع أزرار إطلاق المشاعر وأزرار الحساسية، والعوامل الهامة التي تغري الزبون بالشراء، </p><p><br></p>", 
    "end_date": null, 
    "title": "الكاتب التسويقي: فن التسويق والبيع والعزف على أوتار المشاعر", 
    "price": "25.00", 
    "instructors": "Sobhi Akbik", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/807512_f5af_4.jpg", 
    "course_url": "https://www.udemy.com/arabcopywriter_1/", 
    "currency": "USD", 
    "subject_name": [
        "Content Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-29T19:13:52Z"
}