{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>\t<strong> THE HOLY GRAIL FOR PHOTOSHOP RETOUCHING - 10 COURSES IN 1 </strong>  </p>  <ul>\t<li>MORE THAN 1400 STUDENTS HAVE ENROLLED ALREADY</li><li>10 Courses, 26+ Hours of retouching lessons<em> \"Learning All Secrets\"</em></li>\t<li><em>All Lessons include step by step in video instructions!</em></li>\t<li>Includes all raw &amp; psd files which you can profit from - <em>Instantly!</em></li>\t<li>No Prior Photoshop skills or knowledge needed \"Guaranteed\"</li>\t<li>Full &amp; free lifetime access to the complete course</li>\t<li>All future &amp; additional lectures will always be <em>\"for free\"</em></li>\t<li><em>Regular updates with more courses making this the <strong>Real Holy</strong><strong> Grail Of Photoshop</strong></em></li>  </ul>    <p>\t<strong> ARE YOU NEW OR STRUGGLING WITH PHOTOSHOP RETOUCHING? </strong>  </p>  <ul>\t<li>AND MASSIVELY WANT TO IMPROVE IT?</li>\t<li>AND DO IT EASILY AND INSTANTLY?</li>\t<li>AND BE ABLE TO APPLY IT TO YOUR OWN IMAGES?</li>\t<li>AND BE ABLE TO RETOUCHING ANYTHING?</li>  </ul>  <p>\t<strong> --------------------------- \" <em>Then this course is for you </em>\" ------------------------------- </strong>  </p>  <p>\t<strong> What This Course Entails: </strong>  </p>  <p>\t I will teach you how to get into advanced photoshop retocuhing, so don't worry if you don't have prior experience with compositing or other skills. Follow my lead and I'll teach you to be good at it! <em><strong>“I Promise You\"</strong></em>  </p>  <p>\t All my retouching instructions form part of a comprehensive guide that can help you to accomplish your goals by applying these techniques. During all the lessons you get to eavesdrop as I work, giving you all insight as to how I work and what I do.</p>    <p>\t<em>The idea is to teach you how to become a master in photoshop retouching. Be it for your own work, or for a client. My aim is to teach you all the tricks, techniques &amp; secrets to overcome this difficult task!</em>  </p>    <p>\t Whether you have previous experience with photoshop or not, it doesn't matter. Apply your knowledge for an hour a day and you could be making huge improvements or even extra cash, <em>as a retoucher just like me</em>.</p>  <p>\t<em><strong>\"And I'm not kidding when I say that you need no previous photoshop experience! \"You just need to Practice your eye and the photoshop techniques\"</strong></em>  </p>  <p>\t All future extra lectures and upgrades are always included for free. Unconditional Udemy 30 day money-back guarantee - that's my <em>personal promise of your success!</em>  </p>  <p>\t You'll learn</p>  <ol>\t<li>How to become a photoshop retouching expert \"Guaranteed\"</li>\t<li>How to do intermediate &amp; advanced beauty retouching in photoshop</li>\t<li>How to do advanced retouching techniques for car retouching</li>\t<li>You will learn over 100 amazing retouching techniques &amp; shortcuts. \"I promise you that\"</li>\t<li>How to retouch portraits but also take the image to a next level</li>\t<li>You will learn all beginner, intermediate and very advanced compositing skills</li>\t<li>How to work with almost all photoshop tools. \"Beginner, Intermediate and Advanced Tools\"</li>\t<li>How to use advanced layers techniques and adjustment layer techniques</li>\t<li>How to work with complex adjustment layer marks and how to use them to enhance your images</li>\t<li>How to work with intermediate &amp; advanced dodge &amp; Burn Techniques</li>\t<li>You will be able to retouch anything in adobe photoshop after this course! \"GUARANTEED\"</li>\t<li>How to work with amazing color grades, and also how to create advanced color grades &amp; moods</li>\t<li>How to take all your work / images from blaa... to WOW</li>\t<li>How to work &amp; create amazing images out of multiple exposures</li>\t<li>How to deep edge people and merge them back into new images. Create unbelievable compositions...</li>\t<li>You will learn advanced techniques on how to change day images into night images!</li>  </ol>  <p>\t ... and so much, much more!</p>    <p>\t<strong> Intrigued yet? Then keep reading! </strong>  </p>  <p>\t As with all my courses: the initial low price will increase after time. This one is currently $99 and it will next upgrade to $150 so join in now! \"<em>You will have unlimited lifetime access at no extra cost \"</em>Not just that; all future additional lectures, bonuses, etc in this course are always free.</p>  <p>\t There's an unconditional, no-questions-asked full 30-day money-back guarantee! I'm known for always offering support on Udemy, so feel free to shout out if you're stuck or need assistance. <em>\"I'm here to help\"</em>  </p>  <p>\t<strong> One final note: </strong>  </p>  <p>\t My goal is to teach you how to overcome this complex task, so don't stress about not having done photoshop work before. <em>\"I do my best to make it simple, informative &amp; fun\"</em>  </p>    <p>\t<em>I've crammed all my 5 years, of photoshop knowledge into these 10 sections and over 160 lessons \" I wish I had found something like this 5 years back\"</em>  </p>    <p>\t After going through this course you'll be able to apply your new retouching skills to <em>retouch any complex images and make some extra cash along the way</em>.</p>  <p>\t All you have to do is click on the <strong>\"take this course\"</strong> button on the top right corner. You have nothing to lose. In fact, you've got a lot to gain.</p>  <p>\t Thank you,</p>  <p>\t Manni</p>", 
    "end_date": null, 
    "title": "10 Courses In 1 - The Holy Grail For Photoshop Retouching", 
    "price": "20.00", 
    "instructors": "Manfred  Werner", 
    "commitment": "25.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309348_107a_10.jpg", 
    "course_url": "https://www.udemy.com/thehollygrail/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-28T08:38:23Z"
}