{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><br></p>\n\n<hr>\n\n\n\n<p>  \t               With <strong><em>Basic Food Photography</em></strong>, you can quickly learn to take stunning food photos even if you’ve never picked up a camera and never styled a plate of food!  </p>\n\n\n\n<p>  \t               Thanks to social media, <strong>food photography is now a big deal</strong>. Sites like Instagram and Pinterest make it easier than ever to take pictures of food and share them with millions of viewers. But getting your pictures noticed requires so much more than just a well-composed snapshot...  </p>\n\n\n\n<p>  \t              The problem is, <strong>Food photography is uniquely challenging</strong> because it demands the perfect balance of<em> artistic and technical skills</em>. A great food photographer knows how to combine the technical skills of taking well-composed pictures with the artistic skills of styling gorgeous food scenes.  </p>\n\n\n\n<p>  \t               That's the goal of <em>Basic Food Photography</em> – <strong>this 27-lesson video course weaves together the art and the technology behind food photography</strong> in a way that you can put into practice. The skills you learn here will help you take stunning photos from start to finish - anytime, anywhere, with any camera.  </p>\n\n\n\n<p>  \t <strong>Specifically, <em>Basic Food Photography</em> will teach you these core skills:</strong>  </p>\n\n\n\n<ul>  \t<li><strong>Food Storytelling</strong> - Learn to give your pictures power by telling a delicious story through the food and the scene.</li>  \t<li><strong>Food Styling</strong> - If the food looks unappealing, so will the photos. Learn to style your food in ways that are photogenic to create stunning pictures.</li>  \t<li><strong>Scene Composition</strong> - Compose beautiful and structured food scenes that make best use of lighting, surfaces, accents, and more.</li>  \t<li><strong>Photo Shooting</strong> - Learn how to get the most from your equipment (from iPhone to DSLR) to take gorgeous, well-composed food photos every time.</li>  \t<li><strong>Image Processing</strong> - The goal with any food photo is to make it look realistic. This can be enhanced with a few key editing effects that you’ll learn how to apply.</li>  \t<li><strong>Sharing</strong> - Gain recognition for your work by applying techniques that engage the social web around the delicious photos you’ve learned how to create.</li>  </ul>\n\n\n\n<p>  \t               In this course, I am sharing all the photography techniques that have helped my food blog grow to over 125,000 monthly views in less than a year. Whether you want to start a food blog, or simply share more rewarding food photos with friends, <em>Basic Food Photography</em> is designed to give you <strong>the confidence you need to take stunning food photos that get noticed</strong>.  </p>\n\n\n\n<p>  \t                                                                                 In addition to over <strong>5.5 hours of practical, hands-on instruction</strong>, this course includes a printable 17-page “cheat sheet” with key points that you can reference time and time again to make your photo shoots more successful. This dynamic Udemy platform also gives you <strong>direct access to me</strong> where I can offer you personalized instruction and feedback along the way.  </p>\n\n\n\n<p>  \t                                              In just over 5 hours of lessons, you will gain the skills and confidence to shoot more rewarding food photos that you can be proud to share with others. I cannot wait to see the amazing pictures you're going to take!  </p>\n\n\n\n<p>  \t                                              Andrew Olson<br>  \t<em>Photographer &amp; Recipe Developer,</em><br></p>\n\n\n\n<hr>\n\n\n\n<p>  \t <strong>What Other Students Are Saying:</strong></p>\n\n\n\n<hr>\n\n\n\n<p>  \t <strong>Ready to get started?</strong>  </p>\n\n\n\n<ol>  \t<li>Click the \"Take This Course” button above</li>  \t<li>Enter your details and click \"Confirm Purchase\"</li>  \t<li>You’ll have instant access to all the information in this course</li>  </ol>\n\n\n\n<p>  \t <strong>P.S. </strong><em>Basic Food Photography</em> comes with a 30 day money back guarantee. Sign up today and check out all the material. If it doesn’t help you take stunning food photos in 30 days, you’ll get a full refund. No questions asked. Go ahead and click the “Take This Course” button now - there's absolutely no risk.  </p>", 
    "end_date": null, 
    "title": "Basic Food Photography", 
    "price": "30.00", 
    "instructors": "Andrew Olson", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119486_87e4_11.jpg", 
    "course_url": "https://www.udemy.com/basic-food-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-13T19:51:57Z"
}