{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>In diesem Training lernst Du alles Wichtige zum <strong>Bearbeiten Deiner Blogfotos in Lightroom - ohne jegliche Vorkenntnisse zu besitzen</strong>. Im ersten Teil erhältst Du einen kurzen Überblick über die <strong>detaillierten Arbeitsschritte</strong>, die ich Dir im Folgenden per Bildschirmaufzeichnung zeigen werde. Danach erhältst Du einen <strong>Überblick über Lightroom</strong> und die für Deine Arbeitsschritte relevanten Bereiche. Danach zeige ich Dir, wie Du <strong>Kataloge</strong> erstellst, Fotos importierst und wie Du danach einen sinnvollen Workflow nutzen kannst, um Deine Fotos effektiv zu sichten und eine Auswahl zu erstellen.</p><p>Im zweiten, <strong>fast einstündigen Video</strong>, gehe ich anhand von 3 Fotos darauf ein, wie Du die verschiedenen <strong>Bearbeitungs-Regler und -Tools</strong> nutzen kannst, um das Beste aus Deinen Fotos herauszuholen. Die für Dich unnützen Bereiche lassen wir außer Acht, damit Du Dich <strong>nur auf die für Dich wichtigen Bereiche</strong> konzentrieren kannst.</p><p>Nach der ausführlichen Bildbearbeitung erfährst Du im dritten Teil, wie Du Dein Foto für Deinen Blog <strong>optimal exportierst</strong> und mit einem <strong>Wasserzeichen</strong> versehen kannst.</p><p>Mit diesem Videokurs lernst Du also alle wichtigen Arbeitsschritte, um Deine Fotos schnell und einfach bearbeiten zu können. Damit gelingt Dein Einstieg in Lightroom ohne Probleme - also melde Dich jetzt an!</p>", 
    "end_date": null, 
    "title": "Blogfotos in Lightroom optimieren", 
    "price": "20.00", 
    "instructors": "Nina Karin Neumann", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672450_84f9.jpg", 
    "course_url": "https://www.udemy.com/blogfotos-in-lightroom-optimieren/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-17T17:12:07Z"
}