{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Du willst als Fotograf arbeiten und dich selbstständig machen? Dieser Kurs zeigt dir die ersten Schritte in dein eigenes Fotografie Business. </p><p>Es spielt keine Rolle ob du Student, Azubi oder Quereinsteiger bist!</p><p>Denn in diesem Kurs geht es um die Grundlagen der Selbstständigkeit als Berufsfotograf und wie du die ersten Schritte meisterst. Du wirst Schritt für Schritt durch den Kurs geführt und erstellst nach und nach einen eigenen Geschäftsplan für dein Business. So hast du am Ende deinen persönlichen Plan mit dem du dann loslegen kannst. </p><p>Doch im Gegensatz zu gewöhnlichen \"Businessplänen\" wie sie von Existenzgründungen verwendet werden, wird hier im Kurs mit der Psychologie begonnen. Du wirst zunächst herausfinden in welche Richtung sich dein Leben entwickeln soll. Dies hat den Grund, dass auf dieser Grundlage dein Geschäft gestaltet wird: Wer ist die passende Zielgruppe? Was ist das passende Metier und Genre? Diese Fragen werden dann nach und nach beantwortet. </p><p>Im Verlauf des Kurses wirst du immer konkreter und stellst Berechnungen an, erfährst wie du an erste Aufträge kommst, wie du dich als Marke positionierst, lernst Stolpersteine bei der Gewerbeanmeldung kennen uvm. </p><p>So hast du am Ende ein klares Bild davon, wohin deine Reise gehen soll. Auf dem Weg hast du die Grundlagen der Selbstständigkeit gelernt, sodass du loslegen kannst. </p><p>Abgerundet wird dieser Kurs natürlich noch mit einem Fotografie Teil, in dem du einen Workflow kennenlernst mit kompletter Bildbearbeitung. Auch wirst du lernen wie du deinen eigenen Bildstil herausfinden kannst. </p><p>Kapitel 1: Psychologie </p><p>Kapitel 2: Business</p><p>Kapitel 3: Handwerk</p><p>Kapitel 4: Bonus</p><p>Dieser Kurs ist von Fotografen für Fotografen und verbindet Kenntnisse aus der Praxis mit Psychologie, Business und Marketing. </p><p>Ziel ist es mit diesem Kurs die Brücke von der Theorie in die Praxis ins eigene Geschäft zu schlagen! </p><p>Ich freue mich dich in meinem Kurs begrüßen zu dürfen!</p>", 
    "end_date": null, 
    "title": "Dein Fotografie Business", 
    "price": "30.00", 
    "instructors": "Christopher Grigat", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/856180_0fd2_2.jpg", 
    "course_url": "https://www.udemy.com/dein-fotografie-business/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-21T23:23:57Z"
}