{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><em><strong>&lt;&lt;&lt;&gt;&gt;&gt; FIELD GUIDE TO : START YOUR OWN PHOTOGRAPHY BUSINESS &lt;&lt;&lt;&gt;&gt;&gt;</strong></em><br></p><p><em>         Includes how to create a website to sell your images step by step creation guide. If you are looking to learn how to take pictures this course is not for you. Focus of this course is gear selection, how to build a website and how to market yourself as a photographer.</em></p>  <p>  \t                              <strong>In this course I will teach you how to become a successful event photographer, including all the basic knowledge need to set up this business at the minimum required expense without compromising quality of your work.</strong></p><p>Photography can be very expensive profession requiring huge upfront cost but it does not have to be this course teaches you what you need to get started as a photographer a degree is not required neither is expensive gear.</p><p>The equipment given here is recommended stuff that will help you get the job done that should last you for the long term as well. Keep in mind anything less won't be professional enough and no one will take you seriously. </p><p>This course also includes a bonus on how to use iPhoto application to edit your pictures and make them looks professional as well as tutorial on how to make money selling your pictures to stock photography agencies.</p>    <p>  \t<strong>This is an ongoing photography course: Once you buy this course you will have access to any new material that I add to the course and as always you get lifetime access once purchased on your laptop or mobile makes a great gift as well.</strong>  </p>  <p>  \t                              Class is geared toward mostly beginners to those starting out and wanting to learn more about how to fast track your journey from an amateur to a professional.</p>  <p>  \t                              This course is a training guide that will help you in your journey. In this course we will how you get started to everything you need to know to take off as a successful photographer best of all no advanced degree is needed. This is all the knowledge you wish you knew before you took your first photography job.  </p>  <p>  \t                              The knowledge that you will learn in this class will pay off the price of this course a few times over. I will teach you what took me years to learn and how to market yourself as a photographer. Large focus would be how to self market yourself at low or nearly no cost to you.  </p>  <p>  \t                              Some of the things you will learn are:  </p>  <ul>  \t<li><strong>How to set up a beautiful but inexpensive website</strong></li>  \t<li><strong>Essential equipment needed to set up your business </strong></li>  \t<li><strong>Common mistakes made and how to avoid them</strong></li>  \t<li><strong>Ways to get clients at low or bare-bones budget</strong></li><li><strong>How to sell your pictures on stock photography</strong></li>  \t<li><strong>How to find a cheap or low cost assistant </strong></li>  \t<li><strong>Create a wedding album and edit pictures</strong></li>  \t<li><strong>Using iPhoto on a mac tips and tricks</strong></li>  </ul><p><br></p><p><strong>NOTE ABOUT THIS COURSE</strong></p><p>If you are serious about photography and making money in this business you have to buy the required equipment. Many courses fail to teach you what exactly the equipment you need to get started and what is the minimum requirement that you actually need to be able to get the job done. This course is designed for newbies who know how to take pictures most of this course focuses on essential gear, how to create a website and marketing yourself.<br></p><p>You do not have to get all the equipment right away you buy it as you save up money, I do not recommend you take out a loan or just using a credit card to pay for it its much better to save your money then pay for it in full. Some equipment might seem expensive but for photography purposes its not and anything cheaper just won't give you the quality you need to pass as a professional no matter how good your skills are.</p><p>Selected lectures will give you external links to recommended equipment or other stuff I mentioned in case you do want to purchase it for yourself. Also note I am heavily biased when it comes to Canon most photographers choose a brand they like and use it I happen to like Canon so most of my recommendations are Canon gear. If you want to know other brand equipment I recommend feel free to ask me.</p><p>Not all equipment is the same and if you want better quality you need to pay for it. This course gives you all your options you definitely can save a lot of money by buying the stuff that is suggested if you buy it used or if its white label none USA warranty. The rest of the course then focuses what you need to do to build your business, how to market yourself, create a website and then how to edit your pictures using iPhoto.</p>", 
    "end_date": null, 
    "title": "Event photographer: Start your own photography business fast", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/349880_7615_26.jpg", 
    "course_url": "https://www.udemy.com/photographer/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T18:24:30Z"
}