{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t              Fashion and glamour photography is rapidly gaining popularity.  With the help of Michael Corsentino, you will learn how to work with your model to get her looking and feeling her best. Come along for the ride as Michael searches for the perfect city locations, develops a story, and delivers jaw-dropping images. For a magazine cover or a woman’s personal collection, Michael will show you how to take images that will make any woman proud.  </p>  <p>  \t        Bonus eBook included;  </p>  <p>  \t<strong>Learn Photoshop CC with this eBook training package! see Lecture 24</strong>  </p>  <p>  \t        Adobe Photoshop is the industry leading image-editing program for digital  photographers, graphic designers, and web developers, and the newest version  includes even more great tools to manage and enhance your images. Written by a  team of experts, this book delivers full-color, step-by-step  instructions that make learning Photoshop easy to understand. You&#039;ll explore how  to work with layers, use filters, and create images for web and video, and much  more. The video training complements the book, allowing you to learn at your own  pace, and, ultimately, enhancing your entire learning experience.  </p>  <p>  \t         • Encourages you to discover essential skills and explore new features and  capabilities of Photoshop CC (Creative Cloud)  </p>  <li> Includes step-by-step instructions for each lesson, along with lesson files  and video tutorials that complement the featured topics  (link provided in Lecture </li>  <li> Covers Adobe Bridge, Camera RAW, masks and layers, painting and retouching,  and selections and layers</li>  <em>Photoshop CC Digital Classroom</em> takes you from the basics through  intermediate-level topics and helps you find the information you need in a  clear, approachable way.  <p>  \t<strong>Note:</strong> Tutorials and other supplementary materials are not included as part  of the e-book file, but are available for download in Lecture 25 of this course.  </p>", 
    "end_date": null, 
    "title": "Fashion and Glamour Photography", 
    "price": "50.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/153722_de05_5.jpg", 
    "course_url": "https://www.udemy.com/fashion-and-glamour-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-27T20:31:38Z"
}