{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p style=\"\"><strong style=\"\">Transform your passion in profits with the PhotoCoach system!</strong><br style=\"\"></p><p style=\"\">Do you face these problems at the end of every month: insufficient cash flow, calls from suppliers, no pay cheque? Would you like to have a successful photography business where you will be able to live your passions and make profits?<br style=\"\"><br style=\"\">In this 3.5 hour course, you willl:</p><ul style=\"\"><li style=\"\">Discover the one proven way to master profit-making.</li><li style=\"\">Understand where profits come from.</li><li style=\"\">Pinpoint your studio&#039;s position in the market.</li><li style=\"\">Think strategically to improve your studio’s profitability.</li><li style=\"\">Reach your full potential.</li></ul><p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p style=\"\"><strong style=\"\">About André Amyot, the Photocoach<br style=\"\"></strong></p><p style=\"\">André is a professional photographer with 35 years of experience in photography and 12 years in coaching photographers.<br style=\"\"><br style=\"\">In 1974, after a 10 year career in the Canadian military forces, he started up SRT Photo inc, one of the most successful studios in North America with an annual turnover of nearly 2 million dollars. <br style=\"\"><br style=\"\">André developed a strong reputation for his ability to create beautiful images, unique and different within all sorts of environments sometimes very difficult. He quickly realised the key to success was not only dependent on the delivery of beautiful images but also in the ability to sell the service in the highly competitive market of the big city. <br style=\"\"><br style=\"\">In 2000, following his passion for photography, André transformed his main mission. He now devotes his career to helping photographers of all specialities to achieve personal and professional success. Since 1986, André repeated his message to photographers everywhere in Canada, United States and Europe.<br style=\"\"><br style=\"\">His preferred subject leans towards marketing but André continues to offer courses in administration, profitability, techniques of creativity and on personal success. In addition to his speaking engagements, Andre provides training and personal coaching by phone, internet and teleconference.<br style=\"\"><br style=\"\">To know more about André and his services, consult his website at <a href=\"http://www.photocoach.com/en\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">www.photocoach.com </a> </p>  ", 
    "end_date": null, 
    "title": "How to Manage a Profitable Photography Studio", 
    "price": "50.00", 
    "instructors": "Les Editions Media-coach inc.", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/35119_9d6d_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-manage-a-profitable-photography-studio/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-08T16:22:55Z"
}