{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><em>*****OVER 30+ HOURS OF PHOTOGRAPHIC TRAINING***</em></p><p>Commercial photography can be a lucrative business! It's true; photography rates can run $1000, $2000, and even $5000 per day plus expenses. A career in commercial photography can be pretty exciting while you are photographing an annual report, company brochure, travel essay, an advertisement, or traveling the globe on assignment. Is this your idea of the dream job!  </p>  <p>  \t      Can you photograph food for a restaurant menu or a company CEO for an annual report? Do you know how to 'style' a shoe to photograph? What price should you charge for a stock photo usage?  </p>  <p>  \t<strong>In this course you will learn:</strong>  </p>  <ul>  \t<li>How to photograph people, places, and products</li>  \t<li>How to master strobe lighting</li>  \t<li>How to set up your business</li>  \t<li>How to be a creative and in-demand photographer<br>  \t</li>  </ul>  <p>  \t<strong>Learn about clients, portfolios, and marketing</strong>  </p>  <ul>  \t<li>How to find clients</li>  \t<li>How to create and present your portfolio</li>  \t<li>How to market your business</li>  \t<li>How to price for profit<br>  \t</li>  </ul>  <p>  \t<strong>Should you go to college or learn online?</strong>  </p>  <p>  \t      While many general college programs teach basic through advanced photography skills, it can it takes years and cost a fortune. There are private professional schools to teach you How to Become a Professional Photographer and they have great programs but have you checked out the costs at those schools? One 10 month program in Massachusetts is over $25,000. Another very good school in Southern California does not even publish their tuition, but it is almost $100,000. Can you afford that?<br>  </p>  <p>  \t<strong>This is the most complete online training in commercial photography!</strong>  </p>  <p>  \t      That’s a bold statement isn’t it? This Commercial Photography Program is designed to meet the demands photographers experience in today’s markets, but what makes this program uniquely different is that the majority of photo examples used in the program are from <strong><em>real photo shoots, on real assignments, and photographed for real clients. </em></strong>  </p>  <p>  \t      We did not just go into a studio and video tape where to put lights for all examples. Instead, we show you the photo taken in the studio or on location for a client. We show you in many cases why we chose the angle we used, where lights were placed, and any technical challenges we faced and how they were solved.<br>  </p>  <p>  \t<strong>This course covers everything a commercial photographer might photograph:</strong>  </p>  <p>  \t      - Portraiture  </p>  <p>  \t      - Product Photography  </p>  <p>  \t      - Architecture  </p>  <p>  \t      - Corporate and Industrial  </p>  <p>  \t      - Advertising  </p>  <p>  \t      - Fashion and Beauty  </p>  <p>  \t      - Travel  </p>  <p>  \t      - Food and Beverage  </p>  <p>  \t      - Lifestyle  </p>  <p>  \t      - Editorial  </p>  <p>  \t      - Stock  </p>  <p>  \t      and some Photoshop as well.<br>  </p>  <p>  \t<em><strong>'This is not a simple photography class. It is career training!'<br>  \t</strong></em>  </p>  <p>  \t      Professional Photography was created as an in-depth, accelerated, and intensive program to meet the needs of aspiring pros who wish to work in today's business? It is a demanding business requiring a precise set of skills and knowledge of creative and technical processes is designed to take beginning photographers from novices to pros resulting in a portfolio to show art directors.  </p>  <p>  \t<strong>Photography is a business!</strong>  </p>  <p>  \t      You will also learn how to budget for your business and studio, create marketing materials, design a portfolio, determine your photography rates, bid on jobs, price stock photography, find clients, seek a stock photo agency, and a lot more.  </p>  <p>  \t      All you need is a dSLR camera, tripod, a few lights (see downloadable PDF on recommendations) and the passion to get started. Simply watch the intro video for examples of what is covered.  </p>  <p>  \t      ______________________________________________________________________  </p>  <p>  \t      You get full unlimited access to this course forever including all future video lectures.!  </p>  <p>  \t      And in case you did not know, <strong>Udemy has an unconditional 30 day money-back guarantee</strong> and it is not your standard guarantee, it's my promise to you that you will have the needed information to succeed in outdoor photography.  </p>  <p>  \t      _____________________________________________________________________  </p>  <p>  \t<strong>HAPPY STUDENTS SAY:</strong><br>  \t<br>  \t      Charlie, I would like to thank you for sharing your expertise with me throughout this course. When I finish a photo shoot or finish retouching a photo in Photoshop, I am amazed at how much I have learned. A year ago I could not have imagined that I would have experienced so much.  </p>  <p>  \t      Best regards,  </p>  <p>  \t      Lidia<br>  \t       ______________________________________________________________________  </p>  <p>  \t      I asked my friend Sarah to model for me to practice my lighting. The gym she<br>  \t       goes to, saw the pictures and asked me to shoot one for an ad, which is a before and after shot of Sarah. If I hadn't taken this course, I would have never had this opportunity! Thanks Charlie!      Karen B. (Canada) <br>  \t       ______________________________________________________________________  </p>  <p>  \t      Charlie, Thanks for your support, this was a great course! Being really honest, it's my biggest dream to open my own studio. Now, I have to still learn, but I'm looking for possibilities for doing it. Mostly I'm interested in creating shots of people or models. Once more, thanks for your course.<br>  \t       Ivana K. (Czech Republic)<br>  \t       ______________________________________________________________________  </p>", 
    "end_date": null, 
    "title": "How to Be a Commercial Photographer", 
    "price": "50.00", 
    "instructors": "Charlie Borland", 
    "commitment": "34 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21257_69c2_13.jpg", 
    "course_url": "https://www.udemy.com/total-training-in-commercial-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-16T16:18:20Z"
}