{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Make Your <strong class=\"redactor-inline-converted\">Food Photography</strong> stand out using <strong class=\"redactor-inline-converted\">Photoshop</strong> and <strong class=\"redactor-inline-converted\">Lightroom</strong>. Learn editing food pictures like a pro. Bring your photos from \"ok\" level to \"Delicious-Mouth-Watering-I-Want-It!\" level. </p>\n\n<p><em>Update: May 20 2016: </em>I just added pictures which i used in this course - for you to download. Go to Section 2, Lecture 3, and get them and practice on them! Enjoy!</p><p><em>Update: May 01 2016: added new lecture: \"Simple lighting setup with the light from one side (window)\"</em></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Master Lightroom and Photoshop with Food Photography - Gain Your Skills FAST with this Very Focused Course.</strong></p>\n\n\n\n\n\n<ul><li>in Lightroom Quickly and effectively choose your best pictures out of many from the photo sessions</li><li>Transform a good pictures into delicious ones.</li><li>Become a sought after \"Food Photo Doctor\" (Retoucher)</li><li>Organize your pictures in \"Collections\" in Lightroom, so you can easily find them in the future</li><li>Use Photoshop and Lightroom effectively</li><li>Being focused on food photos only you will dive deep and become able to make even advanced editing in no time</li><li>Prepare photos for publishing on websites, blogs, Facebook and other social media sites both in Lightroom and Photoshop</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bring Your Food Photography to a New Level with a help of Lightroom and Photoshop</strong></p>\n\n\n\n\n\n<p>Whether You are a food photographer, food blogger, a cook or restaurant owner/marketer, you need as good food pictures as possible to attract clients, guests and readers. Sometimes it can happen that the picture is great straight from the camera. Still its good to prepare it in a right way for publishing.</p>\n\n\n\n\n\n<p>On the other hand, it can happen that there is not everything as you would like in the picture, or even maybe you don't know, that the picture could look better ...much better. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">The difference between \"ok\" picture and \"wow\" picture</strong> many times is in a series of little tweaks, little changes, which combined makes the big difference. Some of those changes you can do while taking a picture. And more little changes - in Lightroom and/or Photoshop. In this course you will learn how to do this little and also <strong class=\"redactor-inline-converted\">quite big changes</strong> in editing process. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Content and overview</strong></p>\n\n\n\n\n\n<p>The course is designed for beginners and those who have already some experience in working with Lightroom and Photoshop. The main goal was to walk you through only the options and adjustments needed to effectively edit food pictures. Anything else was skipped in order to make the whole process easy and to not make you feel overwhelmed with all the possibilities this programs have (and they do have).</p>\n\n\n\n\n\n<p>The course contains 3 main parts (sections): first you will learn how to import, select and make general adjustments to your best pictures in <strong class=\"redactor-inline-converted\">Lightroom</strong>. Then you will go deeper with editing, retouching pictures in <strong>Photoshop</strong>. After that i will show you how to prepare pictures for websites, blogs and social media sites.</p>\n\n\n\n\n\n<p>You get the full access to this course for a lifetime. All updates and new lessons are free and forever. You can always ask questions in the forum inside the course.<br><strong class=\"redactor-inline-converted\">You have a 30 day no questions asked full money back guarantee. There is no risk on your side at all! You can only win!</strong></p>", 
    "end_date": null, 
    "title": "Learn Lightroom and Photoshop: Improve Food Photography", 
    "price": "30.00", 
    "instructors": "Sebastian Jezierski", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/491066_b7a9_5.jpg", 
    "course_url": "https://www.udemy.com/food-photography-use-photoshop-lightroom/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-01T09:16:04Z"
}