{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><p style=\"\"><strong style=\"\">Please Note:</strong> It is strongly recommended that you use <a href=\"https://www.udemy.com/learn-professional-wedding-photography/www.google.com/chrome\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Google Chrome</a> (free download) as your browser to view and take this  course.</p>    <p style=\"\">This Professional  Wedding Photography course is aimed at beginners to wedding photography  whether a seasoned and established working photographer or a complete newcomer  to this industry.&nbsp;</p>    <p style=\"\">It was filmed during a 3 day course  in Dorset with half the lessons in the classroom and half out on location in  hotels, churches and various local areas (beach, rocks and grunge location) for  the group shots and special portraits.</p>    <p style=\"\">The videos in  this Wedding Photography Tutorial flow from classroom to location and  take you right through the process of photographing a wedding from start to  finish including:</p>    <ul style=\"\">   <li style=\"\">Preparation</li>   <li style=\"\">The bride getting ready</li>   <li style=\"\">The ceremony</li>   <li style=\"\">The reception</li>   <li style=\"\">Group shots</li>   <li style=\"\">Couple portraits</li>   <li style=\"\">Video</li>   <li style=\"\">Business</li>   <li style=\"\">Album creation</li>   <li style=\"\">Slideshow software and creation</li>   <li style=\"\">Equipment</li>   <li style=\"\">Camera and flash settings</li>   <li style=\"\">65 high definition videos</li>   <li style=\"\">4 Interviews with industry professionals</li>   <li style=\"\"><strong style=\"\">5 Bonus eBooks</strong></li>   <li style=\"\">...everything!</li>  </ul>    <p style=\"\">There are also Lightroom and  Photoshop tutorials taken from the screen recordings woven into the course at  various and helpful intervals.</p>    <p style=\"\">The bonus eBooks cover the course in  more detail, plus the business side of things, they also teach you how to <strong style=\"\">earn  money from stock and property photography</strong> in your spare time and even cover  your health!</p>    <p style=\"\">The overall cost of taking this  course <em style=\"\">off-line</em> and buying the eBooks separately is over <strong style=\"\">£600 ($950)</strong></p>    <p style=\"\">If you are looking to make some  extra money in your spare time by shooting weddings, property and/or stock  photography, this Wedding Photography Tutorial  is for you.</p>    <p style=\"\">If you are looking to start a full  time wedding photography business, this course is a must! It will save you  hours of research time and bags of money spent on offline courses.</p>    <p style=\"\"><strong style=\"\">This is a one stop shop for learning  how to make money from Professional Wedding  Photography!</strong></p>  <p style=\"\"><strong style=\"\">Testimonials</strong></p>    <p style=\"\">&quot;<em style=\"\">Firstly, I loved the first  set of DVD&#039;s, which is why I was keen to get the updated set, but I have to  tell you that the new series has taken your work to a whole new level. I am  finding the information so incredibly valuable and am even thinking of finally  upgrading my Canon 550D to a 5D MkIII - I am so inspired to capture better  quality shots! - But most importantly, feel confident that my knowledge base  has grown enough to empower me to make an informed decision on this pricey  purchase. </em></p>    <p style=\"\"><em style=\"\">Secondly, how very generous of you  to allow access to your new online venture! I haven&#039;t worked my way through all  of the DVD&#039;s yet, but have started and am enjoying the format</em>.&quot; </p>    <p style=\"\"><strong style=\"\">Cynthia Herdman-Grant</strong></p>  <p style=\"\"><em style=\"\">&quot;All going well here. Had a  productive first wedding season with 12 weddings all in all and quite a few  booked for next year. It&#039;s been a very enjoyable learning curve and something I  wouldn&#039;t have been able to start on without your excellent course!&quot;</em></p>    <p style=\"\"><strong style=\"\">Clive Nolan - Original Course Attendee</strong></p>    <p style=\"\"><em style=\"\">&quot;Let me congratulate you for  the wonderful work you have done to help people like my brother (Noob  Photographer) and me (Noob Videographer). We are trying to start our wedding  video and photography business here in Australia. Your DVD set was really  intuitive and helpful. I must say the investment I made was the best I have  ever made. THANK YOU.&quot; </em></p>    <p style=\"\"><strong style=\"\">Anonymous - Australia</strong></p>    <p style=\"\"><em style=\"\">&quot;Just wanted to say thanks. I  got the DVD course at the end of last year in preparation for a friend&#039;s  wedding. I gave them the photos last week and they are absolutely thrilled.  Definitely could not have done it without your help. The basic camera setting  you recommend in the DVD was worth the price on its own. I didn&#039;t get a single  badly exposed shot &quot; </em></p>    <p style=\"\"><strong style=\"\">Lee Brookes, UK</strong></p>    <p style=\"\"><em style=\"\">&quot;Hi</em></p>    <p style=\"\"><em style=\"\">I have recently retired as a  business services manager with a major company in Crawley West Sussex and  decided to get my qualifications as a professional photographer as I have been  a very keen amateur photographer for well over 40 years I&#039;m also pleased to say  that I have now just completed a photographic course with the Institute of  Professional Photography and was awarded a diploma with merit. </em></p>    <p style=\"\"><em style=\"\">I just completed my first wedding in  Yorkshire, England is using your settings and advice from your wedding  photography tips course... </em></p>    <p style=\"\"><em style=\"\">The good news is I received a telephone call from the bridegroom&#039;s  mother crying with happiness at how pleased she was with my photographs which  gave me a massive confidence boost. I appreciate that most of the good results  were down to my hard work however, the settings you give in your course worked  a treat and I would recommend your video course to anybody who is thinking  about doing wedding photography, whether for one wedding for a friend or family  member or if they are intending to start up their own wedding photography business.  Can&#039;t thank you enough for the confidence your advice has given me in my new  venture as a wedding photographer.&quot; </em><strong style=\"\"><br style=\"\">  Alan Turner Dip Pro. Phto (Inst P. Photo)</strong></p>    <p style=\"\"><em style=\"\">&quot;Nick, Thank you very much. I  purchased your wedding course last year. Last Saturday, I did my first wedding.  I used a lot of your tips and everything went better than planned. Thank you,  your DVD&#039;s gave me the confidence I needed to do the job. The photos turned out  better than I could of expected. Now all I can think of is, Roll on wedding  number two, three,...... etc. etc.&quot; </em>&nbsp;<strong style=\"\">Mick Lumley, IRELAND</strong></p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Learn Professional Wedding Photography", 
    "price": "50.00", 
    "instructors": "Nick Stubbs", 
    "commitment": "24 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32424_6336_10.jpg", 
    "course_url": "https://www.udemy.com/learn-professional-wedding-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-12T16:11:57Z"
}