{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>LATEST: Course Update - November 2015</p><p>  \t      Do you know that great looking photos can dramatically make a difference in what the perceived value is of the item you are photographing? Yes, it’s true. Several years ago I started helping my wife build her eBay business while creating the photos of jewelry and small products that she was selling. Over and over again I saw her sell her items on eBay for many times more than what she paid for them. Her items sometimes would sell for 35 or 50 times more than what she paid. Sometimes even more than that.  </p>  <p>  \t      What’s the difference between the items? Nothing, except the photos that she showed were beautiful. They were lit and composed beautifully, had interesting backgrounds and overall, had the look that you might see in the photographs displayed at high end jewelers and department stores. As the result, this gave them a much higher perceived value and her customers were willing to pay more for these items.  </p>  <p>  \t      You are probably wondering, what’s the big deal? What makes these photos look so great? Can anyone learn to take photos like these? Yes, I absolutely believe anyone can? Here’s why:  </p>  <p>  \t      I have been a professional photographer for many years. Our studio specialized in portrait &amp; wedding photography and we were quite busy. When she asked me to help her take her photos of jewelry and small products she started selling, I started doing so in a simple, easy and quick way since I didn’t have too much time to spend on her photos, I was quite busy taking my own photos and running the studio.  </p>  <p>  \t      What started as a simple and quick photo session of her items, has evolved through the years. I was able to fine tune the lighting, the set-up and overall way we photographed her items. Our method has remained simple, quick, easy to learn, and consistent. We step into our small studio room we have designated for taking these photos, turn on the lights, and begin the photography.  </p>  <p>  \t      If you would like to learn how you can take photos of the small products or jewelry you are selling, consider enrolling in this course. Instead of photographing your items on a carpet or bed spread with bad lighting. Say NO to bad photos and start making more money. Whether you are selling your own products on your own website or small products on eBay, I truly believe this course can help you.  </p>  <p>  \t      Here’s what’s covered:  </p>  <p>  \t      1. Course Introduction  </p>  <p>  \t      2. iPod / iPhone / Smart Phone  </p>  <p>  \t      3. Point &amp; Shoot Camera  </p>  <p>  \t      4. DSLR &amp; Lens of choice  </p>  <p>  \t      5. Window Light  </p>  <p>  \t      6. Fluorescent Lighting  </p>  <p>  \t      7. Studio Flash in Soft Box &amp; Kicker Lights  </p>  <p>  \t      8. Electronic Flash &amp; Umbrella  </p>  <p>  \t      9. LED Lighting  </p>  <p>  \t      10. Lighting Accessories  </p>  <p>  \t      11. The Magic of Backgrounds  </p>  <p>  \t      12. Table &amp; Background  </p>  <p>  \t      13. Props for Jewelry  </p>  <p>  \t      14. Tripod, Brackets &amp; Accessories  </p>  <p>  \t      15. Focusing Secrets - Let Me Make It Perfectly Clear  </p>  <p>  \t      16. Photographing Pearls Using Softbox Lighting  </p>  <p>  \t      17. Photographing Pearls Using Fluorescent Umbrella Lighting  </p>  <p>  \t      18. Photographing Pearls Using Window light  </p>  <p>  \t      19. Photographing Pearls Using LED Lighting  </p>  <p>  \t      20. Photographing Pearls Using Electronic Flash Umbrella Lighting  </p>  <p>  \t      21. Pearls Photoshoot In Review  </p>  <p>  \t      22. Starfish Bracelet Photoshoot  </p>  <p>  \t      23. Earrings Photoshoot  </p>  <p>  \t      24. Keychain &amp; Charms Photoshoot  </p>  <p>  \t      25. Hummel Figurines Photoshoot  </p>  <p>  \t      26. Pins &amp; Brooches Photoshoot  </p>  <p>  \t      27. Adding Composition To Your Photoshoots  </p>  <p>  \t      28. Creating Background Blur  </p>  <p>  \t      29. Creating Rustic Brushes &amp; Star Effects  </p>  <p>  \t      30. Creating Moon Brush Effects  </p>  <p>  \t      31. Creating Heart Brush Effects  </p>  <p>  \t      32. In Conclusion  </p><p>Special Bonuses and more....</p>  <p>  \t      It really doesn’t take any more time taking outstanding and professional looking photos. I even show you several lighting methods and techniques you can use. Some of them cost very little and some of them are free.  </p>  <p>  \t      There’s even a pretty good chance that you may already own a camera that is more than adequate and has the potential to produce these amazing photos. The only thing that may be missing is the knowledge you need to start taking more professional looking photos by using the methods I show you, step by step, in this course. Enroll today, say NO to bad photos and start making more money.  </p>", 
    "end_date": null, 
    "title": "Mastering Small Product & Jewelry Photography", 
    "price": "25.00", 
    "instructors": "Photofonz Media", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418368_86ed_3.jpg", 
    "course_url": "https://www.udemy.com/mastering-small-product-jewelry-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T15:21:18Z"
}