{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t<strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"I have never seen such a detailed and comprehensive set of lessons in all my online experiences and I have been taking courses since 2005…….Don't look any further!\" -Fran S.</em></strong>  </p>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"Hey Charlie, So far the course is great. Great content and clear information.\" - Sean</em></strong></p>\n\n\n\n<p>  \t  The market for skilled architecture photographers is huge. Business is booming again in commercial and residential construction. Home builders, property managers, construction companies, hospitals, retirement communities, hotels, manufacturing facilities, magazines, and real estate ventures all have a use for architecture photography. Architecture is one of the most challenging subjects to compose and light. There are ambient light issues, color balance issues, and lighting issues.  </p>\n\n\n\n<p>  \t  For the photographer skilled at shooting quality photographs, there is plenty of business shooting homes, real estate, and commercial properties for architects, builders, developers, and real estate agents. Whoever you shoot for, it is all architecture photography in one form or another yet each property will have a unique set of challenges that will dictate your photographic approach.  </p>\n\n\n\n<p>  \t  If you wish to shoot architecture photography, then this online course is created just for you!  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">This Course is </strong>geared to <strong class=\"redactor-inline-converted\">intermediate through professional </strong>photographers.  </p>\n\n\n\n<ul>  \t<li>You'll receive a broad overview of:</li>  \t<li>Photographic lighting</li>  \t<li>Learn how to light room interiors</li>  \t<li>Compose a strong composition.</li>  \t<li>You will also learn how to see light quality</li>  \t<li>How to manage highlights and shadows</li>  \t<li>How to choose the right lighting accessory for the scene</li>  \t<li>Why use an umbrella over a light box</li>  \t<li>and manage the color of various ambient light sources  \t  __________________________________________________________</li>  </ul>\n\n\n\n<p>  \t  Join award-winning commercial photographer Charlie Borland as he shares his knowledge in a step-by-step approach to photographing architectural properties.  </p>\n\n\n\n<p>  \t  You will learn how to light an interior without the scene looking lit, how to manage lighting color balance, how to make the inside balance perfectly with the outside, how to find a storytelling angle, how to deal with poor light, how to fix bad color, how to work fast to be more profitable, and a whole lot more  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">You will learn how to light when there is no place to put your lights.</strong><em class=\"redactor-inline-converted\"> And</em>, we'll show you the latest methods in using Photoshop to enhance and composite your images.  \t  ________________________________________________________________  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">What's covered:</strong>  </p>\n\n\n\n<ul>  \t<li>The difference between real estate photography and architectural photography</li>  \t<li>How to see light and shadow.</li>  \t<li>The different qualities of light, color balance, and color correction.</li>  \t<li>The best equipment and how it works.</li>  \t<li>HDR for architecture photography</li>  \t<li>Which light best applies to your subject.</li>  \t<li>Lighting color management: How to mix strobe with ambient light.</li>  \t<li>Lighting in offices, manufacturing plants, and home environments.</li>  \t<li>The disappearing lights technique.</li>  \t<li>How to light with strobes and how to light with flash.</li>  \t<li>and how to use Photoshop to create photos you can't do in a single capture</li><li>12 hours of video and pdf's</li>  </ul>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">What will you learn?</strong>  </p>\n\n\n\n<p>  \t  There are many ways to shoot architecture photography and the method you choose will be based on how your images will be used. Are they for a realtor, a home builder, commercial developer, or maybe and architect? Depending on who you are shooting for will depend on how you approach the photography and this course covers many methods that can be applied to each type of client.  </p>\n\n\n\n<ul>  \t<li>You will learn how to shoot without supplemental light.</li>  \t<li>How to process a basic digital file quickly.</li>  \t<li>How to shoot for HDR.</li>  \t<li>How to process for HDR.</li>  \t<li>How to light a room with strobes.</li>  \t<li>How to deal with reflections.</li>  \t<li>How to replace lights, lamps, and windows.</li>  \t<li>How to fix distortion.</li>  \t<li>How to fix bad color.</li>  \t<li>How to light a room with flash.</li>  \t<li>How to shoot for Photoshop.</li>  \t<li>How to use the hide-a-light technique.</li>  \t<li>And many in-depth Photoshop techniques for beautiful architecture photography.</li>  </ul>\n\n\n\n<p>  \t  You will learn techniques that allow you to work quickly for low budget assignments and how to create beautiful architecture photography for high end clients as well.  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Course requirements:</strong>  </p>\n\n\n\n<p>  \t  Photoshop is used widely in the course and while you do not need to be an expert, some familiarity (primarily Layer Masking techniques} will make it easier for you. But if you are not that familiar with Photoshop, don't worry, we have some introductory Photoshop videos that will guide you along the way.  </p>\n\n\n\n<p>  \t  You will need a digital camera with a wide angle lens. For full frame sensor cameras a lens around 16-35 is perfect and if you have a cropped APS sensor camera then a wide angle lens around 10-20 will work as well. If you don't have lenses in that range but do have a wide angle lens then use it for the course and learn what you need for later purchase. You need a good tripod and a cable release or wireless device to trigger your camera. I also recommend wireless triggers to fire the strobe/flashes.  </p>\n\n\n\n<p>  \t  This course covers lighting extensively and includes several techniques. You will learn how to shoot architecture without lights, with strobes and umbrellas, also with a flash unit.  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">What they are saying:</strong>  </p>\n\n\n\n<p>  \t<em><strong>\"Hi Charlie.</strong></em></p>\n\n<p><em><strong>Thanks a million, your course was/is absolutely awesome and I've learnt a lot. The best is I've already started applying the knowledge gained and it made a big difference in the way that I take photos as well as in the post processing stages.<br></strong></em><em><strong>I would recommend this course to everybody doing architectural and real estate photography. I'll definitely work through this course again and again, in order to learn as much as I can.<br></strong></em><em><strong>Thanks again!<br></strong></em><em><strong>Kind regards and have a great day.\"<br></strong></em><em><strong>Henk</strong></em></p><p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"I have never seen such a detailed and comprehensive set of lessons in all my online experiences and I have been taking courses since 2005. The detail and explicit directions are just what the newbie needs. I have not engaged in architectural photography before and so this was a added bonus for me. I have previously taken courses with Charlie, and he is my ace when it comes to flash, but now also when I wish to learn more about photographing buildings and homes. Don't look any further!\" -Fran S.</em></strong>  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">This course was the second tutorial that I purchased on architectural photography. The other course was by a photography blog and had \"some\" great information but it just wasn't the same as this course. The advantage of this course is Charlie's methodical pace and detailed instruction coupled with Udemy's convenient interface. I have watched this course on my desktop, phone, tablet, in a waiting room, in bed, in my shed, in my car, and all of the devices have tracked my progress flawlessly. On my other course all I received was the video footage, 2 files to edit and a rudimentary table of contents with time markers for topics covered. They didn't even put in chapter markers for me! The videos had to be loaded on each device I owned and I had to write down the minute markers where I left off to continue watching later. (Very frustrating and that course was over $100) If you're a busy professional and want a course that is ready whenever and wherever you are, this is great! Lastly, the deal I got on the course was ridiculous for such valuable content.<br>-Milton V.</em></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Dear Mr Borland,</em></strong>  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Your \"Mastering Architecture and Real Estate Photography\" course really helped me dramatically improve my real estate photography and bring it to a higher level.  I am currently working as a realtor in Athens Greece and looking at the photos of properties we have in the internet was really disappointing. Three months ago I decided to do something about it and I had a discussion with the owner of the Real Estate Agency and proposed to him to let me photograph at least the most expensive properties. Although I convinced him that I could do it and although I own a DSLR camera and have an experience with photography, I was feeling insecure about the quality of my photos. Therefore, I decided to search the internet for relevant courses and articles that might help me improve my RE photography and this is how I saw your course offered through Udemy. I immediately bought it and today I am so glad I did. It is very comprehensive and analytical, with a step-by-step guide of all the techniques you need to use in order to have a great result. It basically covers every aspect of Architecture and Real Estate Photography from the exterior to all the interior spaces and from a day to a dusk photo shoot of a property. The course has helped me a lot also with all the post processing techniques that it offers, which are again explained in a very comprehensive way. Going through all the lessons and applying all the techniques I learned through the course, with just the basic gear of a camera, wide angle lens and a tripod, gave me the confidence I was missing before purchasing the course. I have already done a few photo shoots for the company and every day I am being asked to shoot more and more properties. Thank you for helping me realize my dream, Katerina.</em></strong>  </p>", 
    "end_date": null, 
    "title": "Mastering Architecture and Real Estate Photography", 
    "price": "50.00", 
    "instructors": "Charlie Borland", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/142490_7eb7_5.jpg", 
    "course_url": "https://www.udemy.com/mastering-architecture-and-real-estate-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-06T01:55:27Z"
}