{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Course Updated on December 2015:</strong></p><p><strong>Enroll on this Course right now</strong>. You can be making more money next week that you are doing today.</p><p>__________________________________________</p><p>***** <strong>Top 50 Udemy Authors in the Business Finance Industry</strong> - <em>eSkillsToday Award</em> *****</p><p>***** <strong>Ricardo is one of the best Instructors and my favorite when we are talking about Passive Income and Business Development. Hands down.</strong> - <em>Mike Robinson</em> *****</p><p>__________________________________________</p><p><strong>Who is this course for and why you should take it (in 1 minute):</strong></p><p>Hello and welcome to the Course, where I’ll take you through the entire process of shooting and selling all your photos online, from scratch.  My name is Ricardo Ribeiro and I’m an awarding winning Instructor in the Business Finance Industry, with more than 15 years experience, owner of several successful businesses, with thousands of dollars made on Passive Income, and an enthusiast of Personal &amp; Business Development. </p><p>This certified course is for you that seeks to improve your overall photography skills and sell all your work effortlessly. Throughout the course we will cover techniques used by professional photographers throughout the world, and walk you through a step-by-step process for creating quality photographs on your own, with your camera or cell phone, that you will successfully sell on the major online agencies in the world, and… I’ll even include a few “secrets of the pros.”</p><p>--------</p><p>This is probably the most enjoyable source of passive income you will ever come across. The big boom for photography is now, <strong>there has never been a higher demand for photographs as today</strong><strong>.</strong></p><p>After finishing this Certified Course, <strong>you will master photography and your life in this area will change forever. There is a before and after you taking this course.</strong> You will start noticing every details around you, looking for new perspectives, being conscious about lighting and photo composition. You will master photography like a pro.</p><p>What you will do is take the best pictures you possible can applying the techniques covered in this course, upload them to the agencies websites covered in the course and start building your portfolio and selling your photos, <strong>getting paid month after month for years to come</strong> by each one of them, and that means great income to you.</p><p>In case you are wondering, there is no need for expensive investments, you use what you already have. <strong>You can use any digital camera</strong><strong>, iPhone, iPad or Android phone</strong> or even if you have one, a DSLR.</p><p>Businesses spend millions marketing they're products or services and most of all they want to be original and buy new material, and that's where you come in. <strong>They are desperate for new photos, because there is a high demand for them</strong>, imagine the millions of companies around the world wanting new photos every day to fill they're needs.</p><p>In this <strong>Certified Course</strong><strong> </strong>I will reveal to you, using a simple step-by-step method, all the inside secrets to master photography and becoming a Pro in this field, making really good money from your photographs. <strong>This can be your part-time or full-time job</strong>.</p><p>You will learn what photos to take, the best Pro techniques, all the aspects of a photo composition, and all the process on selling them online, building your portfolio and collect the money for years to come. You will also have valuable resources like guides and books for a deeper knowledge on some specific parts of the photography world.</p><p>Don't worry if you have no experience in photography, you will learn exactly what photographs to take and how to take them and in the meanwhile y<strong>ou can start by selling the best photos you already have. </strong></p><p>You will be submitting your photos to several agencies, <strong>you don't need to worry about messing invoices or deal with customers</strong>, they will get all this for you and the only thing you will do is count the money they send you every month to your account.</p><p><strong>If you are wondering if this is possible, my answer to you is YES, it is as you will see if you take this course.</strong><strong> You will learn from someone that already achieved this goal with great success.</strong></p><p>I'm here to help you. I'm available to answer all your questions and advice you along the way. Together we can make sure you have great success. <strong>I'm with you on this!</strong></p><p>Thanks for your interest in this course. I put my hearth and soul on everything I do so you have my personal guarantee that you will absolutely love it as the happy students already enrolled, or <strong>you have 30 days money back guaranteed with no questions asked</strong>, so… you have nothing to lose. </p><p>I hope you’re as excited as I am!  If you’re ready to learn more and sign up for the course, <strong>go ahead and hit that Enroll button</strong>, or take a test drive by using the Free Preview feature. See you in the course!</p><strong></strong>", 
    "end_date": null, 
    "title": "Master Photography: From Shooting to Selling All Your Photos", 
    "price": "20.00", 
    "instructors": "Income Mastering Ricardo Ribeiro", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501318_5b5f_5.jpg", 
    "course_url": "https://www.udemy.com/master-photography-sell-your-photos/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-13T19:54:22Z"
}