{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<h5>You love photography.<br style=\"\"></h5>    <p>Other people love your photography too.</p><p>You would love some <strong style=\"\">extra money</strong>  in your bank account.</p><p>Other people would <strong style=\"\">love to pay  you</strong> for to take great pictures of them.</p><p>Whoa.</p><p><strong style=\"\">\"That sounds  nice and all - but</strong><strong style=\"\"> how to start a  photography business</strong><strong style=\"\">?\"</strong></p><p>One of the great things about a photography business is <strong style=\"\">you don't have to invest thousands of  dollars or risk your secure day-job to try it out,</strong><strong style=\"\"> you just need to have a photography business plan.</strong></p><p>You just need some information to help you <strong style=\"\">overcome your fears</strong>, <strong style=\"\">minimize  your risks</strong> and get answers to some of your questions.</p><p>This course provides you with the <strong style=\"\">knowledge,  motivation, and direction on </strong><strong style=\"\">how to start a  photography business</strong>- landing your first paying gig.</p><p>In this course I will show you:</p><p>●   The <strong style=\"\">equipment</strong>  you need to get started</p><p>●   The best place to find your <strong style=\"\">first client</strong></p><p>●   How to <strong style=\"\">negotiate</strong>  and write up your first contract</p><p>●   <strong style=\"\">How much you should  charge</strong> for your first gig</p><p>●   How to <strong style=\"\">rock</strong>  your first photo shoot</p><p>●   The magic formula for turning your first client into a <strong style=\"\">RAVING FAN</strong> (and why that's so  important)</p><p>●   What you need to think about during the shoot and after  when you edit the images</p><p>●   The best way to hand the product (image files and prints)  to the client</p><p>●   How to <strong style=\"\">reinvest</strong>  your first $100 back into your business</p><p>●   What should be on your gear and software wish-list</p><p>A photography business, whether full-time or part-time is <strong style=\"\">incredibly rewarding</strong>.</p><p>Take this easy to digest course on <strong style=\"\">how to  start a photography business</strong> now, follow the instructions to land your first gig  and try it out for yourself.</p><p>If you don't at least try, you might regret it later.</p><p><strong style=\"\">SUCCESSFUL LIFE = NO  REGRETS</strong></p><p>If you've thought about making money with your camera, <strong style=\"\">there is no better time than right now to  give it a \"shot\"</strong>.</p><p><strong style=\"\">BONUS MATERIAL!</strong></p><p>                                                                                                    </p><p>Included in this course are audio recordings of interviews I did with  fellow pro photographers. Listen and be inspired by the pros that have  \"been there, done that\". </p>  ", 
    "end_date": null, 
    "title": "Photography Business: How to Land Your First Pro Gig", 
    "price": "20.00", 
    "instructors": "Ryan Oakley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22625_94fd_11.jpg", 
    "course_url": "https://www.udemy.com/your-first-100-photography-gig/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-10T23:02:04Z"
}