{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Join 2100++ students and learn how to perform product pictures retouching in Photoshop and join biggest freelance platforms!<br></strong></p>\n\n<p><strong></strong><em>Latest: Now with two bonus lectures! Learn how to change background for transparent object and how to recolor grey products!</em></p>\n\n\n\n\n\n<p>This course is designed to give you all necessary tips and tools to edit product\npictures in Adobe Photoshop. You may be completely beginner in Adobe Photoshop\n– we will discuss all tools and commands you need to know without any excessive\ninformation. If you are already familiar with Photoshop, but you are not sure\nhow to perform product editing, this course will give you all clues you need.</p>\n\n\n\n\n\n<p>You may watch the entire course step by step, or you may watch lectures in\nany order. I built this course so that you can watch lectures independently\nfrom each other, starting with those you need the most. You may quickly return\nto any lecture in case you forgot something and would like to refresh it in\nyour memory.</p>\n\n\n\n\n\n<p>After you finish this course you will be able to retouch product pictures in\nPhotoshop and start working in this area. We will discuss the most popular\nwebsites where you can offer your services as a freelancer, such as Upwork, Fiverr, Freelancer and others. </p>", 
    "end_date": null, 
    "title": "Photoshop product pictures editing and freelancing", 
    "price": "25.00", 
    "instructors": "Diana Kot", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/686880_8972_3.jpg", 
    "course_url": "https://www.udemy.com/photoshop-product-pictures-editing-and-freelancing/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T10:04:09Z"
}