{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><em><strong>&gt;&gt;Nearly 3,100 enrolled in this 5-STAR course - Updated 12/15&lt;&lt;</strong></em></p><p><em><strong>My students credit this course with helping them sell their first photographs!</strong></em></p><p>  \t<strong>Do you love to shoot photos, and you're just looking for a breakthrough tip or trick - some guidelines - so you can make PASSIVE income selling your photos online - month after month? </strong></p><p><strong></strong>  \t  \t                          I find taking great photos to be an enormous joy; getting paid for those photos by a stock photo agency makes that joy last and last! <strong>Get paid for YOUR photos! It's easier than you think! </strong></p><p><strong></strong>Frankly, there's more opportunity than ever before. But you need to follow a couple of simple rules - and avoid some common mistakes.<em>(Launched 2/15; Updated 8/7/15!)</em>  \t                          _________________________________________________________________________  </p>  <p>  \t<em><strong>Recent Five-Star Reviews!:</strong></em>  </p>  <strong>\"Amazing Course!</strong> <p>I've just completed the course, it is well explained and worth the investment. This course really provides whatever it says and I always love courses from Robert. He is a great instructor.\"</p><p>\"<strong>Stock Photo Ninja!</strong></p><p><strong></strong>Mr. Scot's course is direct and perfectly informative, taught with passion and a knack for getting to the crux of the subject matter.                             As a life-long point-and-shoot photographer, Mr. Scot has changed the way I shoot my pictures, and has opened my eyes to the money that can be made by turning my love for shooting into passive income. THANK YOU!\"  _________________________________________________________________________</p><p>  \t    I take you from the inside of the camera to the inside of the stock photo agency business.  </p>  <p>  \t    After a section on the ingenious mechanics of the camera, this course concentrates on how to sell those high-quality photos you've taken.  </p>  <p>  \t<strong>In this course, I teach you how to turn your love of photography into long-term, passive income.</strong>  </p>    <p>  \t<strong></strong><strong>Today is the day to start;</strong> there's NEVER been a more profitable or more accessible time to sell your photos to stock photography agencies.  </p>  <p>  \t                                                    When I started shooting stock photography with my Canon AE1, back in the 1980s, getting your photos sold through stock photo agencies required an extraordinary and expensive effort - from shooting to developing the photos to finding the agencies to getting approved.  </p>  <p>  \t                                                                           The process has become much simpler these days - but the competition is fierce.  </p>  <p>  \t                                                                           By sticking to the basics - and establishing a work-flow that ensures that you're creating the highest quality images in the appropriate format - you can quickly move to the head of the line - and<strong> start selling your photos right away.  </strong>  </p>  <p>  \t                                                                       _________________________________________________________________________  </p>  <p>  \t                                                                       I shoot with a Nikon D800 - a truly remarkable photographic tool - but these days, there are high-quality smart phones that have what it takes to capture world-class images.  </p>  <p>  \t                                                                     It's NOT about the camera! The key to making money in the stock photo business is your creativity, and attention to detail.  </p>  <p>  \t<em><strong>This course is designed to save you money and time </strong></em>- by discussing specifically what the top stock photo agencies expect - AND what they reject  </p>  <p>  \t                                                                   I discuss which categories are hot, and which are not.  </p>  <p>  \t                                                                   And, I list not only my favorite stock photo agencies to work with (and who are willing to work with YOU), but I've included a downloadable, clickable .pdf list of links to more than two dozen agencies to whom YOU should be submitting.  </p>  <p>  \t                                                          Now, let me be clear, this is NO get-rich-quick scheme. You'll need to commit yourself to a substantial amount of effort and detailed diligence. But, follow my plan step by step, and you will have your photos uploaded and optimized, and selling in no time.  </p>", 
    "end_date": null, 
    "title": "Photography - These Companies Want to Buy Your Photos!", 
    "price": "20.00", 
    "instructors": "Robert Scot", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408566_6eb7_5.jpg", 
    "course_url": "https://www.udemy.com/stock-photo-ninja-where-to-sell-your-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T00:39:01Z"
}