{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">WHY YOU WANT TO TAKE THIS COURSE:</strong>  </p>  <p style=\"\">  \t                There’s a rumor going around the wedding and portrait photography industry that “prints are dead.”  Yet, every single one of our clients continues to buy large canvases and albums from us, even in this digital day and age.  </p>  <p style=\"\">  \t                As creative people, product sales as a photographer can be a hard thing to overcome with a lot of fears and uncertainties involved, and because of it, a lot of photography businesses are failing to thrive and survive. Before we switched our business model over to sell print products, we felt a lot of those same fears about selling:  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">Would it work? </em></li>  \t<li style=\"\"><em style=\"\">Would people still hire us if we didn’t include the digital negatives? </em></li>  \t<li style=\"\"><em style=\"\">Can we make this happen successfully when we hate selling? </em></li>  \t<li style=\"\"><em style=\"\">Will this work even though we don’t have a studio space? </em></li>  \t<li style=\"\"><em style=\"\">Will this actually increase our sales and profits?</em></li>  </ul>  <p style=\"\">  \t<strong style=\"\">We found that the answer to all of the above was a resounding YES!</strong>  </p>  <p style=\"\">  \t                When we made the change in our business model to stop giving away the rights to our digital negatives and now offer our clients the opportunity to purchase prints through personally hosted Order Appointments, we took our print sales from $0 to an average of $3,000 and more in EXTRA sales per photoshoot and wedding.  We found that by simply giving our clients the opportunity to purchase prints from us as the experts they hired to document their memories, that they actually willingly wanted to buy prints, a lot of prints, through us, rather than trying to take time they didn’t have to figure it out themselves!  We couldn’t believe we were missing out on this important part of serving our clients to fulfill their needs.  </p>  <p style=\"\">  \t                In our online e-course, Shoot 2 Sale, you too can learn how to create an awesome experience for your clients to help them get your artwork on their walls, as well as increase the sales and profits of your photography business in dramatic ways!  We’ve developed a program that lays out everything you need to begin selling product successfully in your own photography business. No matter what level of client you cater to, we found this proven step-by-step formula works to encourage and educate clients of all budgets to value the importance of why they should invest in print products through you instead of only getting the digital files.  The best part is, you don’t have to be a natural sales person because through the experience we will walk you through to carry out, the images will sell themselves. And when your clients begin to thank you and cry tears of joy for helping them get their cherished memories on their walls, you’ll only be kicking yourself wondering why you waited so long to make this change!  </p>  <p style=\"\">  \t           Now is the time to take your customer service and business profits to the next level!  </p>  <p style=\"\">  \t <strong style=\"\">MESSAGE FROM INSTRUCTORS:</strong>  </p>  <p style=\"\">  \t     We are here to review questions daily!  We will respond to all questions once a day. We will communicate with all students through course messaging with content related updates. We encourage all students to introduce yourself, where you are from, what type of photography you shoot, and your goals for what you want to get out of the course. We plan for this course to become an active community of photographers that will be encouraging the growth of your businesses and print sales.  We look forward to getting to know you and we are here to help!  </p>", 
    "end_date": null, 
    "title": "Shoot 2 Sale", 
    "price": "20.00", 
    "instructors": "Scarlett &amp; Stephen", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/147498_d250_3.jpg", 
    "course_url": "https://www.udemy.com/shoot2sale/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-15T21:59:09Z"
}