{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t<strong style=\"\">  MASTER SPORT PORTRAIT IMAGES IN PHOTOSHOP - SPORT / ACTION  </strong>  </p>  <ul style=\"\">  \t<li>Brand New Retouching Course <em style=\"\">&quot;Just launched 10th October 2014&quot;</em></li>  \t<li>Over 9+ Retouching lessons<em style=\"\"> &quot;Become a master at Sport Portraits&quot;</em></li>  \t<li><em style=\"\">All Lessons include step by step in video instructions!</em></li>  \t<li>Includes all raw &amp; psd files which you can profit from - <em style=\"\">Instantly!</em></li>  \t<li>No Prior Photoshop skills or knowledge needed &quot;Guaranteed&quot;</li>  \t<li>Full &amp; free lifetime access to the complete course</li>  \t<li>All future &amp; additional lectures will always be <em style=\"\">&quot;for free&quot;</em></li>  </ul>  <hr style=\"\">  <p>  \t<strong style=\"\">  ARE YOU NEW OR STRUGGLING WITH SPORT / ACTION TECHNIQUES?  </strong>  </p>  <ul style=\"\">  \t<li>AND MASSIVELY WANT TO IMPROVE IT?</li>  \t<li>AND DO IT EASILY AND INSTANTLY?</li>  \t<li>AND BE ABLE TO APPLY IT TO YOUR OWN IMAGES?</li>  </ul>  <p>  \t<strong style=\"\">  --------------------------- ” <em style=\"\">Then this course is for you </em>” -------------------------------  </strong>  </p>  <p>  \t      What This Course Entails:  </p>  <p>  \t      I will teach you how to get into advanced retouching, so don’t worry if you don’t have prior experience with compositing or other skills. Follow my lead and I’ll teach you to be good at it! <em style=\"\">“I Promise You”</em>  </p>  <p>  \t      All my retouching instructions form part of a comprehensive guide that can help you to accomplish your goals by applying these techniques. During all the lessons you get to eavesdrop as I work, giving you all insight as to how I work and what I do.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\"><em style=\"\">The idea is to teach you how to light and shoot sport portraits. After that we dive into all retouching methods in order to bring more wow out of a sport portrait. </em><em style=\"\">Be it for your own work, or for a client. </em><em style=\"\">My aim is to teach you all the tricks, techniques &amp; secrets to overcome this task!</em></strong>  </p>  <hr style=\"\">  <p>  \t      Whether you have previous experience with photoshop or not, it doesn&#039;t matter. Apply your knowledge for an hour a day and you could be making huge improvements or even extra cash, <em style=\"\">as a retoucher just like me</em>.  </p>  <p>  \t<em style=\"\"><strong style=\"\">&quot;And I&#039;m not kidding when I say that you need no previous photoshop experience! &quot;You just need to Practice your eye and the techniques&quot;</strong></em>  </p>  <p>  \t      All future extra lectures and upgrades are always included for free. Unconditional Udemy 30 day money-back guarantee - that&#039;s my <em style=\"\">personal promise of your success!</em>  </p>  <p>  \t      You&#039;ll learn  </p>  <ol style=\"\">  \t<li>How tocreate epic sport portraits &quot;Guaranteed&quot;</li>  \t<li>How to photograph sport portraits with flash light</li>  \t<li>How to setup up a flash light, for sport portrait images</li>  \t<li>How to work with camera raw and raw conversions</li>  \t<li>How use the dodge &amp; burn method for enhancing an image even more</li>  \t<li>How to create amazing color grades and warm filter effects in photoshop</li>  \t<li>How to create color effects with gradient techniques</li>  \t<li>How to place and image better in order to achieve a better composition</li>  \t<li>How to work with photoshop cleanup tools and masks</li>  \t<li>How to enhance the image more with simple dodge &amp; burn techniques</li>  \t<li>How to get more wow out of your images with advanced adjustment layer techniques</li>  </ol>  <p>  \t      ... and much, much more!  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">  Intrigued yet? Then keep reading!  </strong>  </p>  <p>  \t      As with all my courses: the initial low price will increase shortly. This one is currently $30 and it will next upgrade to $45 so join in now! &quot;<em style=\"\">You will have unlimited lifetime access at no extra cost&quot; </em>Not just that; all future additional lectures, bonuses, etc in this course are always free.  </p>  <p>  \t      There&#039;s an unconditional, no-questions-asked full 30-day money-back guarantee! I&#039;m known for always offering support on Udemy, so feel free to shout out if you&#039;re stuck or need assistance. <em style=\"\">&quot;I&#039;m here to help&quot;</em>  </p>  <p>  \t<strong style=\"\">  One final note:  </strong>  </p>  <p>  \t      My goal is to teach you how to easy recreate such an sport portrait, so don&#039;t stress about not having done photoshop retouching work before. <em style=\"\">&quot;I do my best to make it simple, informative &amp; fun&quot;</em>  </p>  <p>  \t      After going through this course you&#039;ll be able to apply your new retouching skills to <em style=\"\">retouch any complex action images and make some extra cash along the way</em>.  </p>  <p>  \t      All you have to do is click on the <strong style=\"\">&quot;take this course&quot;</strong> button on the top right corner. You have nothing to lose. In fact, you&#039;ve got a lot to gain.  </p>  <p>  \t      Thank you,  </p>  <p>  \t      Manni  </p>", 
    "end_date": null, 
    "title": "Sport Portrait - Learn All Hidden Photoshop Techniques Today", 
    "price": "20.00", 
    "instructors": "Manfred  Werner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308244_d779_2.jpg", 
    "course_url": "https://www.udemy.com/skateractiontwo/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-26T09:54:04Z"
}