{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>コースの紹介</strong></p><p>Webやスマホなどでよく目にするGoogleストリートビューのように、全周を見ることができる「360°VRパノラマ」のコンテンツを製作できるようになるためのコースです。製作に必要な基礎知識を身につけ、機材のセッティング・撮影・ステッチ・オーサリングとビデオの講義と同じように作業していくことで、最終的には自分一人で360°VRパノラマを製作できるようになり、業務にもつながる可能性が出てきます。</p><p><strong>撮影機材</strong></p><p>まずは360°VRパノラマ製作に必要な機材（撮影機材・アプリケーション）について学びます。360°VRパノラマを製作するには一般的な撮影では使わないような特殊な機材やアプリケーションが必要になります。</p><p>このコースではNikonD5200・Sigma10mmフィッシュアイレンズ・パノラマ雲台 Nodal Ninja・ステッチソフト PTGuiPro・オーサリングソフト Panotour Proなどを使用します。</p><p><strong>撮影機材のセッティング</strong></p><p>必要な機材を理解したら次はセッティングです。特に360°VRパノラマ専用の雲台はセッティングをしっかり行わないと撮影ができません。少し面倒ですが完成度の高い360°VRパノラマの素材を撮影できるようにしっかりとセッティングを行いましょう。</p><p><strong>撮影</strong></p><p>いよいよ撮影です。撮影でミスをしてしまうとその後の作業が進みませんので、失敗や撮り忘れ箇所などがないように確認しながら慎重に精度の高い撮影を行いましょう。</p><p><strong>ステッチ</strong></p><p>撮影さえしっかりと行っていればステッチはさほど難しい作業ではありません。完成のイメージをしながら作業を行うと良いでしょう。またここで三脚を消す作業が入ります。三脚を消すことで完全な360°VRパノラマになり、初めて見た人はきっと驚くことでしょう。</p><p><strong>オーサリング</strong></p><p>オーサリングはステッチで作成した平面画像をPCなどで立体的に見えるようにする作業です。表現方法（表示方法）を決めて書き出すだけですのであまり難しいことはありませんが、完成した360°VRパノラマがPC上で見えると達成感が得られます。</p><p><strong>最後に</strong></p><p>360°VRパノラマは撮影する環境（状況）によって撮影時の注意点が異なったり、使用するアプリケーションも非常に様々な機能がありますが、このコースではそのようなケースごとの違いなどを盛り込むと非常に複雑で分かりづらい内容になるので、最もシンプルで一般的な360°VRパノラマの製作方法を解説しています。</p><p>撮影・ステッチ・オーサリングは他にも様々な方法がありますが、最も基本的な方法で360°VRパノラマをたくさん作っていくことで経験値が上がり「ここはこういうやり方もあるのではないか？」「こうやった方が作業効率が良い」「このアプリケーションにはこんな機能もあったんだ」「この表示方法の方が好み」など自分なりの製作方法が確立されてくるものです。私自身もそうでしたが、始めのうちは失敗することも多くもあるかと思います。それでも失敗を繰り返しながらたくさん作成していくうちにコツを覚えてきて、知らないうちに作業が簡単に思えるようになってきますので、ぜひ根気よくたくさん経験を積んでください。</p><p><br></p>", 
    "end_date": null, 
    "title": "必ずできる！360°VRパノラマの製作", 
    "price": "20.00", 
    "instructors": "及川 均", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564232_52eb.jpg", 
    "course_url": "https://www.udemy.com/360vr-dc/", 
    "currency": "USD", 
    "subject_name": [
        "Commercial Photography"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-25T06:19:58Z"
}