{"selfpaced": false, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                    \n                    Supply chains, especially global supply chains, are complex structures that involve several businesses crossing multiple time zones and continents. The design of a supply chain is critical to its overall success, and ultimately, the firm’s success. This business and management course will cover all aspects of supply chain design.\n\nWe will start with learning how to design for the flow of physical products or goods. Variously referred to as Network Design, Facility Location, or Flow Optimization, the physical design is a core requirement for any supply chain planner.\n\nFollowing this, we will dive into the design of the financial flows involved with supply chains. Specifically, you will learn how to translate supply chain terms and metrics into financial terms used in the C-suite.\n\nWe will then proceed into the design and management of the information flow of a supply chain by examining three critical phases: procurement, production, and demand planning. Our primary objective here is to understand how a business works with different partners in these three basic supply chain activities.\n\nThe procurement lessons will cover basic approaches as well as more advanced techniques such as combinatorial auctions and supply contracts. The production lessons will concentrate on material resource planning (MRP) and fixed horizon planning. The demand management lessons will examine collaboration as well as sales and operations planning (S&amp;OP). After covering the design of the three flows (physical, financial, and information), we will turn to the design of the supply chain organization itself as well as the metrics. Real cases and examples from practice will be used throughout the entire course.\n\nThis course is part of the MITx MicroMasters Credential in Supply Chain Management that is specifically designed to teach the critical skills needed to be successful in this exciting field. In order to qualify for the MicroMasters Credential you will need to earn a Verified Certificate in each of the five courses as well as pass a Capstone Exam. When you sign up for a CTL.SC2x Verified Certificate you will also be granted access to supplemental content such as additional practice problems and complementary videos. \n\nMITx requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. MITx will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the MITx course; revocation of any certificates received for the MITx course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations.\n\n                                    ", "end_date": "2016-08-10T00:00:00Z", "title": "CTL.SC2x: Supply Chain Design", "price": 0, "instructors": "Jarrod Goentzel, James Blayney Rice Jr., Yossi Sheffi and Chris Caplice", "institution_name": ["Massachusetts Institute of Technology"], "commitment": "8-10 hours", "subject_name": ["Business & Management"], "course_url": "https://www.edx.org/course/supply-chain-design-mitx-ctl-sc2x", "duration": "12 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-05-18T00:00:00Z"}