{"selfpaced": false, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                    \n                    Start-ups are designed to grow quickly, but successful start-ups grow smart. This course is designed to provide you with an understanding of the essential elements of successful scaling, including an overview of demand generation, customer acquisition, adoption, diffusion and forecasting demand. You’ll also learn how to market effectively using best practices of digital marketing, social media, PR, SEO, and pricing. Finally, you’ll cover the nuts and bolts of building a sales process, partnerships and supply relationships, and examine the crucial components of attracting, developing and retaining talent. By the end of this course, you’ll have an outline of an expansion strategy for your idea or enterprise, and also be ready for Entrepreneurship 4: Financing and Profitability\n\n                                            Syllabus\n                        Module 1: Acquiring Customers and Forecasting DemandThis first module focuses on strategies to acquire customers and understand product demand when a start-up is in growth mode.  You’ll learn foundational economic concepts in customer acquisition, including customer value over time, customer lifetime value and ROI, and customer equity.  You’ll also learn about the key theory of “two-sided markets” and explore how entrepreneurs can build these markets through pricing and subsidization.  Even the most exciting and useful new products and services face challenges in convincing people to adopt them, and so you'll explore actionable research and examples that explain the rate of diffusion, the adoption of new products, and ways to attack the challenge of forecasting demand.  By the end of this module, you’ll have a solid grounding in the core concerns of start-ups as they move from launch to growth.   Module 2: Marketing and PRIn this module, you'll explore the strategies modern start-ups use to get the word out about new products and services.  You'll learn the three primary modes of digital marketing (owned, paid, and earned), and when and how these media options can be utilized by a start-up. You'll also learn how to harness the powers of social media, search engine optimization (SEO), “sponsored” search engine results, display ads and social ads. Finally, you'll understand how to leverage free media and assess the pros and cons of engaging PR firms.  By the end of this module, you'll be able to develop digital marketing and pr strategies for your enterprise. Module 3: Cost Structures, Pricing, and TrackingThis module was designed to give you a strong foundation in the economics around growing a start-up, including how to understand and implement cost targets, pricing strategies, and outcome measurement.  You’ll learn the math behind creating cost targets and margin requirements (whether your product or service will be sold via retailers or some other channel), the principles that guide pricing of products and services, and how to implement the “four Cs” of pricing while measuring price sensitivity. You'll also explore how to identify key performance indicators (KPIs) to determine whether your business is thriving or failing, how to efficiently grow a customer base through sales partnerships, and how to decide whether to make your own products/components or purchase them from a third party.  By the end of this module, you will possess the foundational economic knowledge that informs the cost, price, sales, and production strategies used by successful entrepreneurs today.Module 4: Creating and Scaling Company CultureThis module explores the best approaches for attracting and retaining talent, creating a company culture that is conducive to growth, and how company founders and early employees can learn to delegate authority and manage the people-based growing pains that many start-ups experience. You'll learn how to scale up strategically, and how to you decide whether to expand to different segments once you establish a foothold in your target segment. You'll also examine the differences between vertical expansion and horizontal expansion, and learn how to decide which path to pursue.  By the end of this module, you’ll be equipped to make the tough decisions required to manage a start-up’s personnel roster and strategic direction as your business grows.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Entrepreneurship 3: Growth Strategies", "price": 0, "instructors": "Michael J. Lenox and Jared Harris", "institution_name": ["University of Virginia"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/growth-strategy", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}