{"selfpaced": true, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                    \n                    Learn about diverse and integrated markets for primary energy, and the essential considerations driving business leaders and policy makers in development of global energy resources.\n\n                                            Syllabus\n                        Demand for EnergyEnergy is the capacity to do work.  In this most essential sense, energy is a basic human need.  We will consider how technological innovations have increased the ability of mankind to do work, but only by increasing our demand for various sources of energy.  We will examine the determinants of demand for primary energy resources as well as the distribution of demand around the globe.Energy Supplies and Market AllocationsA broad range of primary resources are used to satisfy our need for energy.  Accessing these resources depends on many factors, including available technologies and skills, and a number of political factors.  We will address these factors as well as issues and trends in energy supply.Key Capabilities for Energy Business - Fossil FuelsA range of technological and commercial factors determine accessibility and utilization of conventional energy resources.  These lectures review considerations essential to the development of various fossil fuel sources of energy, including coal, oil, gas, and shale gas.Key Capabilities for Energy Business - Alternative ResourcesA range of technological and commercial factors determine accessibility and utilization of unconventional energy resources. These lectures review considerations essential to the development of alternative sources of energy, including nuclear and various renewable resources.Stakeholders and Political Considerations in the Energy BusinessEnergy enterprises engage in complex activities with far-reaching consequences.  As a result, these activities often motivate to action a diverse set of stakeholders.  We will examine the systemic nature of energy businesses and how their activities inevitably necessitate political engagement.Strategic Analysis of Energy Business OpportunitiesFrameworks for strategic analysis are useful for organizing the broad set of considerations necessary to achieve energy business objectives.  These lectures introduce several rudimentary tools for strategic analysis and make use of those tools to evaluate the economic, commercial, and political environment of energy.\n                                    ", "end_date": "2016-08-01T00:00:00Z", "title": "Fundamentals of Global Energy Business", "price": 0, "instructors": "Michael Orlando", "institution_name": ["University of Colorado System"], "commitment": "6-8 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/energy-business", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}