{"selfpaced": false, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                    \n                    En este curso, conocerás la importancia de la estrategia en cualquier tipo de organización; diferenciarás los modelos conductuales que se aplican en diferentes países, quiénes son sus principales actores y los intereses que tienen en una empresa. Partirás de la planeación estratégica para materializar tu idea de negocio, a través de la misión, visión, valores y objetivos. Identificarás la idea diferenciadora de tu empresa o idea de negocio, lo cual la hará única del resto. Leerás las señales internas y externas del entorno para poder reaccionar a tiempo ante los factores que afectan a tu empresa.\n\n                                            Syllabus\n                        Gobierno CorporativoEn este módulo, desarrollarás el concepto de gobierno corporativo y comprenderás la importancia que hoy en día tiene para el comportamiento de las corporaciones. \n\nAnalizarás los pilares que sostienen este nuevo sistema como la responsabilidad corporativa, social y ambiental y el dominio del negocio. Se presentan los modelos conductuales shareholder y stakeholder, los elementos que integran estos sistemas, así como características, objetivos y sus alcances. \n\nPor lo que, al finalizar este módulo, identificarás los dos principales modelos de gobierno corporativo, con la finalidad de que enlistes los principales stakeholders de tu organización.\nPlaneación EstratégicaAbordaremos conceptos básicos para la planeación estratégica de una organización: misión, visión, objetivos y valores. Se define y ejemplifica el modelo de planeación japonés “Hoshin Kanri” y se explica su relación con otros modelos de planeación estratégica. Se mencionan tres diferentes ejemplos reales de planeación estratégica y su alineación entre misión, visión y valores. Por tanto, al finalizar el módulo enunciarás la misión, visión y valores de tu empresa o idea de negocio.Estrategia CorporativaEn este módulo, conocerás algunas herramientas que te permitirán analizar el entorno en el que una organización se desenvuelve, las cuales son: la matriz FODA, (Fortalezas, Oportunidades, Debilidades y Amenazas); el análisis de las cinco fuerzas de Porter; el análisis político, económico, social y tecnológico, como herramienta que orienta e identifica los factores del ambiente externo que pueden alterar el comportamiento de una organización. \n\nAl finalizar el módulo, analizarás los factores internos y externos que influyen en el desenvolvimiento de una empresa, así como la influencia del ambiente político, económico, social y tecnológico en la organización.\nOrganizaciónEn el módulo, revisarás los tipos de estructura organizacional más recurrentes. Se presenta el organigrama y su importancia en las empresas, las diferentes clasificaciones y su aplicación como herramienta para identificar qué áreas son fundamentales y qué rol juega para la asignación de funciones. Se explica la función que desempeña la descripción de puestos como herramienta administrativa. Al finalizar el módulo, crearás la estructura funcional de tu empresa o idea de negocio a partir de definir el tipo de organización.Business Start-UpEn este módulo, producirás un documento que será la base para identificar la planeación estratégica y la estructura organizacional de tu empresa o idea de negocio.\n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "Introducción a la Estrategia", "price": 0, "instructors": "Norman Wolf", "institution_name": ["Universidad Nacional Autónoma de México"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/introduccionalaestrategia", "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}