{"selfpaced": false, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/sdt\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/sdt-003/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    sdt-001\n                                                                    sdt-002\n                                                                    sdt-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    The purpose of this course is to help individuals and organizations\nsurvive when confronted with disruptive technologies that threaten their\ncurrent way of life.  We will look at a\ngeneral model of survival and use it to analyze companies and industries that\nhave failed or are close to failing.  Examples\nof companies that have not survived include Kodak, a firm over 100 years old,\nBlockbuster and Borders.   It is likely\nthat each of us has done business with all of these firms, and today Kodak and\nBlockbuster are in bankruptcy and Borders has been liquidated.  Disruptions are impacting industries like\neducation; Coursera and others offering these massive open online courses are a\nchallenge for Universities.  In addition\nto firms that have failed, we will look at some that have survived and are\ndoing well.  What are their strategies\nfor survival?\n\nBy highlighting the reasons for the decline of firms and\nindustries, participants can begin to understand how to keep the same thing\nfrom happening to them.   Through the\nstudy of successful organizations, we will try to tease out approaches to\ndisruptions that actually work.  Our\nultimate objective is to develop a strategy for survival in a world confronting\none disruptive technology after another.\n\n                                            Syllabus\n                        1. Survival: a simple model of the incumbent’s\ndilemma of how to respond to a potentially disruptive technology .2. Kodak misses its moment: the story of Kodak and\nhow, after inventing the digital camera, it failed to understand how it and the\nInternet changed the process of capturing and sharing images.3. Blockbuster vs Netflix.  How could a leading company fail to respond\nto a clearly defined threat from a new competitor?4. Borders: \nwas the company asleep when Amazon came along and disrupted book sales,\npublishing and reading?5. The three amigos: what can we learn from Kodak,\nBorders and Blockbuster as a group of failed companies?6. Can I borrow your paper?   How the Internet has savaged one of our\noldest types of media leading to the slow death of newspapers.7. Books and Publishers:  trying to maintain two business models at\nonce.8. Education: the industry that moves at a glacial\npace faces radical innovation from non-profits to Coursera.9. Dictators: probably not a promising occupation\ngiven social media-how the Arab spring changed a profession.10. Risky business-are innovations in technology\nencouraging us to engage in too much risky business?11. Moving things: will the USPS disappear?  How can it compete with UPS and FedEx?12. Some survivors: \na few have managed to incorporate disruptive technologies into their\nlives and to flourish, at least for now.13.  Danger ahead: what new disruptions are on the\nhorizon and who will be disrupted?14. Strategies for survival: suggestions on  how to deal with disruptive technologies and\nturn them into a successful innovation\n                                    ", "end_date": "2014-11-17T00:00:00Z", "title": "Surviving Disruptive Technologies", "price": 0, "instructors": "Professor Hank Lucas", "institution_name": ["University of Maryland, College Park"], "commitment": "2-4 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/course/sdt", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-09-29T00:00:00Z"}