{"selfpaced": false, "topic_name": ["Strategic Management"], "description": "\n\n                    \n                    \n                    This course provides a more in-depth look at the roles and responsibilities of boards of directors in the governance of nonprofit organizations. While the course has been developed with North American culture in mind, we do appreciate that in other parts of the world, the nature of the roles and responsibilities of boards of directors may not be the same. Nevertheless,it is our hope that much of the course content will still be of value to those in other parts of the world. \n\nTo learn more about this course, please watch the overview video by copying and pasting the following link into your web browser: https://goo.gl/SXZEZS.\n\nKeywords: Nonprofit; Nonprofit Sector; Voluntary Sector; Nonprofit Organizations, Non-Governmental Organizations, Volunteer Organizations, Leadership, Management, Governance, Board, Board of Directors, Performance, Effectiveness\n\nCourse 2 Overview: \n\nWeek 1: Some of the questions to be explored this week are: What is the board's role in planning for the organization's future and why is it important for nonprofit organizations to do it? What is strategic planning and what can boards do to carry this out effectively? \n\nWeek 2: This week's questions: What is the board's role in assessing the performance of the organization? Why is performance assessment important? Why do many boards have difficulty meeting their performance assessment responsibilities? \n\nWeek 3: This week's questions: What are the elements of the fundraising/resource development process? What is the board's role in ensuring the organization has adequate funding? What information should be in a resource development plan? \n\nWeek 4: At this stage, you are asked to review the course content, submit a written assignment (known lightheartedly as a BEAR (Board Effectiveness Readiness Assessment), and take two multiple choice Readiness Assurance Tests (known similarly as RATs). One RAT will assess knowledge and reading comprehension and the other will test application of knowledge within a practical case.  \n\nWeek 5: We will encourage you to discuss the RATs in the discussion forums and take them again should you wish to change any of your answers based on the information exchanged.\n\n                                            Syllabus\n                        The Board's Role in PlanningHello and welcome to Course 2 in the series of three courses on developing leadership and improving governance in nonprofit organizations. The goal of week 1 is to address several important questions related to one of the most important board responsibilities--planning: What is Strategic, What is Strategic Planning, and What is Strategic Governance? These elements form the basis of this week's  overview and content in Chapter 3 of the main course text Improving the Effectiveness of Boards of Directors and readings in recommended course texts.The Board's Role in Performance AssessmentHello and welcome to Week 2 of the second course on Leadership and Governance of Nonprofit Organizations! The focus this week is on the vitally important partner of planning--Performance Assessment. Some of the key questions we will explore this week are: What is performance assessment and why is it important? What is the board's role in performance assessment? Why do boards have difficulty meeting their performance assessment responsibilities? And, what frameworks exist to help boards measure and manage performance? The Board's Role in Fundraising and Resource DevelopmentHello and welcome to Week 3! The goal this week is to address important questions related to the board's role and responsibilities in fundraising or, as we will refer to it, resource development. Some of the key questions we will explore this week are:  What is the board’s role in resource development and why do boards have difficulty meeting their responsibilities in this area?  What information should be included in a resource development plan and how can boards improve their effectiveness in carrying out resource development responsibilities?Concept Testing and ApplicationHello and welcome to Week 4! The goal of this week is to assess course learning. The end of Course 2 assessment of learning begins with the requirement that you to take two Readiness Assurance Tests (RATs) and submit your first Board Effectiveness Assessment Reflection (BEAR).  During the testing process, don't forget to bring a piece of paper and pen to make a note of your answers to the RAT and RAT Application Exercise questions. You will need them to vote and discuss your responses in the RAT forums next week.  Assessment of Learning: BEAR Peer Review and RAT Discussion ForumsHello, and Welcome to Week 5! The goal of this week is to discuss and complete the end of Course 2 assessment of learning. It begins with peer discussion of the individual Readiness Assurance Test (RAT) and RAT Application Exercise (case) you took last week plus peer review of the three BEAR assignments you have been assigned to evaluate this week.  It concludes with re-taking the RAT and RAT Application Exercise Tests and returning the three BEAR assignments you peer-reviewed last week. \n                                    ", "end_date": "2016-07-20T00:00:00Z", "title": "The Roles and Responsibilities of Nonprofit Boards of Directors within the Governance Process", "price": 0, "instructors": "Vic Murray and Prof. Yvonne D. Harrison, PhD", "institution_name": ["State University of New York"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/nonprofit-gov-2", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-15T00:00:00Z"}