{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><strong>Don't enroll just for the course but enroll for what you'll be after taking this course.</strong> There is a reason why this course is LITERALLY the following:</strong></p>\n\n<p><strong>New content updated Regularly. <br></strong></p>\n\n\n\n<p><strong><strong>Learn with a community of 5000+ Students.</strong></strong></p>\n\n\n\n<p><strong></strong></p>\n\n<p><strong></strong></p><strong></strong><strong>Comes with</strong><strong> Lifetime access and 30 day money back guarantee!</strong>\n\n\n\n\n\n<p>-------------------------------------------------------------------------------------------------------------  \t      </p>\n\n\n\n\n\n<p>Cloud Computing is one of the most sought after skill and powerful technologies of today.   \t      Whether you are an Experienced programmer or new to computers and is looking to learn complete Salesforce step by step at your own pace then this course is for you. <br></p>\n\n\n\n\n\n<p>This course contains step by step Instruction  for both the Salesforce Certified Administrator exam and the Force . com Certified Platform App Builder exam and advanced programming as well,  covering all topics like App, Objects, Profiles, Security, Workflows, Visualforce page, Apex Controllers, Triggers etc. </p>\n\n\n\n<p>There is no such comprehensive course covering both Admin and Development available online till date.<br></p>\n\n\n\n<p>Even If you are looking to become only Admin or a Developer , It is good to have extra knowledge to succeed. A Functional consultant coming from Admin background can only suggest good solution to client if he/she has knowledge of programming as well, at least what is possible through code and what is not. Similarly a Salesforce developer is incomplete without Admin knowledge as Apex is a platform dependent language and one cannot become a proficient salesforce developer unless he/she knows the platform well. </p>\n\n\n\n<p>No matter which Background you come from, this course makes you an indispensable resource by learning this very powerful technology based on the most sought after skill today - Cloud Computing.</p>\n\n\n\n<p>SFDC has huge demand for skilled professionals with extraordinary pay structure. Course includes effective tutorials with clear explanation. This course is updated regularly as per latest release of Salesforce and also contains examples to help you get certified. </p>\n\n\n\n<p> <strong>Once you register, you will have LIFETIME ACCESS to this course. No limits!  </strong></p>", 
    "end_date": null, 
    "title": "Learn Complete Salesforce Step by Step from Scratch", 
    "price": "50.00", 
    "instructors": "Prateek Singh", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286954_31c0_4.jpg", 
    "course_url": "https://www.udemy.com/salesforce-training/", 
    "currency": "USD", 
    "subject_name": [
        "Salesforce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-24T13:39:20Z"
}