{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>The purpose of this course is to enable students of all levels to <strong>Master Salesforce Reports, Dashboards </strong>and <strong>List Views</strong> within a <strong class=\"redactor-inline-converted\">very short time</strong>.</p>\n\n\n\n<p><br></p><p>Reports are one of the most crucial of objects and functions in Salesforce.  Administrators and end-users both utilise this function on a daily basis.This course will allow you to delve into the core concepts that you need to know ins and outs of Reports.  You will learn the practical steps to creating, modifying and utilising Reports.</p>\n\n\n\n<p><br></p><p>Dashboards are one of the most crucial of objects and functions in Salesforce.  Administrators and end-users both utilise this function on a daily basis.This course will allow you to delve into the core concepts that you need to know ins and outs of Dashboards.  You will learn the practical steps to creating, modifying and utilising Dashboards.<br></p><p><br></p><p>This course will allow you to delve into the core concepts that you need to know ins and outs of List Views.  You will learn the practical steps to creating, modifying and utilising List Views.<br></p><p><br></p><p>After taking this course, you will know how to create, modify, delete and manage all 3, learning the pros and cons of each in a very short time frame.</p>\n\n\n\n<p><br></p><p>There's a quiz at the end to test your knowledge.You can download my course and watch it at your own leisure.  </p>\n\n\n\n<p><br></p><p>Have the peace of mind of being taught by a <strong class=\"redactor-inline-converted\">Certified Salesforce Instructor</strong>.</p>", 
    "end_date": null, 
    "title": "Master Salesforce Reports, Dashboards and List Views", 
    "price": "20.00", 
    "instructors": "Salesforce Instructor Mos Chowdhury", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/875214_c6a9_5.jpg", 
    "course_url": "https://www.udemy.com/salesforce-reports-dashboards-list-views-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Salesforce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-11T11:19:05Z"
}