{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p> Do you want to take your career to the next level? <strong>GET SALESFORCE CERTIFIED </strong>and start making $80,000+ a year! </p><p><em>STUDY FROM OVER <strong>500 </strong>REAL SALESFORCE CERTIFICATION EXAM QUESTIONS/ANSWERS IN THIS COURSE!!!</em><br><strong></strong></p><p><strong>JOIN THE 1200+ CLIENTS I HAVE CONSULTED ON SALESFORCE AND HELPED 100% OF THEM PASS THE SALESFORCE ADM 201 CERTIFICATION EXAM!</strong> </p><p> Three reasons to TAKE THIS COURSE right now! </p> <ol><li>You get <strong>lifetime access</strong> to lectures, including new lectures every month (<strong>content is added constantly</strong> as updates to Salesforce roll out 3x per year).</li><li>You can <strong>ask me questions</strong> and <strong>see me respond</strong> to every single one of them thoughtfully!</li><li>What you will learn in this course is original, tested, and very detailed! You will learn how to operate the Salesforce application with ease. You will learn how to manage users, data, and security in Salesforce. We also share strategies on how to maintain and customize Sales Cloud and Service Cloud applications. You will be able to build reports, dashboards, and workflow within the Salesforce app!</li></ol><p>In this course, you will master everything you need to know about the <strong>Salesforce Administrator Certification </strong> from beginner level to advanced!</p><p>You will be able to create new users with varying permissions and access to Salesforce data. Customize the Salesforce application to reflect your businesses needs. You will know how to import and export data from Salesforce AND how to automate data entry, lead generation and case creation within Salesforce! Create dashboards and various analytic reports with ease! Join this course now to learn how to improve the overall sharing and collaboration within your company with the power of Salesforce!</p><p><strong>TAKE A STEP IN THE RIGHT DIRECTION WITH YOUR LIFE AND LEARN HOW TO GET CERTIFIED IN SALESFORCE, TAKE YOUR CAREER TO THE NEXT LEVEL, AND EARN WAY MORE MONEY! ENROLL NOW!</strong></p>", 
    "end_date": null, 
    "title": "Salesforce Certification - Get Salesforce Jobs", 
    "price": "20.00", 
    "instructors": "Coursenvy Online", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573988_855f_2.jpg", 
    "course_url": "https://www.udemy.com/salesforce-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Salesforce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T22:13:31Z"
}