{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>In this training series you will learn how to configure Salesforce to\n fulfill business needs, in preparation for well paying employment. This\nsecond course in the series will provide you with a strong foundation in\n how security works in the system. You will be able to design a security system that meets the needs of a given company, then implement that design and test it for proper functioning. You will make sure that users can only do what they should be able to do in the Salesforce system.</p>\n\n<p>Aspiratech is a <strong>registered Salesforce consulting and ISV partner</strong>,\n and as such we design and implement the system for companies large and \nsmall, including non-profits. We are leading experts in the field, which\n you can see by simply Googling \"Salesforce Training.\"</p>\n\n\n\n\n\n\n\n<p>As part of every Salesforce implementation, we train both users and at least one internal System Administrator (Sys Admin). </p>\n\n\n\n\n\n<p>This training series has effectively trained hundreds of new Sys Admins to take on <strong>real world duties</strong> upon\n which their companies depend, and has helped many attain certification \nby providing a strong foundation upon which they could build.  </p>\n\n\n\n\n\n\n\n<ul><li>Using step by step instruction, clearly demonstrated and explained, <strong>including the “gotchas\"</strong> that\n send the unsuspecting in circles, this course will teach you how to \ncustomize Salesforce to meet the job requirements of a System \nAdministrator.</li><li>Practical hands-on exercises are included to make sure you <strong>know how to apply what you see</strong> to real world examples.</li><li>This course provides the training you need for the only type of true job security there is, the <strong>security</strong> of genuinely being the best at what you do.</li></ul>\n\n\n\n\n\n\n\n<p>You should plan on working on this series an hour a day for 3-4 weeks\n to effectively cover all the material. Going through the series a \nsecond time, simply watching the videos on the second pass, is also \nadvised. Frequent exposure is key during the training period.</p>\n\n\n\n\n\n\n\n<p>This training series will help prepare you for the <strong>System Administrator </strong>certification\n track, unlike other Salesforce courses that purport to be \"complete,\" \nbut which in fact focus on the Developer track and leave out a large \nportion of what is needed for a Sys Admin. Developer is a track that \nwill not lead to either Sys Admin positions or highly paid consulting \npositions, and is only appropriate for those who intend to go on to \nbecome apex coders. This course is intended for people who never want to\n have to configure an API or deal with writing code syntax.</p>\n\n\n\n\n\n\n\n<p>That said, there is no substitute for getting the most recent \nSalesforce supplied study guide (webpage linked to within the course) to\n actually <strong>study for the exam</strong> itself, just as when you were in school you had to supplement in class learning with extra study for end of semester exams.</p>\n\n\n\n\n\n\n\n<p><strong>Here is an email we received</strong> from a student about using this training to get her Sys Admin certification:</p>\n\n\n\n\n\n\n\n<p><em>\"I wanted to let you know that I successfully passed my admin 201\n certification. I am looking forward to write my 401 exam as well... I \nknow that certification will help me in securing a job. I highly \nrecommended your course to my friends. Only because of your course and \nwatching it several times and practice it several times, I was able to \ngrasp knowledge. Thank you very much. Best, Padma\"</em></p>\n\n\n\n\n\n\n\n<p><strong>Starting salaries</strong> for employed consultants in the \nindustry are typically $40-60/hr, depending on your region, and \nindependent consultants who sign their own clients often make several \ntimes those amounts. If you have had an interest in expanding your \ncareer options by adding a practical technology proficiency to your \nskill set, Salesforce System Administration is where many <strong>non-technical people find their opportunity</strong>.\n For those who have no interest in embarking upon a technology \nspecialist career path, the SFDC Sys Admin skill set is also greatly in \ndemand and in short supply in many non-technical positions and will make\n you an indispensable part of any work team.</p>\n\n\n\n\n\n\n\n<p><strong>Note:</strong> It is expected that you will have access to an\n instance of SFDC you can experiment and practice in within this course.\n Salesforce provides a free Developer org at:</p>\n\n\n\n\n\n\n\n<p>Developer dot salesforce dot com/signup</p>\n\n\n\n\n\n\n\n<p>(Udemy no longer allows us to make this a live link, so unfortunately\n you're going to have to do some manual work to get to the right page on\n the Salesforce site to get this from them... is also posted within the \nsecond lecture in this course)</p>\n\n\n\n\n\n\n\n<p>-- Note that you should use a personal email address as your username\n when signing up for a developer edition account, so that your work \nemail address will remain available for your company instance username.</p>\n\n\n\n\n\n\n\n<p>If your company does not have Salesforce yet, but is considering \nimplementing it, get a free 30-day Trial org on the Salesforce website. \nYou will then have the added benefit that work you do toward genuine \ngoals during this course can be preserved for use by your company \n(unlike work saved in a developer org), possibly encouraging your \nemployer to allow you to work on the course during your regular work day\n or even purchase the training series for you.</p>", 
    "end_date": null, 
    "title": "Salesforce Sys Admin Training: Security - Design & Configure", 
    "price": "40.00", 
    "instructors": "Aspiratech Training", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/837812_6704.jpg", 
    "course_url": "https://www.udemy.com/salesforce-sys-admin-training-security-design-configure/", 
    "currency": "USD", 
    "subject_name": [
        "Salesforce"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-02T18:56:54Z"
}