{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to my course about <strong>Tapping into New Employees' Greatest Assets</strong>! </p><p><em>First and foremost, thank you for your support. I have a drive for fostering partnerships and fairness in business. In a solution-oriented society, I believe that treating people like humans instead of task-oriented robots is what it's all about. If we resist the urge to rush to solutions, we will uncover incredible innovation along the way. </em></p><p><em>I've had an exciting 14 year career in professional services during which I've seen a variety of different business practices. Some of them were best practices that I put in my toolbox to continue using and teaching, and some of them were, well, let's be nice and say “Un-Best\" practices. These are the pitfalls that I enjoy helping others avoid. If I can save someone the pain that I've already been through, that brings me a great sense of fulfillment.</em></p><p><strong>Have you ever been in an organization where you felt lost despite being a tenured experienced professional with many accomplishments?</strong></p><p><strong>Have you ever longed to create a much better learning environment for new employees than you were given and save them all the pain and confusion you went through?</strong></p><p>Of course you have! Most of us have experienced these things. What if I were to tell you that I have the blueprint you can use to alleviate all these issues and be totally responsible for all the accolades that come with revolutionizing how your company does Onboarding, Mentoring, and Coaching? Would that be of interest to you?</p><p>This course will reveal to you the business model I recently developed to <strong><em>totally transform</em></strong> the way we help new employees become impactful in my organization. </p><p>Each of my 13 strategies includes information about why it should be important to you followed by specific ways to effectively put it into action. I've provided you with a full suite of tools to make your life easy, including video lectures, PowerPoint notes, and quizzes to test your understanding of each strategy.</p><p> Thank you again for your faith in the information I love to share. I hope you enjoy participating in this course as much as I enjoyed creating it.</p>", 
    "end_date": null, 
    "title": "13 Easy Steps to Transform New Hire to Superstar Contributor", 
    "price": "50.00", 
    "instructors": "John A. Russo", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426426_72aa_5.jpg", 
    "course_url": "https://www.udemy.com/tapping-into-new-employees-greatest-assets/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T23:17:07Z"
}