{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Accelerate Your Career  is designed for you to truly understand who you are, what you bring to the table, what the value of that is and how to use it in your career.</p>\n\n<p>As the course progresses we will get deeper into how you brand and position yourself in the job and career market, what employers are looking for and how to get their attention and ways to ensure you<strong> find a stable, secure career future</strong> that will look after you and your family for years to come.</p>\n\n<p><strong class=\"redactor-inline-converted\">Discover the importance of your own personal brand.</strong></p>\n\n<p>Your own personal brand is not just a hairstyle or an accent. It is everything you do in your personal and professional life. Without brand identity you are bland, unfocused and certainly from a professional standpoint, you pretty much look the same as everyone else. So how do we change that?<br></p>\n\n<p>The course covers:<br></p>\n\n<ul><li><strong class=\"redactor-inline-converted\">Who are you and what makes you passionate? </strong></li><li>Finding the core value within yourself will get you on track to building your own USP. </li><li><strong class=\"redactor-inline-converted\">What drives you? What makes you excited about life and your work?</strong> </li><li>Where do you spend your time and focused on what? </li><li><strong class=\"redactor-inline-converted\">If you could have ANY job in the whole world, what would it be and why?</strong></li></ul>\n\n<p>Answering these short questions will truly make you stand out. When you find a <strong class=\"redactor-inline-converted\">purpose</strong> (remember mine?) you have a goal, a target and you then start to develop your language and in turn, your identity.</p>\n\n<p>We take the background of what <strong class=\"redactor-inline-converted\">personal branding and USP</strong>’s are, and started applying it to you. We figure out what makes you passionate, we look at what others think and compare the two together, and finally, we look around to see what a total stranger might think. </p>\n\n<p>We have a concept of who the new you might be and look like. Then we talk about how you now apply that to your career!</p>", 
    "end_date": null, 
    "title": "Accelerate your Career", 
    "price": "20.00", 
    "instructors": "Scott Paton, Paul Ratcliffe", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831064_0b9a.jpg", 
    "course_url": "https://www.udemy.com/accelerate-your-career/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-25T05:42:52Z"
}