{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Business Improvement</strong></p><p>Organisational culture change management - learn how to change a culture in your organisation.</p><p><strong>Culture Change</strong></p><p>Culture change is one of the biggest challenges any business will ever face!</p><p>Getting culture right can revolutionise a business, increase creativity and profitability!</p><p><strong>Good Culture / Bad Culture</strong></p><p><strong></strong><strong></strong>A good business culture can lift your business to the top of its sector.</p><p>A bad business culture can put a business on the scrap heap!</p><p>But how do you create a good culture?</p><p>How do you remedy a bad culture?</p><p>How do you measure a culture?</p><p><strong>Course Overview</strong></p><p>In this course you will learn how identify culture change opportunities</p><p>You will learn how to tie them to higher business objectives.</p><p>And you will also learn how to implement that culture change.</p><p><strong>The ProPeC Method</strong></p><p><strong></strong>What method will we be teaching?</p><p>This course is a collaboration between Mark Timberlake and Stephen Matther.</p><p>Stephen has developed the ProPeC system of business improvement after spending many years in the business improvement sector.</p><p>It is a revolutionary, yet simple system, that will give you business improvements fast.</p><p>It is this system that we will use to help you improve your business culture.</p><p><strong>Who Is This Course For?</strong></p><p>If you answer yes to any of the following questions, then this course is for you.</p><ul><li>Are you a business owner who needs to change the culture of the business practices, the behaviour of the team to improve the profitability of the business?</li><li>Are you a manager who needs to implement culture change in your department and improve productivity and compliance to business goals and industry standards?</li><li>Are you a Human Resources Manager or HR professional that is tasked with implementing a culture change programme?</li><li>Are you a CEO or Director who needs to understand how culture change is carried out in a business or organisation?</li><li>Are you a professional manager or work in the HR industry and want to improve your employment viability?</li></ul><p><strong>Course Description</strong></p><p>Implementing and adopting positive culture change in any organisation is often a massive challenge if you don't have the right skills and tools to initiate that change, in this course we will help you gain those skills and show you tools that will help you manage culture change.</p><p>You will learn why culture management is an important part of creating successful organisational structure and integrity.</p><p>Culture change without a clear objective aligned to high level business goals, is extremely difficult to implement, so we help you to identify the reasons why you need culture change and how to match them to business objectives.</p><p>You will also learn how to identify and measure the health of a culture in an organisation by using current state analysis techniques and tools.</p><p>We will also show you how to define and create goals that can be implemented within the culture change process.</p><p>By learning how to identify key actions and plans, you will be able to create an action plan that helps ensure your culture change project gets carried out.</p><p>Planning is fine in and of itself, but in this course we will also guide you through the implementation stage and show you how to manage the change process as it is being rolled out within your organisation.</p><p>We will also show you how to implement a review process so that you can make sure your changes are achieved in the short term and maintained in the long term.</p><p><strong>Take The Course:</strong></p><p>Join Mark Timberlake and Stephen Matther on the other side and learn how to manage a culture change process in an organisation, both at the theoretical level and with a simple example based project walkthrough.</p>", 
    "end_date": null, 
    "title": "Business Management - Organisational Culture Change Training", 
    "price": "40.00", 
    "instructors": "Mark Timberlake, Stephen Mather", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579102_d4b4_5.jpg", 
    "course_url": "https://www.udemy.com/business-create-organisational-culture-change/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T14:35:19Z"
}