{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Business Management</strong></p><p>Training your people effectively can reduce costs and improve profits - learn HR management skills.</p><p><strong>Are You Wasting Money On Training?</strong></p><p>Did you know that a lot of training in a business is a waste of time and money?</p><p>That the only thing it often adds is a cost to the company ledger?</p><p>Knowing how to create training that works will help you increase profits and increase the value of the staff you have in your business.</p><p><strong>Effective Training?</strong></p><p>So how do you know if your training is going to be effective?</p><p>How do you know if it will actually help you develop your staff and deliver a result that adds value to your business?</p><p>Good training delivers tangible and measurable benefits.</p><p>Bad training just costs a business time and money.</p><p><strong>Covered In This Course:</strong></p><p>In this course you will learn how to identify and implement good training.</p><p>How to tie training to business goals.</p><p>And how to measure its effectiveness.</p><p><strong>Teaching Method:</strong></p><p>What method will you be teaching?</p><p>This course is a collaboration between myself and Stephen Matther.</p><p>Stephen has developed the ProPeC system of business improvement after spending many years in the business improvement sector.</p><p>It is a revolutionary, yet simple system, that will give you business improvements fast.</p><p>It is this system that we will use to help you improve your own training systems.</p><p><strong>Who Is This Course For?</strong></p><p>If you answer yes to any of the following questions, then this course is for you.</p><ul><li>Are you a business owner who needs to invest in training but wants to do that without wasting money?</li><li>Are you a manager who has responsibility for delivering training at the sharp end of business?</li><li>Are you a Human Resources manager or member of a HR team that implements training?</li><li>Are you a CEO or Director that wants to understand if the training in your organisation is targeted and meeting core business objectives?</li><li> Are you a manager or HR professional who wants to improve their career prospects?</li></ul><p><strong>What Will You Learn In The Course?</strong></p><p>One of the key problems with training, is that organisations often do not link training to specific business goals and it becomes something that is just bolted on as an afterthought, in this course we will help you understand why you are training your workforce.</p><p>You will learn the difference between “must have\" training, “added value\" training and “nice to have\" training.</p><p>We will also help you understand what training actually does for your business.</p><p>You will understand and learn how to run a training needs analysis and how to choose appropriate training.</p><p>Learning how to plan and prepare training is also covered in depth.</p><p>You will understand how to measure return on investment when it comes to training.</p><p>You will learn the different methods of training you can deliver through different teaching and learning styles.</p><p>You will understand how to run a training needs analysis for your organisation.</p><p>You will also understand how to create a training matrix for your training objectives.</p><p>Creating a personal development plan is also covered in this training course.</p><p>And probably most importantly of all, you will learn how to measure the effectiveness of training and judge if it is giving you value for money.</p><p><strong>Take The Course:</strong></p><p>So join me on the other side and learn how to effectively train your people so that your business can grow and improve its bottom line.</p>", 
    "end_date": null, 
    "title": "Business Management - How To Train Your People", 
    "price": "40.00", 
    "instructors": "Mark Timberlake, Stephen Mather", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573524_7b38_8.jpg", 
    "course_url": "https://www.udemy.com/business-how-to-train-your-people-human-resources/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T13:53:01Z"
}