{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>We live in a busy world. Our clients are busy! Our employers are busy! We are busy!</p><p><strong><em>The ideal course for job seekers, promotion seekers or anyone who needs a quick review to enhance their business etiquette skills for the job interview, at the office, business mixers or on the road.</em></strong></p><p><strong>With globalization in today’s economy, the job market is fierce.</strong> This makes it more important than ever to understand how your words, actions and gestures impact others in various business settings. Knowing the rules and customs that are expected is essential to getting the job, making more money and moving up the corporate ladder. </p><p><em>Do you feel frustrated that you didn’t get the job offer – even if you’re totally qualified?</em></p><p><em>Do you want to learn soft skills that enhance your professionalism?</em></p><p><em>Do you wish to advance in your career?</em></p><p><strong>This is the right place to get answers.</strong></p><p><strong>Content and Overview</strong></p><ul><li>This course is for anyone whose job requires working locally or in the international business arena. <strong></strong></li><li>I’ll walk you through business etiquette essentials, with a focus on North American and Western culture. </li><li>We will explore the dos, taboos, and how-tos of IITTI international business etiquette standards. </li><li>This course contains 26 lectures<strong>, ‘Minding Your Manners Everyday Matters’</strong> – a 37- page downloadable study guide, as well as supplemental articles and resources. Each section includes a short quiz to evaluate your progress.</li></ul><p>‘Business Etiquette for Job seekers and Promotion Seekers’ is designed for personal and professional development based on corporate seminars created by an industry leader with over 17 years’ experience. With our experience, we help job-seekers and professionals earn their place in the business world.<br></p><p><strong>Master Business Etiquette Skills Based on IITTI International Standards:</strong></p><ul>  <li>Make a great      personal introduction</li>  <li>Introduce      others professionally and appropriately </li>  <li>Network      effectively</li>  <li>Win the      respect of coworkers and clients</li>  <li>Use      technology respectfully and effectively</li>  <li>Avoid      nonverbal mistakes made through body language</li>  <li>Leverage      business etiquette soft skills in job interviews</li></ul><p><strong><br></strong></p><p><strong>Interact confidently and professionally with Western cultures, at home and in the international marketplace!</strong></p><p>Throughout history, <strong>etiquette and manners</strong> have evolved as a way of creating more civilized societies around the world. In today’s competitive business culture, there are no geographical boundaries. Making faux pas in your behavior can get in the way of your professional credibility, and influence impressions about you and your company. International business etiquette training is a key component for business success. Getting trained in business etiquette will help you prove your mettle, and the company’s significance. Your interpersonal skills will prompt the clients to see the company in a professional light.</p><p><strong>People talking about Kimberly Presentations:</strong></p><p><em>“Kimberly is a reliable professional presenter who achieves results through instruction and example. I am pleased to recommend Kimberly</em>.” ~<strong>J. McClean</strong></p><p><em>“Kimberly gave very practical advice and examples for business etiquettes</em>.\" ~ <strong>C. Tam</strong></p><p><em>“I have worked with Kimberly Law on multiple occasions and highly recommend her services. She was knowledgeable and professional. If given the opportunity, I would certainly work with her again in the future</em>.” ~ <strong>B. Alvarez</strong></p>", 
    "end_date": null, 
    "title": "Business Etiquette for Job Seekers & Promotion Seekers", 
    "price": "40.00", 
    "instructors": "Kimberly Law", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260018_ddb0_4.jpg", 
    "course_url": "https://www.udemy.com/business-etiquette-for-job-seekers-promotion-seekers/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-12T05:27:07Z"
}