{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Now, you have access to the work I do for Executive MBA programs through this class so you can craft and keep your peak income. And you are not alone in the process.  When you join today I will send you an invitation to connect via Linkedin for a free profile review.<br></p><p>If you are not getting interviews for the job you want, you will want this class.</p><p><strong>The best course I’ve ever been on.</strong> “<em>If ever there was a course that you need to go on then it is this. I am very qualified but wasn't getting the phone calls for jobs because my strategy was totally wrong...If you want to get the hits then get the course!” </em>by Keith McClean</p>  <p><strong>Concise, efficient, effective,</strong> “<em>With amazingly helpful downloadable content (just copy and paste into document)…Generates results, works for every industry and all job levels</em>.” by Kevin Massabni,</p><p>This includes cutting edge tools for how hiring is done. </p><p>A whopping 75% of my clients get calls from their online profiles for the jobs they want, not through direct applications that get sucked into the 'resume black hole.'  </p><p>And I give you my effective pre-formatted resume/CV template to write with along with 'fill-in-the-blank\" interview and salary negotiation scripts.</p><p>This is my epic course that is the A to Z strategy that I use for my 6-Figure Executive MBA clients, now available to you.<br> </p><p>You will want to take this course for these reasons.</p><p>1. You dislike your current career path and want something else.</p><p>2. You think you could be making more.</p><p>3. You do not have time for a job search and need recruiters to come to you. </p><p>4. If you are getting calls from recruiters but not for the jobs you want. </p><p>5. You need interview and salary negotiation scripts to make things easier.<br></p><p>I look forward to helping you reach your career goals.</p><p>Dr. Karen Gurney<br></p>", 
    "end_date": null, 
    "title": "Career: Complete Career Change Program", 
    "price": "20.00", 
    "instructors": "Karen Gurney", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618108_e62e_10.jpg", 
    "course_url": "https://www.udemy.com/6-figure-mba-executive-coaching/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T13:38:53Z"
}