{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is an essential guide for all people managers on how to get the most out of your staff. Whether you have a single person working for you, a small team or a large group, being able to effectively communicate, coach and provide performance feedback is a vital part of being a great manager.</p><p>Coaching is a common buzz-word used globally for everything from sports to business, but what are they key things you need to know to become an effective coach as a manager of people? We'll cover the types of coaching and ways to coach your staff as well as useful hints, tips and practical examples of coaching and how the way you speak to your staff can make a huge difference to individual, team and organisational performance.</p><p>This course is predominantly video based with lectures by Nigel Young, an experienced and qualified coach, manager and educator. The videos are a combination of presentation, animations and examples that will guide you through the coaching and interaction processes. There are also links to other material and a few document resources to help along the way.</p><p>The course itself should be able to be completed in about an hour, but by following links and putting what you learn into practise it can effectively guide you through study that could last for weeks and the benefits far longer.</p><p>The course is split into three key areas.  The first is a series of knowledge based information lectures, the second deals with the theories and practices of coaching before the final section deals with how to give and use feedback in your management to improve performance.  There are 17 short lectures that allow you to absorb the material in bite-sized chunks.</p><p>You should take this course if you're new to managing groups of people, an experienced manager who would like some new ideas or even looking to find out more about coaching and how it can help you as a managers or potential manager.</p>", 
    "end_date": null, 
    "title": "Coaching for Managers", 
    "price": "20.00", 
    "instructors": "Nigel Young", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/474404_d597.jpg", 
    "course_url": "https://www.udemy.com/coaching-for-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-12T22:28:16Z"
}