{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>UPDATE: 3/1/2016. Thousands of students have taken my recruiter trainings on Udemy to improve their cold recruiting emails and recruiting skills. See </em><em>5 star reviews below. </em></p><p>Take this recruiter training to learn how to write powerful cold emails (recruiting emails). Easily and simply. This is for recruiters by a recruiter.<br></p><p><em>“Clint, Got about a 50% return on the emails with the new method...nice.“</em></p><p><strong>No risk, money back guarantee: </strong>This recruiter training is backed by an unconditional, Udemy 30 day money-back guarantee.</p><p>I searched for a cold email for recruiters training but couldn't find one. The material and courses I found were either geared towards salespeople writing cold emails to sell things. Or seemed “outdated and corporate”. </p><p>They weren’t for a recruiter like me, who wants to learn how to write cold emails or improve my cold emails to recruit more candidates to fill jobs.</p><p>The fastest way to improve any skill is by action.</p><p><strong>I’m glad you found this recruiter training.</strong> </p><p>This is the recruiter training you have been searching for. If you spend time writing cold emails or cold LinkedIn Inmails to recruit candidates to fill jobs, <strong>this recruiter training is for you.</strong></p><p><em>Cold Email Recruiter Training: Write Powerful Cold Emails</em><em></em> is perfect for freelance or independent recruiters who run their own recruiting businesses and want to learn how to write cold email or master the skill.</p><p><strong>I’m an agency recruiter / corporate recruiter, will this recruiter training work for me?</strong></p><p>If you put the time in and do the work, this recruiter training will absolutely work for you.</p><p><strong>What if I’ve been recruiting for 5, 10, 15, or more years?</strong> </p><p>You are also a good candidate for this recruiter training. </p><p>A number of veteran recruiters came into the training with the mindset, “<em>If I learn just one new thing it’s worth it</em>”. The recruiter training <strong>EXCEEDED </strong>their expectations.</p><p>If a veteran recruiter can learn new techniques and improve their cold recruiting emails and Inmails, I know this cold email training can help you. It’s only a matter of mindset and effort.</p><p><strong>How much experience do I need to have?</strong></p><p>Ideally you have a few months or years of recruiting experience. </p><p>Why does this matter? </p><p>Because now you know how hard recruiting is. You realize writing effective recruiting cold emails can be hard... if you don’t know effective strategies and a system. </p><p>In this time you have already fallen into the<em> email template trap</em>. </p><p>Now that you are free from the trap, you want more. </p><p>You want an edge. You want to learn 1). a better way to write cold email. 2). A cold emailing system filled with strategies that work.</p><p>You are ready to invest in your skills to get more of the results you want: Access to more candidates without wasting time.</p><p><strong>This recruiter training simplifies writing effective cold recruiting emails</strong> and teaches strategies and a system to make writing easier.</p><p><strong>What types of candidates will this recruiter training help me reach?</strong></p><p>This recruiter training is best suited for recruiters who want to have conversations and build relationships with hard to reach, passive candidates. </p><p>Anyone can email a candidate that posted their resume.<strong> Every</strong> other recruiter already is. Why waste time there?</p><p><strong>About the Instructor:</strong></p><p>My experience is in hard to fill technical positions but the techniques and strategies you learn here have worked across many different industries. Including medical recruiting, technical recruiting, industrial recruiting, financial recruiting, sales recruiting, and the list goes on. (Check out my full Udemy bio below to learn more) </p><p><strong>If you are looking for recruiter training to improve your cold emails and Inmails, or learn how to write cold emails,  this is the recruiter training for you.</strong></p><ul><li>If you want an in depth look at how a high performing recruiter writes recruiting cold emails and Inmails that gets responses. This recruiter training is for you. </li></ul><ul><li>If you aren’t a “<em>details person</em>” but you want to learn a system that will help you improve the quality and results of your cold recruiting emails, this is the recruiter training for you.</li></ul><ul><li>If you don’t believe in <strong><em>old school tips &amp; tricks </em></strong>(“don’t tell the candidate the company name, so they will write you back”) you have heard about cold recruiting emails.  Try this recruiter training. </li></ul><p>We will crush many more half truths and bad cold email habits along the way :)</p><p>It sounds like you want to to learn practical techniques backed by research? If you still aren’t quite sure click the “preview this course” button to learn more. </p><p><em>Message me, I’m happy to answer any questions you have. </em></p><p><em><br></em></p><p>Or click “take this course” and let’s get started.</p><p><br></p><p>Every minute you wait is COSTING YOU: Candidates, Time, and Relationships. You don’t get a second chance at some opportunities. </p><p><em>The best recruiters realize one poorly written cold recruiting email ruins the chance to recruit an awesome candidate forever. It’s why great recruiters invest in themselves and continue to learn. </em><em><strong>That’s why they are the best</strong></em><em>.</em></p><p><em>I wish I had this recruiter training earlier in my recruiting career.</em></p><p>(Sign up for the training, and get started learning and growing your skills)</p><p><br></p><p><strong>What others are saying about the recruiter training:</strong></p><p>“I've been doing technical recruiting for over 4 years now. I have seen firsthand the difficulties of converting passive candidates to active.</p><p>I was a little hesitant to try new strategies that Clint presented. But as soon as I started using them, I noticed a 16% increase in my cold messaging response rate!</p><p>Just wanted to say thanks for the great course on cold emailing. It's helped me to recruit and hire some great candidates.\"</p>-Senior Technical Recruiter at Facebook", 
    "end_date": null, 
    "title": "Cold Email Recruiter Training: Write Powerful Cold Emails", 
    "price": "50.00", 
    "instructors": "Clinton Buelter", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469454_27a8_2.jpg", 
    "course_url": "https://www.udemy.com/get-the-edge-how-to-write-recruiting-messages/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T00:24:22Z"
}