{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Este curso contiene el análisis de un caso real en el que se pueden obtener importantes conclusiones sobre los controles a aplicar, y las evidencias a obtener, por parte de una empresa para evitar la comisión de delitos económicos por parte de sus empleados. También permite identificar las acciones a llevar a cabo para mitigar el riesgo de que la empresa o los directivos sean declarados responsables por no haber cumplido sus obligaciones de control en la prevención de este tipo de conductas.  </p>  <p style=\"\">  \t  El curso incluye:  </p>  <ol style=\"\">  \t<li style=\"\">Seis presentaciones en vídeo con una duración total de 45 minutos</li>  \t<li style=\"\">Enlaces a información adicional del caso</li>  \t<li style=\"\">Un test</li>  \t<li style=\"\">Un autodiagnóstico</li>  </ol>  <p style=\"\">  \t  Dado que esta es la primer aentrega de una serie de casos que formarán el curso Compliance 3.0, sería de gran valor para mi conocer tu opinión sobre esta prueba piloto de curso online.  </p>  <p style=\"\">  \t  En este caso se trata del análisis del caso Société Générale, y, como he dicho, está formado por seis clases en vídeo de corta duración.  </p>  <p style=\"\">  \t   Los puntos claves del curso son los siguientes:  </p>  <p style=\"\">  \t   1. Información del caso  </p>  <p style=\"\">  \t   2. Riesgos a prevenir tras el análisis de la información del caso.  </p>  <p style=\"\">  \t   3. Cargos con funciones de control que pueden mitigar estos riesgos  </p>  <p style=\"\">  \t   4. Controles aplicables para prevenir los riesgos que aparecen en el análisis del caso  </p>  <p style=\"\">  \t   5. Evidencias a obtener y conservar para estar en condiciones de demostrar que la empresa y los directivos han realizado todo el esfuerzo de control necesario para mitigar los riesgos analizados en este caso.  </p>  <p style=\"\">  \t   6. Conclusiones  </p>  <p style=\"\">  \t   7. Test  </p>  <p style=\"\">  \t   8. Autodiagnóstico  </p>  <p style=\"\">  \t   Para poder revisar el curso puedes abrir una cuenta en la plataforma Udemy y seguir las seis clases.  </p>  <p style=\"\">  \t   El curso se puede realizar también desde dispositivos móviles. Por ejemplo, hay una app de Udemy para iPad.  </p>  <p style=\"\">  \t   Puedes publicar tus comentarios y propuestas de mejora en el mismo curso, enviármelos por correo o publicarlos en el grupo Compliance 3.0 de LinkedIn.  </p>  <p style=\"\">  \t   La dirección de acceso al curso es la siguiente:  </p>  <p style=\"\">  \t   https://www.udemy.com/compliance-caso001/  </p>  <p style=\"\">  \t   Te agradezco de antemano tus aportaciones.  </p>  <p style=\"\">  \t   Xavier Ribas  </p>", 
    "end_date": null, 
    "title": "Compliance 3.0 - Caso Société Générale", 
    "price": 0, 
    "instructors": "Xavier Ribas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/156062_9d91_2.jpg", 
    "course_url": "https://www.udemy.com/compliance-caso001/", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-31T19:13:02Z"
}