{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">You can conduct job interviews with prospective employees confidently and professionally. Never be nervous or uncomfortable again when speaking to job applicants about why they might want to work for your organization.</p><p style=\"\">Conducing a job interview can be every bit as stressful as being interviewed for a job. A manager conducting a job interview with a prospective employee needs to know how to communicate the needs of the position as well as the value of the company. The interviewing manager must now how to present the company and engage in meaningful conversation with the job applicant. A job interview can be unnatural and awkward for both the interviewer and the interviewee. This course will teach managers how to prepare for interviews, how to ask the right questions, how to avoid the wrong questions and how to learn valuable insights on applicants in order to lead to better hiring decisions.</p><p style=\"\">And students of this course will learn how to be completely comfortable, confident and relaxed while conducting interviews.</p><p style=\"\">Updated July 24, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p>", 
    "end_date": null, 
    "title": "Conducting Job Interviews-Speak Effectively to Job Prospects", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322302_1979_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-conduct-a-job-interview/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-18T21:59:38Z"
}