{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><strong><em><em><strong><em><em>Over 2,800 students from 106 countries enrolled in Specialist Series classes by Katy Caselli since September, 2015! Updated in April, 2016!</em></em></strong></em></em></strong></strong><br></p>\n\n<p>How would you like to advance your skills in the classroom?  Drive high impact learning by mastering the secrets to creative training! Learn the secrets to being a credible, effective instructor and report solid, measurable training results while wowing your students, earning rave reviews and turning classrooms in active, fun learning environments.<br></p>\n\n<p>Take this class over a single afternoon and draw up a plan with my expert guidance that drives impactful, effective and active learning.  </p>\n\n<p>Learn the foundations of world class instructional design and incorporate creative, engaging techniques to your future training efforts, building a reputation of an imaginative and effective instructor who delivers results.</p>\n\n<p>This class is for Instructors, Human Resources professionals and Learning and Development personnel who want continuous learning opportunities! This course consists of 15 lectures, over 1 hour of video, a plan to capture your notes and ideas and many supplementary materials. There is also a money back guarantee!</p>", 
    "end_date": null, 
    "title": "Creative Training Techniques To Drive High Impact Learning!", 
    "price": "25.00", 
    "instructors": "Katy Caselli", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600264_7210_2.jpg", 
    "course_url": "https://www.udemy.com/creative-training-techniques-to-drive-high-impact-learning/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T11:41:17Z"
}