{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "Social media policies are critical to any strategic social media marketing business plan. Without a firm grasp of what&#039;s permissible by law as well as what&#039;s needed to drive adoption internally, you could wind up with a policy that is ruled unlawful by the National Labor Relations Board (NLRB). Why does that matter?<br style=\"\"><br style=\"\">According to a <a href=\"http://www.capgemini-consulting.com/transform/digitalresearch/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">recent research</a>  on 400 companies by Cap Gemini and MIT, digitally mature businesses across all categories generate more revenue, are more profitable and command higher market valuation than businesses that refrain from embracing new media. <br style=\"\"><br style=\"\">Social marketing was where we started. Social business is where we&#039;re headed.&nbsp; You can&#039;t socialize the organization without rules.&nbsp; Social media policy development is a critical component of socializing the enterprise. Learn how to draft social media polices for managers and clients.<br style=\"\"><br style=\"\">This course will save you time and money by accelerating the development time you need to draft and gain approval for a social media policy. It will also minimize the risk of instituting an unlawful social media policy, like many major organizations have done already. Save your organization the time and expensive of having to learn your lesson in court.<br style=\"\"><br style=\"\">You&#039;ll also get my world renown <a href=\"http://ericschwartzman.com/pr/schwartzman/social-media-policy-template.aspx\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">social media policy template</a> , to get you off and running quickly with everything you need to be aware of to draft an effective social media policy.&nbsp; Plus, you&#039;ll learn the rationale behind the language, so you can explain to your legal counsel, manager or client.<br style=\"\">  <br style=\"\">   In this course, you get the benefit of my real world experience developing social media policies for major organizations including Edison International, the United States Marine Corps and many others.<br style=\"\">  <br style=\"\">   Social media has become an integral part of our personal lives. Unless you take the time to specify how (not if) employees can use social media at work, you risk forfeiting the chance of alienating the best and the brightest candidates.&nbsp; If you&#039;re a US-based organization, you might unknowingly violate the National Labor Relations Act. <br style=\"\">  <br style=\"\">   But regardless of where you&#039;re based, draconian social media policies have the potential to severely tarnish your organization&#039;s reputation. Don&#039;t follow the International Olympic Committee&#039;s example.&nbsp; Get it right the first time.  ", 
    "end_date": null, 
    "title": "Drafting Social Media Policies", 
    "price": 0, 
    "instructors": "Howard Industries Eric Schwartzman", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21042_b8e2_13.jpg", 
    "course_url": "https://www.udemy.com/social-media-policy-development/", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-11T23:20:32Z"
}