{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>So, what is ethics and why should we study it? Ethics are the principles and standards that guide our behavior. It is important to study organizational ethics because there are many factors that go into good ethical decision making. Simply hiring “good” people does not make a “good” organization. An individual’s personal values and moral philosophies are just one factor in the ethical decision making process. <span></span></p><p>This program will help you make good ethical decisions regarding business and society using values, knowledge, and experience to recognize and resolve ethical issues within your organization. This program has most likely been sponsored by a department or leadership team in your organization for a reason. It will make you more inclined to ask questions of whether specific business practices are acceptable and inform you on what to do when they aren’t. The learning objective is to increase the awareness of organizational ethics and decrease the level of ambiguity among members of the organization regarding good ethical decisions.I hope that you can leave this program as an advocate for the values and principles that your organization embraces. </p><p>The program is structured into 6 sections of learning. All sections consist of 1 video lecture screencast, 1 video scenario screencast, and a short multiple choice quiz. The course will take approximately 2 hours to complete.<br></p>", 
    "end_date": null, 
    "title": "Embracing Organizational Ethical Behavior ", 
    "price": "20.00", 
    "instructors": "Ms. Dawn Tedesco", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382396_5633_3.jpg", 
    "course_url": "https://www.udemy.com/embracing-organizational-ethics/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T20:09:52Z"
}