{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>      \t  \t\t    In   guiding a project, particularly one in the building and construction   industry, team effectiveness is critical to the   successful delivery of the project. In reality, many people talk about team effectiveness in construction, but very few are really good at understanding and implementing team effectiveness.  <br>  \t\t<br>  \t\t         Whilst Team Effectiveness is not a new concept for training design, Exner   Education can draw on their 25 years of experience in the construction   industry and have tailored this course to address many of the challenges (call   them risks) facing Construction Projects and their Project Managers today.  \t        </p>\n\n<p>Please note that this course is priced in US dollars. <br></p>\n\n<p>Duration of Study </p>\n\n<p>The pace at which each student studies is different. The nominal hours for this course are 60 hours, however, this can vary greatly depending on your previous experience and study techniques. Student support is available by asking a question online or visiting our website.</p>\n\n<p>Our Support is given as a Registered Training Organisation (Provider number 22450).</p>\n\n<p>As a RTO (Provider number 22450), Exner Education is responsible for delivering quality training and assessment. </p>\n\n<p>  \t          This course has a been designed in accordance with the Australian VET sector business services training package where the unit of competency -  BSBWO502B Ensure Team Effectiveness is found.<strong></strong></p><p>If you are an Australian student and would like to be assessed for this unit of competency please visit our website for more information. Successful completion of the unit entitles you to be awarded a Nationally accredited statement of attainment. This unit is also part of the Diploma of project management.</p>", 
    "end_date": null, 
    "title": "Ensure Team Effectiveness BSBWOR502B", 
    "price": "20.00", 
    "instructors": "Exner Education", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/104462_5f75_8.jpg", 
    "course_url": "https://www.udemy.com/ensure-team-effectiveness-bsbwor502b/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-11T03:44:39Z"
}