{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Being\na personal/administrative/executive Assistant is an important role that requires\na special set of skills. Whether you are monitoring a boss's schedules, arranging a business travel, taking minutes in a board meeting, or preparing important files all should be done with a high degree of accuracy, transparency and confidentiality.\nBeing trustful, reliable and discrete are some  of the most important characteristics for an executive assistant. </p><p>\n<br>\nOur <u>Administrative Assistant Training </u>course will show learners what it takes to be a very effective &amp; efficient personal assistant. Students will learn how to effectively\nmanage busy managers' schedules, organize meetings, and even how to be a smart gatekeeper. Being an personal/administrative/executive assistant takes\na special skill set and this Udemy course will provide learners with the essential tools.</p><p>The course material will tackle some of the sub topics that are of common interest to administrative assistants such as: administrative assistant job description, administrative assistant duties, administrative assistant job, administrative assistant skills list, administrative assistant day, administrative assistant training &amp; administrative assistant skills..etc</p><p><strong>Learning Objectives:</strong></p><ul>\n\t<li>\nBe flexible and adaptable to styles of senior management</li><li>Effective Communication skills (written, verbal, and nonverbal methods)</li><li>\nImprove\n\ttime management, organizing and planning skills</li><li>\nMonitor meetings effectively</li><li>\nLearn how to be an effective gatekeeper</li><li>\nBe good at office technology &amp; tools</li><li>Master note taking at management meetings</li><li><span></span>How to improve focus &amp; concentration in meetings</li><li><span></span>Deal with technical subjects and jargon</li></ul><p>Keywords: administrative courses, executive assistant courses, administrative assistant classes, online classes for medical assistants, admin training courses, administrative assistant online courses, administrative assistant degree online, executive assistant training courses, executive assistant courses online, executive assistant classes online, executive assistant workshops, executive assistant course online, online classes for executive assistant, online classes for administrative assistant, executive assistant training programs, medical office assistant online courses, online school for executive assistant, online school for administrative assistant, administrative assistant seminars, classes for executive assistants, online executive assistant training, online executive assistant certification<span></span></p>", 
    "end_date": null, 
    "title": "Executive & Administrative Assistant Training", 
    "price": "30.00", 
    "instructors": "Adam Karchoufa", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645826_d977.jpg", 
    "course_url": "https://www.udemy.com/executive-administrative-assistant-training/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T13:32:37Z"
}