{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Als Führungskraft haben Sie bestimmt auch schon die Erfahrung gemacht: </p><p style=\"\"><strong style=\"\">Mitarbeiterinnen und Mitarbeiter sind bisweilen eine Herausforderung ...</strong></p><p style=\"\">Manche können einen auf die Palme bringen, andere sind ständig beleidigt, wieder andere geben ständig Anlass zur Sorge.</p><p style=\"\">In diesem Video-Kurs erhalten Sie Tipps für schwierige Situationen im Umgang mit einzelnen Mitarbeitenden. Und zwar erfahren Sie </p><p style=\"\">in 23 Lektionen (verteilt über 6 Abschnitte:</p> <ul style=\"\"><li style=\"\">wie Sie bei sog. <strong style=\"\">Minderleistungen</strong> vorgehen</li><li style=\"\">was Sie bei häufigen <strong style=\"\">Kurzerkrankungen</strong> tun können</li><li style=\"\">wie Sie mit sensiblen Mitarbeitenden (<strong style=\"\">Mimosen, Primadonnen</strong>) umgehen</li><li style=\"\">wie Sie <strong style=\"\">ältere Beschäftigte</strong> gesund führen</li><li style=\"\">worauf Sie <strong style=\"\">bei psychisch erkrankten</strong> Mitarbeitenden achten sollten</li><li style=\"\">was Sie tun können, wenn Sie eine/n Mitarbeiter/in <strong style=\"\">einfach nicht mögen</strong></li></ul> <p style=\"\">In <strong style=\"\">7 Quizes</strong> können Sie überprüfen, was Sie von dem Gelernten behalten haben.</p><p style=\"\">Alle Materialien sind herunterladbar. Die 8 vertonten Folien-Vorträge und 7 Person-Videos (in denen ich zu Ihnen spreche) sowie die 7 Text-Lektionen liefern Ihnen ein abwechslungsreiches Programm, an dem Sie hoffentlich viel Freude haben. </p><p style=\"\">Es erwarten Sie außerdem zu jedem Abschnitt <strong style=\"\">umfangreiche</strong> <strong style=\"\">Materialien</strong> zur Vertiefung: je 1 eBook, 1 schematische Übersicht mit den wichtigsten Tipps und Podcasts sowie einige verlinkte Broschüren. </p><p style=\"\">Alle Fall-Beispiele und Praxisberichte basieren auf meinen 17 Jahre langen Erfahrungen als Beraterin zum Betrieblichen Gesundheitsmanagement und <strong style=\"\">Gesund-Führen-Expertin</strong> (allein zu diesem Thema: 6 Bücher, 20 eBooks, 200 Vorträge, 450 2tägige Seminare, 100 ausgebildete Gesund-Führen-Trainer/innen, 1 Gesund-Führen-Toolbox). </p><p style=\"\">Für Sie heißt das, dass Sie <strong style=\"\">erprobte und bewährte Konzepte</strong> kennenlernen und keine abgehobene Theorie. Was ich früher in Workshops, Seminaren, Vorträgen und Beratungen vermittelt habe, erhalten Sie nun in komprimierter Form als Online-Kurs.</p><p style=\"\"><em style=\"\">(Anmerkung: Tipps zum Umgang mit schwierigen Team-Konstellationen erhalten Sie in Kurs 3 aus dieser Reihe; und in Kurs 4 geht es um schwierige Rahmenbedingungen). </em></p>", 
    "end_date": null, 
    "title": "Gesund Führen bei \"schwierigen\" Mitarbeitern", 
    "price": "40.00", 
    "instructors": "Anne Katrin Matyssek", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523098_4fbd_3.jpg", 
    "course_url": "https://www.udemy.com/gesund-fuhren-bei-schwierigen-mitarbeitern/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T08:01:11Z"
}