{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Als Führungskraft gestalten Sie nicht nur die Arbeitsbedingungen für Ihre Mitarbeitenden, Sie sind auch selber eine - anders ausgedrückt: </p><p><strong style=\"\">Sie sind ein Gesundheitsfaktor! </strong></p><p>Sie sind Vorbild und entscheiden über gesundheitsgerechte Abläufe und Prozesse; Ihr Umgang mit den Team-Mitgliedern prägt das Klima der Abteilung; somit beeinflussen Sie als Führungskraft das Wohlbefinden am Arbeitsplatz und die Arbeitsfähigkeit Ihrer Mitarbeitenden - natürlich nicht allein, aber eben als einer von vielen Faktoren.</p><p>In diesem Video-Kurs lernen Sie das <strong style=\"\">Basis-Programm</strong> für gesundheitsgerechte Führung kennen - mit dem Ziel, Ihr eigenes Wohlbefinden und das Ihrer Mitarbeitenden zu fördern.</p><p>In 23 Lektionen - verteilt über 6 Abschnitte - erfahren Sie, </p> <ul style=\"\"><li>wie Führung und Gesundheit bzw. <strong style=\"\">Anwesenheit</strong> zusammenhängen</li><li>warum Ihre <strong style=\"\">Haltung </strong>wichtiger ist als Ihr Verhalten</li><li>woran Sie <strong style=\"\">Überlastung </strong>bei Mitarbeitenden erkennen – und wie Sie sie ansprechen</li><li>wie Sie die <strong style=\"\">6 Dimensionen</strong> gesundheitsgerechter Führung im Alltag mit Leben füllen</li><li>wie Sie<strong style=\"\"> Anerkennung ohne Schleimverdacht</strong> geben</li><li>in wie weit Sie schon &quot;gesund führen&quot; - und <strong style=\"\">was Sie sonst noch tun können</strong></li><li>woran Sie Ihre<strong style=\"\"> Grenzen erkennen </strong>und was Sie in diesem Fall tun können</li><li>wie Sie im Führungsalltag<strong style=\"\"> gut auf sich selbst achtgeben</strong></li></ul> <p>In <strong style=\"\">5 Quizes</strong> können Sie überprüfen, was Sie von dem Gelernten behalten haben.</p><p>Alle Materialien sind herunterladbar. Die 11 vertonten Folien-Vorträge und 9 Person-Videos (in denen ich zu Ihnen spreche) sowie die 3 Text-Lektionen liefern Ihnen ein abwechslungsreiches Programm, an dem Sie hoffentlich viel Freude haben werden. </p><p>Es erwarten Sie außerdem Merk-Charts zum Ausdrucken, umfangreiche <strong style=\"\">Leseproben, Selbst-Checks und weitere Materialien</strong> zur Vertiefung. </p><p>Alle Fall-Beispiele und Praxisberichte basieren auf meinen 17 Jahre langen Erfahrungen als Beraterin zum Betrieblichen Gesundheitsmanagement und <strong style=\"\">Gesund-Führen-Expertin</strong> (allein zu diesem Thema: 6 Bücher, 20 eBooks, 200 Vorträge, 450 2tägige Seminare, 100 ausgebildete Gesund-Führen-Trainer/innen, 1 Gesund-Führen-Toolbox). </p><p>Für Sie heißt das, dass Sie <strong style=\"\">erprobte und bewährte Konzepte</strong> kennenlernen und keine abgehobene Theorie. Was ich früher in Workshops, Seminaren, Vorträgen und Beratungen vermittelt habe, erhalten Sie nun in komprimierter Form als Online-Kurs.</p>", 
    "end_date": null, 
    "title": "Gesund Führen: Der Basis-Kurs für Führungskräfte", 
    "price": "40.00", 
    "instructors": "Anne Katrin Matyssek", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523056_c236_3.jpg", 
    "course_url": "https://www.udemy.com/gesund-fuhren-der-basis-kurs/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T07:02:34Z"
}