{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Meet the stars of the HR world up close and personal in the Get Ahead Fast program. Over 30 senior HR experts from Unilever, Coke, Pepsi, Microsoft, GE, Amazon, American Express and many others help you find your next awesome job!</em></p><p>Are you anxious about getting a good job? Are you worried that you may be left far behind when it comes to making a great career start? You should be.</p><p>Competition for good jobs is very stiff and candidates are trying to be as prepared as possible. Unfortunately that 'preparation' normally means talking to some colleagues at work or maybe watching some random YouTube videos on the subject of interviewing. None of which works very well. You end up with poor information, or worse wrong information that sabotages your efforts. </p><p>Now for the first time ever - 30 HR Directors and Global Experts have come together on one platform to coach you on job search. They coach you on the referral route, the hidden job market, resumes, interviewing and teach you a whole lot of things you would otherwise simply never know. These are senior managers from top companies like<br></p><ul><li>Unilever</li><li>American Express </li><li>Citibank</li><li>Amazon</li><li>Microsoft</li><li>General Electric</li><li>KPMG </li></ul><p>and many others who have spent decades hiring people like you and me. </p><p>Most people laugh at how bad their jobs are, complain to their partners, curse the alarm clock next morning and then go back to work to the same place everyday. Is this how you want to spend over 80% of your life?</p><p>Imagine working at a place where you are respected, your talent recognised and yes, where you earn what you think you deserve. Take this course to learn how to get there.</p>", 
    "end_date": null, 
    "title": "\"Get Ahead Fast: Easy Job Search for Young Professionals!\"", 
    "price": 0, 
    "instructors": "Vikram Anand", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579770_c85e_9.jpg", 
    "course_url": "https://www.udemy.com/getaheadfast/", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T04:27:02Z"
}