{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Most people HATE having to fire someone. Whether you have to let someone go from the business, transfer them out of your department, or just get them off your project, this can be an unpleasant discussion all around.</p><p style=\"\">What if you could fire someone so they say “thank you” and shake your hand when you&#039;re done? What if it was a pleasant, classy discussion that even the ex-employee would speak positively about long after they&#039;re gone? </p><p style=\"\">There are a lot of great reasons to know how to end a business relationship with someone in a positive way. An often over-looked reason is that your team members see the dignity with which you handle letting someone go. They see how you handle people&#039;s mistakes or inability. They see that you step up, take care of business, get the job done… and you&#039;re NICE about it.</p><p style=\"\">For anyone that has any influence over the hiring and firing of employees, this is a crucial skill. It&#039;s important for anyone who has the responsibility for any team. You will encounter people you need to let go, and you will have a team that is watching you to see how you handle it.</p><p style=\"\"> “How to Fire Someone so they say &#039;thank you&#039; and shake your hand when you&#039;re done” is the most in-demand, signature technique from the world&#039;s only 360-Degree Leadership System. This program also gives you a very brief introduction to that system.</p>", 
    "end_date": null, 
    "title": "How to Fire Someone (so it's pleasant for both of you!)", 
    "price": "25.00", 
    "instructors": "Scot Conway", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503518_8f79_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-fire-someone-so-its-pleasant-for-both-of-you/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-16T01:52:21Z"
}