{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em style=\"\">How to Get a Raise so your boss is excited about paying you more </em>is a practical, nuts and bolts program you can apply today. </p><p style=\"\">Learn the fundamentals every boss wishes every team member knew. Apply your knowledge of those fundamentals to approaching your employer for more money, more flexibility and for promotions. </p><ul style=\"\"><li style=\"\">Learn What to Include when you Set the Meeting.</li><li style=\"\">Learn the Two Key Points to Make in the Meeting.</li><li style=\"\">Learn the critical Follow-Up Strategy that Assures Success.</li><li style=\"\">Learn the most important skill that pays the highest income in business, and learn a unique, powerful approach to this subject that few ever even hear about.</li></ul><p style=\"\">This course comes to you from a Master Instructor with experience as the one asking, as the one asked, as a trainer for the askers and as a trainer for owners and executives. When you&#039;ve seen all sides... when you&#039;ve been on all sides... the importance of a technique that builds relationship becomes clear.</p><p style=\"\">This program is easily understood by beginners. It is also a massive leap forward for those experienced at climbing the corporate ladder. </p><p style=\"\">Learn it today. Use it tomorrow. It&#039;s that clear.</p>", 
    "end_date": null, 
    "title": "How to Get a Raise (so your boss wants to give you more!)", 
    "price": "25.00", 
    "instructors": "Scot Conway", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510608_738d_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-raise/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-25T03:18:56Z"
}