{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will help you and your company understand the types of people you need to lead a cross organizational digital business strategy and transformation effort, their roles and responsibilities and the support they need to succeed..</p><p><strong>Identify, organize and develop your company's digital leadership team</strong></p> <ul> <li>Learn the requirements for digital leadership team </li> <li>Learn who to bring on to the team and who to keep off </li> <li>Learn how to organize, develop and support the team to ensure its success</li> </ul> <p><strong>This course helps you define, and build the consensus needed to establish and support a high performance digital strategy and transformation team </strong></p><p>It is designed to provide you the insight you need to help your company understand and support the development of an team of exceptional group of people who can successfully define and lead your companies digital strategy and transformation. It provides a framework for identify your requirements, identifying and qualifying potential team leader and helping the develop the competencies, capabilities and momentum required to establish and sustain your company as a digital leader.</p><p>The course includes lectures, discussion guides as well as roles, responsibilities and team structure that help you identify, organize and launch and integrated digital business strategy and transformation team quickly and effectively.</p><p>This is Part One of a Two-Part course titled “Building a Digital Strategy and Transformation Dream Team\".</p><p><strong>Part One lessons include:</strong></p> <ul><li>An intro to building a digital dream team</li> <li>Team leader qualification</li> <li>Where to look for Candidates</li> <li>How to qualify team leaders</li> <li>An overview of team roles and responsibilities</li> <li>Detailed roles and responsibilities for the team members</li> <li>Management process and practices</li> <li>Team professional skills and capabilities development</li></ul> <p><strong>Part Two, titled “Leading Digital Strategy &amp; Transformation Planning\",</strong> provides an in-depth guide to helping the team prepare for, plan, and facilitate a powerful planning meeting. The course helps you guide the team in gathering, assessing, and integrating the company's current perspectives and status and developing a prioritized plan to accelerate implementation of a successful digital strategy. Part Two is available for purchase separately. Part One &amp; Two may be purchased together for a discount under the title “Kick Start Your Digital Strategy and Transformation Program\".</p><p><strong>These are all part of the “Competing for the Digital Future Leadership Program for Digital Strategy and Transformation\". </strong>The program passes on lessons based on years of experience working within Silicon Valley for companies like Apple and Adobe as well as startups, helping them and their customers transform emerging technologies into business momentum</p>", 
    "end_date": null, 
    "title": "Identifying and Building Digital Leadership Talent", 
    "price": "30.00", 
    "instructors": "Mike Connor", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512324_8c2f_2.jpg", 
    "course_url": "https://www.udemy.com/identifying-and-building-digital-leadership-talent/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T23:50:43Z"
}