{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\">‘Everybody has a fundamental right to experience flow &amp; know how to create it.’</strong>  </p>  <p>  \t   Put simply, Flow is the Path of Least Resistance. You get to experience flow when you are playing to your natural strengths in the work that you do. It then allows you to be more trusted in your team or industry and also to get better results.<br style=\"\">  \t<br style=\"\">  \t    The Talent Dynamics profile &amp; pathway really helps you uncover the best way to get things flowing more for you!<br style=\"\">  \t<br style=\"\">  \t    During this programme, you’ll get experience a brief history of the Talent Dynamics system, along with seeing the importance of Trust &amp; Flow in business. You’ll also get to see how in business it all comes down to the Value that you offer &amp; if you are Leveraging it effectively.<br style=\"\">  \t<br style=\"\">  \t    You’ll then go on a trip around the Talent Dynamics square to get an overview of each of the 8 different profiles. It will become clear how each of the different types of people should spend more time doing certain activities &amp; avoid others if they can!<br style=\"\">  \t<br style=\"\">  \t    The Creator profile will then be explored even further, before you get to see parts of a 1-2-1 debrief, where a Talent Dynamics Flow Consultant completed a debrief with a client.<br style=\"\">  \t<br style=\"\">  \t    Overall, it will help you see the first stages of the Talent Dynamics Pathway in action, as elements of this course are part of our e-Accrediation programme for Flow Consultants.<br style=\"\">  \t<br style=\"\">  \t    Enjoy increasing the levels of Trust &amp; Flow that you experience as a result!  </p>", 
    "end_date": null, 
    "title": "Increase Trust & Flow - Accelerate Your Business Growth!", 
    "price": 0, 
    "instructors": "Talent Dynamics, Janet Carter, Osmaan Sharif, Rbm", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/257712_cd5f_5.jpg", 
    "course_url": "https://www.udemy.com/talent-dynamics-increase-trust-flow/", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-08T13:25:03Z"
}