{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>No matter how hard-working you are, your success largely depends on the way your team helps you to achieve your goal.</p>\n\n<p>Whatever you have so far and whatever you will have in your life or business, it will all come through people around you and the communication you have with them.</p>\n\n<p>Meet Amanda,</p>\n\n<p>She is a businesswoman and she is struggling to make profit in highly turbulent busines environment. Time is ticking and the cost of running a business is constantly going higher. She is worrying about the performance from her team-members. Her employees don't understand her vision.</p>\n\n<p>She says to herself, \"Why don't my employees think like me? Why don't they understand my expectations?\"</p>\n\n<p>Afterall, she wants to grow her business as well as grow her team but she is unable to make them understood. Her employees are hardworking but they don't have a clue what their boss is feeling and talking about.</p>\n\n<p><br></p>\n\n<p>Meet Jason, who is working a senior manager at a one of the multi-national companies. He worked hard to get promoted but now the leadership position is not so joyful and comfortable. </p><p>He can not fulfill his targets and goals because his team  members don't understand his expectations. He has tried all techniques he knew to motivate but he failed to get the work done. </p><p>Instead of creating a compelling and challenging vision, he is busy with less productive activities. </p><p>Life becomes miserable if the situation persists like this.</p><p>If you too are seeing yourself in above situation, you need to know the exact process to influence your employees.</p><p>It's not easy to motivate people if we don't know how to do.</p><p>I would like to introduce you to the  course \"How to influence your employees to follow you?\"</p><p>By the end of the course, you will be empowered with the knowledge and skill of influencing your employees that too with least resistance.</p><p>You will be enjoying leadership with the team that follow you and help you to achieve your targets and goals.</p><p>I welcome you to the course.</p><p>I will see you on the other side of the enrolment.</p><p><br></p>", 
    "end_date": null, 
    "title": "Influence your employees to follow you", 
    "price": "20.00", 
    "instructors": "Mayur Bardolia", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/869918_da3a.jpg", 
    "course_url": "https://www.udemy.com/how-to-influence-your-employees/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-06T03:56:12Z"
}