{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>En el curso<strong> Inteligencia Emocional en la Empresa</strong> vas a conocer por qué es importante gestionar las emociones en el ámbito del trabajo.</p><p>Encontrarás las respuestas acerca del modo en que puedes gestionar tus emociones y las emociones de los otros para ser exitoso y lograr tus objetivos como líder.</p><p>Vas a comprender cómo gestionar las emociones para poder ser innovadores en un mundo tan complejo.Podrás realizar un test sobre tu propia inteligencia emocional para conocerte mejor. </p><p><strong>El curso incluye tres módulos: </strong>Las Emociones, Inteligencia Emocional, Inteligencia Interpersonal. </p><p>En cada uno de ellos encontrarás clases online, materiales y ejercicios. Podrás dejarnos también tus dudas y consultas. Organizaremos clases en vivo entre los participantes. </p><p><strong>Los temas que podrás aprender en el curso son:</strong></p><p>La coherencia cuerpo, emoción y lenguaje</p><p>La emoción como estado basal del ser humano</p><p>El espacio laboral, como ámbito eminentemente emocional</p><p>El valor y las funciones de las emociones</p><p>La diferencia entre emoción y estado emocional</p><p>Las emociones básicas: alegría, tristeza, miedo y enojo</p><p>Como detectarlas</p><p>El menú emocional de cada individuo</p><p>Cómo gestionar las emociones</p><p>La valoración personal y su incidencia en los resultados que obtenemos</p><p>La automotivación</p><p>Detección de objetivos</p><p>La actitud positiva y proactiva</p><p>Como gestionar las propias emociones y las de los otros</p><p>Siguiendo esta idea trabajaremos a lo largo del curso en el que esperamos nos acompañes!</p>", 
    "end_date": null, 
    "title": "Inteligencia Emocional en la Empresa", 
    "price": "50.00", 
    "instructors": "PUNTOTALENT Digital Out of the BOX", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538672_6165_2.jpg", 
    "course_url": "https://www.udemy.com/inteligencia-emocional-en-la-empresa/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-27T15:32:27Z"
}