{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will teach the student to explore and <strong>prepare for both the mental and physical parts of the job interview process</strong>. After taking this course the student will have an understanding of how the mind works from the inside out. How stress felt in the job interview is not created from the circumstance but from the thoughts they create about the event. From here the student will learn that they can ignore those thoughts and perform at a high state of mind. They will combine this state of mind with the <strong>key targeted focused acting skills</strong> required the any job interview. The student will learn the importance of breathe control to remain focused, posture, eye contact, voice exercises to <strong>clearly communicate their best self. </strong></p><p><strong>Over 97 % of people </strong>prepare for the job interview but ignore the most important factors. First their state of mind. With an understanding of HOW the mind works students learn to relax let go feel less stressed while in the job interview itself. Next when the student chooses from numerous acting exercises that will serve them. They come across as more confident, assured humble and likeable.  They will build rapport faster with the interviewer and connect on a deeper level.  </p><p>After taking this course the student will show they <strong>have the soft skills to get hired</strong>. Since they have the required hard skills to have been chosen for the interview. The job interview is never about having the proper hard skills but the suitable soft skills to get along with everyone else in the new work space.</p><p><strong>S</strong><strong>kip the painful learning that most new job seekers spend struggling to pass their first job interview</strong> before they realize they need help in figuring out how to do it right. I created this course because I did exactly that (30 times!) and I want you to have the chance to have an easier time being successful at your job interview.<br></p><p><strong>Enjoy both PRACTICAL and INSPIRATIONAL lectures!</strong> You get everything you need in this course to beat out the other job applicants. See exactly what worked for me and how I used easy techniques to do all the things most of your competitors miss.</p><p>You can <strong>leapfrog the hundreds of hours of painful learning</strong> I spent figuring out job interview success the hard way by <strong>taking this course now!</strong><span>.<br></span></p>", 
    "end_date": null, 
    "title": "Job Interview Success - Getting Your Dream Job", 
    "price": "20.00", 
    "instructors": "Scott Paton, Leonard Irwin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/718764_8843.jpg", 
    "course_url": "https://www.udemy.com/winning-job-interviews/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T21:11:08Z"
}