{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Learn the secrets of LinkedIn, how to <strong style=\"\">master LinkedIn to serve you better.</strong>  </p><p style=\"\">This course is about the <strong style=\"\">POWER of LINKEDIN</strong> and what it can do for you!</p><p style=\"\"> LinkedIn is a <strong style=\"\">powerful</strong> social tool which can be used to find sales leads, increase your online persona, boost your career opportunities and to <strong style=\"\">showcase your professional accomplishments</strong>.</p><p style=\"\">LinkedIn has<strong style=\"\"> benefits</strong> over other networks as it is a professional resource.  Get your <strong style=\"\">products, services</strong> and<strong style=\"\"> yourself</strong> in front of the<strong style=\"\"> demographics that matter</strong>.</p><p style=\"\">Profile views can<strong style=\"\"> create opportunities</strong>.  This course is designed to help you get <strong style=\"\">more profile views</strong>, and<strong style=\"\"> reach more connections</strong>.   We walk you through <strong style=\"\">LinkedIn features</strong>, and how to use them.   Show you ways to connect to others, get emails and grow your connections.   </p><p style=\"\"><strong style=\"\">Hidden secrets</strong> of LinkedIn to really accelerate your experience.  Using LinkedIn as a research tools to better understand competition.  <strong style=\"\"> Powerful strategies</strong> you can use to become more effective.</p><p style=\"\">Learn how to make effective content on LinkedIn&#039;s publishing platform.</p><p style=\"\">Begin your network of contacts now so you have connections to use as resources if you need them.</p>", 
    "end_date": null, 
    "title": "Linkedin Bootcamp complete guide to a Powerful Profile", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552670_bd78_2.jpg", 
    "course_url": "https://www.udemy.com/linkedin-bootcamp-complete-guide-to-a-powerful-profiles/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T18:43:49Z"
}