{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em><em>Over 2,800 students from 106 countries enrolled in Specialist Series classes by Katy Caselli since September, 2015! Updated in April, 2016!</em></em></strong><br></p>\n\n<p>Training Journal reports a study on learning &amp; development (L&amp;D) departments. The study determined that:<br></p>\n\n<ul><li>Only 3 out of 10 Training initiatives effectively improved productivity and engagement.</li><li>Only 2 out of 10 Training initiatives helped to build a learning culture.</li><li>Only 4 out of 10 Training initiatives increased efficiency.</li></ul>\n\n<p>How would you like to improve these typical, non effective training outcomes AND </p>\n\n<ul><li><strong>Shine like a hero</strong><strong> i</strong><strong>n your organization for correcting significant problems</strong></li><li><strong>Raise the bar on performance</strong></li><li><strong>Get results your leaders hope for</strong></li></ul>\n\n<p> You can do this by following a standard approach to training that <strong>RETURNS RESULTS</strong>.</p>\n\n<p>      Showing how training is effective deepens the partnership between business leaders and training staff, and makes it clear the training departments or Instructors or consultants are there to bring business results, not just to force employees to attend yet another “preventing harassment” class. Showing the leaders how training can remove critical obstacles deepens the organization’s learning culture, which helped keep training on the agenda, and your contributions <strong>VISIBLE</strong>.<br></p>\n\n<p>This class will show you step by step why training efforts have failed in the past and what is sure to make them succeed. With real life case studies and an exploration of how they succeeded, you will see how to plan for effectiveness by using the best practices in this course.  Take this course to <strong>Show Your Value</strong> to organizations!</p>", 
    "end_date": null, 
    "title": "Make It Count! -Show a Return on Investment with Training", 
    "price": "25.00", 
    "instructors": "Katy Caselli", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628254_83fc_3.jpg", 
    "course_url": "https://www.udemy.com/make-it-count-show-a-return-on-investment-with-training/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T20:09:58Z"
}