{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Payroll transactions, taxes, labour expenses, bonuses, overtime rates and employee data about social security, medical fees, and paid benefits often demand setting a separate accounting practice harmonised with both company polices and national laws. The objective is to adequately prepare and manage payroll records, make payments, comply with laws, maintain control and be able to present allowances and deductions and handle personal information. Effective systems of internal control, liabilities and compensations are suggested and the pay roll processing systems evaluated.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">The course include the following video topics:</strong>  </p>  <p style=\"\">  \t  1. Goals of Remuneration System  </p>  <p style=\"\">  \t  2. Total  remuneration  </p>  <p style=\"\">  \t  3. Limitations and Structuring of Remuneration System  </p>  <p style=\"\">  \t  4. Job evaluation  </p>  <p style=\"\">  \t  5. Comparing job value with salaries. Salary surveys.  </p>  <p style=\"\">  \t  6. Pay structure and pay ranges  </p>  <p style=\"\">  \t  7. Performance-Related-Pay  </p>  <p style=\"\">  \t  8. Benefits  </p>  <p style=\"\">  \t  9. Utilisation of pay components  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">A few word about the author of this course:</strong>  </p>  <p style=\"\">  \t  Tania Ayerst has over 20 years of experience in Management Consulting and over 15 years in the area of People Management and Development. Her expertise includes Strategic Management, Agile/Lean management, Strategic Human Capital Management, Customer Relations, Organizational Culture Change, Employee Engagement, Performance Management, Competency Modelling, Total Rewards Management, Learning and Development, Talent Management, HR Transformation, etc.  </p>  <p style=\"\">  \t  She help companies re-think and re-design their culture and organization using NEO-MANAGEMENT. This is a group of new management methods, based on new paradigm. It is better suited to the contemporary hyper-competitive, totaly connected market.  </p>  <p style=\"\">  \t  Tania Ayerst has a Master’s Degree in Human Resources Management and Development from WAC University, USA. She also holds a Diploma in Management Studies from the Open University, UK as well as a specialization in People and Organizational Management Management from AOTS, Yokohama, Japan.  </p>  <p style=\"\">  \t  She is Certified Management Consultant (CMC) by the Institute of Consulting in London according to the standards of the International Council of Management Consulting Institutes (ICMCI).  </p>", 
    "end_date": null, 
    "title": "Organizational rewards", 
    "price": "20.00", 
    "instructors": "Slavi Slavov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413926_89b3_2.jpg", 
    "course_url": "https://www.udemy.com/organizational-rewards/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T08:17:31Z"
}