{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hay diversos factores que influyen en el crecimiento de un proyecto: un buen producto, el diseño de planes de servicios adecuados a los clientes y un equipo técnico preparado para llevarlo a cabo. Si tienes un buen producto base y buen equipo comercial, puedes vender mucho al principio, pero <strong>si tu equipo no está preparado para llevar a cabo los servicios que vendes</strong> o si no sabes escalarlo según van creciendo las ventas, a largo plazo perderás producción y percepción de calidad.<br></p><p>Hace unos años me pidieron que dirigiera un departamento técnico en una empresa internacional. Querían separarlo de las otras áreas técnicas y darle entidad propia. <strong>3 años después, se había convertido en una unidad de negocio independiente que facturaba ya 1 millón de euros.</strong><br></p><p>En este curso te explico <strong>las pautas que utilizamos y los aspectos que tuvimos que cuidar y optimizar para conseguir nuestros objetivos</strong> y seguir el ritmo de crecimiento del proyecto.</p><p>Tener un buen equipo de trabajo es imprescindible para que cualquier proyecto funcione. Las claves de este curso son las que he utilizado en mi labor como coordinadora y directora, no sólo en el proyecto del ejemplo, sino en todos los que he dirigido y que me han dado siempre buenos resultados a la hora de <strong>organizar el trabajo y a las personas</strong> que forman el equipo.</p><p>Ser líder de un equipo requiere tanto conocimientos y habilidades técnicas como personales. Has de saber cómo aprovechar todo el potencial humano y profesional de las personas que lo componen.</p><p>En el curso encontrarás <strong>la fórmula que a mí me ha resultado más eficaz y eficiente para combinar ambas cosas y conducir equipos con éxito</strong>, tanto en empresas como en asociaciones. Lo que hago en cada caso es encontrar y mantener el punto de equilibrio entre esas dos partes, los intereses personales y los profesionales, a través de la organización del trabajo, la claridad en el reparto de los roles y la transparencia en el desarrollo y la dirección del proyecto.</p><p><strong>Es un curso práctico, para ir aplicando lo que en él se incluye en tu trabajo diario</strong>. Contiene, en pocas palabras, importantes claves basadas en la experiencia sobre el trabajo real de coordinación que te serán útiles en tu día a día.</p>", 
    "end_date": null, 
    "title": "Organiza a tu equipo y haz que sea más productivo y eficaz", 
    "price": "35.00", 
    "instructors": "Margarita Álvarez", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554274_4210_3.jpg", 
    "course_url": "https://www.udemy.com/como-ser-el-lider-ideal-de-tu-equipo-pasos-clave/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T12:10:06Z"
}