{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The <strong class=\"redactor-inline-converted\">recruitment &amp; selection interview</strong> is by far the most widely used method of identifying new talent to fill a job vacancy. Recruiting a new member to your team or business is an <strong class=\"redactor-inline-converted\">important decision</strong>. Get it right and the benefits are enormous. Get it wrong and you live with the consequences for a long time. A poor recruitment &amp; selection decision can quickly have a very negative effect on performance: not only for the individual concerned, but also the whole team. Tackling the problem of the wrong decision will take an incredible amount of time and effort. Far better to learn how to interview somebody for a <strong>job professionally and get it right first time.<br></strong></p><p><em><strong>It is a wonderful course. I learned a lot of skills to help in the hiring process. </strong>                                                                                                 </em>Emily Tillis<br></p>\n\n<p><strong class=\"redactor-inline-converted\">Transform your interviewing skills and boost your career prospects</strong>. Recruitment Interviewing Made Easy takes away the worry of the recruitment decision. It <strong class=\"redactor-inline-converted\">leads you step by step</strong> through the recruitment process, showing you <strong class=\"redactor-inline-converted\">best practice interview tips, ideas and approaches </strong>to build your interview skills and identify the right person for your role and <strong class=\"redactor-inline-converted\">avoid making costly mistakes</strong>.<br></p>\n\n<p>You will learn:</p>\n\n<ul><li>The key stages of the recruitment process</li><li>The role of the job description</li><li>How to clearly specify your candidate requirements</li><li>How to attract suitable candidates</li><li>How to shortlist quickly with laser like focus</li><li>How to structure the interview</li><li>How to conduct an interview</li><li>How to control the interview</li><li>Interview questions to ask for successful evidence collection</li><li>How to avoid the key question traps</li><li>What to listen out for</li><li>How to make the right decision</li><li>How to feel confident in your interview skills</li><li>Many other interview tips</li></ul>\n\n<p>The course uses <strong class=\"redactor-inline-converted\">video and downloadable material</strong> to really engage learners. You will be given <strong class=\"redactor-inline-converted\">activities and exercises</strong> to practice and hone your skills, and be supported by an expert trainer along with fellow students.</p>\n\n<p>There is a vast resource of material and support available online to candidates in their search for a job. Ironically, there is far less opportunity for the person who is conducting the interview. Frequently, the candidate is far better trained than the interviewer. This often results in the 'tail wagging the dog' - the candidate being in control of the interview. No wonder <strong class=\"redactor-inline-converted\">so many recruitment &amp; selection interviewers feel under great pressure and stress</strong> when asked to conduct a job interview to fill a vacancy. They are not confident in their interview skills.</p>\n\n<p>It doesn't matter <strong class=\"redactor-inline-converted\">whether you are a first time recruitment &amp; selection interviewer or you are looking to hone your interview skills to a more professional level. This course has something for you.</strong></p>\n\n<p>This course comes with a 30-day money-back guarantee and lifetime access to course material, including updates and additions. You will receive a certificate of completion on finishing the course. Courses can be accessed on computers, iOS devices and Android.</p>", 
    "end_date": null, 
    "title": "Recruitment Interviewing Made Easy: Interview like a pro", 
    "price": "30.00", 
    "instructors": "Richard Lock", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312042_7f9e_2.jpg", 
    "course_url": "https://www.udemy.com/recruitment-and-selection-interviewing/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-02T10:24:50Z"
}