{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Als recruiter heeft u misschien wel een van de lastigste functies binnen het bedrijf; u moet immers de continuïteit en kwaliteit van de organisatie waarborgen. Hoe trek ik de juiste mensen aan? Hoe werkt werving via-via? Hoe zorg ik voor de juiste onboarding van een nieuwe medewerker? En hoe betrek ik lijnmanagers hier actief bij? Er komt aardig wat bij kijken en alle hulp is welkom.  </p>  <p>  \t<br>  \t   Recruitment: De Basis is een uitgebreide videocursus gericht op het succesvol rekruteren van nieuwe medewerkers. De 2 uur durende cursus wordt gegeven door recruitment specialist Ardienne Verhoeven, auteur van het boek ‘Recruitment’. Handig opgedeeld in 20 blokken die u overal kan raadplegen via de computer, tablet of smartphone.<br>  \t<br>  \t   Begin vandaag nog om je recruitmentskills aan te scherpen!  </p>  <p>  \t<strong><br>  \t   Over Recruitment</strong>  </p>  <p>  \t  Werving en selectie, ook wel recruitment genoemd, verwijst naar het proces van aantrekken, selecteren en aanstellen van geschikte kandidaten voor een (vaste) baan of tijdelijk werk, in lijn met de strategie en doelstellingen van een organisatie of onderneming. Het is onderdeel van het personeelsbeleid van een onderneming of openbare dienst dat soms wordt uitbesteed aan dienstverleners of overheden actief in arbeidsbemiddeling. Een goed wervings- en selectieproces is strategisch belangrijk voor ondernemingen om concurrerend te blijven, doordat het onderscheid wordt gemaakt door het talent dat aanwezig is, en heeft een directe impact op bedrijfsresultaten. Een organisatie die invulling zoekt voor een functie, kan gebruikmaken van zeer veel instrumenten. Enkele voorbeelden zijn interne werving, referral recruitment en social media.<br>  \t<br>  \t   Een organisatie zal doorgaans personeel eerst zelf proberen te werven en selecteren, zonder een derde partij, al dan niet met behulp van externe adviseurs. Degene die deze specialistische taak uitvoert, wordt vaak recruiter genoemd. De recruiter is een functie die meestal valt onder de afdeling personeelszaken of humanresourcemanagement (HRM) en veel voorkomt bij grotere organisaties. Vaker wordt deze functie uitgevoerd als onderdeel van het brede takenpakket van een medewerker personeelszaken.  </p>", 
    "end_date": null, 
    "title": "Recruitment - De Basis", 
    "price": "50.00", 
    "instructors": "Tools 4 Recruiters, Ardienne Verhoeven", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/259498_a78c_3.jpg", 
    "course_url": "https://www.udemy.com/recruitment-de-basis/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-11T08:01:43Z"
}