{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">*30 day money back guaranteee* - </strong>&quot;You have nothing to lose and everything to gain.&quot;</p><ul style=\"\"><li>Are you scared of taking your first steps to hiring?</li><li>Worried about the cost of recruitment?</li><li>Fearful of making mistakes and ending up with a bad employee?</li></ul><p>This course is designed to walk you through the most common pitfalls and mistakes that business owners and managers make when recruiting.</p><p><strong style=\"\">What you get:</strong></p><ul style=\"\"><li>Legal advice most employers ignore or get wrong</li><li>Step by step actionable tips</li><li>A clear structure to build your recruitment strategy</li><li>A re-useable model that you can use multiple times</li></ul><p><strong style=\"\">How the course is structured</strong></p><ul style=\"\"><li>7 video lectures with over 2 hours of content</li><li>Regular tips on the most common mistakes</li><li>Homework assignments to cement your learning </li><li>Invitation to join/start a discussion on the Udemy Board with other course participants</li></ul><p><strong style=\"\">Who should take this course</strong></p><ul style=\"\"><li>Startups who are expanding their business for the first time</li><li>Business owners who have made hiring mistakes in the past and want to get it right</li><li>Business owners who are serious about <strong style=\"\">saving both time and money</strong></li><li><strong style=\"\"> <strong style=\"\">Business owners who want to stay out of expensive employment tribunals</strong><strong style=\"\"></strong></strong></li></ul><p></p><p>I&#039;m on the discussion board 3 times a week so will be on hand to answer questions, give updates and add new content to the course.</p><p>Each module is around 15 minutes long and has an assignment that will take around an hour to complete.  You get out of it, what you put in,  so do the assignments, come an talk to us in the discussion board and you will get so much more out of the course.</p><p>Remember, every minute that you delay in taking this course is another minute taking you further away from your ideal job candidate.</p>", 
    "end_date": null, 
    "title": "Recruitment for startups: How to avoid common pitfalls ", 
    "price": "30.00", 
    "instructors": "Michelle Gyimah", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/439898_3188_3.jpg", 
    "course_url": "https://www.udemy.com/recruitment-for-startups-how-to-avoid-common-pitfalls/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-05T21:32:16Z"
}