{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">If your goal is to grow out of a one person operation, you have to be conscious that even the best business owner can only achieve so much. If you know your abilities, you have to be aware of your limitations, and the areas where you need a team to ensure your success. </p><p style=\"\">After recognizing the areas where you lack expertise, or where you want to expand, you have to be able to recognize the individuals that will form part of a team that will lead your company to the next level.</p><p style=\"\">A key part of this transition is to find the right people, and not only make them want to join you, but also who are willing to be led by you and are motivated by you. Any person that becomes part of your team has to integrate to what you want to achieve, and either follow your guide, or help you define how to reach the goals you have set for the company. And you, as the owner and leader, have to be able to motivate, and be motivated by them. They have to bring out the best in you, and you have to bring out the best in them. </p><p style=\"\">There are a lot of factors involved in getting a start-up operating, or building and managing a successful company. And one of the most important factors will be the people you surround yourself with. </p><p style=\"\">That alone, can determine the success or failure of your company. And even though there is no perfect formula, this course i designed to provide you with some tips that can guide you in the hiring process so you can find the best possible team to help you achieve your goals.</p>", 
    "end_date": null, 
    "title": "Small Business - Building and Leading the RIGHT TEAM", 
    "price": "20.00", 
    "instructors": "Alvaro Santizo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/273692_205f_3.jpg", 
    "course_url": "https://www.udemy.com/small-business-building-and-leading-the-right-team/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-03T02:41:43Z"
}