{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        Are you a leader? Are you a leader who wants to help an employee grow and are not sure how to start the process? Employee Development plans; provide a pathway for employee’s to reach their full potential. This course was designed for leaders wanting to bridge current skill sets and future skills, for an employee’s prospective growth within the company. This course is divided into seven individual sections. The section may include; lectures, quizzes, homework, and examples of draft development plans. The goal of this course is to enable leaders to easily generate a development plan for an employee.  </p>  <p>  \t        After the course is completed, leaders should be able to:  </p>  <ul>  \t<p>  \t\t        ·Understand the importance of creating a written development plan  \t</p>  \t<p>  \t\t        ·Identify potential candidates  \t</p>  \t<p>  \t\t        ·Do detective work  \t</p>  \t<p>  \t\t        ·Understand the sections included in a written development plan  \t</p>  \t<p>  \t\t        ·Learn types of skills sets and how people learn  \t</p>  \t<p>  \t\t        ·Create a list of current strengths and future skills  \t</p>  \t<p>  \t\t        ·Create and write a plan  \t</p>  \t<p>  \t\t        · Understand Deadlines/Timelines  \t</p>  \t<p>  \t\t     ·Understand the importance of a mentor or coach  \t</p>  </ul>  <p>  \t        The course is work at your own pace and has open discussions. If you want a step-by-step process for helping grow a star employee this is the course for you.  </p>", 
    "end_date": null, 
    "title": "Talent Management: Grow great employees strategically", 
    "price": "35.00", 
    "instructors": "Sarah Andreas, Billie Jo Dawson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340764_5611_2.jpg", 
    "course_url": "https://www.udemy.com/development-plans/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T18:49:40Z"
}