{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>COURSE UPDATED March 27th 2016</em></p>\n\n<p><strong>Have you ever wondered what the top managers do to achieve such good results?</strong><br>What are their secrets? Can you be a successful manager, too, if you do as they do?<br>Well - you merely have to follow a few simple rules.</p>\n\n<p>And now they are all revealed in this easy to follow course!<br>Managers must learn to be leaders and explore how to communicate effectively with employees, fellow managers, and senior executives. <em>Learn everything you need to know as a manager to lead a team effectively, coach with confidence and make better decisions, in this comprehensive course bundle.</em><br>Become a team building manager and create and manage teams that work together under a unified vision, and climb the path to a successful career in management in rapid time.</p>\n\n<p><strong>Master Strategies to build the MOST EFFECTIVE TEAM!</strong></p>\n\n<ul><li>Motivate the team by setting appropriate goals</li><li>Reward employees based on how they perform</li><li>Understand Employee Evaluation Process</li><li>Getting the maximum out of the team's talent</li><li>Understand the different roles that the team members play</li><li>Manage conflict effectively</li><li>Make work a lot more fun</li></ul>\n\n<p><strong>Get Results</strong><strong>. FAST!</strong><br>Learn how to plan in advance the processes of team management, and how to apply best tools and methods to acquire, develop and manage project team.<br>Team management is not a secret knowledge restricted to charismatic individuals. <strong>You can become a great team manager by learning proper tools and techniques.</strong></p>\n\n<p><strong>100% Money Back Guarantee</strong></p>\n\n<p><strong>Every minute you delay is actually COSTING you money....</strong><br><strong>Enroll</strong><strong> now!</strong></p>", 
    "end_date": null, 
    "title": "Team Management - Getting More Done with the Least Friction", 
    "price": "30.00", 
    "instructors": "Aamir Abbas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806372_493a_4.jpg", 
    "course_url": "https://www.udemy.com/team-management-team-building-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T18:00:18Z"
}