{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>So you're finally ready to start automating part of your business to either sell, have more time for family and going on vacations (enjoying life?!) or simply offloading some of the maintenance work which will free you up to focus on growth and larger picture tasks. It's about time you start taking care of yourself! I don't blame you at all. </p><p>Most of us start a business to live an ideal lifestyle, travel and build wealth, but we often get caught up within the business and find it hard to take a step back and enjoy what we've built. </p><p><strong>Life Without This Course:</strong><br></p><ul><li>Continue Googling how to automate your business - Rinse and repeat!</li><li>Spend more time simply learning how to hire someone than it takes to do the boring tasks you're trying to outsource</li><li>Cycle through dozens of assistants only to give up because of how terrible the work is</li><li>Read countless blog post on how to do so - Rinse and repeat</li><li>Never actually find the right person for the job who makes your life easier</li></ul><p><strong>Life With This Course:</strong></p><ul><li>A complete step-by-step guide from start to finish</li><li>Cut through the terrible people out there to find the A players</li><li>Learn how to create a job post that automatically weeds out the horrible and draws in amazing talent</li><li>Every system and tool I use to cut down the management time of my team members</li><li>A built in case study of me doing everything I teach you to hire my most recent team member</li><li>Hiring your first amazing and qualified VA for $4 /hour in hours, not weeks!</li></ul><p>I often hear, \"I just want the freedom to take off for the weekend without having to work\", or \"I can't hire someone because X(insert personal excuse)\". The truth is you can hire someone for $4 /hour and get amazing work from someone you can trust to maintain your business and someone who won't take up more of your time. </p><p>Your goal is to sleep better at night, not worse... I'll show you exactly how to make that a reality.</p><p><strong>Would you manage a VA for 5 hours a week if it saved you 10+ hours?</strong> Of course you would. Would you pay $4 /hour for you to make $100 /hour? I can see the gears turning in your head....</p><p>But how do I find someone who I can trust to do an amazing job, won't take up more of my time or run off with my Credit Card to buy a brand new BMW?</p><p>You're going to look over my shoulder as I hire my latest virtual assistant, the super simple strategies I use to find A+ people, how to weed out the horrible and all of the systems I use to manage, pay and communicate with my team. </p><p><em>Don't worry, your money is NEVER at risk when hiring the way I do. </em></p><p><strong>I have no clue where I would even begin to outsource!</strong></p><p>Starting is literally the hardest part. Once you experience the power of working with a virtual assistant, you'll never go back. I'll show you how to pinpoint the tasks you should be outsourcing right away and get you on your way to outsourcing them to amazing people within a few hours. </p><p>I'll also show you everything from finding your first task to outsource to building a team of amazing people who work night and day to ensure your business becomes more profitable every month without taking more of your time. </p><p><strong>We have over 850+ successful students in this course who are living your dream. </strong><br></p><p>Do you want life without this course or with this course?</p>", 
    "end_date": null, 
    "title": "The 30-Minute Quick Start Guide To Automating Your Business", 
    "price": "30.00", 
    "instructors": "Dillon Carter", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/117560_1c95_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-hire-your-first-virtual-assistant/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-09T20:06:35Z"
}