{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      Understanding Worker Classification is a crash course that will help business owners learn the factors used to determine whether a worker is an employee or independent contractor.  </p>  <p>  \t  The additional bonus resources included with the course are:</p><ul><li>Independent Contractor v. Employee Self-Assessment questionnaire (one for each test covered in the course: 20 factor, IRS Test and Economic Realities Test);</li><li>Independent Contractor Worksheet (one for each test covered in the course: 20 factor, IRS Test and Economic Realities Test); </li><li>5 Step Guide to Conducting your Self-Audit; </li><li><span></span>20 Factor Cheat Sheet with examples; </li><li><span></span>50 State Survey that sets forth the worker classification tests used in each state; and </li><li>IRS Independent Contractor Information Sheet </li><li>Form Independent Contractor Agreements for Single Projects and Recurring Projects</li></ul>  <p>There is about 2 hours of learning material including videos, power point presentation, and audio recordings. </p><p> I will discuss some background issues on worker classification and then dive right into the 20 factor test.  I will define each factor and discuss a comparison of two cases: one where the worker was determined to be an independent contractor and another where a class of workers were found to be employees.  That way, you can see real situations that these factors were applied and learn common \"do's and don'ts.\" After every 5 factors, I will do a brief recap and discuss important take-a-ways.  Once we conclude the 20 factor test, I also address the IRS Test and the Department of Labor Economic Realities test.  I will then go through next steps for your business and the 5 simple steps to conduct your self-assessment.  After that, I do a lecture where I discuss the key provisions of the form contracts that are included in the course and then I give a course wrap up.  </p>  <p>  \t  Worker classification is a hot issue for the federal government and state agencies which have increased audits in this area.  Understanding these issues will help your business get proactive and hopefully stop a problem before it starts.  </p>  <p>  \t  Please remember that the information in this course should be used as a general reference and you should not solely rely on this information for making legal decisions.  You should consult an attorney for employment law issues.  </p>", 
    "end_date": null, 
    "title": "Understanding Worker Classification Crash Course", 
    "price": "20.00", 
    "instructors": "Mary Hodges, Esq", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413689_1d1f.jpg", 
    "course_url": "https://www.udemy.com/understanding-worker-classification-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T01:14:42Z"
}