{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul><li>This course is written and presented by a senior manager with over 20 years of experience in leading large international teams;</li><li>The management system presented in this course has led multinational teams to global recognition and prestigious awards;</li><li>By enrolling in this course you will get access to 12 Videos (2 hours), 3 Case Studies, and 30 Question Assignments.</li></ul><p><strong>Are you interested? </strong></p><ul><li>in growing your business in a steady and sustainable way;</li><li>to do only what you can do best and outsource the rest, engaging experts all over the world in a reliable and predictable way;</li><li>in reducing your costs and gaining personal and organizational flexibility?</li></ul><p><strong>If your answer is to Any of the 3 questions is Yes – then this course is for You!</strong></p><p>Every day 81% of us work with people who are located <strong>somewhere else</strong>. Regardless if you are a small business with home office workers, mid-size company with offices in several cities or a big global corporation – most of your people work in Virtual Teams. <strong>Are you already a manager or member of a Virtual Team?</strong></p><p>Often people in Virtual Teams complain that тhey feel<strong> isolated and frustrated</strong>, and that delays projects and reduces quality. Managers complain that:</p><ul><li>Remote employees do not do what they should do, regardless how much effort you put to clarify the task, you are always surprised in the end;</li><li>It takes too long to finish a task;</li><li>Your team member just disappears and is not reachable for a week and then he just pops up as though nothing has happened;</li><li>In the end, your projects are delayed and sometimes completely fail.</li></ul><p><strong>Imagine there was a method that ensures:</strong> </p><ul><li>The job is done to your standards quicker than you expect;</li><li>The quality of the deliverables exceeds your expectation;</li><li>Your team members are fully reliable and highly reachable during working and non-working hours;</li><li>Your team members come up with own ideas, seek feedback and eagerly bring them to completion;</li><li>The Team Spirit of being one, powerful, winning Team urges you to get out of bed in the morning or stay there but eagerly engage with your Team.</li></ul><p><strong>The question is how to turn all the misunderstanding, hiding, and mediocrity into a burning desire to shine, take initiative, and reach Top Performance?</strong></p><p>In my 20 years practice as an international manager, I led large virtual teams spread across Europe, Africa, and Asia and have delivered fantastic results with them.</p><p><strong>For example:</strong></p><p>As a Project Manager of one 2-year project involving 20 countries in Europe</p><ul><li>We delivered it 3 months earlier;</li><li>We saved 250 000 EUR i.e. 15% of the budget;</li><li>We had a fantastic party with 30 people from all over Europe on Tenerife, Canary islands.</li></ul><p>As a Head of Function – leading a large department spread across 3 continents</p><ul><li>We had great business KPI's;</li><li>We had the best Employee feedback;</li><li>Won 2 Global Awards.</li></ul><p>I've crystallized all these 20 years of <strong>leadership experience </strong>in 10 Big rocks. This is the Method you are looking for. These are the 10 steps to reaching <strong>phenomenal performance</strong> with your virtual Team.</p><p><strong>This course contains:</strong></p><ul><li>12 Videos –one for each big rock and 2 additional bonus videos.;</li><li>3 case studies - real life examples from my practice;</li><li>90 minutes monthly Q&amp;A and discussion with the other Virtual Power Teams course alumni.</li></ul><p><strong>In the end of the course you will be able to:</strong></p><ul><li>Discover the real strengths of your team members;</li><li>Set optimal individual and Team Goals;</li><li>Establish Structured Communication in terms of rules, forums , feedback;</li><li>Turn your Team Diversity into an advantage;</li><li>Set a Winning Team Spirit.</li></ul><p><strong>As a result you will:</strong></p><ul><li>Deliver projects on time or quicker;</li><li>Reduce your cost;</li><li>Have happier Customers;</li><li>Grow your business through more outsourcing but in a reliable and predictable way;</li><li>Be Fit for the Future.</li></ul><p><strong>I bet we will work more and more virtually in the Future! Get this course and learn how to unite people despite the distance and cultural differences and deliver Top Business Results!</strong></p>", 
    "end_date": null, 
    "title": "Virtual Power Teams - grow your business in a reliable way!", 
    "price": "50.00", 
    "instructors": "Peter Ivanov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532054_b624_4.jpg", 
    "course_url": "https://www.udemy.com/virtual-power-teams-online-seminar/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T10:44:46Z"
}