{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>بإيجاز سنمر في برنامجنا التدريبي هذا على محطات هامة تتضمن التالي:</p><p>ما المقصود بالتحليل الوظيفي؟ وما هي متطلباته؟ وكيفية تحويل رؤية الشركة إلى مهام فردية وما المقصود بكلمة KASOCs أو \"مهام\" (معرفة مهنية أو أكاديمية + هرم الشخصية + إمكانيات والإنجازات + مهارات)، والبطاقة الشاملة للمنصب الوظيفي التي تتضمن: المسمى الوظيفي (Job Title) باللغتين العربية والإنجليزية ولأي إدارة يتبع. وقنوات التواصل (Channels of Communications)، من حيث تحديد المدير الذي ترفع إليه التقارير، والمشرف المباشر، وعلاقات العمل داخل القسم وبين الأقسام ومع خارج الشركة. وسلطات اتخاذ القرار لصاحب المنصب (Authorities) وأنشطة ومهام العمل الرئيسية المسندة لصاحب المنصب (Activities and Tasks) وأبعاد الوظيفة (Job Dimensions) من حيث المسؤوليات المادية والإدارية التي يتحملها صاحب المنصب ومواصفات شاغل الوظيفة (Job Specifications). </p><p>إضافة إلى معرفة الفرق بين التحليل الوظيفي وتحليل العمل، والخطوات العملية لإجراء تحليل العمل، وأهم نتائج التحليل، و140 سؤالا يمكن استخدامها في عمليات التحليل. </p><p>أما حول أهم الممارسات العالمية: فسنتعرف على استبيان تحليل المنصب Position Analysis Questionnaire (PAQ) وطريقة DACUM في التحليل الوظيفي واستبيان توصيف المنصب القيادي Management Position Description Questionnaire (MPDQ)، ونمذجة الكفاءة Competency Modeling، والتحليل وفق المجال الوظيفي Functional Job Analysis (FJA) وقاموس المسميات الوظيفية Dictionary of Occupational Titles (DOT) وتقنية تحليل الحوادث الهامة Critical Incident Technique (CIT).</p><p>ثم سنغوص ونتعمق في منظمة العمل العربية التابعة للجامعة العربية وكذلك شبكة المعلومات الوظيفية الأمريكية ومن خلالها سنتعرف على <strong>القدرات الوظيفية وفقاً لشبكة المعلومات الوظيفية الأمريكية وكذلك الاهتمامات الوظيفية والمؤهلات العلمية والدراية الوظيفية والمهارات الوظيفية وأنشطة العمل وسياقات العمل والقيم المصاحبة لشاغل المنصب ونطاقات الوظائف.. كل ذلك سيكون وفقاً لشبكة المعلومات الوظيفية الأمريكية</strong><strong></strong></p>", 
    "end_date": null, 
    "title": "الموارد البشرية: للمستشارين والخبراء والمدراء اللامعين", 
    "price": "50.00", 
    "instructors": "Sobhi Akbik", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609882_9266_2.jpg", 
    "course_url": "https://www.udemy.com/sobhi_akbik_hrm2/", 
    "currency": "USD", 
    "subject_name": [
        "Human Resources"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-12T11:22:32Z"
}