{"selfpaced": false, "topic_name": ["Design & Creativity"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                            \n                            \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                                    &gt; Design &amp; Creativity\n                                                            \n                            \n                                                \n                    \n                    \n                    Design is foremost a language.A language shared, talked and discussed by designers all over the world.Things, people and places we all know about.\r\nDesign 101 is a journey into contemporary design in which you will transform yourself and your everyday life into 101 projects.\r\nFor three months, you will develop basic design attitudes that will allow you to thrive in today’s world, while restoring your understanding of its mechanics. We live in a global community where the physical bits are slowly (and not so slowly) overlapped by social media. Design has become #design. Indeed, the use of new technologies has changed the teaching and, by the same token, the nature of the past; the past is being renewed. Herein lies the conceptual hinge of Design 101: a new way to learn a new design.\r\nTo do so, we will collectively explore the tools of today (such as this MOOC platform) to step into a fantastic voyage through time and space, in which we are all absolute beginners.\r\nHow?\r\nDesign is everything. Design is objects, buildings, sports, games…our lives.Johan Cruyff, a very famous footballer and fantastic designer, once said:\r\n“I never practice tricks. I play very simply. That's what it's all about. Playing simple football is the hardest thing.”\r\nvery simply\r\nEveryday, you will receive a special package from a different place along our journey. The package will introduce objects, characters and happenings that are intertwined with the narrative of the course.\r\nEach bundle will include 2 main elements:\r\n\r\nAn animated postcard announcing the day’s brief.\r\nA letter exploring subjects in depth with the use of links, books, movies, music and more.\r\n\r\non a weekly basis\r\nEach week, there is a new unit consisting of seven postcards/briefs outlining a few simple activities to trigger your imagination. From 15 minutes to one hour of work per day at the most. The quicker, the better!\r\nOn Mondays, you get an overview of the week and a quiz to complete.Then, following our input, you start working.\r\nBy Sunday, you will upload images of what you made during the week.\r\nYou will refer, think and create a lot of different things. Not easy, but surely fun!\r\nOur special trip will end with a three-day festival: a special event in a special place to exhibit your work to the public and get to know your travel mates.\r\nforum: questions and answers\r\nDoubts, ideas, whatever comes to mind. It is a perfect place to get entangled into discussions and become a true actor within the community.\r\nIn the design world, questions are much more interesting than answers. This is why the best questions asked in this forum will be redirected to a Design 101 e-book, to be printed at the end of the course.\r\nextra! extra! encyclopedia!\r\nIf you are of the curious kind, we have a special page with all the people, places, things mentioned throughout the course. We could consider it our mini-encyclopedia.\r\nOnce we have a shared vocabulary/language, things become meaningful. Conversations start up quickly and flow nicely.\r\nLike any other language, “design” is in constant change. Our mini-encyclopedia is a great foundation upon which to build your own collection of references.\r\nLearning objectives\r\nDesign 101 will help you understand:\r\n\r\nHow the world looks through the special lenses called \"design\".\r\nWho shares your visions and ideas (who could collaborate with you in the future).\r\nHow a community works: its behavior and potential.\r\nWhat skills and attitudes you have: their merits and limitations.\r\n\r\nPrior knowledge\r\nNo prior knowledge is required. If you have a lot of prior knowledge, it might make the learning process more difficult, but don’t worry, no one is perfect. As we said, if we talk about contemporary design, we are all \"absolute beginners\"!\n\n                                            Syllabus\n                        The various things to do (so-called “hands-on” activities) will be divided into 14 units, one per week.\r\n\r\nIntro: Acquaint yourself with the course’s dynamics.\r\nMyself: Represent one's self.\r\nMy diary: Learn about the design process by creating a very simple object.\r\nKitchen Stories: Become an expert at something and develop basic social skills.\r\nVisiting You: Look back at what we have done so far.\r\nIt’s alive: Design as a garden.\r\nVoyage into my room: Understand interior spaces, plans and measures.\r\nMaking things: Get familiar with shapes, colors, materials. Plan a series.\r\nChristmas break: Lots of greetings + some more.\r\nZoom out (the city): Observe the public space in a new way (and map it).\r\nTelling stories: Form doesn’t follow function. Form follows fiction.\r\nDressing people: Understand what “custom-made” really means.\r\nRoad to nowhere: Learn to become self-sufficient.\r\nReady to show? Ready to exhibit?\r\n\n                                    ", "end_date": "2014-01-06T00:00:00Z", "title": "Design 101 (or Design Basics)", "price": 0, "instructors": "Stefano Mirti, Giovanni Pasca Raymondi and Lucia Giuliano", "institution_name": [], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://iversity.org/courses/design-101-or-design-basics", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2013-10-28T00:00:00Z"}