{"selfpaced": false, "topic_name": ["Design & Creativity"], "description": "\n\n                    \n                    \n                    In this project-centered course*, you will create a content-rich infographic on a topic of your choice. You might choose to create a visual representation of data from the world of sports, entertainment, politics, or science, to explain a business trend or environmental issue, or even to present a theme or development from your personal life. Your finished infographic will engage your target audience and convey information clearly through effective use of design elements such as typography, color, and structure.  Whether you’re a graphic designer, a writer or the intern in the department, you’ll learn:  • what an infographic is and what makes a good one • how to work within your limits • how to work with a team (if you have one)  • why infographics are effective  • techniques for spotting data in stories • six valuable steps for planning an effective infographic  • how to use and make some of the building blocks of infographics: maps, charts and flow charts  • ways data can be visualized to clarify it and give it meaning  • how to effectively design a good infographic by effectively using elements like type, color and an underlying grid structure • some free or cheap, online tools for making various kinds of infographics  As you work on your project, you’ll learn more about why infographics are effective, what makes a good infographic, and how to plan and design an infographic for maximum impact. You’ll explore various approaches to data visualization, and you’ll practice creating visualizations like maps, charts, flow charts, and simple drawings in a free version of Adobe Illustrator.   What you’ll need to get started: This project-based course is aimed at anyone interested in understanding, designing, and using infographics - from students and hobbyists to professional graphic designers.   We’ll use Adobe Illustrator for some components of the project. If you don’t have access to the full version of Illustrator,you can download a free version at www.Adobe.com/Illustrator.   *About Project-Centered Courses: Project centered courses are designed specifically to help you complete a personally meaningful real-world project, with your instructor and a community of like-minded learners providing guidance and suggestions along the way. By actively applying new concepts as you learn, you’ll master the course content more efficiently; you’ll also get a head start on using the skills you gain to make positive changes in your life and career. When you complete the course, you’ll have a finished project that you’ll be proud to use and share.\n\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Design and Make Infographics (Project-Centered Course)", "price": 0, "instructors": "Karl Gude", "institution_name": ["Michigan State University"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/infographic-design", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-02-15T00:00:00Z"}