{"selfpaced": false, "topic_name": ["Design & Creativity"], "description": "\n\n                    \n                    \n                    Graphic Design is all around us! Words and pictures—the building blocks of graphic design—are the elements that carry the majority of the content in both the digital world and the printed world. As graphic design becomes more visible and prevalent in our lives, graphic design as a practice becomes more important in our culture.\n\nThrough visual examples, this course will teach you the fundamental principles of graphic design: imagemaking, typography, composition, working with color and shape... foundational skills that are common in all areas of graphic design practice. I don't just want you to watch a video of someone talking about design, I want you to MAKE design! If you want to be a designer you have to be a maker, a communicator, so this course will offer you lots of opportunities to get your hands dirty with exercises and with more practical projects.\n\nAt the end of this course you will have learned how to explore and investigate visual representation through a range of image-making techniques; have understand basic principles of working with shape, color and pattern; been exposed to the language and skills of typography; and understand and have applied the principles of composition and visual contrast. If you complete the course, along with its optional (but highly recommended) briefs, you will have a core set of graphic design skills that you can apply to your own projects, or to more deeply investigate a specialized area of graphic design.\n\nTo succeed in this course you will need access to a computer. You can complete this course without one but it will be tougher. Access to, and a beginner's level knowledge of Adobe Creative Suite programs, such as Illustrator, Photoshop and InDesign will help you, especially if you want to complete the optional briefs.\n\n                                            Syllabus\n                        Week 1: Fundamentals of ImagemakingThis week we are going to look at how images function in terms of conveying denotative and connotative messages, I'll show you a range of analog and digital imagemaking techniques and discuss how they work. In the first peer review assignment you'll create your own series of images, experimenting with formal techniques. Later, you'll have the opportunity to rework those images to enhance their ability to communicate an idea through connotation in an optional assignment: give it a try, it'll help you develop your communication skills as well as your formal skills!Week 2: Fundamentals of TypographyThis week we are going to look at typographic terminology and the basic rules for creating typography. I'll show you a range of tips and techniques for working with type, in both a functional and expressive manner, and you'll find out about the process involved in making and controlling typography. This week you'll complete a quiz to make sure you understand the language of typography–this is required. I also highly recommend you complete the two optional peer review assignments. In the first assignment you'll create your own typographic monogram, and you'll use that as a central element in designing a typographic business card in the second assignment. Give them a try, they are the place where you can demonstrate and apply your formal skills, and the place where you get to play with type!Week 3: Fundamentals of Shape and ColorThis week we are going to look at how designers work with shape and color as their fundamental building blocks. You'll learn about visual contrast, color, rhythm and pattern in design. I'll be showing you the process involved in making an abstract design from shapes, and how to use that element to create a repeating pattern design. You'll be completing a quiz (required!) to make sure you understand how visual contrast and color work, and I also highly recommend you complete the two optional peer review assignments. In the first assignment you'll create your own simple and complex design motifs, and you'll use them as the central elements in designing a repeating pattern in the second assignment. The assignments are optional, but they are the place where you get to demonstrate and apply your formal skills, so well worth taking the extra time to complete!Week 4: Fundamentals of CompositionThis week we are going to look at how designers work with visual contrasts, cropping, hierarchy and direction in single images and complex compositions. You'll find out how to control and use scale, weight, direction, texture, and space in a composition, and how to compose work that ranges from the complex to the minimal. In the first peer review assignment you'll create your own abstract compositions that demonstrate your knowledge and control of visual contrast. In the final optional assignment, you can use all your skills from the entire course to create experimental compositions in the form of a poster for a mythical band. This last project is optional, but I strongly suggest you try it out, it'll let you grow and apply your design knowledge and really enjoy and express yourself in your design work! \n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Fundamentals of Graphic Design", "price": 0, "instructors": "Michael Worthington", "institution_name": ["California Institute of the Arts"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/fundamentals-of-graphic-design", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}