{"selfpaced": true, "topic_name": ["Design & Creativity"], "description": "\n\n                    \n                    \n                    ¡Claro que todos podemos potenciar nuestra creatividad a través de procedimientos, rutinas y protocolos sencillos! El participante desarrollará su talento creativo para aportar soluciones originales y generar ideas y productos en el ámbito en que se desenvuelve y en la vida cotidiana.\n\n                                            Syllabus\n                        Acerquémonos a la CreatividadEn este módulo nos introducimos en el fascinante tema de la creatividad: revisaremos el concepto, veremos cuáles son las características de las personas creativas, podremos identificar las facetas de la innovación que nos caracterizan y estudiaremos si la creatividad es innata o se desarrolla a través de entornos enriquecidos.¿Qué detiene y qué promueve la creatividad?Algunos hábitos y conductas que hacemos a diario  pueden impedir el desarrollo de un entorno creativo para promover nuestra originalidad y fluidez de ideas. Estar atentos a ellos y potenciar los que desarrollan la creatividad depende de nosotros. En estas 8 lecciones nos introduciremos al “lado oscuro” que intenta bloquear nuestra creatividad y la de quienes nos rodean, pero también a formas de ver la realidad y de comportarnos que facilitan que seamos más creativos.Estrategias para ser más creativosEn este módulo estaremos revisando algunas estrategias muy efectivas para generar pensamiento divergente y para construir soluciones, ya sean ideas, productos o servicios. Algunas tienen que ver con un proceso individual, y también estaremos explorando el proceso de creación a partir de la lluvia de ideas (incluso presenciaremos el surgimiento de un cuaderno de notas muy especial). Para quienes sientan algún pequeño tropiezo, también tendremos un video que debe abrirse en caso de emergencia creativa.\nHeurísticas y modelosEste módulo que permite entender la función de las heurísticas o caminos cortos para solucionar problemas, así como un modelo muy útil para generar y evaluar soluciones creativas: el de Osborn y Parnes. Termina con una visita al campo de design thinking, un movimiento relevante en el área de la creatividad.Algunos Elementos SorprendentesEste módulo nos permite explorar cómo frasear problemas de forma que sea más fácil solucionarlos, la relación entre humor, estado de ánimo y creatividad, así como algo que parece muy contraintuitivo: el valor positivo que tienen las restricciones cuando buscamos soluciones creativas.\n                                    ", "end_date": "2016-07-26T00:00:00Z", "title": "Ser más creativos", "price": 0, "instructors": "Guadalupe Vadillo", "institution_name": ["Universidad Nacional Autónoma de México"], "commitment": "4-6 hours", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/creatividad", "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-21T00:00:00Z"}