{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Join the 10 Day Meditation Challenge!</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Improve your sleep, energy and mood</li>  \t<li style=\"\">Increase your focus, memory and concentration</li>  \t<li style=\"\">Reduce your stress and anxiety</li>  \t<li style=\"\">Discover the joy of <em style=\"\">daily </em>meditation</li>  \t<li style=\"\">Enjoy benefits in all areas of life</li>  \t<li style=\"\">Convenient, simple routine</li>  \t<li style=\"\">Develop your own meditation practice</li>  </ul>  <p style=\"\">  \t <strong style=\"\">This 10 day challenge is exactly that &ndash; a challenge. </strong>We challenge you to follow along for 10 days and meditate everyday for five to ten minutes. Yep, that&#039;s it. Do-able for anyone...even the busiest people!  </p>  <p style=\"\">  \t              The idea is to get you started in the habit of meditating <strong style=\"\">everyday</strong>.<strong style=\"\"> <br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t       After ten days of meditation you will already see the benefits in your health and your life. Most people continue meditating after completing the challenge as life just feels so much better! Challenge yourself for ten days. Better yet, take the challenge with a friend or family member! It&#039;s simple to do and a great way to try meditation for the first time. Use it to start your day feeling vibrant, grounded and calm.  </p>  <p style=\"\">  \t<strong style=\"\">The daily meditations in this course are audio files (not video). </strong>This  is intentional as it allows you to listen to the meditation and &#039;go  within&#039;. The first two lectures include video as they are an  introduction and overview to the meditation experience. After that, you  will be listening to audio for each of the ten days. We suggest you close your eyes as you listen so that you can fully relax. You can download the mp3 audio files to your ipod, smartphone or other mobile device and listen to them anywhere!  </p>  <p style=\"\">  \t        For optimal sound use headphones.  </p>  <p style=\"\">  \t                 Each day you will experience a different guided audio meditation. There are many styles of meditation and the trick is finding the one that works best for you. Some people prefer visualization while others prefer mantras or guided body meditations. You will experience ten <em style=\"\">different </em>meditations in this challenge. Each one explores a different &#039;style&#039; or technique so by the end you can decide which meditation works best for you. They are all very simple meditations meant to introduce you to the concept of meditation.  </p>  <p style=\"\">  \t<strong style=\"\">Make sure to press the &quot;HD&quot; button on Udemy video player to watch the first two videos in highest resolution.</strong>  </p>  <p style=\"\">  \t          Feel free to download the mp3 audio files and continue meditating on your own after the ten days. Load them on your mobile device and take them with you!  </p>  <p style=\"\">  \t          The meditations are convenient, easy-to-do and VERY relaxing.  </p>  <p style=\"\">  \t     If you have questions, please feel free to email us at TenDayMeditation@gmail.com  </p>  <p style=\"\">  \t                 Enjoy the journey!  </p>", 
    "end_date": null, 
    "title": "10 Day Meditation Challenge", 
    "price": "20.00", 
    "instructors": "Jeffrey Chand", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/130508_b370_5.jpg", 
    "course_url": "https://www.udemy.com/10-day-meditation-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-07T17:36:18Z"
}