{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t                        Are you ready to<strong style=\"\"> look in the mirror and smile?</strong> If your answer is “Heck Yes!”, this journey is for you. <em style=\"\">21 Days to Love Your Body</em> is a beautiful journey designed to help you learn to <strong style=\"\">eat mindfully</strong> and to guide you to a <strong style=\"\">healthier relationship with food and with your physical body</strong>.  </p>  <p>  \t<em style=\"\">21 Days to Love Your Body</em> uses guided meditations to welcome <strong style=\"\">positive growth</strong> and change into your life. As you take this journey you leave darkness and the heavy cloud of <strong style=\"\">self-criticism far behind you.</strong> You become empowered to work <em style=\"\">with</em> your body to create your healthiest self and to welcome vitality into your life.  </p>  <p>  \t                        Melody Litton walks beside you on your path, helping you to stay focused on the goal of not only <strong style=\"\">welcoming your ideal weight,</strong> but also creating a lifelong friendship with your body. Whether you want to <em style=\"\"><strong style=\"\">lose weight</strong></em>, gain weight, or simply <em style=\"\"><strong style=\"\">feel fantastic</strong></em> in the body you have, please <em style=\"\">enroll today and begin your journey</em>.  </p>  <p>  \t                        This 21 Day journey will be one you will want to repeat again and again; each time finding yourself rising a little higher and stretching your smile just a bit wider.<em style=\"\"> You will be amazed at the positive changes that come with such a small investment of time. </em>  </p>  <p>  \t                        The class consists of 8 video clips of instruction and insight as well as 16 <strong style=\"\">powerful guided meditations</strong>; each day guiding you to greater light and love.  </p>  <p>  \t<em style=\"\">Begin today!</em> We&#039;re so certain this course will bring you <strong style=\"\">positive and lasting change</strong> that we offer a <em style=\"\">30 Day Money Back Guarantee. </em>Sign up now and walk this path toward healing and love.  </p>", 
    "end_date": null, 
    "title": "21 Days to Love Your Body- Meditations for a Healthy Weight", 
    "price": "45.00", 
    "instructors": "Melody Litton", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417422_d4b4_3.jpg", 
    "course_url": "https://www.udemy.com/love-your-body/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T16:27:36Z"
}