{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">JUST UPDATED 1/1/2105 with 7 New Lectures!</strong>  </p>  <p>  \t<strong style=\"\">Explore and experience a unique journey through your 7 chakras</strong>. The chakras, according to the ancient yogic texts, are vibrating energetic centers that exist in each of us. The balance of these energy centers is essential to our health, relationships and spiritual fulfillment.  </p>  <p>  \t<strong style=\"\">In this course we will dive deep into the 7 chakras to heal, balance and transform your life!</strong>  </p>  <p>  \t                              The benefits of working with the chakras are endless. By simply focusing on each chakra you will have the tools to:  </p>  <ul style=\"\">  \t<li>Manifest a more grounded and peaceful life. </li>  \t<li>Assist yourself in receiving and giving love. </li>  \t<li>Blossom your self-esteem. </li>  \t<li>Inspire fluid communication.</li>  \t<li>Tap directly into your natural intuitive abilities. </li>  \t<li>Find a clearer life purpose.  </li>  </ul>  <p>  \t                Enjoy <em style=\"\">lifetime access</em> to 7 &quot;power&quot; video meditations that will guide and inspire you through each of the chakras.  </p>  <p>  \t                            In the course, you will:  </p>  <ul style=\"\">  \t<li>Have the opportunity to explore every chakra point through breathtaking photos, guided visions of archetypal imagery and healing scripts accompanied by soothing spiritual beats and grooves.  </li>  </ul>  <ul style=\"\">  \t<li>        Learn to easily create your own sacred space for chakra work.</li>  \t<li>Chant the ancient mantras.</li>  \t<li>Absorb lessons on the mechanics of the chakras in your body, where they are located, and what they mean for you in your life.  </li>  </ul>  <ul style=\"\">  \t<li>            Discover your own personal chakra balance through the course&#039;s downloadable ebooks, worksheets and other rich supplementary material to support your individual journey.</li>  </ul>  <p>  \t                          No experience of any kind is necessary for this course, simply make yourself comfortable in a quiet space and listen to the meditations provided.  </p>  <p>  \t                You can listen and explore one chakra a day for seven days, or take this course entirely at your own pace!  </p>  <p>  \t                          Come back again and again to the guided meditations when you need them, and work with the chakras that need it most.  </p>  <p>  \t                          There is a 100% satisfaction guarantee or your money back.  </p>  <p>  \t<strong style=\"\">Click the blue &quot;Take This Course&quot; button now (on the top right of this page) to sign up and immediately begin your chakra journey!  </strong>  </p>", 
    "end_date": null, 
    "title": "7 Days to Awakening: Guided Meditations to Align the Chakras", 
    "price": "20.00", 
    "instructors": "Lauren Saraswati Zavlunov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332302_4803_2.jpg", 
    "course_url": "https://www.udemy.com/awakening/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T02:06:16Z"
}