{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t This course is designed to get you experiencing the benefits of meditation right away, so you can reduce stress and operate at your highest potential. Many people have tried meditation but had trouble quieting their mind that is because one style of meditation does not work for everyone. That is why we are offering you 7 different ways to meditate, so you can find the way that works for you!!  </p>  <p style=\"\">  \t You will receive four informational videos that will prepare you for your meditation practice:  </p>  <p style=\"\">  \t 1. What is meditation?  </p>  <p style=\"\">  \t 2. How to prepare for your meditation challenge including: posture, breath and relaxing the body.  </p>  <p style=\"\">  \t 3. Information on the 7 different styles of meditation in this challenge.  </p>  <p style=\"\">  \t 4. How to use this challenge &amp; these meditations.  </p>  <p style=\"\">  \t Once you are ready to start the challenge you will be able to experience seven different types meditation so you can start receiving benefits and discovering what style works for you! You will receive 7 different popular styles of meditation including:  </p>  <p style=\"\">  \t Day 1: Guided Meditation Audio  </p>  <p style=\"\">  \t Day 2: Love and Kindness Meditation Audio  </p>  <p style=\"\">  \t Day 3: Kundalini Yoga and Meditation Video  </p>  <p style=\"\">  \t Day 4: Moving Meditation Video  </p>  <p style=\"\">  \t Day 5: Sound Healing Meditation Audio with Crystal Bowl Music  </p>  <p style=\"\">  \t Day 6: Silent / Mindfulness Meditation Audio  </p>  <p style=\"\">  \t Day 7: Max Meditation Audio  </p>  <p style=\"\">  \t For optimal results use these meditations daily for 7 days. This course can be extended to 21 days to create a new habit of daily meditation! You can complete this course in 7 days or less! Receive access to over 90 minutes worth of high quality content and meditations for life! Many of the meditations are 10 minutes or less- even if you are busy you can take this time each day for yourself!  </p>  <p style=\"\">  \t Feel confident knowing that your fun and down to earth urban meditation guides, Hillary Faye and Sarah Hauch have 20 years’ experience teaching meditation!  </p>  <p style=\"\">  \t If you find that your mind is always racing and you are feeling overwhelmed with work, family, life and obligations meditation is the answer you are searching for. If you feel stressed, tired or lack of motivation this challenge is for you!  </p>  <p style=\"\">  \t If you are curious and don&#039;t know where to start join our mindfulness revolution now! Sarah and Hillary will walk you through meditation step by step and help you discover what style of meditation works best for you! Nothing changes in your life unless you do, if you are ready to start feeling better, sign up now! You can do this!  </p>", 
    "end_date": null, 
    "title": "7 Day Urban Meditation Challenge", 
    "price": "40.00", 
    "instructors": "Urban Meditation Guides", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/179376_d7e4_2.jpg", 
    "course_url": "https://www.udemy.com/7-day-urban-meditation-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-09T14:38:15Z"
}