{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t     &quot;A Beginner&#039;s Guide to Mindful Meditation&quot; provides an introductory, progressive, structured course in mindfulness and mindful meditation technique.  </p>  <p style=\"\">  \t                 Primarily practical in nature, the course aims to enable those new to mindful meditation to experience and reflect on one of the key techniques (awareness of breath) and its benefits.  </p>  <p style=\"\">  \t                 You are introduced to the concept of mindfulness, given an overview of evidence into the effectiveness of mindful meditation as a technique, prior to undertaking a series of three mindful meditation exercises focussing on the breath.  The meditations are progressive in nature, beginning with a fully guided meditation and moving to an unguided meditation as you improve your meditation technique and practice.  </p>  <p style=\"\">  \t                 The course features six meditation audios in three pairs (each with and without a background seascape) - two fully guided, two partially guided and two unguided.  At the end of each meditation you will be given the opportunity to reflect on your experience of the technique, as well as being offered guidance on common questions surrounding their practice.  </p>  <p style=\"\">  \t                 The course makes use of a variety of audio, visual and kinaesthetic tools to enhance the achievement of your course aims, whilst providing opportunity to reflect and develop your ability as you move towards unguided mindfulness meditation.  </p>  <p style=\"\">  \t                 By the end of the course you will be able to meditate (unguided), reflect on your own practice of this technique and understand its benefits, including the workings and tendencies of your own mind (increased awareness).  </p>", 
    "end_date": null, 
    "title": "A beginners guide to mindfulness meditation", 
    "price": "20.00", 
    "instructors": "Julian Illman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/174432_9e1e_6.jpg", 
    "course_url": "https://www.udemy.com/a-beginners-guide-to-mindful-meditation/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-28T15:22:08Z"
}