{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">Introducing The Tappermation Advanced Wealth Training Series</strong>  </p>  <p>  \t                        Are your self limiting thoughts surrounding money holding you back? Would you like to learn how to reprogram your thoughts surrounding money in just 30 minutes a day?  </p>  <p>  \t                        If you said yes, this course will teach you the fastest way to retrain your brain into the belief that you are wealthy beyond your wildest dreams. As you follow this program for the recommended 30 days you will notice an increase in your confidence, and begin to attract the financial benefits you have been asking for.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t            Question: </strong>Which statement feels more true to you at this time?  </p>  <ul style=\"\">  \t<li> I never have enough money</li>  \t<li> I always have more than enough for my needs</li>  </ul>  <p>  \t<br style=\"\">  \t        If you picked the latter then this course is for you. The Meditation for Wealth course utilizes 4 proven techniques for superior thought reprogramming which will help remove limiting beliefs from your consciousness thus helping you to attract the financial benefits you have been asking for.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t      Why Take This Course?</strong>  </p>  <p>  \t                Tappermation is the ONLY meditation program of it&#039;s kind, utilizing proven techniques for fast and simple results, while using the program you will be practicing;<br style=\"\">  </p>  <ul style=\"\">  \t<li>Binaural Beats and Isochronic Tones for hyper-suggestion</li>  \t<li>7 Body Tapping Points to clear energy blockages &amp; reprogram thoughts</li>  \t<li>20 power affirmations to replace your current belief system</li>  \t<li>Alpha &amp; Theta waves to induce deeper states of meditation</li>  </ul>  <p>  \t              Once you have followed the instructional portion of this course you will have access to a 30 day guidebook for download which includes daily visualization exercises to keep you on track for a 30 day period, simply listen to your Tappermation for Wealth AM and PM sessions every day and follow the instructions in your guidebook.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t                                        About Body Tapping</strong>  </p>  <p>  \t                                        You will be tapping on your body while using this program in both morning and evening sessions, tapping is very simple and will help you to;  </p>  <ul style=\"\">  \t<li>Remove negative emotions</li>  \t<li>Clear energy blockages</li>  \t<li>Relieve stress</li>  \t<li>Calming effect</li>  \t<li>Increase your creativity</li>  \t<li>Create better sleep habits</li>  \t<li>Increase confidence</li>  \t<li>Reprogram thought patterns</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">About Brainwave Therapy</strong><br style=\"\">  \t<br style=\"\">  \t                                       This program uses isochronic tones and binaural beats in the background of the audio, these sounds help guide your mind into a very receptive, absorbent state and can be used for effective self-hypnosis, reprogramming the sub conscious and accelerated learning.  </p>  <p>  \t                                      These sounds also allow for increased release of the neurotransmitter Serotonin which is popularly thought to be a contributor to feelings of well-being and happiness.  </p>  <p>  \t                                      Increasing your alpha and theta brain waves automatically leads to decreasing your fears, tension, stress, nerves, and anxiety., will put you in a calm emotional state feeling “content” and centered.  </p>", 
    "end_date": null, 
    "title": "Advanced Meditation Series For Creating Wealth", 
    "price": "20.00", 
    "instructors": "Katherine Schneider", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311854_9ec3_8.jpg", 
    "course_url": "https://www.udemy.com/tapping-into-wealth/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T23:31:08Z"
}