{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>****** Curso actualizado*****</strong></p>\n\n<p><strong>****** Aprovecha el precio especial pronto subirá ******</strong></p>\n\n<p>Aprende de forma progresiva y superfácil la práctica de la meditación. Evitarás las dificultades que se suelen encontrar a la hora de meditar porque te voy a enseñar como resolverlas incluso antes de que esas dificultades  aparezcan. Sabrás que hacer exactamente para sacar el máximo partido a tu meditación.</p>\n\n<p>Si ya practicas la meditación y encuentras que es difícil, entonces necesitas mi ayuda. Voy a enseñarte como facilitar el proceso, te darás cuenta de como tus creencias limitantes te condicionan para meditar y que es lo que puedes hacer para resolverlo fácilmente.</p>\n\n<p>Obtendrás una vida más feliz, más plena, con menos estrés y más salud. Se recomienda seguir el curso e invertir 1 semana de práctica por cada técnica de meditación, es decir un total de 4 semanas. Este curso va a la raíz de la meditación, a las 4 técnicas más importantes.</p>\n\n<p><strong>Domina el arte de meditar con suma facilidad. Meditarás como si lo hubieras hecho toda la vida.</strong></p>\n\n<ul><li>Aprende que es meditar.</li><li>Aprende como meditar con facilidad.</li><li>Consigue meditar en muy poco tiempo.</li><li>Aprende cuantos tipos de meditación existen.</li><li>Aprende 4 técnicas distintas de meditación.</li><li>Aprende a potenciar tu meditación con el uso de Mudras.</li><li>Aprende como usar la meditación para conseguir aquello que te propongas.</li></ul>\n\n<p><strong>Mucho más que meditar, diseña y crea tu vida.</strong></p>\n\n<p>La Meditación es una práctica milenaria, para practicarla no necesitas un grado, ni un master, sin embargo la mayoría de personas la encuentra difícil de practicar. Siguiendo mis indicaciones conseguirás meditar fácilmente y en muy poco tiempo.</p>\n\n<p>Una vez empieces a meditar comenzarás a notar los beneficios que aporta la meditación. Existen recientes estudios que demuestran su utilidad en múltiples enfermedades físicas y también a nivel emocional y psicológico. Tendrás más serenidad, reducirás el estrés y poco a poco esto se verá reflejado en todas las áreas de la vida. Te sugiero que veas el avance del video sobre beneficios de la meditación para tener una idea más clara todo lo que conseguirás.</p>\n\n<p>Yo recorrí el camino de aprender a meditar hace muchos años y puedo evitar que cometas los errores típicos. Seré tu guía en este increíble viaje de autoconocimiento.</p>\n\n<p>Con la meditación en los momentos difíciles estarás más sereno y con la mente clara para reaccionar de forma rápida, inteligente y optima. Disfrutarás más de la vida porque habrá cambiado tu perspectiva.</p>\n\n<p>Abordaremos que es Meditar de una forma clara, veremos que es lo que dice la ciencia, los falsos mitos, indicaciones para facilitar la meditación, como nos afectan en la meditación las creencias limitantes, etc.</p>\n\n<p>Te mostraré cuales son los principios o indicaciones que debes seguir para tener una práctica satisfactoria y fácil. La solución es mucho más fácil de lo que parece.</p>\n\n<p>Consigue Meditar en muy poco tiempo desde el momento en que empiezas te sugiero que dediques una semana a cada tipo de meditación. En 4 semanas habrás conocido y practicado las 4 técnicas que son la base de todos los tipos de meditación.</p>\n\n<p>Conoce los distintos tipos de meditación existentes, practícalos y elige con el que te sientes más cómodo.</p>\n\n<p>Como Bonus y totalmente gratis voy a enseñarte que son los mudras y como puedes usarlos para mejorar tu vida en todos los aspectos. Podrás mejorar la abundancia, la salud, facilitará la materialización deseos, tanto sencillos como algunos más complicados. Podrás usar los mudras para mejorar la meditación y otros aspectos de ti.</p>\n\n<p>Combinando meditación y mudras podrás definir que cosas quieres en tu vida.</p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Aprende a Meditar: Meditación Superfácil Desde el Primer Día", 
    "price": "20.00", 
    "instructors": "Juan García", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766346_2230.jpg", 
    "course_url": "https://www.udemy.com/meditacion-facil-para-todos/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T09:08:30Z"
}