{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t          Learn how to use different colors in your daily life that you will need to achieve optimal health benefits.  </p>\n\n<p>  \t<strong>Build a strong knowledge of Colour Therapy and how you can apply it in your everyday life.</strong>  </p>\n\n<p>  \t<strong>∙</strong>Learn the different associations, attributes and benefits to each color  </p>\n\n<p>  \t<strong>∙</strong>Learn methods to apply color to your body in an attempt to heal those parts of your body suffering under physical, emotional, or spiritual damage  </p>\n\n<p>  \t<strong>∙</strong>Learn a quick and easy Colour therapy meditation technique  </p>\n\n<p>  \t<strong>∙</strong>Learn what parts of the body relate to certain colors  </p>\n\n<p>  \t<strong>Healing methods everyone must know for optimal health</strong>  </p>\n\n<p>  \t          Learn a great deal about color and how to utilize this free resource for health and well-being. One of the things you will learn is to use light in the form of color to balance \"energy\" wherever your body is lacking, whether it be on a physical, emotional, spiritual, or mental level.  </p>\n\n<p>  \t          Master skills using various colour healing techniques; including colour breathing, meditation and colour visualizations for health benefits.  </p>\n\n<p>  \t          There are two ways you can practice Colour Therapy; as a stand-alone treatment or in conjunction with most other related therapies, such as aromatherapy, crystal healing, stress consultancy and counseling.  </p>\n\n<p>  \t          This course is perfect for anyone looking to improve their quality of life and enhance their life force energy.</p>\n\n<p>  \t<strong>Contents and Overview</strong>  </p>\n\n<p>  \t          This course contains 15 lectures and 1 hour of content. It is designed for anyone who wishes to improve their quality of life.  </p>\n\n<p>  \t          This course covers the importance of implementing more color into your everyday life. You will learn to address the root cause of your condition or illness instead of just masking the symptoms. You will walk away with significant knowledge and skill sets on what colors to wear and eat to obtain maximum health benefits.  </p>\n\n<p>  \t          During this course, you will participate in a meditation exercise. No materials needed. The more you practice, the more it will become second-nature to implement color into your life and reap great results without even thinking about it.  </p>\n\n<p>  \t          Upon completion, you will gain a strong understanding on how the use of color can enrich your life. Students completing this course will be able to enjoy the healing properties of color anytime, anyplace and anywhere, for free. Also, you will receive a verifiable certificate of completion upon finishing the course.  </p>", 
    "end_date": null, 
    "title": "Colour Therapy Meditation: Restore your Health with Color", 
    "price": "20.00", 
    "instructors": "Susanna K Green", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408120_0471_3.jpg", 
    "course_url": "https://www.udemy.com/colour-therapy-heal-your-body-now/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-30T02:32:27Z"
}