{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course, 'Create Optimal Health Through Eastern Practices' helps you dive into the 4 major segments of living a less stress free, pain free, and happier life. In this course, you'll learn to building good habits through: </p><ul><li>Moving your body to increase internal energy </li><li>Nourishing and fueling your body with the right types of foods</li><li>Building a spiritual practice to help you feel relaxed and stress free </li><li>Cultivating positive and healthy social habits</li></ul><p>This course is built to help people find alternative ways to reduce stress, emotional or physical pain, and rebuilding their body through traditional eastern practices. This course give you an introduction to the five primary organs in our body, understanding of Qi, and how and why we get sick.</p><p>This course will give you instructional videos and lectures on how to increase your energy through movement. You will also receive guidance in determining what foods should be consumed. </p><p>You will also get 3 practices that will help you become more spiritual. These videos are designed to help start these practices without any confusion. The last segment of the course will help you create positive and healthy habits. These habits are in exercising, eating, and creating that balance between work and rest. </p><p>So what are you waiting for? Let's get started! </p><p><br></p>", 
    "end_date": null, 
    "title": "Create Optimal Health Through Eastern Practices", 
    "price": 0, 
    "instructors": "Harshil Patel", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/731872_8e10.jpg", 
    "course_url": "https://www.udemy.com/create-optimal-health-through-eastern-practices/", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-17T21:17:31Z"
}