{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>¿Por qué estoy impartiendo este curso?</strong></p><p>Mi nombre es Silvio Raij y practico la Meditación desde hace más de 17años. Mi formación original ha sido en la meditación Raja Yoga, la cual perfeccioné durante muchos años en la sede de la Escuela Espiritual Mundial Brahma Kumaris, en Rajasthan, India. También me he perfeccionado en el Mindfulness realizando mi certificación en Mindfulness Tools y Practicum MBSR el año 2015 con la Universidad de Massachusetts. Creo en el ser humano como el origen de todo cambio positivo en el mundo. <strong><em>\"Cuando nosotros cambiamos el mundo cambia\" </em></strong>y esa es la razón principal que me lleva a compartir mis conocimientos con los demás. </p><p><strong>¿De qué se trata el Curso?</strong><br></p>Durante las siguientes 8 clases estaremos desarrollando los cimientos básicos de la práctica del Mindfulness. Jon Kabat-Zinn define el Mindfulness como “la práctica de prestar atención al momento presente para vivirlo plenamente, sin juzgarlo y poder influenciarlo positivamente.” El momento presente es el único tiempo real para poder generar algún cambio en nuestra vida. Podemos ser conscientes y aprender, crecer o sanar. El pasado ya no existe y el futuro aún no llega. Cuando estamos en la conciencia del “presente” tenemos la oportunidad de reconocer y responder de forma proactiva a los desafíos de la vida actual.<p><br></p><p><strong>La temática del Curso:</strong></p>Introducción al Mindfulness<p><br></p><ul><li>Clase 1: Las posturas del Mindfulness y los primeros pasos para aprender a meditar</li><li>Clase 2: El Origen del Mindfulness</li><li>Clase 3: Integrar la meditación a nuestras rutinas</li><li>Clase 4: Observar el cuerpo y la respiración consciente</li><li>Clase 5: La Exploración Corporal (Bodyscan)</li><li>Clase 6: Manejar el Estrés</li><li>Clase 7: Conocer y manejar nuestras principales emociones</li><li>Clase 8: La Compasión (Metta) y los secretos del \"dar\"</li></ul><p><strong><br>El Curso está dirigido a todas las personas quien</strong><strong>es quieran: </strong></p><ul><li>Aprender el arte de Meditar</li><li>Los que trabajen en el área de la salud</li><li>Los que tengan algún síntoma de Estrés</li></ul><p><strong><br></strong></p><p><strong>El Curso incluye:</strong></p><p>El Curso comprende 8 Clases ilustradas con videos de alta calidad con explicaciones paso a paso en español sobre cada práctica. También incluye una Guía Práctica con explicaciones y reflexiones sobre cada clase. Al final de cada clase encontrará preguntas para responder sobre cada práctica que lo ayuden a consolidar la experiencia. También podrá descargarse cada clase en formato de audio MP3 para poder practicar y escuchar los ejercicios mientras está lejos de la computadora.</p><ul><li>Más de 2hs. de video en alta resolución</li><li>Explicaciones paso a paso para realizar cada práctica</li><li>Audios mp3 para descargar y poder continuar la práctica durante el día</li><li>Una guía práctica con preguntas y reflexiones para completar cada clase del curso</li><li>Cerificado al completar el curso</li></ul><p><strong><br>Tiempo que lleva tomar el Curso completo: </strong>8 Semanas</p><p><strong><br>¿Qué se necesita para tomar el Curso?</strong></p><ul><li>Una computadora/tablet/teléfono con capacidad para ver video y escuchar audio. </li><li>Cada clase contiene una guía explicativa para seguir paso a paso el Curso</li></ul><p><br></p><p><strong>Al final de este curso, los estudiantes serán capaces de:</strong></p><ul><li>Entrenar la mente para aprender a concentrarse</li><li>Reducir los niveles de ansiedad</li><li>Aumentar el nivel de resistencia al estrés físico y mental</li><li>Educar la mente para pensar de manera optimista</li><li>Aprender a meditar sin la guía de un Instructor</li><li>Entrenar las habilidades emocionales para responder sin reaccionar</li><li>Reducir dolores crónicos, cefaleas, hipertensión</li><li>Mejorar el sueño</li></ul>", 
    "end_date": null, 
    "title": "Curso de Meditación Mindfulness - 8 semanas", 
    "price": "20.00", 
    "instructors": "Silvio raij", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711310_cdb1_2.jpg", 
    "course_url": "https://www.udemy.com/curso-mindfulness/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T23:08:43Z"
}