{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course will teach you how you can bring mindful practice into your daily life.</p><p>Mindfulness is an incredibly effective method for combatting stress and anxiety. It will allow you to enjoy the calm of living in the present moment.</p><p>The course can be enjoyed by anybody. Whether you are completely new to mindfulness or an established practitioner there is something here for everybody. It offers an introduction to mindfulness, it outlines the benefits and provides a number of simple exercises that will help you to embed the practice. </p><p>A series of 6 videos will guide you through some basic principles and teach you a number of simple techniques that you can practice in your own time. These include the importance of the breath and how to develop your awareness of your senses, bringing your attention to the present moment.<br></p><p>Most people lead very busy lives and the instruction within these videos aims to encourage people to bring their awareness to the present moment often. The value of prolonged sitting is not underestimated but the benefit of short, frequent practice is extremely powerful.</p><p>You will be able to complete the course in an hour but it is best to spread the videos over a number of days to allow yourself some time to practice in between. There is also a handy guide that you can download to help practice the exercises.</p><p>We are \"human beings\", not \"human doings\" or \"human thinkings\", allowing yourself to just be, without feeling the need to constantly do or think about something is not a waste of time. This course will help you to understand that just \"being\" in the present moment will help you to enjoy, experience and embrace being alive.</p><p><br></p>", 
    "end_date": null, 
    "title": "Everyday mindfulness", 
    "price": 0, 
    "instructors": "Jim Dawson", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/697066_07e3_9.jpg", 
    "course_url": "https://www.udemy.com/everydaymindfulness/", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-14T11:04:52Z"
}