{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>With simple daily practise you can make your life into a positive one:</p>    <ul><li>Stay confident and happy throughout your day</li><li>Improve your mental focus and stability</li><li>Increase your awareness</li><li>Learn to handle anxious, depressed, negative feelings</li><li>Become a constructive person in your relationships</li></ul>        <p><em><strong><br></strong></em></p><p><em><strong>Mental Precision</strong></em> is the ability to see the details of the situations you find yourself in accurately.  </p>  <p><em> </em></p>  <p><strong><em>Awareness</em> </strong>is the degree to which you notice and connect with the people and actions around you. </p>    <p>Developing both is key to this positive approach to life.  </p>    <p>Most courses in meditation focus on mental precision — you have likely heard of this as <em>“<strong>mindfulness</strong></em>” — and only to a beginner degree.  </p>    <p>This course provides <em><strong>both</strong></em> beginner and advanced instruction in <em><strong>both </strong></em>mindfulness and expanded awareness. </p><p> It will grow with you and be a resource you will come back to again and again for the rest of your life.</p>    <p><strong>Reclaim your Life by Learning and Practising these Meditation Techniques</strong></p>    <ul>  <li>Develop mental stability</li>  <li>Learn to stay present … all of the time</li>  <li>Learn to stay open … whatever the situation</li>  <li>Re-connect your mind with your body</li>  <li>Increase your self-awareness</li>  <li>Reduce your fear</li>  <li>Improve your confidence</li> </ul>    <p><strong><br></strong></p><p><strong>The Benefits of Mindfulness Meditation are Well-Supported by Studies</strong></p>  <p>Expanding awareness is just beginning to be studied in Neuroscience and Cognitive Psychology and will likely be the next big buzz.  But the brain and psychological effects of a regular mindfulness practice have been studied for many years now.  A regular practise has been shown to …</p>    <ul>  <li>Reduce Stress</li>  <li>Reduce Anxiety</li>  <li>Reduce Depression</li>  <li>Reduce Addictive Tendencies</li>  <li>Improve Concentration</li>  <li>Improve Attention</li>  <li>Improve Memory</li>  <li>Improve Sleep</li>  <li>Provide Emotional Balance and Stability</li>  <li>Increase Positive Emotional States</li>  <li>Help Children and Adolescents Handle Intense Emotions</li>  <li>Diminish Age-Related Neural Degeneration</li> </ul>    <p><br></p><p>A downloadable pdf of these studies is just one of the many resources you will have at your fingertips if you sign up for this course!</p>    <p><strong>Course Overview</strong></p>  <p>The course is designed in a multi-tiered way so that it can serve many different needs, both beginner and advanced, without bogging anyone down with long, boring videos!</p>    <p><strong>1.</strong> The core is a series of easy to follow instructions into four different meditation techniques, progressing in difficulty from those that develop mental precision to the final module for expanding awareness. </p>    <p><strong>2.</strong> The background module is filled with short, topic-specific videos that provide more in-depth treatment of some of the nuances of meditation, posture, location, eyes, and so on. You don’t need to look at these to get started; these are here for those people who have extra questions. </p>    <p><strong>3.</strong> The background module also includes longer videos and mp3s that are designed to be a conceptual guide to meditators as they progress through different levels of awareness and begin to have different questions about their experiences. Again, if you just want the core, it’s a stand alone set of instructions.</p>    <p>In addition to the content videos, each instruction module includes <strong>loads of guided meditations</strong>, both as videos and as downloadable mp3s, for you to use as you develop your practise.  Supplemental videos of challenging physical activities, for example some yoga poses, to use for your active meditation practise are continually being added.</p>    <p>Pick and choose which aspect of the course you want to focus on.  When you start out you might just want simple instruction, but after some months or years, you will have more questions.  This course will grow with you and is designed as a lifelong companion meditation practise.</p>    <p><strong>Why Am I Teaching this Course?</strong></p>  <p>I had been trying to meditate on and off for a large part of my life and never had much success.  Then, some years ago, because of my research in cognitive science and philosophy of mind, I became interested in mindfulness from a theoretical perspective.  </p>    <p>I really learned to meditate then and haven’t looked back.  </p>    <p>After receiving lots of student feedback from my course <em>Brain Training++</em> and from students at the university where I teach, I realised that a course like this one is needed!  </p>    <p>I have tried to present everything I have learned — tips that work for me and for others, motivation to keep at it, and background concepts that help make sense of the changes you <em>will</em> experience — in a way that is accessible to everyone AND that goes much deeper than most meditation courses do.</p>    <p><strong>If You’ve Ever Asked any of these Questions, this Course is for You!</strong></p><ul><li>How could meditating make me happy?</li>  <li>How could meditating ever make my life more      meaningful?</li>  <li>Should I be trying to empty my mind of thoughts      during meditation?</li>  <li>What is the difference between thinking about      something and being aware of it?  </li>  <li><em>Is</em> there a difference? </li>  <li>What is going on in my brain/mind when I am in the      flow of the moment?</li>  <li>Is there a difference between being in a flow state      and being mindfully aware?  </li><li>What <em>are </em>     thoughts anyway?</li><li>Can we ever get rid of thoughts completely?  </li></ul><p><br></p><p>Basically, if you have ever wondered about some of the mental experiences you are having, both on and off the cushion, this course offers videos and MP3s of more in-depth discussion of the phenomenological effects of meditation, of what these experiences mean in the context of your life, and how these changes can move you toward developing a more personally meaningful, happy life.<br></p>  <p><strong>What You will Learn in this Course</strong></p>  <ul><li>Four meditation techniques, each designed to develop a particular aspect of mind: stability, precision, presence, and finally awareness</li><li>Why meditation affects our brains/minds positively, from a neurological level</li><li>Why meditation affects our brains/minds positively, from a psychological level</li><li>The brain/body effects of an on-going meditation practice</li><li>The psychological effects of an on-going meditation practice</li><li>Concepts of mind and consciousness that will give you the tools to think more deeply about your own experiences, not just during meditation</li><li>Links to resources, both online and paper, on meditation, mind, neuroscience, including an up-to-date list of the current studies of meditation’s effect on the brain, body, and mind</li><li>Introduction to various physical activities to meditate during — yoga, martial arts, dance … I will keep adding classes as I receive suggestions</li></ul>                  <p><strong><br></strong></p><p><strong>Developing these aspects of mind will pay you back tenfold with an increase in ..</strong>.</p>  <p>happiness, good feelings, calmness, confidence, control, mental focus, memory, problem solving, creativity, groundedness.</p>    <p><strong>What you Will Get from this Course</strong></p>    <ul>  <li>A Happier Life</li>  <li>Mental Precision </li>  <li>Mental Focus</li>  <li>Mental Presence</li>  <li>Mental Calmness</li>  <li>Mental Stability</li>  <li>Mental Awareness</li>  <li>Self-Awareness</li>  <li>Body Awareness</li>  <li>Self-Confidence</li>  <li>Courage</li>  <li>Other-Awareness</li>  <li>Compassion for Others</li>  <li>A Happier Life</li> </ul>    <p><br></p><p>If you only ever take one meditation course, this is the one to take because it will grow with you — when you are ready to move on to the next step, or have new questions, it will all be there waiting for you.</p>", 
    "end_date": null, 
    "title": "Free your Self: Sharpen and Expand your Mind with Meditation", 
    "price": "20.00", 
    "instructors": "Dr. Nancy Salay", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609382_f151.jpg", 
    "course_url": "https://www.udemy.com/free-your-self-mindfulness-meditation/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T19:06:17Z"
}