{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">       Have you ever tried meditation, but had a hard time dedicating time to it?  Or, know what/how to do it properly?  Well you&#039;ve come to the right place!</strong>  </p>  <p style=\"\">  \t<strong style=\"\"> </strong> Whether you&#039;ve tried to create a steady, regular practice and failed, or are just getting started with meditation, this course has been created to guide you for 7 days to establish yourself in a powerful, grounded, and healing practice.  You don&#039;t need to meditation for hours at a time, but with simple, easy to follow instructions you will quickly begin to reduce stress, anxiety and emotional instability while helping develop an overall-sense of peaceful ease, steady focus, positivity and a deep, abiding happiness! <br style=\"\">  \t<br style=\"\">  \t Translating the most powerful ancient wisdom into compact, easy to understand nuggets, <br style=\"\">  \t  I will give you all the tools you need, and starting with short, easy sessions we will build <br style=\"\">  \t         I&#039;ve condensed my 10 years of practice for you, and in just 7 days you will learn:<br style=\"\">  \t<br style=\"\">  \t         - The value of choosing the proper place, posture and position;<br style=\"\">  \t      - Why we choose a mindset BEFORE we start;<br style=\"\">  \t    - How to deal with &#039;Thinkingness&#039;;<br style=\"\">  \t    - The value and importance of starting each sit with a &#039;Beginner&#039;s Mind&#039;;<br style=\"\">  \t    - The best way to notice breath, and why we DON&#039;T control it;<br style=\"\">  \t    - Why we seek to incorporate, not edit ALL sensation;<br style=\"\">  \t    - How to properly receive and process feelings;<br style=\"\">  \t<span style=\"\">- The value and necessity of a &#039;sealing&#039; practice;<br style=\"\">  \t</span><span style=\"\">- How and why prayer can be a powerful tool;<br style=\"\">  \t</span><span style=\"\">- How to use your momentum to form a regular self-guided practice;<br style=\"\">  \t</span><span style=\"\">- And SO much more!</span>  </p>  <p style=\"\">  \tIn these 7 days, you will develop the necessary foundations, and understand the practical, utilitarian and universal, non-sectarian nature of this empowering practice.  You will grow firm, healthy roots for your own healing and dedicated practice.  You will gain new insights, clarity, and peace of mind, as well as a more essential confidence as you give yourself the priceless gift of personal development and peace, on all levels.  <br style=\"\">  \t<br style=\"\">  \t      ... Sound like something you could use?  I hope so!  The benefits are manifold.  The adventure starts with you.  So let&#039;s not waste any more time.  Let&#039;s begin. :)  </p>", 
    "end_date": null, 
    "title": "Going Deeper: 7 Day Meditation and Stress Reduction Course", 
    "price": "45.00", 
    "instructors": "Tyler McCoy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364214_b02a_2.jpg", 
    "course_url": "https://www.udemy.com/7-day-meditation-course/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-06T03:41:08Z"
}