{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t        This course will provide you with all the basic instruction, tips, and guidance necessary to learn how to meditate easily and confidently.  </p>  <p>  \t     At the heart of the course are 4 guided video meditations, including Mindfulness Meditation, and a powerful mantra meditation from a 4000 year old Indian tradition. All of these meditation techniques are easy to learn and practice, as well as being very effective for producing a wide range of benefits. These benefits include:  </p>  <p>  \t     Relaxation; Reduced stress; Increased energy; Enhanced immune system; Normalized blood pressure; Improved overall health; Doing things more effectively; Accomplishing more with less effort; Increased mental clarity; Improved concentration; Increased creativity; Greater sense of emotional well-being; More harmonious relationships; Increased awareness; Increased inner peace; Gaining new insights and perspective on life; Being more in the flow of life.  </p>  <p>  \t     That may seem like a long list, but I can truly say that I&#039;ve experienced every one of these benefits, and more.  </p>  <p>  \t     If you&#039;ve been wanting to try meditation but thought it required a lot of work and discipline&hellip; or if you&#039;ve tried meditation in the past and found it frustratingly difficult, this course is for you.  </p>  <p>  \t     &quot;I just wanted to say thanks for the class. I have really enjoyed it. I have wanted to learn meditation for quite some time now, but have always found it so difficult. Since practicing with the guided meditations I finally feel like I&#039;m actually getting somewhere. Thanks again.&quot; Cindy H. ~ Apple Valley, CA  </p>", 
    "end_date": null, 
    "title": "How to Meditate with Surprising Ease", 
    "price": "20.00", 
    "instructors": "Jim Malloy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59507_c534_17.jpg", 
    "course_url": "https://www.udemy.com/how-to-meditate-with-surprising-ease/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-11T19:41:47Z"
}