{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn what mindfulness meditation is, and experience four guided mindfulness meditations on video and downloadable mp3's.</p><p>This course will teach you:</p><ul><li>What mindfulness meditation is and how it works</li><li>How to prepare to experience mindfulness meditation</li><li>What the benefits of mindfulness meditation are to your health, wellbeing and success</li></ul><p><br></p><p>Included in this course is four guided mindfulness meditations</p><ul><li>Re-centring Mindfulness Meditation</li><li>Body Awareness Mindfulness Meditation</li><li>Multi-Sensory Moment Mindfulness Meditation</li><li>Master Your Awareness Mindfulness Meditation</li></ul><p><br></p><p>The course is created by Dan Jones, who has over 20 years experience with meditation and the healing arts. Dan has studied Zen meditation and Tibetan Buddhist meditation, as well as the therapeutic applications of mindfulness meditation.</p><p>This course is structured to give you an understanding of mindfulness meditation before moving on to having you experience mindfulness meditation with the four included mindfulness meditation videos/mp3's.<br></p><p>The course will take about two hours to complete, but you will be likely to use the mindfulness meditation mp3's frequently as you practice mindfulness meditation and get used to meditating.</p><p>This course is for those interested in meditation, specifically mindfulness meditation. It is only a beginners course, so it probably isn't suited to those already highly knowledgeable on meditation or mindfulness.</p>", 
    "end_date": null, 
    "title": "Introduction to Mindfulness Meditation", 
    "price": "20.00", 
    "instructors": "Daniel Jones", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/230284_6dc7.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-mindfulness-meditation/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-26T22:45:58Z"
}