{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Intro to Mikkyo, the Secret Teachings<br style=\"\">Pathway to Personal Power</p><p><br style=\"\">This course will guide you to the practices and uses of previously secret Mudras (hand postures) and Mantras (short chants)</p><p><br style=\"\">Master clearing, energizing and connecting the chakras, meridians and the energetic body.</p><p><br style=\"\">Learn the Mikkyo Mudras, Mantras and Meditations used to clear the chakras, meridians and energetic body.<br style=\"\">Use Mikkyo to energetically connect the chakras and meridians to strengthen the energetic body<br style=\"\">Apply your new inner power and focus to cut the Mikkyo Grid<br style=\"\">Use the Mikkyo Grid to energetically charge people, places and things.<br style=\"\">Improve everything in your external world by developing more inner calm, power and focus thru Mikkyo.<br style=\"\">Mikkyo is the ancient system of clearing, strengthening and focusing the chakras, meridians and energetic body with simple hand Mudras and short Mantras. The inner strength and focus is then projected outside of yourself to energetically charge people, places and things and bring them in harmony and resonance with yourself.</p><p><br style=\"\">In this course, you will learn and apply the Mikkyo Mudras, Mantras and Meditations previously only taught in Temples, to create inner clarity, focus and power. You will also learn how to cut the Mikkyo Grid and the energy projection technique. You will know how to use these energetic tools to charge people, places and things in your external environment and bring them in harmony with your inner calm.<br style=\"\">This course is unique because these techniques have only been handed down in private Temples and monesteries before now. The methods are easy to learn and apply to make your life better now. </p><p><br style=\"\">Content and Overview<br style=\"\">I studied the Mikkyo system in the Shingon Temple in Honolulu personally with Masters from Japan and Hawaii for over eight years. In this &#039;Intro to Mikkyo, the Secret Teachings&#039; course I use five video lectures, several e-books and meditation guides to share what I learned. I use detailed photos, audio and video so you can quickly understand and apply the easy to learn Mudras, Mantras, the &quot;Mikkyo Grid&quot; and the Mikkyo energy projection technique.<br style=\"\">At the end of this course, you will be able to apply Mikkyo to create for yourself clearer, stronger chakras, meridians and energetic body. You will be able to use the Sword Hand Mudra to cut the Mikkyo Grid and project your focused awareness outside of your self to energetically charge people, places and things. You will have the ability and understanding to project your new inner calm and awareness outside of yourself into your external environment and bring it into harmony and resonance with yourself. <br style=\"\">A few of the many things you can use Mikkyo for; improve your relationships, clear negative energy out of rooms, and perhaps most importantly, bring yourself more inner calm and focus. <br style=\"\">No longer hidden in Temples, you can use Mikkyo to make your life better now. &quot;Intro to Mikkyo, the Secret Teachings&quot; can open you up to whole new worlds of power and possibilities within yourself.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Intro to Mikkyo, the Secret Teachings ", 
    "price": "50.00", 
    "instructors": "Michael Goddard", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/457104_e08c_2.jpg", 
    "course_url": "https://www.udemy.com/intro-to-mikkyo-the-secret-teachings/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T20:43:31Z"
}