{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em>“I've just started your course on Udemy, it's one of the best meditation courses I have done. Thank you for making it so accessible. Namaste. x\"- H Wen Goh</em></p><p><strong>Would you like to experience a  feeling of inner peace and a more loving relationship with yourself and others?   Then join me for this magical 10 week meditation program.</strong><strong></strong></p>    <p>Yoga teacher and Quantum Physics  Coach Teagan Fea and music composer Angel Sananda will take you on an incredible Meditation journey for 10 weeks, a journey that could change your life.</p>    <p>Are you aching to  connect with yourself and do you want to be nourished and nurtured emotionally,  mentally and spiritually?</p>    <p>Now you can.  Most people I  meet feel a deep need to connect more fully with themselves.  They find it  difficult however because of their commitments.  They may find time to  catch a yoga class or go to the gym however they still feel that they are  rushing from one thing to the next.</p>    <p>Learn to find peace and stillness in  every day.</p>    <p>My yoga teacher once told me that  life is about relationships.  She was right. But  the fundamental relationship we don't focus on is our relationship to  self.  When we spend time in spiritual  practice on a daily basis, we nurture the soul, our creativity and ultimately  our relationships with others.  We learn to experience a level of peace  that is so fulfilling it profoundly changes our lives.</p>    <p><strong>This Program Includes...</strong></p>    <ul><li>10 MP3 meditations</li><li>10 videos &amp; supporting PDFs</li><li>Daily reflections</li></ul><p>Each week you will listen to an MP3 meditation. Each meditation is between 15-25 minutes long.   You will also have access to supporting information including videos and PDFs and details about the  practice for that day.</p>    <p>The topics covered over the 10 weeks are as follows:</p>    <ul>   <li>Week 1: Letting go</li>   <li>Week 2: Balancing the energy centres</li>   <li>Week 3: Breath awareness</li>   <li>Week 4: Embodied awareness</li>   <li>Week 5: Connecting with the heart</li>   <li>Week 6: Developing presence</li>   <li>Week 7: Connecting with the divine feminine</li>   <li>Week 8: Connection with the divine masculine</li>   <li>Week 9: Intergrating both sides of your nature</li>   <li>Week 10: Cultivating joy and abundance</li>  </ul>    <p>Each day you will receive an  intention to focus on for that day. The intention will help to keep you in the  retreat zone.</p>    <p><strong>Here's what others say about this program:</strong></p>    <p>\"I hope you do this program again because I would really love to recommend it to people.  I would love  to do more of this sort of work, so I hope you continue.  I loved that it  was so easy to access and brought new awareness and joy to my life.   Great!  Thank you so much for your support throughout the ten weeks\" LC Melbourne, Australia</p>    <p>\"What a beautiful way to start  the morning! Thank you so much for creating this. It happened just at the  moment when I started to waiver back into old mean habits.\" GC Perth,  Australia</p>    <p><em>NB: Because meditation is a  component of this retreat, and we are using visualization, if you have a mental  health condition please check with your doctor to see if this is appropriate  for you.  Teagan Fea does not accept any liability for injury caused by  undertaking this retreat.</em></p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Journey Deep Into The Heart With Meditation", 
    "price": "50.00", 
    "instructors": "Teagan  Fea", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22724_982b_9.jpg", 
    "course_url": "https://www.udemy.com/think-with-your-heart-10-day-retreat/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-13T00:27:23Z"
}