{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn meditation from scratch and....</p><p><strong style=\"\">Improve immunity so that you remain healthy more than before.</strong></p><p><strong style=\"\">Heal faster, in case you are already suffering from a disease. </strong><br style=\"\"></p><p><strong style=\"\">Reduce stress, anxiety and depression. </strong></p>You will learn the same kind of meditation used in the clinical trials where it showed that psoriasis patients healed four times faster and AIDS patients improved their immunity. <p>Not only that the same meditation is proven to reduce their chances of relapsing back to depression by 40% </p><p><strong style=\"\">You will also get to know how much to meditate and when exactly you can expect start experiencing the benefits</strong>, and no I won&#039;t be making false promise that you will start benefiting right away. </p><p>You have to develop a certain daily discipline in order to benefit from meditation. <br style=\"\"></p><p>The kind of meditation you will learn in this course is mainly inspired by Buddhist meditations, but you learn it in a completely secular environment. </p><p><strong style=\"\">What will you be able to know/get out of this course?</strong> </p><p>Know precisely what meditation is and how to do it through guided meditations. </p><p>Choose the right meditation for you by knowing different types of meditations and how they work. </p><p>Know what is the best location, time and posture for meditation. </p><p>Get the most out of the meditation practice by documenting and discussing/analyzing your actual experience during meditation. </p><p>Know that meditation induces relaxation fairly quickly but its most effective benefit is not relaxation but goes far beyond the quick relaxation that you can achieve. Though there is nothing wrong with being able to relax. </p><p><strong style=\"\">Why should you learn from me?</strong></p><p>I can tell you many things about me, all of them would be besides the point. You would only know once you give this course a try. </p><p>But I&#039;ll tell you anyways.. I started meditation at 12 years of age. I have a long history with meditation. I failed at meditating for many many years. I tried to meditate very sincerely but there were no benefits. No physical or mental health benefits. </p><p>In fact things kept getting worse over the years. Until I found a teacher who taught Buddhist meditation at a Zen monastery. There I learned the correct way to meditate and there I learned for the first time in my life, how to correctly approach the meditation practice. </p><p>Since then I have continued to deepen my meditation practice. For last six years I have a very intensive meditation practice, where I meditate 45 minutes every day, and I do several intensive retreats. </p><p>For last 3 years I have been teaching meditation locally. </p><p>Here is what some of my local students have to say... <br style=\"\"></p><p style=\"\"><em style=\"\"></em>&quot;I have a very “busy&quot; life. Busy is the new buzz word, but for me it really means “having a great deal to do&quot;. Twenty four hours in a day are not enough to keep up with work, business and family life. Therefore, many people suggested that Meditation. In spite of being in the scientific field, I have always been skeptical of meditation benefits in our life.</p><p style=\"\">However, I am glad to say that after 6 weeks of meditation classes with Samir…. I am a believer! I can say that meditation has positively impacted my life because Samir gave us tools to deal with stress, day-to-day situations, be it work or family, with elegant examples.</p><p style=\"\">He taught us how not to be in auto mode for everything and actually be mindful of things. I learnt how to control my thoughts and be positive and hopeful in life. I still have a lot to learn, but I am on the correct path. I am definitely going to attend his classes in the future and will recommend them to everyone who has too much on their plate to handle.&quot;</p><p style=\"\">&quot;This has been one of the best meditation classes I&#039;ve taken (and I&#039;ve taken several)</p><p style=\"\">Samir provided logical and scientific explanations of why things worked and their effects. I loved the fact that this was without any “mumbo-jumbo&quot;. He took class notes, mailed them out, and meticulously answered questions. This was simply an outstanding class!&quot;</p><p style=\"\">You can give this course a try. </p><p style=\"\">Go ahead and click on the &quot;Take this Course&quot; button. <br style=\"\"></p>", 
    "end_date": null, 
    "title": "Learn Meditation: Improve Immunity, Healing & Reduce Stress", 
    "price": "50.00", 
    "instructors": "Samir Ranpara", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452700_51a2.jpg", 
    "course_url": "https://www.udemy.com/learn-meditation-improve-immunity-healing-reduce-stress/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-21T00:11:18Z"
}