{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This meditation course will help you, the beginning meditation student, <strong>reduce stress, improve sleep, optimize mental focus and get focused on your goals</strong> by learning and practicing this universal mantra-based meditation practice. </p><p>                   <strong>    Learn and practice meditation for good this time.</strong><strong></strong><br></p><ul><li><strong>Understand what meditation does for your body, mind &amp; soul.</strong></li><li><strong>Decode the power in a mantra-based meditation technique.</strong></li><li><strong>Uncover the secret myths that may have been preventing you from establishing a solid meditation practice before. </strong></li><li><strong>Learn why you haven't been able to learn meditation just from a book. </strong></li><li><strong>Have fun while learning. After all, you're adopting this practice for life! Smile. </strong></li></ul><p><strong>After completing this course, you will feel at ease meditating, on your own, at home, work or in a group.</strong></p><p>As a <strong>beginning meditator</strong>, you will <strong>learn meditation</strong> through 22 videos with support materials to define terms and explain concepts. Your meditation course is designed to teach you meditation over a two to three week span so you have the opportunity to practice, ask questions and kickstart your healthy meditation habit. </p><p><strong>You will become a powerful influence for the people around you by adopting meditation as a daily practice. </strong></p>", 
    "end_date": null, 
    "title": "Learn Meditation Like a Pro", 
    "price": "50.00", 
    "instructors": "Michelle Fondin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706964_df3d_3.jpg", 
    "course_url": "https://www.udemy.com/learn-meditation-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-26T13:54:09Z"
}