{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tDo you sometimes feel nervous in social encounters?  </p>  <p>  \t            Would you like to appear more relaxed and confident in important job interviews?  </p>  <p>  \t            Do you often have doubts about whether what you do is right or wrong?  </p>  <p>  \t            Would you like to get rid of this crazy feeling in your stomach that prevents you from doing what you really want to do?  </p>  <p>  \t            If you answered &quot;yes&quot; to one of those questions, <em style=\"\">this course if for you</em>.  </p>  <p>  \t<strong style=\"\">Why Meditation for Confidence?</strong>  </p>  <p>  \t            Honestly, I believe there is a huge misunderstanding about meditation. Many people think it only contains of sitting in a room all by yourself for hours doing nothing. Well, this can be a way of Meditation, however in this course I will present you with something more effective.  </p>  <p>  \t            We will discuss ways in order to bring that present state of meditation from the quiet room into your dynamic world. It is one thing to be happy and relaxed in your room at home, but a totally different thing to bring this feeling to your work place, or to a bar or club.  </p>  <p>  \t<strong style=\"\">What is Confidence really?</strong>  </p>  <p>  \t            Confidence is in its core nothing else than pure self-trust. This self trust means getting rid of any doubts about whether you will succeed or not. It means trusting in whatever happens that you <em style=\"\">ARE OKEY and WILL ALWAYS BE OKEY.</em> You see, this is where the Meditation Techniques in this course come in.  </p>  <p>  \t<strong style=\"\">Why am I qualified to teach you?</strong>  </p>  <p>  \t            For the last 6 years I experimented with active and passive forms of meditation. I have gained over 1000+ hours of meditation experience, while at the same time running my own webdesign business and getting my Masters degree at University.  </p>  <p>  \t            You see, I think there are two aspects to life: the YIN and the YANG, the ACTIVE and the PASSIVE, the RELAXING and the TAKING ACTION. This course is all about melting those two togethers, so that you can be <em style=\"\">RELAXED WHILE TAKING ACTION.</em>  </p>  <p>  \t<strong style=\"\">The course is structured in 3 main parts:</strong>  </p>  <p>  \t            1- Why is the &quot;old way&quot; of looking at confidence flawed and counterproductive? What do I mean by &quot;natural confidence&quot;?  </p>  <p>  \t            2 - What different kinds of attention do we have? How can we access all aspects of our Personality?  </p>  <p>  \t            3- Hands On: What are practicable and simple meditation practicies to incoorporate in your daily life?  </p>  <p>  \t            All in all the course takes <em style=\"\">only</em> around <strong style=\"\">1.5</strong> <strong style=\"\">hours</strong>, but the real fun starts after the course in real life, believe me, it is going to be a <strong style=\"\">BIG ADVENTURE!</strong>  </p>  <p>  \t            I am looking forward to work with you,  </p>  <p>  \t            Stefan  </p>", 
    "end_date": null, 
    "title": "Meditation for Natural Confidence & Self-Esteem", 
    "price": "20.00", 
    "instructors": "Steven Bridd", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208140_affe_8.jpg", 
    "course_url": "https://www.udemy.com/meditation-for-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-30T17:02:59Z"
}