{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>If you're carrying too much stress you could be at risk of having heart problems and/or other illnesses and diseases. It's absolutely important that you know some meditation techniques to help reduce your overall stress levels.</p><p>  \t  Did you know that meditation is not JUST about sitting cross-legged on a soft cushiony pillow? Meditation can be integrated into every moment of your life so you feel more fulfilled and satisfied. </p><p>In this course we'll explore a variety of interesting styles of meditation so you can find the RIGHT-FIT MEDITATION routine that is perfect for your personality and lifestyle.</p><p>You'll love how some of these meditation styles will easily fit into your daily routine and even integrate nicely with your family and workplace.</p><p><strong>***BONUS MP3 meditations that you can download and listen to any time!***</strong><br></p>  <p>*****<br></p><p><strong><em>\"Extremely well structured!</em></strong></p><p><strong><em>Extremely well structured, planned and focused. Very useful personally as well as professionally. The course has proved invaluable in helping me live my life better.\"</em></strong> ~ Donald Martin</p><p>*****</p><p><strong><em>\"Powerful course!</em></strong></p><p><strong><em>Very powerful! The best part of the course is: it helps also in organising your meditation schedule as well.\" </em></strong>~ Ash Kellis</p><p>*****</p>  <p>I invite you to come on an exciting journey of meditation and I'll show you how meditation can positively improve your life, reduce illness and dis-ease and bring you a peaceful state of mind. There's a 30 DAY MONEY BACK GUARANTEE so you have peace of mind and can buy the course now!</p>    <p>This comprehensive <strong>Meditation for Every Moment </strong>Course will help you deeply love yourself, heal your heart, get rid of emotional baggage, reduce anxiety and melt away muscle tension, increase happiness and satisfaction and overall enrich your life to better living. It's an excellent personal development and personal transformation tool!</p>  <p>  \t This course has:</p><ul><li>Amazing inspirational videos,</li><li>Informational lectures and powerpoints,</li><li>Valuable PDF worksheets and exercises</li><li>AND, you'll also receive <strong>BONUS MP3 MEDITATION DOWNLOADS.</strong></li><li><strong>AND, a bonus LAUGHTER YOGA VIDEO!</strong></li></ul><p><strong>MP3s included:</strong></p><ul><li><strong>Progressive Muscle Relaxation</strong></li><li><strong>Deep Healing Meditation</strong></li><li><strong>Relieving Anxiety Meditation</strong></li><li><strong>Tropical Nature Walk Visualisation</strong></li></ul><p><strong></strong>It really is a full course and you're definitely getting a great value!</p><p>ENROL NOW!</p>", 
    "end_date": null, 
    "title": "Meditation for Every Moment", 
    "price": "20.00", 
    "instructors": "Carmen Wyld", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65334_ce9e_5.jpg", 
    "course_url": "https://www.udemy.com/right-fit-meditation-for-every-moment/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-13T23:59:56Z"
}