{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong> Meditation Course Updated as of October 25th, 2015</strong></p>\n\n<p><strong>NOTE: This course was published in 2014. I created it using a very simple video technique, but rest assured the content is GOLD.</strong></p>\n\n<p><strong>Learn the most effective meditation techniques to develop your Soul-Self and get an edge in life.</strong><br></p>\n\n\n\n<p><strong>Besides learning meditation techniques - that will also sharpen your mind skills -you will find in this meditation course:</strong></p>\n\n\n\n<ul><li> A lesson on sounds -that you can use to create your own mantra you can use during your meditation- and the inner organs they stimulate.  This wisdom comes from a book that isn't even yet available in English.</li><li> A movie with interviews to scientists that explain how our thoughts affect our \"reality\".</li></ul>\n\n\n\n<p>  \t              This is the Meditation Course you <strong>must </strong>have if you care to develop your Soul Self. Please note that these are <strong>not </strong>guided meditations. These are actual meditation techniques originally taught only by real Gurus from India.  </p>\n\n\n\n<p>  \t    Whether you want to <strong>achieve worldly success</strong> or <strong>reach high spiritual heights</strong> this meditation course is for you. <strong>You </strong>decide how you will use the <strong>skills you will develop</strong> when you practice the meditation techniques you will learn here.  </p>\n\n\n\n<p>Powerful audio visual brain entrainment technology -to enhance your mental skills and capacities- has been around for many decades and it's expensive. It has proven to have great results in individuals that use it on a daily basis for prolonged periods of time.<strong> Save yourself hundreds of dollars </strong>and <strong>learn to access your own audio visual Soul brain entrainment system by learning these meditation techniques. </strong>And<strong> it gets even better. Learn meditation techniques to connect to your soul so it becomes easier for it -your Soul- to communicate with your mind and intelect. It doesn't get better than that!<br><br><em>I will be here, along your journey, to answer any and all your questions. You don't have anything to lose and you have your own Soul-Power to regain through the Meditation Techniques you will learn in this course!</em><br><br></strong></p>\n\n\n\n<p>If you are sincerely interested in developing your Soul-Self further you deserve to have access to these meditation techniques. This is why I've made these otherwise secret meditation techniques available to everyone.<br></p>\n\n\n\n<p>  \t                                      Learn from someone who has had more than 30,000 hours of meditation in the past 25 years and who devoted 9 years <strong>full time </strong>to the practice and study of this meditation method. I will also be available to answer your questions about other types of meditation and the meditation techniques you will learn in this course.  </p>\n\n\n\n<p>  \t<strong>Now You can Sharpen your Life Skills </strong><strong>with Your Own Inner Audio Visual Brain Entrainment equipment that you will learn to access with these Meditation Techniques.</strong>  </p>\n\n\n\n<p>  \t<strong></strong> In this meditation course you will learn:</p>\n\n\n\n<ul><li>To connect to the two main manifestations of your Soul within you</li><li> To ease and speed up the download of information your Soul has for you through meditation to enjoy a happy and successful life.</li></ul>\n\n\n\n<p>  \t                                              By practicing frequently these meditation techniques you will:  </p>\n\n\n\n<ul>  \t<li>Sharpen your soul skills to succeed in your career, your family life, your relationships and in your lifestyle in general. </li>  \t<li>Learn to access your own brain entrainment system.</li>  \t<li>Develop soul \"muscles\" you didn't even know you have.</li>  </ul>\n\n\n\n<p>  \t                                               All you need is to be able to spare at least 30 minutes a day to meditate and have a sincere interest in developing your connection to your innermost source of wisdom: your Soul, that small part of God/The Universe in you.  </p>\n\n\n\n<p>  \t                                              Masters of these two ancient and secret meditation techniques have required people interested in learning them to live a strict life style, you don't have to. I designed this course so that everyone from any walk of life can benefit from them. These meditation techniques can be used in conjunction with other techniques, so they are a <strong>great </strong>addition to any spiritual practice.  </p>\n\n\n\n<p>  \t                                              The <strong>only requirements</strong> are:  </p>\n\n\n\n<ul>  \t<li>A sincere and genuine interest in developing your Soul self </li>  \t<li>Trust in the Divine -regardless of the name you give \"It\".</li>  </ul>\n\n\n\n<p>  \t                                      If you lack either one of these requirements this Meditation method may not be for you.  </p>\n\n\n\n<p>  \t            If you are into meditation and spirituality you will enjoy the information I provide here. Remember there is a 30 day, full refund guarantee with no questions asked.  </p>\n\n\n\n<p>  \t            So if you  meet both requirements for this editation course <strong>enroll now and start developing your Soul Self together with other skills you didn't even know you have.  Every moment you wait to enroll is costing light to your soul.</strong></p>\n\n\n\n<p>  \t<strong>Your Soul is eagerly and cheerfully waiting for you, and I will be more than glad to answer all your meditation questions.</strong>  </p>", 
    "end_date": null, 
    "title": "Meditation - Awaken Your Soul Meditation", 
    "price": "20.00", 
    "instructors": "Myriam Zuzs", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363860_fb87_9.jpg", 
    "course_url": "https://www.udemy.com/soul-brain-entrainment-meditation/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T13:33:44Z"
}