{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is for you if you feel a bit knocked off centre, find it difficult to get to sleep or wake up during the night, can't switch off your racing mind, feel panicked and/or fatigued, difficulty concentrating or have a lack patience with your loved ones. It's also for you if you are on a path to connect deeper with your true self. Meditation is a wonderful tool for revealing reality and making space for personal growth and development as a result.<br><br>Meditation can help to support your journey of healing or self development, sometimes straight away. The more you practice the better you'll feel and the easier it will become to deal with lifes challenges as they arise. Once meditation is embedded as a habit in your daily life, you'll have the added bonus of knowing that you have invested in an effective tool to deal with stress ... even just knowing that fact is comforting.<br><br>In this course you will learn a variety of meditation tools so that you can return to a sense of peace and clarity. Try all the meditations, there's bound to be a couple of approaches that you'll warm to. <br><br>Activate your inner peaceful warrior, confidently take your place in this moment, reconnect your body and mind, let go of stress held in your body and navigate peacefully through your thoughts and challenges and come home to your 'self'. What you learn during meditation practice can be applied to daily life situations, love and business, giving you a sense of confidence to deal with what life brings.<br></p><p><strong>Materials included in this course : </strong><br></p><ul><li>Guided meditation videos. </li><li>Meditations are also provided in audio download format.</li><li>Seven different meditation techniques, something to suit everyone.</li><li>Suggestions for embedding the practice into your life.</li><li>Guidance with setting up your meditation space.</li><li>Continued support with your meditation questions.</li></ul><p><strong>Structure</strong><br>A selection of 2 or 3 minute guided meditations are given. I suggest you work through them in chronological order, one per day. You can repeat the same meditation several times a day if you wish or do the meditation without the guidance to increase your meditation time.</p><p>Once all the meditations have been completed continue every day to embed the practice into your life habits.</p><p>Repetition, discipline and embedding  meditation into your daily life practice is how it becomes a trusted tool in difficult times.</p><p><strong>How long to complete this course</strong><br>There are 7 guided meditations. I suggest to do one per day and then repeat until you have done 21 days of meditation practice. 21 days allows the development of a new habit. After this you can meditate alone, or source longer guided meditations.</p>", 
    "end_date": null, 
    "title": "Meditation for Beginners. Feel Happier, Healthier, Clearer.", 
    "price": "20.00", 
    "instructors": "Rebecca Allen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600522_4bf4_6.jpg", 
    "course_url": "https://www.udemy.com/meditation-for-beginners-feel-happier-healthier-clearer/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T15:31:43Z"
}