{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p> <strong style=\"\">Meditation First Step - - - Last Step</strong></p><p>What is Meditation ?</p><p>What are the techniques of Mediation ?</p><p>What Meditation is not ? </p><p>Meditation is very simple, we complicate it. We weave a web of ideas around it, what it is ?, what it is not ?, Because it is so simple, it escapes us.</p><p>Meditation comes naturally with extraordinary ease, when we walk, or look out of our window.</p><p>This courses answers the above questions and much more. Efforts are made to simplify the concept. It also includes the following topics - </p><p><strong style=\"\">Prayer </strong>- the greatest power available to the individual.</p><p><strong style=\"\">Autosuggestion</strong> - has helped many in achieving their goals.</p><p><strong style=\"\">Relaxation technique</strong> - this will help you if you are tired, stressed, anxious or tense.</p><p><strong style=\"\">Concentration</strong> - his is the only tool for high achievements.</p><p><strong style=\"\">Vipassana or Mindfulness</strong> - to see the things as the are.</p><p><strong style=\"\">You may have a question, why the above are also mentioned in same course?</strong></p><p><strong style=\"\">The reason the above are mentioned because Meditation is often confused with concentration or relaxation or autosuggestion. So first we are understanding what are all these and when we are clear that these are not Mediation, we will look into what is Mediation.  </strong></p><p>A step by step video will guide you first through Prayers, Autosuggestion, Relaxation technique concentration and finally Meditation.</p><p>This course if for all those who want to know or learn meditation. Some stories are also been used to understand the subject. Other topics are included which will help you for success in life, improve relationship, build confidence etc .</p><p>In a way this course is a collection of work done by many great people.</p><p>All the Best.</p><p> </p><p></p><p></p><p> </p>", 
    "end_date": null, 
    "title": "Meditation for KIDS, parents and all others", 
    "price": "20.00", 
    "instructors": "Bhushan Kulkarni PMP", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469110_7ea3_3.jpg", 
    "course_url": "https://www.udemy.com/meditation-first-step-last-step/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T16:36:13Z"
}