{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong></strong></p><p>\n                                        <strong><em>Beautiful Wisdom...                                 Course Updated December 2015</em></strong><em>\n                                    </em></p><p><em>                                                                \"love this course ! it's very useful , informative and helpful. you can choose what you want to do every day of the week. especially enjoy the fire breathing method . thank you very much\" </em><em>by M Bustrevic</em></p><p><strong>Does your life need to slow down and become more relaxed and centred? Feeling harassed and out of control? Then you need this course.</strong></p><p><strong>Meditation assists you to engage and explore the road to personal transformation and freedom.</strong> There are literally hundreds of techniques for  <strong>meditation</strong>. If you want to thrive in meditation and get the benefits –  relaxation in action, clarity of mind, resistance to stress-related  illness, a happy heart – then <strong>choose the techniques that feel natural to  you </strong>and leave what does not serve you. This way you will discover your very own Garden of Eden.</p>  <p>  \t    My offering to you is a Daily meditation guide that explores some of the sacred avenues you can choose to propel your practice. Take what you will and leave what does not float for you, there will be some ideas, <strong>meditations that you do not like - this is okay</strong> - it is what this course is about. Choices, your choice to choose what works for you..  </p>    <p>  \t<strong>Daily meditations, tips and tricks to fire up your life.</strong>  </p>  <p>  \t                  Discover that every day of the week, Sunday through Saturday, is a magical wonder filled day. Each of the seven days of the week has its own unique attributes such as deity associations, colours, crystals, and herbs.  </p>    <p>  \t<strong>Learning and practicing meditation regularly is one of the most magical tools you can use to enthuse and inspire your life</strong>. More than 1,500 research studies prove what an amazingly simple and practical tool meditation is.  </p>  <p>  \t                    You may feel like you don't have much room in your schedule to add to meditation practice. Between your job, taking the kids to school or sports training. However think about it. Do you have maybe five minutes or even twenty minutes to spare? You are worth the time - you know that. Meditation doesn't have to be complicated to be effective.  </p>  <p>  \t<strong>The most powerful meditations are those that are simple, practical, and come from the heart.</strong>  </p>  <ul>  \t<p>  \t\t                    ·Lower your stress levels  \t</p>  \t<p>  \t\t                    ·Lift any depression cloud that is hanging or that underlying anxiety  \t</p>  \t<p>  \t\t                    ·Think more clearly, more radiantly  \t</p>  \t<p>  \t\t                    ·Relax your mind, body, and spirit  \t</p>  \t<p>  \t\t                    ·Increase your efficiency and productivity  \t</p>  \t<p>  \t\t                    ·Listen to your inner voice for direction, comfort, or inspiration  \t</p>  \t<p>  \t\t                    ·Centre yourself to appreciate the miracles and gifts in your life  \t</p>  \t<p>  \t\t                    ·Spark your creativity and intuition, believe in yourself!  \t</p>  \t<p>  \t\t                    ·Give your immune system and boost and improve your health.  \t</p>  </ul>  <p>  \t                    Each day of the week has its own wonder filled magical interrelationship. These energies, associated deities, colours, scents, crystals, all have the same sort of vibrations.  </p>  <p>  \t<strong>Every day has the ability for you to be a magical day</strong>. Just how wonder filled and enchanting of a day it turns out to be is completely up to you.  </p>  <p>  \t                    If for any reason you are not 100% happy with this course and its content you have my <strong>unconditional 30 Day no questions asked money back guarantee</strong></p><p>Not sure? Scroll down there are free previews for you to get a taste of what is to come</p><p><strong></strong>  </p>  <p>  \t<em>The material on this site is provided for educational purposes only,  and is not to be used for medical advice, diagnosis or treatment</em>  </p>", 
    "end_date": null, 
    "title": "Meditation for Spiritually Infused Living", 
    "price": "20.00", 
    "instructors": "Sharon Ramel", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310610_02c4_8.jpg", 
    "course_url": "https://www.udemy.com/a-daily-meditation-guide-to-discover-your-own-garden-of-eden/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T06:29:48Z"
}