{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em>\"</em>This is a most beautiful and uplifting course. Sharon is very informative. Excellent for the beginner or for those wanting to refresh their knowledge.\" <em> by M Webb</em><br></p>\n\n\n\n\n\n\n\n<p><em><strong class=\"redactor-inline-converted\"><em><strong class=\"redactor-inline-converted\">Is your life stressful and feeling out of control? Then come</strong></em> with me as we Chakra Dance and Meditate to fire up your life, let go have fun and de-stress.</strong></em></p>\n\n\n\n\n\n\n\n<p><em>“Dance? But, I have two left feet. I am not good at dancing. Meditate? and I cannot sit still. I am no good I have tried before\"</em></p>\n\n\n\n\n\n\n\n<p>  \t              Well listen up my friends, dancing is fun! Meditation is also fun and both activities are relaxing. It's not just about the steps or the technique. It's not just about the music, its about the space you create. This course is a combination of moving your body - chakra dancing, stimulating your mind and enhancing your spirit. Learn engaging meditation to relax you and it is a great way to express your emotions. Balanced chakras bring a new vitality to your life. Learn how to unload your chakras of the life long sludge!</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course Description</strong></p>\n\n\n\n\n\n\n\n<p>This course is guided by Sharon Ramel who will will teach you how to discover happiness here and now.</p>\n\n\n\n\n\n\n\n\n\n<p>You'll discover and practice mindfulness techniques, including meditation and simple breathing methods, so you can concentrate fully and connect with all the life that surrounds you. <strong class=\"redactor-inline-converted\">You'll dance in an intuitive way receiving joy in your everyday life to transform your mind and body</strong>.</p>\n\n\n\n\n\n\n\n\n\n<p>Discover how simple it can be to bring the wonders of life to nourish and heal your body and reduce your suffering.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Practice Mindfulness in Your Everyday Life to Transform Your Mind and Body</strong></p>\n\n\n\n\n\n\n\n\n\n<ul>\n<li>Understand how to be mindful, whether you're simply breathing dancing or walking</li>\n<li>Learn from your past and release anxiety about your future</li>\n<li>Reflect upon your connection with nature and to all life</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Contents and Overview</strong></p>\n\n\n\n\n\n<p>We will discover the wonders of the chakras and learn specific meditations that resonate with them to bring about peace and healing within.</p>\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Meditation specific to each chakra</strong></li><li><strong class=\"redactor-inline-converted\">Dance music to stimulate each chakra.</strong></li></ul>\n\n\n\n\n\n<p>We are not talking about any old dance or meditation. We are talking about a chakra dance and meditation that reveals you to yourself! A coming home to your own body/soul sense. That deep knowing that you lost along the road we call life.<br></p>\n\n\n\n\n\n\n\n<p>  \t              <strong>Chakras are our life force or vital energy</strong>. Some call them “the spinning wheels of light\" located all over your body. Although we have thousands of them, but there are seven major chakras located along our spine from the base to just above our head that we need to focus on. The role of the chakra system is to be able to regulate the flow of our energy force or what we commonly known as <em>aura.</em> Once our energy force is blocked due to the many challenges and emotional roller coaster we find ourselves in, it is not surprising that we get sick – not only physically, mentally, but also emotionally.</p>\n\n\n\n\n\n\n\n<p>  \t                  The chakras are wheel-like vortices of energy which connect the   physical body to its subtle energetic counterparts. In this article   we'll take a look at the seven main chakras, which play a key role in   energy reception and transmutation.  </p>\n\n\n\n\n\n\n\n<p>  \t                           The chakra system has been  extensively studied and described  in Eastern systems of philosophy and  medicine, although Western science  remains skeptical their very  existence. Nonetheless, awareness of the  body as an energy system is  increasing among forward-thinking  scientists, and the chakras along with meditation continue  to play an important role in a  variety of holistic healing disciplines.  </p>\n\n\n\n\n\n\n\n<p>  \t              PS. I am looking forward to meeting you. Enroll today. I offer an unconditional money back guarantee within 30 days of purchase.  </p>\n\n\n\n\n\n\n\n<p>Not sure? Scroll down there are free previews for you to get a taste of what is to come</p>\n\n\n\n\n\n\n\n<p>  \t<em>The material on this web site is provided for educational purposes only,  and is not to be used for medical advice, diagnosis or treatment</em>  </p>", 
    "end_date": null, 
    "title": "Meditation + Chakra Dance for Health Fitness and Fun", 
    "price": "25.00", 
    "instructors": "Sharon Ramel", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/293648_cb50_7.jpg", 
    "course_url": "https://www.udemy.com/chakra-dance-and-meditate-the-fun-way-to-renewed-health/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-04T05:29:08Z"
}