{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Hi, </p><p>Do you want to <strong>start 2016 full of energy</strong>? Do you want to make this year the <strong>best year of your life</strong>?</p><p> If so, you are in the <strong>right place.</strong></p><p><strong></strong> My name is Felipe and in this course you will learn what I believe to be <strong>THE BEST HABIT</strong> you can possibly have in your life. <strong>MEDITATION</strong>.</p><p>I will present you <strong>recent scientific facts</strong> about meditation and its benefits in your body, mind, emotions, and general well being. </p><p>You will NOT learn it from a distant guru living at the Himalayas. You will learn it from a <strong>person who is probably very close from who you are</strong>. </p><p>I'm a <strong>recent business school graduate</strong> and <strong>entrepreneur </strong>who included meditation to my daily routine two years ago after discovering I had <strong>ADHD</strong>. I'm NOW grateful to all <strong>extra positive effects</strong> meditation had on me (besides having controlled my ADHD disorder, with <strong>zero use of medicine</strong>!).</p><p>After I decided to meditate because of my ADHD condition, I started reading books, studying, and deepening my understanding and knowledge of the science behind meditation. It made me even more committed to this new habit and I'm glad to share some of this knowledge with you in the course.</p><p><strong>Meditation is the brain workout we all should be doing,</strong> every single day, to be able to access the higher self within us who is <strong>more intelligent, disciplined, wiser, stronger, resilient,</strong> and many other adjectives our society demands us to be.<strong></strong></p><p>PLEASE:</p><ul><li>Check the <strong>Introduction section</strong>, where I explain in <strong>details about me and the course.</strong></li></ul><ul><li><strong>Watch the free preview lectures </strong>in the 'Science of Meditation' section so you can see some of the great benefits meditation can create to your life.</li></ul><p>This course is for you who believe <strong>you can do more, be better, and achieve greatness</strong>. I would love to have learned to meditate when I was younger and that's why I'm sharing this knowledge with you. Sooner you learn it, sooner you will achieve the positive life-changing results of it.</p><p>Don't lose time to invest in yourself and learn a lifetime meditation technique that you will be able to use and benefit from, FOREVER. </p><p><em>Get started today by clicking <strong>\"Take This Course\" </strong>and g<em>et full, lifetime access with all future updates and all current and future course materials included!</em></em><br></p><p>I structured the course in a way that you can <strong>start and finish the course in one sitting.</strong> I did that so you can learn and start practicing the meditation technique right away.</p><p>All the <strong>lectures are less than 5 minutes each</strong> with mostly <strong>everything I'm saying written on the screen</strong>. I did that because I have a <strong>Brazilian accent :)</strong> and I believe it will facilitate your understanding of the course and the things I'm saying.</p><p>I truly believe in the <strong>power of meditation</strong> and you are only one step from enrolling to a<strong> gym for the brain!</strong></p><p>I'm looking forward to seeing you in the course and being part of the life-changing step you are about to take. <em>Enroll now by clicking \"Take This Course\".</em></p><p><br></p>", 
    "end_date": null, 
    "title": "Meditation for students and young professionals", 
    "price": "20.00", 
    "instructors": "Mr. Felipe Galheigo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629684_7725_5.jpg", 
    "course_url": "https://www.udemy.com/meditation-for-students-and-young-professionals/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-03T16:08:05Z"
}