{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t           Do you ever feel stressed out by the end of a long day of work?  </p>  <p style=\"\">  \t           Does your mind stay in over-drive even after you&#039;re done working, but trying to relax?  </p>  <p style=\"\">  \t            Do you ever feel as if there were thousands of monkeys screaming in your head?  </p>  <p style=\"\">  \t           Do you ever just want to let go and turn off your mind?  </p>  <p style=\"\">  \t           Do you wish you had some sort of magic cure-all?  </p>  <p style=\"\">  \t           Do you wish you knew how the mind worked so you could actually feel relaxed, at ease, and chilled out?  </p>  <p style=\"\">  \t           Do you wish you could just take a break?  </p>  <p style=\"\">  \t           Do you want to know how?  </p>  <p style=\"\">  \t           It&#039;s so simple. You can learn how right now.  </p>  <p style=\"\">  \t           Just Startup Meditation.  </p>  <p style=\"\">  \t<strong style=\"\">Why Startup Meditation?</strong>  </p>  <p style=\"\">  \t           More and more scientific research is showing the benefits of a daily meditation practice. Anyone who regularly meditates will tell you how much they enjoy it. With just a few minutes a day, even you can begin experiencing the benefits of meditation.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\"> Here are just a few benefits:</strong>  </p>  <ul style=\"\">  \t<li>Stay focused longer</li>  \t<li>Improved problem solving skills</li>  \t<li>Increase emotional intelligence</li>  \t<li>More mental space</li>  \t<li>Better sleep</li>  \t<li>More creativity</li>  \t<li>Less overall stress</li>  \t<li>Flexibility to change tasks faster</li>  \t<li>Increased intuition</li>  \t<li>Greater sense of balance in life and work</li>  \t<li>Improved thought habits</li>  \t<li>More attractive</li>  \t<li>Whiter teeth</li>  </ul>  <p style=\"\">  \t            Yes, meditation is very powerful. Especially for entrepreneurs. I know first hand. We&#039;re generally information overloaded, over-stressed, and irrationally passionate folk. That&#039;s fine, it&#039;s the path we chose. <strong style=\"\">Meditation can help.</strong>  </p>  <p style=\"\">  \t            However, most people don&#039;t know how to begin a practice or keep it up. They don&#039;t know if they&#039;re doing it right. With lots of doubts and misunderstandings, they just give up too early, without realizing any of the benefits.  </p>  <p style=\"\">  \t            Meditation for Entrepreneurs is specifically designed to give you only what you need to know. It is a minimal course with maximum benefits. You don&#039;t need a 10 hour training course with 50 lectures adding more junk into your head. You need concise instructions with a <strong style=\"\">simple</strong> technique and a way to keep a practice. That&#039;s it.  </p>  <p style=\"\">  \t           That&#039;s all this course will offer. <em style=\"\">Just </em>what you need. <strong style=\"\">In this course you will learn:</strong>  </p>  <ul style=\"\">  \t<li>How to sit.</li>  \t<li>How to look within.</li>  \t<li>Three simple, yet potent, focus techniques.</li>  \t<li>How to use meditation to tap into your creativity.</li>  \t<li>Practical tips on how to form a steady meditation practice.</li>  \t<li>The coolest places to get peaceful, chill, meditation music.</li>  \t<li>It&#039;s that simple. No fluff. Straight to the point.</li>  </ul>  <p style=\"\">  \t            You&#039;re already busy. No need to waste more of your time learning things that won&#039;t help you experience the real benefits of meditation.  </p>  <p style=\"\">  \t<strong style=\"\"> Why am I qualified to teach you?</strong><strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li>I&#039;ve been an entrepreneur since I was a kid, selling gum balls, painting fences, modding xbox controllers, selling on ebay, and now writing and marketing online</li>  \t<li>I run my own businesses online right now. Working for myself.</li>  \t<li><strong style=\"\">I have over 1260 hours of meditation practice</strong> - logged over the past 5 years.</li>  \t<li>I have lead <strong style=\"\">over 200 guided meditation sessions</strong> for dozens of other bright and intelligent creatives and web professionals. They loved it. Here&#039;s what they said…</li>  </ul>  <p style=\"\">  \t<strong style=\"\"> Testimonials</strong>  </p>  <p style=\"\">  \t          Meditation. Words of wisdom. Tranquility. These are just some of the words I would use in the same sentence with you bro. <strong style=\"\">Thank you for getting me started on meditation. Your voice is so good for guidance.</strong> Thank you!<br style=\"\">  \t           -Justin N.<br style=\"\">  \t<br style=\"\">  \t           Ever since I started to doing the daily meditations Tharyn organizes, it has been a huge help for me. First of all encouragement and motivation to actually take the time to meditate, which for me is the biggest challenge. <strong style=\"\">The meditations Tharyn took us through were amazing, it feels great to clear your head after a long day of work,</strong> and it makes me more <strong style=\"\">energetic</strong>, <strong style=\"\">focused</strong> and <strong style=\"\">creative</strong> during the day. The meditations are very soothing and helpful for me. Keep up the great work :-)<br style=\"\">  \t           - Daniel G.<br style=\"\">  \t<br style=\"\">  \t           I would like to start off by saying that I have always had trouble meditating on my own. Constant chatter in my head, distractions from everything around me. But I was fortunate enough to do a 3 guided meditations with Tharyn live. They worked wonders on me and I figured out my problem areas. <strong style=\"\">I was able to relax faster and fall into a peaceful meditative state.</strong><br style=\"\">  \t           - Eugene H.<br style=\"\">  \t<br style=\"\">  \t           Tharyn is an amazing meditation coach. <strong style=\"\">He knows everything about meditation and can always help with advice if you have any questions.</strong> He has a wonderful voice that gets you into the meditative level very quickly. Definitely recommend to everyone who is interested to bring his meditations to another level.<br style=\"\">  \t           - Georgiy O.<br style=\"\">  \t<br style=\"\">  \t           I feel that I&#039;m addicted to meditations with Tharyn. I can&#039;t imagine feeling so grounded, relaxed and peaceful without Tharyn&#039;s daily 30-minute guided meditation sessions.<br style=\"\">  \t           - Laura V.<br style=\"\">  \t<br style=\"\">  \t           Tharyn&#039;s guided meditations helped me connect better to my source, <strong style=\"\">strengthen my focusing muscles and clear my mind of all worries.</strong> Whenever I meditate, I can always feel that everything is going to be okay and that nothing is more important than how I feel.<br style=\"\">  \t           - Ng Khai Y.<br style=\"\">  \t<br style=\"\">  \t           Tharyn! Thank you for this. <strong style=\"\">Your guided meditations are the part I wait for by the end of the day. </strong>Thank you for taking this initiative. You&#039;re awesome!<br style=\"\">  \t           - Thabit H. <br style=\"\">  \t<br style=\"\">  \t           Tharyn&#039;s daily meditations <strong style=\"\">always leave me refreshed and awakened.</strong> His signature compassion for people and the earth is characteristic in his guided mediations. He caters so much to what works for the group and finds a key way for us to grow as a group, even if the group changes every day! Thank you Tharyn for these daily magical experiences and just for who you are!<br style=\"\">  \t           - Cynthiã W.<br style=\"\">  \t<br style=\"\">  \t           Just came back from Tharyn&#039;s mediation. <strong style=\"\">Feeling just awesome!</strong> Definitely, those 20 minutes of mediation are the highlight of my day so far! To make a number of people to feel much more awesome then they were feeling before - that`s real power, right!?<br style=\"\">  \t           - Natasha Z. <br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">I am a newbie to meditation.</strong> Had not been interested on it or keen to start -- but then I started working in Mindvalley and joining Tharyn&#039;s live meditation sessions. I have been attending his sessions now 3 times a week and it is the highlight of my week!! <strong style=\"\">I can see how much more aware and relaxed I am</strong>, his advice is valuable and honest.<br style=\"\">  \t           - Miriam L.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Start Your Journey Today...</strong>  </p>  <p style=\"\">  \t            My goal is to get this simple course and the benefits of meditation into the lives of as many people as possible. As an entrepreneur, I know that free stuff isn&#039;t perceived as valuable, nor taken as seriously, as something you actually paid for. Since I want you to take this course and your practice seriously and get the most benefit, then I believe that paying for it is a better idea.  </p>  <p style=\"\">  \t            Besides, a course in meditation like this can cost up to hundreds of dollars from giant meditation teaching companies. They bog you down with extra material that isn&#039;t necessary to get started. This course is simple, to the point, and reasonably priced. Just $39. That&#039;s the same price as a good book. I believe it&#039;s very fair for the simple techniques that I took years of practice to hone.  </p>  <p style=\"\">  \t<strong style=\"\"> Try the course essentially for free</strong> with the 30 day money back guarantee. How cool is that? Take the course now, consume everything in under 3 hours, learn the techniques - and if you still don&#039;t think it&#039;s worth $39, then I&#039;ll give back every penny. :)<br style=\"\">  \t<br style=\"\">  \t            Meditation has changed my life, boosted my creativity, and <strong style=\"\">given me hundreds of my most incredible business and marketing related ideas.</strong> I believe everyone can benefit from this practice. <br style=\"\">  \t<br style=\"\">  \t<strong style=\"\"> Startup Meditation today. Click Take This Course above to get started now.</strong>  </p>  <p style=\"\">  \t  Cheers,<br style=\"\">  \t  - Tharyn Taylor  </p>", 
    "end_date": null, 
    "title": "Meditation for Entrepreneurs", 
    "price": "25.00", 
    "instructors": "Tharyn Taylor", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/97762_c0f3_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-startup-meditation-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-26T11:29:15Z"
}