{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Curso actualizado al 19 de Mayo del 2016.  Este curso es el resultado de más de 25 años de meditación y estudios espirituales. </strong></p>\n\n<p>Te enseño de manera sencilla las dos técnicas de meditacion más poderosas para desarrollar tu ser espiritual, para fortalecer tus músculos espirituales y para agudizar tus habilidades como alma.</p><p><strong>Bono agregado el 19 de Mayo del 2016:  2 Instrucciones Guiadas para Meditar en la luz que incluyen 15 minutos de OM una, y la otra 15 minutos del tono para meditar.</strong> NO son meditaciones guiadas sino instrucciones para que mismo realices la meditación.</p>\n\n<p>Utiliza tus músculos espirituales, reestablece la salud de tu hipocampo, obtén paz, serenidad, relajación, fortalece tu intuición y accede información que te dará una ventaja en tu vida!</p>\n\n<p>Las lecciones vienen en video, también voy a incluir material escrito y enlaces que te llevarán a otros sitios donde podrás profundizar tu conocimiento en algunos temas.</p>\n\n<p>  Por supuesto estoy para servirte! Dentro del curso podrás  hacer tus preguntas, por favor, hazlas!  Es una gran manera para que todos aprendamos juntos!</p>\n\n<p>Si deseas enfocarte tan solo en tus cualidades como alma, fortalecerlas, despertarlas, desarrollarlas y gozarlas, únete al curso! Regístrate ya para que empiezes a aprender las dos técnicas que se han venido ensenando de manera secreta y para la cuales se piden muchos requisitos.</p>\n\n<p>Yo te las enesenno aqui, sin que te tengas que volver vegetariano, sin que tengas que dejar de fumar, tomar y otras cosas!  Claro que si estas interesado en tu espiritualidad muy posiblemente ya tengas un estilo de vida muy sano pero si no no te preocupes. Estas meditaciones son para todos.</p>\n\n<p>Únete y empieza a desarrollarte como alma <strong class=\"redactor-inline-converted\">YA!  Cada segundo que pases sin registrarte puede costarte tu paz y felicidad espiritual!</strong></p>", 
    "end_date": null, 
    "title": "Meditacion Para Fortalecer Tu Ser Espiritual Y Tu Intuicion.", 
    "price": "20.00", 
    "instructors": "Myriam Zuzs", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453580_9fa2_3.jpg", 
    "course_url": "https://www.udemy.com/meditacion-meditacion-para-tu-ser-espiritual/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-22T01:47:28Z"
}