{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>What people have said about this Guided Meditation Course:</strong></p><p><strong>\" I've listened to a good amount of guided meditations before - for example off of you tube....and some are pretty good. However, I've so far found yours to be absolutely FANTASTIC!!! \"</strong></p><p><strong><strong>                                                         ~Robert N.</strong><br></strong></p><p><strong><strong>\"Not sure why but I got tears while listening to the meditation, I love it!\"</strong></strong></p><p><strong><strong>-Laura G.</strong></strong></p><p><strong><strong>\"Some of the approaches are very interesting. Thanks!\"</strong></strong></p><p><strong><strong><br></strong></strong></p><p><strong>Guided Meditation Course updated as of February 22nd, 2016.</strong></p><p><strong>Make sure to listen to the deep spiritual Guided Meditation with headphones and c<strong>heck out the free previews and sample!</strong> </strong><br></p><p><strong></strong></p><p><strong>Being a Positive Person is your True Natural State of Being.</strong> Unfortunately well intentioned but uninformed parents, relatives, the media and society have led us to believe that people who are positive are rare.</p><p>This Spiritual Guided Meditation will remind you of your true nature so you become a naturally positive person all the time.<br></p><p>This Guided Meditation uses strong hypnotic techniques to achieve the deepest relaxation possible to reach your subconscious mind which lays the ground for the spiritual guided meditations to <strong>boost your transformation</strong> and reprogram your subconscious mind in the shortest possible time.<br></p><p>These relaxation techniques combined with strong spiritual concepts embedded in the script of the Guided Meditation create a powerful combo that transforms you from the inside out.</p><p>In this Guided Meditation course you will:<br></p><ul><li>Understand why you are in a negative state of mind most of the time</li><li>How to change your thoughts so they become positive with our without meditation</li><li>Find a deep spiritual 60 minutes long guided meditation to reprogram your subconscious mind to be positive.</li><li>Download the 60 minutes long deep guided meditation so you can listen to it anywhere!</li></ul><p>This deep  spiritual guided meditation will is a great tool to assist you in your transformation into a positive person very soon!</p>", 
    "end_date": null, 
    "title": "Meditation - Guided Meditation To Be Positive!", 
    "price": "20.00", 
    "instructors": "Myriam Zuzs", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650820_d224.jpg", 
    "course_url": "https://www.udemy.com/guided-meditation-become-a-positive-person-and-thrive/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T01:57:27Z"
}