{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tHistoria de la meditación una de las practicas más antiguas, ya que debemos remontarnos a miles de años atrás y llegar hasta la civilización que se desarrolló al pie del Himalaya, en el Valle del Indo aproximadamente 3.000 años a.C. La llamada &quot;civilización del Indo&quot; se conoce especialmente por el descubrimiento de sus dos ciudades más importantes: Mohenjo-daro, a orillas del Indo y Harappa, en el Punjab. Como de esta cultura avanzada sólo nos han quedado los restos arqueológicos, sólo podemos suponer las ideas religiosas o filosóficas de la civilización que habitó esas ciudades; pero entre el ajuar de los habitantes se han encontrado pequeños sellos de es-tearita. ¿Quieres conocer más sobre la meditación conocer esta parte fundamental? Alguna vez te preguntaron que es la meditación y no supiste responder que era. Y busca una forma de relajarte y disminuir los niveles de estres. Quisieras saber algo más de historia de este maravilloso curso. ¿Qué materiales necesitas para este curso? Solo 3; un lugar, concentrase y saber relajarse. ¿Cuánto tiempo dura el curso? Solamente dura 30 minutos aproximadamente. ¿La estructura del curso? Se divide en 4; -Historia de la meditación. -Propósito y diferencia -Tipos de Meditación y práctica -Pasos para Meditar ¿Por qué tomar el curso? Muy simple si quieres una vida más sana, esta práctica es la clave. Así que los invito a practicar esta maravillosa técnica que les podrá servir para controlar sus emociones y estado mental.  </p>", 
    "end_date": null, 
    "title": "Meditación, Historia y Tecnicas.", 
    "price": "20.00", 
    "instructors": "Diego STV", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/191052_0611_2.jpg", 
    "course_url": "https://www.udemy.com/meditacion-historia-y-tecnicas/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-30T00:56:24Z"
}