{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is for people who feel stressed really often. Are you experiencing that constant tension in your body reflecting all your worries? Maybe you just want to live a more happy and relaxed life. This course is for you.  </p>\n\n\n\n\n\n<p>With me, you’ll learn the most effective proven method to reduce you stress on a daily basis, which is called MINDFULNESS MEDITATION. This course will offer you the simplest and quickest way to understand what mindfulness really is about and how you can use it to reduce your anxiety. </p>\n\n\n\n\n\n\n\n\n\n<p>In the lectures, we’ll start by talking about stress, what it is, what it does to your body and mind. Then, we’ll break together some misconceptions about meditation. I’ll then introduce you to the philosophy of mindfulness meditation and what are the fundamental things to know before practicing it. You’ll then be able to experience 4 different mindfulness techniques with the guided meditations that I recorded for you. We’ll finish this course with some ‘’on the moment’' techniques that you’ll use to reduce your stress instantly right before doing an exam, presentation or anything that is causing your anxiety. This course contains a lot of support material and at the end, you’ll have access to a worksheet that will help you practice mindfulness all by yourself. You’ll also have a bonus video showing you some of the best apps and books on mindfulness. </p>", 
    "end_date": null, 
    "title": "Meditation Initiation: An Hour That Will Change Your Life", 
    "price": "20.00", 
    "instructors": "William Plante", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830794_ecaf_3.jpg", 
    "course_url": "https://www.udemy.com/eliminate-stress-with-mindfulness/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-24T19:14:05Z"
}