{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Welcome to “Meditation for Children\"!</p><p>This course will give you a greater understanding on how and why to meditate and most importantly, how to share these benefits with your children in a fun and impactful way.</p><p><em>Are you a parent with a child that has a lot of extra energy?</em></p><p><em>Are you looking for ways to relieve stress and live a more calm filled life?</em></p><p><em>Are you concerned about the lack of mindfulness amongst children today?</em></p><p><em>Would you like to share in an experience with your children that will give them the tools to be more successful in life?</em></p><p><em>Do you not know how to meditate but are interested in learning?</em></p><p>Well, if you answered <em>YES</em> to any of the above questions this is the course for you!</p><p>As a Martial Arts practitioner for over 30 years and teaching for the majority of that time I love teaching Martial Arts. My name is Master Chris Berlow. I've had my own school for almost two decades and have helped both adults and children reach their full potential in and out of their martial arts training. I'm extremely passionate about giving my students a deeper understanding of the arts especially meditation. Nothing inspires me more than helping students understand how to meditate and help them receive benefits that last a lifetime.</p><p>Meditation is needed now!  In the local schools, homes, the communities, everywhere!   The use of personal technology devices and with degradation of inter-personal relations, there needs to be an intervention.  The perfect solution is to teach the younger generation the skills of mindfulness and meditation and apply it to their everyday lives.</p><p>By the end of this course you'll definitely know how to meditate! Better yet, learn some great methods to introduce meditation for children.  In this program we'll break down foundational meditation and breathing techniques that are practiced by many practitioners throughout the world.</p><p>This course will get you and your child meditating quickly. Guaranteed!</p><p>Content and Overview</p><p>First thing you need to know is that there is no \"FLUFF\" here! We get right to the point! All video's are high def and professionally produced to help you learn how to meditate and be able to share with your children.</p><p>By the end of this course you'll learn:<br></p><ul><li>The benefits of meditation</li><li>How to practice breathing properly</li><li>How to perform different styles of meditation</li><li>Methods to get your children started in meditation</li><li>How to meditate with your children in nature</li></ul><p>Each lesson covered in this course will thoroughly explain and show students the techniques being discussed.  Students must be sure to spend the time to practice because the only way to benefit is by practicing regularly.<br></p><p>The course is broken into three sections.  First section explains the benefits of meditation and why it is important.  Section two is really geared towards teaching the adult student how to practice meditation and develop the skills needed to show their children.  Section three is focusing on ways to introduce and practice meditation with children.</p><p>Success Tip: The most important tip that will help you benefit from this course is to focus on the breathing.  Breathing properly is essential to impactful meditation.  Please be sure to block out the time to practice daily even if it is for just a few minutes.</p><p>All the lessons in “Meditation for Children\" are instructed by Master Chris Berlow. Master Berlow had been practicing meditation for over 15 years under the guidance of his Taekwondo Grandmaster; Grandmaster Byung Min Kim.  He is an avid Martial Arts practitioner and instructor, an outdoor enthusiast, author, co-author and entrepreneur. He has been practicing and teaching meditation for a very long time and continues his own spiritual training daily.  All HD videos were filmed and edited by Offir Kilion. Mr. Kilion is a graphic artist, photographer and videographer. In addition, he owns and operates a successful graphic design company that offers the finest services available.</p><p>Together, they teamed up to bring an array of online programs to students all over the world.</p><p>OK. Enough talk and it's time for action!</p><p>Register today and let's get you to started in “Meditation for Children\"!</p>", 
    "end_date": null, 
    "title": "Meditation For Children", 
    "price": "40.00", 
    "instructors": "Inspired Online Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588406_1a9b.jpg", 
    "course_url": "https://www.udemy.com/meditation-for-children/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T13:45:28Z"
}