{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Mindfulness meditation feels good! Enroll with this course to f</strong><strong>ind a <strong>whole new way</strong> of <strong>being mindful </strong>that </strong><strong><strong>feels great, all day long.</strong></strong><br></p><ul><li><strong>5 Star Course</strong></li><li><strong>Nearly 2000 Happy Members from 92 countries</strong></li><li><strong>Satisfaction Guaranteed - or Your Money Back</strong></li></ul><p><strong></strong></p><p>You've already studied mindfulness meditation and felt some benefit, but <strong>YOU KEEP FORGETTING</strong> to be mindful, don't you, when you're out doing stuff, right?</p><p><strong>You're not reaching the 'Gold Standard' of Mindfulness!</strong></p><p>The 'gold standard' of mindfulness is staying mindful while you do things.</p><p>So where are you going wrong, and why you aren't enjoying your mindfulness all day long?</p><p>The answer is catching yourself the moment a new stimulus or idea arrives, and bridging that gap so you <em>stay</em> mindful <em>while</em> you do stuff. That's the real goal for mindfulness.</p><p>This video course shows you in easy steps how to bridge that gap, and provides a practice road-map, so you can enjoy being mindful <em>all day long!</em></p><p><strong>Here's the deal, most mindfulness meditation practise works like this:</strong></p><p>Be conscious of yourself, be present in the moment, and non-judgementally take stock of what your mind and body are telling you.</p><p>There are many different ways to learn mindfulness meditation, ranging from awareness of the breath to focusing on compassion or loving kindness.</p><p><strong>The benefits of mindfulness include less stress and anxiety, greater confidence, and living your life to the full.</strong></p><p>And it's simple enough, if you practice your mindfulness meditation – you've already found that out, right?</p><p>But <strong>I'll bet my bottom dollar</strong> you keep <strong>drifting off</strong> when you're following your breath. And most of the day you're <strong>not </strong><strong>mindful at all</strong> – more like <strong>mind-dull!</strong> All those hours spent in mindfulness meditation for only a little benefit. And is it really, honestly helping you, right now, when you're using a computer or screen, or even doing anything where you have to keep reacting?</p><p><strong>This is the gap that Active Mindfulness bridges.</strong></p><p>Active Mindfulness instruction is fun, fast and fascinating.</p><p>We'll take advantage of the skills I've built up over the years teaching people just like you, who love mindfulness, but struggle to keep it going all day long.</p><p><strong>You'll find...</strong></p><ul><li>Easy <strong>bite-sized</strong> training sessions.</li><li><strong>Short</strong>, no-nonsense seven-minute mindfulness meditations.</li><li><strong>Step-by-step instructions</strong> to build up your mindfulness.</li><li>Beginner, intermediate and advanced <strong>mindfulness challenges </strong>in real-world settings to take your Active Mindfulness to the next level.</li><li><strong>Bonus advanced techniques</strong> to help you flourish.</li><li>And <strong>regular updates</strong>, support and one-to-one help as you need it.</li><li>Your course is available on PC, Mac, Android and iphone, and on Udemy is backed by a no-quibble <strong>30 day money back guarantee</strong>, so you've absolutely nothing to lose. Enroll, click \"Take This Course\" and start right away, or leave and stay stuck in the same old rut... <strong>you're free to choose!</strong></li></ul>", 
    "end_date": null, 
    "title": "Mindfulness Meditation : Enjoy All Day Active Mindfulness", 
    "price": "30.00", 
    "instructors": "James Crow", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/454140_edfb_3.jpg", 
    "course_url": "https://www.udemy.com/active-mindfulness/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-22T21:03:59Z"
}