{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong>Mindfulness Meditation for Active Lives</strong>  </p>\n\n<p>  \t  In „Mindfulness Meditation for Active Lives“, you will learn how to use mindfulness to deal with stress and anxiety, to improve your concentration and focus and to help increase your performance and overall well-being.  </p>\n\n\n\n\n\n<p>  \t  This course consists primarily of videos that guide the user through mindfulness meditations. Users can complete the videos in sequence or simply select the videos of interest. No previous knowledge or experience in meditation is required.  </p>\n\n\n\n\n\n<p>  \tThe content available in this course is not an attempt to practice medicine or provide specific medical advice nor does this establish a doctor-patient relationship. This material is not a substitute for professional medical advice based on your personal circumstances. Users of this website waive any claims against You Productions.  </p><p><br></p>\n\n\n\n\n\n<p>  \t<strong>Why mindfulness meditation?</strong>  </p>\n\n\n\n\n\n<p>  \t  Neurologists have been researching the positive effects of mindfulness meditation. They find that meditating regularly, even for short periods of time, can help to improve one’s mental and physical well-being. Mindfulness helps to reduce stress, feelings of fear and tiredness. Mindfulness helps to lower blood pressure and pulse. The brain waves change and make the brain calmer and at the same time more productive.  </p><p><br></p>\n\n\n\n\n\n<p>  \t<strong>Course Contents</strong> <br>  \t   + Introduction about mindfulness  </p>\n\n\n\n\n\n<p>  \t  + Worksheets to define one’s own goals, plans and tracking  </p>\n\n\n\n\n\n<p>  \t  + Video-based exercises for beginners and more advanced users  </p>\n\n\n\n\n\n<p>  \t  + Recommended reading and further resources<br>  \t<br>  \t<strong></strong>  </p>\n\n\n\n\n\n<p>  \t<strong>Meditation Topics</strong></p>\n\n\n\n<p><strong></strong><strong></strong>Best Posture for Meditation  </p>\n\n\n\n\n\n<p>  \t  Concentration Exercises  </p>\n\n\n\n\n\n<p>  \t  Breathing Meditations  </p>\n\n\n\n\n\n<p>  \t  Anxiety Relief  </p>\n\n\n\n\n\n<p>  \t  Dealing with Performance Anxiety  </p>\n\n\n\n\n\n<p>  \t  Preparing for Time with Family  </p><p><br></p>\n\n\n\n\n\n<p>  \t<strong></strong>  </p>\n\n\n\n\n\n<p>  \t<strong>Meditation for the Active Lives</strong></p>\n\n\n\n<p><strong></strong>Meditation comes from the East. It developed in India and China and has been passed on and further developed over thousands of years. YOU Productions brings the methods from Vipassana Meditation and tailors them for people with busy lives. These meditations are neutral and secular. We’re not promoting a guru or historical persona. These meditations are designed to deal with the issues of a modern society. They are short and guided to address the needs of people with busy lives.  </p>\n\n\n\n\n\n<p>  \t  That’s why they’re called „YOU“. Because, it’s about you. It’s for you. It’s by you. And it has to come from You.  </p>", 
    "end_date": null, 
    "title": "Mindfulness Meditation for Active Lives", 
    "price": "45.00", 
    "instructors": "Candace Cheng", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/189574_3292_4.jpg", 
    "course_url": "https://www.udemy.com/mindfulness-meditation-for-active-lives/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-27T09:18:27Z"
}