{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn how to handle stress in a positive way and how to stay focussed and relaxed. Improve your productivity and finally take some time for yourself by applying mindfulness to your daily life.</p><p><strong style=\"\">With Mindfulness You Can Be Busy, Without Feeling The Pressure</strong></p><ul style=\"\"><li>Learn the Basics of Mindfulness</li><li><span></span>Get Downloadable Meditation Tracks</li><li>Learn the Basics of Acceptance and Commitment Therapy</li><li>Learn About Your Brain and Your Mind</li><li>Learn How to FocusLearn How to Handle Stress in a Positive Way</li><li>Learn How to Apply Mindfulness to Your Daily Life</li></ul><p><strong style=\"\">This Mindfulness Course Is For H</strong><strong style=\"\">ardworking, Busy People Who Would Love To Feel More Relaxed</strong></p><p>This Mindfulness Course will help you keep calm while under pressure and live in the present moment. It will help you regain your focus and it will help you to be more effective in your work and life in general. Mindfulness is all about training your brain, and it is a tool to enhance your productivity. </p><p><strong style=\"\">Content And Overview</strong></p><p>In this course, I start by telling you all about the history and basics of Mindfulness, your braind and your mind. This informatin will make it easier to process the lectures and really get into Mindfulness. I will give you tips and trick on meditating, you will learn about good posture and how tp be in the present moment. Don&#039;t worry, I won&#039;t throw you in the deep end: I&#039;ll be there every step of the way! You can always send a message and I will respond as quick as possible. </p><p>The course is a mindfulness course with a pinch of Acceptance and Commitment Therapy. It includes video lectures about our mind, thoughts, stress and focus and downloadable meditations. The course should take you six weeks to complete. It is divided into six sections, varying from the basics of mindfulness to applying mindfulness to your daily life. It is a very practical course, with a lot of exercises you can do at work or at home. You can do the exercises wherenever you want. They won&#039;t take long, but they will really help you to get &amp; stay Mindful! </p>", 
    "end_date": null, 
    "title": "Mindfulness For Busy People", 
    "price": "20.00", 
    "instructors": "Vincent van Overveld |&samhoud media", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523328_714e_3.jpg", 
    "course_url": "https://www.udemy.com/mindfulness-for-busy-people/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T14:20:31Z"
}