{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<h4> </h4>  <h4>Easily build a meditation a practice today!</h4>  <h4>Nurture a life rich with inner peace with this exciting online workshop.</h4>  <hr style=\"\">  <p>  \t<strong style=\"\"><strong style=\"\">Create  a deeper connection to the Self, decrease anxiety, and be on your way  to balance with this comprehensive meditation course</strong> taught by meditation expert and mala artist Saraswati.</strong>  </p>  <p>  \t                 In this course you will learn to invite subtle shifts immediately into  your every day life with easy to implement Yogic meditation techniques.  These ancient meditation methods are incredibly powerful and available  to anyone!  </p>  <p>  \t                 Learn to lay the foundation of a <strong style=\"\">successful and meaningful</strong> practice even if you have never meditated before or have had challenges quieting the mind in the past.  </p>  <p>  \t<strong style=\"\">Just let Saraswati guide you with her easy to follow lectures on the most transformational yogic meditations available.</strong>  </p>  <p>  \t                The good news? No meditation experience is necessary to take this course and anyone of any age can benefit from them!  </p>  <p>  \t                 Saraswati will be honored to lead you every step of the way, giving you  the tools to create a practice that is consistent and identify which  techniques are right for <em style=\"\">you </em>on your unique personal journey.  </p>  <p>  \t<strong style=\"\">This course is perfect for you if you seek to: </strong>  </p>  <p>  \t<strong style=\"\"> - Have a greater understanding of the Self </strong>  </p>  <p>  \t<strong style=\"\"> - Create a deeper connection to your personal spiritual path </strong>  </p>  <p>  \t<strong style=\"\"> - Decrease feelings of anxiety and worry </strong>  </p>  <p>  \t<strong style=\"\"> - Lower stress levels in your everyday life </strong>  </p>  <p>  \t<strong style=\"\"> - Improve your relationships and increase compassion </strong>  </p>  <p>  \t<strong style=\"\"> - Balance your emotions and act from a place that is less reactionary </strong>  </p>  <p>  \t                 Join Saraswati today and explore all aspects of meditation including  the purpose of meditation, postures, pranayama (breathing exercises),  mantras, malas (yes, those beautiful prayer beads!!), visual meditation  and more.  </p>  <p>  \t                 We will address common obstacles to meditation and dig deep on how to  inspire more consistency with Saraswati&#039;s one simple secret.  </p>  <h4> Plus a BONUS Meditation Journal!</h4>  <p>  \t                Get a beautiful FREE meditation  journal to print out as many times as you like to keep you inspired  during your meditation sessions. This is one of the best tools to keep  you focused and to gauge your progress and it is yours free upon joining the course.  </p>  <h4>Click &quot;take this course&quot; to the upper right of this page and get started right away.</h4>  <p>  \t                You  will have LIFETIME access to the course and all the materials, plus  downloadable PDFs and, of course, the FREE meditation journal.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Paths to Peace: Essential Guide to Yogic Meditation ", 
    "price": "50.00", 
    "instructors": "Lauren Saraswati Zavlunov", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429982_25b5_2.jpg", 
    "course_url": "https://www.udemy.com/paths-to-peace/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T14:57:39Z"
}