{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul><li><em>Over 100 satisfied students in the FIRST WEEK</em></li><li><em>Only FIVE STAR ratings so far</em></li><li><em>Very happy customers with POSITIVE REVIEWS</em></li></ul><p><strong>What my students are saying about Practical Meditation</strong></p><p><em>\"Excellent, comprehensive, and at a good pace for me...\" -<strong> Jean F.</strong></em><br></p><p><em>\"...the instructor gives a wealth of information about meditation and how it can benefit us. Love this!\" - <strong>Reinita O</strong>.</em></p><p><em>\"Very well done. Good for people just starting or seasoned meditators.\" - <strong>Bernard M.</strong><br></em></p><p><strong>New Lecture(s) JUST ADDED:</strong><br></p><ul><li><em><em>Lecture 38 - Ten Ways to Stay Motivated</em></em></li><li><em><em>Lecture 61 - Dealing with Resistance</em></em></li></ul><p><em><strong>PRACTICAL MEDITATION SUMMARY</strong></em><br></p><p style=\"\">For over 5000 years the greatest minds in history have understood the benefits of meditation. Meditation enables you to connect with your inner-self where energy, creativity and inner wellness are your natural state of being. Learn about meditation and how to integrate this powerful practice into your daily routine.<br></p><p style=\"\">Greg de Vries, The Meditation Coach, has taught thousands of people to meditate over the last 15 years.   Don't think that meditation is some complex process of clearing your mind  - <strong>if you know how to breathe, you can meditate.</strong></p><p style=\"\">This course will teach you how to do the most popular type of meditation including: <strong>breath awareness meditation, mantra meditation, jappa meditation, and more</strong>.  Everything is laid out for you - all you need is an open mind and a little time to dedicate to your new wellness practice.</p><p style=\"\"><strong>Hours of guided meditation audios</strong> are included for you to use anytime day or night.</p><p style=\"\">It's time to take control of your future. What would life be like with enhanced health and confidence, better sleep, enhanced focus, concentration and memory?  Its time to find out!</p><p style=\"\"><em><strong>Enroll in Practical Meditation today.</strong></em></p>", 
    "end_date": null, 
    "title": "Practical Meditation - Master Meditation Today", 
    "price": "45.00", 
    "instructors": "Greg de Vries", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/517102_6231_3.jpg", 
    "course_url": "https://www.udemy.com/practicalmeditation/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T14:02:08Z"
}