{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul style=\"\"><li style=\"\"><strong style=\"\">Thousands of satisfied students enrolled in my courses</strong></li><li style=\"\"><strong style=\"\">Dozens of TOP reviews from very happy students</strong></li></ul><strong style=\"\"></strong><strong style=\"\"></strong>This course will dramatically reduce your levels of stress and anxiety. The lectures contained in this course will show you in a very graphical and easy-to-learn way, how to practice one of the most powerful and effective meditation techniques that will give you the mental and physical relief that you are seeking.<p style=\"\">I constantly update the content of this course and I always answer all of your questions in the most comprehensive way.  I congratulate you on your commitment to improving your physical and mental wellbeing and it will be my honour to serve you on your road to personal transformation.</p><p style=\"\"><strong style=\"\">What students are saying: </strong></p><p style=\"\">\"What a fantastic course! I have been trying different meditation techniques for months and I couldn't find one to suit me.  Cesar has done a fantastic job in explaining in great detail what you need to do &amp; know to make the most of your meditation practice, and it certainly has worked for me! I feel that my mind is much settled and I'm better able to pay attention to what matters most.\" - <strong style=\"\">Jason Gibson</strong></p><p style=\"\">\"The quality of Cesar's videos, the clarity of his explanations and the meditation exercises are superb! I recommend this course to anyone who is looking for a tried-and-tested method to alleviate the pain that comes with stress\" - <strong style=\"\">Maria Castro</strong></p><p style=\"\">\"I feel calmer, more balanced, more at peace after just a week of putting into practice the meditation technique that Cesar shared in this course. It was fairly easy for me to get going given the crystal clear instructions and now I have practice that I can call my own - thank you Cesar!!\" - <strong style=\"\">Paula Nalbarte</strong></p><p style=\"\">\"Wow Cesar - I wish I had taken this course last year when I was in the market for an effective, simple and practical way to deal with my stress issues.  My family, friends and co-workers have noticed that I don't trigger the stress reaction as much as I used to.  My relationships have truly benefited from the practice that you have taught me.  I can't thank you enough\" - <strong style=\"\">Christian Berger</strong></p><p style=\"\">\"This course has taken me out of the emotional ditch I was in for the past few months.  The videos in all the lectures are straight to the point - no fillers, nice flow and awesome content.\" - <strong style=\"\">Rene Gallardo</strong></p>", 
    "end_date": null, 
    "title": "Reduce Your Stress & Anxiety Practicing a Simple Meditation", 
    "price": "20.00", 
    "instructors": "Cesar Gamio", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577220_8d64.jpg", 
    "course_url": "https://www.udemy.com/reduce-your-stress-anxiety-practicing-a-simple-meditation/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T08:40:28Z"
}