{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Self Hypnosis Course for Beginners</strong></p><p>In this course you will learn how to:</p><ul><li>put yourself into hypnosis, </li><li>how to put yourself into trance</li><li>give yourself suggestions </li><li>alter your state to feel relaxed,happy and ready to take on the world.</li><li>and come out of hypnosis feeling refreshed and at ease. </li></ul><p></p><p>You will be able to do this anytime you want. You will learn from a certified hypnotist <strong>the exact steps to go in and out of hypnosis effortlessly, while making powerful changes</strong>.</p> <p>  \t            Self hypnosis and hypnosis have been used for hundreds of years to make powerful changes. They can be used to lose weight, stop smoking, achieve goals and so much more. There are literally hundreds of ways to use self hypnosis to improve your life.</p><p><strong>Discover for yourself how to take control of your life and program your mind to get what you want out of life.</strong></p>  <p>  \t    ***Those who are epileptic should not use brainwave   \t    entrainment technology without the approval of an appropriate   \t    medical physician. However rare, there is a risk of seizure   \t    associated with individuals who are predisposed to epileptic   \t    fits. Consult your doctor directly if you have any questions   \t    or concerns regarding audio brainwave entrainment technology's effect on epilepsy.  </p>  <p>  \t    ** Do not use any of these recordings in the car or while operating machinery.  </p>  <p>  \t    *** None of our products are intended for use in the diagnosis, treatment or cure of any physical or mental condition or dysfunction.  \t  </p>", 
    "end_date": null, 
    "title": "Self Hypnosis Course - A Beginners Guide to Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Instructor Caterina Christakos", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297038_3ad2_2.jpg", 
    "course_url": "https://www.udemy.com/self-hypnosis-30-minute-speed-course/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T12:32:38Z"
}