{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>\"Meditation is a fine art!\"</strong> and like a fine art needs to be approached with the emotions of enthusiasm, curiosity and commitment! If you are new to meditation or are already an established expert, chances are you'll probably learn something new in this course. In this course you will learn about the Vedic Frameworks that form the foundations of traditional meditation found within the Yoga Sutras.</p><p><strong>Learn To Master The #1 Skill In Meditation Mastery</strong></p><p>In my experience, there is basically only one skill to the mastery of the art of meditation. That skill is <em>attention</em>! Learn to direct attention to the 3 crucial areas for successful meditation:</p><ul><li>Physical sensations</li><li>Emotions</li><li>Insight</li></ul><p><strong>Successful Meditation Practice In As Little As 10 Minutes Per Day</strong></p><p>Consistency is key to meditation. The invitation is to be gentle with yourself. In the beginning set aside 10 minutes per day, Monday to Friday at the same time. Take a break for the weekend and come back to your practices on Monday.</p><p>A successful meditation practice will cut to the core of the distractions around you and help you to clearly identify what personal success means to you. The more time you are able to dedicate to your inner journey, the more skill you will have a noticing things and solving problems thereby becoming productive in your daily life. You will find that your interactions with others become a source of satisfaction and as a result you can redefine what happiness means to you.</p><p><strong>Course Contents And Overview</strong></p><p>This course contains over 50 lectures and 3.5+ hours of content! It is designed for you if you are curious about incorporating a meditation practice into your busy life.</p><p>I strongly believe in 3 key ideas: <strong>#1) Education</strong> - learn about what matters to you; <strong>#2) Coaching</strong> - practice and embody that learning; and <strong>#3) Leadership</strong> - show up \"fully and in presence\" with others.<br></p>Every section in this course has an introduction and overview video and wraps up with some action steps to embody the learning. The more you can practice and apply what you learn in the sections determines the results you'll get.<p><br><strong></strong></p><p><strong>Section #1 -</strong> Learn about what makes meditation successful (<strong>HINT:</strong> it's all about you!) and the potential benefits that may be possible for you. Along the way, the invitation is to notice the potential hurdles that may get in the way of you establishing your meditation practice. Becoming aware of this is a major step! </p><p><strong>Section #2 - </strong>We're going to just jump in with a 10-minute \"barely guided\" meditation that will get you started right away! This is so that you will know _for yourself_ just what it means to meditate. Remember, there's no right. There's no wrong. Follow along with this simple guided meditation any way you want and notice what shows up for that. That's it!</p><p><strong>Section #3 - </strong>In this section, we'll take a look at some of the key Vedic Frameworks that support meditation such as reincarnation, karma and dharma. In particular we will take a look at Patañjali's Yoga Sūtras  and see how meditation fits into the inner goal of human life. We will also take a look at the 8-limbs of traditional yoga.</p><p><strong>Section #4 - </strong>Learn about the 5 elements of earth, water, fire, air and ether and how you can incorporate it into your meditation practice. Also learn how to make your body comfortable so that you can lengthen and deepen your meditations easily.</p><p><strong>Section #5 - </strong>We get into the \"good stuff\" of guided meditations here. Follow along with the 10 minute guided meditations and allow yourself to notice. Take conscious control of your awareness and learn to dive within.</p><p><strong>Section #6 - </strong>Congratulations! You've done it! All you need to do is continue along your path.</p><strong>Section #7 - </strong>This section will contain other resources and supplementary materials that will help you on your inner journey.<p><strong>Course Bonuses!</strong></p><p>I am including several bonuses to help you along your inner journey. These worksheets will help you keep track of your meditations and allow you to notice what shows up for you.<br></p><p><strong>Bonus #1 -</strong> \"Power Dump\" Worksheet - Use this worksheet whenever you want to do a mental \"power dump\" so that you can connect your thoughts and the vital energy, prāṇā, to your hands and fingers and get it down on paper!</p><p><strong>Bonus #2 -</strong> \"Amazon Links\" worksheet - Use this document to help you identify the necessary elemental combinations to introduce into your meditation space.</p><p><strong>Bonus #3 -</strong> \"Goals For Meditation Practice\" Worksheet - Print this worksheet so that you will always know the goals of your meditation.</p><p><strong>Bonus #4 -</strong> \"Meditation Reflections\" Worksheet - After you come out of your meditation, use this worksheet to record your physical sensations, emotions and insight you got from your meditation. Also included are a basic list of emotions to help you get started.</p><p><strong>Bonus #5 - </strong>Downloadable\n MP3 versions of the lectures for easy listening on your favorite MP3 \ndevice. Listen while relaxing, driving, or at the gym. The key is to \nsharpen your skills of \"attention\" and \"noticing.\" Good luck!<br></p><strong></strong><p><strong>Take Action &amp; Enroll</strong></p><p>\"Take This Course\" now and make the commitment to jump straight into creating a successful meditation practice for yourself. I know meditation created shifts within me and resulted in a <strong>rewarding personal and professional life</strong>.</p><p>See you on the inside and check out the preview videos to see what you'll be getting!</p><p>Wishing you much success in your journeys,</p><p>Thushyanthan<br></p>", 
    "end_date": null, 
    "title": "Successful Meditation- 10 Minutes For Rich Inner Journeys", 
    "price": "40.00", 
    "instructors": "Thushyanthan A", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609402_95ff_3.jpg", 
    "course_url": "https://www.udemy.com/successful-meditation/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T19:31:04Z"
}