{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t              These authentic Tai Chi &amp; Chi Kung meditations will introduce you to a number of simple and powerful techniques in Eastern healing arts. Ramel (Rami) Rones, master teacher, best selling author, and researcher shares his teaching with you in a lively, fun and easy-to-follow format.  </p>  <p>  \t  This course includes: gentle stretches, silent meditations, guided meditations, basic strengthening exercises, select Tai Chi forms, cleansing meditations, and easy relaxations, all divided up into short, easy-to-digest sections.  </p>  <p>  \t              Rami has designed a number of medical clinical trials such an investigation into the benefits of <strong style=\"\">Tai Chi for Fibromyalgia, and Tai Chi for Knee Osteoarthritis</strong>.  Much of his research design is included in this course.  Rami&#039;s Fibromyalgia and Tai Chi study was published in the <strong style=\"\">New England Journal of Medicine</strong> and featured in the <strong style=\"\">New York Times</strong>.  </p>  <p>  \t              Rami has also done extensive teaching at the internationally recognized <strong style=\"\">Dana-Farber Cancer Institute, Tufts Medical Center</strong> and the <strong style=\"\">Boston Medical Center</strong> where he continues to help patients deal with, and recover from, a wide variety of ailments and the side effects that often occur during treatment.  </p>  <p>  \t        Rami runs and publishes a blog twice a week. All of Rami&#039;s courses can be supplemented with the tips, tricks, and extra materials that Rami provides <strong style=\"\">for FREE</strong> at his website. Please visit Rami&#039;s Instructor page for information on Rami&#039;s website as well as his social media profiles. Also visit Rami&#039;s Youtube channel for more video content to augment your health and fitness routines.  </p>  <p>  \t              In this course, you will:  </p>  <ul style=\"\">  \t<li>Focus on inner and outer visualizations, honing your ability to clear your mind</li>  \t<li>Engage in easy strength exercises to increase your body awareness and fitness</li>  \t<li>Practice distilled movements from the ancient arts of Tai Chi and Chi Kung</li>  \t<li>Strengthen the connection between your body and your mind</li>  \t<li>Experience more effective relaxation techniques to heal and rejuvenate faster</li>  \t<li>Train more with each meditation using guided and timed bonus videos</li>  \t<li>Improve your physical and mental quality of life</li>  \t<li>Establish a meditation routine that you can use forever</li>  \t<li>And much more!</li>  </ul>  <ul style=\"\">  </ul>  <p>  \tPlease refer to the supplementary material included in the course for detailed guides on how to do the movements and maintain correct body positions.  </p>", 
    "end_date": null, 
    "title": "Tai Chi & Chi Kung: Sitting, Standing, & Moving Meditation", 
    "price": "20.00", 
    "instructors": "Ramel Rones", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/133766_8abb_6.jpg", 
    "course_url": "https://www.udemy.com/mindfulness_martial_arts/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-14T23:52:22Z"
}