{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Meditation Master Class<br><br>Join Mitch Asser as he gives you the tools needed  in an online meditation master class to support and help those who are ready to make meditation a normal part of their daily ritual. More and more of the human family are becoming open to meditation and have the best intentions to make it happen, but sometimes life gets in the way. </p><p><strong><em>* Launch Month - Be one of the first to get exclusive access to this program! </em></strong></p><p><strong><em>*** Just missed out on the January promotion so the course will launch at ONLY $10 and will be raised to $150 as it has been recommended, so be sure to grab it now while it is at such a great price! </em></strong></p><p><em><em>When you register this event, you will be given:</em><br></em></p><ol><li><em><strong><em></em><em>Lifetime access to this meditation program</em></strong></em></li><li><em><strong><em>Bonus interviews with 3 of the worlds up and coming thought-leaders in meditation </em><br></strong></em></li><li><em><em><strong>A challenge to take your meditation to the next level</strong></em></em></li><li><em><em><strong>Guided meditations </strong></em></em></li><li><em><em><strong>Complete on-going support for your meditation obstacles</strong></em></em></li><li><em><em><strong>VIP invitations to new future online meditation events and challenges</strong></em></em></li><li><em><em><strong>Lifetime support for your meditation journey</strong></em></em></li><li><em><em><strong>Able to connect to Mitch personally as a friend in the meditation phone app</strong></em></em></li><li><em><em><strong>Hangouts with me and my friends as we talk about meditation</strong></em></em></li><li><em><em><strong>Bonus videos from different meditation challenges I have hosted </strong></em></em></li></ol><p><strong></strong></p><p>This online meditation master class will help create a supportive network of like-minded people on the same path to help us engrain our meditation practises into our daily lives.<br>\n<br>\n<strong>Who is this for?</strong><br>\n- anyone who wants to learn to meditate<br>\n- anyone who doesn't know what to do when meditating<br>\n- anyone who has tried meditation before but couldn't make it a habit<br>\n- anyone curious about learning more about meditation<br>\n- anyone who is ready to turn inwards and learn as much as they can about themselves<br>- anyone who wants to feel happy, fulfilment, focus, clarity and purpose for life!</p><p>\n<br>\n<strong>What if you already meditate?</strong><br>\n<br>\nPlease also join in and help support those who are just beginning! Your wisdom, knowledge, support and energy with meditation will be exactly what we need to do amazing things in our lifetime. This is a community, not just an online course.<br>\n<br>\n<strong>Will there be support?</strong><br>\n<br>\nMitch will freely provide on-going support and guidance to those who are serious and committed to meditation.</p><p><strong></strong></p><p><strong>Can I Invite My Friends?</strong><br>\n<br>\nYES! Please do. The more people we have in this class, the more amazing the energy will be and you will feel completely compelled to participate 100%!</p><p>-------------------------------------------------------------------------------------------------------------------------</p><p>Many people begin meditation for different reasons. The truth is, meditation helps for all reasons. </p><p>Many people get in to meditation out of desperation to find more clarity, to quieten the mind, to get more focus, for more energy, to sleep less and for very specific things like to help in the aid of being able to overcome certain things like the ability to have a baby. </p><p>Meditation is your ability to connect inwards. Many people have the perceived idea that meditation is about turning your mind off completely. As you continue to meditate more and more, this can happen at certain times. </p><p>However for the most part, you will be connecting inwards. The ability to connect within and deal with what comes up is something that many people choose to ignore. It can be confronting. The more you do it, the more things change externally for you. </p><p>There are many different styles of meditation like vipassana, mantra, ohm and many more. Let me tell you what the best meditation practice is. The best meditation practice is the one that you do. </p><p>Don’t get caught up in doing it any certain way. Don’t try to overcomplicate things so that you end up confused. Confused people do nothing. The best meditation practice that you can do, is the one that you do.</p><p>-------------------------------------------------------------------------------------------------------------------------</p><p><strong>What happens next?</strong><br>\n<br>\nOnce you complete this meditaition course in its entirety, Mitch will have a much larger challenge for you to complete. It is a huge challenge for him personally, it would be awesome to have you take it on and really make long lasting change. </p><p>You have a 30-day refund period, so in the highly unlikely chance you do not completely love the course, you will get a full refund. Therefore it is completely risk free for you to complete this course!<br>\n<br>\nSo join in to this highly anticipated online course and you will get an invite to the next event once it is over!</p>", 
    "end_date": null, 
    "title": "The Meditation Master Class", 
    "price": "30.00", 
    "instructors": "Mitch Asser", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/666584_1c53_2.jpg", 
    "course_url": "https://www.udemy.com/meditation-master-class/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T08:18:01Z"
}