{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is designed for anyone who wants to get started in meditation, everything they need to know to begin a successful practice to positively change their life. I break down why people have trouble when trying to meditate and how to have success this time. In over 25 years of meditation I have seen so many people benefit from it and I believe everyone can and should do it. Despite people thinking their brain is “not wired for meditation” anyone who wants to will be able to have success with my technique. This is because I put your mind on a path and use your inner energy or Chi to hold your attention.   \n\n  \n\n\n\n</p><p>My specific technique is one in which the practitioner learns within their meditation how to move the inner energy within their body, known as Chi (Qi) to remove negative energy or emotions and bring in positive ones. This allows a person to feel more energy, happier, and healthier and raise their vibration to manifest all that they are able to. \n\n  </p>\n\n\n\n<p>I show you a specific technique for meditation for incorporating your Qi (or Chi) as a way of <strong class=\"redactor-inline-converted\">removing negative energy or emotions and adding in the positive emotions you want</strong>. You will have a complete tutorial of what to do and how to meditate with me guiding you through it. \n\n  </p><p><br><strong></strong></p><p><strong>Structure</strong>\n\n  </p>\n\n<p>The course has videos explaining why most people don’t meditate and \nhow to overcome that. Understanding all the different meditation, and \nwhich will be best for you. What posture to take and not to take? What \nshould you expect in a short time doing this. The basics of the course \ncan be completed in less than 30 minutes and the guided meditations are \nall under 15 minutes. \n\n  </p>\n\n\n\n<p> \n\n  </p>\n\n\n\n<p><strong>Guided Meditations Included</strong>\n\n  </p>\n\n\n\n<p>You get four guided meditations all under 15 minutes long. They show \nyou how to move connect with your chi or inner energy and how to move \nit. Also ways to ground yourself, bring in positive energy and emotions,\n and remove negative ones. Understand what your chakras are and how to \nalign and balance them for mental and physical health. They also have \nhigh frequency sounds in order to help raise your vibration, shamanic \ndrums, and other relaxing music to clear and recharge your energy. </p>\n\n\n\n<p><strong>What are the requirements? </strong>\n\n  </p>\n\n<p>All you need is a relaxing place to sit. I like to use something to cover my eyes so that no light gets in but you don’t need it. Easiest place is to sit up in your bed in the morning before you start your day and/or at night before you go to sleep. \n\n  </p>\n\n<p><br><strong></strong></p><p><strong>What am I going to get from this course?</strong>\n\n  </p>\n\n<p>These videos are designed to <strong>show you important aspects of your physical and spiritual body that most people have not yet accessed because they are not aware they exist.</strong> A regular practice using these techniques can help you to <strong>get the most from all aspects of your job, relationship, finances,</strong> health, and your path in life. They have also been shown to increase your energy, allow for better sleep, and other unexpected positive occurrences.\n\n  </p>\n\n<p>Part of the reason people have so much success with these meditations is because <strong>they combine activity from your physical, mental, and energetic body</strong> and attune you to your highest vibration.<strong> They can also help you with stress, lack of confidence, overeating, bad habits, and self-doubt.</strong>\n\n  </p>\n\n<p><strong> </strong>\n\n  </p>\n\n<p><strong>What is the target audience?</strong>\n\n  </p>\n\n<p>- This course is for anyone new to meditation that would like to know how to do it and what to expect from it. Anyone looking to try meditation to relax or any of the other benefits mentioned or they have heard exist. \n\n  </p>\n\n<p>- This course is also for seasoned meditators that are looking to find new techniques to improve their practice or help them in specific areas. \n\n  </p>\n\n<p> \n\n  </p>\n\n<p><strong> </strong>\n\n  </p>\n\n<p><strong>About the Meditations</strong>\n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">The meditations below have been developed from over 20 years</strong> of personal study with <strong class=\"redactor-inline-converted\">Buddhist monks, Shamanic healers, and other Gurus</strong>, while living throughout Asia, Central and South America, and other places I've studied throughout the world. <strong class=\"redactor-inline-converted\">They are thousand year old </strong><em class=\"redactor-inline-converted\"><strong>Non-Religious</strong></em><strong class=\"redactor-inline-converted\"> practices</strong>, that were once in secret and are now available. People I have taught in my classes or privately have lowered stress, overcome overwhelming emotional pain and even physical pain, and have even connecting with unexplainable higher forces. But most importantly once committed, an immediate effect is that positive coincidences and connections almost always dramatically increase in a new practitioners life. They also tell me they have better clarity, creativity, and feel more confident in themselves.\n\n  </p>\n\n<p>I have traveled around the world teaching these meditation in places like Hong Kong to large corporate clients, India to those on a spiritual quest, Costa Rica, New York, and Los Angeles and have charged thousands of dollars in some cases. Because of the possibility to reach a mass audience through this site, I’m able to offer the same meditations for just a few dollars each. <strong class=\"redactor-inline-converted\">This can be your new morning cup of coffee,</strong> but you only have to buy them once! Descriptions for each are available by clicking on the file. My suggestion is to start with the first one and work your way through each. <strong class=\"redactor-inline-converted\">Each one can be done once, or as many times as you like with better and better results</strong> the more you do them.</p>", 
    "end_date": null, 
    "title": "The Energy of Light Meditation Series", 
    "price": "25.00", 
    "instructors": "Bill Farr", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/826844_42a7_2.jpg", 
    "course_url": "https://www.udemy.com/the-energy-of-light-meditation-series/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-20T06:43:38Z"
}