{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t    The <strong style=\"\"><em style=\"\">Transformational Awareness Technique (TAT): 6 Meditations to Emotional Freedom</em></strong> is a complete meditation method. Over the course of six weeks, you will learn a powerful series of non-denominational meditations appropriate for beginners and advanced practitioners alike. You can go beyond stress relief to creating real transformational change in your life.  </p>  <p>  \t    This unique course teaches you how to find deep silence from square one.  </p>  <p>  \t    You <em style=\"\">can</em> rewire your neural patterns for sustainable joy. A life of peace, joy and fulfillment is actually achievable through a step-by-step process.  </p><p>Over the last 25 years, 1000s of my patients have successfully used these meditations and techniques to experience more calm, contentment and joy in their lives.  <br style=\"\"></p>  <p>  \t<strong style=\"\">Mental and Emotional Freedom</strong>  </p>  <p>  \t    Freedom from stress is always welcome, but what really breaks us down are the repetitive emotional patterns of behavior that keep us perpetuating the same destructive and unhealthy dynamics.  </p>  <p>  \t    We live in a culture of addiction. Most of us are always pursuing the next dopamine fix: food, alcohol, shopping, extreme sports, et.. You can break that cycle – not because it&#039;s bad or wrong – but because we can have something better.  </p>  <p>  \t    This something better is only available by going within. As you gradually begin to show up differently in your life, life will begin to feel more joyful.  </p>  <p>  \t<strong style=\"\">What TAT Involves </strong>  </p>  <p>  \t    In the first week, TAT requires only minutes a day. At its most intensive, TAT requires about 20 – 30 minutes, two times a day.  </p>  <p>  \t    When we come from a place of deep silence rather than stress, we are much more productive. We accomplish tasks faster and with more ease, and yet we are not straining. We don&#039;t waste time on unfulfilling escape activities, behaviors or reactions.  </p>  <p>  \t<strong style=\"\">What You&#039;ll Get </strong>  </p>  <p>  \t    By the end of the 6 weeks you will be an advanced meditator that has learned to infuse joy, calm and transformational action into your life. Each weekly lesson includes:  </p>  <ul style=\"\">  \t<p>  \t\t    1.Written instruction  \t</p>  \t<p>  \t\t    2.Video training  \t</p>  \t<p>  \t\t    3.Guided audio meditation  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Transformational Awareness Technique TAT (meditation)", 
    "price": "50.00", 
    "instructors": "John Douillard", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427240_f223_5.jpg", 
    "course_url": "https://www.udemy.com/transformational-awareness-technique/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T22:05:59Z"
}