{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">¿Quieres aprender a meditar?</span>  </p>  <p style=\"\">  \tMuchos de nuestros alumnos a nivel presencial nos habían solicitado una formación online tanto para repetir el curso como para que otras personas pudieran acceder a lo que ellos había conocido. Muchos de nuestros usuarios están repartidos por todo el mundo, en los países más lejanos y gracias a internet, todos somo uno.  </p>  <p style=\"\">  \tTodos sabemos meditar, siempre hemos sabido, unicamente en este momento no somos capaces de recordar como hacerlo. Con una acceso a internet y este video curso, volverás a recordar que es MEDITAR y conseguirás todos los beneficios que aporta la meditación.  </p>  <p style=\"\">  \tTécnicas mindfullnes, relajación, trabajo con la respiración, relajación estática... ejercicios guiados, tanto de meditación como de relajación te permitirán acceder desde el primer momento a las sensaciones únicas de bienestar que te aportan la relajación y la meditación.  </p>  <p style=\"\">  \tAquí teneis a vuestro alcance una forma sencilla, divertida y amena de aprender a meditar, mas de 10 videos en un formato audiovisual de calidad, donde se utilizan las denominadas técnicas mindfullnes junto a un trabajado conjunto sensorial de imágenes, color y sonido. Se han utilizado apoyo hipnóticos mediante sugestiones cinestésicas para permitir el acceso de forma gradual y placentera a la meditación a través de los ejercicios guiados.  </p>  <p style=\"\">  \t<span style=\"\">De esta forma podrás desde el primer momento disfrutar de los beneficios que nos aporta la meditación, relajaros y conectar con vuestro interior, estres, ansiedad, atención plena, toma de decisiones, capacidad para centrar la atención, mejora en los estudios... todo lo que de deseas está a tu alcance.</span>  </p>  <p style=\"\">  \tTrabajaremos la relajación, la respiración y técnicas de automeditación, entre muchas otras.  </p>  <ul style=\"\">  \t<li style=\"\">El curso se compone de varios ejercicios con una duración total de cerca de 2 horas. Lo recomendable es realizar estos ejercicios durante un período de 2 meses a razón de unos 15 minutos diarios.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">El alumno tendrá acceso al curso durante 2 meses, un tiempo en que el alumno realizará las prácticas correspondientes e irá realizando su formación con el material que se pone a su disposición.</li>  </ul>  <p style=\"\">  \tAquí tienes acceso al temario del curso <a href=\"http://www.tienda-damara.com/es/cursos-y-servicios/197-aprender-a-meditar-online.html\" target=\"_blank\" rel=\"nofollow noreferrer\" class=\"external-link\" style=\"\">TEMARIO DEL CURSO</a><span style=\"\"></span>  </p>", 
    "end_date": null, 
    "title": "Técnicas de Meditación MINDFULLNESS", 
    "price": "20.00", 
    "instructors": "RSC RED SOCIAL CRECER", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234924_5351_2.jpg", 
    "course_url": "https://www.udemy.com/tecnicas-de-meditacion-mindfullnes/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-01T07:56:00Z"
}