{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  Welcome to your Urban Meditation Guide! If you are looking to start or grow your meditation practice this powerful course gives you all that you need in a fun and easy way!  </p>  <p>  \t  You can complete this course in 45 minutes and you will gain lifetime access take it again!  </p>  <p>  \t  You will receive three informational videos that explain what meditation is and how it can benefit you, a guided breathing exercise to help you release stress and prepare for meditation, as well as guided meditation that you can listen to over and over again! Meditation allows you to relax, release stress and take time for yourself!  </p>  <p>  \t  We will dispel common myths about meditation so you can feel assured that YOU can meditate!  </p>  <p>  \t  Receive medical studies that prove that meditation reduces anxiety and improves the overall health of the body.  </p>  <p>  \t  We will go over what stress is and how a meditation practice can help you build up an immunity to stress so you can remain more calm and composed during stressful times. meditation is the tool that allows you to become more in control, focused and clear.  </p>  <p>  \t  Want to find the type of meditation that works for you? Receive information on four popular styles of meditation!  </p>  <p>  \t  Receive a simple breathing exercise that shows you how to use your breath to release stress, connect with your body and prepare for meditation!  </p>  <p>  \t  Experience our powerful guided audio meditation that is designed to bring you into a deep state of relaxation and reflection so you can enjoy the healing benefits of meditation!  </p>  <p>  \t  Meditation is a practical tool to enhance the quality of YOUR life by helping you manage stress, sleep better, look younger and create clarity and direction. Learn how to just chill out and relax! Meditation is the time that you put in to be effortless in life, so you can get in control your stress before it controls you.  </p>  <p>  \t  You will be guided by: Sarah Hauch, Healer, Success Coach, Life Activation Practioner at the Modern Mystery School and Hillary Faye 500-hour certified International Kundalini and Hatha Yoga Instructor, Meditation Guide, and blogger for The Daily Love and Yogi Times. Together Hillary and Sarah have been teaching meditation for 20 years they will show you that you can meditate by walking you through it step by step.  </p>  <p>  \t     Meditation is for everyone. One third of U.S. adults are using some form of alternative medicine such as yoga or meditation to help them release stress. In our over stimulated urban environments we need to learn how to take the time for ourselves to recharge and reconnect.  </p>  <p>  \t     Experts estimate that the mind thinks between 60,000 – 80,000 thoughts a day. That&#039;s an average of 2,500 – 3,300 thoughts per hour. The mind is like a box and once it gets full, you feel tired, overwhelmed, stressed and unhappy. Through meditation you open the lid to this box and release the mind clutter.  </p>  <p>  \t  You deserve to take this course now and learn tools to help you live a happier and healthier life!  </p>", 
    "end_date": null, 
    "title": "Urban Meditation Guide ", 
    "price": "20.00", 
    "instructors": "Urban Meditation Guides", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/155570_2cf9_4.jpg", 
    "course_url": "https://www.udemy.com/urban-meditation-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Meditation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-30T20:33:18Z"
}