{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t         Dear friends,<br>  \t        Did you learn Italian at school?<br>  \t        Have you taken Italian classes?<br>  \t        Did you live in Italy?<br>  \t        Do you like the Italian language and culture?<br>  \t        Good. You belong to the category of millions people who have partially mastered the Italian language.  </p>  <p>  \t         But you have the opportunity to say:<br>  \t        &quot;I understand when I read but I can’t talk&quot;<br>  \t        &quot;I don’t understand people Italian mother tongue&quot;<br>  \t        &quot;I would like to speak Italian fluid and automatically, without thinking&quot;<br>  \t        &quot;I no longer have the opportunity to practice Italian&quot;<br>  \t        &quot;I lost my Italian &quot;<br>  \t        &quot;I don’t have enough time to learn Italian&quot;<br>  \t        &quot;I would like to learn more about Italy and Italians&quot;<br>  \t        If you answered &quot;yes&quot; to at least one question, I have good news: Italiano Autentico will help you.  </p>  <p>  \t       Italiano Autentico is my vision, and your goal: to create a group bringing together people who have studied, worked and spent holidays in Italy or are simply interested in the Italian culture. The idea is to use new technologies to help all these people together to learn, share, improve.  </p>  <p>  \t       That is why I developed the Italiano Autentico system. It’s a natural learning method based on brain functioning. You’re going to learn and practice Italian like children, watching interesting videos. With this system you will learn and practice Italian automatically and effortlessly. I created lessons (videos + pdf + mp3), based on seven simple but highly effective rules.  </p>  <p>  \t       Italiano Autentico is also a blog, podcasts and it will become even more if you join us. Come in and improve your Italian with me, without stress, with pleasure, as if you were here in Italy!  </p>", 
    "end_date": null, 
    "title": "ITALIANO AUTENTICO to speak italian as if you were in Italy", 
    "price": "45.00", 
    "instructors": "Riccardo Gasparotto", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/254518_07cb_3.jpg", 
    "course_url": "https://www.udemy.com/italiano-autentico-to-speak-italian-as-if-you-were-in-italy/", 
    "currency": "USD", 
    "subject_name": [
        "Italian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-02T15:14:15Z"
}