{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<em style=\"\">COURSE RECENTLY UPDATED: Q&amp;A Webinars Added (your questions got answered!</em></p><p><strong style=\"\">GETTING STARTED WITH ITALIAN? </strong><br style=\"\">  \t<br style=\"\">  \t                      The best place to start, with any foreign language is <strong style=\"\">vocabulary</strong>. Not only vocabulary is the easiest part to assimilate of a new language, but it is undoubtedly the most important. <br style=\"\">  \t<br style=\"\">  \t                      In this course you will learn the <strong style=\"\">Top 400 Most Frequent and Useful Italian Words</strong>. <br style=\"\">  \t                      Not just any words... we&#039;re talking about the words that you will most definitely need and hear while in Italy. <br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">THE DETAILS</strong>  </p>  <ul style=\"\">  \t<li style=\"\">The course is made up of <strong style=\"\">35 daily lessons</strong>, between 5 to 10 minutes</li>  \t<li style=\"\">In each lesson you will learn <strong style=\"\">12 new words</strong></li>  \t<li style=\"\">For each word you will learn <strong style=\"\">pronunciation, meaning, and an easy way to remember the word</strong></li>  \t<li style=\"\"><strong style=\"\">Printable PDF sheet </strong>for each daily lesson</li>  \t<li style=\"\"><strong style=\"\">Downloadable audio (pdf) version </strong>for each lesson</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">WHY LEARN VOCABULARY?</strong>  </p>  <p>  \t                      Words are the focus of our conversations, so as you approach the Italian language, you&#039;ll quickly realize that you don&#039;t have to have perfect grammar or syntax to communicate; people will still understand you, as long as they know WHAT you are talking about, which is exactly what WORDS do.  </p>  <p>  \t                      Studies shows that, despite every language having thousands of words, <strong style=\"\">speakers of a language (including Italians!) only use 600 to 1000 words </strong>for their everyday communications. <br style=\"\">  \t<br style=\"\">  \t                      This translates into being able to <strong style=\"\">understand between 60 and 80% of any given communication</strong>. <br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">HOW TO USE THIS COURSE<br style=\"\">  \t</strong>This course is built around the <strong style=\"\">scientifically proven principles of Mnemonics and Spaced Repetition</strong>. Our memory is more likely to remember things if it can associate them to specific stories or events. That is why just reading a list of words in Italian will NOT work! <br style=\"\">  \t<br style=\"\">  \t                      By spending as little as 10 minutes a day watching these videos, you will hear stories, crazy ideas, funny little things that your mind will associate to the words you are trying to learn. Revise these words after 4, 10 and 20 days <strong style=\"\">to lock them into your memory</strong> and you are done! <br style=\"\">  \t<br style=\"\">  \t                      Whether this is your first contact with the Italian Language, or whether you already know a little bit, <strong style=\"\">your comprehension and communication skills will be enhanced</strong> by taking this course. <br style=\"\">  \t<br style=\"\">  \t                      Grazie mille, <br style=\"\">  \t                      A presto<br style=\"\">  \t                      Manu Venditti  </p>", 
    "end_date": null, 
    "title": "Learn Essential Italian Vocabulary in just 10 minutes a day", 
    "price": "35.00", 
    "instructors": "Manu Venditti", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/257552_2fb6_7.jpg", 
    "course_url": "https://www.udemy.com/top-400-italian-words/", 
    "currency": "USD", 
    "subject_name": [
        "Italian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-08T07:37:27Z"
}