{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<em>COURSE RECENTLY UPDATED: Q&amp;A Webinars Added (your questions got answered!)</em>  &lt;/p&gt;  <em>OVER 1,700 STUDENTS HAVE TAKEN THIS COURSE! 5 STAR RATING!</em></p>  <p>  \t<strong><em> Would you like to be able to pronounce Italian well and impress your friends?</em></strong>  </p>  <p>  \t<strong><em> Would you like to be able to read anything in Italian correctly, with the authentic Italian melody?</em></strong>  </p>  <p>  \t                                              In this in-dept course you will learn exactly that!  </p>  <p>  \t                                              If you:  </p>  <ul>  \t<li>like to eat at Italian restaurants</li>  \t<li>are planning a trip to Italy</li>  \t<li>are currently a student of Italian or intend to start learning it soon</li>  \t<li>are an opera signer or musician</li>  \t<li>love all things Italian... </li>  </ul>  <p>  \t                                              then this course will help you!  </p>  <p>  \t                                              This is <strong>the most comprehensive course ever created on Italian pronunciation</strong>. No stone is left unturned and within just 3 hours you will be able to:  </p>  <ul>  \t<li><strong>read any Italian word correctly<br>  \t</strong></li>  \t<li><strong>have great pronunciation<br>  \t</strong></li>  \t<li><strong>write any Italian word that you know or hear</strong></li>  </ul>  <p>  \t                                              We start with understanding <strong>what makes Italian easy to pronounce </strong>and why some things often trick you, when it comes to speaking Italian (but not after this course!)  </p>  <p>  \t                                              We then have a close look at <strong>the 2 most important factors</strong> for an excellent Italian pronunciation.  </p>  <p>  \t                                              We then practice all the sounds of the Italian language and help you master them, for <strong>that real, authentic Italian flare</strong>.  </p>  <p>  \t                                              We'll also look in detail at tricky spelling scenarios, and <strong>clear all doubts about the pronunciation of words like 'bruschetta</strong>', 'prosciutto', gnocchi' and many others.  </p>  <p>  \t                                              And we'll finish strong with <strong>understanding where to stress each word</strong> (Italian has no rules but I will share some tricks!) and <strong>how to speak entire sentences with the right intonation and cadence.</strong>  </p>  <p>  \t                                            When you finish the course you will also get a <strong>Certificate of Completion</strong>!  </p>  <p>  \t<strong>What's Inside</strong>  </p>  <p>  \t                                              The course has <strong>44 Lectures</strong>, built around <strong>18 Core Lessons</strong>. <br>  \t                                              For each lesson you get:  </p>  <ul>  \t<li>Instructional Video (me on camera, with my whiteboard)</li>  \t<li>Downloadable mp3 to take the lesson with you</li>  \t<li>Downloadable PDF with the Lesson Notes and Vocab Lists</li>  \t<li>Practice Video (interactive slideshow with the correct pronunciation of over 200 words)</li>  \t<li>Downloadable PDF of the Practice Video</li>  </ul>  <p>  \t                                              You can rest assured that all your doubts will be cleared by the time you complete the course. If not, you can always ask me Questions in the Q&amp;A Section!  </p>  <p>  \t                                              I'm there to support you.  </p>  <p>  \t                                              Grazie,<br>  \t                                        Manu  </p>  <p>  \t                                        PS: and don't forget, this comes with a <strong>30 Day \"No Questions Asked\" Money Back Guarantee</strong>, so you can try the course with confidence.  </p>", 
    "end_date": null, 
    "title": "Learn to pronounce, read & write Italian in less 3 hours", 
    "price": "35.00", 
    "instructors": "Manu Venditti", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/115264_40e5_10.jpg", 
    "course_url": "https://www.udemy.com/speak-italian-like-an-italiano/", 
    "currency": "USD", 
    "subject_name": [
        "Italian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-04T23:55:50Z"
}