{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<em>COURSE RECENTLY UPDATED: Q&amp;A Webinars Added (your questions got answered!)</em>  </p>  <p>  \t<strong>OVER 11,000 STUDENTS HAVE TAKEN THIS COURSE!  </strong>  </p>  <p>  \t                                    Buongiorno!  </p>  <ul>  \t<li>Planning a trip to Italy and don't have enough time to learn Italian? </li>  \t<li>Curious about the Italian language? </li>  \t<li>Struggling to learn Italian? </li>  </ul>  <p>  \t                                        In this introductory course you will learn several tricks to <strong>jumpstart your Italian </strong>and to <strong>speed up your learning</strong>.  </p>  <p>  \t                                        Did you know that you could <strong>immediately and almost effortlessly learn 50% of the Italian vocabulary</strong>?  </p>  <p>  \t                                        Did you know that you can <strong>master Italian pronunciation in just a few hours</strong>?  </p>  <p>  \t                                        Did you know that you could be <strong>speaking in long, complex sentences</strong> in just a few weeks?  </p>  <p>  \t                                        This course is not magic and naturally learning a language does require some time and effort, but no one needs to be fluent to enjoy the beautiful country that is Italy.  </p>  <p>  \t                                        If you were ever interested in visiting Italy, then <strong>this course will help you prepare for the adventure</strong>. Enjoy.</p><p>Grazie, <br>  \t                                        Manu Venditti<br><br><strong>NOTE</strong>: this is a 90 minute lecture on ways you can pick up some basic Italian. Obviously it is not a complete language course! Have fun with it and hopefully this will spark your interest in learning Italian with one of the more complete courses I offer. <br><br></p>", 
    "end_date": null, 
    "title": "Survive Italy Without Being Fluent in Italian", 
    "price": 0, 
    "instructors": "Manu Venditti", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/219576_7d49_5.jpg", 
    "course_url": "https://www.udemy.com/survive-italy/", 
    "subject_name": [
        "Italian"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-15T13:38:57Z"
}