{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>[COURSE LAST UPDATED: April 2016]</em></p>\n\n<p><strong class=\"redactor-inline-converted\">This course is designed as a practical, step-by-step guide, you can follow to start your career as a Business Analyst!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Utilizing my vast experience in hiring and managing Business Analysts, I give you the insider details on what hiring managers are looking for and how you can grab their attention. We start out with the identifying your transferable Business Analysis skills and choosing the best fitting Business Analyst roles. We quickly move into creating your resume, finding that right fitting Business Analyst job posting, and acing the interview. We then put a cherry on the top with a <u>bonus</u> (sixth) step on negotiating a competitive Business Analyst salary!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><u><strong class=\"redactor-inline-converted\"><br></strong></u></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><u><strong class=\"redactor-inline-converted\">What am I going to get from this course?</strong></u></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Learn the roles a Business Analyst plays and <strong>identify what roles are best suited for you</strong> by taking a skills assessment</li><li>Be guided through the <strong class=\"redactor-inline-converted\">creation of your Business Analyst resume</strong>, what to include, and how to get noticed</li><li>Get insight from a hiring manager on how to appropriately <strong class=\"redactor-inline-converted\">prepare for and ace your Business Analysis interview</strong></li><li>Guidance on how to <strong class=\"redactor-inline-converted\">create a proper Thank You note</strong> to keep you top of mind for that Business Analyst position</li><li>Tips to successfully<strong class=\"redactor-inline-converted\"> negotiate a competitive Business Analyst salary</strong></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><u><strong class=\"redactor-inline-converted\"><br></strong></u></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><u><strong class=\"redactor-inline-converted\">Why should I enroll?</strong></u></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You should enroll if you want to accelerate your entrance into the field of Business Analysis. 5 Steps to Land that Business Analyst Job provides you a step-by-step process that you can leverage to prepare for and to begin your career as a Business Analyst!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><u><strong class=\"redactor-inline-converted\">What bonuses are included in this course?</strong></u></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This Business Analysis course includes a <u>hands on skills assessment</u>. This assessment allows you to measure your current skills to those beneficial to a Business Analyst. This provides you a road map on any additional skills you may want to pursue to ready yourself for a job in Business Analysis.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In addition, you receive the <u>most common Business Analyst interview questions</u>. Many of these questions are pulled directly from my interview documents. I not only give you the questions, I also give you the best way to answer.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><u>This Business Analyst training is just like a live course, I am always available to help you out</u>. So if you ever need something explained further, you will get an answer. I look forward to you taking this first step on the journey into the field of Business Analysis!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Enroll in the course today and begin your career as a Business Analyst!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n", 
    "end_date": null, 
    "title": "5 Steps to Land that Business Analyst Job: Business Analysis", 
    "price": "25.00", 
    "instructors": "Jeremy Aschenbrenner", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/591194_b6e4_2.jpg", 
    "course_url": "https://www.udemy.com/5-steps-to-becoming-a-business-analyst/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-23T18:07:38Z"
}