{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This Course comprises 3 Sections and a total of 27 lectures that teach the Business-Driven Data Mapping and the Business Normalization concepts used for business-driven data modeling projects. </p>    <ul><li>Section 1 Lectures 1 – 14 teach the concepts of Business-Driven Data Mapping. </li><li>In Lecture 1, a Reference Manual for Section 1 can be downloaded in Microsoft Word or in PDF to use when viewing the video lectures in the section.<br>  </li><li>Section 1 includes <em>Exercise Problems</em> to be progressively completed throughout the lectures. The <em>Sample Solutions</em> for Section 1 can be downloaded in Bonus Lectures 12 - 14. </li><li>Section 2 Lectures 15 – 26 teach the concepts of Business Normalization. </li><li>In Lecture 15, a Reference Manual for Section 2 can be downloaded in Microsoft Word or in PDF to use when viewing the video lectures in the section.<br> <br> </li><li>Section 2 includes <em>Exercise Problems</em> to be progressively completed throughout the lectures. The <em>Sample Solutions</em> for Section 2 can be downloaded in Bonus Lectures 25 – 26.</li><li>Section 3 Lecture 27 discusses the <em>Data Modeling Case Study Workshop</em>, which is the CBDM Exam. Your solution to this workshop becomes your CBDM Exam solution. </li></ul>                        <ul><li>In Lecture 27 the <em>“DM3: </em><em>Data Modeling Case Study Workshop</em><em> Reference Manual</em>” can be downloaded in Microsoft Word or in PDF. This details the <em>Data Modeling Case Study Workshop </em>Problem Statements, to refer to when you are developing your solution to the Case Study Workshop Problem.  </li></ul>    The <em>Data Modeling Case Study Workshop Reference Manual</em> provides an overview of the features of <em>Visible Advantage</em>. It then includes step-by-step instructions to be used to enter your workshop solution, to test it and finally to email it to Visible Systems Corporation who will assess your CBDM Exam and CBDM Qualification.<br>", 
    "end_date": null, 
    "title": "5) CBDM: Certified Business Data Modeler", 
    "price": "50.00", 
    "instructors": "Mr. Clive Finkelstein, Michael Cesino", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642004_3f30.jpg", 
    "course_url": "https://www.udemy.com/cbdm-certified-business-data-modeler/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T02:38:28Z"
}