{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>You are interested in learning about Amazon Web Services (AWS) and getting into the wide realm of cloud computing and server storage. So how can you get into this realm as an AWS architect or just learn about an alternative option to expensive server storage? That is what this course is for.</p><p>I have learned over 14 programming languages such as JAVA, Python, C++, R, Matlab, Ruby, CSS, HTML, Angular JS, Java Script as well as others. I have also had a successful freelancing career programming software and mobile applications and well as working as a finance data analyst. Since technology is changing every day, it is adding new realms of complexity to the amount of data out there. How do you get access to server computation on demand and for cheaper upfront costs? My job in this course is to demystify Amazon Web Services so you can see a clear road to success as a cloud computing architect.<br></p><p>This course serves to help you navigate AWS. My hope is to transform you in 4-5 lectures from being a novice to data and what is possible with AWS to being someone who has a clear idea of whether he/she is interested in hosting on AWS and what path they can take to further their knowledge and harness the POWER of AWS.<br></p><p>I have put together a course that is worth your time. This course encompasses the basics of AWS I urge you to join me on this journey to learn how you can start learning how to dominate web storage and cloud computing with Amazon Web Services.</p>", 
    "end_date": null, 
    "title": "A Flying Introduction to Amazon Web Services: Cloud", 
    "price": 0, 
    "instructors": "Dhruv Bais", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776296_7fed_3.jpg", 
    "course_url": "https://www.udemy.com/a-flying-introduction-to-amazon-web-services-cloud/", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T19:41:23Z"
}