{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  En este curso aprenderás a utilizar los principales aspectos acerca de una de las herramientas de software más poderosas para computación numérica: MATLAB.  </p>  <p>  \t  ¿Quieres entender los temas vistos en clase de una manera mucho mejor y dejar de enfocarte en entender qué demonios hizo el maestro en Matlab para enfocarte realmente en las clases? ¿Desarrollar programas de una manera más rápida y efectiva? ¿Ser contratado por una buena empresa o ingresar a un posgrado de calidad?  </p>  <p>  \t<strong>El curso de Matlab con mejor relación Inversión-Beneficio</strong>  </p>  <p>  \t  Al tomar este curso no necesitarás gastar más tiempo ni dinero en libros, Cursos online caros ni búsquedas en Google o Youtube, ya que aquí verás todo lo que necesitas saber para tomar los cursos de tu carrera. Te prometo personalmente el curso mejor estructurado y exhaustivo que encontrarás y al mejor precio, además de muy fácil de entender. Aquí se verán los temas generales a partir de los cuales podrás especializarte en cualquier área de tu interés.  </p>  <p>  \t  Tanto si deseas dedicarte a la investigación, trabajar en una empresa o ser emprendedor, este curso es para ti. Las empresas y universidades más prestigiosas y mejor pagadas a nivel mundial requieren de programadores que sepan desarrollar programas en Matlab. Este software se utiliza como herramienta principal para programación en áreas como:  </p>  <p>  \t                ·Probabilidad y estadística.  </p>  <p>  \t                ·Procesamiento de señales y comunicaciones.  </p>  <p>  \t                ·Procesamiento de imágenes y video.  </p>  <p>  \t                ·Sistemas de control.  </p>  <p>  \t                ·Pruebas y mediciones.  </p>  <p>  \t                ·Finanzas computacionales.  </p>  <p>  \t                ·Biología computacional.  </p>  <p>  \t                ·Entre muchas otras.  </p>  <p>  \t  Empezaremos desde lo más básico (manejo de variables, operaciones con matrices y vectores, etc.), hasta temas más avanzados como manejo de gráficos, operaciones con polinomios, estructuras y celdas. Además obtendrás acceso al foro de preguntas y respuestas en Youtube, Facebook y Udemy para preguntar tus dudas.  </p>  <p>  \t  Puedes mirar la estructura del curso para ver los temas que se incluyen. Inicia tu curso ahora!!.  </p>", 
    "end_date": null, 
    "title": "Aprende Matlab Completo: De Básico a Avanzado", 
    "price": "30.00", 
    "instructors": "Jesus Ernesto Valdez Almaral", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/175468_9dbe_4.jpg", 
    "course_url": "https://www.udemy.com/matlab-desde-cero/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-02T22:30:19Z"
}