{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hi there! You may be a business analyst and asked to design your first QlikView application. Or, you may have already enrolled in my QlikView developer course and wondering how to create an application using the same data model that we built together in the developer course.</p><p>Whatever may be the reason, QlikView designer course will definitely make you an awesome, well-rounded QlikView Designer.</p><p>If you are still wondering, let not your heart be troubled. </p><p>Let me breakdown reasons for you to become a QlikView designer.</p><ol style=\"\"><li>You know the subject matter so you been asked to <em style=\"\">create a QlikView application</em> at your work since your company just invested in QlikView as a business discovery tool</li><li>You have already enrolled in my QlikView developer course and wanted to extend your knowledge to build an application using the same data model.</li><li>You wanted to learn how to create a QlikView application that can tell story effectively using data visualization best practices </li></ol><p>If you answered &#039;yes&#039; to any of these questions, then this course is for you!</p><p>QlikView is growing rapidly. With over 30,000 customers, demand for skilled QlikView developers and designers is higher than ever before!</p><p>We will begin with a template and build an application step-by-step together. I will teach each concept before the hands-on session to make it easier to learn. </p><p>At the end, if you follow all the concepts and get your feet wet(so to speak), I promise that you will be an awesome QlikView Designer.</p><p>So, what are you waiting for? Enroll now...</p>", 
    "end_date": null, 
    "title": "Become QlikView Designer from Scratch", 
    "price": "35.00", 
    "instructors": "Shilpan Patel", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462620_49fa_3.jpg", 
    "course_url": "https://www.udemy.com/become-qlikview-designer-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T03:44:31Z"
}