{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Become a Citizen Data Scientist is an introductory course take your skills to the next level \n\n  </p>\n\n<p>Throughout the course, you will learn the basics concepts in order to understand and apply advanced analytics, …, \n\n  </p>\n\n<p>You will engage in 5 hands-on labs for creating advanced models …. \n\n  </p>\n\n<p>\n\n  </p>\n\n<ul>  <li>Empower yourself with advanced analytics      using SQL, Microsoft Azure ML, and      Power BI\n\n  </li><li>At the end of the course, you’ll be able to prepare data      using SQL, create targeting and recommendations models using Microsoft      Azure ML and conceive dynamic dashboard using Power BI.” \n\n </li></ul>\n\n<p>\n\n  </p>\n\n<p>Because our goal is to get you up to speed as quickly as possible, we’ll cover through the 30 lectures,\n\n  </p>\n\n<ul>  <li>Lay the foundations of Citizen Data Science \n\n  </li><li>marketing framework analysis.\n\n  </li><li>Learn the basics of SQL\n\n  </li><li>Understand the main conceptions of classification models\n\n  </li><li>Quick start with Microsoft Azure ML\n\n  </li><li>Prepare data using SQL\n\n  </li><li>Construct a customer dashboard using Power BI\n\n  </li><li>Create a segmentation model using SQL\n\n  </li><li>Build a targeting model using Azure ML\n\n  </li><li>Build a recommendation system using Azure ML\n\n  </li><li>Test your progression with 5 quizzes\n\n </li></ul>\n\n<p>\n\n  </p>\n\n<p>\n\n  </p>\n\n<p>The ultimate course purpose is to unleash the potential of data science for your career and your organization\n\n  </p>\n\n<p>The course will enable you to extract actionable insight from your customers’ data\n\n  </p>\n\n<p> \n\n  </p>\n\n<p>According to a Mckinsey Study, demand for data scientists is projected to exceed supply by more than 50% by 2018. That’s the gap you as citizen Data Scientists are going to fill\n\n  </p>\n\n<p>Citizen data scientist are \"Business people with the right attitude - curious, adventurous, determined - to research and improve things in the organization\" SAS\n\n  </p>\n\n<p>\n\n  </p>\n\n<p>The need is so, that according to Gartner, by 2017, the number of citizen data scientists will grow 5 times faster than the number of highly skilled data scientists.\n\n  </p>\n\n<p> \n\n  </p>\n\n<p>This course is designed for business professionals:  marketer, manager and analytical minds in every department … who want to take their skills to the next level.\n\n  </p>\n\n<p>If you have solid business knowledge, curious, determined to improve things in your company or just willing to learn new methods and tools than this course is for you…. \n\n  </p>\n\n<p>The course may not be for you if you are looking for an in-depth discussion of the deeper mathematical and statistical theories behind the data science algorithms. \n\n  </p>\n\n<p>\n\n  </p>\n\n<p>You will learn the main concepts of data science such as Data mining Process, Machine learning, and classification model\n\n  </p>\n\n<p>\n\n  </p>\n\n<p>You will be introduced to a Marketing framework analysis based on 4 elements: EXPLORE, SEGMENT, TARGET AND RECOMMEND.\n\n  </p>\n\n<p>You will learn the basics of three tools: SQL, Power BI, and Microsoft Azure ML. \n\n  </p>\n\n<p>\n\n  </p>\n\n<p>You will be able to test and practice all these skills through 5 Quizzes and 5 hands-on Labs: Data Preparation using SQL, Customer Dashboard using POWER BI, managerial segmentation with SQL, targeting and recommendation models using Microsoft Azure ML Studio.</p>", 
    "end_date": null, 
    "title": "Become a Citizen Data Scientist : Marketing perspective", 
    "price": "45.00", 
    "instructors": "Mohamed Jendoubi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815868_fbbb_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-citizen-data-scientist-marketing-perspective/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T21:38:32Z"
}