{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  This course helps you move beyond the default graphics offered by R  and shows you how to start making elegant and publication-ready plots.  It equips you with a good command over ggplot 2 to build sophisticated  and interactive graphs that suit your own data requirements.  </p>  <p>  \t  This practical course shows you how to build statistical plots layer  by layer by following along with the examples provided. You’ll first get  familiar with the basics of ggplot2 by understanding the use of the  building blocks of standard statistical plots and see how you can  combine elements to make new graphics. Next, you’ll learn how to  customize your graphs, and finally you’ll explore how to make  interactive webpages to present your work or analyze your data.  </p>  <p>  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p style=\"\">  \t<strong style=\"\">Christophe Ladroue</strong> has many years of experience in machine learning and  statistics. Most of his work has been focused on developing tools for  the analysis of biological data, from genetics to physiology, and his  scientific publications span from medical journals to pure statistics.  He has used and has been teaching R and ggplot2 for a few years and he  occasionally posts related articles on his personal blog  </p>", 
    "end_date": null, 
    "title": "Building Interactive Graphs with ggplot2 and Shiny ", 
    "price": "20.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365790_185f_3.jpg", 
    "course_url": "https://www.udemy.com/building-interactive-graphs-with-ggplot2-and-shiny/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T12:54:26Z"
}