{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>“I solve problems you don’t know you have, in ways you can’t understand” (I am a Business Analyst).<br></p><p>The role of the Business Analyst is much more complex than the people perceive it to be and sometimes it can be a challenge to understand all its facets. </p><p>This course is aimed to overcome this challenge, by systematically introducing you in the world of Business Analysis, using a simplistic approach with a lot of examples anchored in our day to day life. </p><p><strong>Master the Business Analysis concepts</strong></p><ul><li>System development life cycles</li><li>Eliciting requirements</li><li>Elicitation techniques</li><li>Documenting requirements</li><li>Writing quality requirements</li><li>Communicating requirements</li></ul><p>There are many benefits for understanding these concepts, as they stay at the core foundation of the Business Analysis activity. Even if you are already working as a Business Analyst, these concepts will help you become a more effective and valuable employee. By applying the techniques taught here in your daily job as a Business Analyst you will be able to produce quality requirements in a shorter period of time and obtain the sign off of your requirements quicker. All this will translate into a successful project.</p><p><strong>Contents and Overview</strong></p><p>This course contains over 40 lectures and more than 3 hours of contents. It is designed for beginners to intermediate Business Analysts, students with no prior experience or junior Business Analyst who want to have a solid foundation in their career.</p><p>Beside the theoretical concepts taught, the course is packed with practical examples that would help you understand the techniques in a fun and functional way.</p><p>By the end of this course, you will have all the skills required to embark on a career as a Business Analyst. You will know what techniques to employ and when in order to elicit the stakeholders’ requirements and to bring everyone to a consensus with respect to the business needs.</p><p>And finally, you will have an opportunity to test your knowledge gained by taking the quizzes that complement each section.</p><p><strong>What are the requirements for this course? </strong></p><ul><li>Just your willingness to learn</li></ul><p><strong>What am I going to get from this course?</strong></p><ul><li>Over 40 lectures and 3 hours of content</li><li>All Business Analysis fundamental knowledge</li><li>Step by step instructions about how to prepare for a Business Analyst interview</li><li>You will be able to be more effective and successful in your job as a Business Analyst</li></ul><p> <strong>Who is the audience?</strong></p><ul><li>Everyone who wants to gain basic knowledge about Business Analysis</li><li>Students who want to pursue a Business Analyst career</li><li>Junior or Intermediate Business Analysts who want to become more effective</li><li>Senior Business Analysts who need a refresher of the Business Analysis core concepts</li></ul><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Business Analysis Essentials", 
    "price": "20.00", 
    "instructors": "Cristian Fador", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599510_eb9c_7.jpg", 
    "course_url": "https://www.udemy.com/business-analysis-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T16:18:14Z"
}