{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>[Course Last Updated: May 2016]</em></p>\n\n<p><strong>This course will teach you what you need to know to become a Business Analyst!</strong> I take years of experience in the field and Business Analysis concepts and roll them all into this one course.  If you are an aspiring Business Analyst, this course needs to be your first stop to lay the foundation you will build all future knowledge and experience on top of.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><u><strong>Why should you explore a career as a Business Analyst?</strong></u></p>\n\n\n\n\n\n\n\n\n\n\n\n<ol><li><strong>Great Pay</strong> - The average salary of a Business Analyst (BA) is <u>over $78,000 per year!</u></li><li><strong>Job Market Growth</strong> - The Business Analysis job market is expected to <u>grow at a rate of 19% over the next 10 years!</u></li><li><strong></strong><strong>Springboard to Other Careers </strong>- Skills learned as a Business Analyst are crucial in many other IT and Business professions</li><li><strong>Uses Existing Industry Knowledge</strong> - Knowledge gained outside of the Business Analyst title is highly valued</li><li><strong>Different Each Day </strong>- The job in Business Analysis is never stale. There are always new projects and challenges to tackle</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><u>Why should I enroll?</u></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Getting into the Business Analysis field was one of the best decisions of my life! Unfortunately for me, the road was a little rocky as I had to learn techniques and skills the hard way, through project misses and failures. I am here to help you and make that path to becoming a successful Business Analyst less painful. This course will provide you with all of the details you need to not only become a Business Analyst, but to also be successful at it!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is continually being updated.  I consistently review the current lectures and add new content.  This ensures the details given are relevant and engaging!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><u><br></u></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><u></u></strong><strong><u>What bonuses are included?</u></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Access to the searchable Business Analyst Glossary.  The Business Analysis field is inundated with complex terms and acronyms.  This searchable glossary is a critical tool for you to learn and understand what those terms and abbreviations mean.</li><li>A Business Requirements Document (BRD) example template that you can utilize to practice your requirement documentation skills.</li><li>Access to to an industry expert!  I am not just the instructor of this course, I also can be a resource to give you guidance and tips to advance your career.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Invest in your future!  Enroll today!</strong></p>", 
    "end_date": null, 
    "title": "Business Analyst Fundamentals: Business Analysis", 
    "price": "40.00", 
    "instructors": "Jeremy Aschenbrenner", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/751792_622e_5.jpg", 
    "course_url": "https://www.udemy.com/business-analysis-ba/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T23:00:19Z"
}