{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\n“I solve problems you don’t know you have, in ways\nyou can’t understand” (I am a Business Analyst).</p><p>\n\n</p><p style=\"\">The role of the Business Analyst is much more\ncomplex than the people perceive it to be and sometimes it can be a challenge\nto understand all its facets. </p><p>\n\n</p><p style=\"\">In the Business Analysis Essentials we went over\nthe theoretical concepts of Business Analysis. In this course, we are applying\nthe concepts in a simulated project environment, looking at the tasks and deliverables\nthat a Business Analyst has to produce during the life of a project.</p><p>\n\n</p><p style=\"\"><strong>Master the BA tasks and deliverables</strong></p><p>\n\n</p><ul style=\"\"><li style=\"\"> Estimating\nthe project specific  tasks</li><li style=\"\"> Understand\nthe deliverables </li><li style=\"\"> Apply the\nelicitation techniques</li><li style=\"\"> Produce the\nbusiness and process flows</li><li style=\"\"> Face the\nproject challenges</li><li style=\"\"> Write\neffective and clear requirements</li><li style=\"\"> Understand\nhow to overcome the obstacles<p style=\"\"> </p><p style=\"\">Most of the Business Analysis courses are teaching\nthe theoretical concepts but they don’t provide enough understanding of what\nthe Business Analysts do on a daily basis during the project. </p><p style=\"\">This course aims to overcome these shortcomings and\nwalk you through a complete project from the Business Analyst’s point of view,\nstarting with the project initiations, project planning, requirements\nelicitation, requirements communications, various traps that you may encounter\non the way, all the way till you get your requirements signed off and you have\nto provide development and test support.</p><p style=\"\"><strong>Contents and Overview</strong></p><p style=\"\">This course contains over 40 lectures and more than\n3 hours of contents. The course is designed for beginners to intermediate\nBusiness Analysts, but a bit of prior experience would help to understand better\nthe project challenges. If you are new to the Business Analysis world, I\nrecommend you take the Business Analysis Essentials course first in order to\ngrasp the theoretical concepts, before seeing how they are being applied in\npractice.</p><p style=\"\">While Business Analysis Essentials is not a pre\nrequisite for this course, it would help you to cement the concepts taught\nthere through a combination of theory (Business Analysis Essentials) and\npractice (Business Analysis Demonstrated).</p><p style=\"\">                            </p><p style=\"\">By the end of this course, you will have a complete\nunderstanding of how to use the Business Analysis techniques, what challenges\nyou will be facing during a project, what documents you need to deliver, how to\nget the business buy in to sign off the requirements, what type of\ncommunication challenges the project may present and how to overcome them.</p><p style=\"\"><strong><br></strong></p></li></ul><p style=\"\"><strong>What are the requirements for this course? </strong></p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n</p><ul style=\"\"><li style=\"\"> Your\nwillingness to learn</li><li style=\"\"> A basic\nunderstanding of the SDLC (refer to Business Analysis Essentials)</li></ul><p style=\"\"><br></p><p style=\"\"><strong>What am I going to get from this course?</strong></p><p>\n\n\n\n\n\n</p><ul style=\"\"><li style=\"\"> Over 40\nlectures and 3 hours of content</li><li style=\"\"> Step by step\ninstructions about what you need to do in a project as a Business Analyst</li><li style=\"\"> You will be\nable to be more effective and successful in your job as a Business Analyst</li><li style=\"\"> A complete\npicture of what the Business Analysts tasks are in projec</li></ul><p style=\"\"><br></p><p style=\"\"><strong>Who is the audience?</strong></p><p>\n\n\n\n\n\n\n\n\n\n</p><ul style=\"\"><li style=\"\"> Everyone who\nwants to gain more insight about Business Analysis</li><li style=\"\"> Students who\nwant to pursue a Business Analyst career</li><li style=\"\"> Junior or\nIntermediate Business Analysts who want to become more effective</li><li style=\"\"> Senior\nBusiness Analysts who need a refresher of the Business Analysis concepts</li></ul><p>\n\n\n\n\n\n\n\n</p>", 
    "end_date": null, 
    "title": "Business Analysis Demonstrated", 
    "price": "20.00", 
    "instructors": "Cristian Fador", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754920_8295_2.jpg", 
    "course_url": "https://www.udemy.com/business-analysis-demonstrated/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-07T05:39:59Z"
}