{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  In this Business Forecasting with Google Sheets video course, I introduce you to Google's online spreadsheet application, Sheets and how to use it for forecasting.  </p>  <p>  \t<strong>Learn to forecast the future with your business data</strong>  </p>  <ul>  \t<li>Why forecast?</li>  \t<li>Smoothing noisy data</li>  \t<li>Analyzing for trendlines</li>  \t<li>Transforming data</li>  \t<li>Forecasting future values</li>  </ul>  <p>  \t<strong>A powerful skill to increase your value and earnings.</strong>  </p>  <p>  \t  Millions of people use spreadsheets today, usually at the the office as a data entry form. Very few actually build spreadsheets unless that is their job. The dominant spreadsheet, Excel is often bought by students but rarely used, and most working adults only have access to it at work.<br>  \t<br>  \t  Until now. Google's online spreadsheet \"Sheets\" has become a powerful tool through rapid iteration. While still not as powerful as Excel it does have a number of very useful, unique features. But most impotrtant. it is free to use. You can build spreadsheets at home, while on a cellphone, tablet or laptop while traveling, indeed anywhere with internet access.<br>  \t<br>  \t  This course focuses on using Google Sheets to do one of the most important business functions - forecasting.  </p>  <p>  \t<br>  \t   It is a powerful, full featured, cloud based spreadsheet that can be harnessed for business forecasting in a collaborative environment, and the results directly embedded in live web pages for internal and external communication.  </p>  <p>  \t<strong>Content and Overview </strong>  </p>  <p>  \t  The course uses Google sheets, a number of which are publicly available to the student. In addition there are links to web content and documents with more explanation of the concepts used.<br>  \t  I have broken down the content into easy to manage chunks so that you can focus on a concept and experiment and test yourself.  You can complete this course in an evening or weekend and be ready to do work on Monday, although I recommend working with your own data and the data I provide to gain confidence in your new skills.<br>  \t<br>  \t  I start with some evidence of why the skills this course teaches are career drivers.  Then we discuss what forecasting is.  We start with the basics of smoothing data to remove noise, and then move on to techniques of implementing trendlines to forecast with.  Throughout the course, each point is made using data that you see being analyzed in a live spreadsheet demonstration, that you can replicate on your own computer to nail down and internalize the technique.<br>  \t<br>  \t  Competency doing real work relevant to business is a career enhancing skill in today's job market. This course will give you a strong start in applying those skills to your business and employment.  </p>  <p>  \t<strong>What am I going to get from this course?</strong>  </p>  <ul>  \t<li>32 lectures and over 3 3/4 hours of content</li>  \t<li>Understand how to analyze historic data to predict the likely future</li>  \t<li>Learn how to use built-in and custom functions to extrapolate future values</li>  \t<li>Able to work at home on your computer at your own pace</li>  \t<li>Visual training method, offering users increased retention and accelerated learning.</li>  \t<li>Lifetime access to me to help with your own data.</li>  \t<li>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</li>  </ul><p>Update  11/5/2015</p><p>2 new lectures added on errors to avoid with trend analysis.  These are common mistakes amateurs make that you can avoid in your own analyses and look more professional when examining analyses from your colleagues.<br></p><br><p>  \t  So start learning today. Because being a technology dinosaur isn’t going to get you a promotion or raise!  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t      - Alex Tolley  </p>", 
    "end_date": null, 
    "title": "Business Forecasting with Google Sheets", 
    "price": "25.00", 
    "instructors": "Alex Tolley", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358598_907f_3.jpg", 
    "course_url": "https://www.udemy.com/business-forecasting-with-google-sheets/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-28T19:32:05Z"
}