{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Cluster analysis</strong> is a staple of <strong class=\"redactor-inline-converted\">unsupervised machine learning</strong> and <strong class=\"redactor-inline-converted\">data science</strong>.</p>\n\n<p>It is very useful for <strong class=\"redactor-inline-converted\">data mining</strong> and <strong class=\"redactor-inline-converted\">big data</strong> because it <strong class=\"redactor-inline-converted\">automatically finds patterns</strong> in the data, without the need for labels, unlike supervised machine learning.</p>\n\n\n\n<p>In a real-world environment, you can imagine that a robot or an <strong class=\"redactor-inline-converted\">artificial intelligence</strong> won’t always have access to the optimal answer, or maybe there isn’t an optimal correct answer. You’d want that robot to be able to explore the world on its own, and learn things just by looking for patterns.</p>\n\n\n\n<p>Do you ever wonder how we get the data that we use in our supervised machine learning algorithms?</p>\n\n\n\n\n\n\n\n<p>We always seem to have a nice CSV or a table, complete with Xs and corresponding Ys.</p>\n\n\n\n\n\n\n\n<p>If you haven’t been involved in acquiring data yourself, you might not have thought about this, but someone has to make this data!</p>\n\n\n\n\n\n\n\n<p>Those “Y”s have to come from somewhere, and a lot of the time that involves manual labor.</p>\n\n\n\n\n\n\n\n<p>Sometimes, you don’t have access to this kind of information or it is infeasible or costly to acquire.</p>\n\n\n\n\n\n\n\n<p>But you still want to have some idea of the structure of the data. If you're doing <strong class=\"redactor-inline-converted\">data analytics</strong> automating pattern recognition in your data would be invaluable.</p>\n\n\n\n\n\n\n\n<p>This is where unsupervised machine learning comes into play.</p>\n\n\n\n\n\n\n\n<p>In this course we are first going to talk about clustering. This is where instead of training on labels, we try to create our own labels! We’ll do this by grouping together data that looks alike.</p>\n\n\n\n\n\n\n\n<p>There are 2 methods of clustering we’ll talk about: <strong class=\"redactor-inline-converted\">k-means clustering</strong> and <strong class=\"redactor-inline-converted\">hierarchical clustering</strong>.</p>\n\n\n\n\n\n\n\n<p>Next, because in machine learning we like to talk about probability distributions, we’ll go into <strong class=\"redactor-inline-converted\">Gaussian mixture models</strong> and <strong class=\"redactor-inline-converted\">kernel density estimation</strong>, where we talk about how to \"learn\" the probability distribution of a set of data.</p>\n\n\n\n\n\n\n\n<p>One interesting fact is that under certain conditions, Gaussian mixture models and k-means clustering are exactly the same! We’ll prove how this is the case.</p>\n\n\n\n\n\n\n\n<p>All the algorithms we’ll talk about in this course are staples in machine learning and data science, so if you want to know how to automatically find patterns in your data with data mining and pattern extraction, without needing someone to put in manual work to label that data, then this course is for you.</p>\n\n\n\n<p>All the materials for this course are FREE. You can download and install <strong class=\"redactor-inline-converted\">Python, Numpy, and Scipy</strong> with simple commands on <strong>Windows, Linux, or Mac</strong>.<br></p><p><br></p><p>NOTES:</p><p>All the code for this course can be downloaded from my github: /lazyprogrammer/machine_learning_examples</p>\n\n<p>In the directory: unsupervised_class</p>\n\n<p>Make sure you always \"git pull\" so you have the latest version!</p>\n\n<p>HARD PREREQUISITES / KNOWLEDGE YOU ARE ASSUMED TO HAVE:</p>\n\n<ul><li>calculus</li><li>linear algebra</li><li>probability</li><li>Python coding: if/else, loops, lists, dicts, sets</li><li>Numpy coding: matrix and vector operations, loading a CSV file</li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Cluster Analysis and Unsupervised Machine Learning in Python", 
    "price": "50.00", 
    "instructors": "Justin C", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/825684_ee00.jpg", 
    "course_url": "https://www.udemy.com/cluster-analysis-unsupervised-machine-learning-python/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-19T04:26:16Z"
}