{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The Complete Introduction to Business Data Analysis teaches you how to apply different methods of data analysis to turn your data into new insight and intelligence.</p><p>The ability to ask questions of your data is a powerful competitive advantage, resulting in new income streams, better decision making and improved productivity.  A recent McKinsey Consulting report has identified that data analysis is one of the most important skills required in the American economy at the current time.</p><p>This course focuses on the following different methods of analysis.  During the course you will understand why the form of analysis is important and also provide examples of using the analysis using Excel 2013.  </p><p>The following methods of analysis are included:</p><ul style=\"\"><li>Comparison Analysis</li><li>Trend Analysis</li><li>Ranking Analysis</li><li>Interactive Dashboards</li><li>Contribution Analysis</li><li>Variance Analysis</li><li>Pareto Analysis</li><li>Frequency Analysis</li><li>Correlations</li></ul>The Complete Introduction to Business Data Analysis is designed for all business professionals who want to take their ability to turn data into information to the next level.  If you are an Excel user then you will want to learn the easy to use techniques that are taught in this course.<p>This course is presented using Excel 2013.  Excel 2010 can be used for the majority of the training exercises.  Small parts of the course do use Excel Power Pivot and Power View.  Please note that this course does not include any complicated formulas, VBA or macros.  The course utilizes drag and drop techniques to create the majority of the different data analysis techniques.</p>", 
    "end_date": null, 
    "title": "Complete Introduction to Business Data Analysis", 
    "price": "40.00", 
    "instructors": "Ian Littlejohn", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540450_d09d_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-introduction-to-business-data-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T17:52:15Z"
}