{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tIf you work with SAP Business One, then you need to be familiar with Crystal Reports.  This course gives you SAP Business One specific lessons for working with reports and layouts built in Crystal Reports.  </p>  <p style=\"\">  \tMany courses offer basic Crystal Reports training, but this course gives you SAP Business One specific training in:  </p>  <ul style=\"\">  \t<li style=\"\">Understanding how SAP Business One works with Crystal Reports</li>  \t<li style=\"\">Fundamentals of planning / structuring your reports to make creation easier</li>  \t<li style=\"\">Details on finding data in SBO (including SAP resources included in the course)</li>  \t<li style=\"\">The actual building, formatting and design of reports and layouts</li>  \t<li style=\"\">Best practices for deploying, managing and controlling authorizations</li>  </ul>  <p style=\"\">  \tThe course is taught by an active SAP Business One consultant and includes years of experience working specifically with SBO and Crystal Reports.  The course is brimming with tips, tricks and best practices to maximize your business intelligence capabilities.  You will save time and money making edits to your own reports and layouts.  </p>  <p style=\"\">  \tIncluded in the course are SAP consultant specific manuals and guides to help you follow along with the lectures and for reference when you do your own projects.  Also included are example reports and assist queries to help find DocKey@ and ObjectId@ data for quick previewing of layouts.  </p>  <p style=\"\">  \t<strong style=\"\">Materials Included with Purchase:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Example Crystal Reports and layouts</li>  \t<li style=\"\">PDF manuals for working with SAP Business One and Crystal Reports</li>  \t<li style=\"\">SAP Business One comprehensive database manual</li>  \t<li style=\"\">Custom DocKey@ and ObjectId@ query for easily finding references needed to preview layouts</li>  \t<li style=\"\">A condensed lecture to summarize the course if you get out of practice and need a quick refresher</li>  </ul>  <p style=\"\">  \tMonthly live question and answer seminars will be included free for all students!  </p>  <p style=\"\">  \tThis is the only course designed specifically for SAP Business One and Crystal Reports.  Do not get fooled by taking a classroom course on Crystal Reports, it will not give you the knowledge you need to get the job done.  </p>  <p style=\"\">  \tBuy this course today!  </p>", 
    "end_date": null, 
    "title": "Crystal Reports for SAP Business One Mastery Training Course", 
    "price": "30.00", 
    "instructors": "Michael Taylor", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118424_c78a_13.jpg", 
    "course_url": "https://www.udemy.com/crystal-reports-for-sap-business-one/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-11T22:46:10Z"
}