{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Data Scientists landen richtig gut bezahlte Jobs, mit einem durchschnittlichen Gehalt von ~80.000€ (Quelle: Gehaltsvergleichsportal Glassdoor), in Amerika sogar noch mehr. Und das ist nur der Durchschnitt. Aber es geht nicht nur ums Geld - der Job ist auch noch verdammt spannend!</p><p>Wenn du schon etwas programmieren kannst, wird dir dieser Kurs alles beibringen, was du zum Thema Data Science und Maschinellem Lernen wissen musst. Sei es, um das wissen für ein eigenes Projekt anzuwenden, oder um einen Einstieg in dieses Gebiet zu finden. </p><p>Dieser umfassende Kurs besteht aus <strong>68 Lektionen, gut 9 Stunden Video</strong>, und zu vielen Themen gibt es praktische Python Codebeispiele, damit du direkt siehst, wie diese Algorithmen verwendet werden können. </p><p>Die Themen dieses Kurses sind die Themen, die wirklich für einen Job in diesem Feld benötigt werden. <strong class=\"redactor-inline-converted\">In verständlicher deutscher Sprache</strong> wirst du die verschiedenen Möglichkeiten kennenlernen:</p><ul><li>Lineare und Polynomiale Regressionsanalyse</li><li>K-Means - Algorithmus</li><li>Hauptkomponentenanalyse</li><li>Train/Test, Kreuzvalidierungsverfahren</li><li>Bayes'sche Methoden</li><li>Entscheidungsbäume, Random Forests</li><li>Multivariante Regression </li><li>Support Vector Machines</li><li>Bestärkendes Lernen</li><li>Empfehlungssystem: Kollaboratives Filtern</li><li>K-Nächster-Nachbar</li><li>Bias / Varianz - Dilemma</li><li>Ensemble Learning</li><li>Volltextsuche mit Hilfe von TF-IDF</li><li>Wie wird ein Experiment durchgeführt? AB-Tests</li></ul><p>... und noch viel mehr. Zudem lernst du in einem kompletten Kapitel, wie maschinelles Lernen mit Apache Spark funktioniert. <strong class=\"redactor-inline-converted\">Mit Hilfe von Spark kannst du die Berechnungen auf mehrere Computer aufteilen und so massive Datenmengen verarbeiten.</strong></p><p>Wenn du noch nicht mit Python programmiert hast, kein Problem - am Anfang gibt es einen kurzen Crashkurs. Wenn du vorher schonmal was programmiert hast, reicht das locker aus. In diesem Kurs zeige ich dir auch die Installation unter Windows, wobei die Beispiele auch unter Mac oder Linux ausgeführt werden könnten - bei Problemen die mit dem Betriebssystem zusammenhängen kann ich dich aber nur bei Windows unterstützen.</p><p><strong class=\"redactor-inline-converted\">Jedes Thema wird in normaler deutscher Sprache erklärt, ohne verwirrende mathematische Fachwörter. </strong>Anschließend lernst du, wie du mit Python den Algorithmus verwenden kannst.</p><p>Wenn du schonmal was programmiert hast, und dich mit der Auswertung von Daten beschäftigen möchtest, dann ist der Kurs genau das Richtige für dich. Du lernst in diesem Kurs all die Grundlagen, die du brauchst, wenn du Daten im echten Leben auswerten möchtest. Ich glaub, der Kurs wird dir gefallen! :-)</p>", 
    "end_date": null, 
    "title": "Data Science & Maschinelles Lernen in Python - am Beispiel", 
    "price": "40.00", 
    "instructors": "Jannis Seemann, Frank Kane", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841132_3935_2.jpg", 
    "course_url": "https://www.udemy.com/data-science-und-machine-learning/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-06T09:04:28Z"
}