{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Struggling with creating a dashboard for your business analysis purposes? Take this new tutorial course based on the latest <strong>easy-to-use</strong> technology from SAP and learn in a simple way how to create a dashboard <strong>without help from IT</strong>.  </p><p><strong>Live step-by-step tutorials</strong> take you through the main functionalities of the Lumira tool. This course teaches you not only <strong>how</strong> to use the tool but also <strong>why</strong> you use any specific graph or chart. </p><p>This course is for anyone interested in Business Intelligence at difference levels and with different platforms (SAP Hana, Microsoft SQL, Oracle, Hadoop etc). </p><p>This course also can help consultants and developers who would like to learn about the full functionality of this new tool and bring <strong>any source of data</strong> and create visualizations to find hidden patterns.  </p><p>Learn from a Business Intelligence IT professional with <strong>12 years of experience</strong> in different industries such as retail, oil and gas, and manufacturing in both the public sector and private sector across North America. <br></p><p>Benefits of this course: </p><ul><li><strong>Transform</strong> data into visual information that your organization can use to make better business intelligence decisions and increase performance. </li><li><strong>Identify</strong> negative trends in key performance indicators.</li><li><strong>Fix</strong> negative trends by localizing them, analyzing them, and correcting them. </li><li><strong>Improve</strong> the efficiency of forecasting. </li><li><strong>Measure</strong> a company’s performance parameters.</li><li><strong>See</strong> pure data more clearly with visualization techniques that find hidden patterns. </li><li><strong>Eliminate</strong> IT for any single reporting requirement. </li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Data Analytics with SAP Lumira", 
    "price": "20.00", 
    "instructors": "Ellie Babadi Koerber", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/730490_e243_2.jpg", 
    "course_url": "https://www.udemy.com/dashboarding-and-analytics-with-sap-lumira/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-16T23:41:01Z"
}