{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<span>This course will teach you how to extract the data from different applications, analyze and manage extracted data and migrate and load it into another solution. How is this useful? This is done almost as part of any software implementation project where one system replaces another one, but organization would like to keep historical data.</span>  </p>  <p>  \t       Main tool we use as part of this course is Microsoft Access 2010. You will learn how to use Microsoft Access to do data analysis and data conversions. Enterprise data conversion is the process of transforming of computer data from one format to another with the intention of loading transformed data into the target system. Data in organizations is stored in the different formats and might be hosted in the different applications. When applications get replaced or upgraded, data needs to be extracted, re-organized, reprocessed and reloaded from the source system into the target system. As part of the transformation different business rules would need to be applied to make data compatible with the target system.  </p>  <p>  \t       Microsoft Access allows you to work with the different file formats: text, Excel and XML formats and also allows import/export data from other databases. Using Access you can import the data to access or link and reference production databases and always get access to the live data. You can also connect to the databases and other sources, built by the different vendors and using different technologies. Microsoft Access also allows analyst to normalize the data, reorganize the data, do queries to the data after importing and/or before exporting. Microsoft Access can also be used as the database engine for data analytics and help uses answer business questions. Learn all of this and more as part of this course.  </p>  <p>  \t          Source files for the course are available here:  </p>  <p>  \t<a href=\"http://www.howtoanalyzedata.net/basics-of-enterprise-data-conversion/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">http://www.howtoanalyzedata.net/basics-of-enterprise-data-conversion/</a>  </p>", 
    "end_date": null, 
    "title": "Data Analysis, Migration and Conversion with MS Access Excel", 
    "price": "25.00", 
    "instructors": "Vadim  Mikhailenko", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/143172_58e9_4.jpg", 
    "course_url": "https://www.udemy.com/basics-of-enterprise-data-conversion-using-microsoft-access/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-07T05:01:11Z"
}