{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      We are surrounded by data. We work with numbers every day. How can we understand them and how can we show trends, correlations or insights to other people?  </p>  <p>  \t<p>  \t\t      The solution is putting those numbers into visual form. This ability is one of the most sought-after skills on the job market, because the amount of data that needs to be sorted, analyzed and understood is increasing at formidable rate.  \t</p>  \t<p>  \t\t<p>  \t\t\t<strong style=\"\">Learn how to correctly use charts and graphs to make sense of data.</strong>  \t\t</p>  \t\t<p>  \t\t\t<ul style=\"\">  \t\t\t\t<li>how charts come together, </li>  \t\t\t\t<li>how to draw attention to your data,</li>  \t\t\t\t<li>what graph is best for what type of data, </li>  \t\t\t\t<li>how to avoid the mistakes almost everybody      makes, </li>  \t\t\t\t<li>how to avoid being misled by malicious      charts.</li>  \t\t\t</ul>  \t\t\t<p>  \t\t\t\t<p>  \t\t\t\t\t<strong style=\"\">Take the first steps in learning a new language</strong>  \t\t\t\t</p>  \t\t\t\t<p>  \t\t\t\t\t<p>  \t\t\t\t\t\t      Using data visualizations to see patterns, uncover hidden trends and put numbers into an easy to understand visual form is a skill that is useful in any job. There is no need for prior experience and the terminology will be explained in the course.  \t\t\t\t\t</p>  \t\t\t\t\t<p>  \t\t\t\t\t\t<p>  \t\t\t\t\t\t\t<strong style=\"\">Content and overview</strong>  \t\t\t\t\t\t</p>  \t\t\t\t\t\t<p>  \t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t      When you enroll in this course you will get access to almost 2 hours of video lectures and a wealth of supplemental materials. You can complete the course in 2 or 3 hours, if you just watch the videos and take the quizzes, but you can also spend days reading and practicing what we discuss in the course, or anything in between. At the end of each of the main 4 sections there is a quiz, to help you remember what you have learned .  \t\t\t\t\t\t\t</p>  \t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t      At the end of this course you will be able to understand how statistical data can be put into visual form, how you can extract meaning from spreadsheets and how to recognize when someone is trying to lie to you with pretty charts.  \t\t\t\t\t\t\t\t</p>", 
    "end_date": null, 
    "title": "Data Presentation for Business: How to make great charts", 
    "price": "20.00", 
    "instructors": "Nicolae Urs", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360658_f4de_3.jpg", 
    "course_url": "https://www.udemy.com/data-visualization-why-charts-are-better-than-numbers/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T18:30:25Z"
}