{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is designed for students and businesses who want to learn how to summarize data and communicate the results effectively. <br>In this course, I will take you through the tabular and graphical methods that one can use to turn data into information using Microsoft Excel. </p>\n\n<p>There are no prerequisites required to take this course as I will start all the concepts from scratch. <br><br>How is this course structured?</p>\n\n\n\n<ul><li>First, I will take you through some basics of data - collection techniques and types. Then, I will discuss the tabular and graphical methods available to summarize the data (along with their working in excel) depending on what type of that we have.</li><li>After covering these methods, I will tell you some tips that you should use while deciding which chart type to choose for summarizing your data. (Not every chart or graph is suitable for all kinds of data)</li><li>Finally, we will end the course with some tips on how to get your audience's attention, how to make your data speak and some applications to solidify your learning. <br><br>Why should you take this course? <br><br>Because, its better to spend a couple of hours learning how to summarize and present your data than spending days to try and make sense of the data without knowing these methods.  <br><br>All that said, lets get started..! </li></ul>", 
    "end_date": null, 
    "title": "Data and Statistics (For Business and Economics)", 
    "price": "20.00", 
    "instructors": "Shubham Kalra", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814388_90f1_2.jpg", 
    "course_url": "https://www.udemy.com/data-and-statistics-for-business-and-economics/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T12:23:10Z"
}