{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Ready to take your data manipulation skills to the next level? Are you feeling saturated with the limits of EXCEL?<br></p><p>Want to truly learn an R COURSE which shows you why R is the next best thing in data manipulation world?</p><p><strong>This course is for you!</strong></p><p>Let's get introduced to DPLYR R PACKAGE Video training, sample datasets used with considering the beginners of R in mind, an engaging exercise which is both fun and also gives you a taste for <strong>DPLYR R Package and its powerful commands that make your life easier than ever!</strong></p><p>Each module is independent so you can <strong>start learning from wherever you see fit.</strong><strong> </strong>The more you learn the better you will get. However, you can stop at any time you will still have a strong set of skills to take with you.</p><p><em>BONUS: This course will be updated with brand new sections as Hadley Wicham releases new versions ofDPLYR PACKAGE in the future. So when you enroll - you enroll for life!</em></p><p><em>This is just the beginning! I'm going to create <strong> advanced data manipulation course using </strong>dplyr<strong> package </strong>where we will work with real datasets and complex real-world problems. Till then<strong>, LET'S LEARN THE BASICS OF DPLYR as my first course with many more R courses releasing in future!</strong></em></p>", 
    "end_date": null, 
    "title": "DPLYR R Package: Introductory R Course on Data Analysis in R", 
    "price": 0, 
    "instructors": "Anil Ugle", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759036_f9f1_2.jpg", 
    "course_url": "https://www.udemy.com/dplyr-r-package-introductory-r-course-on-data-analysis-in-r/", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T23:49:33Z"
}