{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t            Excel has become the primary analytical tool of the business world. But this is not just an Excel course:  this course is about business analytics. It’s about turning business data into valuable information, using Excel as the tool.  </p>  <p>  \t            This course is designed for college students taking business courses. While giving a guest lecture at the University of Oregon, I learned that both students and faculty were not happy with the existing business courses that taught Excel. The courses were too focused on the mechanics of Excel, on the commands and menu paths. And they used contrived, artificial examples.  </p>  <p>  \t<strong style=\"\">Improve your grades in business classes. Be better prepared for interviews.</strong>  </p>  <p>  \t            So I designed this course around authentic case studies from my experience as a senior business executive. The first case study is based on sales reporting and analysis. Students are given all of the sales information for a small company for an entire year. Through applying Excel functions like VLOOKUP and IF, the data is prepared for analysis. Then using pivot tables, the data is summarized and analyzed. The results are displayed visually with charts. Finally, the results are explained in writing. And students learn some “Business Basics” along the way, about invoicing, credit memos, and sales analysis.  </p>  <p>  \t<strong style=\"\">Students learn Excel while answering real business questions.</strong>  </p>  <p>  \t            The second case study is based on service repair and analysis. Students are given text files with the repair history of two different service sub-contractors (more than 50,000 records). The data must be imported, cleaned, and harmonized, using Excel text, date, and logical functions. Finally, the data can be analyzed with pivot tables and the results displayed visually: Which sub-contractor repairs products more quickly?  </p>  <p>  \t<strong style=\"\">These are the skills employers are looking for!</strong>  </p>  <p>  \t            The course begins with an optional “Quickstart” Tutorial for beginners, or for those students who haven’t used Excel in awhile, to refresh their knowledge.  </p>  <p>  \t            The University of Oregon uses these case studies in two of their information management courses. And my other Udemy courses are recommended by the Oregon Business Education Association.  </p>  <p>  \t            This course covers these topics in Excel:  </p>  <ul style=\"\">  \t<li>Formatting Data</li>  \t<li>Cleaning &quot;Dirty Data&quot; with Functions: Text, Date, and Logical Functions</li>  \t<li>Filtering and Sorting Data with Table Functions</li>  \t<li>Analyzing Data with Pivot Tables</li>  \t<li>Visualizing the Results with Charts and Conditional Formatting</li>  </ul>  <p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p>  \t            In five hours of content including 50+ lessons, this course covers the important Excel functions to analyze business data. Most lessons have a practice session. I provide two Excel files for each practice session: the starting point and the finish point. I also provide the written script for most lessons.  </p>  <p>  \t            Upon completion, students will be able to analyze large sets of business data. Students will be able to import large text files with tens of thousands of records, use Excel functions to clean data, use logical functions to build complex expressions, use the VLOOKUP  function to work with cross-reference tables, analyze the data with pivot tables, display the results visually with charts, and explain the results in writing, and with clarity.  </p>  <p>  \t            And you’ll know more than 80% of the casual Excel users in business today!  </p>  <p>  \t            Let’s get started!  </p>", 
    "end_date": null, 
    "title": "Excel Case Studies for Business Students", 
    "price": "30.00", 
    "instructors": "Jeff Knowlton", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393264_9753_2.jpg", 
    "course_url": "https://www.udemy.com/excel-case-studies-for-business-students/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T18:55:36Z"
}