{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                     From creating your first pivot table in Excel, to becoming a pivot table expert there is a path of learning and experimenting.  Microsoft Excel is one the most widely used data analysis tools in business today.  Excel pivot tables is undeniably the most powerful part of Excel. If you have ever had a data set to analyze and spent time wondering what you can do with it, then Excel pivot tables is your friend and this Excel course is for you.  </p>  <p>  \t                                  When you enroll in and complete this Excel Pivot Tables Data Analysis course, you will know how to:  </p>  <p>  \t                1) Quickly and easily create and format impressive pivot table and pivot chart reports in Excel.  </p>  <p>  \t                                 2) Use Excel pivot tables as a data manipulation and data extraction tool.  </p>  <p>  \t                                3) Learn to fix data in Excel and prepare your Excel data sets for pivot table data analysis.  </p>  <p>  \t                               4) Become proficient with the art of Excel pivot table data crunching.  </p>  <p>  \t                               5) Quickly transform your raw data into useful, actionable information reports.  </p>  <p>  \t                             6) Impress your boss and your colleagues with your newly acquired and highly polished skills.  </p>  <p>  \t                         7) Acquire proven strategies, tips, and techniques in Excel.  </p>  <p>  \t          8) Excel at Excel in general, when used with or without pivot tables.  </p>  <p>  \t          After this course you will not be able to:  </p>  <p>  \t                            1) Understand how you managed to live without Excel pivot tables all this time.  </p>  <p>  \t                            There are no prerequisites for this course, but it will be easier for you if you already know the most important Excel concepts.  My course Microsoft Excel Without Pain is advised for those who are new to Excel.  </p>  <p>  \t                          This Excel Pivot Tables course is primarily based on video materials and is a learn-by-doing kind of experience. It is designed to make it easy for you to follow and to re-create all of the presented pivot-table based solutions, so that you get the maximum benefit by the end of this class. We are using pivot tables in Excel 2013 in this class.  </p>  <p>  \t      This Excel course is one of the Easy Excel With Igor series.  The other  high quality Excel tutorials include:  </p>  <p>  \t  &quot;Microsoft Excel Without Pain&quot; that helps you quickly build your foundation skills in Excel;  </p>  <p>  \t  &quot;Data Manipulation In Excel&quot;  allowing you to save up to 90% of time when using Excel for certain data  management tasks;  </p>  <p>  \t    &quot;Excel Conditional Formatting Master Class&quot; where you  can learn how to improve your spreadsheets using conditional formatting  in Excel;  </p>  <p>  \t    &quot;Microsoft Excel Charts Master Class&quot; that builds your skills in  creating your skills in Excel charts and graphs.  </p>", 
    "end_date": null, 
    "title": "Excel Pivot Tables Data Analysis Master Class", 
    "price": "50.00", 
    "instructors": "Igor Ovchinnikov", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/195452_a416_3.jpg", 
    "course_url": "https://www.udemy.com/easy-excel-pivot-tables-data-analysis-with-igor/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-08T03:37:08Z"
}