{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t           This course provides a basic introduction to Excel via a case study. In the case study, you will analyze the product sales from a business, Cowboy Business Machines. Like other Excel courses, you&#039;ll learn the basics: data and number formats, formulas, copy/paste, insert/delete, printing, data filtering, pivot tables and charts.  </p>  <p style=\"\">  \t         This course is different from most other Excel courses because it focuses on the use of Excel to answer real business questions like &quot;Who were the top customers for the year?&quot; &quot;What were the top-selling products?&quot; &quot;Did sales increase or decrease?&quot; So you&#039;ll also learn about business topics like invoicing and sales.  </p>  <p style=\"\">  \t          At the end of the course, there is a lesson on how to write a basic business report to summarize the results from the product sales analysis: what topics to include, and some formatting tricks in Microsoft Word. So this course is not just about Excel: it&#039;s about how to analyze business data and communicate the results with clarity.  </p>  <p style=\"\">  \t          I provide all of the scripts from the lessons. I provide all of the worksheets, with detailed answers to the practice questions. At the end of the course, there is an additional practice worksheet so that you can master the topics covered in this course. I also provide the full text from the sample business report, so that you can use it as a template in your job.  </p>  <p style=\"\">  \t          The course has three hours of video content. Expect to spend about 8 - 12 hours altogether, over four or five days, to complete the course.  </p>  <p style=\"\">  \tThe course is recommended by the Oregon Business Education Association.  </p>", 
    "end_date": null, 
    "title": "Excel: Basic Excel and Business Analytics", 
    "price": "20.00", 
    "instructors": "Jeff Knowlton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/213970_802c_7.jpg", 
    "course_url": "https://www.udemy.com/excel-and-business-analytics_1/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-09T16:03:52Z"
}