{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Do you work with charts but struggle to identify which chart to use?</strong>  </p>  <p>  \t<strong>Are you new to data analysis?</strong>  </p>  <p>  \t<strong>Do you want to learn about the charting options Excel 2013/2010 offers?</strong>  </p>  <p>  \t<strong>Are you looking for a structured way to learn about the Excel charting tools?</strong>  </p>  <p>  \t  If your answer was <strong>YES</strong> to some of the questions, this course might be of interest to you.  </p>  <p>  \t<em>When I created this course I put full emphasis on a structured and didactically sound way to gently show you how data visualization in Excel 2013 works. </em><em><strong>This course is especially suited towards a beginners audience to data visualization with Excel. </strong></em>  </p>  <p>  \t  Most of the concepts of this course also apply to Excel 2010, so you might also consider this course if you are on 2010.  </p>  <p>  \t  Beginners to data analysis often need a clear understanding of which chart type is suitable for a given dataset. I will give you this important knowledge right at the beginning so that you know from the start what you are dealing with and how you can utilize that knowledge.  </p>  <p>  \t  I will also show you step by step all you need to know about the basic chart formatting tools. You will learn how to add elements, format axes, change colors and so on.  </p>  <p>  \t  There is also a section about the frequently used types of charts and how you can easily create them in Excel.  </p>  <p>  \t  At the end of this beginners course you should be confident in using Excel for standard charts. You will be also able to format already existing charts and tailor them in accordance with your needs.  </p>    <p>  \t  I highly recommend to take a close look at the introductory videos on which type of chart to use for a given circumstance. Only if you know which chart type is suitable for a dataset will you be able to make full use of the many options Excel has to offer.  </p>", 
    "end_date": null, 
    "title": "Excel Charts - Excel Charts and Graphs Basic Training ", 
    "price": "20.00", 
    "instructors": "R-Tutorials Training", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403780_4479.jpg", 
    "course_url": "https://www.udemy.com/excel-charts/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T20:09:34Z"
}