{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn forecasting models through a practical course with R statistical software using real world data. It explores main concepts from basic to expert level which can help you achieve better grades, develop your academic career, apply your knowledge at work or make business forecasting related decisions. All of this while exploring the wisdom of best academics and practitioners in the field.</p><p><strong>Become a Forecasting Models Expert in this Practical Course with R</strong></p><ul><li>Read data files and perform statistical computing operations by inputting instructions from R script files on the RGui console.</li><li>Compute simple benchmarking methods such as random walk.</li><li>Recognize time series patterns with moving averages and exponential smoothing (ETS) methods.</li><li>Assess if time series is first order trend stationary or constant in its mean.</li><li>Estimate time series conditional mean with autoregressive integrated moving average (ARIMA) models.</li><li>Define models’ parameters and evaluate if forecasting errors are white noise.</li><li>Select best methods and models automatically by comparing information loss criteria.</li><li>Test methods and models’ forecasting accuracy by comparing their predicting capabilities.</li></ul><p><strong>Become a Forecasting Models Expert and Put Your Knowledge in Practice</strong></p><p>Learning forecasting methods and models is indispensable for business or financial analysts in areas such as sales and financial forecasting, inventory optimization, demand and operations planning, and cash flow management. It is also essential for academic careers in data science, applied statistics, operations research, economics, econometrics and quantitative finance. And it is necessary for any business forecasting related decision.</p><p>But as learning curve can become steep as complexity grows, this course helps by leading you through step by step real world practical examples for greater effectiveness.</p><p><strong>Content and Overview</strong></p><p>This practical course contains over 40 lectures and more than 6.5 hours of content. It’s designed for all forecasting models knowledge levels and a basic understanding of R statistical software is useful but not required.</p><p>At first, you’ll learn how to read data files and perform statistical computing operations by inputting instructions from R script files in the RGui console. Next, you’ll estimate simple forecasting methods such as arithmetic mean, naïve or random walk, seasonal random walk, random walk with drift and use them as benchmarks against other more complex ones. After that, you’ll evaluate these methods’ forecasting accuracy through mean absolute error, root mean squared error and mean absolute percentage error metrics.</p><p>Then, you’ll identify time series level, trend and seasonality patterns through simple moving averages together with Brown’s, Holt’s, Gardner’s, Taylor’s and Winter’s exponential smoothing (ETS) methods. Next, you’ll automatically select best method by comparing several information loss criteria and evaluate these methods’ forecasting accuracy through previously studied error metrics and the introduction of Hyndman and Koehler’s mean absolute scaled error.</p><p>After that, you’ll evaluate if time series is first order trend stationary with augmented Dickey-Fuller and Kwiatkowski-Phillips-Schmidt-Shin tests. Next, you’ll calculate time series conditional mean with Box-Jenkins’s autoregressive integrated moving average (ARIMA) models. Then, you’ll determine models’ parameters with autocorrelation and partial autocorrelation functions. Later, you’ll automatically select best model by comparing Akaike’s and Schwarz’s Bayesian information loss criteria and evaluate these models’ forecasting accuracy through previously studied errors metrics. Finally, you’ll value if best model’s forecasting errors are white noise with Ljung-Box lagged autocorrelation test and therefore don’t include any predicting information.</p>", 
    "end_date": null, 
    "title": "Forecasting Models with R", 
    "price": "20.00", 
    "instructors": "Diego Fernandez", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725460_36fe.jpg", 
    "course_url": "https://www.udemy.com/forecasting-models-with-r/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T11:49:30Z"
}