{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Prerequisites</strong>: No prerequisites, knowledge of some undergraduate level mathematics would help but is not mandatory. Working knowledge of Python would be helpful if you want to run the source code that is provided.</p><p><strong>Taught by</strong> a Stanford-educated, ex-Googler and an IIT, IIM - educated ex-Flipkart lead analyst. This team has decades of practical experience in quant trading, analytics and e-commerce. <br></p><p><em><strong>This course is a down-to-earth, shy but confident take on machine learning techniques that you can put to work today</strong></em><em><strong></strong></em><br></p><p>Let’s parse that.<br></p><p>The course is <strong>down-to-earth </strong>: it makes everything as simple as possible - but not simpler</p><p>The course is <strong>shy but confident</strong> : It is authoritative, drawn from decades of practical experience -but shies away from needlessly complicating stuff. </p><p><strong>You can put ML to work today </strong>: If Machine Learning is a car, this car will have you driving today. It won't tell you what the carburetor is. </p><p>The course is very <strong>visua</strong>l : most of the techniques are explained with the help of animations to help you understand better. </p><p>This course is <strong>practical</strong> as well : There are hundreds of lines of source code with comments that can be used directly to implement natural language processing and machine learning for text summarization, text classification in Python.<br></p><p>The course is also <em><strong>quirky</strong></em>. The examples are irreverent. Lots of little touches: repetition, zooming out so we remember the big picture, active learning with plenty of quizzes. There’s also a peppy soundtrack, and art - all shown by studies to improve cognition and recall.</p><p><strong>What's Covered:</strong></p><p><em><strong>Machine Learning: </strong></em><br></p><p>Supervised/Unsupervised learning, Classification, Clustering, Association Detection, Anomaly Detection, Dimensionality Reduction, Regression. </p><p>Naive Bayes, K-nearest neighbours, Support Vector Machines, Artificial Neural Networks, K-means, Hierarchical clustering, Principal Components Analysis, Linear regression, Logistics regression, Random variables, Bayes theorem, Bias-variance tradeoff</p><p><em><strong>Natural Language Processing with Python: </strong></em><br></p><p>Corpora, stopwords, sentence and word parsing, auto-summarization, sentiment analysis (as a special case of classification), TF-IDF, Document Distance, Text summarization, Text classification with Naive Bayes and K-Nearest Neighbours and Clustering with K-Means</p><p><strong><em>Sentiment Analysis: </em></strong><br></p><p>Why it's useful, Approaches to solving - Rule-Based , ML-Based , Training , Feature Extraction, Sentiment Lexicons, Regular Expressions, Twitter API, Sentiment Analysis of Tweets with Python</p><p><strong>A Note on Python: </strong>The code-alongs in this class all use Python 2.7. Source code (with copious amounts of comments) is attached as a resource with all the code-alongs. <strong>The source code has been provided for both Python 2 and Python 3 wherever possible.</strong> </p><p><strong></strong></p><p>Mail us about anything - anything! - and we will always reply :-)</p>", 
    "end_date": null, 
    "title": "From 0 to 1: Machine Learning, NLP & Python-Cut to the Chase", 
    "price": "20.00", 
    "instructors": "Loony Corn", 
    "commitment": "20.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664620_b5b6.jpg", 
    "course_url": "https://www.udemy.com/from-0-1-machine-learning/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T12:30:53Z"
}