{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>R-Tutorials shows how to create convincing graphs in R</strong>  </p>  <p>  \t<em>Do you want to create overwhelming plots?</em>  </p>  <p>  \t<em>Do you want to show your data crystal clear?</em>  </p>  <p>  \t<em>Do you want your data to be understood by everyone?</em>  </p>  <p>  \t<em>Do you want a versatile graphics toolbox?</em>  </p>  <p>  \t<em>Do you want powerful formatting skills?</em>  </p>  <p>  \t<strong>If you anwered YES to some of these questions - this course is for you!</strong><em>  \t</em><strong></strong>  </p>  <p>  \t                        Data is useless if you do not have the right tools to build informative graphs. Plots need to be understood easily while being accurate at the same time. R-Tutorials gladly enlarges your data toolbox so that you can surmount in your career.  </p>  <p>  \t                        R offers a variety of plotting devices, some of them (like ggplot2) are whole systems which need to be learned like a new language. R-Tutorials shows how to learn those languages.  </p>  <p>  \t                        In this course you will learn about the most important plotting packages ggplot2, lattice and plotrix. According to the teaching principles of R Tutorials <strong>every section is enforced by exercises </strong>for a better learning experience. You can <strong>download the code pdf</strong> of every section to try the presented code on your own.  </p>  <p>  \t                        The course starts with the <strong>base parameters</strong> which are needed to format and manipulate any basic graphs in R.  </p>  <p>  \t                        After that you will learn about the most common types of <strong>graphs in R base</strong> and you will see some very useful graphical extensions of the plotrix package.  </p>  <p>  \t<strong>Ggplot2</strong> is a very famous graphs package and is viewed as the most powerful graphics device R has to offer. You will get an in depth tutorial on that package.  </p>  <p>  \t                        At last you can see how <strong>Lattice</strong> offers some more very useful functions<em>.</em>  </p>  <p>  \t                        With that knowledge you will have an extremely powerful toolbox to excel in your career and in your studies.  </p>  <p>  \t<strong>This is one of the most extensive tutorials on R graphs on the web! If you need graphical skills for your career, this is your chance.</strong>  </p>  <p>  \t      In case you also want to gain a very solid understanding of R`s alternative functionalities including loops and functions, you can check out the Level 1 course. If you are purchasing a <strong>combined package</strong> you will get a pm with the access code to the other course. For special offers and combinations just check out the r-tutorials webpage which you can find below the teachers profile.  </p>    <p>  \t                        What R you waiting for?  </p>  <p>  \t    Martin  </p>", 
    "end_date": null, 
    "title": "Graphs in R - Data Visualization with R Programming Language", 
    "price": "25.00", 
    "instructors": "R-Tutorials Training", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289534_0b86_3.jpg", 
    "course_url": "https://www.udemy.com/graphs-in-r/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-28T13:10:35Z"
}