{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Big Data Analytics course will inspire\nyou to explore opportunities in the world of big data analytics. This course\nwill take you from the basics of big data analytics to the advance analytical\ntools, methods and technology, which could be used for the big data analytics\nprojects. </p><p>You would be learning about the\nbig data explosion, characteristics of big data and their classification. The\nanalytical platform will take you from the changing model of big data analytics\nto the real time analytics. In order to process big data and extract the meaningful\ninsights from it, importance of big data storage and the properties of storage architecture is imparted as a separate chapter. Basics of Hadoop, challenges\nassociated with it and why it is considered as game changer by multiple verticals\nof the industry is an important section which will increase the level of your knowledge bucket. </p><p>Along with it, who are the players\nin the industry providing analytics platforms, visualization tools and Sentiment analysis are well instructed in the chapters. You will be able to know what are the challenges associated with\nbig data and major business verticals that are leveraging big data to get the market insights.     </p><p>The course is accompanied with the industry use case and assignment to evaluate the progress. We wish you happy journey for \"Big Data Analytics\" course. </p>", 
    "end_date": null, 
    "title": "Guide to Big Data Analytics: Origination to Opportunities", 
    "price": "30.00", 
    "instructors": "RankOne Consulting", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708630_dc3f_4.jpg", 
    "course_url": "https://www.udemy.com/big-data-analytics/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T15:02:25Z"
}