{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course, you’ll discover how to use the most sophisticated content analysis tool in the market: BuzzSumo.</p>\n\n\n\n<p>If you want to harness the power of content to grow your business, get more organic traffic and delight your customers, then BuzzSumo is the perfect tool for you:\n\n  </p>\n\n\n\n<ul><li><strong>Powerful content insights:</strong> discover the most shared content across all social networks and run detailed analysis reports</li><li><strong>Influencer Amplification:</strong> Find influencers in any topic area, review the content they share and amplify</li><li><strong>Content Alerts:</strong> Be the first to see content mentioning your keyword, or when an author or competitor publishes new content</li><li><strong>Competitor Analysis:</strong> Track your competitors performance and do detailed comparisons</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br>Contents &amp; Overview</strong>\n\n  </p>\n\n\n\n<p>First, I’ll show you how BuzzSumo works by introducing you to all main features. \n\n  </p>\n\n\n\n<p>Next, you’ll discover how to identify the most shared content on any given topic with just a few clicks, how to display trending content in your niche, and how to reverse-engineer the social media strategy of your competitors. \n\n  </p>\n\n\n\n<p>Next, you’ll learn how to engage and identify major influencers in your market and monitor your competition, so you understand what content works.\n\n  </p>\n\n\n\n<p>By the time you complete this course, you’ll know the tips &amp; tricks to use BuzzSumo to grow your business with content, outperform your competition and position yourself as the go-to source in your market!\n\n  </p>\n\n", 
    "end_date": null, 
    "title": "How To Discover Viral Content With BuzzSumo In 2016", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/834782_4891_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-discover-viral-content-with-buzzsumo-in-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-28T21:18:12Z"
}