{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Working hard in your business, there can be precious little time to work ON it, to make things better. When you do find time, trying to see what matters in columns and rows packed with too much data but too little meaning bites!  </p>  <p>  \t  Do I have the cure? Not just how to <strong style=\"\">keep</strong> the books, but how to <strong style=\"\">know</strong> their meaning, you will learn everything you need to know to revitalize your business reports by taking them visual, then seeing in an instant the meaning trapped inside the data.  </p>  <p>  \t  T<strong style=\"\">he course includes:</strong>  </p>  <ul style=\"\">  \t<li>An <em style=\"\">entertaining</em> Primer on Financial Reports and Accounting Principles, if that is possible...</li>  \t<li>In depth look at the problems of these reports as tools for operating a business  \t<ul style=\"\">  \t\t<li>The Flaw of Averages</li>  \t\t<li>The Foibles of Percentages</li>  \t\t<li>And the Dangers in Limited Comparisons</li>  \t\t<li><strong style=\"\">Then an introduction to reports that do work</strong></li>  \t\t<li>Using the National Pastime and other real world examples </li>  \t</ul>  \t</li>  </ul>  <p>  \t  This is the companion course, and an introduction to the course &quot;Understand Your Business&quot; earn more money, where, after taking this course, you will get a coupon so you can learn about this method in depth, including an even more useful tool, and how to do it for yourself.  </p>  <p>  \t  If Simon Sinek helps with the why, this course helps with the <em style=\"\"><strong style=\"\">how</strong></em>. How to know with precision what you need to make things <em style=\"\">not bite,</em> as in <strong style=\"\">make more money</strong> and have time in your life, and work, <strong style=\"\">and enjoy it.</strong>  </p>  <p>  \t  You only need to bring your uncomputer... your mind.  </p>  <p>  \t  The course is made up of 7 video classes, lasting over a life enhancing hour, and will change the way you look at data for the better!  </p>", 
    "end_date": null, 
    "title": "HOW TO USE YOUR INCOME STATEMENT LIKE A ROADMAP TO SUCCESS", 
    "price": "35.00", 
    "instructors": "Dan Strongin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/117008_5aa2_10.jpg", 
    "course_url": "https://www.udemy.com/work-hacking-business-data/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-08T14:12:25Z"
}