{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Many business mistakes are made due to insufficient market research. That's why I created for you this hands-on course so that you can see how with virtually no money you can research many important to you aspects like the size of the market or a particular segment, the sales tactics of competitors, customer preferences etc. . </p><p><strong>I will show you 3 groups of market research methods:</strong></p> <ul><li>Consulting methods</li> <li>On-line methods </li> <li>Off-line methods</li></ul> <p>Since we want you to be able to do market research on your own there will be very little theory and loads of nice examples in many fields. You will master the market research in fields such as: retail, fast moving consumer goods, food sector, on-line businesses, services and some off-line businesses. This training will be especially beneficial for small business owners, startup, and consultants. You will learn what mystery shopping, store-checks is, bottom-up , top-down approach and others.</p><p><strong>You will be able also to download many additional resources</strong></p> <ul><li>Links to free presentation and movies showing examples of research </li> <li>Links to books worth reading</li> <li>Excels with calculations showing you how you can do the market research as well as analyses and draw conclusions</li></ul><strong>We will use the following tools:</strong><ul><li>Excel</li><li>SimiarWeb</li><li>Keywords Planner by Google</li><li>Facebook Audience Insight</li><li>Facebook</li><li>Mobile market applications</li><li>Slideshare</li><li>Youtube</li><li>Our own tools / formats</li></ul><p>We will be gradually increasing the price of the course from 9 USD so buy this course now to save money and implement fast proposed techniques to become more efficient</p>", 
    "end_date": null, 
    "title": "How to conduct market research  in startups and small firms?", 
    "price": "25.00", 
    "instructors": "Asen Gyczew", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396732_ca98.jpg", 
    "course_url": "https://www.udemy.com/how-to-conduct-market-research-in-startups-and-small-firms/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-17T19:59:08Z"
}