{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\tDescription: IBM SPSS Statistics addresses the entire analytical process, from planning to data collection to analysis, to reporting and deployment. Analysts typically use SPSS Statistics to analyze data by testing hypotheses and then reporting the results.\r\n</p>\r\n<p>\r\n\t<strong>Overview: </strong>IBM SPSS Statistics: Getting Started is a series of self-paced videos (three hours of content). Students will learn the basics of using IBM SPSS Statistics for a typical data analysis session. Students will learn the fundamentals of reading data and assigning variable properties, data transformation, data analysis, and data presentation. Topics that you will learn will include:\r\n</p>\r\n<ul>\r\n\t<li>Know the Basics steps of Analysis</li>\r\n\t<li>Read Data and Assigning Variable Properties.</li>\r\n\t<li>Use the Data Editor: Tools and Exporting Data</li>\r\n\t<li>Summarize Individual Variables</li>\r\n\t<li>Transform Data Values: Single Variables</li>\r\n\t<li>Transform Data: Computing Variables</li>\r\n\t<li>Describe Relationships Between Variables</li>\r\n\t<li>Use Viewer Output Tools and Export Output</li>\r\n</ul>\r\n<p>\r\n\tThis is a first course in using IBM SPSS Statistics. You can begin with this course even if you have never used SPSS Statistics before. The course will not delve deeply into statistical theory, but it will provide a compelling, clear, head start into the fundamentals of using the software, taught by experts users who having been using SPSS Statistics everyday for many years.\r\n</p>", 
    "end_date": null, 
    "title": "IBM SPSS Statistics: Getting Started", 
    "price": "50.00", 
    "instructors": "Sandy Midili", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/158746_60cc_4.jpg", 
    "course_url": "https://www.udemy.com/ibm-spss-statistics-getting-started/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-05T19:25:01Z"
}