{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>***February 2016 - New Advanced Content Live! Over 1.5 Hours of added content!***</em></strong></p><p><strong>Over 800 enrolled since January 2016!  One of Udemy's fastest growing courses!</strong></p><p><strong>In today's job market Excel proficiency is required.</strong>  The ability to not only fluently use Excel but implement it into the daily routine is increasingly mandatory.  A majority of employers requires Excel proficiency but lack any real on-the-job training in this software.<br></p><p><strong>Pro tip: Want to improve your Resume?  Become a Microsoft Certified Excel Specialist!  </strong>This course is the first step towards becoming certified!  It will prepare you in a core aspect of the certification and set you on the path towards one of the most valuable Professional Certifications you can earn!</p><ul><li><em><strong>Excel 2010 Certification Exam Offered via Microsoft Learning Exam #77-882</strong></em><em></em></li><li><em><strong>See Promo Video for Link!</strong></em></li></ul><p>There are numerous ways to learn, yet many lack the real world application <em>you</em> desire.  You need to be able to take data sets your job uses and turn them into user-friendly, easy-to-analyze reports that your boss and even his bosses can read to use to make real-time decisions.  <strong>Today's industries are more data driven than ever; will you be the one to shine?</strong><br></p><p>This is comprehensive PivotTable course will provide you with a <strong>step-by-step guide into developing and using PivotTables</strong>. It is designed in a way that even the most basic beginner to an experienced user can follow along and take away valuable knowledge and skills you can immediately apply to your job. These are Excel's most important tools.  Quite literally, all analysis stems from PivotTables.  In short, they are a summarizing tool to the basic user.  But developed by an ace, they can literally shape the decisions a company makes!</p><p>By the end of this course you will be able to not only be well versed in Excel PivotTables, but empowered with the skills to develop and implement powerful, real-time reports your bosses, even executives would be impressed with!</p><p>This course covers:</p><ul><li><strong>Formatting data as a table</strong></li><li><strong>Optimizing your Workbook</strong></li><li><strong>Using logic functions to extract information</strong></li><li><strong>Applying filters and sorts</strong></li><li><strong>Creating multiple PivotTables</strong></li><li><strong>Applying PivotTable Styles</strong></li><li><strong>Drilling down details</strong></li><li><strong>Presenting sales data</strong></li><li><strong>Using Advanced Formulas</strong><ul><li><strong>GetPivotData</strong></li><li><strong>IfError</strong></li><li><strong>Left &amp; Right</strong></li></ul></li><li><strong><span></span>Manipulating and configuring data for real-time decision making</strong></li><li><strong>Refreshing you PivotTables</strong></li><li><strong>Fixing Common Errors</strong></li><li><strong>Creating PivotCharts</strong></li><li><strong>Advanced PivotChart Formatting</strong></li><li><strong>Building &amp; Using PivotChart Dashboard</strong>s</li></ul><p><strong>Mastering PivotTables is a massive leap forward to mastering Excel, this is the solution!</strong></p>", 
    "end_date": null, 
    "title": "Improve Your Productivity: Master Excel Pivot Tables", 
    "price": "20.00", 
    "instructors": "Logan Spiers", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/714206_b41a_2.jpg", 
    "course_url": "https://www.udemy.com/pivottable-master-in-less-than-1-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-03T08:08:04Z"
}