{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">With &quot;</span><strong style=\"\">Introduction to R</strong><span style=\"\">&quot;, you will gain a solid grounding of the fundamentals of the R language!</span>  </p>  <p style=\"\">  \t                            This course has about <strong style=\"\">90 videos</strong> and <strong style=\"\">140+ exercise questions</strong>, over 10 chapters. To begin with, you will learn to <strong style=\"\">Download and Install R</strong> (and R studio) on your computer. Then I show you some basic things in your first R session.  </p>  <p style=\"\">  \t                            From there, you will review topics in increasing order of difficulty, starting with <strong style=\"\">Data/Object Types</strong> and <strong style=\"\">Operations</strong>, <strong style=\"\">Importing into R</strong>, and <strong style=\"\">Loops and Conditions</strong>.  </p>  <p style=\"\">  \t                            Next, you will be introduced to the use of <strong style=\"\">R </strong>in<strong style=\"\"> Analytics</strong>, where you will learn a little about each object type in R and use that in Data Mining/Analytical Operations.  </p>  <p style=\"\">  \t                            After that, you will learn the use of R in <strong style=\"\">Statistics</strong>, where you will see about using R to evaluate Descriptive Statistics, Probability Distributions, Hypothesis Testing, Linear Modeling, Generalized Linear Models, Non-Linear Regression, and Trees.  </p>  <p style=\"\">  \t                            Following that, the next topic will be <strong style=\"\">Graphics</strong>, where you will learn to create 2-dimensional Univariate and Multi-variate plots. You will also learn about formatting various parts of a plot, covering a range of topics like Plot Layout, Region, Points, Lines, Axes, Text, Color and so on.  </p>  <p style=\"\">  \t                            At that point, the course finishes off with two topics: <strong style=\"\">Exporting out of R</strong>, and <strong style=\"\">Creating Functions</strong>.  </p>  <p style=\"\">  \t                            Each chapter is designed to teach you several concepts, and these have been grouped into sub-sections. A sub-section usually has the following:  </p>  <ul style=\"\">  \t<li style=\"\">A Concept Video</li>  \t<li style=\"\">An Exercise Sheet</li>  \t<li style=\"\">An Exercise Video (with answers)</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Why take a course to learn R?</strong>  </p>  <p style=\"\">  \t                            When I look to advancing my R knowledge today, I still face the same sort of situation as when I originally started to use R. Back when I was learning R, my approach was learn by doing. There was a lot of free material out there (and I refer to that early in the course) that gave me a framework, but the wording was highly technical in nature. Even with the R help and the free material, it took me up to a couple of months of experimentation to gain a certain level of proficiency. <strong style=\"\">What I would have liked at that time was a way to learn the fundamentals quicker</strong>. I have designed this course with exactly that in mind.  </p>  <p style=\"\">  \t<strong style=\"\">Why my course?</strong>  </p>  <p style=\"\">  \t                            For those of you that are new to R, this course will cover <strong style=\"\">enough breadth/depth in R</strong> to give you a solid grounding. I use <strong style=\"\">simple language</strong> to explain the concepts. Also, I give you 140+ exercise questions many of which are based on <strong style=\"\">real world data</strong> for practice to get you up and running quickly, all in a single package. This course is designed to get you functional with R in <strong style=\"\">little over a week</strong>.  </p>  <p style=\"\">  \t                            For those beginners with some experience that have learnt R through experimentation, this course is designed to complement what you know, and round out your understanding of the same.  </p>", 
    "end_date": null, 
    "title": "Introduction to R", 
    "price": "35.00", 
    "instructors": "Jagannath Rajagopal", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/52980_5bfa_8.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-r/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-08T20:17:42Z"
}