{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>You are interested in learning about R Programming and getting into the wide realm of Data Science. You have probably wondered what is the most practical way of getting your feet wet in Data Science (even if you are not interested in this, you should seriously consider so since in the next 10-15 years, Data Science and Artificial Intelligence will be everywhere).</p><p>I have learned over 14 programming languages such as JAVA, Python, C++, R, Matlab, Ruby, CSS, HTML, Angular JS, Java Script as well as other . I have also had a successful freelancing career programming software and mobile applications and well as working as a finance data analyst. Since technology is changing every day, it is adding new realms of complexity to data science than is already out there. It is getting exponentially harder for new people to learn and navigate the immense amount of data science aspects. My job in this course is to demyistify Data Science and Machine Learning so you can see a clear road to success as a R Data Scientist. <br></p><p>This course serves to help you navigate R and know what this seemingly difficult concept really is. In this course, I cover what it is like to be a data analyst, what are some jobs of data analysts, what are the sorts of super powers you can possess by learning R, and also what resources you will need on your path to development as a R Data Application Developer. My hope is to transform you in 4-5 lectures from being a novice in data science to having a strong stance about R and what is possible with R to being someone who has a clear idea of whether he/she is interested in R and what path they can take to further their knowledge and harness the POWER of the dynamic R language.<br></p><p>There is no risk for you as a student in this course. I have put together a course that is not only worth your money, but also worth your time. This course encompasses the basics of R I urge you to join me on this journey to learn how you can start learning how to dominate data and how you can supercharge your data science understanding.</p>", 
    "end_date": null, 
    "title": "Introduction to R Programming - Must See Introduction to R", 
    "price": "20.00", 
    "instructors": "Dhruv Bais", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/768828_2706_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-r-programming-must-see-introduction-to-r/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-20T17:51:34Z"
}