{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to Stakeholder Maps: Learn How to Identify and Manage Stakeholders!</p>\n\n<p>The course covers the crucial aspect of managing stakeholders. From my experience as a Business Analyst and with managing Business Analysts, I realized that stakeholder management was often forgotten. This oversight alone was causing projects to fail. </p>\n\n<p>Come learn everything you need to know around managing stakeholders to increase your project success rate.  You learn about identifying, categorizing, mapping, and assigning stakeholder responsibilities.</p>\n\n<p>As all successful Business Analysts understand, the search for knowledge and techniques will never end.  I look forward to giving you the knowledge and know-how to enable you to complete Stakeholder Management on all of your future projects and increase your project success rate!<br></p>\n\n<p><strong><br></strong></p>\n\n<p><strong>What bonuses are included in this course?</strong></p>\n\n<p>This course includes a Stakeholder Map template!  This template will allow you to be effective and efficient in creating Stakeholder Maps within your projects.</p>\n\n<p>This course also includes a RACI Matrix template FREE! This template will enable to you accurately assign and document stakeholder responsibilities for your projects.</p>\n\n<p><strong><br></strong></p>\n\n<p><strong></strong><strong>Why should you enroll?</strong></p>\n\n<p>You should enroll if you want to quickly learn the building blocks in identifying, categorizing, mapping, and assigning responsibilities to stakeholders.  Stakeholder management is a crucial step for all projects and is many times overlooked.  Don't allow your projects suffer due to mismanaged stakeholders.</p>\n\n<p>As always, Jeremy, the instructor, is always available to help out - as if you were in a live course.  So if you ever need something explained further, you will find an answer.</p>\n\n<p>Get ready to put another skill specific tool in your toolbox!</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Learn to Identify and Manage Stakeholders: Business Analyst", 
    "price": "20.00", 
    "instructors": "Jeremy Aschenbrenner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/712012_e639_2.jpg", 
    "course_url": "https://www.udemy.com/stakeholder-maps/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-31T18:01:24Z"
}