{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  This course is about the Normal distribution, the most important distribution in statistics.  Since the Normal or Gaussian distribution is essential to understanding many inferential statistical concepts and real world applications in the area of quality engineering, six-sigma, business,  psychology, health, education, etc. the course covers all the fundamental concepts.  </p>  <p style=\"\">  \t  We provide standard normal tables using both a negative and positive z values, a table of percentiles of the standard normal distribution and other supporting documents to help the student fully grasp the concepts of the Normal distribution and how to solve real world problems based on that distribution.  </p>  <p style=\"\">  \t  The course has a wealth of selected problems and quizzes to reinforce the understanding of the concepts.  In addition, a  final test is available for those who want to test their understanding.  </p>  <p style=\"\">  \t  In order to fully understand the material, it may take between ten or more hours to read the lectures, practice and complete the quizzes.  </p>  <p style=\"\">  \t  The normal distribution is highly important to understanding real world applications of statistics and as such is recommended to anyone interested in statistics and analytics.  </p>", 
    "end_date": null, 
    "title": "Learn the Normal or Gaussian distribution in statistics", 
    "price": "20.00", 
    "instructors": "Luc Zio", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/111090_6f36_5.jpg", 
    "course_url": "https://www.udemy.com/learn-the-normal-or-gaussian-distribution/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-26T19:38:49Z"
}