{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul><li>Do you have <strong>data</strong> that you want to <strong>see</strong> and <strong>understand</strong>?</li><li>Do you want to create data visualisations?</li><li>Do you want to know how to use the latest version of <strong>Tableau</strong>?</li><li>Do you want to know data viz <strong>best practises</strong> from a <strong>Tableau Zen Master</strong> and dataviz expert?</li><li>Do you want a <strong>step by step </strong>guide through the world or data visualisation?</li></ul><p>If you answered yes to any of the above then this course is for you. </p><p>By taking this course you will learn how you can use Tableau to see and understand your data. </p><p>The course is structured in such as way as to guide you <strong>step by step </strong>through the process of visualising data with Tableau. We'll begin with connecting to your data and understanding the structure. We'll look at the best ways of visualising that data. We'll look at ways to analyse the data using visual analytics. And we will put it all together into a fully interactive dashboard. </p>Using example datasets you will be able to follow along and each section has exercises that build on what you have learnt. <p>Unlike other courses that just teach you how to use the interface, by taking his course you will learn not only <strong>how</strong> to create interactive visualisations using Tableau but also <strong>why</strong>. You will learn the most effective ways to present your data and best practises on when particular chart types should be used.</p>", 
    "end_date": null, 
    "title": "Learn Data Visualisation with Tableau 9", 
    "price": "20.00", 
    "instructors": "Matt Francis", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514982_8e98_3.jpg", 
    "course_url": "https://www.udemy.com/learn-data-visualisation-with-tableau-9/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T21:50:07Z"
}