{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>During the last decade, the momentum coming from both academia and industry has lifted the R programming language to become the single most important tool for computational statistics, visualization and data science.</p><p><strong>Course Update 3(21 Jan,2016): Section 5 on Vectors, Sequences, Arrays and Matrices added</strong></p><p><strong>Course Update 2 (20 Jan, 2016) : Lecture 14,15 16 added in Section 4</strong></p><p><strong></strong><strong>Course Update 1 (26 November 2015) : Section 4: Basics of R Programming - Part 2</strong></p><p>This course is the complete guide to R programming which starts from very basics and takes you the most advance concepts of R. This course is a practical guide which explains the most important aspects of R programming with examples and helps you in working on data analysis. </p><p>We will start by learning how to install R and R studio with basic overview.  Then we move to Basics of R Programming, Working with Data in R, Working with R Packages,R Objects, Interfaces,Working with Date &amp; Times in R,Control Structures in R,Functions in R,Loop in R and much more by adding more content every week/month to make make this course most up to date and valuable course on R.</p><p><strong>About R: </strong>R is a programming language and software environment for statistical computing and graphics. The R language is widely used among statisticians and data miners for developing statistical software and data analysis. Polls, surveys of data miners, and studies of scholarly literature databases show that R's popularity has increased substantially in recent years.</p>", 
    "end_date": null, 
    "title": "Learn R Programming from Scratch", 
    "price": "20.00", 
    "instructors": "Sunil Kumar Gupta", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592100_50af_2.jpg", 
    "course_url": "https://www.udemy.com/learn-r-programming-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T18:41:34Z"
}