{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Why Logistic Regression?</strong></p>  <p>If you would like to become a data analyst/data scientist or take up a project on data analytics, then knowledge on predictive analytics is a key milestone as a large fraction of data analytics projects will be on predictive analytics. </p>  <p>Logistic Regression is one of the most commonly used predictive analytics techniques across domains like finance, healthcare, marketing, retail and telecom. It can help to predict the probability of occurrence of an event i.e. Logistic Regression can answer the questions like – </p>  <ul><li>What is the probability that the customer will buy the product?</li><li>What is the probability that the debtor will pay back the loan?</li><li>What is the probability that your favorite team is going to win the match? </li><li>What is the probability that the employee will churn?</li></ul>        <p>and so on…</p>  <p><strong>What does this course cover?</strong></p>  <p>This course covers logistic regression end-to-end using R in 10 steps, with a real life case study!</p>  <p>You will learn -</p>  <ul><li>Data preparation </li><li>Model building</li><li>Model validation</li><li>Model assessment</li><li>Model implementation</li></ul>          <p><strong>What are the advantages of taking this course?</strong></p>  <ul><li>The course is completely done in <strong>R</strong>, an open source statistical language that is very popular among the data scientists today. </li><li>You will get the <strong>complete R code</strong>, dataset, data dictionary for the case study along with the lectures, as a part of this course.</li><li>This course will make <strong>equip</strong> <strong>you</strong> to take up a new Logistic Regression assignment <strong>on your own</strong>!</li></ul>      <p><strong>Who should enroll for this course?</strong></p>  <p>Aspiring data analysts, students or any one keen on learning Logistic Regression from the basics</p>  <p><strong>What are the prerequisites for this course?</strong></p>  <p>Basic R </p>", 
    "end_date": null, 
    "title": "Logistic Regression using R in 10 Steps", 
    "price": "50.00", 
    "instructors": "Aze Analytics", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/748990_0514_2.jpg", 
    "course_url": "https://www.udemy.com/logistic-regression-using-r-in-10-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T15:24:26Z"
}