{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you ever wondered:</p>\n\n<ol><li>How does <strong>Amazon</strong> recommend products you might be interested in purchasing? OR</li><li>How does <strong>Netflix</strong> decide which movies or TV shows you might want to watch? OR</li><li>How does <strong>Facebook</strong> or <strong>LinkedIn</strong> decide who might you want to form a link with? OR</li><li>How does <strong>Udemy</strong> decide what courses to market to you? OR</li><li>How does <strong>New York Times</strong> decide which news you might be interested in reading?</li></ol>\n\n<p>If you have and you want to learn the science behind them, you have come to the right place. In this course, I will show you how these companies use Recommender systems or Machine Learning to influence your purchasing decisions. This course is timely and extremely relevant now as almost all major service-oriented companies function on recommender systems.</p>\n\n<p>You will understand how these systems work and learn how to build and use your own recommender systems, just like these big companies do.</p>\n\n<p> <strong>Learn how to build the recommender systems that are being used by almost every big service-oriented company in today’s world with this introductory course for beginners.</strong></p>\n\n<ul><li>Goals and applications of recommender systems</li><li>News recommendation, products you may like and movie suggestions</li><li>Popularity-based systems, Collaborative Filtering and Co-occurrence matrix</li><li>Matrix Factorization and estimated Topic Vectors</li><li>Cold-start problem and how to handle it</li><li>Precision, Recall and Optimal recommenders</li><li>Free 11000-word e-book on recommender systems</li></ul>\n\n<p>Recommender Systems have changed the way people find products, information, and even other people. They study patterns of behavior to know what someone will <strong>prefer</strong> from among a collection of things they have never experienced. The technology behind recommender systems has evolved over the past 20 years into a rich collection of tools that enable the practitioner or researcher to develop effective recommenders. Such systems are being used by companies such as Amazon, Facebook, Netflix, LinkedIn, Quora, Udemy, New York Times, etc. By taking this course, you will learn the most important of those tools, including how they work, how to use them, how to evaluate them, and their strengths and weaknesses in practice. The algorithms you will study include popularity-based systems, classification-based approach, collaborative filtering, matrix recommendation, etc.</p>\n\n<p><strong>Content and Overview</strong></p>\n\n<p>This course contains <strong>23 lectures, 1 hour of content, 4 quizzes and one 11000 word e-book</strong> written by me. It is designed for anyone with an understanding of basic mathematics, who wishes to understand the technology behind the recommender systems they encounter every day. By taking this course you will establish a strong understanding of the concept behind recommender systems.</p>\n\n<p>Starting with properly defining the goals of a recommender system, this course will show you numerous practical examples of where these systems are found in our daily lives. Then you will jump right into the action and start building your first recommender systems in the first section itself.<br></p>\n\n<p>In the second section, you will move on to design more sophisticated systems and eventually learn how to develop a product recommendation system similar to Amazon. You will learn how to implement Collaborative Filtering, tackle the adverse effects of very popular items, construct and normalize the Co-occurrence matrix and leverage purchase histories for making better recommendations.</p>\n\n<p>In the third section, you will learn how to develop a movie recommendation system like Netflix by Matrix Factorization. You will learn how to automatically construct “topic” vectors corresponding to users and movies that will help you in predicting movie ratings. Moreover, you will discover the infamous cold-start problem and understand how to solve it by blending or combining different recommendation approaches.</p>\n\n<p>After making you familiar with popular recommender systems, the course will show you how to evaluate the performance of these systems by metrics such as precision and recall. You will know about optimal recommenders and learn how to make the best recommender in a constrained practical scenario.</p>\n\n<p>Students completing the course will be literate in one of the most widely used tools of Machine Learning namely Recommender Systems.</p>\n\n<p>They will be able to identify what recommender system is being used by a company whenever it markets an item (product, movie, news, etc.) to them. Moreover, if you want to design a recommender system for your own business or work, you will know by intuition which ones to try and how to evaluate and compare their performance before you select the final one.</p>\n\n<p>The massive 11000-word e-book, which you receive as a part of this course not only contains the ideas taught in the lecture videos, but also has bonus materials that reinforce the concepts you have learned and give you new tricks to design recommender systems.</p>", 
    "end_date": null, 
    "title": "Machine Learning for Recommender Systems: A Beginner's Guide", 
    "price": "25.00", 
    "instructors": "Dr. Subhrajit Roy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/719624_da3b_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-amazon-netflix-etc-give-you-recommendations/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-07T14:51:29Z"
}