{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Start to learn the concepts and procedures of <strong style=\"\">Statistical Quality Control</strong>, which are intensively used in business, engineering, manufacturing and in many places when decision making processes are driven by data and facts rather just by intuitive feelings. </p><p style=\"\">The course covers the core chapters of <strong style=\"\">Statistical Quality Control</strong> and it helps understanding and applying the most complex and sophisticated statistical methods in practice. </p><p style=\"\"><strong style=\"\">Learn how to decide which factors influence the key indicators of your product or service using the Analysis of Variance Method (ANOVA).</strong></p><ul style=\"\"><li style=\"\">Completely Randomized Design.</li><li style=\"\">Randomized Block Design.</li><li style=\"\">Completely Randomized Design with Random Factor.</li><li style=\"\">One-way and Two-way Experimental Layout.</li><li style=\"\">Model Building in Multifactor Balanced Design.</li></ul><p style=\"\"><strong style=\"\">Get familiar with the concept of Statistical Process Control (SPC) and the proper use of Control Charts.</strong></p><ul style=\"\"><li style=\"\">Stability and Capability of a process.</li><li style=\"\">Control Charts for Variables.</li><li style=\"\">Control Charts for Attributes.</li><li style=\"\">Application of Control Charts in Phase I and Phase II.</li><li style=\"\">Shewhart Charts.</li><li style=\"\">Cumulative Sum (CUSUM) Charts.</li><li style=\"\">Exponentially Weighted Moving Average (EWMA) Charts.</li><li style=\"\">Moving Average (MA) Charts.</li><li style=\"\">Normal and Non-normal data.</li><li style=\"\">Fast Initial Response Method.</li></ul><p style=\"\"><strong style=\"\">Learn how to quantify the actual and potential capability of your process to satisfy the needs of your costumer.</strong></p><ul style=\"\"><li style=\"\">Product Characterization.</li><li style=\"\">Process Capability Analysis.</li><li style=\"\">Overall and Potential Capability.</li><li style=\"\">Capability Analysis with Non-normal Data.</li></ul><p style=\"\"><strong style=\"\">Learn the way of checking the capability of your measurement system to ensure the required precision.</strong></p><ul style=\"\"><li style=\"\">Gauge and Measure System Analysis.</li><li style=\"\">The Analysis of Variance Method with Balanced ANOVA.</li><li style=\"\">Minitab Gage R&amp;R Tools.</li></ul><p style=\"\"><strong style=\"\">This course is comprehensive and covers the core chapters of Statistical Quality Control.</strong></p><p style=\"\"><strong style=\"\">35</strong> video lectures.</p><p style=\"\"><strong style=\"\">5</strong> hours.</p><p style=\"\"><strong style=\"\">Enjoy the benefit of the well-structured, short and yet comprehensive video lectures</strong>.</p><p style=\"\">In these lectures all things happen inside a Minitab driven analysis. </p><p style=\"\">All in one place, within the same video lesson, gaining computer skills, getting theoretical background, and mainly getting the ability to interpret the outputs properly. </p><p style=\"\">These lessons are specially prepared with intensive screen animations, concise and yet comprehensive, well-structured explanations. If you like you can turn on subtitles to support the comprehension.</p><p style=\"\">The verification of the assumptions for a test, the basic theoretical background or even the formulas applied in a procedure appear in these video tutorials at the right instances of the analysis. The outputs are explained in a detailed manner in such an order that enables you to make the appropriate conclusions.</p><p style=\"\">In these video lectures Minitab is used not only to solve problems but to explore and demonstrate different concepts of Statistical Quality Control to make you easily familiar with rather complex concepts of the field.</p><p style=\"\"><strong style=\"\">Learn in a way when you watch the video and do the same simultaneously in your own Minitab.</strong></p><p style=\"\">Watching a video, pausing it and doing the same steps simultaneously in your own Minitab is the best way of getting experience and practice in data manipulation. Repeating the sessions with different sample data develops your skill to solve statistical problems with a software. </p>", 
    "end_date": null, 
    "title": "Mastering Statistical Quality Control with Minitab", 
    "price": "20.00", 
    "instructors": "László Csanaki Bognár", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499680_8595_10.jpg", 
    "course_url": "https://www.udemy.com/mastering-statistical-quality-control-with-minitab/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T05:36:39Z"
}