{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Ever wonder how some business analysts are so confident and always seem to have it together?  I&#039;ll show you how to be confident in communicating with stakeholders and gain their trust and respect.</p><p style=\"\">Eliciting requirements from stakeholders is the most important part of a business analyst&#039;s job. Everything you do, everything you document is based on those requirements. In order to achieve success in this area, you must have excellent communication skills.</p><p style=\"\"><strong style=\"\">Master Specific Communication Techniques to Set Yourself Apart from the Growing Crowd of Business Analysts</strong></p><ul style=\"\"><li style=\"\">Know what questions to ask and how to ask them to get detailed requirements from stakeholders</li><li style=\"\">Learn the techniques you should be using to respond to stakeholders in order to facilitate positive discussion</li><li style=\"\">Identify listening filters that are keeping you from hearing and understanding the <em style=\"\">complete</em> message from stakeholders</li></ul><p style=\"\">In this course we&#039;ll fix, together, the bad communication habits that are keeping you from getting detailed requirements - even the ones you don&#039;t realize you have!</p><p style=\"\">To get the most out of this course, you should have an understanding of what the business analyst job function is.</p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">You&#039;ll begin the course with an overview of projects and project teams</p><p style=\"\">You&#039;ll gain an understanding of how to identify listening filters and how to avoid them</p><p style=\"\">To manage conversations, you&#039;ll learn the process of effective communication and how body language affects your requirements elicitation meetings.</p><p style=\"\">You&#039;ll learn techniques that help you become a better listener and understand how you can use silence as a communication tool.</p><p style=\"\">It&#039;s imperative to your success as a business analyst that you know what questions to ask to get at the right information.  In this course we&#039;ll review the different types of questions and I&#039;ll give you specific questions you can ask in meetings to help draw out the information you need from stakeholders and subject matter experts.</p><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong></p><ul style=\"\"><li style=\"\">14 lectures and more than 90 minutes of content</li><li style=\"\">Gain confidence in requirement sessions</li><li style=\"\">Improved professional image through better communication</li><li style=\"\">Know what questions to ask - and how to ask them - to elicit detailed requirements</li><li style=\"\">You&#039;ll receive 1 IIBA (International Institute of Business Analysis) PDU/CDU credit towards qualifications for CBAP/CCBA exam or re-certification</li><li style=\"\">A quiz to verify your understanding of the materials</li><li style=\"\">A certificate of completion</li></ul><strong style=\"\">Who is the target audience?</strong><ul style=\"\"><li style=\"\">Current business analysts that are not confident in requirements elicitation meetings</li><li style=\"\">Business analysts that are consistently missing requirements</li><li style=\"\">Individuals that want to move into the business analyst career</li></ul>", 
    "end_date": null, 
    "title": "Mastering Business Analysis Through Effective Communication", 
    "price": "20.00", 
    "instructors": "Teresa Bennett", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550962_b473_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-business-analysis-through-effective-communication/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T11:16:19Z"
}