{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h4>About the class:</h4>\n\n<p>This is part 6 of a series of classes on how to use Microsoft Excel. The objective of the series is to break the study of Microsoft Excel into small manageable pieces that can easily be completed in under 75 minutes. You can complete this class in a single session. Take advantage of this opportunity to learn Microsoft Excel.</p>\n\n<h4>What is Microsoft Excel?</h4>\n\n<p>Microsoft excel is a software that allows its users the ability to find a simple solution to daily data related problems. Excel can be utilized to access most problems in a mathematical spreadsheet format. For example: Let’s say you want to manage your finances. Excel offers a solution by which a user can make a list of expenses and maintain an ongoing log of incurred expenses.</p>\n\n<p>Excel offers a drawing board for daily challenges in a spreadsheet format. Excel allows its users the ability to enter data in a table format. After arranging the data in an excel sheet users are then able to perform calculations on this data for the purpose of data analysis. The type of calculations that needed to be made over hundreds of pages of paper can now be made in a single spreadsheet through Microsoft Excel.</p>\n\n<h4>Why learn Microsoft Excel?</h4>\n\n<p>There is a very valid and compelling business reason for learning Excel. However more compelling than the business reason is the value excel brings into our personal lives. Excel can serve as a decision making tool as well as a personal life management tool. Management of personal finances becomes significantly easier with the help of Microsoft Excel. Other very common uses of Excel in person life include job application management, weight management, vacation budget management, market analysis and decision analysis. On the business end, excel is essential for all business success. Microsoft Excel lies at the core of all business decision making. The charting feature of excel allows for the representation of data in a colorful format that plays an integral role in business communication. Microsoft Excel is driving Global business decisions in all types of business ranging from large corporations to small privately owned companies. Most all professionals come across Microsoft Excel at some point in their careers.</p>\n\n<h4>Who is this class for?</h4>\n\n<p>This is a beginner and intermediate level class.</p>\n\n<h4>Class outline: </h4>\n\n<h4>1. Functions: The IF Statement ~ 2o minutes</h4>\n\n<p>IF Statement - Part 1 ~ 5 minutes</p>\n\n<p>IF Statement - Part 2 ~ 6 minutes</p>\n\n<p>IF Statement - Part 3 ~ 4 minutes</p>\n\n<p>IF Statement - Part 4 ~ 5 minutes</p>\n\n<h4>2. Functions: Nested IF Statement ~ 14 minutes</h4>\n\n<p>Nested IF Statement - Part 1 ~ 7 minutes</p>\n\n<p>Nested IF Statement - Part 2 ~ 7 minutes</p>\n\n<h4>3. Functions: Vlookup nested inside an if statement ~ 12 minutes</h4>\n\n<p>Vlookup nested inside an if statement - Part 1 ~ 5 minutes</p>\n\n<p>Vlookup nested inside an if statement - Part 2 ~ 7 minutes</p>\n\n<h4>4. Personal finance example ~ 63 minutes</h4>\n\n<p>Personal Finance Example - Part 1 ~ 9 minutes</p>\n\n<p>Personal Finance Example - Part 2 ~ 9 minutes</p>\n\n<p>Personal Finance Example - Part 3 ~ 9 minutes</p>\n\n<p>Personal Finance Example - Part 4 ~ 9 minutes</p>\n\n<p>Personal Finance Example - Part 5 ~ 9 minutes</p>\n\n<p>Personal Finance Example - Part 6 ~ 9 minutes</p>\n\n<p>Personal Finance Example - Part 7 ~ 9 minutes</p>", 
    "end_date": null, 
    "title": "Microsoft Excel in 75 minutes – Part 6", 
    "price": 0, 
    "instructors": "Startup Saturdays", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/821096_6899_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-in-75-minutes-part-6/", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-13T17:02:13Z"
}