{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>It is often both useful and revealing to create visualizations, plots and graphs of the multivariate data that is the subject of one&#039;s research project. Often, both pre-analysis and post-analysis visualizations can help one understand “what is going on in the data&quot; in a way that looking at numerical summaries of fitted model estimates cannot. The lattice package in R is uniquely designed to graphically depict relationships in multivariate data sets.</p><p>This course describes and demonstrates this creative approach for constructing and drawing grid-based multivariate graphic plots and figures using R. Lattice graphics are characterized as multi-variable (3, 4, 5 or more variables) plots that use conditioning and paneling. Consequently, it is a popular approach for, and a good fit to visually present the results of multi-variable statistical model fitting. The appearance of most of the plots, graphs and figures are determined by panel functions, rather than by the high-level graphics function calls themselves. Further, the user of lattice graphics has extensive and comprehensive control over many more of the details and features of the visual plots, far greater control that is afforded by the base graphics approach in R. The method is based on trellis graphics which were popularized in the S language developed by Bell Labs.</p>", 
    "end_date": null, 
    "title": "Multivariate Data Visualization with R", 
    "price": "20.00", 
    "instructors": "Geoffrey Hubona, Ph.D.", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572302_accc_2.jpg", 
    "course_url": "https://www.udemy.com/multivariate-data-visualization-with-r/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T11:34:37Z"
}