{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                      In about one hour you can learn to:  </p>  <ol>  \t<li>Use exponential smoothing, the most popular forecasting method.</li>  \t<li>Test your forecasts before putting the company (or your reputation) at risk.</li>  \t<li>Assess whether your forecasts are adding value.</li>  </ol>  <p>  \t                Most managers involved in forecasting are missing one or more skills in basic forecasting. We boil it down to five steps, and show you how to master each one.  </p>  <p>  \t                   This course is all about doing. You look over our shoulders and view the computer screen as we forecast sales for multiple products and industries.  </p>  <p>  \t                        Every forecaster should be able to do exponential smoothing. It is by far the most popular forecasting approach among experienced forecasters.  </p>  <p>  \t                        One of the biggest leaps you can make as a forecaster is in accuracy measurement. We show you the best way, and we demonstrate it throughout the course.  </p>  <p>  \t                       Forecasting software works, so you don't need to understand detailed forecasting formulas. Instead, we focus on how to use forecasting software wisely.  </p>  <p>  \t                        We are confident that mastery of the basic concepts provided in this course will significantly increase your forecast accuracy. The result: fewer stock-outs, higher sales, and lower inventory costs.  </p>  <p>  \t                    Included in this course:  </p>  <ul>  \t<li>9 lectures</li>  \t  \t<li>6 Excel workbooks (actual spreadsheets from lectures)</li>  </ul>    <p>  \t  We tap into the very latest thinking on forecasting. But rather than bore you with our technical mastery of the subject, we focus on simplicity and practicality. Only the essential ingredients of forecasting excellence are presented. And we do so with passion.  </p>  <p>  \t  We hope you enjoy the course. Good luck  and good forecasting!  </p>  <p>  \t<sub></sub>  </p>", 
    "end_date": null, 
    "title": "Need to predict the future?", 
    "price": "30.00", 
    "instructors": "Mark Blessington, Dr. Karl Hellman, Kevin OConnell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63597_2859_6.jpg", 
    "course_url": "https://www.udemy.com/forecasting-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-03T10:53:41Z"
}