{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Microsoft PowerBI is the easiest to use reporting, data analysis and interactive dashboard tool available today!  Microsoft PowerBI is available for free - all you need to do is sign up!</p><p>In this course I will teach you how to easily turn your data into powerful intelligence and insight to drive your business decisions.  PowerBI uses powerful drag and drop capabilities that make it a breeze to create reports and dashboard.  I will also show you how easy it is to publish your dashboards and to access them through your smartphone, tablet or laptop.</p><p>This course is for anybody who works with data and wants to learn how to quickly and easily get to speed with the cloud version of PowerBI or learn the more powerful PowerBI Desktop Designer.   </p><p>The course covers the following topics:</p><ul><li>Introduction to PowerBI and how to signup</li><li>How to create your first online report and dashboard</li><li>How to download the PowerBI Desktop Designer</li><li>Loading, transforming and filtering data in PowerBI</li><li>Creating tables and reports</li><li>Learning how to use the wide range of graphs and visualizations </li><li>Creating relationships between tables of data</li><li>Creating powerful calculations, key metrics and key performance indicators</li><li>Creating interactive dashboards</li><li>Publishing dashboards to PowerBI</li></ul><p>In this course we use a step by step video based approach to show you how to create reports, analyze data and develop interactive dashboards.  The videos are extremely easy to follow and data is provided so you can follow the instructions at the same time.<span></span></p><p><br></p>", 
    "end_date": null, 
    "title": "Powerful Reports and Dashboards with Microsoft PowerBI", 
    "price": "20.00", 
    "instructors": "Ian Littlejohn", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468172_d1c0_4.jpg", 
    "course_url": "https://www.udemy.com/powerful-reports-and-dashboards-with-microsoft-powerbi/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-05T14:20:02Z"
}