{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p> Choice-Based Conjoint, also often called Discrete Choice Experimentation, is a powerful research and management tool that allow us to understand and predict people&#039;s preferences. Whether it is a manager wanting to predict product preferences, a health researcher wanting to explore the treatment preferences of patients, or a transport engineer examining people&#039;s choices of public transport this tool can provide the insight needed. </p><p>離散選擇分析，也常常被稱為離散的選擇模型，是一個強大的研究和管理工具讓我們瞭解和預測人的喜好。無論是企業管理者想要預測市場對產品的喜好，學者想要探索患者的治療喜好，或交通工程師想預測乘客對公共交通工具的選擇，離散選擇分析亦可以提供所需的洞察力。</p><p> This course starts with an introduction to the capabilities and applications of Choice Based Conjoint that is suitable for all audiences. It explains the basic requirements of a CBC research project, and details the outputs that can be obtained. The course then continues on to more advanced topics where you will get training and hands on experience developing and running a CBC project. This includes design, data collection, analysis and reporting of results. </p><p>本課程先介紹離散選擇分析的功能和應用，適合所有人。它說明一個CBC研究項目的基本要求，並詳細說明瞭可以得到的結果。本課程然後進深到更高級的主題，你會得到開發和運行CBC項目的培訓和實踐經驗。這包括設計，數據收集，分析和報告結果。</p><p> This course is suitable for managers, marketing/business researchers, and academic researchers interested in building an understanding of CBC. </p><p>本課程適用於經理，營銷/商業研究人員，並有意打造CBC的學術研究人員。</p><p> If you are a PhD student I am happy to provide a discounted rate for this course. Please contact me through the Udemy messaging service. Provide your university email address, your name, and a link to your supervisor&#039;s profile on your university website. </p><p>如果你是一個博士研究生，我們很高興為你提供折扣。請通過Udemy與我聯繫, 提供您的大學電子郵件地址，名字，大學網站及鏈接到你上司的個人資料。</p><p> This version of the course includes Chinese language support, with all materials translated from English to Chinese. </p>這個課程當然也包括中文的支援，亦包括由英語翻譯成中文的課程材料。", 
    "end_date": null, 
    "title": "Predict Consumer Decicions with Choice-Based Conjoint: 中国", 
    "price": "50.00", 
    "instructors": "Luke Greenacre", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550612_73fd_6.jpg", 
    "course_url": "https://www.udemy.com/learningcbc-chinese/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T01:22:32Z"
}