{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Learn a rich Portfolio of Professional Tools and Techniques and Master effective, powerful Methods to apply them to solve your Problems from the small personal one to the Complex Business one. </strong>Examples and Case Studies are used throughout to help you achieve just that and<strong> a whole Section dedicated to Practice Activities will enable you to develop Key Skills. </strong></p>  <p><strong>Your success will be attributed to solving problems quickly, effectively and efficiently </strong>in a logical, structured manner that you will be taught.<strong> Such problem solving will help you considerably in your decision making. </strong> </p><p><strong>The Tools, Techniques and Methods you will learn through the Course are often used by Professionals such as Consultants and Analysts</strong> - who are welcome to the Course to develop their skills further. However, the step-by-step approach adopted here makes the Course accessible to all and easy to use by each and everyone.</p><p><strong>You need to complete all the lectures - including the Practice Activities Section</strong> -  to develop the full problem solving capacity the course seeks to develop. But, you do not need any prior knowledge of problem solving.</p><p><strong>Reach over Now, click the button and \"Take the Course\". You will master a set of fundamental skills that will accompany you for life: a first class investment, no doubt!</strong></p>", 
    "end_date": null, 
    "title": "Problem Solving: Tools, Techniques & Method", 
    "price": "25.00", 
    "instructors": "A. Bouzid", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629162_1811_3.jpg", 
    "course_url": "https://www.udemy.com/problem-solving-tools-techniques-methods/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T21:01:51Z"
}