{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Prerequisites</strong>: Working knowledge of Python is necessary if you want to run the source code that is provided. Basic knowledge of machine learning, especially ML classification techniques, would be helpful but it's not mandatory.</p>\n\n<p><strong>Taught by</strong> a Stanford-educated, ex-Googler and an IIT, IIM - educated ex-Flipkart lead analyst. This team has decades of practical experience in quant trading, analytics and e-commerce. \n</p>\n\n<p><em><strong>This course takes a completely practical approach to applying Machine Learning techniques to Quant Trading</strong></em></p>\n\n<p>Let’s parse that.</p>\n\n<p><strong>Completely Practical: </strong>This course has<em><strong> just enough theory</strong></em> to get you started with both Quant Trading and Machine Learning. The focus is on practically applying ML techniques to develop sophisticated Quant Trading models. From setting up your own historical price database in MySQL to writing hundreds of lines of Python code, the focus is on doing from the get go.</p>\n\n<p><strong>Machine Learning Techniques: </strong>We'll cover a variety of machine learning techniques, from K-Nearest Neighbors and Decision Trees to pretty advanced techniques like Random Forests and Gradient Boosted Classifiers. But, in practice Machine Learning is not just about the algorithms. Feature Engineering, Parameter Tuning, Avoiding overfitting; these are all a part and parcel of developing Machine Learning applications and we do it all in this course. \n</p>\n\n<p><strong>Quant Trading: </strong>Quant Trading is a perfect example of an area where the use of Machine Learning leads to a step change in the quality of the models used. Traditional models often depend on Excel and building sophisticated models requires a huge amount of manual effort and domain knowledge. Machine Learning libraries available today allow you to build highly sophisticated models that give you much better performance with much less effort. \n</p>\n\n<p><strong>What's Covered: </strong>\n</p>\n\n<p><em><strong>Quant Trading : </strong></em>Financial Markets, Stocks, Indices, Futures, Return, Risk, Sharpe Ratio, Momentum Investing, Mean Reversion, Developing trading strategies using Excel, Backtesting</p>\n\n<p><em><strong>Machine Learning: </strong></em>Decision Trees, Ensemble Learning, Random Forests, Gradient Boosted Classifiers, Nearest Neighbors, Feature engineering, Overfitting, Parameter Tuning\n</p>\n\n<p><strong><em>MySQL</em>: </strong>Set up a historical price database in MySQL using Python. \n</p>\n\n<p><strong><em>Python Libraries</em> : </strong>Pandas, Scikit-Learn, XGBoost, Hyperopt</p>\n\n<p><strong>A Note on Python: </strong>The code-alongs in this class all use Python 2.7. Source code (with copious amounts of comments) is attached as a resource with all the code-alongs.</p>\n\n\n\n<p>Mail us about anything - anything! - and we will always reply :-)</p>", 
    "end_date": null, 
    "title": "Quant Trading using Machine Learning", 
    "price": "20.00", 
    "instructors": "Loony Corn", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/857300_de37.jpg", 
    "course_url": "https://www.udemy.com/quant-trading-using-machine-learning/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-23T08:38:37Z"
}