{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Let’s get your data in shape!</strong>\n\n  </p>\n\n<p>Data Pre-Processing is the <em>very first step in data analytics</em>. You \ncannot escape it, it is too important. Unfortunately this topic is \nwidely overlooked and information is hard to find. \n\n  </p>\n\n\n\n<p>With this course I will change this!\n\n  </p>\n\n\n\n<p>Data Pre-Processing as taught in this course has the following steps:\n\n  </p>\n\n\n\n<p>1.       Data Import: this might sound trivial but if you consider \nall the different data formats out there you can imagine that this can \nbe confusing. In the course we will take a look at a standard way of \nimporting csv files, we will learn about the very fast fread method and I\n will show you what you can do if you have more exotic file formats to \nhandle.\n\n  </p>\n\n\n\n<p>2.       Selecting the object class: a standard data.frame might be \nfine for easy standard tasks, but there are more advanced classes out \nthere like the data.table. Especially with those huge datasets nowadays,\n a data.frame might not do it anymore. Alternatives will be demonstrated\n in this course.\n\n  </p>\n\n\n\n<p>3.       Getting your data in a tidy form: a tidy dataset has 1 row \nfor each observation and 1 column for each variable. This might sound \ntrivial, but in your daily work you will find instances where this \nsimple rule is not followed. Often times you will not even notice that \nthe dataset is not tidy in its layout. We will learn how tidyr can help \nyou in getting your data into a clean and tidy format.\n\n  </p>\n\n\n\n<p>4.       Querying and filtering: when you have a huge dataset you \nneed to filter for the desired parameters. We will learn about the \ncombination of parameters and implementation of advanced filtering \nmethods. Especially data.table has proven effective for that sort of \nquerying on huge datasets, therefore we will focus on this package in \nthe querying section.\n\n  </p>\n\n\n\n<p>5.       Data joins: when your data is spread over 2 different tables\n but you want to join them together based on given criteria, you will \nneed joins for that. There are several methods of data joins in R, but \nhere we will take a look at dplyr and the 2 table verbs which are such a\n great tool to work with 2 tables at the same time.\n\n  </p>\n\n\n\n<p>6.       Integrating and interacting with SQL: R is great at \ninteracting with SQL. And SQL is of course the leading database \nlanguage, which you will have to learn sooner or later as a data \nscientist. I will show you how to use SQL code within R and there is \neven a R to SQL translator for standard R code. And we will set up a \nSQLite database from within R.<em class=\"redactor-inline-converted\"> </em></p>\n\n<p><em class=\"redactor-inline-converted\">How do you best prepare yourself for this course?\n</em>\n  \n\n</p>\n\n<p>You only need a basic knowledge of R to fully benefit from this \ncourse. Once you know the basics of RStudio and R you are ready to \nfollow along with the course material. Of course you will also get the R\n scripts which makes it even easier.\n\n  </p>\n\n\n\n<p>The screencasts are made in RStudio so you should get this program on\n top of R. Add on packages required are listed in the course.\n\n  </p>\n\n\n\n<p>Again, if you want to make sure that you have proper data with a tidy\n format, take a look at this course. It will make your analytics with R \nmuch easier!\n\n  </p>", 
    "end_date": null, 
    "title": "R Data Pre-Processing & Data Management - Shape your Data!", 
    "price": "30.00", 
    "instructors": "R-Tutorials Training", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/779488_ee79_2.jpg", 
    "course_url": "https://www.udemy.com/r-data-management-shape-your-data/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-01T23:54:36Z"
}