{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Are you new to R?</em>  </p>  <p style=\"\">  \t<em style=\"\">Do you want to learn more about statistical programming?</em>  </p>  <p style=\"\">  \t<em style=\"\">Are you in a quantitative field?<br style=\"\">  \t</em>  </p>  <p style=\"\">  \t<em style=\"\">You just started learning R but you do not want to struggle with all the free but unorganized material available elsewhere?</em>  </p>  <p style=\"\">  \t<em style=\"\">Do you want to hack the learning curve and stay ahead of your competition?</em>  </p>  <p style=\"\">  \t<strong style=\"\">If YES came to your mind to some of those points - read on!</strong>  </p>  <p style=\"\">  \t              This Tutorial is the first step - your Level 1 - to R mastery.  </p>  <p style=\"\">  \t              All the important aspects of statistical programming ranging from handling different data types to loops and functions, even graphs are covered.  </p>  <p style=\"\">  \t                       While planing this course we were using the Pareto 80/20 principle. We filtered for the most useful items in the R language which will give you a <strong style=\"\">quick and efficient learning experience.</strong>  </p>  <p style=\"\">  \t                       Learning R will help you conduct your projects and on the long run it is an invaluable skill which will <strong style=\"\">enhance your career.</strong>  </p>  <p style=\"\">  \t                       Your journey will start with the theoretical background of object and data types. You will then learn how to handle the most common types of objects in R. Much emphasis is put on loops in R since this is a crucial part of statistical programming. It is also shown how the apply family of functions can be used to do loops. According to the teaching principles of R Tutorials <strong style=\"\">every section is enforced with exercises </strong>for a better learning experience. You can <strong style=\"\">download the code pdf</strong> of every section to try the presented code on your own.  </p>  <p style=\"\">  \t                       In the graphics section you will learn how you can create and tailor your graphs. As an example we are creating boxplots, histograms and piecharts. Since the graphs interface is quite the same for all types of graphs, this will give you a solid foundation.  </p>  <p style=\"\">  \t                       This tutorial is your first step to benefit from this open source software.  </p>  <p style=\"\">  \t          Since data visualization is such an important part within data science you can also take a look at our <strong style=\"\">Graphs in R</strong> course. This course gives you in depth knowledge about R plotting devices. Nowhere else on the web can you find such an extended course about this crucial topic.  </p>  <p style=\"\">  \tIf you are purchasing a <strong style=\"\">combined package</strong> you will get a pm with the access code to the other course. For special offers and combinations just check out the r-tutorials webpage which you can find below my profile.<br style=\"\">  </p>  <p style=\"\">  \t          What R you waiting for?  </p>  <p style=\"\">  \t                       Martin  </p>", 
    "end_date": null, 
    "title": "R Level 1 - Data Analytics with R", 
    "price": "20.00", 
    "instructors": "R-Tutorials Training", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/257414_dc4d_2.jpg", 
    "course_url": "https://www.udemy.com/r-level1/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-08T01:39:54Z"
}