{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <em style=\"\">  SPSS for Newbies Part 1 </em>covers material mostly to the level of a first course in statistics taught at university. The course is based on one that I have delivered to organizations, as a day course for the public in the UK, and parts have been taught to postgrad social science students picking up tools quickly to undertake dissertations. Because people taking my course have little to no background in stats, I take the gentle approach, explaining concepts in a non-mathematical way. And because of my experience, I am able to share with you in the videos, things to watch out for - the kind of things students slip up on.  </p>  <p>  \t           You have access to video tutorials, course notes with screen shots, and tasks to reinforce your learning. Should you get stuck on any task, don&#039;t worry, as you can get help from me through the online help forum. (It really is kind of being in a class!).  </p>  <p>  \t           The introductory course comprises two parts, and each part has material for a one day course. This first part sets out by presenting a mini questionnaire used in a survey. Whether you have collected the data from a survey of a clinical trial, how does one go about entering data into SPSS, and when the data is in SPSS, how do you go about analyzing it? I show you how to enter data into SPSS, and in Part 1 of this course, I show you two basic tools - plots, and the popular crosstabs (chi-square test) analysis. The coverage of crosstabs is about what you&#039;d see on a masters course with pretty much everything you&#039;d need for a project.  </p>  <p>  \t       SPSS newbies often think they have to study and entire stats book before they can do a project. That&#039;s not the case. Once you have the basics you can study the method that&#039;s applicable to your study. This course gives you the basic tools to do that.  </p>  <p>  \t <strong style=\"\">  Don&#039;t have SPSS on your machine?</strong>  </p>  <p>  \t         Don&#039;t let that stop you signing up. I show you how to download a free trial version.  </p>", 
    "end_date": null, 
    "title": "SPSS for Newbies Part 1", 
    "price": "40.00", 
    "instructors": "Phil Chan, PhD", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/243124_932e_3.jpg", 
    "course_url": "https://www.udemy.com/spss-for-newbies-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-14T09:18:03Z"
}