{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">Become an expert in statistical analysis with the most extended SPSS course at Udemy: 146 video lectures covering about 15 hours of video!</strong></p><p>Within a very short time you will master all the essential skills of an SPSS data analyst, from the simplest operations with data to the advanced multivariate techniques like logistic regression, multidimensional scaling or principal component analysis.</p><p>The good news – <strong style=\"\">you don&#039;t need any previous experience with SPSS</strong>. If you know the very basic statistical concepts, that will do.</p><p><strong style=\"\">And you don&#039;t need to be a mathematician or a statistician to take this course (neither am I). </strong>This course was especially conceived for people who are not professional mathematicians – all the statistical procedures are presented in a simple, straightforward manner, avoiding the technical jargon and the mathematical formulas as much as possible. The formulas are used only when it is absolutely necessary, and they are thoroughly explained.</p><p>Are you a student or a PhD candidate? An academic researcher looking to improve your statistical analysis skills? Are you dreaming to get a job in the statistical analysis field some day? Are you simply passionate about quantitative analysis? This course is for you, no doubt about it.</p><p>Very important: this is <strong style=\"\">not</strong> just an SPSS tutorial. It does not only show you which menu to select or which button to click in order to run some procedure. This is a hands-on statistical analysis course in the proper sense of the word. </p><p>For each statistical procedure I provide the following pieces of information:</p> <ul style=\"\"><li>a short, but comprehensive description (so you understand what that technique can do for you)</li> <li>how to perform the procedure in SPSS (live)</li> <li>how to interpret the main output, so you can check your hypotheses and find the answers you need for your research)</li></ul> <p>The course contains 56 guides, presenting 56 statistical procedures, from the simplest to the most advanced (many similar courses out there don&#039;t go far beyond the basics).</p><p>The first guides are absolutely free, so you can dive into the course right now, at no risk. And don&#039;t forget that you have 30 full days to evaluate it. If you are not happy, you get your money back.</p><p><strong style=\"\">So, what do you have to lose?</strong></p>", 
    "end_date": null, 
    "title": "SPSS For Research", 
    "price": "25.00", 
    "instructors": "Bogdan Anastasiei", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341502_a7f5_2.jpg", 
    "course_url": "https://www.udemy.com/spss-for-research/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T16:31:52Z"
}