{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Udemy is changing its pricing structure o<strong>n April 4th when </strong>this course will increase to $20. Save money by buying it for $9 now.</strong></p>  <p>  \t       How do you feel about statistics? Are you afraid you will pick the wrong test? Or make a mistake in your calculations and misinterpret your data? In short: are you afraid of stats?  </p>  <p>  \t       If so, you've come to the right place! I'm here to demonstrate that your fear of statistics is unfounded.  </p>  <p>  \t       Despite what many people think, <strong>you don't need to learn complex mathematical formulae to perform statistical analyses</strong>. You just need to learn two things.  </p>  <ul>  \t<li>First, you need to know how to choose the right statistical test.</li>  \t<li>Then, you need to know how to do the analysis in computer software like SPSS so you can draw conclusions from your data.</li>  </ul>  <p>  \t       It's that easy!  </p>  <p>  \t       This course will show you how to pick the right statistical test by answering four simple questions about your data and your research methodology. I call these <strong>the building blocks of statistical analysis</strong>, and it involves no maths at all.  </p>  <p>  \t       Then you'll learn how to use SPSS to do the hard work for you. Even if you've never used SPSS, I'll help you get comfortable with the program. You'll learn how to open SPSS, enter data into the program and save it. Next you'll learn how to use SPSS to obtain descriptive statistics such as the mean, median, mode and frequencies. Then you'll discover how to use SPSS to calculate inferential statistics such as the t-test, correlation, Chi-square, ANOVA and regression.  </p>  <p>  \t       The ability to perform quantitative data analysis is becoming an increasingly important skill for researchers to possess. Adding these skills to your CV will make you more employable and give you the confidence you need to start analysing your data today.  </p>", 
    "end_date": null, 
    "title": "SPSS Essentials: Statistics made easy", 
    "price": "20.00", 
    "instructors": "Dr Tendayi Viki", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/157806_7695_5.jpg", 
    "course_url": "https://www.udemy.com/spss-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-04T12:19:22Z"
}