{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>This SPSS data analysis course was created for one reason, which is to help anyone without statistics or mathematics background to analyze data in SPSS, choose the right descriptive statistics technique and write up the result of the findings with confidence.</p><p>The course covers everything from entering data into SPSS to interpreting the result and offers easy step-by-step guide to mastering descriptive statistics in SPSS.</p><p>Firstly, we will take you through the SPSS interface, how to work the system and avoid some of the mistakes people make when choosing variable types and format in SPSS. After that, we will dive into entering data into SPSS, sorting, editing and removing data, and most importantly how to transform any variable into a new variable with recode functions. We will then focus on descriptive statistics in SPSS and you will learn how to run the major descriptive statistics like Mean, Median, Mode, Standard Deviation and One-Samples t-test etc.</p><p>You will learn how to create graphs, plots and charts in SPSS and how to manipulate them to suit your needs.</p><p>Finally, we teach you the most important skill that most students wish they had; How to choose the appropriate statistical technique to analyze data in SPSS. We have broken down choosing the right test in SPSS into 3 simple steps:</p><ol><li>What is your research question?</li><li>What is the type of variable and how many do you have?</li><li>What is the level of measurement of your variables?</li></ol><p>Using the three steps above, you will be able to choose the right test to use to analyze your data and we also use the flow chart to choose the right test for 20 real-life research question examples. <br></p><p>Upon completing this course, you will know when to use the following inferential statistic techniques:</p><ul><li>Pearson Correlation</li><li>Spearman Ranked Order Correlation</li><li>Kendall's Tau B Correlation</li><li>Independent Samples T-test</li><li>Paired Samples T-test</li><li>Point Bi-Serial Correlation</li><li>Mann Whitney U Test</li><li>Kruskal Wallis </li><li>Mcnemar's Test</li><li>Chi Square</li><li>Linear Regression</li><li>Mutiple Regression</li><li>Binary Logistic Regression</li><li>Repeated Measures ANOVA</li><li>Between Subject ANOVA</li><li>Mixed/Split-Plot ANOVA</li><li>and so much more.</li></ul><p><strong>Course Materials</strong></p><p>We use a mix of video materials, slides, template documents, SPSS data and output files to make sure this course is delivered effectively.</p><p>Taking this course is perhaps going to be the best decision you will ever make if you are going to use SPSS. It is not just about the content and context, it is more to do with the way the course is delivered and our ability to debunk complicated techniques. Our philosophy is; if you can't explain it simply, you don't understand it well enough. We explain everything using simple English to make sure you make the most of this course. This course should only take few days, but what you will learn will help you for the rest of your life.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "SPSS Beginners: Master SPSS", 
    "price": "25.00", 
    "instructors": "SPSS Statisticians MyProjects", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645114_ffe1_3.jpg", 
    "course_url": "https://www.udemy.com/spss-data-analysis-spss-online-video-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T19:49:17Z"
}