{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>[UPDATE <strong class=\"redactor-inline-converted\">April 6, 2016</strong>: New <strong class=\"redactor-inline-converted\">magical</strong> installation process and lecture to get everything set up. Installation and set up had previously been the #1 complaint from our students, but now you should be good to go in 5 minutes!]</p>\n\n<p><strong>This SQL course has been taken by fine marketing folks at Google, Facebook, Amazon, Lyft, and Udemy!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Your Story:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                Bill just graduated from college and had no real marketable skills (especially as a humanities major). As he was trying to fill up his resume to make himself look impressive, he found himself listing Microsoft Word and PowerPoint in the 'skills' portion of his resume. Awesome. Not.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                Joe was working in a marketing position at a small company. He had a bunch of creative ideas but sometimes felt like he was shooting in the dark and guessing at what customers were doing.  If only he had some insights about user behavior so he could be a more data-driven marketer. But data analysis is only for technical folks… right?  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Our Story:</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                David and Pete joined Udemy with little to no technical experience.  But after a lot of trial and error, headaches, and help from their friends, they got good enough to uncover unique insights for themselves, their team, and their company. They were able to discover interesting things about user behavior, create dashboards to track and measure progress on team goals, pull data for the exec team to use in investor pitch decks, and get data driven about decisions they made.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">What You'll Learn:</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                We've distilled our knowledge and experience using SQL into a short course so that by the end, you'll have the raw skills to do some real data analysis for your company using SQL - a language virtually EVERY company uses.  Even if you have no technical background, don't be afraid!  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">How This Course is Structured:</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>In this course we'll be pretending we're a real business (i.e. Blockbuster) so the stuff you learn will be easy to apply to your own situation/company.  No abstract/theoretical mumbo jumbo.</li>  \t<li>We'll go through queries a real business would run while also teaching you the raw skills undergirding those queries so you can adapt those skills to create custom queries for your own specific purposes</li>  \t<li>To reinforce learning, we have exercises and quizzes scattered throughout the course so you can learn by doing</li>  \t<li>We'll have a bonus section where new lectures will be added occasionally (including student-requested lectures, more advanced topics, strategies for getting unstuck, etc.)</li>  \t<li>We'll be actively involved in the discussion board answering any questions you might have! Don't be afraid to ask!</li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">A Note About Pedagogy:</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                We know what it's like to buy a book, feel good about yourself, never finish it and have nothing to show for it.  We don't want that to happen with this course.  We want this to be a course you'll actually finish. We believe half of learning is motivation and engagement, so we've tried extra hard to make this course fun, relevant, entertaining, and punchy - no frills, no dragging things out, just the good stuff. Heck, you might even find yourself skipping a party to spend time with your new best friends (i.e. us)!  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">FAQs</strong>:  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol>  \t<li><strong class=\"redactor-inline-converted\">Do I need to purchase any software to take this course?</strong>  \t  \t<strong class=\"redactor-inline-converted\">Nope!</strong> Everything we use to do data analysis with MySQL is completely free.  We'll walk you through the installation and set-up of any software we'll be using  \t</li>  </ol>", 
    "end_date": null, 
    "title": "SQL for Newbs Masterclass: Beginner Data Analysis", 
    "price": "20.00", 
    "instructors": "A Course You'll Actually Finish, David Kim, Peter Sefton", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/203556_5ff1_3.jpg", 
    "course_url": "https://www.udemy.com/sql-for-newbs/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-23T00:26:17Z"
}