{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">No setup required! If you have an internet connection, you can do everything in this course (including the hands-on work)</strong></p><ul style=\"\"><li style=\"\">Getting started with SQL queries (SELECT, JOIN, WHERE, etc.)</li><li style=\"\">Aggregate Functions (SUM, MAX, AVG, etc.)</li><li style=\"\">Comparison of Excel functions and queries</li></ul><p style=\"\"><strong style=\"\">Your Story</strong></p><p style=\"\">Sue is a business professional for a growing startup in Silicon Valley. She runs marketing campaigns for her firm, but doesn&#039;t know how to aggregate the data from these efforts. As a result, she doesn&#039;t have a firm grasp on what is and isn&#039;t working. She knows she would be more valuable to the company if she could interpret the data and give her managers detailed results.</p><p style=\"\">Jerry is a student finishing up his degree and looking to get into the business field. His instructors say it is important to have something that makes you stand out from the crowd, and Jerry wants to stand out with his ability to interpret numbers and make business decisions. His only problem is that he doesn&#039;t know how to access and pull the information he needs from databases. He has explored various SQL blogs online, but hasn&#039;t been able to find a comprehensive course that can give him the confidence to pull data from databases on his own.</p><p style=\"\"><strong style=\"\">Our Story</strong></p><p style=\"\">Tom and Taylor work with SQL on a daily basis as database engineers. But the road to understanding SQL was not an easy one. Even though they both have degrees in Information Systems, they were taught very little SQL in school. What about online courses? All they could find were free bits of information with little instruction on the one end, to complex certification courses that assumed the reader was well-versed in tech talk on the other end. The road wasn&#039;t easy, and getting their first SQL job was a mystery, because they didn&#039;t really know what they were getting into. After finding out the hard way, Tom and Taylor have discovered how to learn fast and easily. They know how to cut past the tech-talk and get straight to practical application, where all the real learning happens. They have created this course for you, so that you can learn quickly and get to improving your business processes.</p><p style=\"\"><strong style=\"\">Master SQL To Use In Your Business Analysis</strong></p><ul style=\"\"><li style=\"\">Hands-on SQL Writing and Coaching</li><li style=\"\">Report Retrieval From SQL Database</li><li style=\"\">Advanced SQL Filtering</li></ul><p style=\"\"><span style=\"\"></span></p><p style=\"\"><strong style=\"\">Feel Confident in Your Ability to Write and Interpret SQL</strong></p><p style=\"\">As we move further into the 21st century, massive amounts of data are collected on a wide variety of topics. Once you have the data, you can analyze it - but what if you don&#039;t know how to extract the data in the first place? SQL is the way that your data is stored, and you need to be able to find that data to understand it. Your ability to interpret information is tied to your effectiveness as a business person, and is linked with your worth to your company. If you are looking for a raise or promotion, or even a better job altogether, you will need to know SQL.</p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">In over 2 hours, this course covers how to extract data from SQL databases to generate a variety of business reports. To get good at SQL, you are going to need motivation. And there is no better way to get that motivation than to quickly have a tangible product of your efforts. That is why after the first video, you will have already used a database to create your first business report. That&#039;s right, this isn&#039;t a &quot;sit back and watch the instructor&quot; kind of course - you&#039;ll be writing SQL yourself, right from the get go. Don&#039;t worry though, we&#039;ll guide you along the whole process, and demonstrate before asking you to follow suit.</p><p style=\"\">From there, we&#039;ll repeat the process with 3 other reports, each time adding new elements to give us more useful data. Admittedly, it might feel a little like a whirlwind, but you&#039;ll be excited at your new-found skills, and after the initial report making, we will take you back and review all of the fundamentals, so that you will feel confident that you can reproduce your results when you are on your own.</p><p style=\"\"><strong style=\"\">Who is this course for?</strong></p><ul style=\"\"><li style=\"\">Business professionals who need to know how to get information from databases (learn general SELECT statements)</li><li style=\"\">College students looking to enter the business world</li><li style=\"\">NOT for SQL professionals looking to take their database skills to the next level</li><li style=\"\">NOT for people who already understand basic SELECT statements. This course will not cover new material if that&#039;s the case</li></ul><p style=\"\"><strong style=\"\">What will students need to know or do before starting the course?</strong></p><ul style=\"\"><li style=\"\">Make sure you have an internet connection so you can watch the videos and browse to our website for doing the course exercises. You won&#039;t need any other materials for this course</li><li style=\"\">Get in the <span style=\"\">mindset to learn quickly and jump right into practical application. This i<span style=\"\">s not one of those courses where you sit back and watch hours of video</span></span></li><li style=\"\"><span style=\"\">NO prior SQL knowledge is required</span></li></ul><p style=\"\"><strong style=\"\">What makes this course different?</strong></p><ul style=\"\"><li style=\"\">No setup is required. You will be able to run all of your SQL from our site, whether you&#039;re on your phone, or on your computer.</li><li style=\"\">There is no fluff in this course. You&#039;ll learn the basics of SQL by immediately using databases to create business reports. We&#039;ll go through how to make the reports initially, explain what is going on, and then go back through the reports more in depth</li></ul><p style=\"\"><strong style=\"\">At the end of my course, students will be able to...</strong></p><ul style=\"\"><li style=\"\">Confidently run general SQL that will fuel your business analysis</li><li style=\"\">Create a customer reports, employee performance reports, product trend reports, and customer value reports, all from the SQL database</li></ul>", 
    "end_date": null, 
    "title": "SQL for Business", 
    "price": "50.00", 
    "instructors": "Taylor Chiu", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467162_e401_3.jpg", 
    "course_url": "https://www.udemy.com/sql-business/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T05:09:53Z"
}