{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong>Course Update: January, 2016.<strong></strong></p><p><strong>Get marketable and highly sought after skills in this course that will substantially increase your knowledge of data analytics, with a focus in the area of significance testing, an important tool for A/B testing and product assessment.</strong></p>  <p><strong>Many tests covered, including three different t tests, two ANOVAs, post hoc tests, chi-square tests (great for A/B testing), correlation, and regression. Database management also covered! </strong></p><strong>  </strong><p><strong>Two in-depth examples provided of each test for additional practice</strong></p>  <p>This course is great for professionals, as it provides step by step instruction of tests with clear and accurate explanations. Get ahead of the competition and make these tests parts of your data analytic toolkit!</p><p>Students will also have the tools needed to succeed in their statistics and experimental design courses. <br></p><p>Data Analytics is an rapidly growing area in high demand (e.g., McKinsey)<br></p><p>Statistics play a key role in the process of making sound business decisions that will generate higher profits. Without statistics, it's difficult to determine what your target audience wants and needs.  </p>  <p>  \tInferential statistics, in particular, help you understand a population's needs better so that you can provide attractive products and services.  </p>  <p>  \tThis course is designed for business professionals who want to know how to analyze data. You'll learn how to use IBM SPSS to draw accurate conclusions on your research and make decisions that will benefit your customers and your bottom line.  </p>  <p>  \t<strong>Use Tests in SPSS to Correctly Analyze Inferential Statistics</strong>  </p>  <ul>  \t<li>Use the One Sample t Test to Draw Conclusions about a Population</li>  \t<li>Understand ANOVA and the Chi Square</li>  \t<li>Master Correlation and Regression</li>  \t<li>Learn Data Management Techniques</li>  </ul>  <p>  \t<strong>Analyze Research Results Accurately to Make Better Business Decisions</strong>  </p>  <p>  \tWith SPSS, you can analyze data to make the right business decisions for your customer base. And by understanding how to use inferential statistics, you can draw accurate conclusions about a large group of people, based on research conducted on a sample of that population.  </p>  <p>  \tThis easy-to-follow course, which contains illustrative examples throughout, will show you how to use tests to assess if the results of your research are statistically significant.  </p>  <p>  \tYou'll be able to determine the appropriate statistical test to use for a particular data set, and you'll know how to understand, calculate, and interpret effect sizes and confidence intervals.  </p>  <p>  \tYou'll even know how to write the results of statistical analyses in APA format, which you can then adapt to other formats.  </p>  <p>  \t<strong>Contents and Overview</strong>  </p>  <p>  \tThis course begins with a brief introduction before diving right into the One Sample t Test, Independent Samples t Test, and Dependent Samples t Test. You'll use these tests to analyze differences and similarities between sample groups in a population. This will help you determine if you need to change your business plan for certain markets of consumers.  </p>  <p>  \tNext, you'll tackle how to use ANOVA (Analysis of Variance), including Post-hoc Tests and Levene's Equal Variance Test. These tests will also help you determine what drives consumer decisions and behaviors between different groups.  </p>  <p>  \tWhen ready, you'll master correlation and regression, as well as the chi-square. As with all previous sections, you'll see illustrations of how to analyze a statistical test, and you'll access additional examples for more practice.  </p>  <p>  \tFinally, you'll learn about data management in SPSS, including sorting and adding variables.  </p>  <p>  \tBy the end of this course, you'll be substantially more confident in both IBM SPSS and statistics. You'll know how to use data to come to the right conclusions about your market.  </p>  <p>  \tBy understanding how to use inferential statistics, you'll be able to identify consumer needs and come up with products and/or services that will address those needs effectively.  </p>", 
    "end_date": null, 
    "title": "Statistics / Data Analysis in SPSS: Inferential Statistics ", 
    "price": "35.00", 
    "instructors": "Quantitative  Specialists", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/84085_9689_13.jpg", 
    "course_url": "https://www.udemy.com/inferential-statistics-spss/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-26T18:01:44Z"
}