{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em style=\"\">Are you a R user?</em>  </p>  <p>  \t<em style=\"\">Do you want to learn more about statistical programming?</em>  </p>  <p>  \t<em style=\"\">Are you in a quantitative field?</em>  </p>  <p>  \t<em style=\"\"><em style=\"\">You want to know how to perform statistical tests and regressions?</em></em>  </p>  <p>  \t<em style=\"\"><em style=\"\">Do you want to hack the learning curve and stay ahead of your competition?</em></em>  </p>  <p>  \t<em style=\"\">If YES came to your mind to some of those points - read on!</em>  </p>  <p>  \t<em style=\"\">This tutorial will teach you anything you need to know about descriptive and inferential statistics as well as regression modeling in R.</em>  </p>  <p>  \t<em style=\"\">While planing this course we were focusing on the most important inferential tests that cover the most common statistical questions. </em>  </p>  <p>  \t<em style=\"\">After finishing this course you will understand when to use which specific test and you will also be able to perform these tests in R.</em>  </p>  <p>  \t<em style=\"\">Furthermore you will also get a very good understanding of regression modeling in R. You will learn about multiple linear regressions as well as logistic regressions.</em>  </p>  <p>  \t<em style=\"\">According to the teaching principles of R Tutorials every section is enforced with exercises for a better learning experience. You can download the code pdf of every section to try the presented code on your own.</em>  </p>  <p>  \t<em style=\"\">Should you need a more basic course on R programming we would highly recommend our R Level 1 course. The Level 1 course covers all the basic coding strategies that are essential for your day to day programming.</em>  </p>  <p>  \t<em style=\"\">Since data visualization is such an important part within data science you can also take a look at our Graphs in R course. This course gives you in depth knowledge about R plotting devices. Nowhere else on the web can you find such an extended course about this crucial topic.</em>  </p>  <p>  \t<em style=\"\">If you are purchasing a combined package you will get a pm with the access code to the other course. For special offers and combinations just check out the r-tutorials webpage which you can find below my profile. </em>  </p>  <p>  \t<em style=\"\">What R you waiting for?</em>  </p>  <p>  \t<em style=\"\">Martin</em>  </p>", 
    "end_date": null, 
    "title": "Statistics in R - The R Language for Statistical Analysis", 
    "price": "20.00", 
    "instructors": "R-Tutorials Training", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/330386_49fd_3.jpg", 
    "course_url": "https://www.udemy.com/statisticsinr/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-29T12:01:43Z"
}