{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Linear regression is one of the <strong>essential</strong> tools in statistical analysis. In this course, we'll walk through <strong>step-by-step</strong> how to conduct many important analyses using SPSS. </p><p>Although you will learn the basics of what these statistics are, we'll avoid complicated mathematical discussions and go right to what you need to know to conduct these analyses.</p><p>Linear regression is basically a tool that allows you to test relationships between many variables at the same time, control for variables' effects, and create simple statistical models that allow you to make predictions.</p><p>In this course, we'll cover the following key topics:</p><ol><li><span></span><strong>Correlations</strong>: You probably already know this, but understanding how to test the <em>correlation</em><span> between two variables gets us started in this course.</span></li><li><span><strong>Simple Linear Regression:</strong><span> Taking correlations one step further by creating a statistical model.</span></span></li><li><span><span><strong>Multiple Linear Regression:</strong><span> Being able to test multiple predictors at the same time and testing the unique effect of each.</span></span></span></li><li><span><span><span><strong>Hierarchical Linear Regression:</strong><span> How to test for the influence of different variables by adding them to the model one at a time.</span></span></span></span></li><li><span><span><span><span><strong>Interaction Analysis</strong><span><strong>:</strong><span> How to test whether there's a two-way interaction between variables (also known as a \"moderator\" analysis)</span></span></span></span></span></span></li></ol><p></p><p>You'll not only learn how to conduct these analyses, we'll also go over how to <strong>interpret</strong> the statistical results and how to <em></em><strong>graph</strong> the results using SPSS and a special Excel template I've created for you.</p><p>As a bonus, we also learn how to use a new free add-on to SPSS called \"<strong>PROCESS</strong>,\" which simplifies a lot of the steps in doing interaction analysis in regression.</p><p>This course is meant to get you started in analyzing data using linear regression in SPSS. Whether you have data of your own that need to understand or you just want to know more about statistical data analysis, you'll get a running head start with this simple, easy-to-follow course.</p><p>I do linear regression analysis all the time in SPSS to conduct research in psychology, so I've become familiar with the steps it takes to pull off these analyses. I'm confident you will be able to, too!</p>", 
    "end_date": null, 
    "title": "Statistics & Data Analysis: Linear Regression Models in SPSS", 
    "price": "20.00", 
    "instructors": "Andrew Luttrell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515004_3e43.jpg", 
    "course_url": "https://www.udemy.com/linear-regression-analysis-basics-in-spss-statistics/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T22:17:24Z"
}