{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you want to learn how to perform the most useful statistical analyses in the R program, you have come to the right place.</p>    <p>Now you don’t have to scour the web endlessly in order to find how to do a Pearson or Spearman correlation, an independent t test or a factorial ANOVA, how to perform a sequential regression analysis or how to compute the Cronbach’s alpha. Everything is here, in this course, explained visually, step by step.</p>    <p>So, what will you learn in this course?</p>    <p>First of all, you will learn how to perform association tests in R, both parametric and non-parametric: the Pearson correlation, the Spearman and Kendall correlation, the partial correlation and the chi-square test for independence.</p>    <p>The test of mean differences represent a vast part of this course, because of their great importance. We will approach the t tests, the analysis of variance (both univariate and multivariate) and a few non-parametric tests. For each technique we will present the preliminary assumption, run the procedure and carefully interpret all the results.</p>    <p>Next you will learn how to perform a multiple linear regression analysis. We have assign several big lectures to this topic, because we will also learn how to check the regression assumptions and how to run a sequential (or hierarchical) regression in R.</p>    <p>Finally, we will enter the territory of statistical reliability – you will learn how to compute three important reliability indicators in R.</p>    So after graduating this course, you will get some priceless statistical analysis knowledge and skills using the R program. Don’t wait, enroll today and get ready for an exciting journey!", 
    "end_date": null, 
    "title": "Statistics with R - Intermediate Level", 
    "price": "20.00", 
    "instructors": "Bogdan Anastasiei", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691892_ed21_2.jpg", 
    "course_url": "https://www.udemy.com/statistics-with-r-intermediate-level/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T08:47:24Z"
}