{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is designed for me to pass on as much knowledge about Tableau to you as I can.</p><p>We will go through the most popular Tableau questions and I will reveal how I would go about answering each of these questions. </p><p>Moreover, there will be ample examples in this course and I will explain my answers in detail and actually show you how it all plays out in the software.</p><p>The course is broken up into three sections based on the question types:</p><ul><li>Simple</li><li>Moderate</li><li>Difficult</li></ul><p>Also you can use the questions in this course to check your knowledge of Tableau - after I reveal the question, pause the video and try to answer the question. Then check if your answer is the same as mine.</p><p>This is a short, dynamic, and fun<span> course! </span></p><p><span>Unlike my other courses you won't have to do any exercises. The lectures have a conversational format, so all you need to do is relax and enjoy how we delve into the diverse world of Tableau.</span></p><p><span>I look forward to seeing you inside!</span></p><p><span>Kirill</span></p><p><em>Disclaimer: This course does not guarantee you getting a job or promotion. This course is designed to pass my knowledge of Tableau onto you. Although I have put in substantial effort into preparing this course there may be some things that are incorrect. Therefore, do not rely solely on these answers - these are nothing more than my opinions and experiences. Make sure to verify any information independently. I will not accept any responsibility for consequences of you relying on the information provided in this course for job interviews, professional work, and any other purposes.</em></p>", 
    "end_date": null, 
    "title": "Tableau 9 Interview Q&A: Tableau For Data Science Careers", 
    "price": "20.00", 
    "instructors": "Kirill Eremenko", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658516_9fd5_2.jpg", 
    "course_url": "https://www.udemy.com/tableau-interview/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T04:14:56Z"
}