{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Tableau is a rapidly growing data visualization and analysis software application. Developing this skill set early will give you a differentiated advantage in searching for jobs and displaying data you may currently work with. </p><p>This Tableau course is meant for anyone looking to get an overview displaying the software's capability. I will be working with different types of data to show you when and how to use the different views Tableau offers, including Maps, Bubble Charts, Scatter Plots, and Bar Charts. I will walk through 3 separate analyses using different data sources to highlight the software's functionality.</p><p>Here is an outline of the course:</p><p>Lecture 1: Background</p><ul><li>Tableau great for clean &amp; easy data visualization, defaults to best practice options, works well with large bodies of data</li></ul><p>Lecture 2: Installing Tableau</p><ul><li>Program installation</li><li>Tableau Public &amp; Tableau Desktop</li></ul><p>Lecture 3: Creating Bar &amp; Packed Bubble Charts with McDonald's Nutritional Data</p><ul><li>Create Bar Chart with color shading</li><li>Create Packed Bubble chart and filter Top 10 by field values</li><li>Create Text Table and format shading</li><li>Create Dashboard for presenting information</li></ul><p>Lecture 4: Creating a Map Using U.S. Census Data</p><ul><li>Create map by converting field to geographic property</li><li>Add shading onto map using built-in Tableau data</li></ul><p>Lecture 5: Creating Sets &amp; Scatter Plots Using College Cost Data</p><ul><li>Create scatterplot and use trend lines to assess correlation</li><li>Create Sets and compare against each other using the Dashboard</li></ul>", 
    "end_date": null, 
    "title": "Tableau for Beginners - Analyzing 3 Separate Data Sets", 
    "price": "20.00", 
    "instructors": "Erik Rood", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560486_e9bc_4.jpg", 
    "course_url": "https://www.udemy.com/tableau-introduction-dataset-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T14:03:18Z"
}