{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          One the top reasons people fail with product sales, marketing and product development is..Lack of solid research  </p>  <p>  \t           Thousands of dollars are wasted developing products, prototypes, importing containers of goods and building businesses without understanding the market and how the product will sell.  </p>  <p>  \t          With very little time, cost and the right tools you can easily avoid this, take the guesswork out and develop a product go to market strategy that succeeds  </p>  <p>  \t          And , part of your research should include some time reviewing listings on Google or Ebay. But these are search engines, they&#039;re designed for their own purposes and algorithms based on their target market.  </p>  <p>  \t          Ebay’s search engine will present listings most likely to sell and least likely to damage Ebay’s brand for high customer satisfaction and Ebay make more money and build their brand.  </p>  <p>  \t          But what you really need to know is; what products are selling well, what products or product categories are selling well or trending upwards, and importantly being able to analyse WHY so you can position your product to catch this opportunity.  </p>  <p>  \t          Terapeak has data Access to:  </p>  <p>  \t          70 Billion eBay transaction records  </p>  <p>  \t          20 Million Amazon product listing  </p>  <p>  \t          Consumer purchase behaviour  </p>  <p>  \t          124 Million shoppers and growing  - up from 100 Million in 2013  </p>  <p>  \t          In this course you will:  </p>  <p>  \t          Find Products that sell  </p>  <p>  \t          Find Hot products and categories  </p>  <p>  \t          Analyse how and why these products are selling  </p>  <p>  \t          Develop your strategy for placing your product on the market.  </p>  <p>  \t          Considering price, day of week, time of day, seasonal sales, offering features like delivery, extended warranty  </p>  <p>  \t          Don’t start an online store, build a product, work in a niche, Crowdfund a product or start any product development without doing your product research.  </p>  <p>  \t          This course will show you how.  </p>", 
    "end_date": null, 
    "title": "Terapeak- Advanced product market research ", 
    "price": "20.00", 
    "instructors": "Mr Peter Cooper", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404346_3416_3.jpg", 
    "course_url": "https://www.udemy.com/product-research-terapeak/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T13:22:01Z"
}