{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Are you an <strong style=\"\">advanced R</strong> user, looking to expand your R toolbox?  </p>  <p>  \t  Are you interested in <strong style=\"\">social media sentiment analysis</strong>?  </p>  <p>  \t  Do you want to learn how you can get and use Twitter data for your R analysis?  </p>  <p>  \t  Do you want to learn how you can systematically find related words (keywords) to a search term using Twitter and R?  </p>  <p>  \t  Are you interested in creating visualizations like <strong style=\"\">wordclouds</strong> out of text data?  </p>  <p>  \t  Do you want to learn which R packages you can use for web scraping and text analysis purposes?  </p>  <p>  \t<em style=\"\">If YES came to your mind to some of those points – this course might be tailored towards your needs!</em>  </p>  <p>  \t  This course will teach you anything you need to know about how to handle social media data in R. We will use Twitter data as our example dataset.  </p>  <p>  \t  During this course we will take a walk through the whole text analysis process of Twitter data.  </p>  <p>  \t  At first you will learn which packages are available for social media analysis.  </p>  <p>  \t  You will learn how to scrape social media (Twitter) data and get it into your R session.  </p>  <p>  \t  After that we will filter, clean and structure our text corpus.  </p>  <p>  \t  The next step is the visualization of the text data via wordclouds and dendrograms.  </p>  <p>  \t  And in the last section we will do a whole sentiment analysis by using a common word lexicon.  </p>  <p>  \t  All of those steps are accompanied by exercise sessions so that you can check if you can put the information to work.  </p>  <p>  \t  According to the teaching principles of R Tutorials every section is enforced with <strong style=\"\">exercises</strong> for a better learning experience. You can download the <strong style=\"\">code pdf</strong> of every section to try the presented code on your own.  </p>  <p>  \t  If you are not yet on an advanced level in R programming, we would highly recommend our R Level 1 course. The <strong style=\"\">Level 1 course</strong> covers all the basic coding strategies that are essential for your day to day programming. R features like functions and apply are covered in the Level 1 course and are also needed for this course.  </p>  <p>  \t  For special offers and combinations just check out the <strong style=\"\">r-tutorials webpage</strong> which you can find below the instructor profile.  </p>  <p>  \t  What R you waiting for?  </p>  <p>  \t  Martin  </p>", 
    "end_date": null, 
    "title": "Text Mining, Scraping and Sentiment Analysis with R", 
    "price": "25.00", 
    "instructors": "R-Tutorials Training", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421216_a304_2.jpg", 
    "course_url": "https://www.udemy.com/r-social-media-mining-scraping-with-twitter/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T17:59:46Z"
}