{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Understand the Now – Predict the Future!</strong></p>  <p><em>Time series analysis and forecasting</em> is one of the key fields in statistical programming. It allows you to </p>  <ul><li>see patterns in time series data</li><li>model this data</li><li>finally make forecasts based on those models</li></ul>      <p>Due to modern technology the amount of available data grows substantially from day to day. Successful companies know that. They also know that decisions based on data gained in the past, and modeled for the future, can make a huge difference. Proper understanding and training in <em>time series analysis and forecasting</em> will give you the power to understand and create those models. This can make you an invaluable asset for your company/institution and can<em> boost your career</em>!</p><ul><li>What will you learn in this course and how is it structured?</li></ul><p>You will learn about different ways in how you can <strong>handle date and time data</strong> in R. Things like time zones, leap years or different formats make calculations with dates and time especially tricky for the programmer. You will learn about POSIXt classes in R Base, the chron package and especially the lubridate package. </p>  <p>After that you will learn about <strong>statistical methods</strong> used for time series. You will hear about autocorrelation, stationarity and unit root tests. </p>  <p>Then you will see how different <strong>models</strong> work, how they are set up in R and how you can use them for <strong>forecasting</strong>. Of course all of this is accompanied with plenty <strong>of exercises</strong>.</p><ul><li>Where are those methods applied?</li></ul><p>In nearly any quantitatively working field you will see those methods applied. Especially econometrics and finance love time series analysis. For example stock data has a time component which makes this sort of data a prime target for forecasting techniques. But of course also in academia, medicine, business or marketing  techniques taught in this course are applied.</p>      <ul><li>Is it hard to understand and learn those methods?</li></ul><p>Unfortunately learning material on<em> Time Series Analysis Programming in R</em> is quite technical and needs tons of prior knowledge to be understood. </p>  <p>With this course it is the goal to make understanding modeling and forecasting as<strong> intuitive</strong> and <strong>simple</strong> as possible for you. </p>  <p>While you need some knowledge in statistics and statistical programming, the course is meant for people without a major in a quantitative field like math or statistics. Basically anybody dealing with time data on a regular basis can benefit from this course.</p>  <ul><li>How do I prepare best to benefit from this course?</li></ul>  <p>It depends on your prior knowledge. But as a rule of thumb you should know how to handle standard tasks in R (courses <em>R Basics</em> and <em>R Level 1</em>). </p>  <p>For special offers and combinations just check out the <strong>r-tutorials webpage</strong> which you can find below the instructor profile. </p>  <p>What R you waiting for? </p>  <p>Martin </p>", 
    "end_date": null, 
    "title": "Time Series Analysis and Forecasting in R ", 
    "price": "25.00", 
    "instructors": "R-Tutorials Training", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690058_0f21.jpg", 
    "course_url": "https://www.udemy.com/time-series-analysis-and-forecasting-in-r/", 
    "currency": "USD", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T03:04:11Z"
}