{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Update 6/8/16:  Students have told me repeatedly that PivotTable is something they find most useful in their work - check it out in this course!</p><p>Update 11/6/15:  NEW bonus material added!  Do you know flashfill?  You would not believe what it can do!</p>\n\n<p>Update 5/30/15: To download all Excel files, go to excelprof dot com, and follow direction there.<br></p>\n\n<p>Update 5/30/15: We have now more than 500 registered students! With 5-star rating!</p>\n\n<p>-----------------------</p>\n\n<p>Have you wondered how some of your colleagues are always able to get ahead with their data analysis?</p>\n\n<p>The answer is that they are proficient in the tools they use.</p>\n\n<p>The same is true with using Microsoft Excel.</p>\n\n<p>Today, always very business person uses Excel. And yet only a small set of them know how to use Excel truly effectively and efficiently.</p>\n\n<p>From my over ten years of teaching MBA students, I have gained a good understanding of what specific Excel skills companies of all lines of businesses are looking for in a successful employee (By the way, year over year, more and more employers say they want people with good Excel skills). The course gives you the top 10 Excel skills that will enable you to acquire some of those highly-sought-after skills.</p>\n\n<p>These top ten skills are:</p>\n\n<p>1. Use Ctrl (⌘) + Arrow key to quickly navigate in a data set</p>\n\n<p>2. Find and augment data quickly: VLOOKUP</p>\n\n<p>3. Find numbers quickly: INDEX and MATCH</p>\n\n<p>4. Select data that meet certain conditions: COUNTIF and SUMIF</p>\n\n<p>5. Multiply and sum up numbers with SUMPRODUCT</p>\n\n<p>6. Work with Texts:</p>\n\n<p>7. Find Top and Bottom Performers: LARGE and SMALL, PERCENTILE</p>\n\n<p>8. Slice and dice data with PIVOTABLE</p>\n\n<p>9. Absolute and relative reference with “$\"</p>\n\n<p>10. Perform What-if analysis with DATATABLE</p>\n\n<p>Once you have mastered your skills, you will see immediate results - higher productivity, better Excel spreadsheets, and more work done.  </p>\n\n<p>Sign up NOW!</p>", 
    "end_date": null, 
    "title": "Top 10 Excel Skills For Successful Business Professionals", 
    "price": 0, 
    "instructors": "Justin Ren", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/491246_8983_3.jpg", 
    "course_url": "https://www.udemy.com/excel-skills/", 
    "subject_name": [
        "Data & Analytics"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-01T15:36:01Z"
}