{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>Summary</strong></p><p>Python is a programming language that may be utilized for a wide variety of purposes, from simple user scripts to complex APIs and web servers. It has a simple, highly readable syntax which makes it a suitable language for those who want to know the best way to write applications.</p><p><strong>What you will learn</strong></p><p>We will begin the course by installing the Python 3 interpreter. We will look at how exactly to execute our Python source files, as well as how exactly to run the interpreter in the command line.</p><p>After that, we will learn about how to control some data types that are basic. We will learn about how use Python to do simple arithmetic.</p><p>This course is the lite version of our main course \"A Gentle Introduction to Python Programming\"</p><p><strong>Prerequisites</strong></p><p><strong>Utilizing the command line:</strong> To be able to run our coding examples, we will need to utilize the command line. For the purposes of the class, students just need to figure out how to alter directories in the command line. Everything might be learned by seeing the videos.</p><p><strong>Python 3: </strong>This courses uses Python 3, which has some important differences from Python 2. The first video of the course will demonstrate how to run it in the command line, and the way to install Python 3.</p><p><strong>Notepad ( Recommended ) : </strong>Notepad is a free, open source text editor. is highly recommended due to features such as syntax highlighting and auto complete.</p>", 
    "end_date": null, 
    "title": "A Gentle Introduction to Python Programming - Lite", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736626_a20d.jpg", 
    "course_url": "https://www.udemy.com/a-gentle-introduction-to-python-programming-lite/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T10:14:53Z"
}