{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>JavaScript is a programming language that used to make web pages interactive. It runs on your visitor's computer and doesn't require constant downloads from your website. It is lightweight and most commonly used as a part of web pages, whose implementations allow client-side script to interact with the user and make dynamic webpages. JavaScript was first known as LiveScript, but Netscape changed its name to JavaScript, possibly because of the excitement being generated by Java. </p><p>JavaScript will help you to add behavior and interactivity to your pages. We'll begin with the basics: the core of JavaScript language and syntax, how to write it, where to put it, what tools you can use and how to used it. We'll then start to go step by step through the different things you do with JavaScript. We'll work with forms, work with events, Fuctions, variables, Arrays, Loops, and much more to get understand how to used javascripts to create intereactive web pages. also this course will cover some basic HTML5 training before to start with javascript. so if you don't have any knowlage about html5 knowlage but still want to learn javascript this course is for you.</p><p>And along the way, javascript is the letest trend and big companies are searching for the good developers in recent years. So whether you're brand-new to JavaScript or perhaps you've been working with it on and off for years, brush up your knowledge or learn something new with javascripts advance course.</p>", 
    "end_date": null, 
    "title": "Advanced Javascript Programing For Modern Web Developer", 
    "price": "20.00", 
    "instructors": "Somenath Sen", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655904_002a_3.jpg", 
    "course_url": "https://www.udemy.com/javascript-advanced-programing-for-modern-web-developer/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T22:12:18Z"
}