{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course contains everything you need to learn practical MATLAB skills, build sample projects, and land a high paying job with MATLAB skills. First you will see the potential job market for MATLAB and learn how I personally made $1.8M with MATLAB.  Next, you will get a crash course in the basic MATLAB skills so you master the fundamentals and code like a pro.  After that, I will teach you the practical skills that I’ve used to create professional MATLAB code, GUI’s, Apps, and toolboxes over the past 20 years.  Last but not least, you will get training on how to land a high paying job or get promoted.  You’ll get sample MATLAB interview questions and participate in Virtual Interviews to prepare you for any MATLAB interview.  If you’re happy working for your company, I’ll show you how to get raises and promotions using MATLAB.</p>\n\n<p><strong class=\"redactor-inline-converted\">4 Courses In 1</strong></p><p>This course is like getting 4 courses in 1:</p>\n\n<ul><li>MATLAB Fundamentals Crash Course - Brush up on the basics!</li><li>MATLAB Programming Techniques Crash Course - Write code like a pro!</li><li>Interviewing Skills with MATLAB - Interview with Confidence!</li><li>Getting Raises and Promotions with MATLAB - Increase your contribution and get rewarded financially!</li></ul>\n\n\n\n\n\n\n\n\n\n<p>In this course, you will get:</p>\n\n<ul><li>49+ Lectures and 7 hours HD Video Training</li><li>Source Code for 5+ Sample Apps including Video Player, Stock Market Trading, Image Filters, and Audio Processing</li><li>3 Virtual Interviews</li><li>Instructions to Get a 30-Day Free Trial of MATLAB</li><li>6 Ways to Get A Promotion</li><li>Script to Ask for A Raise</li><li>24/7 Access to Instructor and Students via Q&amp;A forum</li><li>Lifetime Access</li><li>30 Day Money Back Guarantee</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>MATLAB Programmers in High Demand!</strong></p>\n\n<p>The market for MATLAB programmers is booming.  Learn to master MATLAB and create professional programs in this course.  Skills alone will not get you a high paying job, so we also teach you how to successfully interview and ask for raises and promotions.  Don’t wait any longer to cash in with your skills.  No matter, what level you are - complete beginner to advanced, you can capitalize on your knowledge and abilities to write MATLAB programs.  Enroll now and get started today!</p>", 
    "end_date": null, 
    "title": "Advance Your Career with MATLAB Programming", 
    "price": "20.00", 
    "instructors": "Joe Papa, Jerry Banfield", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482916_2700_2.jpg", 
    "course_url": "https://www.udemy.com/learnmatlab/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T06:25:42Z"
}