{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<h5 style=\"\">A Verifiable Certificate of Completion is presented to all students who undertake this course.<span id=\"pastemarkerend62983\" style=\"\"></span></h5>    <p style=\"\"><strong style=\"\">Course Duration: 6.5 Hours - 80 Lessons</strong></p>    <p style=\"\"><strong style=\"\">About This Course</strong><br style=\"\">   In this Advanced C++ training course, expert trainer, author and developer Professor McMillan teaches you advanced tools and techniques for developing programs with C++. This tutorial continues where Professor McMillan left off with the Beginners Learning C++ training course from Infinite Skills.</p>    <p style=\"\">You jump right in to the training with a review of Inheritance. You will learn advanced topics in this training course such as Polymorphism, creating templates, working with exception handling, stream input/output management, associative containers, algorithms, stacks, queues and binary trees, different search and sort methods, namespaces and working with advanced string class methods.</p>    <p style=\"\">By the completion of this advanced training course for C++, you will have an in-depth understanding of how to apply advanced programming techniques to achieve your software development needs. Working files are included to allow you to learn using the same files that the author using in this video training course for C++</p>    <p style=\"\"><strong style=\"\">About Infinte Skills</strong><br style=\"\">   InfiniteSkills is an innovator in the field of technology computer software training. The firm&#039;s progressive approach teaches complex topics by focusing on task-oriented training.This allows users to intuitively grasp a wide range of skills they can seamlessly integrate into their daily workflow. This Advanced C++ course is just one course from the huge <a href=\"http://www.infiniteskills.com\" class=\"external-link\" rel=\"nofollow noreferrer\" target=\"_blank\" style=\"\">selection of training videos</a> offered by Infinite Skills</p>", 
    "end_date": null, 
    "title": "Advanced C++ Programming Training Course", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22750_d8c2_9.jpg", 
    "course_url": "https://www.udemy.com/advanced-c-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-13T10:44:59Z"
}