{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Swift 2 is the latest iteration of Apple's native programming language for iOS devices. If you're an aspiring iOS application developer who is looking to build apps for the App Store, you'll need to use Swift. The language boasts a vast wealth of SDKs and APIs to create applications that span from mobile to games, home automation, and its own wearable products such as the Apple Watch, meaning the sky is the limit for imaginative app developers.</p><p>Application Development with Swift 2 will show you how to turn your application ideas into reality. This course teaches you how to start developing applications for iOS by building a real iOS application with Swift 2.</p><p>We will begin by setting up with Xcode 7 before quickly jumping into building the user interface and making use of Storyboards. We'll look at many ways to enhance the user experience by implementing buttons, images, and text fields, and displaying data with Tableviews.</p><p>You will discover the power of protocols, delegation, and notifications to make your application professional and look at ways to persist user data. After that, you will see how we can stylize the application with colors, application icons, and a launch screen.</p><p>Application Development with Swift 2 will guide you through each step of the build process, giving you the tools and skills you need to create your own applications in the future.</p><p><strong>About The Author</strong></p><p><strong>Paul Napier </strong>is an iOS and Android developer working at one of the largest television networks in Australia. His development background covers over a decade working through a wide area of the development stack. Though his passion lies in all things mobile and in working to encourage great project structure, code cleanliness, and the development processes.<br></p><p>He holds a degree in Russian and Business Studies from the University of Leeds, and his background includes sales, iOS, tvOS and Android development, as well as business analysis and social network engineering. In his spare time, he likes to create novel ideas on both iOS and Android platforms and runs an education channel on YouTubecom/MadApper to help users pick up the basics of Swift programming.</p>", 
    "end_date": null, 
    "title": "Application Development with Swift 2 ", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/723724_845c_2.jpg", 
    "course_url": "https://www.udemy.com/application-development-with-swift-2/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T09:25:34Z"
}