{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t          &quot;<strong style=\"\">Data Science is the sexiest job of the 21st century - It has exciting work and incredible pay</strong>&quot;.  </p>  <p style=\"\">  \t            Learning Data Science though is not an easy task. The field traverses through Computer Science, Programming, Information Theory, Statistics and Artificial Intelligence. College/University courses in this field are expensive. <strong style=\"\">Becoming a Data Scientist through  self-study is challenging</strong> since it requires going through multiple books, websites, searches and exercises and you will still end up feeling &quot;not complete&quot; at the end of it. So how do you <strong style=\"\">acquire full-stack Data Science skills</strong> that will get you a and give you the <strong style=\"\">confidence </strong>to execute it?  </p>  <p style=\"\">  \t            Applied Data Science with R addresses the problem. This course provides<strong style=\"\"> extensive, end-to-end coverage</strong> of all activities performed in a Data Science project. If teaches  application of the <strong style=\"\">latest techniques</strong> in data acquisition, transformation and predictive analytics to solve real world business problems. The goal of this course is to teach <strong style=\"\">practice </strong>rather than theory. Rather than deep dive into formulae and derivations, it focuses on using existing libraries and tools to produce solutions. It also keeps things <strong style=\"\">simple and easy</strong> to understand.  </p>  <p style=\"\">  \t            Through this course, we strive to make you <strong style=\"\">fully equipped</strong> to become a developer who can execute full fledged Data Science projects. By taking this course, you will  </p>  <ul style=\"\">  \t<li style=\"\">Appreciate what Data Science really is </li>  \t<li style=\"\"> Understand the Data Science Life Cycle </li>  \t<li style=\"\"> Learn to use R for executing Data Science Projects </li>  \t<li style=\"\"> Master the application of Analytics and Machine Learning techniques </li>  \t<li style=\"\"> Gain insight into how Data Science works through end-to-end use cases.</li>  </ul>  <p style=\"\">  \t            By becoming a student of V2 Maestros, you will also get <strong style=\"\">maximum discounts</strong> on all of our other current and future courses (coupon codes inside the course material). You will also get prompt support of all your queries and questions. We continuously strive to improve our course material to reflect the latest trends and technologies  </p>", 
    "end_date": null, 
    "title": "Applied Data Science with R", 
    "price": "20.00", 
    "instructors": "V2 Maestros", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389190_eb01_4.jpg", 
    "course_url": "https://www.udemy.com/applied-data-science-with-r/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-09T05:18:05Z"
}