{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  Aprende fácilmente y en tiempo récord como crear código más consiso, claro y flexible utilizando las novedosas expresiones lambda que Java 8 te ofrece.  </p>  <p style=\"\">  \t<strong style=\"\">Construye una base sólida de conocimiento con las expresiones lambda y da tus primeros pasos en el paradigma de la programación funcional.</strong>  </p>  <p style=\"\">  \t      Java 8 pone al alcance de tus manos la combinación de dos sorprendentes paradigmas: la programación funcional y la programación orientada a objetos. Mediante esta combinación de paradigmas,  puedes crear definitivamente sorprendentes aplicaciones, con código más legible, fácil de entender y sobre todo reutilizable.  </p>  <p style=\"\">  \t      En este inigualable curso, en menos de dos horas aprenderás como las expresiones lambda te permitirán<strong style=\"\"> implementar de forma más sencilla uno de los temas más complicados de la programación orientada a objetos: el polimorfismo.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t        En términos generales, aprenderás rápidamente:  </p>  <ol style=\"\">  \t<li>Como instalar correctamente el entorno de programación.</li>  \t<li>Fundamentos de las expresiones lambda.</li>  \t<li>Fundamentos de las interfaces funcionales.</li>  \t<li>Pondrás en acción a las expresiones lambda junto con las interfaces funcionales.</li>  \t<li>Que son las referencias a un método y como implementarlas correctamente en el contexto de las interfaces funcionales.</li>  \t<li>A qué tipo de variables tienen acceso las expresiones lambda y sus restricciones.</li>  \t<li>Aprenderás a crear tus propias interfaces funcionales hechas a la medida.</li>  </ol>", 
    "end_date": null, 
    "title": "Aprende expresiones lambda con Java 8 fácilmente.", 
    "price": "20.00", 
    "instructors": "Jorge Luis  Ramirez Ortiz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389960_dd86_3.jpg", 
    "course_url": "https://www.udemy.com/aprende-expresiones-lambda-con-java-8-facilmente/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T00:35:48Z"
}