{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>Pessoal, mais de 100 videoaulas nesse ótimo curso de ASP NET com C#. Aprenda a criar uma aplicação para web completa, contendo: login, menus, cadastros, consultas..).</strong></p><p>Tudo começa pela Database Diagrams, onde você aprende a inserir as tabelas, campos, chaves estrangeiras e chaves primárias.</p><p>Todo sistema que se preze inicia com uma tela de Login, e você vai aprender a criar e manipular uma tela de Login para autenticação dos usuários no sistema. Também verá como cadastrar os usários e até mesmo a recuperação de senha.</p><p>Na tela principal, você verá como é fácil criar menus através de Navigation, Menu, com árvores TreeView.</p><p>Nos cadastros, aprenderá também a ligar 2 tabelas (chave estrangeira) usando DropDpwnListBox.</p><p>Em consultas verá como filtrar dados (pesquisar) tanto via digitação quanto por seleção.</p><p>Você verá como usar o DATALIST para mostrar os dados vindo do banco de dados e manualmente.</p><p>Aprenda GridView e DetailsView para mostrar os dados do banco.</p><p>Ensinei a gerar relatórios com o Crystal Report, extremamente fácil</p><p><strong>Validação de campos</strong></p><ul><li>CompareValidator</li><li>Regularexpression</li><li>RangeValidator</li><li>RequiredField Validator</li><li>ValidationSummary</li><li>GroupValidation</li><li>Validate</li><li>isValid</li></ul><p>Também veja como usar o Wizard para ajudar ana criação das suas aplicações de forma mais rápida.</p><p><strong>Banco de dados:</strong></p><p>Foi usado o SQLServer</p>", 
    "end_date": null, 
    "title": "ASP NET COM c# em mais de 100 videoaulas", 
    "price": "30.00", 
    "instructors": "Neri Neitzke", 
    "commitment": "21 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/227868_b092.jpg", 
    "course_url": "https://www.udemy.com/asp-net-com-c-em-mais-de-100-videoaulas/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-23T22:39:02Z"
}