{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  This course is all about how to interact with the client, understand the requirements, break requirements into objects, create database design by identifying the relationships among objects, architect  the project, implement business objects, data access layer, business logic layer and presentation layer.  </p>  <p>  \t                            You will also learn how to secure, compile and publish any web application.  </p>  <p>  \t<strong style=\"\">This is what students say about this course...</strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\">VERY HELPFUL COURSE!!! [Uzoma Umekwe Charles II]</strong></em>  </p>  <p>  \t<em style=\"\">I was a bit skeptic at first when I saw this course because i was not sure what to expect especially with so many half baked tutorials flying all around online. However, I am very glad I paid for this course because I have learnt a lot from Manzoor. Also I like his style of teaching. I would recommend this for anyone just starting off learning n-tier architecture.</em>  </p>  <p>  \t<em style=\"\"><br style=\"\">  \t</em>  </p>  <p>  \t<em style=\"\"><br style=\"\">  \t</em>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Precise Professional Provides What Promised...okay alot of P&#039;s [Tarun]</em></strong>  </p>  <p>  \t<em style=\"\">I think that there is two ways of learning ASP.net, one is you go to this-institute-that-institute wandering for attaining good knowledge of the technology then you start to learn and trainers give you something new everyday but sooner or later you get to realize that what to do with this huge pile of knowledge I mean you find yourself webbed because you don&#039;t know how the whole thing is integrated as one. I personally call it &quot;Recursive way of learning&quot;(debatable).</em>  </p>  <p>  \t<em style=\"\">But the other way of learning could be as- just have an internet connection with optimum speed</em>  </p>  <p>  \t<em style=\"\">learn the basics there then join this course designed and taught by Manzoor Sir, as soon as u start your journey with this course</em>  </p>  <p>  \t<em style=\"\">, with each and every lecture you will find that your IT-life isn&#039;t measurable anymore. and in the last lecture when you start to think, Oh! Is this course going to end so soon, then Manzoor Sir surprises you once again..by saying that he is not done yet..WOW!......</em>  </p>  <p>  \t<em style=\"\">The way Manzoor Sir give you point to point(see two more P&#039;s, I started to think that I&#039;m obsessed with the alphabet &#039;P&#039; today)</em>  </p>  <p>  \t<em style=\"\">knowledge without any fancy words is the best possible way to convey the knowledge in my eyes.</em>  </p>  <p>  \t<em style=\"\">Now I think I made my point clear to those who are actually want to learn the 3-tier Architecture and for those who didn&#039;t get the point only Almighty can save you.</em>  </p>  <p>  \t<em style=\"\">I want to thank and congratulate the Udemy development team for providing such a user-friendly environment (I mean one</em>  </p>  <p>  \t<em style=\"\">can Gift a course to his/her friends, I haven&#039;t saw such feature even on the leading online shopping systems available over web).</em>  </p>  <p>  \t<em style=\"\">Great...I wish when I could be able to develop something like this..thanks for inspiring..</em>  </p>  <p>  \t<em style=\"\">Lastly, Millions of Thanks to Manzoor Sir for letting me to learn this life changing course...waiting for what to come...</em>  </p>  <p>  \t<em style=\"\">Thanks.</em>  </p>  <p>  \t<em style=\"\"><br style=\"\">  \t</em>  </p>  <p>  \t<em style=\"\"><br style=\"\">  \t</em>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Awesom [Bijle Tarannum]</em></strong>  </p>  <p>  \t<em style=\"\">I would like thanks for the g8 opportunity I got to learn from Udemy and Mohd Manzoor Ahmed !!!!!!</em>  </p>  <p>  \t<em style=\"\">the three tier course by Mohd Manzoor Ahmed i had taken was awesm and was helpful........</em>  </p>  <p>  \t<em style=\"\">i had read the conecpts frm othr sources too bt this was too good and cleard all my concepts regarding the layers and specially database</em>  </p>  <p>  \t<em style=\"\">very wel done!!!!!!!!!!!!!!!!!!!!!!!!</em>  </p>  <p>  \t<em style=\"\">I m very keen to learn other courses with Mohd Manzoor Ahmed</em>  </p>  <p>  \t<em style=\"\">Pls come with the MVC asap!!!!!!!!!</em>  </p>", 
    "end_date": null, 
    "title": "Asp.Net Web App On 3-Tier Architecture", 
    "price": "50.00", 
    "instructors": "Microsoft Certified Trainer Mohammed Manzoor Ahmed", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/102132_62b7_8.jpg", 
    "course_url": "https://www.udemy.com/aspnet-web-app-on-3-tier-architecture/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-06T10:58:29Z"
}