{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<h4><strong style=\"\">Learn Assembly Language</strong></h4>  </p>  <p>  \t                              The x86 Adventures series teaches you your  computer&#039;s  language - x86 Assembly language, from scratch. <strong style=\"\">No prior  knowledge is  assumed</strong>.  </p>  <p>  \t<strong style=\"\">[Complete Course]</strong>  </p>  <p>  \t          This is the full collection of x86 Assembly Adventures. It covers everything from the real basics to being an independent (and tough) x86 Assembly programmer.  </p>  <p>  \t          Main topics covered:  </p>  <ul style=\"\">  \t<li>The Binary System</li>  \t<li>The x86 Architecture</li>  \t<li>Intro to Flat Assembler</li>  \t<li>Branching</li>  \t<li>Signed and Bitwise Operations</li>  \t<li>Memory</li>  \t<li>Strings</li>  \t<li>Subroutines and the Stack</li>  \t<li>Reading the Manuals</li>  \t<li>Debugging</li>  \t<li>Dealing with Windows API</li>  </ul>  <p>  \t<strong style=\"\">Why learn x86 Assembly Language?  </strong>  </p>  <ul style=\"\">  \t<li>You are the kind of person who really likes to know how things work.    In this course you are going to get solid understanding on how   computer  programs work from the inside.</li>  \t<li>Become a better programmer - Knowing how things work down there will    help you take better decisions, even as a high level programmer. If   you  were always wondering what is the stack, or what are those pointers    everyone talks about, you came to the right place.</li>  \t<li>Write faster code - When you really want to get the most of your    processor, writing in raw Assembly is needed. We are not going to talk    about optimizations in this course, however you will get a solid    foundations so that you can continue exploring on your own.</li>  \t<li>You want to become a reverse engineer or a security researcher, read    the code of viruses or look for software vulnerabilities. As most of    the time the original source code will not be available to you, solid    understanding of x86 Assembly Language is mandatory.</li>  </ul>  <p>  \t<strong style=\"\">Course structure</strong>  </p>  <p>  \t              The course is made of video lectures. A lecture could be  from a  presentation, or a real world example, showing me doing stuff at  the  computer.  </p>  <p>  \t              Almost every video lecture is accompanied by some kind of   exercise (You will be told during the lecture, don&#039;t worry :) ) The   exercises are open source. They are attached here as a rar file, however   you could also get them on github. (See &quot;About this course&quot; video for   more information).  </p>  <p>  \t              It is crucial that you complete the exercises. You will  learn a  lot from the lectures, but it is pretty much a waste of your  time and  money if you don&#039;t do the exercises. (Or at least verify that  you know  how to do them, if you are more experienced).  </p>  <p>  \t<strong style=\"\">Course tech stack</strong>  </p>  <p>  \t                  No prior knowledge is assumed for this course, but I do  assume some things regarding your system, so make sure that everything  here describes you:  </p>  <ul style=\"\">  \t<li>You are using a Windows operation system. (The course videos use Windows 7). It is recommended to use at least Windows XP.</li>  \t<li>You have an intel x86 processor. (If you don&#039;t know what you have then you have x86 processor, trust me).</li>  </ul>  <p>  \t                  For the tech savvy, some more details about the tools we are going to use in this course:  </p>  <ul style=\"\">  \t<li>Assembly flavour: x86 32 bits protected mode.</li>  \t<li>Assembler: The Flat Assembler (FASM)</li>  \t<li>Debugger: WinDbg.</li>  </ul>  <p>  \t                Using <strong style=\"\">Linux</strong>? Most of the exercises were ported to linux, however the videos show me using windows 7. Contact me if you are not sure.  </p>", 
    "end_date": null, 
    "title": "Assembly Language Adventures: Complete Course", 
    "price": "30.00", 
    "instructors": "xor pd", 
    "commitment": "29 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/202182_21eb_5.jpg", 
    "course_url": "https://www.udemy.com/x86-asm-foundations/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-20T18:08:30Z"
}