{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Python programming is one of the most demanded skill sets in today&#039;s job market, and for good reason. Python allows you to do just about anything you can think of; web development, data analytics, game development - even controlling robots!</p><p style=\"\">This Python Programming Professional Bundle is designed to get you up to speed with all the major Python skills you need right now. Learn on your own time and at your own pace, just be sure to learn this stuff.</p><p style=\"\"><strong style=\"\">What Can You Learn?</strong></p><p style=\"\"><strong style=\"\">Python Programming for Beginners: </strong>If your knowledge of Python and programming is limited – or even non-existent – then this course is the perfect starting point for you. You&#039;ll be guided through the installation process and the various features and functions of Python, and then you&#039;ll put your knew found knowledge to practical use by solving &#039;real life&#039; programming problems. Ideal for both programming beginners or experienced programmers new to Python. </p><p style=\"\"><strong style=\"\">Python Web Programming: </strong>Python is one of the most concise and easily understood programming languages out there, and one of its most popular applications is the web. This is the definitive python web programming course, designed for programmers, web developers, app creators, and anyone who wants to become &#039;code literate&#039;. Not only will you acquire an in-depth understanding of the programming language and its application for the web, you&#039;ll get hands-on experience building programs too.</p><p style=\"\"><strong style=\"\">Python Game Development: Create a Flappy Bird Clone: </strong>As well as web development, data visualisation and analysis, and a host of other applications, Python is a programming language perfectly suited to game development. With this course, you&#039;ll learn the easy way. Rather than working through hours of lectures and exercises, you&#039;ll literally create a game as you go. Who said picking up new skills can&#039;t be fun? </p><p style=\"\"><strong style=\"\">Data Visualisation with Python and Matplotlib: </strong>Companies are finally waking up to the benefits that big data and data analysis can have for their business. However, the majority of them lack the know-how to turn this data into something easily understood, readable, and presentable. That&#039;s where data visualisation comes in. Using Python in conjunction with Matplotlib, you can create just about any 2D or 3D graphs, bar charts, scatter plots, and more. <strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Data Analysis with Python and Pandas: </strong>Data analysis is one of the most sought-after skills from the biggest companies in the world, and guesses what? Python can be used to do it. Working with Pandas, you&#039;ll learn how to import and export data in a wide variety of forms, and organise and manipulate it into whatever way you need. Combined with our Data Visualisation with Python course below, it&#039;s all your need to become a genuine data guru. </p><p style=\"\"><strong style=\"\">Learn Python Django from Scratch: </strong>If you already have some experience with Python, web development or both, then this is the perfect course to take your expertise to the next level. Working in conjunction with Django you&#039;ll create a website from scratch featuring map integration, e-commerce functionality and a host of other complex features. Master this skillset, and you&#039;ll be all set to take the web by storm with database-driven yet simple and beautiful sites.</p><p style=\"\"><strong style=\"\">Go Where the Money is</strong></p><p style=\"\">Companies such as Google, Yahoo!, Disney, Nokia, and IBM all use Python. In fact, among programming languages, Python had the largest year-on-year job demand growth — at 19% — as of March 2013. This growth has been increasing ever since. Notably, the overall hiring demand for IT professionals dipped year over year by 5% as of January 2014, except for Python programmers which increased by 8.7%. In New York, Python developers ranked #8 of the most in-demand tech workers, making an average of $106k/year. On the other side of the Atlantic, Python programmers also enjoy a strongly rising demand for their skills as shown by the following graph.</p>", 
    "end_date": null, 
    "title": "Become a Professional Python Programmer", 
    "price": "50.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "34.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581908_5656_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-professional-python-programmer/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T06:38:53Z"
}