{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>If you’re looking at this page, you’ve probably had ‘learn how to code’ at the top of your to-do list forever. Coding is the future, and the technology industry is crying out for good programmers fluent in a range of languages. With that in mind, we’ve created this bundle for people just like you. Whether you’re a complete newcomer to programming or you already have some experience but want to expand your knowledge, this bundle will set you up for a career as a professional programmer/.</p>  <p>With access for life, you can learn at your own pace and complete lessons according to your own schedule. Whether you take your time or power through at breakneck speed, you can rest assured you’re learning everything you need to know. <strong></strong></p>  <p><strong>This bundle includes the following courses:</strong></p>  <ul><li><strong>HMTL5 and CSS3 Fundamentals:</strong> HTML5 is the latest version of the code that makes the web tick, and CSS3 is the next level of web design to go with it. Put them together and you have a recipe for future-proofed, flawless and perfectly functioning websites. This course will teach you both by diving right in at the practical end, and have your creating beautiful websites in no time.</li><li><strong>Python Programming for Beginners:</strong>  Python is one of the most in-demand skills that top employers like Microsoft, Google and many more look for; and that’s a trend that only set to continue for the next few years at least. Python is a simple, versatile and highly readable code used for everything from building websites to controlling robots! Whether you’re new to Python or new to programming in general, this course will get you up to speed.</li><li><strong>Swift Programming for Beginners:</strong> Swift is one of the hottest new languages out there right now, and essential if you want to become a fully fledged iOS app developer. If you’re looking for a crash course to get a handle on Apple’s primary coding language, look no further. This course will turn you into an expert Swift engineer, building your knowledge from scratch with plenty of practical exercises. </li><li><strong>Google Go Programming:</strong> It should come as no surprise that Google has its own programming language. And since Google is one of the biggest names in the technology world, it should come as no surprise that learning Go is a sure-fire way to boost your employment credentials, both with this computing behemoth and just about everyone else too. This course will tell you everything you need to know. </li><li><strong>Fundamentals for Java Programming: </strong> Every professional  programmer worth their salt knows Java inside and out. It’s the most common programming language in the world, and it sets the tone for all other code. In short, you won’t get anywhere without it, so it’s worthwhile learning how to do it right; and that’s exactly what this course does – from the ground up. </li><li><strong>Perl Programming for Beginners:</strong> It’s easy to get a little lost in the sea of programming languages out there. Luckily, Perl is a great starting off point because it’s simple to use, easy to learn, and very versatile. If you don’t know where to take the first step to becoming a professional programmer, there are worse places to start. This course will help you grasp the fundamentals and get started in the programming world. </li><li><strong>C++ Programming Fundamentals:</strong> C++ is the Grandfather of many of the tech world’s programming languages – Java being just one. Learning C++ gives you a head start on learning any other language, and a leg up as far as your employability is concerned. By taking this course, you’ll lay down a solid coding foundation and gain an excellent platform for improving your skills. </li><li><strong>Python Web Programming:</strong> After you’ve completed our Python Programming for Beginners course,  Python Web Programming will give you an extra edge and a new set of skills with a language that’s not only easy to learn, but a real money maker too. You’ll learn the art and the science behind web programming, graduating with all the tools necessary to build vibrant and sustainable web based programs.</li><li><strong>Ruby On Rails:</strong> Ruby on Rails can sound intimidating for anyone who doesn’t know it, but in reality it’s not only extremely useful, but completely logical too. This course will take from zero to Rails developer, showing you how to create fully interactive Rails applications from the very beginning. You’ll learn how to connect databases, accept user input, and complete a comprehensive project so you’re ready to use RoR in the real world straight away. </li><li><strong>Fundamentals of JavaScript:</strong> JavaScript is fast becoming one of the most widely used programming languages in the world, thanks in part to its ever growing catalog of libraries that allow you to do just about anything you want. Before you get into learning the JS libraries you'll need to know the basics. This is where you should start. </li><li><strong>AngularJS: </strong>AngularJS is one of the above-mentioned JS libraries, and is one of the reasons for JavaScript's sudden rise to popularity. Learn Angular programming here by first learning the basics, then moving on to Angular projects that you'll be proud to add to your portfolio. </li></ul>", 
    "end_date": null, 
    "title": "Become a Professional Programmer", 
    "price": "40.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "53.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679682_7563_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-programmer/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T17:52:59Z"
}