{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>\"Apache Spark is the hottest Big Data technology today. Its adoption is growing fast and so is the demand for professionals trained in it\"</strong>.</p><p>Apache Spark is the most active Apache project, and it is pushing back Map Reduce. It is fast, general purpose and supports multiple programming languages, data sources and management systems. More and more organizations are adapting Apache Spark to build big data solutions through batch, interactive and stream processing paradigms. The <strong>demand for trained professionals in Spark is going through the roof</strong>. Being a new technology, there aren't enough training sources to provide easy guidance on building end-to-end solutions.</p><p>Big Data Analytics with Apache Spark and Scala addresses the problem. It explains the concepts and capabilities of Spark in a simple and easy way. It then looks at various stages of analytics and how Spark can be used to build end-to-end solutions that run on parallel clusters. It also shows how Spark can be used for real time Data Science projects. It uses a windows based installation for sample code and exercises, so its easy to set-up and execute Spark than relying on Linux VMs.</p><p>Through this course, we strive to make you fully equipped to become a developer who can execute full fledged Analytics projects with Spark. By taking this course, you will</p><ul><li>Understand the concepts and capabilities of distributed computing in Spark.</li><li>Learn about Data Engineering with Spark</li><li>Use new capabilities like Spark SQL and Streaming</li><li>Master the application of Analytics and Machine Learning techniques</li><li>Build real time Data Science applications</li><li>Do all exercises on your windows laptop/desktop without the need for VMs</li></ul><p>V2 Maestros has been delivering<strong> outstanding courses in Data Science and Analytics</strong>. Please checkout our other courses and their reviews !!<br></p><p>Please note: This course focuses on doing Analytics with Spark. The coverage on Spark Cluster setup/Administration is minimal. Also, it dwelves only on basic interactive programming with Scala</p>", 
    "end_date": null, 
    "title": "Big Data Analytics with Apache Spark and Scala", 
    "price": "20.00", 
    "instructors": "V2 Maestros", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/782318_7068_2.jpg", 
    "course_url": "https://www.udemy.com/big-data-analytics-with-apache-spark-and-scala/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-04T17:52:47Z"
}