{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong></p><p><strong></strong><strong>BEST COURSE CHOICE for beginners and intermediate C# developers who want to take their skills to the next level and learn all Fundamental Software Design Patterns from the \"Gang of Four\".</strong></p><p>So how’s your IT career going? Are you a software developer? Or maybe the team lead?</p><p>Well, how does <strong>Senior Application Architect</strong> sound? This job means you get to design the application architectures, and the dev team gets to implement all of your designs. A pretty sweet deal (plus there’s usually a nice paycheque).</p><p>But if you want to become a software architect you simply have to know all fundamental design patterns by heart, <strong>there's no excuse</strong>. Detailed knowledge of all of these fundamental patterns will greatly benefit your career.</p><p><strong>Are you ready to give your IT career a huge boost?</strong></p><p>In 1994 the \"Gang of Four\" published a book titled <em>\"Design Patterns: Elements of Reusable Object-Oriented Software\".</em> This book contains 23 fundamental software design patterns. It is regarded as the <strong>standard reference manual</strong> for object-oriented design theory and practice. </p><p>In this course I will teach you the first 12 design patterns. These are all 5 creational- and all 7 structural design patterns. You use these patterns to create new objects efficiently and to create structure in your application architecture.</p><p>By the end of the course you will be <strong>fluent</strong> in all 12 design patterns. With this knowledge you will be well on your way to become a Senior Application Architect.</p><p><strong>Why should you take this course?</strong><br></p><p>You should take this course if you are a beginner or intermediate C# developer and want to take your career to the next level. Some of the patterns (e.g. 'Bridge') might sound very complicated, but all of my lectures are very easy to follow, and I explain all topics with clear code and many instructive diagrams. You'll have no trouble following along.</p><p>Or maybe you're working on the application architecture of a large project, and you need to create a robust design that is instantly clear to your team members? The patterns in this course will help you immensely.</p><p>Or maybe you're preparing for a C# related job interview? This course will give you an excellent foundation to answer any software architecture questions they might throw at you.</p><p><strong>30 day money-back guarantee</strong></p><p><em>This course comes with an unconditional, Udemy backed, 30-day money-back guarantee. If you are dissatisfied with the course for any reason, simply request a refund and get your full purchase amount back, no questions asked.</em></p><p><strong>Act now</strong></p><p>This course today contains over 4 hours of video content. Enrol now to benefit from the current price and get free lifelong access to all future materials.</p><p><strong>Enrol now!</strong></p>", 
    "end_date": null, 
    "title": "Boost Your C# With Structural And Creational Design Patterns", 
    "price": "40.00", 
    "instructors": "Mark Farragher", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587146_9ce1_3.jpg", 
    "course_url": "https://www.udemy.com/boost-your-csharp-code-with-structural-and-creational-design-patterns/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T07:55:07Z"
}