{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"></strong></p>\n\n<p>Bootstrap 4.0 is a popular framework that is written and compiled using HTML, CSS and JavaScript. If you decide to design and create a modern and responsive website then Bootstrap 4.0 is the best option available. Therefore, in this course I will guide you step by step by means of hands-on-tutorials on how to create a fully responsive modern website using Bootstrap 4.0, HTML and CSS.\n\n  </p>\n\n\n\n<p>I have designed this course for students that have a basic understanding of HTML and CSS but if you are a complete beginner and have no such knowledge you can still be a part of this course, follow instructions, and learn many new things.</p>\n\n<p>New Features that Bootstrap 4.0 alpha release provides us with and that you will be learning in this course are as follows:</p>\n\n\n\n<ul><li><strong>Bootstrap Jumbotron</strong></li><li><strong>Customizing Bootstrap</strong></li><li><strong>Bootstrap Cards</strong></li><li><strong>Rem and EM</strong></li><li><strong>Much More!</strong></li></ul>\n\n\n\n<p>You will be learning how create a clean, modern professional looking bootstrap landing page. Moreover, you will learn-by-doing and hands-on-tutorials which will help you understand all aspects of bootstrap and give you the tools to re-design our template or build an entirely new landing page specifically how you want it. You will be able to download project files of the course, which will be yours to keep and work on at your leisure<br></p>\n\n\n\n<p>-------------------------------------------------------------------------------------------------------------------</p>\n\n\n\n<p>This course covers all the components you will need to create your own bootstrap websites.</p>\n\n\n\n<p><strong>One framework, every device.</strong></p>\n\n\n\n<p>In addition to the <strong class=\"redactor-inline-converted\">Udemy</strong> <strong class=\"redactor-inline-converted\">30-day money back guarantee</strong>, you have my personal guarantee that you will love what you learn in this course. <strong class=\"redactor-inline-converted\">Click the \"take this course\" button at the top right now!</strong><br></p>", 
    "end_date": null, 
    "title": "Bootstrap 4.0 In Action: Build A Responsive Website", 
    "price": "20.00", 
    "instructors": "Syed Ali, Syed Raza", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858840_a91b_3.jpg", 
    "course_url": "https://www.udemy.com/bootstrap4-in-action/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T17:44:33Z"
}