{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"></p><p style=\"\">Make&nbsp;<strong style=\"\">programming&nbsp;</strong>your&nbsp;<em style=\"\">business</em>.  Even&nbsp;<em style=\"\">if you&rsquo;ve never programmed before</em>, this  course will explain to you the Business of Software, how computer  programs work, how computer programmers think, how to start a  computer programming business. You won&rsquo;t have to do any hands-on  coding, but all the essential features of the modern programming world will be  explained simply and clearly.</p><p style=\"\">Need to manage a  tech project or recruit a programming team but you are baffled by the  terminology? This course explains everything you need to know to&nbsp;<em style=\"\">talk  to programmers on their own terms</em>.</p><p style=\"\">It will explain the  differences between compilers and interpreters, procedural languages and object  orientation, machine code and bytecode. If you are an entrepreneur, it will help  you focus on the technologies you need; if you are recruiting a team, it will  give you advice on finding the right people; if you already have some  programming experience, it will help you to discover new languages and new  programming platforms.</p><p style=\"\">The course is taught  by<strong style=\"\">Huw Collingbourne</strong>,  Director of Technology with SapphireSteel Software (makers of<em style=\"\">Amethyst</em>and<em style=\"\">Sapphire</em>programming environments for  the Ruby and ActionScript languages). Huw has been a programmer for over 30  years, he has written programming columns for numerous computer magazines such  as<em style=\"\">PC Plus, PC Pro</em>and<em style=\"\">Computer Shopper</em>. He  is author of &lsquo;<em style=\"\">The Book  Of Ruby</em>&rsquo; from NoStarch Press and &lsquo;<em style=\"\">The ActionScript Programming Bible</em>&rsquo; from Software  Press.</p><p style=\"\">                </p><p style=\"\">This course will  help you to break into business of software: on the Web, on mobile  devices. On desktop computers; on PCs, Macs and &lsquo;cross-platform&rsquo;. So join up  and get to know how to start a computer programming business&hellip;.</p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Break Into The Programming Business", 
    "price": "20.00", 
    "instructors": "Huw Collingbourne", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22062_18b2_5.jpg", 
    "course_url": "https://www.udemy.com/break-into-the-programming-business/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-31T16:59:53Z"
}