{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">As businesses collect increasing amounts of vital data, the need for effective, intuitive, and actionable interfaces increases every day. Tableau is part of a new class of business intelligence tools, which dramatically reduce the time and technical acumen required to derive insights from data and publish it in a consumable format. </p><p style=\"\">We&#039;ll begin by laying the groundwork for a successful dashboard and then move on to constructing five different dashboards of increasing complexity.</p><p style=\"\">Starting with the Strategic/Executive dashboard, we&#039;ll design a few of the most common dashboard elements and assemble our first complete dashboard. Next, we&#039;ll show you how to use Tactical dashboards for visualizations that can help depict progress and draw attention to important areas. We&#039;ll then dive into increasing the dashboard interactivity by using Operational dashboards when focusing on granular detail. Using advanced techniques in Tableau, we&#039;ll then show you how to use Analytical dashboards that can provide you with the tools to effectively extract knowledge from your data. We&#039;ll also walk through how to quickly create a visualization using Ad-hoc dashboards that allow you to effectively keep an eye on a specific area of interest. Lastly, we&#039;ll cover the styling settings and publication options and conclude with best practices.</p><p style=\"\">This course guides you through the entire “how and why&quot; of each task in the dashboard creation process, which will translate easily to your own dashboard projects.</p><p style=\"\"> <strong style=\"\">About the Author</strong></p><p style=\"\"><strong style=\"\">Tony Kau</strong> is a Tableau Desktop 8 Qualified Associate, and he is putting its power to use in his role as a reporting analyst for a Fortune 500 company. His analytical background spans a decade, during which he has used a variety of business intelligence software, though none were better than Tableau. His passion is efficiently leveraging data to inform strategic business decisions.</p><p style=\"\">He holds a degree in Business Administration from the University of Oregon, and his background includes web design, programming, and financial analysis. </p>", 
    "end_date": null, 
    "title": "Building Interactive Dashboards with Tableau", 
    "price": "45.00", 
    "instructors": "Packt Publishing", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546510_28ac_2.jpg", 
    "course_url": "https://www.udemy.com/building-interactive-dashboards-with-tableau/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T09:23:59Z"
}