{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<ul><li>Prerequisites: Basic understanding of Java</li><li>Taught by a Stanford-educated, ex-Googler, husband-wife team</li><li>Please <strong>don't</strong> take this class if you have already signed up for our <em><strong>From 0 to 1: Learn Java Programming</strong></em> course (that includes a far longer and more in-depth version of this material)</li></ul><p><em><strong>This is a quick and handy course with exactly what you need to know (nothing more, nothing less!) about multithreading and concurrency in Java</strong></em></p><p>Let’s parse that.</p><ul><li>The course is <strong>quick and handy</strong>: It explains multithreading and concurrency in Java in just the right level of detail for you to put these to work today.</li><li>The course has <strong>exactly what you need</strong> - nothing more, nothing less. It starts from zero, builds up the design, then gives plenty of real-world examples, but crisply and quickly.</li><li>The course is also <strong>quirky</strong>. The examples are irreverent. Lots of little touches: repetition, zooming out so we remember the big picture, active learning with plenty of quizzes. There’s also a peppy soundtrack, and art - all shown by studies to improve cognition and recall.</li></ul><p><strong>What's covered:</strong></p><ul><li>Context: Why threading matters, and why it is getting more important as CPU architectures evolve and cloud-computing catches on</li><li>The basics: threads, processes, shared memory and inter-thread communcation</li><li>Old-school Java threading: Runnable and Thread objects and using them</li><li>New-age Java threading: Callable and Future objects, executors and other services</li><li>Semantics: the synchronized and volatile keywords</li><li>Case study: Double-checked locking and the singleton pattern</li></ul>", 
    "end_date": null, 
    "title": "Byte Size Chunks : Java Multithreading", 
    "price": "20.00", 
    "instructors": "Loony Corn", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669518_7c0d_2.jpg", 
    "course_url": "https://www.udemy.com/bsc-java-multithreading/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T10:43:35Z"
}