{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Why is this C Programming course THE BEST? Our numbers speak for itself:</strong></p><ol><li>The same C Programming course taught in classrooms over <strong>18 </strong>years and <strong>9000+</strong> engineering students in India (BANGALORE and all IT hub cities)</li><li>You will feel you are learning face-to-face from an expert and friendly mentor.</li><li>We are <em>HANDS-ON:</em> more than 60 actual programs solved step-by-step - nobody else teaches like us, guaranteed.</li></ol><p><em><strong>UPDATE 12th Jan, 2016: </strong></em></p><ol><li><em><strong>12 NEW Programming lessons added ~2 hours added to the course! You will keep getting additional value from this course. </strong></em></li><li>Fantastic free downloadable IDE added in a new Section</li><li>Downloadable ASCII Table added</li><li>900+ students joined in 40 days!!</li></ol><p><strong>Why you should learn C Programming language?</strong></p><ol><li><em>C programming is Present Everywhere</em> – on every computing platform imaginable - from supercomputers to mobile and handheld devices</li><li><em>Syntax and Semantics</em> - C programming syntax is the root for every serious language – including C++, C#, Java, PHP, JavaScript, Objective C, ASPdotnet etc</li><li>C programming language is the <em>most popular language</em> in the world today</li><li>C programming is the <em>Lingua Franca</em> – default language of Universities worldwide, Open source</li></ol><p><strong></strong><strong>What you will get from our C programming course:</strong></p><ul><li>110 video lessons - short and topic specific</li></ul><ul><li>60+ actual programs solved step-by-step, then in code and then again in the debugger - so you will see the program in runtime!!</li></ul><ul><li>10+ hours of instruction - you will feel you are learning from a gentle expert - who teaches from the very basics</li></ul><ul><li>A world class COMPLETE coding environment for you to download and use is included - we use the same in our lessons (Windows version is included, you can download other versions very easily)</li></ul><p><strong></strong><strong>Pre-requisites</strong>:</p><p>No specific requirements! We teach from the very early basics - you do not need to know any previous programming language. THIS is very your journey to programming knowledge begins :-) We even include a complete coding environment for Windows, that you can freely download and use from our course.</p><p><strong>Who is this course for?</strong></p><ol><li>Students with or without C programming in their curriculum</li><li>Newbies starting out in C programming</li><li>Self taught coders - who want to relearn C Programming in a systematic manner</li><li>Experienced coders of other web languages - who want to learn what the greatness of C programming is all about</li><li>Anyone who wants to lay a SOLID foundation in C Programming to their long and fruitful programming careers</li></ol>", 
    "end_date": null, 
    "title": "C Programming For Beginners Hands-On!", 
    "price": "25.00", 
    "instructors": "LearnGood Academy", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/451960_18b4_3.jpg", 
    "course_url": "https://www.udemy.com/c-programming-language-tutorial-from-baby-steps-to-hardcore-programmer/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T05:01:26Z"
}