{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Get started with <strong>C programming</strong> language with this short and sweet course covering all  the important aspects of the C development. This course does not presume any prior programming knowledge and is great for beginners. The course starts with general introduction to the development environment. We have used Linux as the primary OS for the course as it more suited to the C ecosystem. </p><p>You will learn concepts such as</p><p><strong>Methods and Functions</strong> - Get to know about C programming using functions both system defined and user defined ones.</p><p><strong>Pointers </strong>- Master the concepts behind pointers and learn their use in C programming</p><p><strong>Input/Output</strong> - Learn to take user input and display output for your programs</p><p><strong>Control Flow </strong>- Learn all about concepts such as iteration and conditional statements</p><p><strong>Data Structures</strong> - Get to know the important data structures required for C programming.  </p><p><strong>Dynamic Memory allocation</strong> - Memory handling is one of the exotic C attributes and you will get to learn all about in this course</p><p><strong>Socket programming</strong> - Learn to open ports and send and receive data through sockets</p><p>The course covers all this and much more and follows a program oriented approach for teaching software development. If you want to learn the C language start here and be the expert in just few hours..</p>", 
    "end_date": null, 
    "title": "C Programming for Beginners", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554232_b9dc.jpg", 
    "course_url": "https://www.udemy.com/basic-c-programming-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T10:37:21Z"
}