{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Mit diesem Videokurs bilden Sie eine <strong class=\"redactor-inline-converted\">starke Grundlage</strong>, die auf viele Programmiersprachen übertragbar ist, da sich die meisten Programmiersprachen aus C heraus entwickelt haben.</p>\n\n<p>Dieser <strong class=\"redactor-inline-converted\">Praxisorientierte Einsteigerkurs</strong> bildet das ideale Fundament für Ihre Programmieranfänge. Sie lernen in diesem Kurs nämlich sämtliche wichtige Inhalte kennen, die Sie zur Programm Entwicklung mit der Programmiersprache C benötigen. Die <strong class=\"redactor-inline-converted\">zahlreichen Übungsaufgaben</strong> sind perfekt auf das Kursmaterial abgestimmt und helfen Ihnen die <strong class=\"redactor-inline-converted\">gelernte Theorie direkt in die Praxis umzusetzen</strong>.</p>\n\n\n\n<p>Nach jedem Abschnitt steht Ihnen zusätzlich noch ein <strong class=\"redactor-inline-converted\">Quiz</strong> zur Verfügung, mit dem Sie den Lehrstoff nochmals wiederholen können.</p>\n\n\n\n<p>Damit Sie während des Kurses nicht mitschreiben müssen und sich voll und ganz auf die Inhalte konzentrieren können, habe ich Ihnen jeden Abschnitt bereits kompakt in Form eines PDF Dokuments zusammengefasst. Diese <strong>praktischen Übersichtsblätter</strong> können Sie also ohne zusätzlichen Aufwand direkt ausdrucken und haben somit gleich eine Hilfestellung bzw. einen kleinen Spicker für die Übungsaufgaben.</p>", 
    "end_date": null, 
    "title": "C Programmieren - Praxisorientierter Einsteiger Kurs", 
    "price": "20.00", 
    "instructors": "Hendrik Pruin", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/779036_0110_3.jpg", 
    "course_url": "https://www.udemy.com/c-programmieren-praxisorientierter-einsteiger-kurs/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-01T15:39:21Z"
}