{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">What is the course about?</strong>  </p>  <p>  \t    This brand new course provides a thorough introduction to the C programming language which is the core of the UNIX/Linux operating system and other embedded systems. This is designed with a need to understand the C programming language starting from scratch. This comprehensive course will give you enough understanding on C programming language from where you can take yourself to higher level of expertise.  </p>  <p>  \t    1. The First few lectures will cover syntax and grammar, and expose students to practical programming techniques.  </p>  <p>  \t    2. The remaining lectures will focus on more advanced concepts, such as dynamic memory allocation, pointers, arrays, etc.  </p>  <p>  \t    Programming assignments and laboratory exercises are required to do by students. Please remember that this is a serious course on programming. I believe that programming language like C cannot be learned in few hours. It required continuous practice. Students may have to put a lot of efforts in order to become expert in programming and make the best use of this course.  </p>  <p>  \t<strong style=\"\">What kind of material is included?</strong>  </p>  <p>  \t    1. This course consists of high quality training content using quality videos with industry oriented hands-on examples.  </p>  <p>  \t    2. I have tried to include the juice of my 10 years of Programming experience in this course.  </p>  <p>  \t    3. The focus is on giving real life essential tricks and skills.  </p>  <p>  \t    4. This course will have sets of online programming assignments and objective type quizzes.  </p>  <p>  \t    5. The problems in each lesson are easy and difficult. I suggest students to take this course with pen and paper handy. Note the important points and take part in discussions. The exercise is the most important part in learning any language. I advise students to take the problems after each section.  </p>  <p>  \t<strong style=\"\">How long will the course take to complete?</strong>  </p>  <p>  \t    1. This is the comprehensive course covering almost all the topics of C programming.  </p>  <p>  \t    2. The course is around 6 hours in duration. I advise students to cover not more than one lesson/section per day and do not move to the next lesson/section without doing the exercise.  </p>  <p>  \t<strong style=\"\">How is the course structured?</strong>  </p>  <p>  \t    1. Lectures, Classroom Discussions and C Programming Lab Exercises at the end of each chapter.  </p>  <p>  \t    2. A perfect blend of theory and programming.  </p>  <p>  \t<strong style=\"\">Why take this course?</strong>  </p>  <p>  \t    1. Learning C programming language is basic to learn all other programming languages such as C++, Java, Python, etc. Because, all other advanced programming languages were derived from C language concepts only.  </p>  <p>  \t    2. This is the comprehensive course covering almost all the topics of C programming.  </p>  <p>  \t    3. This course will tends to replace text books on C programming ie it will be a complete reference of C programming.  </p>  <p>  \t    4. You will learn how programming languages work with data, what program flow is, and how to use functions, methods and routines.  </p>  <p>  \t    5. You will also get step-by-step instructions on how to create simple and advance C programs and how to run them.  </p>  <p>  \t    6. For the college going students, this course helps in improving grades in college curriculum and increases the chances at the final Campus Interview.  </p>", 
    "end_date": null, 
    "title": "C Programming Language-Basic to Expert", 
    "price": "50.00", 
    "instructors": "Saurabh Kumar", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357246_d61e_3.jpg", 
    "course_url": "https://www.udemy.com/c-complete-reference/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T19:18:26Z"
}