{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Start your future, today.</strong></p><p><strong>Why choose this Course?</strong></p><p>This course has everything you need to build a foundation in C# and Object Oriented Programming. 96 lectures are designed to cover all the concepts of C#; with each lecture being in-depth and concise! This course is designed to cover all the import basics of C# that will inspire and you develop your programming skills. After taking this class you will be able to understand how C#, as well as, how Object Oriented Programming works which will prepare you for advanced topics and even other languages such as Java or C++!<strong></strong></p><p><strong>This class also includes:</strong></p><ol><li>High-Quality Lectures with 1080P Video and Audio!</li><li>Professional Instructor with College-Level Teaching Experience</li><li>For the Price.. This Course is the most complete and hands-on C# Udemy Courses</li><li>This course is taught on a personal level with interaction from the instructor; answering discussion and messages daily to make the student experience excellent.</li></ol><p>My name is Danny Boehm and I will be your Instructor!</p><p>I created this course in hopes that I could share knowledge and strategies for grasping programming languages. I experienced first-hand, the struggles many of you have, in learning how to code for the first time; however, I am here to tell you that coding can actually be entertaining and refreshing! </p><p>With my knowledge I can help you learn how to program easily and effectively! This course will eliminate the learning curve that comes with some of the more difficult concepts, and you will be programming in no time!</p><p><strong>So what exactly is special about C#?</strong></p>C# is a powerful object-oriented programming language. It is also one of the easier programming languages to begin learning because a lot of it's core principles are auto-implemented (which makes your life a lot easier!). C# is used in the development of video games that includes mobile development. In addition to video games, a lot of mobile applications that are sold on the Apple or Android market can also be coded in C#.Learning C# will prepare you for other object-oriented programming languages like Java, C, or even C++! With a strong background in C#, companies will be looking to hire you as entry level programmers to start, develop your own applications and reinvent yourself!<p><strong>In this course you will learn about...</strong><strong></strong></p><ul><li>Microsoft Visual Studio / Visual Studio Express</li><li>Data Types / Representation</li><li>Classes, Objects, Methods, Interfaces</li><li>Loops, Selections and Conditional Statements</li><li>Arrays</li><li>Inheritance, Exception Handling</li><li>Controls and Handling Events</li><li>And much more!</li></ul><p><strong>Who should take this course?:</strong></p><p><strong> </strong>This course is suitable for beginning programmers. This course provides 96 lectures with over 9 hours of video! You'll learn all of the C# fundamentals and establish a strong understanding of the concept behind object-oriented programming. Each chapter closes with a homework exercise, a class exercise and a lecture quiz, to ensure a challenging learning experience.</p><p>Students completing the course will have the knowledge to create functional and useful C# programs. In addition, students will be able to use other IDE's (Integrated Development Environment) such as: Eclipse, Unreal Engine, Unity and Android Development Kit to develop their own applications and games for market use on Android, Apple and Windows Marketplace!</p><p>Complete with code samples, you'll be able to work alongside the instructor as you work through each concept. This course can also be used effectively for understanding college- level C# or object-oriented programming. Students can utilize the course as a refresher or as a tutoring resource with great results!</p>", 
    "end_date": null, 
    "title": "C#: The Complete Foundation!", 
    "price": "20.00", 
    "instructors": "Danny Boehm", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540890_1af1_19.jpg", 
    "course_url": "https://www.udemy.com/c-sharp-fundementals/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T04:29:04Z"
}