{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Chances are you're familiar with the basics of C# and are hungry to learn more. Or you've been out of touch with C# for a while and are looking for a quick course as a refresher to get you up to speed with advanced C# constructs. If so, then this course is for you.<br>  </p><p><br></p><p>  \t                                              In C# Advanced Topics, <strong>the third part in Mosh's best-selling C# series</strong>, he walks you through the advanced features of C# that are frequently used in building real-world applications:</p>  <ul>  \t<li><strong><strong>Exception Handling</strong></strong></li>  \t<li><strong><strong>Generics</strong></strong></li>  \t<li><strong><strong>Delegates</strong></strong></li><li><strong><strong>Events</strong></strong></li>  \t<li><strong><strong>Lambda Expressions</strong></strong></li>  \t<li><strong><strong>Extensions Methods</strong></strong></li>  \t<li><strong><strong>LINQ</strong></strong></li>  \t<li><strong><strong>Nullable Types</strong></strong></li>  \t<li><strong><strong></strong><strong>Dynamics</strong></strong></li>  \t<li><strong><strong>Asynchronous Programming with Async / Await</strong></strong></li>  \t<li><strong><strong></strong>And more</strong></li>  </ul>  <p><strong><br></strong></p><p><strong>There are lots of free tutorials and videos on YouTube. Why should you take this course? </strong></p><p>  \t                                            This course has<strong> </strong>a<strong> clean structure with a perfect pace</strong> (not too fast to confuse you, and not too slow to bore you or waste your time). It gives you an<strong> in-depth understanding of advanced C# features, </strong>and is <strong>created by a C# expert and best-selling author </strong>with in-depth knowledge of the C# language and .NET Framework as well as 13 years of professional experience in the industry. So, from the very beginning to the very end, you'll be confident that you'll be in good hands. If you got questions along the way, Mosh is here to help you.</p><p><br></p><p><strong><strong>More than a two hundred five-star reviews can't be wrong!</strong> Here is a glimpse of what Mosh's students say:</strong><br></p><p>\"I’ve actually landed my first job as a Junior software developer. I owe a lot of it to you because your courses have been EXTREMELY helpful. May God bless you and your efforts to create high quality courses. This has really changed my life from working as a security guard and doing websites for free, now I am a professional.\" -Danish Jafri<br></p><p><br></p><p>\"Just finished this course today, it was absolutely brilliant! They way the course boils down huge topics, that would take hundreds of dry boring text books into short videos, while including not only theory but how professionals make the most of the concepts. The Man has serious passion about Development, his enthusiasm and experience really make these dense topics fun &amp; easy to learn!\" -Conor McGarth</p><p><br></p><p>\"This guy really knows what he is doing. I have been a developer for a while and he really knows how to break down what happens behind the scenes and how to create code that is extensible and reusable. I had peers telling me that paying for a course is not worth it but I went ahead and did it and I have learned so much from the videos. This course is definitely worth the price.\" -Justin Weinzimmer</p><p>\"Mosh is a great teacher, explains things clearly, his lessons have a nice logical order, the course is engaging, he never bores, he DOES answer every single question. Highly recommended!\" -Frantisek Nagy</p><p><br></p><p>\"Excellent! Another brilliant piece of instruction... I have grown to expect nothing less from Mosh!\" -Douglas Crowder</p><p><br></p><p>\"One of my favorite aspects of Mosh's teaching style is his effort to retain relevance to real-world situations. As an experienced C# developer myself, I can tell you pretty much every topic in this course is important to a .Net developer, and Mosh does a good job of separating what you should understand conceptually versus how you'll likely be using the concepts in practice.\" -M.B</p><p><br></p><p>\"The information that Mosh provides is extremely helpful. He does a great job of explaining things. Mosh has an interesting and fun style of presenting information. He covers the topics thoroughly and responds to questions in the discussions.\" -Jon Ownbey</p><p><strong><br></strong></p><p><strong>100% money-back guarantee</strong></p>  This course comes with a 30-day money back guarantee. If you're not happy, ask for a refund, all your money back, no questions asked.<strong> <p><br></p><p><span></span><br></p>   Who is your instructor?  </strong>  <p>Mosh (Moshfegh) Hamedani is a .NET developer with 12 years of professional experience designing and implementing applications and frameworks using C# and .NET.  \t  \t      Mosh's students describe him as a passionate teacher who knows how to lead a student through a logical series of baby steps along with a perfect balance of theory and practice. Read his reviews to see what others say about him and his courses.  \t  \t                                    Mosh is academically educated with a Master of Science in Network Systems and a Bachelor of Science in Software Engineering. He is also a Microsoft Certified Technology Specialist (MCTS), Application Developer (MCAD), and Professional (MCP).  </p><p><br></p>      <strong>Do you want to take your C# knowledge to the advanced level?</strong>  <p>  \t                  Then take this course and get started.   \t  \t  \t  \t  \t  </p>", 
    "end_date": null, 
    "title": "C# Advanced Topics: Take Your C# Skills to the Next Level", 
    "price": "20.00", 
    "instructors": "Mosh Hamedani", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356030_0209_4.jpg", 
    "course_url": "https://www.udemy.com/csharp-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T10:39:09Z"
}