{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Updated on September 1, 2015</strong>. Added two new anti-patterns: Avoid The Worst and The Crystal Ball.</p><p><strong><span></span>BEST COURSE CHOICE for beginners and intermediate C# developers who want to take their programming skills to the next level.</strong></p><p>Do you know that feeling?</p><p>A new developer has joined your team. You assign a short task to get started, and a couple of days later you do a quick code review to check if everything is ok. </p><p>As your eyes glance over the first few lines of code you spray your Cola all over your keyboard, and all you can think is:</p><p><em><strong>\"What is this I don't even?\"</strong></em></p><p>We've all been there. Code reviews sometimes expose truly terrible code - mangled object hierarchies, judicious use of Parse and ToString, and reinvented standard framework classes littered with bugs.</p><p>In fact the same bad code tends to crop up over and over, which is why we call them \"Anti-Patterns\".</p><p><strong>Anti-patterns are common responses to a recurring problem that are ineffective and highly counter-productive.</strong></p><p>In a series of short lectures I am going to show you the most common C# anti-patterns. I will introduce each anti-pattern, show you why the pattern is bad, and how you can refactor the code to resolve the problem. </p><p><strong>Why should you take this course?</strong></p><p>You should take this course if you are a beginner or intermediate C# developer and want to take your skills to the next level. A thorough understanding of all common anti-patterns will help you enormously in your understanding of C# and the .NET Framework.</p><p>Or you might be working in a developer team and about to perform your first code review. The examples in this course will help you spot bad code quickly, and give you an idea what senior developers like to see at when they review code.</p><p>Or maybe you're preparing for a C# related job interview? This course will give you an excellent foundation to answer any questions about code quality they might throw at you.</p><p><strong>30 day money-back guarantee</strong></p><p><em>This course comes with an unconditional, Udemy backed, 30-day money-back guarantee. If you are dissatisfied with the course for any reason, simply request a refund and get your full purchase amount back, no questions asked.</em></p><p><strong>Act now</strong></p><p>This course contains over 3 hours of video content and I am adding new material every month. Enrol now to benefit from the current price and get lifelong free access to all future materials.</p><p>As a course student you can contact me and ask me for help with any performance-related C# problem you might have. I am available on weekdays during office hours (Central European Time).</p><p><strong>Enrol now!</strong></p>", 
    "end_date": null, 
    "title": "C# Anti-Patterns: A List Of Programming Practices To Avoid", 
    "price": "40.00", 
    "instructors": "Mark Farragher", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554318_c181_2.jpg", 
    "course_url": "https://www.udemy.com/csharp-anti-patterns-and-bad-programming-practices/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T13:23:18Z"
}