{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>If you want to be a real pro C# coder, you need to master your keyboard and Visual Studio. You need to be able to navigate in your code base, find and modify code in seconds. Great coders hardly ever use the mouse. They do everything with the keyboard. They use shortcuts and some tricks to type less and generate more code in less time. And that is what this course is all about. <br></p><p><br></p>\n\n<p>  \t                      In this course, Mosh, author of six 5-star C# courses, shares with you lots of shortcuts and tricks that help you find, write and modify code in less time. </p>\n\n<p>  \t<br>  \t                                    In particular, you'll learn<br></p>\n\n<ul>  \t<li>How to <strong>quickly find files, classes and methods</strong>. Say goodbye to Solution Explorer and navigating between folders to find classes. <br></li><li>How to <strong>navigate in the code like a pro</strong>: no more clicking back and forth to navigate between members of classes. Jump from one method to another and come back to where you were. <br>  \t<br>  \t</li>  \t<li>How to <strong>compile, run and debug applications faster</strong> and more effectively.<br></li><li><strong>60+ shortcuts that will boost your productivity</strong> (<strong>both on Windows and Mac</strong>)<br></li><li>How to <strong>reduce your chance of getting RSI</strong> (repetitive strain injury)</li>  </ul>\n\n<p>  \t<br></p>\n\n<p><br></p><p>  \t<strong>Ideal Student</strong></p><p>This course is most suited to junior C# developers new to Visual Studio. But even if you've been programming in Visual Studio for a few years, you may still learn tips and tricks that you're not aware of. There is a whole section dedicated to ReSharper, which is one of the greatest plug-ins for Visual Studio. If you've never used ReSharper before, this course is a must for you.<br>  \t<br></p><p><br></p>\n\n<p><strong>Full Money-back Guarantee</strong><br>  </p>\n\n<p>  \t                This course comes with a <strong>30-day full money-back guarantee</strong>.<strong> No questions asked</strong>. If you don't learn anything from this course, ask for a refund within 30 days. All your money back. <br>  \t<br>  </p>\n\n<hr>\n\n<p>  \t<em>\"Every Visual Studio programmer in the world needs to take this short course. Seriously! Take it. Now! The value per money is simply immense.\" </em>Gino Costescu<br>  \t<br>  </p>\n\n<p>  \t<em>                                \"Excellent tips and tricks: </em><em>I've been using Visual Studio for years and even being a seasoned user, I found the tips and tricks offered in this course to be extremely helpful.\"</em> - Jake Janes<br>  \t<br>  </p>\n\n<p>  \t<em>          \"Thank you for your classes! There are awesome, ninja coding skills on the way!\"</em> - Fredy Guibert<br>  \t<br>  </p>\n\n<p>  \t<em>      \"Great course! It's neat and systematic and shows some usefull tricks for VS.\"</em> - Nikola Kratka<br>  \t<br>  </p>\n\n<p>  \t<em>\"I've been using VS for many years. So, I'm quite familiar with navigating VS with the keyboard, but I still learned some very cool tricks.</em><em>\" -</em> Jason E. Rice<br>  \t<br>  </p>\n\n<p>  \t<em>      \"Great course, great instructor: You did a great job. I'd take any other course you'd teach.\"</em> - Saif Ahsanullah<br>  \t<br>  </p>\n\n<p>  \t<em>      \"Very clear, helpful and to the point: The course is very helpful. I was looking for this kind of course because I'm a professional web developer with 3 year-exprience, with a very poor performance keyboard with Visual Studio, so your course is helping me a lot.\"</em> - Antonio Marques Taltavull<br>  \t<br>  </p>\n\n<p>  \t<em>\"Awesome! Great instructor, short and too the point, really helped my programming! Hardly took an hour of my time to learn the basic concepts. </em><em>Love it!\"</em> - Eshan Singh  </p>\n\n<hr>\n\n<p><strong><br></strong></p><p><strong>About Your Instructor</strong><br></p><p>Mosh (Moshfegh) Hamedani is a software engineer with 15 years of experience. He has been involved in the design and implementation of numerous projects of varying size and complexity, including web applications, mobile apps, desktop applications and frameworks.</p><p><br></p><hr>\n\n<p><strong>So, do you want to learn the time-saving techniques of pro C# developers? Take the course now and get started. <br></strong></p>", 
    "end_date": null, 
    "title": "C# Developers: Double Your Coding Speed with Visual Studio ", 
    "price": "20.00", 
    "instructors": "Mosh Hamedani", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/300316_4409_6.jpg", 
    "course_url": "https://www.udemy.com/visual-studio-tips-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-15T02:06:41Z"
}