{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In  this C# course we aim to help you understand C# by breaking down the core fundamentals and helping you learn to write code. We are interested in helping you master and understand the C# language.  This course starts you out by showing you important aspects of C# and then moves on to more advanced C# .We cover the core fundamentals needed for development. </p><p>Those who want to learn C#  this is how we do it</p><p><strong>We use</strong></p><ul><li><strong>L</strong>ectures</li><li>Hands On Assignments</li><li>Quizzes</li></ul><p>We use these methods to give you a university type setting and feel it is the best way for us to teach you these skills. With Lectures we go over the details of C# and explain how things work and should be done. In Hands On Assignments we give you homework which helps push it into your mind and stay there. And in Quizzes we makes sure the knowledge has absorbed. We try to give you a University setting with out the high cost of a University.</p><p><strong>What are the requirements? </strong></p><ul><li>Nothing is pre required, We go over everything with you and cover everything you need to know in this series. </li></ul><p><strong>What am I going to get from this course? </strong></p><ul><li>Over 30  lectures and Tons of content!</li><li>You will be able to efficiently write and understand C#</li><li>You will be on your way to becoming a great developer</li></ul>", 
    "end_date": null, 
    "title": "C# Programming from Zero to Hero : The Fundamentals", 
    "price": "20.00", 
    "instructors": "University of Geeks", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688378_08c6_2.jpg", 
    "course_url": "https://www.udemy.com/csharp-programming-from-zero-to-hero-the-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T21:52:46Z"
}