{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>C++ is a very powerful and general purpose programming language. It was developed and created by Bjarne Stroustrup at Bell Labs in 1979. C++ is a very powerful language that is used in software development and in game development. This C++ course starts you on your path to mastering a skillful language using a simple yet effective approach. Most of the issues we hear with c++i s that the technical aspect is to hard to understand. Well we break that mold for you. </p><p>We tackle C++ and help you become efficient at one of the worlds leading languages. </p><p>Those who want strong knowledge of C++ can take this course. </p><p><strong>How we teach</strong></p><ul><li><strong>L</strong>ectures</li><li>Hands On Assignments</li><li> Quizzes</li></ul><p>We use these methods to give you a university type setting and feel it is the best way for us to teach you these skills. With Lectures we go over the details of C++ and explain how things work and should be done. In Hands On Assignments we give you homework which helps push it into your mind and stay there. And in Quizzes we makes sure the knowledge has absorbed. We try to give you a University setting with out being in a University.</p><p><strong>This course is divided into three parts </strong></p><ul><li>First we will go over the basic aspects of the language.</li><li>Next we will dive into Object Orientation in C++.</li><li>Finally we will cover some more advanced topics. </li></ul><p><strong>What are the requirements? </strong></p><ul><li>Nothing is pre required, We go over everything with you and cover everything you need to know C++. </li></ul><p><strong>What am I going to get from this course? </strong></p><ul><li>Over 50 lectures and Tons of content!</li><li>You will be able to efficiently write C++</li><li>You will be ready to make a choice in life, on whether you want to be a full time developer.</li></ul><p><strong>Also the course is still bein built and will be adding code alongs soon</strong><br></p>", 
    "end_date": null, 
    "title": "C++ Programming from Zero to Hero :  The Fundamentals", 
    "price": "20.00", 
    "instructors": "University of Geeks", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610778_bfd8_2.jpg", 
    "course_url": "https://www.udemy.com/c-programming-from-zero-to-hero-part-1-the-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T15:03:50Z"
}