{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course is in the intermediate training of C++ that helps you become a professional programmer in C++. <strong>I have structured this course in such way that both beginners and intermediate developers could learn new things.</strong> In this course, we will start our learning session from Arrays as array don't have any direct application so we will just learn what are different arrays like the one-dimensional array and multi-dimensional array. We will use this gained knowledge in rest of the course. So I didn't add much stuff under the section of Arrays, <strong>but you could get plenty of experience through other sections where we use them.</strong></p>\n\n<p><br></p>\n\n<p>Right after this we have a detailed section of functions. Functions are vital if you are writing advance programs.<strong> So a very detailed explanation is required to know each and every concept of functions, with this mindset I tried my best to explain everything in this section of functions.</strong></p>\n\n<p><br></p>\n\n<p>And the last part is on Structures. The structure is also imperative as it takes all the concepts of basic and intermediate training. So in the section of the structure, along with the learning of structures, we will revise the concepts as well. We use arrays, functions, nesting, and all other stuff to pass in the structure.</p>\n\n<p><strong>So that's an opportunity for you to learn a lot from this course. Enroll in the course I see you inside.</strong></p>", 
    "end_date": null, 
    "title": "C++ : Intermediate training of C++", 
    "price": "20.00", 
    "instructors": "Ankit Shrivastava, TweakCoder eLearning Solutions", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/603014_1838_2.jpg", 
    "course_url": "https://www.udemy.com/inter-c-plus-plus/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-05T04:07:58Z"
}