{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tHave you always wanted to create console video games, but lack the basic C++ skills? Do you want to understand a more &quot;heavy-duty&quot; programming language? Do you really want to get &quot;under the hood&quot; and complete more complex computing tasks quickly? Do you simply want to advance your current skill set and learn one of the <strong style=\"\">world&#039;s most popular programming languages</strong>?  </p>  <p style=\"\">  \tC++ is one of the most widely used languages in the world. It&#039;s used for everything from financial trading applications (where speed equals revenue!) to console video games.  </p>  <p style=\"\">  \tDelve into the C++ programming language with this course, C++ For Beginners, authored by expert David Pither-Patterson. David is an experienced instructor, specializing in presenting complex technical information in a manner that just about anyone can grasp. With David&#039;s help, you&#039;ll start by setting up your development environment and working your way through all the C++ fundamentals.  </p>  <p style=\"\">  \tIncluded in the 46 video lectures that comprise the course are dozens and dozens of code examples that you can learn from. You&#039;ll also complete engaging lab exercises that are not only fun, but specially designed to help you retain the information in the lectures.  </p>  <p style=\"\">  \tC++ is one of the most important languages you can learn--and there is no better way to learn it than with LearnToProgram&#039;s David Pither-Patterson!  </p>", 
    "end_date": null, 
    "title": "C++ for Beginners", 
    "price": "25.00", 
    "instructors": "LearnToProgram, Inc., David Pither-Patterson", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/241444_3a9e_3.jpg", 
    "course_url": "https://www.udemy.com/cpp-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-11T14:33:38Z"
}