{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Build C++ programs</strong> that focus on developing your intermediate skills and apply more advanced C++ concepts and language fundamentals. Gain experience and build your portfolio of developed <strong class=\"redactor-inline-converted\">C++ programs</strong> by following the hands-on video tutorials as if your coding alongside the instructor. This course is about <strong class=\"redactor-inline-converted\">building C++ programs from scratch</strong>, applying and practicing beginner knowledge learned, developing skills at the intermediate level and having fun. </p><p>This course covers software installation on <strong class=\"redactor-inline-converted\">Windows and Mac</strong>. The <strong class=\"redactor-inline-converted\">software used in this course is free and open source</strong> for both platforms therefore there are no additional costs. The software is easy to setup, install and use and we cover all this in the course. </p><p>Each <strong class=\"redactor-inline-converted\">C++ program</strong> we write in this course focuses on applying certain skills and learning something new about <strong class=\"redactor-inline-converted\">C++ programming</strong>. The programming difficulty levels increase as you progress through the course. We start with more basic programs to ease into the course and refresh skills however you can move through the course as you choose since different programs are focused on in different sections. The <strong class=\"redactor-inline-converted\">C++ programs</strong> we write in this course cover essential intermediate skills and concepts. </p><p>In this course we write <strong>professional </strong><strong class=\"redactor-inline-converted\">C++ code</strong> that adheres to standards and best practices. Its not just about writing some code its about writing professional code that you and anyone else would enjoy working with, contributing to and maintaining. You can apply the professional programming practices to any development language as those skills are transferable. </p><p>This course is for <strong class=\"redactor-inline-converted\">C++ developers</strong> looking to increase their <strong class=\"redactor-inline-converted\">C++ skills</strong>, students looking to build programs, those looking to gain more practical and applied experience building <strong class=\"redactor-inline-converted\">C++ programs</strong>, people looking for a refresher in <strong class=\"redactor-inline-converted\">C++</strong> and those looking to practice and apply their <strong class=\"redactor-inline-converted\">C++</strong> knowledge and skills. </p><p><strong class=\"redactor-inline-converted\">Building C++ programs</strong> is exciting and an interesting way to learn new skills and increase your knowledge. Applying skills developed and knowledge learned through building <strong class=\"redactor-inline-converted\">programs in C++</strong> is a great way to increase your practical <strong class=\"redactor-inline-converted\">C++ experience</strong>. </p>", 
    "end_date": null, 
    "title": "C++ Intermediate: Build C++ Programs", 
    "price": "20.00", 
    "instructors": "Remi Blais", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/818276_c36e_4.jpg", 
    "course_url": "https://www.udemy.com/c-plus-plus-intermediate-build-c-programs/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-11T00:53:10Z"
}