{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Sharp and to the point talk on C++ programming for beginners!</strong>  </p>  <p>  \t<strong style=\"\">Let’s start the journey from installing c++ and an IDE (Eclipse) to the complete c++ 11<sup style=\"\">th</sup> version.</strong>  </p>  <p>  \tC++ is an <strong style=\"\">Object oriented programming</strong> language that can be used to create modern desktop software, game development or even critical system drivers too. You will find out that most trading applications are designed in C++ because in trading speed is money. When we get into the game development, c++ programming is hard to avoid if you want to create a fantastic and popular game.  </p>  <p>  \tIn this entire c++ video series, we start from installing gcc on our system. After <strong style=\"\">gcc</strong>, we will install <strong style=\"\">Eclipse</strong> which is a cross platform IDE because most efficient programmers don’t develop things on notepad. And yes, we don’t like to talk about here and there so expect pure <strong style=\"\">c++ programming</strong> guide with everything <strong style=\"\">explained code by code and that too practically. </strong>  </p>  <p>  \tWe are in no hurry, so we will start from Basics of Hello World in c++ and further moving to data types, variables and their scope. Further, we will look deep into the different operations that can be performed like arithmetic, logical, assignment. No programming is complete without looking into the conditional programming and loops, so we will look into <strong style=\"\">IF, Else, while loop</strong>, do while loop and for loop with examples.  </p>  <p>  \tThen we will take a practical look into the code syntax of Object oriented programming like <strong style=\"\">Classes</strong>, <strong style=\"\">objects, polymorphism, abstraction and encapsulation</strong>. These are the most common terms of programming along functions that will be explained with examples. We don’t expect anything to be explained without presenting a code example.  </p>  <p>  \tMoving into the journey we will pass from the roads of many terms like <strong style=\"\">constructors, destructors, this pointer, friend keyword, dynamic memory and namespace</strong>, we will finally move into <strong style=\"\">C++ 11</strong>, which is the latest standard.  </p>  <p>  \tWe will configure environment for<strong style=\"\"> c++ 11</strong> and will take a look into most common difference introduced in<strong style=\"\"> c++ 11</strong>.  </p>", 
    "end_date": null, 
    "title": "C++, 1st program to expert programmer", 
    "price": "20.00", 
    "instructors": "Igneus Technologies", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/222208_6617_5.jpg", 
    "course_url": "https://www.udemy.com/c-plus-plus-online-course/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-18T21:56:42Z"
}