{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This is a Scratch course designed for primary school students and it is different from anything else out there, because it is designed for young children it takes into account their psychology, their attention span and their creative impulse. This IS NOT an outcomes based course, students are shown how various concepts work but they are constantly invited to create and innovate their own programs and solutions. Each tutorial is a catalyst for the student’s creative output rather than a blueprint to a pre-defined result. The end goal of this course is not the acquistion of a specific set of skills (though that will happen) but rather a mindset of seeing coding as a new means of expressing oneself.</p><p>Module 1: Basics<br></p>\n\n<p>These tutorials are brief, straightforward and backed with answers. They are designed to quickly build up confidence and a skill base from which to build onwards. Students will learn to create, edit, move and animate sprites in a variety of ways. They will also learn to use variables to do basic mathematical operations. </p>\n\n<p>Module 2: Open Ended Activities\n\n  </p>\n\n<p>Here we apply multiple concepts we learned in module 1 into an application and a couple of game based scenarios. Students are shown how to create basic game dynamics and scoring and then they are left to improve movement dynamics and create sound effects, animations. What they end up with is their own game and a sense of pride and ownership. </p>\n\n<p>Module 3: Advanced Concepts\n\n  </p>\n\n<p>In this module students learn some more advanced concepts like: cloning, event messages and even basic recursion. All of this is done through game scenarios where cloning is essential to enabling our hero to shoot arrows, event messages are required to make the baddies disappear and recursion enables baddies to multiply making the game more challenging at higher levels.</p>\n\n<p>Module 4: Complex Problems\n\n  </p>\n\n<p>In our final module there is no new theory, the challenge here is the greatest challenge facing anyone coding a real badass game: complexity. Getting an ever higher number of sprites with an ever higher number of attributes to work together seamlessly! Once students are comfortable managing more complex code they are ready to take on the world! </p>", 
    "end_date": null, 
    "title": "Coding with Scratch Junior", 
    "price": "20.00", 
    "instructors": "Sanjin Dedic", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/829966_11b8_2.jpg", 
    "course_url": "https://www.udemy.com/coding-with-scratch-junior/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-23T12:12:51Z"
}