{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\">Learn MVC by creating your own PHP framework step by step!</strong></p><p style=\"\">MVC pattern, which stands for Model View Controller, is a widely – used programming technology and the most popular technique in web applications development.</p><p style=\"\">The most popular frameworks such as Laravel, Symphony, Yii, Zend are based on MVC pattern. So, it undoubtedly worth learning.</p><p style=\"\"><strong style=\"\">The best way of learning it is creating your own MVC framework and CMS.</strong> </p><p style=\"\">Step by step we`ll be creating MVC web application. Further the result of application developing during this course may be put into practice.</p><p style=\"\">As a consequence, we will create a light-weight framework and CMS which may be used in your project. It would contain pages view and editing, contact form, admin section and authorization. </p><p style=\"\">During this course you will learn the best practices in PHP OOP, sessions and MySQL interaction.</p><p style=\"\">If you always wanted to know how modern web applications and frameworks work, this course is definitely for you!</p><p style=\"\">Basic knowledge of PHP OOP is all that you need.</p><p style=\"\">Feel free to ask about free web hosting for this course learning. You can obtain domain, ftp and mysql accounts absolutely free in order to work with this course.</p><p style=\"\">On completing this course you will be a PHP-Academy certified developer. </p>", 
    "end_date": null, 
    "title": "Complete PHP MVC tutorial. Create your own PHP MVC framework", 
    "price": "20.00", 
    "instructors": "PHP - Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/405454_ddfa_3.jpg", 
    "course_url": "https://www.udemy.com/complete-php-mvc-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-27T17:37:39Z"
}