{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Why is the Java I/O important?</strong>  </p>  <p>  \t                    Java I/O is one of the most important components of the Java Programming language, since it is needed when your applications access and use a file or folder in the file system as well as when interacting with users.  </p>  <p>  \t<strong style=\"\">What makes Complete Java I/O for Beginners course different?</strong>  </p>  <ol style=\"\">  \t<li>Every line of code is described <strong style=\"\">step-by-step</strong> in each video.</li>  \t<li>The subject is told in a <strong style=\"\">clear and simple</strong> way.</li>  \t<li>Complete Java I/O for Beginners course has <strong style=\"\">1280 x 720 HD </strong>quality videos with <strong style=\"\">zoom-in/zoom-out, sketch motions and animations.</strong></li>  \t<li>Each lecture video is <strong style=\"\">self-contained</strong>. The development of the code for each lecture starts from scratch by the creation of related Java class. When you need to restudy a course subject, all you need to do is to re-watch the relevant course video, without the need to refer previous videos for any other detail.</li>  \t<li>Although the videos start from scratch and contains every detail needed, they are 5 minutes long in average.</li>  \t<li>You can use the videos not only for learning, but also as a reference guide at any time you need.</li>  \t<li>We used <strong style=\"\">Eclipse</strong> IDE while coding,</li>  \t<li>The Java I/O quick reference document provided with the course is prepared for you to solve frequently encountered problems without losing any time.</li>  </ol>  <p>  \t<strong style=\"\">For this course, you need to have:</strong>  </p>  <ol style=\"\">  \t<li><strong style=\"\">A b</strong><strong style=\"\">eginner level Java programming</strong> knowledge including the topics &quot;variables&quot;, &quot;data types&quot;, &quot;using classes&quot; and &quot;working with objects&quot;,<br style=\"\">  \t</li>  \t<li><strong style=\"\">Creating projects, packages and classes in Eclipse</strong> (In fact, we are explaining it briefly, but may be you need to have more information about this topic)</li>  </ol>  <p>  \t    It is important for us to be available every time you need support in your learning experience with our course. You can e-mail us for any questions or comments on the course subject, we will reply you quickly.  </p>  <p>  \t                    We will be available from Facebook and Twitter also.  </p>  <p>  \t                    We wish our lectures will be helpful to you and your career.  </p>", 
    "end_date": null, 
    "title": "Complete Java I/O for Beginners", 
    "price": "20.00", 
    "instructors": "AKINCI Training", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326890_ca8f_3.jpg", 
    "course_url": "https://www.udemy.com/complete-java-io-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-25T09:22:04Z"
}