{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>BRAND NEW COURSE !</strong></p><p><strong>Become a Python Programmer!</strong></p><p>This is the <strong>most comprehensive, yet straight-forward, course for the Python programming language on Udemy!</strong> Whether you have never programmed before, already know basic syntax, or want to learn about the advanced features of Python, this course is for you!</p><p>With <strong>over 100 lectures</strong> and more than 10 hours of video this comprehensive course leaves no stone unturned! This course includes quizzes,tests, and homework assignments as well as 3 major projects to create a Python project portfolio!</p><p>This course will teach you Python in a practical manner, with every lecture comes a full coding screencast and a corresponding code notebook! Learn in whatever manner is best for you!</p><p><strong>You will get lifetime access to over 100 lectures plus corresponding Notebooks for the lectures! This includes future updates covering Flask development and GUI creation!</strong><br></p><p>This course comes with a <strong>30 day money back guarantee!</strong> If you are not satisfied in any way, you'll get your money back. Plus you will keep access to the Notebooks as a thank you for trying out the course!</p><p><strong>So what are you waiting for? Learn Python in a way that will advance your career and increase your knowledge, all in a fun and practical way!</strong></p>", 
    "end_date": null, 
    "title": "Complete Python Bootcamp", 
    "price": "30.00", 
    "instructors": "Jose Portilla", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/567828_67d0.jpg", 
    "course_url": "https://www.udemy.com/complete-python-bootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T00:12:23Z"
}