{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Coding has become one of the most critical skills you can have for furthering your career. Whether you are an experienced developer who wants to learn a new language or you are new to programming, this course can be your comprehensive Ruby coding guide. Starting with the foundational principles such as syntax and scaling up to advanced topics like metaprogramming and big data analysis, I wanted to create a curriculum that will give you all of the tools you need to be a professional Ruby developer. A few of the key topics that you will learn in this course are:</p>\n<ul><li>Object oriented programming</li><li>Built in Ruby methods</li><li>Core programming skills</li><li>Custom algorithm development</li><li>Big data analysis</li><li>Metaprogramming</li><li>Using Ruby Gem libraries</li><li>Regular Expressions</li><li>Ruby programming best practices</li><li>An introduction to the Ruby on Rails and Sinatra web frameworks</li><li>Building 10 Ruby programs that solve complex Project Euler mathematical equations</li><li>And much more!</li></ul><br>With over a decade of real world development experience, I have engineered this curriculum to ensure it focuses on the skills you will need to be a professional Ruby developer. Each section has an interactive quiz to ensure you are understanding the material and you also will be given access to the source code for each lesson. After you have completed all of the videos and quizzes you will be given a certificate of completion in Comprehensive Ruby Programming and you will be ready to start building real world Ruby projects. Finally, in addition to the video lectures and quizzes, I will also be your code mentor throughout the course and will walk you through any challenges that you may face.", 
    "end_date": null, 
    "title": "Comprehensive Ruby Programming", 
    "price": "20.00", 
    "instructors": "Jordan Hudgens", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/739512_faa4_2.jpg", 
    "course_url": "https://www.udemy.com/comprehensive-ruby-programming-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-24T02:23:18Z"
}