{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t <strong style=\"\">What is the course about?</strong>  </p>  <ol style=\"\">  \t<li>A step by step video tutorial to create <strong style=\"\">Spring 4 RESTful Web Service</strong>. </li>  \t<li>Demonstrates the simplicity involved in using Spring framework for Web Service development. </li>  \t<li>Uses Spring Boot for absolute minimum configuration.</li>  \t<li>Provides introduction to Gradle build and dependency management tool. </li>  \t<li>Requires just 15 mins (excluding download and setup time) to develop your first Spring 4 RESTful web service</li>  </ol>  <p>  \t <strong style=\"\">Course Materials</strong>  </p>  <ul style=\"\">  \t<li>The course is delivered as video tutorial and source code is made available. </li>  \t<li>The course provides step by step instructions so that even a beginner can understand and complete the task.</li>  </ul>  <p>  \t <strong style=\"\">Course Duration</strong>  </p>  <ul style=\"\">  \t<li>Around 30 mins of video material but half of that is related setup for beginners. </li>  \t<li>An average experienced person can get  complete the task in just 15 mins.</li>  </ul>  <p>  \t <strong style=\"\">How is the course structured</strong>  </p>  <ol style=\"\">  \t<li>We start with download and setup of gradle and move on to work space setup</li>  \t<li>Add the build script required for the gradle and get an overview of the script</li>  \t<li>Add the necessary JAVA code (just 2 files)</li>  \t<li>Test the web service in the embedded tomcat server.</li>  \t<li>Conclude the course with an executable JAR so that you can share that with your friends to showcase your work.</li>  </ol>", 
    "end_date": null, 
    "title": "Create Spring 4 RESTful Web Service - Step By Step", 
    "price": 0, 
    "instructors": "AppLabs Hyd", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/194490_5bc5_4.jpg", 
    "course_url": "https://www.udemy.com/create-spring-4-restful-web-service-step-by-step/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-06T04:51:32Z"
}