{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t Este curso cubre el uso de la herramienta de generación de informes Microsoft SQL Reporting Services, también conocido como SSRS.<br style=\"\">  \t  SSRS es una herramienta utilizada por un sinfín de empresas y organizaciones que utilizan bases de datos y por medio de SSRS son capaces de extraer los datos y transformarlos en información útil para estas.<br style=\"\">  \t<br style=\"\">  \t  Este curso proporciona todo lo que necesitas saber para empezar el desarrollo de informes utilizando SSRS. Descargaremos e instalaremos las herramientas gratuitas, configuraremos nuestro propio servidor de informes; Comenzaremos desde los fundamentos de la creación de tu primer informe, y luego pasaremos a una personalización intermedia, llegando a aprender a publicar estos informes en nuestro servidor y que puedan estar disponibles para ser visualizados por usuarios finales. <br style=\"\">  \t<br style=\"\">  \t  Los informes creados en el curso están disponibles para su descarga, para referencia futura. <br style=\"\">  \t<br style=\"\">  \t  Si estas buscando hacer cualquier tipo de reporte, entonces debes ver lo que SSRS tiene para ofrecer. No es sólo una herramienta útil para la creación de informes dentro de tu propia empresa o negocio, es una herramienta que puede ser utilizada en cualquier entorno donde se necesite contar con información consolidada en un reporte.  </p>", 
    "end_date": null, 
    "title": "Curso Práctico SQL Server Reporting Services 2012 (SSRS) ", 
    "price": "35.00", 
    "instructors": "Sí se Aprende", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256274_141b_4.jpg", 
    "course_url": "https://www.udemy.com/curso-practico-sql-server-reporting-services-2012-ssrs/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-05T23:10:57Z"
}