{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t          Python é uma linguagem que ganhou o coração de diversas empresas no Brasil e no mundo. Ela está crescendo muito nos mais diversos campos da computação.  </p>  <p>  \t<strong>Mas por que isso está acontecendo ?</strong>  </p>  <p>  \t          Por ser uma <strong>linguagem </strong><strong>simples </strong><strong>e</strong> <strong>intuitiva </strong>o programador gasta mais tempo resolvendo os problemas do que entendendo as particularidades da linguagem, ou seja, Python é uma daquelas <strong>linguagens rápidas de aprender e fácil de se apaixonar!  </strong>  </p>  <p>  \t          Com este curso procurei fazer de uma forma bastante organizada e prazerosa, todo o trabalho de reunir as informações necessárias (parte da Internet e muito da minha experiência profissional) sobre todos os temas básicos da linguagem e o que é muito necessário para sair programando!  </p>  <p>  \t<strong>Se você ainda não sabe programar, esta é a hora de fazer este curso e entender rapidamente o poder que você tem em mãos!</strong>  </p>  <p>  \t<strong>Sabe programar? Ótimo! Este curso é excelente para quem deseja aprender rapidamente os principais conceitos da linguagem e resolver seus problemas logo em seguida!</strong>  </p>  <p>  \t          Para você ter uma ideia de como esta linguagem é muito utilizada:  </p>  <ul>  \t<li>O Facebook tem mais de 1.464 projetos</li>  \t<li>O Google tem mais de 6.541 projetos</li>  \t<li>Em 2013 foram publicados mais de 90 mil projetos em Python!</li>  </ul>  <p>  \t          Este curso foi criado com uma estrutura excelente, onde os conceitos são apresentados e logo em seguida são feitos diversos experimentos no melhor estilo mão-na-massa trazendo rapidamente a <strong>conexão</strong> entre a <strong>teoria</strong> e a <strong>prática</strong>!  </p>  <p>  \t          Entenda melhor este formato em nosso vídeo de apresentação, lá eu falo um pouco sobre mim e como será este curso em apenas alguns minutos. Se você ainda estiver com alguma dúvida sobre fazer este curso, vamos resolve-las agora!  </p>", 
    "end_date": null, 
    "title": "Curso de Python para Iniciantes", 
    "price": "20.00", 
    "instructors": "Thiago Guimarães Brito", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301042_a09e_3.jpg", 
    "course_url": "https://www.udemy.com/curso-de-python-para-iniciantes/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-16T01:45:18Z"
}