{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Python programmers are some of the most sought-after employees in the tech world, and Python itself is fast becoming one of the most popular programming languages. One of the best applications of Python however is data analysis; which also happens to be something that employers can't get enough of. Gaining skills in one or the other is a guaranteed way to boost your employability – but put the two together and you'll be unstoppable!</p><p><strong>Become and expert data analyser</strong></p><ul><li>Learn efficient python data analysis</li> <li>Manipulate data sets quickly and easily</li> <li>Master python data mining</li> <li>Gain a skillset in Python that can be used for various other applications</li></ul><p><strong>Python data analytics made Simple</strong></p><p>This course contains 51 lectures and 6 hours of content, specially created for those with an interest in data analysis, programming, or the Python programming language. Once you have Python installed and are familiar with the language, you'll be all set to go. </p><p>The course begins with covering the fundamentals of Pandas (the library of data structures you'll be using) before delving into the most important functions you'll need for data analysis; creating and navigating data frames, indexing, visualising, and so on. Next, you'll get into the more intricate operations run in conjunction with Pandas including data manipulation, logical categorising, statistical functions and applications, and more. Missing data, combining data, working with databases, and advanced operations like resampling, correlation, mapping and buffering will also be covered.</p><p>By the end of this course, you'll have not only have grasped the fundamental concepts of data analysis, but through using Python to analyse and manipulate your data, you'll have gained a highly specific and much in demand skill set that you can put to a variety of practical used for just about any business in the world. </p><p><strong>Tools Used</strong></p><p><strong>Python:</strong> Python is a general purpose programming language with a focus on readability and concise code, making it a great language for new coders to learn. Learning Python gives a solid foundation for learning more advanced coding languages, and allows for a wide variety of applications.</p><p><strong>Pandas:</strong> Pandas is a free, open source library that provides high-performance, easy to use data structures and data analysis tools for Python; specifically, numerical tables and time series. If your project involves lots of numerical data, Pandas is for you.</p><p><strong>NumPy:</strong> Like Pandas, NumPy is another library of high level mathematical functions. The difference with NumPy however is that was specifically created as an extension to the Python programming language, intended to support large multi-dimensional arrays and matrices. </p>", 
    "end_date": null, 
    "title": "Data Analysis with Python and Pandas", 
    "price": "25.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579706_595b_2.jpg", 
    "course_url": "https://www.udemy.com/data-analysis-with-python-and-pandas/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T02:41:44Z"
}