{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t          This course lets you master all fundamentals concepts of C programming language because:  </p>  <ul style=\"\">  \t<li style=\"\">Internal working has been explained using simple Animation</li>  \t<li style=\"\">Numerous real life examples have been given to understand tricky concepts </li>  \t<li style=\"\">Your understanding and queries have been mapped with concerned examples</li>  </ul>  <p style=\"\">  \t          The course is not assumption oriented. So we assume that  </p>  <ul style=\"\">  \t<li style=\"\">You don&#039;t know computer fundamentals</li>  \t<li style=\"\">You don&#039;t know programming fundamentals</li>  \t<li style=\"\">You want to master C programming language by self learning way</li>  \t<li style=\"\">You don&#039;t know why to learn C programming language</li>  \t<li style=\"\">You are curious enough to think and imagine &quot;out of the box&quot;</li>  </ul>  <p style=\"\">  \t          The Course contains  </p>  <p style=\"\">  \t          All concepts explained using animation supported by voice-over  </p>  <p style=\"\">  \t          Tests at the end of chapter and at the end of important units  </p>  <p style=\"\">  \t<span style=\"\">Gradually this course would be 10+ hours of course. The number of hours taken may vary from programmer to programmer. If you write sufficient programs at the end of each chapter then you will become master in C programming language. Support material will be uploaded continuously.</span>  </p>  <p style=\"\">  \t<span style=\"\">If you are undergraduate engineering or polytechnic student or a professional or a job aspirant then this course is for you. The course is going to cover writing programs in conventional DOS based TC compiler, latest IDEs as well as gcc compilation in Linux environment.</span>  </p>  <p style=\"\">  \t          The addition of notes, glossary, e-contents will be continuous process.  </p>", 
    "end_date": null, 
    "title": "Demystifying C Programming Language", 
    "price": "50.00", 
    "instructors": "Bhalchandra Gholkar", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/248612_ed16_3.jpg", 
    "course_url": "https://www.udemy.com/demystifying-c-programming-language-basic/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-23T09:24:30Z"
}