{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t Yedi dolarlık indirip kodu için : <a href=\"http://bit.ly/djangokupon\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\"> http://bit.ly/djangokupon</a>  </p>  <p>  \t Bu ders özellikle türkiyede php ve asp geliştiricilerinin kendilerini bir adım atıp MVC ile kod yazabilmek için php veya asp frameworklerini öğrenmeleri yerinde teknolojinin son nimeti olan ve instagram ve pinterest gibi devasa projelerin alt yapısında kullanılan bi mimari olan django framework&#039;ü öğrenerek tüm adımları tamamlamalarını sağlar.  </p>  <p>  \t   Geliştirdiğiniz projeler yüksek sayıda hit almaya başladığında siteniz yavaşlar ve kullanıcıları sıkmaya başlar dolayısıyla onları kaybedersiniz ve hitiniz düşer bu kısır döngüden kurtulmak için modern bir framework kullanıyor olmanız ve shared hostingleri terk etmeniz gerekir. Şimdi size djangonun neden en iyi seçim olduğunu kanıtlayacağım.  </p>  <p>  \t   Php ile geliştirilen büyük web siteleri : Wikipedia ve facebook  </p>  <p>  \t   Wikipedia : 2001 senesinde yazılmış bir internet projesi ve veri tabanına veri yazıp sonra url get ile çekmekten başka bişey yapmıyor ayrıca şu anda var olan teknolojilerin hiç birisini kullanmıyor o yüzden 2013 yılında php için  referans gösterilmesi gereksiz.  </p>  <p>  \t   Facebook : 2004 senesinde kurulduğunda markın farklı bir seçeneği yoktu fakat sonradan friendfeed&#039;e 15 milyon dolar nakit ve 32.5  milyon dolar facebook hissesini babasının hayrına vermedi bu kadar para bayılmasının nedeni aslında Python ile yazılmış alt yapısını facebook&#039;a adapte etmekti ve ettide zaten bkz.(Tornado). Ve tornadoyu açık kaynak olarak paylaştılar. Django gibi geniş çaplı değil sadece c10k problemine çözüm getiriyor ve realtime sistemler için kullanılıyor ayrıca django ile senkronize çalışabiliyor yani tek başına tornado ile gelişmiş bir sistem yazmak söz konusu değil .  </p>  <p>  \t   Bunu ben demiyorum kendileri diyorlar <a href=\"http://www.tornadoweb.org/en/stable/wsgi.html?highlight=django\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">Interoperability with other Python frameworks and servers </a>  &quot;You can mix Django and Tornado handlers in a single server.&quot; Yani Django ve tornadoyu birleştirerek kod yazabilirsiniz demişler adamların eksiği olmasa bunu demezler.  </p>  <p>  \t   Ruby ile geliştirilen servisler : Twitter , Hulu  </p>  <p>  \t   Ruby tercih etmeme nedenimde tornadonun python  ile yazılmış olup django ile senkronizasyonunun yapılabilmesi. Ruby ile realtime bir sistem kuracaksanız  node.js kullanmayı zorunlu kılıyor zaten twitter.com &#039;un mesajlaşma sistemindeki rezaleti ruby&#039;deyki realtime eksikliğini açıkça gözler önünede seriyor. Bu nedenle tartışmasız kullanılması gereken framework django.  </p>  <p>  \t   Son olarak kurstaki örnek projede şu anda ingilizce anlatımları bile bulanamayabilen bir çok örneği izleyerek örenebileceksiniz.  </p>  <p>  \t  Tercih ettiğim aylık 5 dolar vps servisi : <a href=\"https://www.digitalocean.com/?refcode=48b5eb53ca56\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">Digitalocean</a>  </p>", 
    "end_date": null, 
    "title": "Django Framework Dersleri", 
    "price": "20.00", 
    "instructors": "Yasin Aktimur", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/115272_2a5c_6.jpg", 
    "course_url": "https://www.udemy.com/django-framework-dersleri/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-05T00:34:56Z"
}