{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>ALGUNOS COMENTARIOS DE LOS ALUMNOS</strong></p><ul><li><em><strong>Valoración: 5 de 5. Este curso me ha parecido excelente!</strong></em></li></ul><p><em>\"Me ha ayudado a iniciarme con Matlab y a estar motivada durante todo el curso. Pablo explica muy bien y simplifica conceptos complejos facilitando la comprensión. Recomendaría este curso a todo el mundo que quiera aprender Matlab!\"</em></p><ul><li><em><strong>Valoración: 5 de 5. \"Gran curso incluso para aquellos con más conocimiento.\"</strong></em></li></ul><p><em>\"Incluso teniendo algo de experiencia con Matlab, este curso me ha sido de gran ayuda. Siempre es bueno y recomendable aprender las buenas prácticas de usuarios expertos, como he logrado gracias a este curso. En menos de 2 horas Pablo comparte con nosotros una gran cantidad de consejos que le facilitarán a cualquiera su día a día programando con Matlab, como es el caso de las recomendaciones para ordenar la interfaz, o el significado particular de cada uno de los errores, entre otras cosas. Estoy impaciente por hacer el nuevo curso más avanzado que ha prometido para dentro de unos meses!\"</em></p><ul><li><em><strong>Valoración: 5 de 5: \"Cumple lo que promete.\"</strong></em></li></ul><p><em>\"Repasa los errores típicos al iniciarse en Matlab y te ayuda a detectarlos y solucionarlos.\"</em></p><p><em><em><strong>---------------------------------------------------------------------------------------------------------------------------</strong></em></em></p><p><strong>GARANTÍA TOTAL</strong><em><strong> -</strong> Una vez lo adquieras, lo tienes disponible para siempre. Incluso las actualizaciones que vaya añadiendo. Es más, Udemy te devuelve el dinero sin hacer preguntas, si no estás contento con el curso en los primeros 30 días. Todavía no he tenido ninguna :)</em></p><p><em><strong><em><em>---------------------------------------------------------------------------------------------------------------------------</em></em></strong></em></p><p><em>¡Más de 250 alumnos en la primera semana!</em></p><p>Sígueme en Twitter =&gt;<em> @</em><strong>DrPabloAguilera</strong><em>.</em> El sitio más rápido para dudas y consultas, con prioridad para los alumnos interesados en el curso.</p><p><em><strong><em><em>---------------------------------------------------------------------------------------------------------------------------</em></em></strong></em></p><p>¿Quieres dominar MATLAB como un profesional? </p><p>Soy Pablo Aguilera, Ingeniero de Telecomunicación. Tengo un Postgrado en Programación para Internet, un Máster en Electrónica de Comunicaciones, y un Doctorado Internacional (con Premio Extraordinario) en Tratamiento de Señal.</p><p>Domino MATLAB desde hace una década, y durante los últimos 5 años he <strong>ayudado a cientos de estudiantes de ingeniería</strong> en la Universidad a diseñar algoritmos y programar como profesionales. He pasado<strong> miles de horas diseñando y programando </strong>algoritmos, así como enseñando a otros como tú a hacerlo de la forma más clara y eficiente.</p><p>MATLAB es el entorno de <strong>programación científico número 1 en el mundo</strong>, y es una exigencia para cualquier ingeniero que quiera resolver problemas técnicos en el mundo real, tanto en una empresa como en centros de investigación.</p><p>Es más, su creciente popularidad está haciendo que la demanda se dispare. Es por ello que es<strong> imprescindible su dominio</strong> para cualquiera que quiera hacer una carrera científica o de ingeniería. De hecho, si estás estudiando Ingeniería, Física, Matemáticas, o cualquier otra disciplina científico-técnica, este curso hará que resuelvas con solvencia cualquier problema de programación con MATLAB que te encuentres.</p><p>Durante mis años enseñando MATLAB en la Universidad, <strong>he detectado los fallos más típicos que cometen, una y otra vez, los estudiantes</strong> que están aprendiendo a programar. Esos que hacen que se atasquen y se frustren, impidiéndoles solucionar los problemas y evolucionar su aprendizaje. En este curso analizamos todos esos fallos en la Sección 3, y eso es algo que no te van a enseñar en ningún otro lado, pues sólo se adquiere con la práctica y la experiencia.</p><p><span></span>Aprenderás a identificarlos antes de que se produzcan. Incluso si ya se han producido, serás capaz de ver fácilmente la solución, de forma que podrás centrar tus esfuerzos en el problema que estás resolviendo, ya sea en una empresa o en la Universidad. Esto es especialmente crítico si estás escribiendo código MATLAB sin poder hacer pruebas y errores, como cuando no tienes un ordenador delante, o <strong>cuando estás en un examen</strong>. Y también es lo que distingue a un programador con experiencia de un novato.</p><p>En unas pocas horas, serás capaz de sacar adelante programas y algoritmos que antes requerían meses de experiencia. Además, en la Sección 2 te propongo varias buenas prácticas de programación que harán que directamente <strong>no te encuentres con muchos de esos errores</strong> cuando estés diseñando código.</p><p>Por si fuera poco, <strong>responderé y corregiré todas las dudas</strong> sobre MATLAB y programación que plantees en los foros de discusión de este curso en Udemy (en la parte derecha de la pantalla).</p><p>¿Qué te parece? ¿Preparado para dominar MATLAB con seguridad y eficiencia? Pues vamos a ello.</p>", 
    "end_date": null, 
    "title": "Domina MATLAB en 2016 - Cómo Evitar los 9 Errores de Novato", 
    "price": "30.00", 
    "instructors": "Pablo Aguilera", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448646_48ab_3.jpg", 
    "course_url": "https://www.udemy.com/domina-matlab-como-evitar-los-9-errores-de-principiante/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-16T16:10:01Z"
}