{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\">Create your Donut Pie Chart with Chart JS</strong></p><p>Learn how to create your own Donut or Pie chart with Chart JS. The internet is loaded with data and now we struggle to understand this data jungle! With Chart JS you learn how to create your Donut or Pie Chart with Chart JS and communicate it in seconds. </p><p>To explain this let me take you back to my story! When I started with Chart JS I was puzzled! There is a wonderful documentation that is not able to tell you as a starter how to use it. I could not understand why it was so hard to read this. My goal is learning how to make a very basic chart in the beginning. Eventually it worked but from that moment I thought this needs to be easier. </p><p>========================================================================</p><p><strong style=\"\">What will I learn in this course?</strong></p><p>You will learn how to create a Donut or Pie chart with Chart JS. This is a JavaScript library that simplifies the way of making charts for the web. However, the question should not be what you will learn but WHY!</p><p>========================================================================</p><p><strong style=\"\">Why should I learn this? </strong></p><p>The future is changing! Data overload was normal before but we are now in a new era! The era of Data Drowning! With Big Data impacting all the industries we have a Data Overload multiplied by 10! </p><p>Luckily charts are a huge solution of this pressing and growing problem! We need to consume data faster but we do not have the time to do that. We know a picture is worth more than a 1000 words! Well here it is true! Graphs are the future and they were so hard to produce before! Gladly now with multiple JavaScript Libraries it can be done! </p><p>========================================================================</p><p><strong style=\"\">In this course I will should you How to do it! </strong></p><p>You can expect it to be the easiest course about Chart JS ever! The reason why I tell you that is because I started out from scratch! It is truly idiot proof! You will learn in a step by step method that I know that works! </p><p>========================================================================</p><p><strong style=\"\">How structured is this course?</strong></p><p>The course is setup in multiple sections and some challenging brain busters! Every time you will see a new line of code! You just follow along and understand what is being taugh here. This method is a real reference for everyone who wants to understand it with video. The quick and easy way! </p><p><strong style=\"\">========================================================================</strong></p><p><strong style=\"\">Why should I take your course?</strong></p><p><strong style=\"\">========================================================================</strong></p><p>This is probably the most important question that you have! There are a few reasons, but the main reason is this. My course is truly from scratch! I will not teach you all the tricks but I give your a target to hit. Every video will teach you how to do one thing at the time. </p><p>You will understand it and you can follow it quickly! It is truly designed for the beginner and as low keyed as possible! I had to because all the documentation is usually written for professionals that already know the subject. </p><p>Next, the best ways to learn is by purposeful learning! This means you learn for a viable reason! Big Data is here! We all need to translate data! Every second the world is producing more and more data. The new challenge is translating data into useful information and quick! We need to consume huge reports in seconds! The only way to do this is with charts and Chart JS is a very efficient and wonderful tool to help you out. </p><p></p>", 
    "end_date": null, 
    "title": "Donut Pie Chart with Chart Js. Create yours from scratch!", 
    "price": "20.00", 
    "instructors": "Nicky Wong", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/492480_d35b_3.jpg", 
    "course_url": "https://www.udemy.com/donut-pie-chart-js/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-03T11:35:17Z"
}