{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The motivation behind this course came from an article titled \"Why Can't Programmers Program?\" by Jeff Atwood. It talks about how poorly many candidates perform in coding interviews.</p><p>Surprisingly a large fraction of applicants, even those with masters’ degrees and phds in computer science, fail during interviews when asked to carry out basic programming tasks such as iterate over a loop and print numbers from 1 -10 . Or solve the common fizz buzz problem. And I’ve experienced this first hand when I interview candidates for software development positions. They could have an impressive academic background as well as experience in various technologies and software projects, but when posed with an interesting programming problem, their code falls apart. The fact is, you don’t need a college education to become a good programmer. Simply there is a big divide between people who can program and those that can’t.<em> It's my experience that the difference has to do with mastering the fundamental building blocks of programming.</em> And that’s basically<em> method level </em>coding and the mastery of topics like<strong> <strong></strong></strong><strong>string manipulation</strong>, <strong>lists</strong>, <strong>loops</strong>, <strong>logic</strong> and <strong>recursion</strong>. These are fundamental granular components shared by all programming languages. <strong>Think of these as the tools a programmer can use to solve problems. And you really gotta know your tools well to be proficient at the craft! </strong></p><p>You can’t learn programming by reading books. The fact is you just need a lot of practice. If you want to be a superb programmer, you have to program a lot and work on solving challenging problems that stretch your capabilities. This course offers a systematic and structured way for you to acquire that practice using only a subset of the java language without getting side tracked in other areas of software development. Every concept comes with a coding challenge. I ask you to try solving the challenge on your own before I go over the solution in detail. This approach has worked time and time again for my students. </p>", 
    "end_date": null, 
    "title": "Eliminate Code Fear With Java Puzzles", 
    "price": "35.00", 
    "instructors": "Imtiaz Ahmad", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620486_8eb6_3.jpg", 
    "course_url": "https://www.udemy.com/eliminate-code-fear/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T16:50:34Z"
}