{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em><strong><em>Last Update: 17-March-2016 : Creating Duplicates exists program</em></strong><br></em></strong></p><p><strong><em>Last Update: 6-Feb-2016 : How to paste data to new workbook and save it</em></strong></p><p><strong><em>Did you know that repetition is a curse,</em></strong> if you don't stop then\nyou'll be wasting thousands of hours of your life. As an Excel user, you know\nthat many times you create same sheet, with same formatting and same formulas,\nagain and again. So, you're wasting thousands of hours, which you can spend with\nyour family, or doing other important stuff.</p><p>Luckily,\nthere is a tool or a language using which you can save those thousand hours of\nyour life by creating a simple program which does the work for you. The program\nwill create the sheet for you, it'll format it for you and it'll insert the\nformulas you. Not just that It'll protect your data in different ways.</p><p>Excel\nVBA, the programming language we're going to learn in this course which'll help\nyou automate your daily tasks more smarter and more easier. You'll be able to tackle\ndifferent and complicated situations easier.</p><p>So,\ndon't waste anymore hour or second of your life and take this course\nimmediately, uncover the tools which'll make your life easier.</p>", 
    "end_date": null, 
    "title": "Excel VBA and Macros programming for Absolute Beginners", 
    "price": "20.00", 
    "instructors": "Muhammad Ali Yasin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453472_5983_3.jpg", 
    "course_url": "https://www.udemy.com/ultimate-excel-vba-course-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-21T22:02:53Z"
}