{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>\t First of all let me tell you what is Open CV and what are the things that we can do using OpenCV. (If you are not familiar with Open CV),</p>\n\n<p>\t OpenCV is a open source C++ library for digital image processing and computer vision, which can be used to create real-time face recognition and using it with embedded robotics and micro controllers for purpose like differentiating a particular color from an image having various colors.</p>\n\n<ol>\t<li>Are you willing to become a programmer?</li>\t<li>Do you want to make software that sells?</li>\t<li>Do you want to present projects in your University and to score good marks?</li>\t<li>Do you wonder why you are not good at programming?</li>\t<li>Do you want to showcase your talent and present in front of your particular audience?</li>\t<li>Are you looking for getting projects as a freelancer but never got the opportunity?</li>\t<li>Do you want techniques and methods that will enhance your programming skills and more peoples would appreciate you for your works?</li>  </ol>\n\n<p>\t Solution to all this we will cover in this course.</p>\n\n<p>\t \"Few years back, I started learning programming and spent couple of months just to learn the basics. Then, for again a couple of months I spent my time learning advance of Open CV. Being in the same field for almost one year, I decided to start my own project. But I keep on stuck at various steps of my project as many of concepts were not cleared. I was not able to develop a simple software from the knowledge I gained. I was depressed and thinking to leave the programming.</p>\n\n<p>\t Then one day, I decided to give it one more try. I wrote down all the parts of my programming knowledge where I had weak concepts. I started visiting forums and posting my questions to sharpen my skills and doubt clearance. And again tried to create that project with fewer difficulties. I repeated the same method again and dig a lot.</p>\n\n<p>\t Now I got success; I am a professional programmer in C++ and OpenCV and now working with two companies.\"</p>\n\n<p>\t What you need is someone to teach you step by step every algorithm of OpenCV and C++, concepts which are widely used in programming and algorithms that are universal to each program. So that you can go forward without googling all day and night.</p>\n\n<p>\t Just 2 hours, you need only two hours to end this course and to become a master of Open CV and C++ advance.</p>\n\n<p>\t We have all the data collected from different resources at one place which includes:</p>\n\n<ol>\t<li>Real time face detection and object tracking.</li>\t<li>Embed robotics and micro controllers.</li>\t<li>Differentiating specific colors from an image and video stream through the webcam.</li>\t<li>Do projects like human detecting bots, color following bots, laser toy gun bots, bots playing football, etc.</li>  </ol>\n\n<p>\t And you can see the whole curriculum of the course under this section.</p>\n\n<p>\t Today you will have started-up in OpenCV and C++ that will lead to making you a successful programmer. Today if you spend time watching your videos of this course then you don't need to google all time and collect resources.</p>\n\n<p>\t Yes, you could spend hours learning how to do it on google, and then you have to sort out the good from the bad information. And spend hundred of dollars taking private coaching that explains how to do it, or you could buy all the information you need from this course for this little price.</p>\n\n<p>\t This course can be taken by anyone, as it includes section starting from beginners to advance step by step. The programming files include comments on each line so that you won't have a problem learning the program methodology.</p>\n\n<p>\t I will be updating it time to time with new projects and projects integrated with micro controllers and Arduino and projects on demand. Yes, you can request us a project that you are looking for, and we will be creating and uploading it for you.</p>\n\n<p>\t<br>\t No other course for OpenCV or Digital image processing is as simple as this and in this much of details.</p>\n\n<p>\t There is a summary page at the end of each section to sum up every topic under that section. You can ask me for help if you stuck or find any difficulty in understanding. I will put my best efforts into it.</p>\n\n<p>\t There is a 30 days money back guarantee also on this course, if you don't like the course, then you can take the full refund from us.</p>\n\n<p>\t Hope to see you in the course.</p>", 
    "end_date": null, 
    "title": "Face Detection -Master Open CV with Digital Image Processing", 
    "price": "25.00", 
    "instructors": "Ankit Shrivastava, TweakCoder eLearning Solutions, Siddarth Kumar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287070_1d75_4.jpg", 
    "course_url": "https://www.udemy.com/learn-open-cv-with-microsoft-visual-c/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-24T20:06:29Z"
}