{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  This course is about computer programming. The target audience includes people who know how to use computers, they are advanced users, but they want to go one step forward and learn how computer programs are being designed and developed. Pupils, teenagers, students, professionals of various disciplines, adults, elderly people. People who might want to start a career in computer programming.  </p>  <p>  \t  The course is composed of a series of video lectures. About 14 hours of video casts. The course will take about 70 hours to complete, but this heavily depends on the personal pace of each student.  </p>  <p>  \t  The course is divided mainly in the following sections:  </p>  <p>  \t  1) Some theory behind programming.  </p>  <p>  \t  2) Programming using Ruby.  </p>  <p>  \t  3) MySQL - Relational database management systems  </p>  <p>  \t  4) Web Development with HTML &amp; CSS  </p>  <p>  \t  5) Dynamic Web Applications with Ruby on Rails  </p>  <p>  \t  Everybody should take this course. Understanding what computer programming is and having some experience with that will train and mature the brain. Will give people knowledge to understand that these machines, called computers, are not something that belongs to another strange difficult-to-understand world. People will understand that computers work with statements that they ask them to execute, with logic and blind obedience. Computers are powerful machines, but it is the people that instruct them what to do. In this course, students will start giving orders to computers and computers will be at students&#039; service. After the course, students will decide to further enhance their computer programming knowledge with more advanced courses, and later on, even further pursue a career in software engineering.  </p>", 
    "end_date": null, 
    "title": "First Steps to Web Development", 
    "price": "50.00", 
    "instructors": "Panayotis Matsinopoulos", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184832_7500_6.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-computer-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-18T20:26:11Z"
}