{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em>C Programming is still a very valuable skill - and its also surprisingly easy to pick up. Don't be intimidated by C's reputation as scary - we think this course makes it easy as pie!</em></strong></p><p><strong>What's Covered:</strong><br></p><ul><li><strong>Conditional Constructs: </strong>If/else and case statements have a surprising number of little details to be aware of. Conditions, and working with relational and logical operators. Short-circuiting and the order of evaluation</li><li><strong>Loops</strong><strong>:</strong><span> For loops, while and do-while loops, break and continue. Again, lots of little details to get right.</span></li><li><span><strong>Data Types and Bit Manipulation Operations</strong><span>, again full of little gotchas that interviewers and professors love to test. </span></span></li><li><strong>Pointers</strong>: Memory layout of pointers and variables, pointer arithmetic, arrays, pointers to pointers, pointers to structures, argument passing to functions, pointer reassignment and modification - complete with visuals to help you conceptualize how things work.</li><li><strong>Strings</strong>: Strings, Character pointers, character arrays, null termination of strings, string.h function implementations with detailed explanations.</li><li><strong>Structs</strong> <strong>and Unions:</strong><span> These seem almost archaic in an Object-Oriented world, but worth knowing, especially in order to nail linked list problems.</span></li><li><strong>Linked lists</strong>: Visualization, traversal, creating or deleting nodes, sorted merge, reversing a linked list and many many problems and solutions, doubly linked lists.</li><li><strong>IO: </strong>Both console and file IO</li><li><strong>Enums, typedefs, macros</strong></li></ul><p><strong>Talk to us!</strong></p><ul><li>Mail us about anything - <strong>anything!</strong> - and we will always reply :-)</li></ul>", 
    "end_date": null, 
    "title": "From 0 to 1: C Programming - Drill Deep", 
    "price": "20.00", 
    "instructors": "Loony Corn", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715146_ecc1.jpg", 
    "course_url": "https://www.udemy.com/from-0-to-1-c-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T04:14:01Z"
}