{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Si quieres empezar tu carrera como desarrollador de software, este curso es el lugar indicado.</p><p>Aquí aprenderás los conceptos básicos de programación con C# uno de los lenguajes de programación más populares en la actualidad. Temas como declaración de variables, control de flujo, ciclos y métodos serán algo natural para ti después de concluir el curso.</p><p>Pero no solo eso, también aprenderás los fundamentos de Programación Orientada a Objetos, el paradigma de programación más utilizado en la industria que se utiliza para escribir código reutilizable, eficiente y que cumple con los más altos estándares.</p><p><br>Para aprender un lenguaje de programación se necesita mucha práctica, es por eso que la teoría explicada está acompañada de retos de programación que son ejercicios para reforzar los temas vistos y que intentes por tu cuenta solucionar diversos problemas. Además al final realizarás un proyecto final que engloba todos los conceptos aprendidos durante el curso, esto te dará la confianza para que empieces a crear tus propias aplicaciones de inmediato.</p><p>Quiero aprender a programar, pero ¿por qué C#?</p><ul><li>C# es un lenguaje de programación moderno muy popular</li><li>Al ser un lenguaje de programación basado en C, puedes aprender con facilidad cualquier otro lenguaje de programación de la familia C como C++, Java, Objective-C, JavaScript, entre otros.</li><li>Tiene cierto parecido con Java, pero corrige muchas de las fallas de diseño y limitaciones que tiene Java.</li><li>Tiene uno de los mejores entornos de desarrollo en el mercado: Visual Studio</li><li>El lenguaje es mantenido y revisado constantemente: más y mejores características son añadidas en cada versión.</li><li>Puedes crear cualquier tipo de programa: aplicaciones de escritorio, un sistema web o una aplicación móvil para cualquier plataforma.</li><li>Hay cientos de oportunidades de trabajo con sueldos bien remunerados.</li></ul><p><span></span></p>", 
    "end_date": null, 
    "title": "Fundamentos de C# para Principiantes", 
    "price": "25.00", 
    "instructors": "Enrique Munguía", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/772508_b68d_4.jpg", 
    "course_url": "https://www.udemy.com/c-sharp-para-principiantes/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-24T04:02:49Z"
}