{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Do you want to make cool video games and apps?</p><p>Do you feel uncomfortable with programming?</p><p>You should, because programming is not always easy.</p><p>Sometimes, making one mistake in the code can bring software bugs</p><p>Some bugs can be devastating such as this bug in the PACMAN game where the letters appears on top of the level, making the level unplayable.</p><p>To write good code, you need solid foundation.</p><p>This is what this course is all about.</p><p>This course teaches you the fundamentals of programming, just like you would learn in an American University, but in a fun way with real-life example that everyone understands.</p><p>Join this course now, your future self will thank you for it.</p><p><strong>SPOILER ALERT:</strong></p><p>Nobody grew up thinking when I grow up I want to be a programmer, NOP!</p><p>We want to be superheroes, police officers, firemen, astronauts and make cool video games and apps.</p><p>Now as soon as you try to make video games and apps, yo do a little research, next thing you know you need to learn how to program. You read a little bit about programming and then you're TURNED OFF. You know it's going to be a pain but you also know it's worth it because you're going to make awesome things with programming, right?!!!</p><p><br></p><p>Well that's what this course is all about. You get a solid knowledge of the fundamentals of programming, just like you would learn in an American University, but not as boring. The instructor tries to keep it an entertaining as possible and to give you as many real-life example so that you're never lost.</p><p>Programming is a main activity of computers. It is a skill for creation. Once you can do it, the sky's the limit over what you can make computers do. A program is just a plan of action a machine can follow. Become a master and have your computer do everything you ask it to do.</p><p>Learn the fundamentals now. Your future self will thank you for taking this course.</p><p><br></p>", 
    "end_date": null, 
    "title": "Fundamentals of Programming", 
    "price": 0, 
    "instructors": "Yohann Taieb", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/775656_34da_3.jpg", 
    "course_url": "https://www.udemy.com/fundamentals-of-programming/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T01:44:55Z"
}