{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>El curso abarcara desde lo más básico de java hasta la creación de un grandioso juego con todo lo aprendido en el curso, aprenderás desde los tipos de datos más influyentes en la programación hasta 1/2 de persistencia (Guardar y Salvar datos) en Java</p>\n\n<p><strong>JAVA PARA PRINCIPIANTES, INICIA DESDE 0 Y TERMINA PROGRAMANDO UN JUEGO!!</strong></p>\n\n<p>El Curso incluirá materiales de presentaciones para las clases, JavaProjects para las soluciones, textos informativos para los ejercicios y mucho material multimedia para hacer el curso mucho más interactivo.</p>\n\n<p>El curso es muy flexible, así que no importa si tienes mucho o poco tiempo, aprenderás en el momento que quieras, además una vez que inicias a programar con tan buena metodología no hay nada que te detenga.</p>\n\n<p><br></p>\n\n<p>ESTRUCTURA ÚNICA QUE DESTACA ESTE CURSO:</p>\n\n<p>El curso estará enfocado a 3 orientaciones:</p>\n\n<p>1. Orientado a proyectos: Se hará un proyecto diferente por cada sección.      </p>\n\n<p>2. Orientado al desarrollo paralelo: Desarrollarás el proyecto al mismo tiempo que el instructor, para que no pierdas el ritmo ni mucho menos las ganas de aprender. </p>\n\n<p>3. Orientado a la práctica y teoría: Este último es uno de los más importantes, pues es donde demostrarás lo aprendido con un Quiz teórico de 10 preguntas y una extensión práctica de 2 mini ejercicios qué deberán ser desarrolladas por el estudiante al final de cada sección para que desarrolles una buena habilidad y competencia lógica y de programación.</p>\n\n<p>¿Por qué deberías escoger este curso?<br></p>\n\n<p>Con una dinámica muy activa aprenderás lo justo y necesario para impulsarte en el mundo de la programación, especialmente con Java, pues cuando termines este curso podrás más que interpretar tus ideas, podrás empezar a programarlas sin ningún pero ni excusa.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Fundamentos de la programación en Java de 0 a un gran juego!", 
    "price": "20.00", 
    "instructors": "Juan Fernando Copete Mutis", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858098_f1ee.jpg", 
    "course_url": "https://www.udemy.com/fundamentos-de-la-programacion-en-java-de-0-a-un-gran-juego/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T00:30:36Z"
}