{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course is designed to jump right into showing how Git and GitHub work together, focusing on the Git basic workflow. Students can expect to learn the minimum needed to start using Git in about 30 minutes.</p><p><strong>Recent Updates:</strong></p><ul><li><em>October 16th</em>: Added <em>Updates and Errata</em> Section</li></ul><p><strong>Course Outline</strong></p><p>Course Introduction and Overview provides an introduction to this course and the key concepts with the Git source control system.</p><p>Installation provides step-by-step instructions on how to setup Git for Windows and Mac OS X, how to use Git's help command.</p><p>After the Installation section, we walk through the entire Git basic workflow -- starting off in GitHub, working locally, and then publishing our changes back to GitHub.</p><p>Finally, I have some parting words and some bonus content!</p><p><strong>Course Features</strong></p><p>Presentations provide audio/video training of conceptual ideas. Since few like slide-ware presentations, slide-presentations are kept to a minimum.</p><p>Screencasts provide a video of the instructor's computer system with any actions, commands, or screens displayed and narrated.</p><p>Following each lecture or group of related lectures in the demo sections of the course are Command Listing lectures that serve as reference and reminder of the commands used in the previous lecture(s). Each Command Listing includes the exact listings used in the previous lectures and a reference guide for newly introduced commands. All commands used in this course are available through the Command Listing lectures.</p><p>Several attachments throughout the course provide supplemental information, illustrations, or other reference material.</p>", 
    "end_date": null, 
    "title": "Git Started with GitHub", 
    "price": 0, 
    "instructors": "Jason Taylor", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/500632_e820.jpg", 
    "course_url": "https://www.udemy.com/git-started-with-github/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-13T03:18:19Z"
}