{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>Git for Geeks</strong><br></p>\n\n<p>This course is designed to cut academic theory to just the key concepts and focus on basics tasks in Git in order to be productive quickly. Students can expect to learn the all the main features of Git in just two hours.</p>\n\n<p><strong>New!</strong> Closed captions throughout the course!<br></p>\n\n<p><strong>Course Outline</strong></p>\n\n\n\n<p><em>Course Introduction</em> provides a welcome to this course with a few suggestions on how to get the most out of it. After that, we cover the minimum theory before getting our hands dirty with Git in the <em>Core Concept</em>s section.</p>\n\n\n\n<p><em>Quick Installation</em> provides an overview on the installation process for all tools needed for this course. A more detailed set of instructions are available in the Bonus section.</p>\n\n\n\n<p>In <em>The Basics</em>, we walk through all the commands needed to start a new project managed by Git (or enable Git for an existing project) all the way through making commits, including common file operations like moving and deleting files. We also cover how to exclude the wrong files from accidentally being committed and how to review your repository's history.</p>\n\n\n\n<p>We then go a bit deeper in the <em>Advanced</em> section when we cover comparing changes, branching and merging (including merge conflict resolution), tagging milestones, saving temporary work, and even a bit of time travel.</p>\n\n\n\n<p>Finally, <em>Going Remote</em> covers publishing the locally created repository (previous sections) on GitHub and BitBucket. We cover the main concepts related to working with any remote Git repositories and compare the differences between the two most popular Git hosting services.</p>\n\n\n\n<p>After the main part of the course, this course offers several bonus sections that explore some topics in more detail for those that like more information.</p>\n\n\n\n<p><strong>Course Features</strong><br></p>\n\n\n\n<p>Presentations provide audio/video training of conceptual ideas. Since few like slide-ware presentations, slide-presentations are kept to a minimum.</p>\n\n\n\n<p>Screencasts provide a video of the instructor's computer system with any actions, commands, or screens displayed and narrated. Excluding bonus lectures, this course offers about 2 hours of screencast videos.</p>\n\n\n\n<p>Several attachments throughout the course provide supplemental information, illustrations, or other reference material.</p>", 
    "end_date": null, 
    "title": "Git for Geeks: Quick Git Training for Developers", 
    "price": "20.00", 
    "instructors": "Jason Taylor", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695952_eaa1.jpg", 
    "course_url": "https://www.udemy.com/git-for-geeks/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T22:13:25Z"
}