{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This Course will teach you fundamental concepts about programming without going through specifics of any language. Concepts you will learn here are common enough that they are available in all programming languages.<br></p>  <p>The course is learning about Flow Charts, Pseudo codes &amp; Algorithms and getting familiar with the terms and constructs used in programming languages. We will also go through <strong>Scratch </strong>– A Programming language develop by MIT which provides a drag &amp; drop interface to build programs and games.</p>  <p>The course is suitable for <strong>children </strong>and <strong>adults </strong>as well who want to start learning programming.</p>  <p>Here is the view of the course structure:</p>  <p><strong>Lectures - 21</strong></p>  <p><strong>Video - 3+ Hours</strong></p>  <p><strong>Skill level - Beginner level</strong></p>  <p><strong>Languages - English</strong></p>  <p><strong>Includes - Lifetime access. Available on Udemy...</strong></p>  <p>The course is divided into <strong>units which are further divided into short lessons of 15-20 mins each.</strong> Short <strong>quizzes </strong>provide a break and also test your knowledge on the topics covered in that lesson. <strong>Exercises in a PDF format</strong> are also available for download  to consolidate your understanding on that topic.</p><p>The course kick starts with talking about the components of a computer system - <strong>hardware and software</strong>, the structure of a program and its life cycle, moving onto the IPO model and some commonly used input output devices. We precisely list about the <strong>benefits of learning programming</strong> and why it has become an absolute necessity in this digital age. </p><p>Then the course moves onto <strong>algorithm</strong> writing and its techniques, writing Pseudo codes before writing actual programs and numerous examples and tutorials for the same. </p><p><strong>Flowcharts </strong>are covered in detail. Their advantages, disadvantages and guidelines to draw them, all is covered under this topic. You will get to see many examples and tutorials for flowcharts to make you comfortable drawing them.</p>  <p>One whole unit of the course is dedicated to learning about terms and constructs used in real programming. What are <strong>variables </strong>and <strong>constants </strong>and how or where to use them ?<strong>Various operators, Boolean logic, blocks and loops</strong> - we will talk in detail about these all.</p>  <p>Finally the last unit of the course is based on <strong>hands on programming with Scratch</strong>. We will walk through the Scratch interface in detail and also do some tutorials to show you how you can create small programs in Scratch by using the concepts we have seen in earlier lessons.</p>  <p>So, this course provides you with a solid foundation on all the programming concepts and prepares you to take on programming with a good head start.</p>  <p>Thank You....</p>", 
    "end_date": null, 
    "title": "Head Start to Computer Programming", 
    "price": "20.00", 
    "instructors": "eLearnGenie .", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650224_f340_2.jpg", 
    "course_url": "https://www.udemy.com/head-start-to-computer-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-25T09:35:00Z"
}