{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course teaches <strong class=\"redactor-inline-converted\">C++ from beginner to professional</strong>. Learn best practices and programming standards that can be applied to any language and apply them to write clean, well structured and <strong class=\"redactor-inline-converted\">professional C++ code</strong>. Follow hands-on video tutorials that teach how to <strong class=\"redactor-inline-converted\">develop full programs in C++</strong> through real practical examples. Write code, create programs, compile and run code. Learn what software you need, how to install and setup your environment. A complete course to learn <strong class=\"redactor-inline-converted\">how to program in C++</strong>.</p>\n\n<p>There are no additional costs for software because all the software used in this course is free and open source. We cover a few different tools to provide you with options. Learn the essential tools to make <strong class=\"redactor-inline-converted\">C++ development </strong>easier and increase your productivity.</p>\n\n<p>This course should be done at your own pace and some lessons you may want to review a couple times due to their importance. This course is structured covering simple but essential concepts first, then moving to more advanced concepts and then reinforcing best practices that will empower you to write professional production quality <strong class=\"redactor-inline-converted\">C++ code</strong>. This course is also quick reference friendly for people with limited time that want to focus on learning a specific concept or code periodically. The <strong class=\"redactor-inline-converted\">C++ lectures</strong> are arranged in a logical order but can be watched in any order as each focuses on a complete concept being taught in the lecture. <strong class=\"redactor-inline-converted\">C++ source code</strong> is provided including shell programs and <strong class=\"redactor-inline-converted\">C++ make files</strong> that you can use as starting points and templates in our own development.</p>\n\n<p>Take this course if you want to <strong class=\"redactor-inline-converted\">learn C++</strong>, <strong class=\"redactor-inline-converted\">build complete C++ programs</strong>, <strong class=\"redactor-inline-converted\">maintain C++ programs</strong> in your work, <strong class=\"redactor-inline-converted\">freelance in C++</strong>, get a quick refresher on the language, use this as a programming reference course, get <strong class=\"redactor-inline-converted\">C++ source code</strong> to learn from or use and learn best practices to write professional code. Get Started now in <strong>learning C++</strong>.</p>", 
    "end_date": null, 
    "title": "How to Program in C++ from Beginner to Professional", 
    "price": "20.00", 
    "instructors": "Remi Blais", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/768340_bd19_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-program-in-c-from-beginner-to-paid-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-20T03:40:50Z"
}