{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>'How to Become a Programmer' is a practical guide that teaches anyone what they need to know in order to become a successful programmer.</p><p>You already know that knowing how to code is increasingly becoming an important skill to have. But what often isn't clear is what the steps are to becoming a professional developer.</p><p>It isn't enough to tell someone “Just pick a programming language\" or “Just build an app\". Beginners need more solid guidance, and this course is your starting point and roadmap. </p><p>This is the first course to take a detailed, insightful behind-the-scenes look at the tech world, and shows how you can join thousands of other people who are ditching their stressful, low paying jobs for well paid programming positions.</p><p><strong>What you will learn</strong></p><p>This course assumes that you have zero knowledge about programming, and we take the “complex\" parts and break them down into smaller chunks that make it easier to digest.</p><p>The first half of the course discusses topics that lay the groundwork for being a good programmer. We will dive into topics like “What is programming?\" and “Which programming language should I learn first?\"</p><p>In the second half of the course, you will be learning HTML, CSS, and JavaScript and seeing how these languages make up the websites you see in your browser. We will focus on making you a highly competent web developer.</p><p>Web development is a field that is constantly needing programmers. You will be able to take the skills you gain from this course and immediately apply it to the real world.</p><p>In addition, you will also be learning:</p><ul><li>Why there are so many programming languages</li><li>How to approach problems and think like a programmer</li><li>What tools and software are needed to develop on your computer</li><li>What terms like algorithms, frameworks, and pseudocode are</li><li>Core concepts that are fundamental in any programming language</li><li>How to know when you are ready to find a job as a programmer</li></ul><p><br></p><p><strong>Save time, money, and frustration</strong></p><p>There are endless books, videos, and online tutorials about programming. But none of them actually tell you where you should start.</p><p>This course will guide you in writing your first line of code. You will see how simple it is, and that all it takes is a willingness to work hard.</p><p>By the end of this course, you will have a strong understanding on how to develop websites. You will understand how code translates into the beautiful web pages that you see every day.</p>You will gain skills and knowledge that employers are looking for. You will be able to comfortably explain and understand technical concepts with other developers and hiring managers.", 
    "end_date": null, 
    "title": "How to Become a Programmer", 
    "price": "20.00", 
    "instructors": "Coder Vox", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569154_add8_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-programmer/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T11:03:29Z"
}