{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">In this course, you'll learn the fundamentals of how programming languages work. Using the metaphor of cooking and restaurants, you'll get concrete, plain english answers to questions like “What programming language should I learn?” and “What is programming?”</p> <p style=\"\">Programming courses and classes have some of the highest dropout rates of any professional domain...that's because the ideas are often presented in a very abstract way...Don't worry, this course is different. As long as you understand how a recipe works, you can understand how coding works. </p> <p style=\"\">At the most basic level, programming is two things: Ingredients and Preparation. That's our cooking metaphor...the words a programmer would use for these two terms are Data and Algorithms. </p> <p style=\"\">When you cook something, you are taking those raw ingredients and transforming them, cooking them, in some way to get a final result, the plated meal.</p> <p style=\"\">Your input is ingredients, your output is a plated meal. </p> <p style=\"\">A cookbook contains recipes, each with 2 parts. The ingredients are up top, and the preparation is below. Sometimes there is even a picture of what the final result will look like. Those 3 things, the input, transformation, and output, are the fundamental parts of both cooking and programming.</p> <p style=\"\">I spent a lot of time getting very frustrated when I was first starting out learning programming, and I almost quit a few times. </p> <p style=\"\">This course is about getting you past the initial stage of total confusion, which for many people lasts for the first few weeks or months of programming, to the next stage where you can learn at your own pace and feel confident knowing you have a solid foundational understanding so you can start to think like a programmer.</p>-Timothy", 
    "end_date": null, 
    "title": "If You Can Cook, You Can Code Vol 1: How Programming Works", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514216_96dc.jpg", 
    "course_url": "https://www.udemy.com/if-you-can-cook-you-can-code/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T01:52:51Z"
}