{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Have you decided to learn Python as your first programming language? Or learning Python for a new job? Or just heard that Python is one of the best modern languages to learn?</p><p style=\"\">If so, you&#039;re on the right track. Python is an incredibly powerful language and that can be used in almost any situation. That&#039;s why I chose Python as the first course in the &quot;If You Can Cook, You Can Code&quot; Series.</p><p style=\"\">Are you a beginner to programming? If so, here&#039;s why this course is different (otherwise, please skip down a bit)....</p><p style=\"\">Many courses that teach an introduction to Python are not aimed at first time programmers. In fact, most of them aren&#039;t. Instead, they are aimed at students who have already programmed in other languages and just want to learn Python.</p><p style=\"\">The problem is that if you are just starting out, you won&#039;t understand a lot of the terminology used, and a lot of the concepts that the teacher refers to won&#039;t make sense. </p><p style=\"\">Why?</p><p style=\"\">Because programming is not one skill, but two.</p><p style=\"\">The first is learning how to solve problems abstractly, by breaking them down in to bite sized pieces that a computer can solve.</p><p style=\"\">The second is figuring out how to tell the computer to solve these bite sized problems using the programming language you have chosen.</p><p style=\"\">Here&#039;s the thing...almost any problem can be solved in almost any programming language. The reason people choose one language over another is because in one language you can get the same problem solved in 1/10th of the lines of code. Why write 1000 lines of code in one language if you can solve the same problem in 120 lines of code in another?</p><p style=\"\">This is a big reason why people choose Python and other modern, high level languages.</p><p style=\"\">it&#039;s like telling somebody &quot;make some chocolate chip cookies&quot; versus giving them step by step instructions. The former is a high level command, the latter is more low level. </p><p style=\"\">How does cooking come into play? </p><p style=\"\">Well, the cooking metaphor starts with the recipe. It turns out, if you&#039;ve ever written a recipe, you are already a programmer. A recipe is a program, usually 20-40 lines long, that tells someone how to create some food item.</p><p style=\"\">In each recipe, you have raw ingredients and you have a preparation, which tells the chef how to mix and transform the ingredients into the final result (which is often shown as a picture in the top right corner of the recipe).</p><p style=\"\">You&#039;ll learn Python quickly by understanding data as your raw ingredients, and computer algorithms (aka functions or methods) as the preparation in a recipe. </p><p style=\"\">This course is different from any other kind of programming course out there. Everything you&#039;ll hear is in plain english and explained with concrete cooking metaphors. That means you&#039;ll get each new concept the first time around instead of the fifth. </p><p style=\"\">I&#039;m a self taught programmer. I know what it&#039;s like to read books, go through courses and literally feel like you just spend hours and didn&#039;t learn a thing. I created this course series to provide an alternative to the current programming books and courses out there, and I hope you enjoy it.</p><p style=\"\">Remember, this course isn&#039;t just about the content, it&#039;s also about the discussion section. If you have any questions or something doesn&#039;t make sense, all you have to do is ask and you&#039;ll get a personal response from me (and plenty of cooking references/metaphors)</p><p style=\"\">See you in the course,</p><p style=\"\">Timothy</p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "If You Can Cook You Can Code Vol 2:  Learn Python", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556494_b70d_3.jpg", 
    "course_url": "https://www.udemy.com/python-if-you-can-cook-you-can-code/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T16:43:14Z"
}