{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong> NEW!! Now Featuring MATLAB R2016!</strong></p>\n\n<p>In this course, you will master the core MATLAB Programming skills through instruction and interactive exercises.  I've boiled down the vast amount of information available to deliver exactly what you need to learn to get started in MATLAB.  The topics were hand selected personally based on 20 years of practical MATLAB experience during my engineering career.  The courses focuses on the top skills that enabled me to make over $1.8M and can help you become a \"Local Expert\" in just a few hours.  Imagine having the ability to execute MATLAB commands with ease or create you own functions at will when you're called to solve a problem.  What if you could magically impress your boss with professional graphs or analyze data like a champ?  Become that person that your peers call upon when they need help and develop your MATLAB skills to create amazing tools, software, or whatever your heart desires.</p>\n\n<p><strong>Become a Local MATLAB Expert in a Few Hours</strong></p>\n\n\n\n<p>Now is your time to master the basics of MATLAB!  Enroll in this course and receive:</p>\n\n\n\n<ul><li>Streamlined Topics and Step-by-step Instruction based on real-world experience</li><li>Interactive Training Exercises</li><li>Surprise Bonus Lectures</li><li>24/7 Access to your Instructor and other Students through the Discussion Forum</li></ul>\n\n\n\n<p><strong>Streamlined Content - Avoid Drinking from the FIre Hose!</strong></p>\n\n\n\n<p>I created this course so you don't have to browse the internet looking for answers.  In this course, we show you each topic step-by-step and you can practice with exercises at the end of the section.  By the end of this course you will learn how to:</p>\n\n\n\n<ul><li>Navigate the Environment and Execute Commands with ease</li><li>Create Vectors, Matrices, Arrays and other Variables with confidence</li><li>Perform Operations on large data sets with one command</li><li>Generate professional looking Plots for presentations and documentation</li><li>Automate a group of commands with Scripts and interact with user input</li><li>Develop your own Functions and build MATLAB programs</li></ul>\n\n\n\n<p>Mastering the basics of MATLAB gives you the ability to learn advanced topics more easily, create amazing tools and software, and conduct engineering tasks with ease. Enroll today to get started.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Interactive Beginners Guide to  MATLAB", 
    "price": "50.00", 
    "instructors": "Joe Papa", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/782728_8f73_2.jpg", 
    "course_url": "https://www.udemy.com/matlab-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-05T01:23:40Z"
}