{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong>DO YOU WANT BUILD A DYNAMIC WEBSITE?<br>LEARNING THE BASIC LANGUAGE PHP &amp; MYSQL FROM SCRATCH?<br>BECOME A PROFESSIONAL WEB DEVELOPER GRADUALLY?<strong></strong></p><p><em><strong></strong>JOIN THIS COURSE AND MAKE YOUR NEXT WEBSITE! PIECE BY PIECE!<strong></strong></em></p><p><em>PHP</em> is the most widely used programming language in the world. This course is suitable for <strong><em>beginners</em> </strong>but also for those who want to <em><strong>refresh their knowledge</strong></em>. Gives the main bases also <strong>MySQL</strong>, and start designing your own websites. <strong>You don't need any experience to take this course.</strong></p><p>This course is ideal for <strong>web developers new</strong> to PHP &amp; MySQL who have a fundamental understanding of <em>HTML/ HTML5</em>, and want to get started with a strong foundation.</p><p>This course includes the basic sintax for start to building a dynamic website and a first introductory lessons <em>How to Install-Simulate a Webserver on your PC.</em></p><p>You learn <strong>commands </strong>and <strong>techniques </strong>for use the <strong>Variables</strong>, <strong>Data Types</strong>, create <strong>Arrays</strong>, <strong>Concatenation Operators</strong>, <strong>Associative Array</strong>, <strong>Two Dimensional Array</strong>, and more with easy. You will become familiar with the <strong>functions </strong>in <em>PHP</em> and <em>MySQL</em>, for <em>creating a dynamic website</em>!</p><p>This course allows you to learn at your pace without spending entire days at a time away from the office or your college.</p><p><em>\"The course is presented via an intuitive, easy-to-use interface, allowing you to learn at your own pace.\"</em></p><p><strong>ARE YOU READY TO LEARN THE MOST POPULAR WEB LANGUAGE? AND BUILD YOUR FIRST DYNAMIC WEBSITE NOW!!</strong></p><p><strong>The course package:</strong></p><p>- 26 video tutorials (about 2.00 hours total) <br>- exercises tutorial: step by step, how create your PHP website <br>- Videos available, 24 hours on 24 <br>- Learn when you want (every day or week-end) <br>- Gradually Learns the Basic of PHP and MySQL!</p><p><strong>The course outline:</strong></p><p>- Install a Webserver<br>- The function ECHO<br>- Use Comments<br>- Variables and Data Types<br>- Arrays, Associative Array, Two Dimensional Array <br>- IF function... and MORE!</p>", 
    "end_date": null, 
    "title": "Into PHP & MySQL world. Learn the 25 Codes to Start!", 
    "price": "20.00", 
    "instructors": "JobboJ Courses", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581556_911e_3.jpg", 
    "course_url": "https://www.udemy.com/php-mysql-tutorial-beginner-move-first-steps-learn-codes-to-start/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T20:36:38Z"
}