{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">   ¿Crees que ObjectiveC es más difícil de comprender que una peli de Bruce Lee en versión original? ¡Verás que no en menos de 3horas estarás listo!</strong>  </p>  <p>  \t     Este curso es un fragmento de nuestro curso <strong style=\"\">Bestseller en Udemy</strong> &quot;<a href=\"https://www.udemy.com/curso-de-programacion-ios-para-iphone-y-ipad/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Programación iOS para iPhone &amp; iPad con Fernando Rodríguez</a>&quot;. Está dirigido a todos aquellos programadores que quieran dar sus primeros pasos en la programación nativa iOS para iPhone &amp; iPad. Es ideal tanto si NO tienen experiencia en Programación Orientada a Objetos como si la tiene, pero necesitan repasar o reforzar algunos conceptos importantes para adentrarse luego pisando fuerte en la programación iOS propiamente dicha.  </p>  <p>  \t  Los programadores iOS están en auge y este curso totalmente GRATIS te preparará para dar el salto a la programación de Apps para iPhone &amp; iPad. Y lo mejor, de la mano de uno de los instructores de iOS de mayor renombre internacional en la actualidad.  </p>  <p>  \t<strong style=\"\">    TESTIMONIOS:</strong>  </p>  <p>  \t<em style=\"\">“</em><em style=\"\"><strong style=\"\">Excelente!!</strong> Lo más importante del curso es que <strong style=\"\">se aprende en grande</strong>, quien lo dicta y quienes apoyan el proceso están comprometidos con la causa de enseñar, <strong style=\"\">es increíble la fluidez con la que se explica</strong>, enhorabuena y espero poder ver nuevos cursos junto con ustedes.</em><em style=\"\">” </em>JESÚS LODOÑO  </p>  <p>  \t<em style=\"\">“</em><em style=\"\">El mejor curso de Objective-C de todos los que he hecho. No hay color. Explicaciones geniales, claras de un profesor que entiende perfectamente de lo que habla. EnhoraBuena por el curso y por la capacidad docente de Fernando</em>.<em style=\"\">”</em> JAVIER LARA MEDINA  </p>  <p>  \t<em style=\"\">“ </em><strong style=\"\">Maravilla. </strong>Fernando tiene una manera asombrosa de absorberte y dejarte pegado a Xcode, lo recomiendo incluso a gente ya experimentada, te muestra algunos secretos que quizás aún no conozcas y sobre todo, te enseña sus buenas prácticas. Una maravilla.<em style=\"\">” ALEJANDRO DELGADO</em>  </p>  <p>  \t<strong style=\"\">    ¿POR QUÉ TOMAR ESTE CURSO?</strong>  </p>  <ul style=\"\">  \t<li>La carrera de Programador iOS están en auge y conocer bien algunos conceptos clave de la Programación Orientada a Objeto con Objective C es requisito fundamental para prepararte como Desarrollador iOS y aprovechar esta oportunidad.</li>  \t<li>Soporte constante de nuestro equipo de instructores a TODAS tus dudas durante y después del curso. </li>  \t<li>Acceso a una de las comunidades de desarrolladores iOS más exclusivas con sus foros, networking, súper ofertas de trabajo, etc: AGBO Alumni.</li>  \t<li>Te permite prepararte bien y GRATIS para luego tomar nuestro curso Bestseller en Udemy &quot;<a href=\"https://www.udemy.com/curso-de-programacion-ios-para-iphone-y-ipad/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Programación iOS para iPhone &amp; iPad con Fernando Rodríguez</a>&quot; considerado el mejor curso online en español en la opinión de los Usuarios de Udemy (¡+150 testimonios!).</li>  \t<li>Acceso de por vida al curso</li>  </ul>", 
    "end_date": null, 
    "title": "Introducción a Objective C & iOS", 
    "price": 0, 
    "instructors": "KeepCoding Online, Fernando Rodriguez B", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/172806_0b79_3.jpg", 
    "course_url": "https://www.udemy.com/introduccion-a-objective-c-ios/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-25T15:25:43Z"
}