{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\">Do you want to become an Apple Watch Developer?</strong></p><p><strong style=\"\">Do you want to create apps for the Apple Watch? And be proficient at Swift?</strong></p><p>Well,<strong style=\"\"> you&#039;re in the right place!</strong> </p><p>The Apple Watch is going to be one of the <strong style=\"\">biggest launches of Apple till date</strong>. It&#039;s a completely new device! And that&#039;s why I want you to be <strong style=\"\">ready to cash in</strong> when the time comes. </p><p>Take this course now and <strong style=\"\">have your own apps available at the time of the Watch&#039;s release</strong>. I believe that the best way to learn is by doing. Thus, in this course, we&#039;ll cover all you need to know about Swift, and create some simple applications to get you started. <strong style=\"\">The best part? It&#039;s completely FREE! </strong></p><p>This course <strong style=\"\">contains over 38 lectures covering 4 hours</strong> worth of content, and you&#039;ll get exercises to go along with it to test out what you&#039;ve learned. We&#039;ll start off create understanding how Xcode works and how to create an Apple Watch App. After than, we&#039;ll move on to Swift, covering everything from commenting to classes. Later, we&#039;ll begin the first of 3 apps, starting with a Click Counter, and then moving on to a neat Stopwatch and then a terrific Tip Calculator. </p><p>Throughout the journey, I&#039;ll <strong style=\"\">be with you every step of the way</strong>, answering all your questions and doubts, and making sure you actually understand the code that you are writing. </p><p>Well,<strong style=\"\"> what are you waiting for?</strong> Go on and jump into the <strong style=\"\">World of Apple Watch Development!</strong></p>", 
    "end_date": null, 
    "title": "Introduction to Apple Watch Development", 
    "price": 0, 
    "instructors": "Avinash Jain", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/478508_1b33_6.jpg", 
    "course_url": "https://www.udemy.com/applewatchdevelopmentintro/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T23:06:03Z"
}