{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tDo you want to become a programmer?  </p>  <p>  \tOr is it that Python interests you?  </p>  <p>  \t<span>If you need a quick brush-up, or learning Python for the first time, you&#039;ve come to the right place!</span>  </p>  <p>  \tLet&#039;s get started learning one of the most easiest coding languages out there right now. There&#039;s no need to fret if you haven&#039;t coded before. By the time you finish this course, you&#039;ll be a pro at Python!  </p>  <p>  \tPython is a great and friendly language to use and learn. It fun, and can be adapted to both small and large projects. Python will cut your development time greatly and overall, its much faster to write Python than other languages. This course will be a quick way to understand all the major concepts of Python programming. You&#039;ll be a whiz in no time.  </p>  <p>  \tThis course is a one-stop-shop for everything you&#039;ll need to know to get started with Python, along with a few incentives. We&#039;ll begin with the basics of Python, learning about strings, variables, and getting to know the data types. We&#039;ll soon move on to the loops and conditions in Python. Afterwards, we&#039;ll discuss a bit of file manipulation and functions. By then, you&#039;ll know all the basics of Python.  </p>  <p>  \tI hope you&#039;re excited to dive into the World of Python with this course. Well, what are you waiting for? Let&#039;s get started!  </p>", 
    "end_date": null, 
    "title": "Introduction To Python Programming", 
    "price": 0, 
    "instructors": "Avinash Jain", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433798_1de9_4.jpg", 
    "course_url": "https://www.udemy.com/pythonforbeginnersintro/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T05:47:45Z"
}