{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Have you ever said to yourself:  <em>\"I'd like to learn to code, but where should I start?”</em>  </p>\n\n<p>There are an overwhelming number of options that are available to those who want to learn.  Introduction to Programming is designed to give you the foundational skills that will prove important for any type of programming you want to do. You’ll learn to code web pages, create a mobile application and use external data sources. (Mobile covered in Level II of the course)</p>\n\n\n\n<p>This course, which includes video lectures, lab exercises, and full program code will prepare your for entry level jobs in development— or simply make you comfortable with code and confident in more advanced study.</p>\n\n\n\n\n\n\n\n<p>As you build a portfolio of skills, you’ll also build a portfolio of completed projects that can be used to demonstrate your new skill sets.</p>\n\n\n\n\n\n\n\n<p>In Level I of the course we focus on foundations-- The things that all developers need to know to be successful.  With each passing chapter of the course you'll learn new skills and demonstrate them in a lab exercise.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Technologies<br></strong>This program will introduce participants to all of the following technologies:</p>\n\n\n\n\n\n<ul><li><p>HTML5 and CSS:  Construct the visual aspects of web sites and mobile applications with this language pair</p></li><li><p>Python:  You’ll learn the basics of coding and programming logic using the Python programming language</p></li></ul>\n\n\n\n<p>In Level II of the course we'll look at mobile technologies,Javascript, jQuery and SQL.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">We Created Introduction to Programming For You<br></strong>If you've been considering learning to code-- or have tried before and it didn't quite take-- then this course is for you. We're not teaching a random programming language, but, instead, laying a professional foundation with the skills <em class=\"redactor-inline-converted\">today's programmers need to know.</em></p>\n\n\n\n<p>A mix of lecture and activity, this course is designed not just to expose you to important topics for new coders, but to help you retain the information and immediately put it to use.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Comprehensive and Efficient<br></strong>Introduction to Programming is designed to provide a comprehensive introduction to the programming field.  However, we know you're busy and don't spend time on unnecessary theory and background.  You'll complete the course in just a few weeks worth of evenings-- however the lessons will stay with you through out  your programming career.<br></p>\n\n<p><strong>Projects</strong><br>You'll learn by doing in the Introduction to Programming program.  This course includes multiple projects to help you understand and remember what you're learning.  Here's just a few of the projects you'll complete:<br></p>\n\n<p>Restaurant Review Web Site: Post your favorite restaurant reviews on your own site<br>MP3 Player:  Play your favorite music<br>Responsive Design Web Site:  Make a web site work across multiple sized screens<br>Interest Calcuator:  Figure out how long it will take you to get rich<br>Magic 8 Ball:  Make those truly important decisions<br>Web Services Project:  Get data from an external source-- They key to many apps</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Over 500,000 Students LearnToProgram<br></strong>You'll be among our community of over 500,000 students who've learned programming from one of our LearnToProgram courses. With over 250,000 students on Udemy alone, we've learned a few things about teaching people-- And those lessons are injected in to Introduction to Programming.  <br></p>\n\n\n\n<p>We're looking forward to seeing you in class!</p>", 
    "end_date": null, 
    "title": "Introduction to Programming: Level I", 
    "price": "50.00", 
    "instructors": "LearnToProgram, Inc., Mark Lassoff", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530308_8ca0_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-programming-level-i/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T12:27:57Z"
}