{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>A lot has changed in the world of ASP.NET 5 and MVC 6, but a lot is still the same. All of the major frameworks (Web API, forms, and MVC) have been rolled out under the umbrella of a single unified programming model. There’s a new built-in dependency framework, and there are Tag Helpers. All this has had a major impact on development.</p><p>Introduction to ASP.NET MVC 6 is a concise and fast-paced look into the new built-in features and newly consolidated Web API framework in ASP.NET 5 and MVC 6 that will revolutionize how you build web applications. We’ll build a quintessential task application in this course. It will incorporate more than one view, which covers the new features of both ASP.NET 5, MVC 6, and Entity Framework 7, all while building something familiar.</p><p>We’ll start by leveraging the scaffolding framework to build a new clean project, then we’ll break it down so you understand some of the new components as well as the new folder structure. With this foundation in place, you’ll see how to use the built-in dependency injection framework to recover data with the repository pattern. Then we’ll move on to CRUD operations and visually finishing the product offering.</p><p>Next, we introduce Tag Helpers to make the Razor views more concise and will look at how they flow into Validation in MVC 6. We’ll then customize the Identity User model and secure this application using the new Identity Framework. We’ll add a secure Web API so we can use different client-side frameworks such as Angular. Finally, we’ll explore the built-in Logging framework in ASP.NET 5 and see how we can leverage it to meet our needs!</p><p>When you step away from this course, you’ll feel much more comfortable digging into the new ASP.NET 5 framework and its components in MVC 6 and EF 7 with the rebuilt ASP.NET!</p><p><strong>About The Author</strong></p><p><strong>Mike Perrenoud</strong> is a 15-year veteran enterprise application developer and mentor. He’s deployed code for some of the largest Fortune 500 companies in the United States, including GEICO and NASCAR, and has mentored developers all over the globe. Teaching developers the ins-and-outs of ever-changing frameworks is a passion for him, and comes out in his teaching style. He has also written a technical book named UI Router with Mike, which can be found on Amazon.<br></p>", 
    "end_date": null, 
    "title": "Introduction to ASP.NET MVC 6 ", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/795684_9f8e_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-aspnet-mvc-6/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T10:24:36Z"
}