{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Introduction:</strong></p>\n\n<p>Welcome to \"Java: The Complete Foundation\", this course is an introductory course to the Java Programming Language. This course will focus on the Computer Science aspect of programming; however, students will also benefit by learning about Computer Information Systems and how it all relates to object-oriented programming. </p>\n\n\n\n<p>This course will introduce students to the comprehensive fundamentals of programing within the Java atmosphere and will include Graphical User Interfaces (GUI), data structures, applets and other graphical applications and File I/O (Input/Output). In addition, students will also learn the basic fundamentals of programming including variables, loops, arrays and much more! </p>\n\n\n\n<p><strong>Our Teaching Approach:</strong></p>\n\n\n\n<p>dotRoot believes in a \"hands-on\" learning method; which means, students will not only listen to a lecture but also take an active role in homework assignments, class assignments, quizzes and projects. We will provide numerous examples in order to better explain to students the ideology and concepts that must be mastered in order to succeed as a programmer.</p>\n\n\n\n<p>A lot of courses will simply give the student information and expect them to create their own success. That is not how we like to teach students and we also believe that good software tactics and engineering practice will go along way whether you are learning to program for fun, school or for a new career.</p>\n\n\n\n<p>Lectures will teach concepts and give solid examples via the instructor. Class assignments will be hands on with the students as they follow along and program alongside the instructor to receive hands on practice. Students will be encouraged to critically think and become conventional to the resources provided in order to finish their homework assignments and projects. </p>\n\n\n\n<p>There will be a review at the end of each section that will summarize the take-away concepts, as well as, an instructor review of the homework/projects.</p>\n\n\n\n<p><strong>What can you expect as a student?</strong></p>\n\n\n\n<p>As a student you can expect to receive a quality education. With high quality video and sound, this will an easy and fluid learning experience. Our instructors have previous experience as tutors at the college level and have backgrounds within the Computer Science field! This means you will be getting advice and learning from people already professionally involved and successful in the field you are pursuing!We encourage student discussion because the instructor will answer all questions and be your best friend as you take on each section. Questions about assignments or requests for further examples will be handled by the instructor to ensure you are learning effectively. So what are you waiting for? Learn how to program the popular programming language Java and start turning your ideas into money making apps for Android or Apple today!</p>\n\n\n\n<p><strong>Course Updates:<br></strong>The course will come with a huge library of information in the form of lectures and programming activities. It is our goal to engage students by adding content regularly including new programming activities, critical thinking assignments and advanced programming projects. In addition, we will be utilizing Udemy's new Java Exercise feature to bring more activities to the hands of our students who are unable to use our IDE!<br><br>The course comes with over 20 Programming Activities and we currently have over 50 additional assignments being recorded, released and evaluated for upload. By the end of 2016, our goal is to have over 100 Programming Activities for students to engage in addition to our educational lectures!<br><br></p>", 
    "end_date": null, 
    "title": "Java: The Complete Foundation", 
    "price": "20.00", 
    "instructors": "Danny Boehm", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590774_517f_4.jpg", 
    "course_url": "https://www.udemy.com/dotrootjava/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-23T03:47:40Z"
}