{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This <strong>Java course </strong>is <strong>designed for people who don't have any knowledge about programming.</strong> It doesn't matter if you have never written any programs or you have no idea about programming... After my course, all this will change. <strong>You will bust the myth that programming is a difficult thing only for the few!</strong></p><p><strong></strong>Java is one of <strong>the most in demand &amp; highest paying programming language.</strong></p><p>Java's slogan is: \"Write once, work everywhere.\"</p><p>You can use Java to create Android applications, desktop applications, games and much more. </p><p>One of the most popular games called Minecraft was created using Java.</p><p>After this course you will be able to use the advanced components of Java language.</p><p><strong>Java is the base language </strong>for developing Android apps. <strong>You have to learn Java for Android development. </strong></p><p><strong>Save your precious time </strong>by buying this course.<strong> You will learn how to program in a fast and easy way!</strong></p><p>The total length of the course is over 9 hours<strong>! You will learn theory and also gain lots of practice. During the course we will write many programs in Java.</strong></p><p><strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p><p><em>Over 12,000</em> students have enrolled in my courses and all of them are happy. <strong>You will also be satisfied with this course</strong>. If you do not like the course, remember that you can take for <strong>30 days a full refund. I guarantee you satisfaction.</strong></p><p><strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p><p><strong>If you have any questions</strong> regarding the topics covered in this Java course after watching videos <strong>please feel free to ask.</strong> I'm always happy to help.</p><p><strong>Please check out the free lessons! See for yourself the great quality of the course and enjoy it!</strong></p>", 
    "end_date": null, 
    "title": "Java from Beginner to Expert", 
    "price": "30.00", 
    "instructors": "Arkadiusz Włodarczyk", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529444_27d7_2.jpg", 
    "course_url": "https://www.udemy.com/java-from-beginner-to-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T13:07:41Z"
}