{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Source Codes file are only available to paid course users but course is mobile view optimized, so that you can type them out.</strong>  </p>  <p>  \t<strong style=\"\">Java</strong> is the most popular, powerful and highest <strong style=\"\">job oriented programming language</strong> so far. Consulting, not just one or two, in fact any top survey for “<strong style=\"\">Job oriented market for programmers</strong>”, you will find that java is always there in top 3 position. After the <strong style=\"\">implementation of java in android projects</strong>, a new job market got opened up. Java is diverse enough to build <strong style=\"\">Mobile applications, android application, Desktop application </strong>or even<strong style=\"\"> Web application.</strong>  </p>  <p>  \tNow that you have understood the <strong style=\"\">importance of java</strong>, it is a great time to start learning it. This course will give you full knowledge along with <strong style=\"\">practical examples to learn java</strong>. The entire course is focused on <strong style=\"\">practical coding</strong> rather than showing examples on power point. Entire course is divided into various Modules and implementation of java starts from very first lecture. Our <strong style=\"\">Java programming</strong> course assume that you have <strong style=\"\">no prior programming experience</strong> in any language and will teach the installation of java, along with <strong style=\"\">IDE</strong>. A lots of options for <strong style=\"\">Integrated Development Environment</strong> are given but this courses uses <strong style=\"\">Eclipse</strong>, available for both <strong style=\"\">MAC, windows </strong>and<strong style=\"\"> Linux</strong> users.  </p>  <p>  \tAfter learning <strong style=\"\">basics about java programming</strong> vocabulary, we will move on into the <strong style=\"\">concepts of Object oriented programming</strong>. Terms like <strong style=\"\">OOPS, object, classes, inheritance, polymorphism</strong> will be our next target. This java programming course will teach you daily life examples on <strong style=\"\">classes</strong>, <strong style=\"\">extending classes</strong> and various other situations for a programmer working in industry.  </p>  <p>  \tThe precious lectures on <strong style=\"\">Java 8</strong> will guide you in a smooth manner without here and there talks. Java is fast, secure, and reliable. From <strong style=\"\">laptops</strong> to <strong style=\"\">datacenters</strong>, <strong style=\"\">game consoles</strong> to scientific supercomputers, <strong style=\"\">cell phones </strong>to the Internet, Java is everywhere!  </p>  <p>  \tThe course is divided into various modules based on the difficulty level. Our Modules are not just structured according to standard books, but are structured according to the need of <strong style=\"\">concepts by a programmer. </strong>  </p>  <p>  \tOnce you are into the <strong style=\"\">Java certification course</strong>, you will receive a <strong style=\"\">competition certificate</strong> and you will get a chance to appear in <strong style=\"\">certification exam</strong>, <strong style=\"\">without any extra fees</strong>.  </p>", 
    "end_date": null, 
    "title": "Java, from 1st code to expert programmer: Lite Edition", 
    "price": "20.00", 
    "instructors": "Igneus Technologies", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/239326_64d2_3.jpg", 
    "course_url": "https://www.udemy.com/java-online-tutorials/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-08T07:24:26Z"
}