{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Course Description</strong><strong></strong><br></p><p>Learn\n\n the basics of the Java programming language. Understand concepts for loops, while loops, if statements, try-catch statements, basic data types, object oriented programming to include classes, inheritance, encapsulation, sub-classes and other Java concepts.</p><p>A review of basic data types and class usage to include common Java data types.<br></p><p><strong>Build\n a strong foundation of development with Java. This course helps you \nunderstand Java and the Eclipse IDE.</strong><br></p><ul><li>Java 1.7 programming language</li><li>Eclipse 4</li></ul><p><br><strong></strong></p><p><strong>Professional skills and experience from an iOS Architect with over 8 years experience.</strong><br></p><p>Learn\n the fundamentals but also tips and tricks of the experts. Learn about development with the most widely used programming language for commercial web development and one of the most widely used development tool - Eclipse. </p><p>We will walk thru the project setup and \nall required elements to create a basic application</p><p><strong>Content and Overview </strong></p><p>This\n\n course explains key technology concepts of Java and how to use the Eclipse IDE tool.</p><p><br><strong></strong></p><p><strong>What am I going to get from this course?</strong></p><ul><li>Detailed knowledge of how to create Java based application</li><li>Learn how to setup a new project in Eclipse</li><li>Teaching\n by example, several hands on examples showing every detail to the \nsmallest degree from starting a new application on the command line to running in Eclipse.</li><li>Take a look at my other course on Java and iOS to learn deeper insights including API's and MongoDB databases.</li></ul><p><br></p><p>Note:\n Development is all described on a Mac OSX notebook, Windows is not \naddress. Java is a portable language and all the tools described in this\n class are available on Java as well but no intention is made to \ndescribe how to setup them up for use the Windows versions.<br></p>", 
    "end_date": null, 
    "title": "Java fundamentals fast and simple", 
    "price": 0, 
    "instructors": "Tom Jay", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690722_d93c.jpg", 
    "course_url": "https://www.udemy.com/java-fundamentals-fast-and-simple/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T03:36:36Z"
}