{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Willkommen bei Java für Einsteiger!</strong>  </p>  <p style=\"\">  \t  Java für Anfänger ist der einfachste Weg für den erfolgreichen Einstieg in die Software Entwicklung. Du lernst die Sprache Java. Gleichzeitig bilden viele Inhalte die Grundlage in anderen Sprachen. Freu Dich nicht nur Java zu lernen. Entdecke die gesamte Welt der Software Entwicklung für Dich.  </p>  <p style=\"\">  \t<strong style=\"\">Programmieren lernen dauert ewig?</strong>  </p>  <p style=\"\">  \t  Hast Du das Gefühl, Programmieren lernen wird ewig dauern? Ganz sicher nicht! Java für Anfänger ist der Einstieg, spart aber viel Zeit! Wir konzentrieren uns auf wichtige Grundlagen und Konzepte. Es wird bewusst nicht die gesamte Bibliothek von Java besprochen. Du kümmerst Dich nur noch um das Lernen. Die gezielte Auswahl der Inhalte haben wir bereits übernommen.  </p>  <p style=\"\">  \t<strong style=\"\">Bequem vom Sofa aus lernen, ohne dicke Wälzer</strong>  </p>  <p style=\"\">  \t  Dicke Java Bücher sind schön und gut, aber auch sehr eintönig. Gerade für Einsteiger sind sie nur als Referenz sinnvoll. Die gefühlt endlose Informationsflut kannst Du Dir sparen. Lern einfach bequem vom Sofa aus per Video.  </p>  <p style=\"\">  \t<strong style=\"\">Erfolgreich Java lernen mit anderen Einsteigern</strong>  </p>  <p style=\"\">  \t  Du bist nicht allein! Beginne jetzt und lerne gemeinsam mit anderen Studenten Java kennen. So findest Du den Einstieg, lernst wichtige Grundlagen und kannst schnell erste Software entwickeln.  </p>  <p style=\"\">  \t<strong style=\"\">Ein Kurs für Einsteiger</strong>  </p>  <p style=\"\">  \t  Der Kurs vermittelt den Einstieg in die Sprache Java. Er richtet sich speziell an Einsteiger in die Sprache allgemein, ist aber auch für Entwickler geeignet, die bereits Vorwissen mitbringen.  </p>  <p style=\"\">  \t<strong style=\"\">Videos, Übungsaufgaben mit Musterlösungen und ein Abschlussprojekt</strong>  </p>  <p style=\"\">  \tAlle Inhalte werden in Videos gezeigt, erklärt und mit Beispielen untermalt. Zudem gibt es zu jedem Modul Übungsaufgaben mit passenden Musterlösungen. Am Ende gibt es ein umfangreiches Abschlussprojekt, zu dem natürlich ebenfalls eine Musterlösung vorgestellt wird. Alles steht bereit. Jetzt fehlst nur noch Du!  </p>  <p style=\"\">  \t<strong style=\"\">Eine optimale Grundlage</strong>  </p>  <p style=\"\">  \t  Du hast bereits ein konkretes Projekt im Sinn? Vielleicht möchtest Du auch eigene Apps für Android entwickeln? Ist Java eventuell Thema im Studium? Der Professor ist zu schnell? Du hast einzelne Aspekte nicht verstanden? Der Kurs ist die optimale Antwort!  </p>  <p style=\"\">  \t  Im Kurs enthalten sind über 60 Videos mit über 12 Stunden Videomaterial. Du suchst den Einstieg in Java? Den Weg in Android App Entwicklung? Du möchtest ganz allgemein Programmieren lernen? Java ist die optimale Sprache für den Einstieg: Dieser Kurs ist genau richtig für Dich.  </p>", 
    "end_date": null, 
    "title": "Java 8 für Einsteiger: Von den Grundlagen bis zur GUI.", 
    "price": "30.00", 
    "instructors": "Jan Brinkmann", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340492_7bce_4.jpg", 
    "course_url": "https://www.udemy.com/java-fuer-anfaenger/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T12:37:26Z"
}