{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  If you’re a Java programmer who wants to learn the fundamentals and some of the advanced topics of Java persistence with Hibernate, then you’re the one this course is designed for.  </p>  <p>  \t                     We'll be working with<strong> Hibernate 4.3.5.Final </strong>(and applicable updates for <strong>Hibernate 5.0</strong>), and using <strong>Hibernate as a JPA provider</strong> for the most part of this course. You'll be learning the fundamentals and some of the advanced JPA features for <strong>object/relational mapping</strong>, <strong>querying</strong>, <strong>caching </strong>and <strong>performance</strong>.<strong></strong>  </p>  <p>  \t                                                                          Everything important that you're going to experience when you're persisting Java objects with Hibernate is covered during the lectures itself, with the help of <strong>animations </strong>and<strong> stepping through the code</strong>. It will allow you to focus more on the concept and the events happening at runtime <strong>at the very same time</strong> when you're learning a concept, rather than waiting for me go through lengths of coding first before I could show you the same result. And then you practice the same concept with all the <strong>source code provided to you </strong>after each session that has a lab exercise.  </p>  <p>  \t <strong>Having said that</strong>, I will be first taking you to the level where you feel comfortable enough to start programming with Hibernate. <strong>We'll be starting everything from scratch</strong>, do the required installations, <strong>set up the development environment</strong> and learn how to configure logging, for you to be able to see and understand the events taking place at runtime. We'll also <strong>learn how to step through our code at runtime</strong>, for you to be able to see the behind-the-scene story of Java persistence with Hibernate. <strong>And only after that</strong> I'll ask you to start coding yourself. So don't you worry even if you know absolutely nothing about persisting Java objects with Hibernate.  </p>  <p>  \t              If you're asking that what does <em>persisting objects</em> really mean? Don't you worry, we're going to cover even that. So, all you need to learn, enjoy and have a good experience with this course is the <strong>basic understanding of Java</strong>. That's it, I promise.  </p>  <p>  \t                                                                           So, whether you're a beginner or already have some experience with Hibernate, we're going to cover all the grounds for you to <strong>be a confident and competent Hibernate programmer</strong> by the end of this course.  </p>  <p>  \t                                                                    Everything we're going to learn in this course, we'll be <strong>doing it with examples</strong>. And we'll also be discussing the <strong>best practices</strong> to keep in mind when you're working on real world projects.  </p>  <p>  \t                                                                           And if you're already good at Hibernate and JPA, you'll probably find this course to be useful for filling the gaps in your Hibernate and JPA knowledge.  </p>  <p>  \t <strong>Please drop me a message</strong>, in case you need me for anything to get the best out of this course for you.  </p>  <p>  \t            And I might add more lectures to this course to make this course even better for you. So I'll appreciate your feedback, on how to improve this course for you.  </p>  <p>  \t                                                                           And yes, to get the best out of this course, especially <strong>if you're a beginner, please don't jump through the lectures</strong> and complete the <strong>Lab Exercise</strong> of the previous lecture, before moving on to the next one.  </p>  <p>  \t                                                                           And all the video lectures/sessions are in 16:9 HD, so <strong>please watch them in HD</strong>.  </p>", 
    "end_date": null, 
    "title": "Java Persistence: Hibernate and JPA Fundamentals", 
    "price": "30.00", 
    "instructors": "Deshraj Singh Kiran", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242180_db25_46.jpg", 
    "course_url": "https://www.udemy.com/hibernate-and-jpa-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-12T15:59:30Z"
}