{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Java is one of the most important of all computer programming languages. But learning Java can seem like a daunting task. Not any longer! With this course you will learn Java <em style=\"\">step-by-step</em>, from the basics right through to advanced topics. This course is, quite simply, <strong>the fastest, <em style=\"\">easiest</em> way to learn Java programming.</strong>  </p>  <p>  \t     The course instructor <em style=\"\">Huw Collingbourne</em> has already taught over 22,000 people to program on Udemy. This <strong>Java Programming Master Course</strong>  includes over <em style=\"\">85</em> <em style=\"\">videos</em> to explain every topic in detail. All the <em style=\"\">source code</em> is provided in sample programs ready-to-run on a PC or a Mac. And there is even a <strong>125-page eBook</strong>, <em style=\"\">The Little Book Of Java</em>, to provide even more information on all the topics discussed.  </p>  <p>  \t     If you want to master Java programming <em style=\"\">quickly</em> and <em style=\"\">easily</em>, this is course for you.  </p>  <p>  \t<strong>What you will learn</strong>  </p>  <ul style=\"\">  \t<li>The fundamentals of programming – from the ground up</li>  \t<li>How to program Java on a Mac or on Windows</li>  \t<li>The nitty-gritty details of the Java language</li>  \t<li>Advanced topics such as generics, exception-handling, streams and serialization</li>  </ul>  <p>  \t<strong>Who should take the course</strong>  </p>  <ul style=\"\">  \t<li><strong>Beginners </strong>– if you've never coded before, you can learn Java step by step</li>  \t<li><strong>Programmers </strong>switching to Java from some other language such as Ruby, Python, C or C#</li>  \t<li><strong>Cross-platform developers</strong> – Java programs run on all major operating systems</li>  \t<li><strong>Anyone</strong> who wants to make a career in programming</li>  </ul>", 
    "end_date": null, 
    "title": "Java Programming – the Master Course", 
    "price": "35.00", 
    "instructors": "Huw Collingbourne", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421806_31ed.jpg", 
    "course_url": "https://www.udemy.com/java-programming-the-master-course/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-14T13:45:43Z"
}