{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>[ALL  SOURCE CODE IN THE FIRST LECTURE. JUST IMPORT AND TEST!!!]</p><p>[FIRST STEP TO PREPARATION FOR THE ORACLE CERTIFICATION EXAMS: OCJA and OCJP]</p><p>[MOST CHAPTERS HAVE A GREAT EXERCISE AND ITS SOLUTION IN DETAILS]</p><p>This course is for those want to be a Java programmer by following a proven methodology and <strong>one-to-one online version of the lectures  I gave to hundreds of students in several classrooms in  several high-quality training center.</strong></p><p>The biggest missing part for programming students is the exercises that they may work on. <strong>This class has high-quality exercises and their solutions right after the video explanations.</strong></p><p>Here is our agenda:</p><p>0- Why java? What is platform independency? Why it is the most used programming language in professional software development?</p><p><strong>1- Learn programming basics:</strong> </p><p>Using variables, primitive types, mathematical and logical operators.</p><p>Control structures, loops and really high-quality exercises to have hands-on experience.</p><p><strong>2- Learn one dimensional and multidimensional arrays:</strong></p><p>Use this basic data collection and use them inside real-world, fun practices.  Find the longest lost series of an NBA team for instance :)</p><p><strong>3- Learn object oriented programming:</strong></p><p><strong>Learn encapsulation, inheritance, abstraction with great examples and exercises.</strong> <strong>Possibly you wasted lots of time by watching similar unclear explanations so far.  It is time to polish the dust of these concepts.</strong></p><p>4- Learn core types and great utility classes of Java.</p><p>How a professional programmer leverages built-in types and utility classes in real life? StringBuilder, StringBuffer, Date type, String - Date conversions with SimpleDateFormat, Math class, Collections and Arrays class the topics you will learn.</p><p>5- Learn regular expressions. </p><p>Extracting useful data from a string by regular expressions is the greatest feature of all programming languages. But it is the most overlooked one. We don't overlook it. <strong>With two great explanation you will learn how to extract data from a URL and you will validate an email address ( by not Googling and copying of course!!!)</strong></p><p>6- Learn data collections.</p><p>Everyone teaches you what is a list, set and map. How to put data and retrieve it. But this is the top of the iceberg. <strong>You MUST know where to use them, when to leverage the collections. Included exercises are asked in job interviews!!! Hold tight!!!</strong></p><p>7- Learn file operations</p><p><strong>How java communicates with files, read text files, binary files or write to them?</strong> How the content of the file is processed with data collections? You will learn by great exercises.</p><p>At this point you may move on Java EE course for further understanding.</p><p><strong>Have a great experience!!!</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Java 8 Development  with Exercises - Prepare for OCJA OCJP", 
    "price": "35.00", 
    "instructors": "Talha Ocakçı", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597468_206f_4.jpg", 
    "course_url": "https://www.udemy.com/java-8-core-training-/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T15:48:46Z"
}