{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course covers the first of AP Computer Science which includes<strong> complete introduction for Java programming</strong>.  The course is suitable for people who are seeking for a on-line class for introduction to Java programming, who is preparing for <strong>AP Computer Science Exam</strong> in high school and who want to sharpen their knowledge in Java. </p><p> <em>This part 1 course includes elementary programming in Java, program structures, OOP, and basic data structures.</em> This course revolutionize the way computer science is taught.  Instead of teaching textbook chapter by chapter. </p><p> <em>This course will be focused on an <strong>example program</strong> in each lecture.</em>  Lucid big idea in computer science will be introduced by the example program. It is followed by explanation of Java syntax and other language features.  Practice questions, quizzes, and programming exercises will be given thereafter to enhance the understanding of the idea and to help to improve programming efficiency and test scores. </p><p> A<strong> spiral study model</strong> is suggested for student to build up good programming habits and shorten learning cycles in programming. </p><p>I would proudly say that this is one of the best Java Programming course on-line ever. </p><p><strong>In this course, you will get: </strong></p><p><strong>(1) On-line lectures (with .pdf slides)</strong></p><p><strong>(2) sample programs (in Java)</strong></p><p><strong>(3) Quiz and exams (in multiple choice format) with solution</strong></p><p><strong>(4) AP format exam with solution. </strong></p><p><strong>(5) Free-online textbook access.</strong></p><p><strong>(6) Free on-line related information links and book chapters. </strong></p><p><strong>(7) Demo programs</strong></p><p><strong>(8) Lab projects</strong></p><p><strong>(9) Chapter projects. </strong></p><p><strong>(10) Facebook Q&amp;A support and Gmail responses. </strong></p>", 
    "end_date": null, 
    "title": "Java Programming Essentials: AP Computer Science A", 
    "price": "30.00", 
    "instructors": "Dr. Eric Chou", 
    "commitment": "21.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648648_4d07_5.jpg", 
    "course_url": "https://www.udemy.com/ap-computer-science-a-java-programming-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T08:08:27Z"
}