{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>So you need to learn Javascript... and learn it fast!</p><p>Are you a designer who's now adding Javascript to your knowledge arsenal?  Are you a student who needs a fast and high-quality Javascript course?  Are you a traditional developer trying to learn the basics?  Are you applying for a job that requires Javascript.</p><p>Whatever your reason, <strong>Javascript: Crash Course</strong> with Mark Lassoff is the course for you. Mark has taught programming to over 500,000 students-- on Udemy and elsewhere.  </p><p>Javascript is not only emerging as the most important language to know, it's flexibility is unique. With Javascript being deployed on the web, mobile and even the desktop this is the one language that all technologists need to know.  As a Javascript developer you'll find opportunity around every corner!</p><p>This is a crash course-- Meaning it moves quick.  Every meaningful lecture is chock full of information that you can immediately apply to your coding work. Taught by a master instructor, you'll find that <strong>Javascript: Crash Course</strong> is a extremely efficient way to learn.  </p><p>Each lecture course lecture includes the actual code developed by the master instructor during the lecture.  No more staring at a blank screen when figuring out how to practice-- Use the included code as a starting point.</p><p>The course culminates with developing a full quiz application called Trivia, Trivia, Trivia.  You'll learn from building out this application yourself and modifying it and making it your own!</p><p>Join the <strong>over 500,000 </strong><strong>learners</strong> who've enjoyed LearnToProgram courses.  At LearnToProgram, we're teaching the world to code!</p>", 
    "end_date": null, 
    "title": "Javascript: Crash Course", 
    "price": "25.00", 
    "instructors": "LearnToProgram, Inc., Mark Lassoff", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848608_58a9_2.jpg", 
    "course_url": "https://www.udemy.com/javascript-crash-course-learntoprogram/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T21:39:05Z"
}