{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t    Lerne die Grundlagen, Werkzeuge und Funktionen die Du brauchen wirst um voll funktionsfähige Programme mit der populären Programmiersprache Java zu erstellen.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Bilde eine starke Grundlage in Java und Objekt-Orientierter Programmierung mit diesem Tutorial für Anfänger</strong>  </p>  <ul style=\"\">  \t<li>Installation des Java Development Kits</li>  \t<li>Datentypen und Operatoren</li>  \t<li>Objekt- Orientierte Programmierung (OOP), Klassen und Objekte</li>  \t<li>Schleifen und Bedingungen</li>  </ul>  <p>  \t<strong style=\"\">Diese Mächtige Fähigkeit direkt an deinen Fingerspitzen</strong>  </p>  <p>  \t    Durch das Lernen der Grundlagen von Java bekommst Du eine neues Mächtiges Werkzeug. Java ist kostenlos und leicht zu lernen, es hat eine umfangreiche Dokumentation und ist die Basis aller Objekt Orientierten Programmiersprachen.  </p>  <p>  \t    Es gibt viele freie Positionen im Bereich der Java Entwicklung. Außerdem wird Dir die Fähigkeit Java programmieren zu können extrem dabei helfen andere Objekt Orientiere Programmiersprachen so wie C++, C#, Ruby und Pascal in sehr kurzer Zeit zu erlernen.  </p>  <p>  \t<strong style=\"\">Inhalt und Übersicht</strong>  </p>  <p>  \t    Perfekt für die ersten Schritte in der Programmierung, wirst du in diesem Kurs in 85 Lektionen und 8 Stunden Inhalt wirst Du alle Grundlagen der Java Entwicklung lernen und dadurch ein starkes Verständnis der Konzepte der Objekt Orientierten Programmierung lernen. Jedes Kapitel wird mit einer Übungsaufgabe abgeschlossen, sodass Du deine neu erlernten Fähigkeiten direkt anwenden kannst.  </p>  <p>  \t    Wir beginnen mit der Installation des Java Development Kit, danach führe ich Dich durch die Datentypen und Variablen und zeige Dir wie sie funktionieren. Danach wirst Du mit Hilfe von Klassen und Objekten ein hohes Verständnis der Objekt Orientierten Programmierung erhalten.<br style=\"\">  \t<br style=\"\">  \t    Sobald diese Grundlagen gemeistert sind, wird dich dieser Kurs dich durch weitere wichtige Bestandteile der Java Programmierung führen. Dabei wirst du lernen wie du die verschiedenen Schleifen-arten verwenden kannst und sehen wie man ein Programm entwickeln kann, das Entscheidungen trifft. Du lernst dadurch auch komplexere Programme zu schreiben.<br style=\"\">  </p>  <p>  \t    Kursteilnehmer die den Kurs fertigstellen, werden ein umfangreiches Wissen in Java entwickeln, sodass sie eigene nützliche Java Programme entwickeln können.  </p>  <p>  \t    Vollende den Kurs mit zusätzlichen Übungsaufgaben, Codebeispielen und Quizes, die es Dir noch leichter machen dein gelerntes Wissen zu festigen.<br style=\"\">  \t<br style=\"\">  \tSollte Dir der Kurs nicht gefallen, hast Du 30 Tage um die Kosten komplett erstattet zu bekommen.  </p>", 
    "end_date": null, 
    "title": "Java Programmieren für Anfänger - Der Ultimative Java Kurs", 
    "price": "35.00", 
    "instructors": "Denis Panjuta, Panjutorials – Tutorial-Plattform", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/268134_a4ef_2.jpg", 
    "course_url": "https://www.udemy.com/java-programmieren-fur-anfanger-der-ultimative-java-kurs/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-24T16:30:04Z"
}