{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Update</strong>: Added live coding exercises! Put into practice the skills you learn by coding in the browser - Only a handful of Udemy courses have this new feature<em></em></p><p><em>Successfully funded in Kickstarter by 500+ people</em></p><p><strong>Learn Silicon Valley's hottest programming language in a visual and colorful way.</strong></p><p><strong>The goal of this course is to teach you the basics of JavaScript programming</strong>. The focus of the course is mainly on HTML5 game development, but all the concepts we cover are also used in web, mobile app and server-side development.</p><p>J<strong>avaScript is eating the world</strong>. Starting as a web scripting language, JavaScript is now used not just for web development, but also game, mobile app, server and database development.</p><p>This course will teach you how to code in JavaScript from scratch in a visual and colorful way. You will learn to code by <strong>making a mobile game</strong>. That's right! you read well. By making your first mobile game you will be learning JavaScript's core concepts (which also apply to other programming languages!), as opposed to the usual dull style found in all other JavaScript courses.</p><p><strong>This approach to teaching JavaScript has never been tried before and that's why 578 people funded it's creation via Kickstarter.</strong></p><p>Course author <strong>Pablo Farias Navarro</strong> is a developer, educator and entrepreneur. Founder of <strong>ZENVA</strong>, Pablo has authored<strong> over 40 programming courses</strong> in different languages, and has created educational content for companies such as <strong>Amazon</strong> and <strong>Intel</strong>. Pablo has also run live game development workshops at the <strong>HTML5 Developer Conference</strong> in San Francisco.</p>", 
    "end_date": null, 
    "title": "JavaScript Programming: Learn by Making a Mobile Game", 
    "price": "20.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424538_bc1d.jpg", 
    "course_url": "https://www.udemy.com/master-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T03:18:01Z"
}