{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Course Description</strong></p>  <p>Learn all new features of Java 8. It makes code more concise and more readable.</p>  <p>Increase your programming speed and reduce execution time of program.</p>  <p>Anyone who is aware about core Java , can take this course. Each and every point is explained with live programming from vary scratch. So the course is easy to follow for any programmer or learner.</p>  <p>All videos are downloadable so just learn whenever you want to learn !</p>  <p><strong>Content and overview</strong></p>  <p>This course is going to cover all the new features. All yet not completed. Will be completed very soon.<strong></strong></p>  <ul><li>With the help of Default methods, you can add methods in a published interface and it is not going to give any compile time error!</li><li>Lambda expression allows you to make your code more concise and readable.</li><li>To understand Lambda expression, Anonymous class and functional Interfaces can help you. So all this points are covered with live examples.</li><li>Stream API is a great feature available in Java 8.It allows you to do map-filter-reduce processing faster and easily.</li><li>Date Time API has changes the way of working with date time in Java.So come on , use the features available.</li><li>Nashorn and Java Script Engine also explained with examples.</li><li>Oh, that’s not finish yet, inbuilt collections like map are also having so many new methods to work on !</li></ul>", 
    "end_date": null, 
    "title": "Java 8 New Features", 
    "price": "20.00", 
    "instructors": "LetsLearn ITEasily", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756700_b3f5_2.jpg", 
    "course_url": "https://www.udemy.com/java-8-new-features/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T02:46:06Z"
}