{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Java is a very powerful and general purpose programming language. This course starts you on your path to mastering java using a simple yet effective approach. Most of the issues we hear with java is that the technical aspect is hard to understand. Well we break that mold for you. We cover Java Programming and help you become efficient at one of the worlds leading languages. </p><p>Those who want strong knowledge of java can take this course. </p><p><span></span></p><p><strong>How we teach</strong></p><ul><li><strong>L</strong>ectures</li><li>Hands On Assignments</li><li>Quizzes</li></ul><p>We use these methods to give you a university type setting and feel it is the best way for us to teach you these skills. With Lectures we go over the details of java and explain how things work and should be done. In Hands On Assignments we give you homework which helps push it into your mind and stay there. And in Quizzes we makes sure the knowledge has absorbed. We try to give you a University setting with out being in a University.</p><p><br></p><p><strong>This course is divided into three parts </strong></p><ul><li>First we will go over the basic aspects of the language.</li><li>Next we will dive into Object Orientation.</li><li>Finally we will cover some more advanced topics. </li></ul><p><strong>What are the requirements? </strong></p><ul><li>Nothing is pre required, We go over everything with you and cover everything you need to know to learn java. </li></ul><p><strong>What am I going to get from this course? </strong></p><ul><li>Over 50 lectures and Tons of content!</li><li>You will be able to efficiently write Java</li><li>You will be ready to make a choice in life, on whether you want to be a full time developer.</li></ul><p><strong>What is the target audience? </strong></p><ul><li>Anyone who wants a strong understand of Java</li><li>Anyone who wants to move into Java from another category.</li><li>Anyone who does not think they can do it.</li><li>Anyone who enjoys the challenge of learning something new.</li></ul><p><strong>Also the course is still bein built and will be adding code alongs soon</strong></p>", 
    "end_date": null, 
    "title": "Java Programming from Zero to Hero : Java Completed", 
    "price": "20.00", 
    "instructors": "University of Geeks", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676788_5206.jpg", 
    "course_url": "https://www.udemy.com/java-programming-from-zero-to-hero-the-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T20:56:35Z"
}