{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Javascript is the language that modern developers need to know, and know well. Truly knowing Javascript will get you a job, and enable you to build quality web and server applications.<br></p><p>In this course you will gain a deep understanding of Javascript, <strong>learn how Javascript works under the hood</strong>, and how that knowledge helps you avoid common pitfalls and <em><strong>drastically improve your ability to debug problems</strong></em>. You will find clarity in the parts that others, even experienced coders, may find weird, odd, and at times incomprehensible. You'll learn the beauty and deceptive power of this language that is at the forefront of modern software development today.<br><br></p><p><strong>Step by Step quick and easy to learn, get coding JavaScript NOW.</strong></p>\n\n<p>With over 14 years experience in web development, I share my knowledge with you. Course resources and links to get started are provided within this course. Learn how to add JavaScript to your website. How to use JavaScript to output content and make you web pages interactive.</p>\n\n<p>Learn about the DOM (document object model) and the power the is available at your fingertips. Learn about Functions and how to use them for quicker and easier code development. Create interactive buttons for web users. Source code is included step by step guide for beginners or anyone who wants to learn more about JavaScript.</p>\n\n<p>Learn about Event listeners and how important they are to connecting with users of your web content. Using variables effectively to hold value and simplify the code. \nBring your JavaScript to the next level by using events and trigger to execute functions and make calculations.\n</p>\n\n<p>Perfect for beginners to get introduced to JavaScript coding.</p>\n\n<p>Make you pages interactive and your content dynamic. User expect more from websites, they expect interactivity and JavaScript delivers.</p>", 
    "end_date": null, 
    "title": "JavaScript : Learning all the parts of JS", 
    "price": 0, 
    "instructors": "Flipbell IT Studio", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759734_ebe4.jpg", 
    "course_url": "https://www.udemy.com/javascript-tutorial-video/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T15:25:23Z"
}