{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Joomla SEO and Website Speed Optimization Checklist for Web Developers</strong><strong>! </strong></p><p>This course is carefully created so you can learn by doing. Some of the most important things that you should know before enrolling in this course:</p><ul><li><strong>It's created in a checklist form so you can follow the course step by step. Also i have made it easy for you to find and watch again any video in case you have forgotten something.<br></strong></li><li><strong>Every single video (checkpoint) starts with some theory (the why) combined by action (the how)! </strong></li><li><strong>Everything included in this course is updated and valid for 2016 SEO</strong></li></ul><p>As for the content of the course, here it is what you are going to learn:</p><ul><li>What are the search engine ranking factors</li><li>What are the most important SEO issues that you need to take care in order to rank you Joomla website high in search engines</li><li>What affects a Joomla website in order to make it perform really fast (Achieve awesome website loading time!).</li><li>How to deal with SEO matters for any Joomla website (no matter the size of the website)</li><li>All of this in a Checklist way</li></ul><p>The course is sutable for everyone who wants to learn how to optimize a Joomla website for high search engine rankings!  </p><p>In order to be able to follow the course it is recommended to have at least run 1 joomla setup before!</p><p>You can download everything that is needed in this course from the \"<strong>Overview</strong>\" chapter. There you will find links or resources that we are going to use in the course. Some resource will be give in the course that they are going to be used. </p>", 
    "end_date": null, 
    "title": "Joomla SEO and Website Speed Checklist for Web Developers", 
    "price": "30.00", 
    "instructors": "Angelos Giorgis", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649888_cb59_3.jpg", 
    "course_url": "https://www.udemy.com/joomla-seo-and-website-speed-checklist-for-web-developers/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-24T20:38:45Z"
}