{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Learn Laravel 5 developing your own application step by step!</strong></p><p style=\"\"><strong style=\"\">Extra lectures are coming in mid-June!</strong></p><p style=\"\">In this Laravel 5 course we are going to learn how to develop with the latest version of the outmost popular framework.</p><p style=\"\">Gradually we&#039;ll be creating your real life application with admin section. We will start with Laravel 5 installation and then we&#039;ll boost our knowledge implementing all the necessary steps and covering all the important subjects in order to reach our aim in a short time.</p><p style=\"\">During the course we&#039;ll consider controllers, models, views , routes – and as a result, we&#039;ll find out more about the content of the framework. We&#039;ll create controller which is responsible for the work on articles.</p><p style=\"\">What is more, we&#039;ll also learn about how views function by dealing with certain parts of the web page that is title, content, footer – we&#039;ll look how it is organized in Laravel.</p><p style=\"\">Then we&#039;ll be developing our model, creating tables, filling the database table, adding articles, editing articles, making links to them providing the ability to browse these articles on clicking their titles and much more.</p><p style=\"\">At the end of the course it would be possible to add, edit and browse articles!</p><p style=\"\">This course enables students to learn the framework from the very begining. This course is best suited for those who would like to develop with Laravel 5 and familiar with PHP. Even if you are absolutely new to Laravel this course will help you understand how to create Laravel 5 applications.</p>", 
    "end_date": null, 
    "title": "Laravel 5 Step By Step Tutorial", 
    "price": "20.00", 
    "instructors": "PHP - Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508676_3634_2.jpg", 
    "course_url": "https://www.udemy.com/laravel-5-tutorial-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-22T05:17:23Z"
}