{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn PHP, this course covers core functionally of PHP code. <strong> Learn the basics of using PHP code to create web applications.</strong></p><p>From an instructor with over 15 years of PHP application development experience, let us introduce you to using PHP.  <strong>PHP lets you create dynamically generated websites, quickly. </strong> </p><p><strong>PHP is a scripting language that helps people make web pages more interactive, by allowing them to do more things.<br></strong></p><p>PHP is a powerful scripting language that runs on your server and allows you to provide accelerate your web pages.  PHP is the most popular backend code for most websites on the internet you see today.  PHP is everywhere, from large to small sites.  Learning PHP will help you expand what you can do with Websites.</p><p>PHP is designed for large websites, creating a customized user experience, and creating amazing dynamically generated content for users.  PHP can connect database content to your website, gather form information from users and a whole lot more.</p><p>Everything is included, top resoruces, source code and step by step learning.</p><p>I am here to help you learn PHP and ready to answer any questions you may have.</p><p>PHP is an in demand skill, and learning PHP  will help to separate you from the crowd who don't know PHP</p><p>Nothing to lose, there is a 100% Money Back if you don't like it</p><p>Want to know more, what are you waiting for take the first step.  Join now to start learning PHP today.<br></p>", 
    "end_date": null, 
    "title": "Learn PHP Basics", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796358_7cc0_2.jpg", 
    "course_url": "https://www.udemy.com/learn-php-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T22:43:33Z"
}