{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The constant need for smarter technology that learns and grows with you has become crucial, even when it comes to writing software code. This includes programming languages that understand and learn with you as you continue to write. Scala is one of the most impressive programming languages currently in the market.</p>  <p>In order to deal with the shortcomings of Java language and restrictions that did not give the developer to do what he wanted, Scala was invented by Martin Odersky in 2001. According to Scala website, the programming language allows developers to have the best of both worlds – object oriented programming and functional programming.</p>  <p>Scala is a pure-bred object-oriented language, where every value is an object and every operation is a method-call. Additionally, it is also a functional language, with features such as a general preference of immutability over mutation, first-class functions, and a library with efficient immutable data structures. </p>  <p>Scala source code is expected to be compiled to Java bytecode, allowing the code to run on a Java virtual machine. Additionally, Java libraries can directly be used in Scala coding, and vice versa. Similar to Java, Scala uses a curly-brace syntax reminiscent of the C programming language. However, it also incorporates aspects of other programming languages such as Standard ML, Haskell and Scheme. </p>  <p>Because of its flexible nature, Scala can be used for a wide range of tasks including writing small scripts to building large systems. Currently, it has been successfully incorporated for large mission critical systems by companies such as LinkedIn, Intel and Twitter.</p>  <p>With this many benefits, it is no wonder that Scala is currently one of the most demanded programming language that is used for developing. Its flexible nature and its ability to handle large amounts of data in real time, along with being concise and agile is making it a popular choice for open-source and Big Data projects.</p>  <p>Does Scala sound like the perfect solution for your developing needs? Well, look no further. All you need is this intensive course to learn all you need to know about Scala. Our course has been designed by experts to teach you not only the functionality of Scala, but also why you should use Scala, its benefits as well as the basic fundamentals. The course will also cover real world examples that can help you actually incorporate Scala in your daily developing. </p>  <p>Well what are you waiting for? Enroll in this course now and see why a lot of people are shifting from using just Java to Scala for all their programming needs.</p>", 
    "end_date": null, 
    "title": "Learn To Build Scala Apps From Scratch ", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672916_9af5.jpg", 
    "course_url": "https://www.udemy.com/learn-to-build-scala-apps-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T04:02:56Z"
}