{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Welcome to &quot;Learn Java Data Types And Variables From Scratch&quot;!!</p><p><strong style=\"\">IMPORTANT :</strong> This course is the first part of our complete Java course named &quot;<strong style=\"\">Step By Step Java Programming Complete Course</strong>&quot;</p><p>____________________________________________________________</p><p><strong style=\"\">LATEST UPDATES:</strong></p><p><strong style=\"\">&gt;&gt;</strong> A special gift is published for you! You can find it in &quot;Bonus Documents&quot; section!!</p><p>____________________________________________________________</p><p><strong style=\"\">What makes Learn Java Data Types And Variables From Scratch course different?</strong></p><ul style=\"\"><li>Every line of code is described<strong style=\"\"> step-by-step</strong> in each video.</li><li>The subject is told in a <strong style=\"\">clear and simple way</strong>.</li><li>Step By Step Java Programming Complete Course has <strong style=\"\">1280 x 720 HD quality videos with zoom-in/zoom-out, sketch motions, animations and subtitles!!</strong></li><li>We worked with <strong style=\"\">28-year-experienced voice over professional</strong> to dub our videos in his professional recording studio (It&#039;s very important for us to be understandable for you)</li><li>When you buy this Java course,<strong style=\"\"> you will get all of the source codes</strong> that&#039;s developed in training videos!!!</li><li>Although the videos <strong style=\"\">start from scratch and contain every detail needed</strong>, each video is 5 minutes long in average.</li><li>This course is different, because <strong style=\"\">it is important for us</strong> to be available every time you need support in your learning experience with our course. You can e-mail us for any questions or comments on the course subject, we will reply you quickly.</li><li>We use <strong style=\"\">Eclipse IDE</strong> while coding,</li><li>You can use the videos not only for learning, but also as a <strong style=\"\">reference guide</strong> at any time you need.</li><li><strong style=\"\">Learn Java Data Types And Variables From Scratch</strong> is prepared for you to learn Java data types in detail easily without losing any time.</li></ul><p>If you want to take this course, you don&#039;t need to be experienced on programming. You just need to be on basic level on Java programming. For doing this you can look at our beginner level Udemy course named as &quot;First Steps On Java Programming Language&quot;.</p><p>This course starts from the point of explaining &quot;what is data type?&quot;, and &quot;what are the data types in Java?&quot;. We tried to explain every topic starting from a complete beginner&#039;s level.</p><p><strong style=\"\">What you will be able to do after completing this course?</strong></p><ul style=\"\"><li>You&#039;ll be able to use Java data types in your program,</li><li>Java data types are one of the most important components in Java. And after completing this course, you can use them all easily!</li><li>This course contains some important topics about Java types like BigInteger and BigDecimal types, and wrapper classes. After completing this course you&#039;ll be able to use them all!!</li></ul><p>____________________________________________________________</p><p><strong style=\"\">Step By Step Java Programming Complete Course contains:</strong></p><ul style=\"\"><li>Totally about more than 190 HD training videos,</li><li>More than 50 downloadable documents</li><li>More than 20 quizzes</li><li>More than 20 “Do it yourself exercises&quot;</li><li>Special discount coupons for our future courses</li><li>Full source code archive</li><li>High-quality training support</li></ul><p>And this course is the first part of this complete Java course.</p><p>____________________________________________________________</p><p>If you need help about our courses please contact with our premium support via email.</p><p>We wish our lectures will be helpful to you and your career.</p><p>Good luck, and have fun coding!! :)</p>", 
    "end_date": null, 
    "title": "Learn Java Data Types And Variables From Scratch", 
    "price": "20.00", 
    "instructors": "AKINCI Training", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/534602_d529_12.jpg", 
    "course_url": "https://www.udemy.com/learn-java-data-types-and-variables-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T00:24:23Z"
}