{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<a href=\"https://dynamicimagesen-v2b.netdna-ssl.com/product/en_233_java.jpg\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\"></a>  </p>  <p>  \t                                                                  A widely used language for server-side  development, Java is platform independent, so your programming skills  are readily transferable, and comes with extensive libraries for  applications in almost any conceivable field of computing. In this  course expert programmer introduces the  concepts and techniques of Java, as well as the basics of object  orientation. You&rsquo;ll learn the fundamental syntax and how to work with  objects, variables, loops, and libraries, then practice your skills by  creating a pair of programs that work like an instant messenger. This  course is step one on your road to becoming a skilled Java developer  with all the exciting possibilities that offers.  </p>  <p>  \t    In this Course you&rsquo;ll learn the fundamentals of Java, a  popular, platform-independent language for server-side development. The  contents of this course include:  </p>  <p>  \t<strong style=\"\">Learning Java</strong><br style=\"\">  \t    In this chapter you&rsquo;ll be  introduced to Java, learning what it is and what it can do for you.  We&rsquo;ll look at the Java Development Kit and the NetBeans IDE (integrated  development environment) and get started working with Java by coding a  small project.  </p>  <p>  \t<strong style=\"\">Procedural Java</strong> <br style=\"\">  \t    This chapter looks at the basics  of programming in Java. You&rsquo;ll learn about methods, variables, arrays,  loops, conditional statements, and more.  </p>  <p>  \t<strong style=\"\">From Structures to Objects</strong> <br style=\"\">  \t    This chapter begins  by looking at how to create and manipulate user-defined structured data  types in Java, then using that as a basis, moves on to explore objects  and classes.  </p>  <p>  \t<strong style=\"\">More About Objects</strong> <br style=\"\">  \t    In this chapter you&rsquo;ll learn  some more advanced techniques for working with objects. You&rsquo;ll be  introduced to inheritance, abstract classes, and interfaces.  </p>  <p>  \t<strong style=\"\">Java IO Libraries and Exceptions</strong><br style=\"\">  \t    In this chapter you&rsquo;ll learn about the IO libraries provided by Java and how Java handles exceptions.  </p>  <p>  \t<strong style=\"\">Creating a User Interface</strong> <br style=\"\">  \t    This chapter will  explore the basics of creating a Java GUI (graphical user interface).  You&rsquo;ll learn about components, containers, layout managers, and more.  </p>  <p>  \t<strong style=\"\">Creating a Chat Program</strong><br style=\"\">  \t    This chapter will walk  you through the entire process of creating a simple chat program with  Java. We&rsquo;ll create a user interface, add behavior to it, then create a  network client and server and connect the GUI to them.  </p>  <p>  \t    The lessons are wrapped in a feature-rich interface that lets you  jump to any topic and bookmark individual sections for later review.  Full-Screen mode provides a hi-def, immersive experience, and  Watch-and-Work mode shrinks the video into a small window so you can  play the videos alongside your application. Also included are exercise  files that give you an easy way to try out the techniques you learn.  </p>", 
    "end_date": null, 
    "title": "Learn Java From Scratch", 
    "price": "20.00", 
    "instructors": "Skill Pass", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/116920_46b1_6.jpg", 
    "course_url": "https://www.udemy.com/learnjava/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-08T09:19:46Z"
}