{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Do you want to become a programmer?</strong><br style=\"\"></p><p style=\"\"><strong style=\"\">Do you want to be able to create games, work with files, manipulate data, and much more?</strong></p><p style=\"\">If you want to learn programming or are learning Python for the first time, then you&#039;ve come to the right place!</p><p style=\"\">Python is a <strong style=\"\">powerful, modern</strong> programming language that has the capabilities required for experienced programmers, while being easy enough for beginners to learn. Python is a <strong style=\"\">well-developed, stable, and fun</strong> programming language that is suitable for complex and simple development projects. Programmers love Python because of how <strong style=\"\">simple and easy</strong> it is to use.</p><p style=\"\">This course has <strong style=\"\">everything you need</strong> to get started with Python. We&#039;ll first start with the basics of Python - learning about strings, variables, and data types. Then, we&#039;ll move on to loops and conditionals. Once we&#039;re done with that, we&#039;ll learn about functions and files in Python. All of this will culminate towards <strong style=\"\">building a fun game </strong>using the concepts we&#039;ve learned in Python. The entire course is filled with exercises that <strong style=\"\">challenge you</strong> so that you get the best experience possible.</p><p style=\"\">I hope you&#039;re excited to dive into Python with this course. So what are you waiting for?<strong style=\"\"> Let&#039;s get started!</strong></p>", 
    "end_date": null, 
    "title": "Learn Python: Python for Beginners", 
    "price": "20.00", 
    "instructors": "Abrar Hussain", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426570_1b91_3.jpg", 
    "course_url": "https://www.udemy.com/learn-python/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T03:42:40Z"
}