{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This is the most comprehensive yet simple course on python programming language and it concentrates on <strong>Python 3.x which means that what you will learn is relevant</strong> and is not obsolete.</p><p><strong>*************************** No Prior Coding Experience Needed ***************************</strong><strong></strong><br></p><p> This course assumes that you have no programming background. If you have some experience then, it's just a bonus point. <strong>You have never code, have some experience or have a lot of experience any other programming language, this course is one stop place for you.</strong></p><p>Python is one of the most useful programming languages to learn<br>You can back-end of web applications, games, in-house scripts and even build robust test automation framework.</p><p>You will get the <strong>best in class support</strong> from the instructor for any question you have related to the course.<br></p><p>This course is very well structured:</p><ul><li>Each lecture <strong>consist of a video screencast and code files</strong></li><li>There are <strong>quizzes, homework</strong> to test your knowledge</li><li>High focus on practice and asking questions</li><li>You will also learn coding best practices</li></ul><p>In recent years <strong>demand for python</strong> has exploded the job market and there \nare not as many developers as open jobs because not <strong>just development, QA\n industry is rapidly transitioning to python and building automation \ntools</strong><br></p><p> This course is backed by udemy's 30-day money back guarantee.  If you are not satisfied for any reason, you will  get the money back. <strong>In addition to that you will keep all the code files of the course as a thank you for trying out the \ncourse !!!</strong></p><p><strong>What are you waiting for? Enroll today and learn the powerful python language</strong><span></span> !!!<br></p>", 
    "end_date": null, 
    "title": "Learn Python 3 from scratch to become a developer in demand", 
    "price": "20.00", 
    "instructors": "Lets Kode It", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/696044_3010_4.jpg", 
    "course_url": "https://www.udemy.com/learn-python-3-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-13T02:02:13Z"
}