{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t Don&#039;t think that this is a low quality course by seeing the price, Teaching is something i love, i don&#039;t want to quote a high price for sharing my knowledge. Start Learning Now!  </p>  <hr style=\"\">  <p style=\"\">  \t   MongoDB is one of the most popular NoSQL document-oriented database systems amongst programmers due to its ease of use and scalability. Due to its popularity, demand is immensely high for this unique skill. But don’t take my word for it; Indeed has listed MongoDB as one of the most popular job categories on its trusted website.  </p>  <p style=\"\">  \t            For Any Skill Level:  </p>  <p style=\"\">  \t            My course is designed for beginners who have no prior database knowledge - this course has been designed to simplify the most difficult concepts into understandable ideas.  </p>  <p style=\"\">  \t            For those with prior database knowledge in other frameworks, this course will show you how to translate your work into MongoDB  </p>  <p style=\"\">  \t            At the end of the course:  </p>  <p style=\"\">  \t            ➞ You will know how to install MongoDB.  </p>  <p style=\"\">  \t            ➞ You will know the basics of database creation.  </p>  <p style=\"\">  \t            ➞ You will know how to insert, update , delete and perform all major database operations.  </p>  <p style=\"\">  \t            ➞ You will know how to query a document from a MongoDB database.  </p>  <p style=\"\">  \t            ➞ You will understand sorting methods in MongoDB database.  </p>  <p style=\"\">  \t            ➞ You will know basic indexing methods.  </p>  <p style=\"\">  \t            ➞ You will know how to connect your Node.js, PHP and all other applications to MongoDB.  </p>", 
    "end_date": null, 
    "title": "Learn NoSQL Database From Scratch - MongoDB", 
    "price": "20.00", 
    "instructors": "Govinda Sunil", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329572_7d23_4.jpg", 
    "course_url": "https://www.udemy.com/learn-mongodb/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T16:53:45Z"
}