{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">    This course will introduce you to Java</strong>. You&#039;d be able to complete this course in no time and in the most proficient and efficient way. You don&#039;t need to have any prior knowledge of programming before getting started with this course. If you are a complete newbie to the world of programming then you can surely kick start  this course. This course covers all the essential stuff which is required in order to make you understand Java in the easiest way ever. After this course , you would be completely familiar with Java in no time. This course covers all of the easiest methods and techniques with tricks to make you learn Java. You just have to sit and watch the video lectures and in no time with practice examples you would be at the top of Java.  </p>  <p style=\"\">  \t<strong style=\"\">People often ask question , &quot;What makes this course special ? &quot; , Well the answer is that I have used &quot;hands-on&quot; examples in this course , that are playing key role in this course. And no other course in Udemy would have taught such examples ever.</strong>  </p>  <p style=\"\">  \t                              Java is nowadays a very important programming language to learn as almost every third mobile device is using Android which runs Java. Most of the Web Applications are now targeting Java.  </p>  <p style=\"\">  \t<strong style=\"\">This course covers Encapsulation , Inheritance , Methods , Variables , Classes, Object Oriented Programming and Polymorphism quite in detail.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">    So whether  you are a complete newbie or intermediate one , you can take  this course to polish your skills with Java  programming.</strong>  </p>  <p style=\"\">  \t                  If you are seeking a Java developer job but don&#039;t know how to deal with Java then you must grab this course.  </p>", 
    "end_date": null, 
    "title": "Learn Java with hands-on examples - Completely from Scratch", 
    "price": "20.00", 
    "instructors": "Karim Baidar", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234708_f2c4_5.jpg", 
    "course_url": "https://www.udemy.com/learn-java-with-hands-on-examples-completely-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-31T17:27:09Z"
}