{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>NOTE: IF YOU ARE A COMPLETE BEGINNER IN PYTHON-CHECK OUT MY OTHER COURSE \"COMPLETE PYTHON BOOTCAMP\"!</strong></p><p>  \t<strong>This course will give you the resources to learn python and effectively use it analyze and visualize data! Start your career in Data Science!</strong></p>  <p>  \t  You'll get a full understanding of how to program with Python and how to use it in conjunction with scientific computing modules and libraries to analyze data.  </p>  <p>  \tYou will also get lifetime access to over 100 example python code notebooks, new and updated videos, as well as future additions of various data analysis projects that you can use for a portfolio to show future employers!  </p>  <p>  \t  By the end of this course you will:  </p>  <p>  \t- Have an understanding of how to program in Python.  </p>  <p>  \t- Know how to create and manipulate arrays using numpy and Python.  </p>  <p>  \t- Know how to use pandas to create and analyze data sets.  </p>  <p>  \t- Know how to use matplotlib and seaborn libraries to create beautiful data visualization.  </p>  <p>  \t- Have an amazing portfolio of example python data analysis projects!  </p><p>- Have an understanding of Machine Learning and SciKit Learn! </p>  <p>  \tWith 100+ lectures and over 20 hours of information and more than 100 example python code notebooks, you will be excellently prepared for a future in data science!  </p>", 
    "end_date": null, 
    "title": "Learning Python for Data Analysis and Visualization ", 
    "price": "35.00", 
    "instructors": "Jose Portilla", 
    "commitment": "21 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396876_cc92_7.jpg", 
    "course_url": "https://www.udemy.com/learning-python-for-data-analysis-and-visualization/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-18T00:43:49Z"
}