{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>BECAUSE OF 1 NEGATIVE REVIEW WE GOT (SEE BELOW), WE WANT TO EMPHASIZE HERE THAT WE DO READ DOCUMENTATION FROM PHP.NET IN EVERY OTHER LECTURE OF THIS COURSE, BECAUSE IT IS EXCEPTIONALLY WELL WRITTEN AND WE WANT TO TAKE ADVANTAGE OF IT, BUT ALSO WE DO EXPLAIN EVERY SINGLE DETAIL WHEN NEEDED. EVERY PHP CODE EXAMPLE IS EXPLAINED WITH GREAT CARE AND DETAIL. PLEASE WATCH SEVERAL FREE PREVIEW VIDEOS TO SEE HOW IT WORKS AND TO MAKE SURE THIS COURSE SATISFIES YOUR NEEDS. IF YOU LIKE HOW THIS COURSE IS PRESENTED, THEN WE ARE ABSOLUTELY SURE THAT YOU WILL GREATLY BENEFIT FROM TAKING IT! WE WISH YOU GOOD LUCK WITH CONQUERING PHP &amp; THANK YOU!!!<br></strong></p>\n\n<p><strong><br></strong></p>\n\n<p><strong>ATTENTION: YOU CAN GET THIS COURSE FOR FREE! THIS IS A LIMITED OPPORTUNITY, SO IF YOU ARE INTERESTED GO TO WELLEXPLAINED.NET AND FOLLOW THE INSTRUCTIONS. THANK YOU! </strong><br></p>\n\n<p><strong class=\"redactor-inline-converted\">* NOTE: WE ARE UPDATING THIS COURSE REGULARLY TO REFLECT LATEST UPDATES/CHANGES IN PHP 7!</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">* WHEN TAKING THIS COURSE FEEL FREE TO ASK ANY PHP AND WEB-DEVELOPMENT QUESTIONS YOU HAVE. WE WILL BE GLAD TO HELP WITH ALL THE SOLID EXPERIENCE WE HAVE!</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Hey this is <strong class=\"redactor-inline-converted\">WellExplained</strong> and I'm Vladimir Grankin. I have <strong class=\"redactor-inline-converted\">more than 10 years of experience in web development</strong> and I have worked for different web companies during these years. I also have a Bachelor's degree in Computer Science. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What is unique about this course is that it gives you an opportunity to become one of the best, most valuable PHP developers on the market!</strong> <strong class=\"redactor-inline-converted\">Both absolute PHP beginners and experienced developers will greatly benefit from taking this course. We focus on the fundamentals here.</strong> <strong class=\"redactor-inline-converted\">We cover namespaces, operators, types, variables, functions, object oriented programming, constants, expressions, sessions, cookies, exceptions, generators, references, garbage collection and many many more! Hundreds of examples are provided and explained in great detail to make sure you got each and every concept.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>We will extensively use official PHP documentation in our course. In fact it is based on PHP manual. And what is the advantage of using PHP manual? The biggest advantage is that this is the best, most genuine source of documentation and quality information on PHP available and it is also maintained by PHP creators. We will go through all covered concepts in great detail, will examine hundreds of examples provided in the PHP manual for covered topics and will add even more examples to make sure you fully understand the concept. And once you understand the concepts behind the code you write, you become a true professional!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">After completing this course you will be ready to dive into any PHP project imaginable, because it lays very strong foundation</strong>. </p>\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">This course was made with modularity in mind. Here is what you will learn in each module of the course</strong>:<br>    <br><strong class=\"redactor-inline-converted\">PHP Getting Started</strong> - this is a \"high altitude\" introduction to PHP usage. It answers such questions as what is PHP and what can PHP do. Also a simple PHP tutorial is provided, which will show you how to create your first PHP-enabled page! Great for absolute PHP beginners!<br><br><strong class=\"redactor-inline-converted\">PHP Basic Syntax Explained</strong> - this is PHP for beginners. Here we explain the basics, such as what PHP tags are (and how to embed PHP code in HTML documents) and how to use comments in your code.<br><br><strong class=\"redactor-inline-converted\">PHP Types Explained</strong> - this module covers all PHP types: scalar types (boolean, integer, float, string), compound types (array, object) and special types (resource, NULL) - all in great detail, with a lot of examples!<br><br><strong class=\"redactor-inline-converted\">PHP Variables Explained</strong> - in this module we cover variables: from basics to such concepts as variable scope, static variables and variable variables. This module covers everything you need to know about variables in PHP!<br><br><strong class=\"redactor-inline-converted\">PHP Constants</strong> - here we explain a very useful concept - constant. In programming world constants are used everywhere! We explain what constant is and how to use it in PHP.<br><br><strong class=\"redactor-inline-converted\">PHP Expressions</strong> - expressions are the most important building stones of PHP. In PHP, almost anything you write is an expression. In reality only few developers really understand what expression is, but after completing this module you will be one of them and expressions will be totally obvious for you, which will make your programming experience much easier!<br><br><strong class=\"redactor-inline-converted\">PHP Operators</strong> - an operator is something that takes one or more values and yields another value. This is a very important part of any programmin language! All PHP operators (arithmetic, assignment, bitwise, comparison and all other operators) are covered in detail in this module!<br><br><strong class=\"redactor-inline-converted\">PHP Control structures</strong> - we cover all PHP control structures here. You will learn famous \"if\", \"else\", \"while\", \"for\", \"foreach\", \"switch\", \"return\", \"require\" and many more! A LOT of examples are provided to make sure you fully understand the concept!<br><br><strong class=\"redactor-inline-converted\">PHP Functions</strong> - This module is a GEM! It contains everything you need to know about functions, starting from what function is and why should you use it to such PHP constructs as anonymous functions and closures! Also latest PHP 7 type hinting is fully covered! As in all other modules - thorough examples are provided! After finishing this module you will clearly understand all possible kinds of functions used in PHP!<br><br><strong class=\"redactor-inline-converted\">PHP Classes &amp; Objects</strong> - any modern PHP framework extensively uses object-oriented programming (OOP). The goal of this module is to get you ready to dive into any PHP OOP project imaginable! Everything from basics (what is class, object, interface, abstract class and many more) to advanced techniques such as traits and late static bindings is explained in detail. This module alone is a course within a course and it WILL make you a PHP OOP expert!<br><br><strong class=\"redactor-inline-converted\">PHP Namespaces Explained</strong> - this module covers every single namespaces concept and it will make you a namespaces EXPERT!<br><br><strong class=\"redactor-inline-converted\">PHP Errors Explained</strong> - this module will introduce you to errors processing in PHP. It also contains detailed information on errors processing in PHP 7.<br><br><strong class=\"redactor-inline-converted\">PHP Error Handling and Logging</strong> - this module contains in-depth information on what error handling is, how it works and how to use it in PHP 5 &amp; 7.<br><br><strong class=\"redactor-inline-converted\">PHP Exceptions</strong> - this module will make you comfortable with exceptions usage. Everything you need to know about exceptions (both in PHP 5 &amp; 7) is covered in this module (including predefined and SPL exceptions).<br><br><strong class=\"redactor-inline-converted\">PHP Generators</strong> - if you don't know what generators are, don't worry. This module contains EVERYTHING you need to know about generators and how to use them!<br><br><strong class=\"redactor-inline-converted\">PHP Predefined Variables</strong> - In this module you will learn famous GET &amp; POST and what is the difference between them. We also explain here what HTTP is and how it works. This is the glue between web and PHP! After finishing this module you will have a clear picture and great understanding of what happens right after you type web site's address into your browser's address bar and hit enter! You will see how data is exchanged between client (your browser) and server, and what role PHP plays in this process!<br><br><strong class=\"redactor-inline-converted\">PHP References Explained</strong> - PHP references demystified! This module explains what references are and what references do. It also explains how to pass by reference, return by reference and what is the difference between assign by value vs. assign by reference. You will learn such concepts as zval container, symbol table, will learn how PHP manages memory and will understand how exactly variable scope works in PHP. After finishing this module you will have a clear picture of what references are in PHP!<strong class=\"redactor-inline-converted\"><br><br>PHP Garbage Collection Explained</strong> - this module explains what is garbage collection in PHP and how it works!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">PHP Features</strong> - this module will introduce you to such famous (and very important for every web developer) concepts as cookies and sessions! You will learn what they are and when to use them. Also this module covers everything you need to know to upload files using HTML forms and PHP.<br><br><strong class=\"redactor-inline-converted\">PHP Session handling</strong> - every web developer must know how to work with sessions! After finishing this module you will have the best possible understanding of what session is and how to use it in PHP. Every single aspect of session usage is covered in great detail with a lot of in-depth examples!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">PHP PDO (PHP Data Objects)</strong>  - PDO will make your interactions with database much easier and safer! This is a full coverage of PDO abstraction layer with tons of examples! Every single PDO function is covered!<br><br><strong class=\"redactor-inline-converted\">Common PHP Functions</strong> - Some useful functions (such as famous var_dump() and setcookie(), where we explain in detail how to actually use cookies in PHP) are covered in this module.<br><br><strong class=\"redactor-inline-converted\">Migrating from PHP 5.6.x to PHP 7.0.x</strong> - this module contains all you need to know to migrate from PHP 5 to PHP 7!</p>", 
    "end_date": null, 
    "title": "Learn PHP 7 This Way to Rise Above & Beyond Competion!", 
    "price": "20.00", 
    "instructors": "Vladimir Grankin", 
    "commitment": "21 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503406_d979_18.jpg", 
    "course_url": "https://www.udemy.com/learn-php-5-and-7-this-way-to-rise-above-and-beyond-competition/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T23:26:15Z"
}