{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course provides a foundation for a solid understanding of MongoDB's capabilities and functionality. The information in this course culminates an understanding of MongoDB's capabilities and limitations as a database, it's place in Web Application design, and it's integration into web applications built with any server-side or UI framework. Considerations in modeling data for use with MongoDB are discussed, Mongo's powerful querying and aggregation libraries are explored, and it's scaling capabilites are presented in detail. </p><p>Over this course you'll set up a powerful and efficient development environment with an online IDE. You'll then learn to get MongoDB configured and running, how to import data into MongoDB, and how to create new databases. You'll practice using Mongo Query Language commands including CRUD operations and creating indexes for optimizing those operations. This course also introduces you to the powerful MongoDB Aggregation Framework and leads you through detailed examples as you design and build aggregation features into the course's hands-on web application coding project. You'll become familiar with MongoDB's powerful scaling capabilities as this course presents replication and sharding principles, practices, and design guidelines.</p><p>After learning all of the material in this course's lectures and coding all of the hands-on practice tasks, you'll have a complete and working web application, fully integrated with MongoDB and capable of running various queries, aggregation processes, and able to display database output in a non-trivial Javascript UI. You'll walk away from this course with the core knowledge, practice, and confidence necessary to immediately begin working productively with MongoDB in the real world.</p>", 
    "end_date": null, 
    "title": "Learn MongoDB From Scratch", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833196_9baa_2.jpg", 
    "course_url": "https://www.udemy.com/learn-mongodb-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T06:24:44Z"
}