{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em></em></strong><strong>Do you want to become a Python programmer? <em><br></em></strong></p><p><strong><em></em></strong></p><p><strong></strong>Python is one of the most demanded skill sets in today's job market</p><p>Python is a well developed, Reliable and fun to use programming language. If you want to  learn how to program in python programming language,  our Python from Basic to Advance course is the right python training course for you. Learn on your own time and at your own pace, just be sure to learn this stuff. </p><p>In\nthis Python Basic to Advance course, Instructor Shibli Murtaza will teach you\nhow to quickly write your programs in Python! You will also learn how to create\ncustom Functions and how to deal with advance concepts in Python. This\nextensive course covers the fundamentals of Python as well as the more advanced\nconcepts such as handling Errors and Send Email with Python.<br></p><p>Programmers\nlove Python because of how simple and easy it is to use. We will first start\nwith the basics of Python learning about variables, strings, and data types.\nThen, we will move on to conditionals and loops. Once we're done with that,\nwe'll learn about functions and files in Python.<br></p><em></em><p><strong>I\nhope you're excited to Learn Python. So what are you waiting for? <em>Let's get\nstarted!</em></strong><strong></strong><br><strong></strong></p><p><strong></strong><strong></strong><em></em><br><span></span></p><em></em><strong></strong><br><span></span>", 
    "end_date": null, 
    "title": "Learn Python From Basic to Advance.", 
    "price": "25.00", 
    "instructors": "Shibli Murtaza", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690474_c127_2.jpg", 
    "course_url": "https://www.udemy.com/learn-python-from-basic-to-advance/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T18:53:14Z"
}