{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t           Reasons for Joining Today:  </p>  <p>  \t              1) This course uses a feature of Visual Studio called &quot;Step Into&quot;. This  unique way of teaching ensures that you truly understand the code. Each minute of content is designed to give you maximum comprehension. Please note this course focuses on the language features, and not the graphical aspects of windows programming.  </p>  <p>  \t                        1) This is the only course on udemy with many quiz questions so you can feel confident  </p>  <p>  \t                            that you&#039;re truly learning. The quiz questions are taken directly from the code.  </p>  <p>  \t                        2) This course uses the &quot;step into&quot; feature of Visual Studio so you can  develop a truly    deep understanding of the behavior of the code you  write. So you&#039;re also learning debugging, and getting exposure to various really powerful features of Visual Studio.  </p>  <p>  \t                        3) This course uses Visual Studio, which is a powerful and widely used programming environment. Today, knowing a programming language is not enough. You have to see how to make efficient use of the features of the language in a professional development environment.  </p>  <p>  \t                        4) This course is still growing, so your purchase will become more valuable over time.  </p>  <p>  \t                        5) It&#039;s also important to realize that many of the concepts covered here  can be applied directly to such popular languages as C++, C, Java and  JavaScript. Programming is logic, so focus on the logical concepts to see how you can transfer what you learn here to other programming languages.  </p>  <p>  \t                        6) This course covers topics not covered in any other VB.NET course on this site.  </p>  <p>  \t                        7) Once you watch the videos, and complete the quizzes, you&#039;ll have a  solid understanding of the most important aspects of VB.NET, Visual Studio,  and Object Oriented Programming. These are skills you can put on your  resume. An experienced programmer can earn about 45 to 65 dollars per  hour as a consultant with some experience under his belt.  </p>", 
    "end_date": null, 
    "title": "Learn VB.NET with Microsoft Visual Studio 2013", 
    "price": "20.00", 
    "instructors": "Tom Owsiak", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/82328_0f61_5.jpg", 
    "course_url": "https://www.udemy.com/mastervbdotnet/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-22T19:24:06Z"
}