{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>***** Join 6,800 students from <em class=\"redactor-inline-converted\">131 countries</em> in a quick, fun, easy way to learn Java desktop/GUI and Android Mobile App programming! *****</strong></p>\n\n<p>Learn Java the quick, easy way by building <strong>three complete apps</strong> from start to finish, for PC, Mac, or Linux - PLUS, build the same apps for phones and tablets using Java in Android Studio! Code step-by-step with Computer Science Professor and Author, Dr. Bryson Payne. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>High-definition videos and crystal-clear audio, with colorful screencasts</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>You'll start programming in Java in minutes!</li><li>Build a Hi-Lo Guessing Game, a Secret Message Encoder App, and an animated, multi-touch BubbleDraw App to share with your friends!</li><li>Code each app for the command line (text-based) first, then as a windowed desktop application (complete with a graphical user interface/GUI).</li><li>Reuse your Java code to build a native Android mobile app for all three programs!</li><li>Learn Java basics like loops, variables, conditions and classes as you play, all the way through animation, threads, graphics, and advanced GUI mobile apps.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>   <br>All the <em>latest </em>tools for 2016! </strong>Java 8, Eclipse IDE, Android Studio 1.5 and Android SDK version 6.0 - course published in 2016 with all the latest Java development tools for desktop and mobile! </p>\n\n\n\n\n\n<p><strong>** New BONUS Q&amp;A video added this month! See Lecture 43, Free Preview enabled! **</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>For beginners or IT professionals who want to advance!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I designed this programming course to be easily understood by beginners, with example code I use in my college-level courses. My signature \"code and reuse\" style will have even experienced programmers building playable desktop and mobile apps in just a few lessons.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Everything you need to get started right away</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Complete with working code downloads and high-definition videos, you'll be able to work alongside a professor with 18 years' teaching experience and over 30 years of programming knowledge. You'll also receive a Certificate of Completion upon finishing the course.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>No Risk:</strong> Preview three complete apps from Sections 2, 6, and 10 now for FREE, and enjoy a 30-day money-back guarantee after you enroll! And, we've made this course easy to afford so you can get started now!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Praise for <em class=\"redactor-inline-converted\">Learn Java Like a Kid</em>:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>★★★★★ \"<strong>The easiest, clearest path to building your first Java and Android Apps!</strong>\" - <em class=\"redactor-inline-converted\">Jim G., USA</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>★★★★★ \"A Perfect Course\" - </strong>This course was so easy to understand as compared to others that I took. The instructor is very interesting, he provides you the motivation to keep on learning and in fact his teaching exhibits that he has real knowledge of the course. I will advise everyone who wants to learn Java to start up by this course. - <em class=\"redactor-inline-converted\">Issah Mudasir, Egypt</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>★★★★★ \"Fun way to Learn Java!\" - </strong>Bryson Payne does a great job teaching Java. Throughout the course you will build some fun apps. Each app starts off for the console version, moving into the Java Swing to build a GUI app for desktop, then finishes with building the app in Android Studio.<strong>The instructions are easy to understand, and the instructor makes it a fun experience</strong>. A great course for Beginners of any age :). Awesome course! <em class=\"redactor-inline-converted\">- James Conley, Udemy student</em></p>", 
    "end_date": null, 
    "title": "Learn Java Like a Kid: Build Three Desktop and Mobile Apps!", 
    "price": "20.00", 
    "instructors": "Bryson Payne", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635424_4346_8.jpg", 
    "course_url": "https://www.udemy.com/learn-java-like-a-kid/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T01:16:07Z"
}