{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\">Why should I learn C programming?</strong></p><p>C is one of its own type of programming language that shares some of its syntax to all most all programming language on the planet. C gives the basic idea about data types, variable, constants, loops, function and other concepts that will always be there in all programming language. Since C does not come with lots of built in functionality, we will look into how to create those functionality such as upper to lower case conversion. </p><p><strong style=\"\">What will I be able to do after taking this course?</strong></p><p>This course is designed for both MAC and WINDOWS users and there is specific video dealing with setting up environment on both platforms. Just within few videos you will learn to setup environment to code on C. After that we will slowly move on understanding programming 101 that will clear up about advantage of writing codes. After taking this course you can move to any programming language and within few hours of looking at syntax, you will be able to code in any programming language. You will be able to design your own logics to solve the complex problems.</p><p><strong style=\"\">Will I get the access to source code file?</strong></p><p>You asked for it and it is already done. Course already include exercise files used in this course. Exercise files are compatible to both MAC and WINDOWS users.</p><p><strong style=\"\">What if I ran into problems?</strong></p><p>Problem are obvious part of programming and don&#039;t be afraid of them. Problem means that you are trying. If you face any problem, post it in the question/answer section where our team is ready to solve all of your problems. Not only that, we regularly take care that of some topic is creating lot of problems, then there will be new video discussing the solution to that problem.</p><p><strong style=\"\">Let&#039;s get started to learn C and code some great terminal apps!</strong></p>", 
    "end_date": null, 
    "title": "Learn C as your first programming language", 
    "price": "40.00", 
    "instructors": "Igneus Technologies", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/558230_3732_2.jpg", 
    "course_url": "https://www.udemy.com/learn-c-programming-from-scratch-build-20-terminal-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-18T20:07:11Z"
}