{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t                  Woah! Hey there.  </p>  <p style=\"\">  \t                  Happy to have your attention, if only for a brief second.  </p>  <p style=\"\">  \t<strong style=\"\">              &quot;Learn java from scratch with Eclipse&quot;</strong> is designed to be the best first step to launching your career as an Java Developer. It remains to this day the most popular programming language. 3 Billion devices use it. Yes, even that smart phone is in your pocket ..  </p>  <p style=\"\">  \t                      Do you want to earn a good income as a programmer? Or do you need some extra help to succeed in your exam?  </p>  <p style=\"\">  \t                      In this <strong style=\"\">complete Java course</strong> we will teach you all the important concepts which you would also learn  in school. All the videos contain<strong style=\"\"> real world examples</strong>. You will have the opportunity to learn at your own pace. We start super simple. no experience required. And if you need extra help, don’t hesitate to contact me.  </p>  <p style=\"\">  \t                      Every part of this course includes a section with exercises. Herein, we will challenge you with <strong style=\"\">easy and difficult exercises</strong>. This is the ideal way to test yourself. I’ve put all the solutions of these exercises in a “Workspace” for you.  </p>  <p style=\"\">  \t                      You do not need to purchase additional software, in this course we work with the free software package <strong style=\"\">Eclipse</strong>.  </p>", 
    "end_date": null, 
    "title": "Learn Java Programming From Scratch With Eclipse", 
    "price": 0, 
    "instructors": "Tim Mertens", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357084_c064_3.jpg", 
    "course_url": "https://www.udemy.com/learn-java-programming-from-scratch-with-eclipse/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T15:39:52Z"
}