{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Learn C# Programming</strong> (i<em>n ten easy steps</em>) is suitable for <em>beginner </em>programmers. Step-by-step it explains how to write C# code to develop Windows applications using either the <strong>free Visual Studio Community Edition</strong> or a commercial edition of Microsoft Visual Studio (it even explains how to write C# programs using free tools for OS X).<br></p>  <p><strong>C#</strong> is one of the most widely used an important of all modern programming languages. If you need to learn C# <em>quickly</em> and <em>painlessly</em>, this is the perfect course.</p>  <p>You will begin by learning the core features of programming – variables, constants, functions and data types. You will move on rapidly to learn about Object Orientation and the more advanced features of C# and the .NET framework such as file-handling, data-streaming, dealing with exceptions (errors) and overriding methods. Even if you start out as a complete beginner, by the end of this course you will have built a really solid foundation of programming knowledge and skills.</p>  <p>All the <strong>source code</strong> of sample projects is provided ready for you to download, run and modify. The course also includes an <strong>eBook </strong>that provides even more information on the topics being discussed. And there are also interactive <strong>quizzes </strong>to test your understanding of each major topic.</p>  <p>The course instructor, <em>Huw Collingbourne</em>, is Director of Technology with SapphireSteel Software, a company that specialises in Visual Studio development tools (written in C#) for professional programmers.</p>  <p><em>Learn C# Programming (in ten easy steps)</em> is the fastest and simplest way to help you make the move from coding novice to professional programmer.</p>", 
    "end_date": null, 
    "title": "Learn C# Programming (In Ten Easy Steps)", 
    "price": "30.00", 
    "instructors": "Huw Collingbourne", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/14346_9972_8.jpg", 
    "course_url": "https://www.udemy.com/learn-c-sharp-programming-in-ten-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-02-22T18:11:03Z"
}