{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">This is a most comprehensive course on JavaScript. This course starts from scratch and takes care of every advanced module, making it easier to learn. Millions of users use JavaScript on daily basis to develop various websites and application. </p><p style=\"\">JavaScript is quickly becoming the most important and ubiquitous programming language in the world. In this course, students will learn JavaScript—gaining experience with its event listeners and animations. By the end of this course, we will be able to use Javascript to build dynamic websites. We will learn to use the same tools and practices that professional developers use every day.</p><p style=\"\"><strong style=\"\">What will we learn?</strong></p><ul style=\"\"><li style=\"\">In this course, we will build an interactive game, beautiful website, and dynamic front-end framework-backed application.</li><li style=\"\">A language used to make animated, interactive websites</li><li style=\"\">A powerful tool that makes JavaScript even more dynamic and user-friendly</li><li style=\"\">Real World Knowledge Transfer for you to understand the very small details to large complex concepts and developments</li></ul>A Must Learn Course for anyone with or without any technical knowledge.Backed with 30 days Money Back Guarantee, you can be rest assured with this course.", 
    "end_date": null, 
    "title": "Learn JavaScript with 100+ On-Screen Practicals", 
    "price": "20.00", 
    "instructors": "New Boston Academy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496114_e000.jpg", 
    "course_url": "https://www.udemy.com/deciphering-javascript/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-07T17:26:23Z"
}