{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">As mentioned earlier the course price has been increased from $20 now and will keep increasing steadily over period of time. Grab the course before the price goes beyond what you think of spending...</strong>  </p>  <p style=\"\">  \t          Python being one of the more engaging and easy to learn program is &#039;one of the must learn&#039; for any programmer at some point of time. Even though it is not mandatory, it always adds an advantage and value to the programmer. Python Makes it fun and interesting when it comes to programming. That is what we are going to do in this course. Learn the Python Programming Language to make your programming experience a fun and engaging one.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Learn Python Online</strong> with the Pace in which you can make sure to know what you learn and keep remembering them for a long time. Upon completing this course you will be ready to write any basic program in python with no reference needed. A hands on learning experience will make things much more effective.<br style=\"\">  \t<br style=\"\">  \t          Coming to the Course, this course covers Everything you need to know to become a <strong style=\"\">Python Programmer</strong>. Basics are covered right at the beginning in this course. Then the concepts that makes python programming easy is covered to make you understand better. The course starts off with the beginner concepts and then lead into all the required areas of python programming.<br style=\"\">  \t<br style=\"\">  \t          This Course has <strong style=\"\">72 lecture videos of about 6.5 hours</strong> explaining pretty much every required concepts of python. All lectures are explained with with an example program for each concept touched up in the course. The course also features some tips and tricks that can make python programming easy. The course also covers some of the programs that can get you ready for some complex programming in python.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Sections are created in such a way that creates a flow in the learning and not based on a single concept or method in Python Programming. Learning is the Key!!!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">What comes with this course is:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">72 lecture videos with over 6.5 hours of content</li>  \t<li style=\"\">6 quizzes to let you brush up and test the knowledge you gained</li>  \t<li style=\"\">Clear differentiation between Python 2 and Python 3 codes</li>  \t<li style=\"\">Demonstrations on what works and what doesn&#039;t in Python 3 and Python 2</li>  \t<li style=\"\">Some real world usages with concepts explained with a program</li>  \t<li style=\"\">Object Oriented Programming in Python</li>  \t<li style=\"\">Advises and recommendation to continue after completing the course</li>  \t<li style=\"\">No course materials like code files will be provided to encourage you to type and play around with codes manually</li>  </ul>  <p style=\"\">  \t<strong style=\"\">What you can expect from me as a Instructor:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Prompt reply to any questions or issues posted in discussion area in Udemy</li>  \t<li style=\"\">Help you even for the issues you have in python outside of course materials</li>  \t<li style=\"\">Regular updates to course with new content if required</li>  \t<li style=\"\">Open to any criticism on course, course content or myself</li>  \t<li style=\"\">Share and improve ideas with students</li>  </ul>", 
    "end_date": null, 
    "title": "Learn Python 2 and 3 Side by Side", 
    "price": "20.00", 
    "instructors": "Vasandkumar Kunasekaran", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355396_ed25_7.jpg", 
    "course_url": "https://www.udemy.com/learn-python-2-and-3-side-by-side/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T17:27:18Z"
}