{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t   JavaScript is arguably the ideal language to learn programming: it does not require a compiler or a linker, it is simple and easy to use, yet incredibly versatile.  </p>  <p>  \t   JavaScript is the backbone that <strong style=\"\">gives your web pages life and interactivity</strong>, you can use it to <strong style=\"\">customize other applications</strong> that you use such as a word processor or a spreadsheet program, you can also <strong style=\"\">create stand-alone programs</strong>, and even <strong style=\"\">components</strong> and <strong style=\"\">libraries</strong> to be used by other programming languages.  </p>  <p>  \t   This ambitious hands-on, step-by-step course by Dr Alex Davidovic takes you from your first programming steps to becoming a JavaScript guru. The material is divided into bite-size chunks that can be easily completed, and going through half a section every day brings you to the end of the course in two weeks. As soon as you master the programming fundamentals, the building blocks and the ways to control the program flow, you start &quot;swimming in the deep water&quot; and take aim at the advanced concepts such as recursion (a function calling itself) and working with objects.  </p>  <p>  \t   You learn how to <strong style=\"\">animate text and images, capture the mouse, keyboard and other events, and direct the execution of the program</strong> accordingly.  </p>  <p>  \t   As a special project at the end of the course, you get to <strong style=\"\">design a teleprompter</strong>, which comes handy whenever you get to shoot a video for your website. The knowledge that you gain by completing the project is something that you apply to a whole range of software projects.  </p>  <p>  \t The course includes 8 sections, 43 lectures, 35 videos, and the download with the documentation and the source code for all the lectures. Also included is the special bonus that allows you to bring your JavaScript and web-development knowledge to an even higher level after you finish the course, through self-study.  </p>", 
    "end_date": null, 
    "title": "Learn Programming: from Novice to JavaScript Guru in 2 Weeks", 
    "price": "50.00", 
    "instructors": "Dr Alex Davidovic", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/246294_a781_4.jpg", 
    "course_url": "https://www.udemy.com/learnprogramming/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-19T04:46:35Z"
}