{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>* Subtitles available in both English &amp; Spanish *</strong></p>\n\n<p>If you want to learn C++ to advance your skills, gain the ability to program games, and create your own software, you might love this course!  You can go from beginner to advanced with C++ using this course because it has 9+ hours of video that might motivate you to keep learning and programming in C++!</p>\n\n<p>If you have no previous knowledge or experience in C++, you will like that the course begins with C++ basics. If you have learned about C++ already in another course and want to improve what you already know, the course has hours of different topics in C++ with one topic per section. Each section is linked to the previous one in terms of utilizing what was already learned. Each topic is supplied with lots of examples which help students in their process of learning. Also, some new features introduced in C++11 standard are explained. This is what makes it interesting for both beginner and advanced students. Even if you already have a lot of experience in programming in C++, this course can help you learn some new information you had missed before. Upon the completion of this course, you should be able to write programs that have real-life applications.</p>\n\n\n\n\n\n\n\n\n\n<p>What I think is the best about this course is that you can search questions others have had, post your own questions, and get answers to challenges you are currently facing in learning and using C++.  You get paid C++ expert technical support in this course here to answer every single question you ask!</p>\n\n\n\n<p>If you still are not sure about taking the course, maybe these stories of what the students before you experienced will be more useful than whatever I can say about this course. Maybe you can see if you identify with where they were when they took the course and what they got out of it. These are all copied from the course reviews below.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">So far I'm enjoying it, explanation of subjects are easy to understand.</strong><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Very clear instruction, easy to understand.</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Straight forward. No fluff like some other courses where they take you on tangents about stuff you will probably never encounter.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>If you any suggestions you have on topics that have not been covered, you can send them via private message. I will do my best to cover them as soon as possible.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Thank you for reading this. I hope to see you in the course soon and I hope you will enjoy your time learning as much as I have!</p>", 
    "end_date": null, 
    "title": "Learn and Understand C++", 
    "price": "50.00", 
    "instructors": "Ermin Kreponic", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/816356_da9c_3.jpg", 
    "course_url": "https://www.udemy.com/learn-c-plus-plus-from-beginner-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-08T13:02:52Z"
}