{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Course Update:</strong></p>\n\n<p><em>LATEST: Course Updated For June 2016 </em>OVER 1200+ SATISFIED STUDENTS HAVE ALREADY ENROLLED IN THIS COURSE!<br></p>\n\n\n\n<p><strong>...................................................</strong></p>\n\n\n\n<p>Learn the basic concepts, tools, and functions that you will need to build fully functional vision-based apps with LabVIEW and LabVIEW Vision Development Toolkit.</p>\n\n\n\n<p>Together we will build a strong foundation in Image Processing with this tutorial for beginners.</p>\n\n\n\n<ul><li>LabVIEW Vision Development Toolkit Download and Installation</li><li>Basic Feature Detection</li><li>Circle, Color and Edge Detection Algorithms</li><li>Advance Feature Detection - Pattern Matching, Object Tracking, OCR, BarCodes</li></ul>\n\n\n\n<p><strong>A Powerful Skill at Your Fingertips </strong><br>Learning the fundamentals of Image processing puts a powerful and very useful tool at your fingertips. Learning Computer Vision in LabVIEW is easy to learn, has excellent documentation, and is the base for prototyping all types of vision-based algorithms.</p>\n\n\n\n<p>Jobs in image processing are plentiful, and being able to learn computer and machine vision will give you a strong background to more easily pick up other computer vision tools such as OpenCV, Matlab, SimpleCV etc.</p>\n\n\n\n<p><strong>Content and Overview </strong><br><br>Suitable for beginning programmers, through this course of 26 lectures and over 4 hours of content, you’ll learn all of the Computer Vision and establish a strong understanding of the concept behind Image Processing Algorithms. Each chapter closes with exercises in which you will develop your<em><strong> Own Vision-Based Apps</strong></em>, putting your new learned skills into practical use immediately.</p>\n\n\n\n<p>Starting with the installation of the LabVIEW Vision Development Toolkit, this course will take you through the main and fundamental Image Processing tools used in industry and research. At the end of this course you will be able to create the following <strong>Apps</strong>:</p>\n\n\n\n<ul><li><strong>App 1</strong> - Counting M&amp;Ms in an Image,</li><li><strong>App 2</strong> - Color Segmentation and Tracking, </li><li><strong>App 3</strong> - Coin Blob detection</li><li><strong>App 4</strong> - Blob Range Estimation</li><li><strong>App 5</strong> - Lane Detection and Ruler Width Measurement</li><li><strong>App 6</strong> - Pattern or Template Matching to detect Complex Objects</li><li><strong>App 7</strong> - Object Tracking</li><li><strong>App 8</strong> - Bar code Recognition</li><li><strong>App 9</strong> - Optical Character Recognition (OCR)</li></ul>\n\n\n\n<p>With these basic and advanced algorithms mastered, the course will take you through the basic operation of the theory behind each algorithm as well how they applied in real world scenarios. </p>\n\n\n\n<p>Students completing the course will have the knowledge to create functional and useful Image Processing Apps.</p>\n\n\n\n<p>Complete with working files, datasets and code samples, you’ll be able to work alongside the author as you work through each concept, and will receive a verifiable certificate of completion upon finishing the course. We also offer a full Udemy 30 Day Money Back Guarantee if you are not happy with this course, so you can learn with no risk to you. </p>\n\n\n\n<p>See you inside this course.</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Learn Computer Vision and Image Processing in LabVIEW", 
    "price": "20.00", 
    "instructors": "Ritesh Kanjee", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632154_0e37_4.jpg", 
    "course_url": "https://www.udemy.com/learn-computer-vision-machine-vision-and-image-processing-in-labview/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T08:11:28Z"
}