{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>How good are your website charting skills? </p><p>======================================================================</p><p><strong style=\"\">We are in an information overload!</strong></p><p>Big Data is coming and it is coming fast! Sadly, we are experiencing a huge challenge. We are already in an information overload society! And Big Data is pushing it our maximum limits. </p><p>======================================================================</p><p><strong style=\"\">What is the solution to the never ending stream of information? </strong></p><p>Big Data meets Data Visualizors! A data visualizor is someone who can visualize data in such a way that the essential data can be displayed! While Big Data grows the demand for high paying charting specialist that can organize data and present it intuitively will grow along. </p><p>======================================================================</p><p><strong style=\"\">Time is money!</strong></p><p>The solution of Big Data is Data that can be read in a matter of seconds! Every second count and the difference between a 1 minute and 10 seconds is huge! The best thing of all! Big Data is here to stay forever! Charting Specialists will be a forever in demand skill and we just start to experience it! </p><p>======================================================================<br style=\"\"></p><p><strong style=\"\">This course is the starting point a very new carrier in data visualization! </strong></p><p>Big Data specialists will receive an average salary of $100.000. The real challenge is not gathering data but how to make data understandable! </p><p>This course shows you and only SCRATCHES the surface of this fenomenal subject! My passion of charts and data is huge! In this course I am sharing with you things that I truly enjoy. I only wished I knew this years ago! </p><p>======================================================================</p><p><strong style=\"\">We are living in an (digital) information age! </strong></p><p>The age of the mind! The person with the best information will have a great advance! But there is a big change heading toward us! With information overload we do not want anymore too much information! </p><p><strong style=\"\">From (digital) Information age to (digital) Understanding Age! </strong></p><p>The future is now for the experts that can gather the information and make something useful out of it. Information is only power if you understand it! Charts is the most POWERFUL way to do it! </p><p>This course shows you how you can create your charts. Excel is wonderful but it does not support the speed of the web! Chart JS does! This course is really a course that prepares you for the future! How fast can use make information understandable and share it on your webpage quickly? </p><p>======================================================================</p><p>With this course you will succeed and learn how to make wonderful quickly to understand digital charts for your website! </p><p><strong style=\"\">Go ahead and start taking action! Take this course right away and build your future! </strong></p>", 
    "end_date": null, 
    "title": "Line chart JS. Learn how to create and modify from scratch!", 
    "price": "20.00", 
    "instructors": "Nicky Wong", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485614_0760_4.jpg", 
    "course_url": "https://www.udemy.com/line-chart-js/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T21:19:30Z"
}