{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t     Would you ever think that it would be possible to learn just <strong style=\"\">one programming language</strong> ? And to use it to create apps for every desktop operating system and all the leading mobile operating systems ? Well, that language exists, and you&#039;ll be surprised to find out that probably you can already understand it if you can speak English.  </p>  <p style=\"\">  \t     Welcome to Livecode.  </p>  <p style=\"\">  \t     Actually Livecode is not just a programming language; it&#039;s a <strong style=\"\">complete environment</strong> that can be used to develop apps for Mac OS, Windows, Linux, iOS and Android.  </p>  <p style=\"\">  \t  Its programming language differs from many of today&#039;s programming languages because it&#039;s been designed to be very similar to <strong style=\"\">human language</strong>. You probably know most of its syntax since it&#039;s almost identical to the English language: why invent and learn something new when we already have our own human and natural language ?  </p>  <p style=\"\">  \t     This introductory course will explain how to download the free version (yes, it&#039;s free, unless you want to compile and lock up your code !) and use it to create your first hello world stack.  </p>  <p style=\"\">  \t     After that you will create your very own clone of the <strong style=\"\">flappy bird</strong> game in less than the duration of a footbal match and deploy it on Mac, Windows and iOS systems.  </p>", 
    "end_date": null, 
    "title": "Livecode : One code to rule them all", 
    "price": 0, 
    "instructors": "Fulvio Massini", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267372_c0c5_5.jpg", 
    "course_url": "https://www.udemy.com/livecode101/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T14:29:07Z"
}