{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>As technology evolves, the constant upsurge of data creation leads to a continuous need for a more flexible, secure, and reliable manner of storage. Luckily, Cassandra is able to tackle this growing challenge. Cassandra is a flagship NoSQL database with decentralized, fault-tolerant, scalable, and low-cost features making it a core component of cloud computing systems. The more recent versions have greatly improved the security features, making it suitable for use in enterprise systems. When combined with Java and Spring frameworks, Cassandra can formulate a complete application stack thereby enabling efficient data management.</p><p>Mastering Cassandra is a power house of various advanced techniques that will help you become an expert in professional-level data management. This video course starts off from the essence of the web application architecture to setting up the environment with a single-node Cassandra cluster, and takes you to a level where you can build, implement, and secure web applications with ease.</p><p>In this step-by-step guide we will develop a real-time web portal application in Java and Cassandra. We&#039;ll start off by touching upon the major components of a Java web application and the development tools for the course, and then go deeper into the system analysis and designing of the CassandraWebTrader focusing on the Spring Framework projects. Through our journey to master Cassandra, we&#039;ll be working with core concepts and design patterns such as dependency injection, aspect-oriented programming, model-view-controller, and enterprise integration patterns.</p><p>We&#039;ll build the CassandraWebTrader and implement all the typical functions of a web application as well as demonstrate the application of modeling-by-query techniques of Cassandra data modeling. In addition to this, we&#039;ll understand the techniques and design trade-offs of a real-world complex system. Finally, we will ace production configuration of CassandraWebTrader and discuss the most pertinent tasks in our daily operations, such as application monitoring and database backup.</p><p>By the end of this course, you will be armed with all the knowledge needed to efficiently design and develop Java web applications using Cassandra.</p><p><strong style=\"\">About the Author</strong></p><p><strong style=\"\">C Y Kan </strong>is an expert in system integration and has over 20 years of IT experience, including 15 years of project management and architect role in many large-scaled local and international projects. He received a Bachelor&#039;s degree from the University of Hong Kong and later a Master&#039;s degree from the University of Technology, Sydney and holds many professional qualifications such as PMP, PRINCE2 Practitioner, PMI-ACP, Scrum Master, CISSP, ITIL, TOGAF9 and SOA Certified Architect.</p><p>He has expertise and strong interests in software technologies and development methodologies, including enterprise architecture, Service-Oriented Architecture, Java-related technologies, Oracle databases, iOS application development, Scrum, Extreme Programming, agile software development, various kinds of project management methodologies.</p>", 
    "end_date": null, 
    "title": "Mastering Cassandra", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/574366_1b1c_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-cassandra/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-05T07:35:11Z"
}