{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t          Java is an Object Oriented Programming (OOP) language. Mastering OOP concepts and know how to apply those concepts into programming is trivial skills if you want to be a Java professional.  </p>  <p>  \t          In this course you will not only learn all the core OOP concepts, but you will also learn how and when to transfer those concepts into Java language.  </p>  <p>  \t          Also, I will use real life examples with images to demonstrate and elaborate on those concepts so that you can get the best understanding of OOP model.  </p>  <p>  \t          Not only OOP concepts will be demonstrated fully in this course, you will also learning many other useful techniques such as <strong style=\"\">static members, inner class, anonymous class, final modifiers, and effectively final</strong>.  </p>  <p>  \t          I will also show you some new features in Java 8 including static and default methods in interface, and the omitting of the final keyword with the effectively final variable.  </p>  <p>  \t          Also, I will show you with example of one of the most important principles in OOP: the <strong style=\"\">open_closed </strong>principle so that you can see the power of OOP paradigm.  </p>  <p>  \t          And most importantly, I will walk you through step by step in building a complete and working application called <strong style=\"\">Book Management System</strong>. The application includes common features such as<strong style=\"\"> add a new book, update a book based on its ISBN, remove a book based on its ISBN, and list all the book information</strong>.  </p>  <p>  \t<strong style=\"\">How to get the most benefits of the course?</strong>  </p>  <p>  \t      To get the most benefits of the course, before starting the first lecture, I would recommend you to take the <strong style=\"\">50</strong> question quiz first. Don&#039;t worry if you never learned Object Oriented Programming before or you just have a little bit skills. Just do the quiz, if you don&#039;t know, just guess.  </p>  <p>  \t      After finishing the quiz, don&#039;t worry about the results then, just take all lectures one by one to learn all the fundamentals as well as advanced techniques.  </p>  <p>  \t      After completing all the lectures, take the quiz again to see if you make a progress. Each question in the quiz also has explanation for answers, and I would highly recommend you to read these explanations to revise what you have learned.  </p>", 
    "end_date": null, 
    "title": "Mastering Java Object Oriented Programming", 
    "price": "30.00", 
    "instructors": "Sera Nguyen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361980_5cb9_3.jpg", 
    "course_url": "https://www.udemy.com/mastering-java-object-oriented-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T04:46:54Z"
}