{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Swift 2 is a multi-paradigm programming language that has expressive \nfeatures familiar to modern functional languages, and does not forget \nthe object-oriented features of Objective-C. Things that took a block of\n code in Objective-C are reduced to one or two lines in Swift. Swift is \nsaid to be safer, faster, and easier to understand, and has the energy \nof Apple and the open source community behind it.</p>\n\n<p>This course takes you on a journey through a wide array of topics \nthat are crucial to writing top-level Swift code. You will get an \nin-depth view of various core topics such as advanced language features,\n memory management, interoperability, concurrency, advanced debugging, \nalgorithms, and performance optimizations. Last but not least, we’ll \nalso explore Swift design patterns.</p>\n\n\n\n<p>We’ll start by discussing the uniqueness of Swift, what’s new, and \nwhat’s to come. Then we take a look at fast-paced deconstructions of \nadvanced language features such as extensions, generics, protocols, and \nmore. Next we’ll focus on memory management as you learn how to measure \nand address our applications’ memory usage.</p>\n\n\n\n<p>Soon we’ll dive into opening Swift up to Objective-C, C, and even C++\n code and speeding up development by leveraging third-party frameworks. \nWe will then move on to asynchronous programming and concurrency and \nyou’ll see how to process multiple tasks simultaneously.</p>\n\n\n\n<p>You’ll discover how to debug your applications more effectively, \nwhich is one of the key components to becoming a faster developer. As \nthe journey comes to an end, we will take a look at compiler \noptimizations, performance measurements, and algorithms and complexity. \nFinally, you’ll explore specific design patterns can address common \nprogramming problems.</p><p><strong class=\"redactor-inline-converted\">About The Author</strong></p><p><strong>Dan Beaulieu</strong> is a Swift, ASP.NET, and AngularJS application \ndeveloper, who currently works for a company that specializes in \ncustomer management and training software. Dan started his career 10 \nyears ago as a freelance web developer focused on e-commerce using \nASP.NET.</p>\n\n<p>He also holds a degree in Mobile Applications and Development with an\n emphasis on iOS. In his free time, he enjoys writing applications, \nblogging about programming, and hiking with his dog Herzog. He currently\n operates CodeBeaulieu.com, a website featuring tutorials on both C# and\n Swift.</p>", 
    "end_date": null, 
    "title": "Mastering Swift 2 Programming", 
    "price": "45.00", 
    "instructors": "Packt Publishing", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/863494_41fd_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-swift-2-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-30T08:46:40Z"
}