{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t В ходе изучения данного курса вы научитесь проектировать и разрабатывать курс дистанционного обучения в бесплатной системе дистанционного обучения Moodle.  </p>  <p>  \t Курс состоит из нескольких разделов. В первом разделе мы познакомимся с интерфейсов Moodle, научимся создавать курс и изучим основные ресурсы системы – файл, папка, гиперссылка и т.д. Второй раздел знакомит нас с учебным элементом лекция и основными приемами ее создания: добавления веб-страницы, тестов, кластеров. Третий раздел посвящен изучению механизма добавления тестов. Кроме того, в данном разделе мы знакомимся с учебными элементами «задание» и «семинар».  </p>  <p>  \t Четвертый раздел продолжает знакомство с другими учебными элементами Moodle – форумом, чатом, глоссарием и рядом других.  </p>  <p>  \t Пятый, заключительный раздел посвящен администрированию Moodle. Рассматриваются вопросы, связанные с регистрацией пользователей, резервного копирования, работой с ftp и т.д.  </p>  <p>  \t ----------  </p>  <p>  \t In the course you will learn how to design a distance learning course in the free learning management system Moodle.  </p>  <p>  \t The course consists of several sections. In the first section, we look at interfaces Moodle, learn how to create a course and learn the basic system resources – file, folders, links , etc. The second section introduces us to the activity “Lessons” and the basic methods of its creation: add content page, question  page, clusters. The third section is devoted to the study of the mechanism of adding quiz. Furthermore, in this section we meet with activities &quot;Assignment&quot; and &quot;Workshop&quot; .  </p>  <p>  \t The fourth section continues familiarity with other activities Moodle - forum , chat , glossary and some others.  </p>  <p>  \t The fifth and final section is devoted to administering Moodle. The questions relating to the registration of users, backup, work with ftp, etc.  </p>", 
    "end_date": null, 
    "title": "Moodle 2 для новичков", 
    "price": 0, 
    "instructors": "преподаватель Сергей Золотухин", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/231686_dc30_3.jpg", 
    "course_url": "https://www.udemy.com/moodlefree/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-28T10:55:48Z"
}