{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In  this course we aim to help you understand OOP other wise known as Object Oriented Programming better by breaking down the core fundamentals of Object Oriented Programming and using C++ to show you examples. This course starts you out by showing you important aspects of OOP aka Object Oriented Programming that is needed to move on to the deeper Object Oriented Programming side of coding. We cover one of the hardest elements of programming and try to make OOP aka Object Oriented Programming more understandable and easier for you to use. </p><p>Those who want a strong knowledge of OOP aka Object Oriented Programming should take this course. And here is how we do it. </p><p><strong>How we teach</strong></p><ul><li><strong>L</strong>ectures</li><li>Hands On Assignments</li><li>Quizzes</li></ul><p>We use these methods to give you a university type setting and feel it is the best way for us to teach you these skills. With Lectures we go over the details of OOP aka Object Oriented Programming and explain how things work and should be done. In Hands On Assignments we give you homework which helps push it into your mind and stay there. And in Quizzes we makes sure the knowledge has absorbed. We try to give you a University setting with out being in a University.</p><p><strong>What are the requirements? </strong></p><ul><li>Nothing is pre required, We go over everything with you and cover everything you need to know OOP aka Object Oriented Programming. </li></ul><p><strong>What am I going to get from this course? </strong></p><ul><li>Over 30  lectures and Tons of content!</li><li>You will be able to efficiently write and understand OOP aka Object Oriented Programming</li><li>You be able to use an Object Oriented Approach more effectively</li></ul><p><strong>What is the target audience? </strong></p><ul><li>Anyone who wants a strong understand of OOP aka Object Oriented Programming</li><li>Anyone who does not think they can do it.</li><li>Anyone who enjoys the challenge of learning something new.</li></ul>", 
    "end_date": null, 
    "title": "Object Oriented Programming : The Foundation of OOP", 
    "price": "20.00", 
    "instructors": "University of Geeks", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636248_1cfd_2.jpg", 
    "course_url": "https://www.udemy.com/object-orientated-programming-the-foundation-of-oop/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T23:12:06Z"
}