{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>We believe in Content Quality and not Quantity. See it to believe it.</p><p>This course takes you to the journey of learning Object oriented programming using Java in a very interesting and engaging way.</p><p>There are animated concept videos, which are highly engaging to learn concepts quickly in less than 5 minutes with a recap in each video. Hence the whole course can be done in 5 hours.</p><p>The journey start from the very basics and you gradually build on concepts, learn to solve problems and in no time you will be developing some complex applications.</p><p>We believe in learning by doing. There are level based challenges, you keep doing and increase your levels.</p><p>Your journey will have following attractions that you would love to experience:</p><p>1. Concept videos - A concept is white-boarded in an animated way.</p><p>2. Code demonstrations - The concept video is followed by a code demo.</p><p>3. Problem solving  - Throw a use case and then solve it step-by-step. You will create a design and then code it.</p><p>4. Retention quizzes - A good set of questions for revision and retention.</p><p>5. Programming challenges - A programming challenge after every problem solving exercise.</p><p>This course has been developed using the latest learning pedagogy by the team of Subject Matter Experts, Instructional designers, Video and Voice Artists to give the learner an “Aha!” experience.</p><p>We have worked very hard to develop this course and make it interesting and thorough. But we are not adamant and will work on your feedback to improve it further.</p><p>So lets start the interesting journey now.</p>", 
    "end_date": null, 
    "title": "Object Oriented Programming - Using Java", 
    "price": "20.00", 
    "instructors": "Learnobytes !", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764050_c791.jpg", 
    "course_url": "https://www.udemy.com/object-oriented-programming-java/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T06:11:57Z"
}