{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Many a times C++ is regarded as replacement of stdio.h in C by iostream in C++, printf and scanf in C by cout and cin in C++ and structure in C by class in C++...</p><p>My objective is to take this course beyond that myths and impressions...</p><p>Learning C++ is not just syntax but far more than that. OOP was one of the revolution in s/w industry. Here is an attempt is made to teach concepts of C++ from philosophical point of view and not mere from programming perspective. OOP and C++ are the way we live, behave, act, respond, and exist in the world...!</p><p>I am making attempt in the world by mapping each implemented concept of OOP in C++ by mapping it to the real world. May be its first attempt in the world to teach in this manner by using animation.</p><p>Besides all features of C++ with OOP along with step by step explanation, I am going to put here notes, quiz, interview questions along with answers and assignments as well.</p><p>I am sure if understand the basics, Java, PHP, Python would not only be an easy cakewalk but you would love learning those in the future. So I am using numerous day-to-day examples to explain concepts.</p><p>Course starts from basics of programming methodologies and then covers each feature of C++ with detail analysis rather than mere explanation of programs.</p>", 
    "end_date": null, 
    "title": "Object Oriented Programming with C++", 
    "price": "30.00", 
    "instructors": "Bhalchandra Gholkar", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648768_9c0e_3.jpg", 
    "course_url": "https://www.udemy.com/object-oriented-programming-with-cplusplus/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T11:36:26Z"
}