{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course will cover Java SE 7 fundamentals and equip the students to find the OCA Java SE 7 Programmer certification (IZ0-803) easy to pass. This certification is hard to achieve without proper guide and teaching. I have organised this course from top to bottom approach which will start with variables and end with abstracts, interfaces and exceptions handling in java. By the end of this course, students will not just follow any java App course but would fully understand and easy to follow without looking on google for every single error. Remember, looking for errors to resolve takes hours of your valuable time.</p>\n\n<p>This course is designed to point out key points in order to make it easy for students to pass the exam. OCA certificate is an achievement that should proud of and Employers respect the certification and you will be better equipped in the interview.</p>\n\n\n\n<p>The course is organized in a way that you would easily follow without any extra animation to divert your attention from the course materials.</p>\n\n\n\n<p>I have put a lot of questions during the lessons and made it clear why a particular question is right or wrong. Those questions are not easy but tricky and misleading and these are exactly the questions which makes you ready for exam.</p>\n\n\n\n<p>I would strongly recommend that even if you are an experienced java programmer and would like to to pass the exam IZ0-803 then you have to follow each lesson step by step and would notice that a lot of question will be confusing without proper guide-lines and instructions.     </p>", 
    "end_date": null, 
    "title": "OCA Java SE 7 Certification Course Part 1", 
    "price": 0, 
    "instructors": "Asif Muhammed", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/834872_42f1_4.jpg", 
    "course_url": "https://www.udemy.com/oca-javase7-part1/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-28T23:40:36Z"
}