{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Java is the number one development platform in the world, running on 97% of desktops. So it's no surprise that Java programmers are some of the most sought after by employers. A java certification course adds bona fide credentials to any resume, and is a sure fire way to strengthen your skills and employment prospects. </p><p><strong>Everything you need for Java Certification</strong></p><p>Over 62 lectures and 2.5 hours of content</p><p>Solve programming problems using decision constructs, loop constructs, data types, classes, objects and inheritance</p><p>Learn all the necessary content to pass Oracle's Java Programmer Level 1 Exam</p><p>Follow the exact curriculum used by Oracle to prepare developers for the exam</p><p>Gain proficiency at Java from beginner to intermediate levels</p><p>Tackle real world problems both for practice and entry-level employment</p><p><strong>Get Java Certified Now</strong></p><p>This course is specially designed for beginning or intermediate Java programmers, particularly those wishing to pass the Java Programmer Level 1 Certification exam. You'll follow the same curriculum used by Oracle, the biggest computer technology corporation in the world, by working on a different practice file for each section. You will be a coding example with a specific problem to solve, with a separate file revealing the solution. The practice files will not only help you understand the material, but will give you first-hand problem solving experience too.</p><p>You will begin with a brief introduction to the very basics of Java, before moving on to implement simple concepts like variables, data types, etc. As your knowledge strengthens you will move on to object oriented programming, learning about polymorphism and encapsulation and how to apply them to relevant situations. During the final stages of the course, you will learn how Java handles errors and exceptions, how to catch them, how and where they affect your code, and how to resolve them. </p><p>On completion of this course, you will have gained a very valuable and much sought after skill set; solving coding and programming problems by implementing the concepts learned on the course, and more importantly, correctly applying them. You will be fully prepared for your Java SE7 Programmer Level 1 Exam too. </p><p><strong>Tools Used</strong></p><p><strong>Java Development Kit (JDK): </strong>JDK is a software development kit used by the Java platform. Released under public license, it's free to use and comes in a variety of implementations; Java SE, Java EE, Java ME. It runs on Solaris, Linux, Mac OS X or Windows. <strong></strong></p><p><strong>NetBeans IDE: </strong>Netbeans IDE is an open-source integrated development environment. It supports development of all Java application types, running in conjunction with the various implementations of Java Development Kits; Java ME, Java EE, Java SE, and so on. </p>", 
    "end_date": null, 
    "title": "Oracle Java SE7 Programmer Level 1 Certification", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541496_31ac_4.jpg", 
    "course_url": "https://www.udemy.com/oracle-java-se7-programmer-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T18:39:58Z"
}