{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t    Oracle Application Express 4.2 is a diverse web application development tool  that helps you build and deploy applications with the latest techniques in JavaScript. A great way to learn these techniques is by watching how Oracle APEX can be used as a tool to create a feature-rich application that comes together before your eyes in small, concise sections, which gives you a chance to repeat the process yourself.<br style=\"\">  \t    APEX provides you with the ability to extend what&#039;s provided out of the box. This video series shows you how to do this - from using Dynamic Actions, to adding JavaScript declaratively, to using multiple reporting options, and the supplied API, down to securing your application from attacks.<br style=\"\">  \t    Starting by creating a workspace, you will construct a basic application, learn techniques to go beyond the basics, and conclude with the knowledge on how to apply this to your own development environment.<br style=\"\">  \t    You will learn how to create and enhance your own theme template, add JavaScript and visual effects to your application, deploy Dynamic Actions, create and configure an Interactive report, process custom tabular forms, debug an APEX application, and finally expand and secure the development environment, allowing you to enhance your application to a new level in APEX.<br style=\"\">  \t    Oracle APEX Techniques is a course that doesn&#039;t just teach you how to build a simple application, it will provide you with the skills necessary to expand your applications beyond the basics.  </p>", 
    "end_date": null, 
    "title": "Oracle APEX Techniques", 
    "price": "40.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398890_fe7d_3.jpg", 
    "course_url": "https://www.udemy.com/oracle-apex-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T06:37:20Z"
}