{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Do you know those developers who work 10 times faster than average? What takes an average developer one full day will take them less than one hour. Most that that speed can be attributed to technique. </p><p style=\"\">It doesn&#039;t matter if you have to create programs, build pages or do Web Design. It doesn&#039;t matter which language you use; can be Java, C #, Visual Studio, Angular, Jquery, Python, Javascript or C. </p><p style=\"\">Just like a basketball player can become a better shooter by learning the proper techniques, a developer can become a better coder and <strong style=\"\">deliver much value by learning better techniques. </strong></p><p style=\"\">Today more easily and quickly due to Internet, Online Courses, Google and many examples out ther. Even help studying systems engineering, systems analyst, computer science. <br style=\"\"></p><p style=\"\">After learning and working on the basis of this book, most of the newly-hired developers double their productivity in the first month. Many will triple or quadruple their productivity. </p><p style=\"\">Go tell your boss you can deliver twice as many functional points as you do today. Tell your boss that instead of having to hire that other developer, you can get it done. Your boss will love you, and delivering that kind of value that will keep you in demand! </p><p style=\"\">I decided to share this for a couple of reasons. </p><p style=\"\">First, I&#039;m tired of inheriting train wreck projects whose code base is bloated and unsalvageable. There are far more projects in the world than my team can take on so I hope you find this simple approach a compelling alternative to what you are used to read. </p><p style=\"\">Second, we hope we can learn from you. My team members learn every day from each other. With your help, we can learn more, become even better developers, and deliver more value to our clients. </p><p style=\"\">Code simple, </p> Nicolas Rossello", 
    "end_date": null, 
    "title": "Pareto for Developers - How To be an Excellent Programmer", 
    "price": "50.00", 
    "instructors": "Nicolas Rossello", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394242_4b06_6.jpg", 
    "course_url": "https://www.udemy.com/pareto-for-developers-the-missing-link-to-excelence/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T19:49:54Z"
}