{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  You will learn exactly how to develop basic and advanced reports  using the Pentaho Report Designer environment, and a more customized  Java environment. All of the examples are described in-depth with the  source code, and you will be guided through this book using a  step-by-step approach which will ensure that you’ll achieve impressive  results.  </p>  <p>  \t  This course begins with the installation of the Java Development  Environments using practical examples, moving onto how to develop  impressive reports using tables, charts and sub-reports. The examples  will also be shown in a Java development environment for web and swing  applications.  </p>  <p>  \t  Next, you will be taken on a practical run through the Pentaho Report  Designer. This guide will then explain Java APIs, data source  connections, and the development of several chart types. You also learn  the most relevant, advanced features needed to make a report , such as  internationalization, parameterization, interaction, functions,  expressions, sub-reports and cross-tabs, leading the way to the use of  reports in the Pentaho Suite (especially in the Pentaho BI server and  Pentaho Data Integration).  </p>  <p>  \t  With the Pentaho Report basic and advanced development video course,  you&#039;ll get in touch with the enterprise development of reports, with one  of the most relevant Open Source Business Intelligence solutions.  </p>  <p>  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p style=\"\">  \t<strong style=\"\">Francesco Corti</strong> is a Senior Consultant in Business Intelligence and Enterprise Content Management solutions. His experience is based on several enterprise projects for a relevant variety of customers in different fields with different dimensions (from small to big companies). Since 2009, he has been covering the role of PreSale support together with the role of Tech Leader, and since 2012 he began to document some of his open source projects and his experience in a personal blog. Since 2012, he has contributed to Cose Non Javiste; a technical blog written in Italian. Regarding the Business Intelligence skills, Francesco is an enthusiast of the open source solutions with Pentaho Open Source BI, but has relevant experience with SAP Business Objects (today called SAP Business Intelligence), QlikView, Oracle Hyperion, EssBase, and even Microsoft’s BI Platform.  </p>", 
    "end_date": null, 
    "title": "Pentaho Reporting", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366564_c87d_2.jpg", 
    "course_url": "https://www.udemy.com/pentaho-reporting/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T11:25:22Z"
}