{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The world of programming has become almost saturated with different languages, all created for different purposes but developed for use in multiple applications. For those just delving into the world of programming, this can be a little overwhelming. Luckily, there are plenty of languages that are simple to learn, highly versatile to use, and make a great starting point for gaining fluency in the coding universe. Perl is one of those languages, and this course will teach you everything you need to know.</p><p><strong>Perfect Perl the Easy Way</strong></p><p><strong> </strong></p><ul><li>Work with different data types including strings, numbers, variables and user input</li><li>Create and use array, subroutines, hashes, and regular expressions in Perl applications</li><li>Gain a conceptual understanding and practical skills to construct your own levels</li><li>Become competent with the Perl language family and its use in various applications </li><li>Prepare a foundation of knowledge for learning other more complex languages. </li></ul><p><strong>Become an Expert in Perl Applications </strong></p><p><strong> </strong></p><p>This course has been specifically designed for those who have an interest in programming, but still consider themselves to be beginners. Those who already have programming experience but want to learn the basics and concepts of Perl will also find it perfectly suitable. </p><p>With over 70 lectures and 7.5 hours of content, this is a true crash course that will get you up to speed in no time. You'll get to grips with Perl fundamentals and design a Perl application, as well as creating automated applications that do the work for you and advanced text analyser applications. But don't worry – you'll work from the bottom up and progress at a pace that suits you, starting off with installation and creating more complex applications with each stage. </p><p>Along the way you'll pick up various Perl fundamentals like scalar data, arrays and lists, subroutines, input and output, hashes, and regular expressions before tackling your final project. By the end of the course, you'll be ready to use Perl in a wide range of real world applications.</p><p><strong>Tools Used</strong></p><p><strong> </strong></p><p>Perl is a family of general purpose dynamic programming languages originally developed for text manipulation. Over time it has undergone many expansions and revisions and is now used for everything from system administration to GUI development. As it borrows elements from many other programming languages, it makes an excellent jumping-off point for those just beginning to expand their knowledge of programming. </p>", 
    "end_date": null, 
    "title": "Perl Programming for Beginners", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648022_8693_3.jpg", 
    "course_url": "https://www.udemy.com/perl-programming-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T17:21:31Z"
}