{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  Does the idea of learning programming freak you out? Do you feel overwhelmed just thinking about the codes? Well, take a deep breath and relax!  We have made learning one of the most used programming languages easy, right here!  </p>  <p style=\"\">  \t<strong style=\"\">Introducing PHP101 </strong>  </p>  <p style=\"\">  \t  This course will take you by the hand and make learning PHP coding a piece of cake!  </p>  <p style=\"\">  \t  This series will cover a basic introduction into website development with the PHP programming language as well as some more advanced MySQL integration. PHP itself stands for Hypertext Pre Processor.  </p>  <p style=\"\">  \t  PHP is one of the world&#039;s major programming language. Following from other coding languages such as HTML, CSS, learning PHP is a great way to advance into the world of programming. This course is an easy to follow video system of PHP basics. Tutorials include: variables, user signups, forums, and MySQL queries. We also teach you how to look up material from the PHP manual. The PHP manual will allow you to continue learning separately from the videos as well as provide supplemental information not covered.  </p>  <p style=\"\">  \t  This series is quick and does not  go into extensive depth about specific functions or data types and this is where the manual is beneficial. Whether you&#039;re new to programming or have some coding experience, this is the PHP course is for you!  </p>  <p style=\"\">  \t  Throughout completing the series viewers will have the tools needed to build basic and intermediate level websites. The series is split into different parts starting from basics and moving to more complex topics. This structure allows the aspiring developer to learn the core fundamentals of PHP first and work from there.  </p>  <p style=\"\">  \t  Programming is a skill constantly required in the world &amp; through this course you can grasp the basics of one of the top programming languages. Along with learning PHP, you’ll have some basic knowledge of general programming and easily be able to apply what you learn to other languages. Javascript, Java, and other languages are similar in syntax to PHP so the transition to learning another language will be second nature. This course can be for any beginner all the way to experts looking to hone their skills.  </p>  <p style=\"\">  \t  The course contains 20+ videos for you to go through in high definition.  Be it for professional or personal use, programming is a skill that can be used worldwide &amp; in many different departments. While PHP itself is a server side scripting language it can also be used in web development. PHP is a great language for users to pick up after learning the basics of HTML to design sites. It allows you to enhance web pages via scripts such as login forms, forums, picture galleries and much more.  </p>  <p style=\"\">  \t  Learning PHP can open the doors to new freelancing career opportunities online. So come on aboard and get started with PHP101!  </p>", 
    "end_date": null, 
    "title": "PHP 101", 
    "price": "30.00", 
    "instructors": "Earners Classroom", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164774_3a3b_4.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-php-101/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-15T14:44:54Z"
}