{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In this class, we will explore various technical and quantitative analysis techniques using the <strong style=\"\">R</strong> programming language. I will code as I go and explain what I am doing. All the code is included in PDFs attached to each lecture. I encourage you to code along to not only better understand the concepts but realize how easy they are.</p><p><strong style=\"\">What We&#039;ll Cover</strong></p><ol style=\"\"><li>Easily access free, stock-market data using R and the <strong style=\"\">quantmod</strong> package</li><li>Build great looking stock charts with <strong style=\"\">quantmod</strong></li><li>Use R to manipulate time-series data</li><li>Create a moving average from scratch</li><li>Access technical indicators with the <strong style=\"\">TTR</strong> package</li><li>Create a simple trading systems by shifting time series using the <strong style=\"\">binhf</strong> package</li><li>A look at trend-following trading systems using moving averages</li><li>A look at counter-trend trading systems using moving averages</li><li>Using more sophisticated indicators (<strong style=\"\">ROC, RSI, CCI, VWAP, Chaikin Volatility</strong>)</li><li>Grouping stocks by theme to better understand them</li><li>Finding coupling and decoupling stocks within an index</li></ol><p><strong style=\"\">What This Class Isn&#039;t</strong></p><p>This class isn&#039;t about telling you how to trade or revealing secret trading methods, but to show how easy it is to explore the stock market using <strong style=\"\">R</strong> so you can come up with your own ideas.</p>", 
    "end_date": null, 
    "title": "Practical Data Science: Analyzing Stock Market Data with R", 
    "price": "30.00", 
    "instructors": "Manuel Amunategui", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570544_da05_5.jpg", 
    "course_url": "https://www.udemy.com/practical-data-science-analyzing-stock-market-data-with-r/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T23:10:34Z"
}