{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>\nDesigned for the\nstudents with absolutely no programming experience, these sessions will explain not only how to program in Python,\nbut will also explain what programming is, as well as why even\nnon-professionals like to program in the first place.\n<br><br>This 8-hour train will allow new learners to jump start a\nprogramming career by reviewing the main reasons scientists,\nelectrical engineers, and systems administrators love to use Python.\nLearn how to apply fundamental Python keywords so as to collect,\nenumerate, format, and create reports for the most-used collection\ntypes. </p><p>Students will complete keyword\nmastery by exploring a large collection activity-related topics.\nLearn how to create Generators, as well as Context Managers. Discover\nhow to both use as well as extend Python's exception framework.</p><p>\nDiscover how to simultaneously print to the\nscreen, as well as to a file. Practice creating data files that can\nbe opened with Libre Office, Open Office, as well as Microsoft Excel.\nLearn the secret of Google's success by discovering how to index\npopular data formats, as well as binary files.<br>\n</p><p>Gain hands-on\nexperience locating, running, writing and reading information from\ncooperating with external programs. Discover how to write programs\nthat can you can use start and / or automate programs. Learn how to\nboth send and receive information to external programs using\ncross-platform standard input, as well as output streams. Learn how\nto interface with the Python interpreter to run dynamically-created\ncommands, as well as stand-alone scripts.<br><br>\nGain hands-on\nexperience locating, running, writing and reading information from\ncooperating with external programs. Discover how to write programs\nthat can you can use start and / or automate programs. Learn how to\nboth send and receive information to external programs using\ncross-platform standard input, as well as output streams. Learn how\nto interface with the Python interpreter to run dynamically-created\ncommands, as well as stand-alone scripts.</p>", 
    "end_date": null, 
    "title": "Practical Python for Beginners", 
    "price": "50.00", 
    "instructors": "Randall Nagy", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678210_e0bf_3.jpg", 
    "course_url": "https://www.udemy.com/practical-python-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T13:22:06Z"
}