{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Probability in R is a course that links mathematical theory with programming application. Discrete Random Variables series gives overview of the most important discrete probability distributions together with methods of generating them in R. Fundamental functionality of R language is introduced including logical conditions, loops and descriptive statistics. Viewers are acquainted with basic knowledge of numerical analysis.</p><p>Course is designed for students of probability and statistics who would like to enrich their learning experience with statistical programming. While basic knowledge of probability and calculus is useful prerequisite it is not essential. The suggested method of using the course is by repeating the reasoning and replicating the R code. Therefore it is essential for students to download and use R in the course.</p><p>The course consists of twelve short lectures totaling two hours of video materials. Four major topics are covered: Bernoulli distribution (2 lectures), binomial distribution (3 lectures), geometric distribution (3 lectures) and Borel-Cantelli lemma (4 lectures). Eight lectures are presented in a form of writing R code. Remaining four lectures focus solely on theory of probability. </p><p>How is Infermath different from other education channels? It equips students with tools and skills to use acquired knowledge in practice. It aims to show that learning mathematics is not only useful but also fun and inspiring. It places emphasis on equal chances in education and promotes open source approach.</p>", 
    "end_date": null, 
    "title": "Probability in R. Discrete Random Variables", 
    "price": 0, 
    "instructors": "Pawel Dudko", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776890_ecb0_4.jpg", 
    "course_url": "https://www.udemy.com/probability-in-r-discrete-random-variables/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-28T15:24:41Z"
}