{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Este curso introduce las novedades de Java 8, principalmente las nuevas interfaces funcionales y las lambda expression.</p>\n\n<p>El curso está compuesto de lecciones cortas y centradas en un tema concreto. ¡Ya es bastante complejo asimilar todas las novedades de Java 8 como para aprender cinco cosas al mismo tiempo!</p>\n\n\n\n<p>Cada tema, pues, introducirá un nuevo concepto, usando lo aprendido anteriormente y ofreciendo ejercicios para asimilar el contenido.</p>\n\n\n\n<p>Y hablando de ejercicios .... Por favor, ¡hazlos!</p>\n\n\n\n<p>Los ejercicios son muy prácticos: importa el proyecto en el Eclipse y el mismo editor te indicará cuando los has realizado correctamente o no. ¡Imposible más comodidad!</p>\n\n\n\n<p>Recuerda: La teoría sirve para poder hacer los ejercicios. <strong class=\"redactor-inline-converted\">Solo en la práctica es cuando se produce el nuevo conocimiento</strong>.</p>\n\n<p>Así pues: empieza con los videos y después de cada tema, súbete las mangas y ¡empieza a trabajar con las lambda expressions!<br></p>\n\n\n\n<p>Recuerda:</p>\n\n\n\n<ol><li>Con la compra, tienes 30 días para probar el curso. Si no cumple tus expectativas puedes cancelarlo sin dar ninguna explicación. Se devuelve el 100% del importe.</li><li>El pago incluye el acceso a todas las lecciones de por vida. También a actualizaciones que se vayan realizando</li></ol>", 
    "end_date": null, 
    "title": "Programación funcional en Java 8 con Lambdas y Streams ", 
    "price": "25.00", 
    "instructors": "Domingo Sebastian", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/769366_5fc0_2.jpg", 
    "course_url": "https://www.udemy.com/lambda-java-8/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-21T08:07:29Z"
}