{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Programmieren lernen per Video! Mit diesen Python-Kurs von Thomas Theis gelingt es garantiert. Wie kein Zweiter versteht es der erfahrene Programmiertrainer, besonders Einsteigern die Programmierung auf lehrreiche und unterhaltsame Weise beizubringen. Gemeinsam mit ihm erschließen Sie sich Python von Grund auf und lernen alle wichtigen Sprachelemente kennen. Schon bald haben Sie Ihre ersten eigenen Programme erstellt, verwalten Datenbanken oder steuern den Raspberry Pi. Ein Training, das Wissen vermittelt und dabei richtig Spaß macht! Mit vielen Übungen und Musterlösungen. Bestens geeignet für Jung und Alt.</p><p style=\"\">- Programmieren lernen ohne Vorwissen</p><p style=\"\">- Funktionen und GUI programmieren</p><p style=\"\">- Inklusive Quellcode für Python 3 und Python 2</p><p style=\"\">Thomas Theis, Dipl.-Ing. für Technische Informatik, verfügt über langjährige Erfahrung als EDV-Dozent, unter anderem an der Fachhochschule Aachen und als Ausbilder für Fachinformatiker. Er leitet Schulungen zu Python, C/C++, Visual Basic und Webprogrammierung. Als langjähriger Programmiertrainer weiß er um die vielen Stolperfallen, mit denen Einsteiger konfrontiert werden. Seine Spezialität sind daher besonders anschauliche Beispiele aus der Praxis, die zum Nachprogrammieren einladen.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Programmieren lernen mit Python", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455284_48cd.jpg", 
    "course_url": "https://www.udemy.com/programmieren-lernen-mit-python/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T00:03:31Z"
}