{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Programming is not only about learning and writing code, it is an <strong>art</strong>. It helps you, as a programmer to think differently and build a problem solving attitude within you. A simple program can be written in many ways if given to multiple developers. Thus the need to best practices come into picture. It helps standardize products and help reduce future maintenance cost.</p><p><br></p><p>Learn from this course on various tips and techniques one programmer can follow to practice. The course will also help clients to understand the importance of enforcing standard practices.<br></p><p><br><strong></strong></p><p><strong>What are included in the course? Why take this course?</strong></p><p><br></p><p>What are the best practices writing the code? What are the best practices while designing your program? Why standards needs to be followed? The answers are provided in the course.</p><p><br></p><p>Programming Best Practices course offers video lectures on following topics:</p><ul><li>Why do a programmer need to follow standard practices?</li><li>Why readability is important?</li><li>Tips to make you code more readable and maintainable?</li><li>Programming Styles to adopt while coding.</li><li>Why maintainability is essential aspect while writing software code and how to improve maintainability?</li><li>Design technique to keep in mind.</li></ul><p><span></span></p><p><span></span></p>", 
    "end_date": null, 
    "title": "Programming Best Practices", 
    "price": 0, 
    "instructors": "Amalendu Kundu", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777640_f5cb_4.jpg", 
    "course_url": "https://www.udemy.com/programming-best-practices/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T11:26:11Z"
}