{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"> Con &quot;Programación RsLogix 5000 Plataforma Logix&quot; aprenderas todo acerca de la programación de controladores para automatización de la marca Allen Bradley, para las plataformas ControlLogix y CompactLogix, la siguiente generación de PAC&#039;s (Programmable Automation Controller), llega al siguiente Nivel de Programación. </p><p style=\"\"> Este curso esta diseñado para que particulares, estudiantes, profesionistas que con algunos conocimientos en programación de PLC&#039;s y cuestiones básicas de programación en escalera.</p><p style=\"\"> Alguna vez te has preguntado como funcionan las líneas de producción de una fabrica, como es posibles crear productos en masa, miles de productos ? </p><p style=\"\"> El cerebro de cualquier línea de producción de una fábbrica es un PLC (Programable Logic Controller) o PAC&#039;s (Programmable Automation Controller - Nueva Generación) por sus siglas en ingles, un elemento indispensable para llevar a cabo cientos de tareas a la vez y de manera automática para controlar procesos a nivel industrial.</p><p style=\"\"> Este curso cuenta con decenas de lecciones y examenes divididos en diferentes secciones. Cada sección te lleva a un nuevo nivel de conocimientos. Comenzamos desde lo más básico que es la instalación del software y herramientas. </p><p style=\"\"> Hasta cubrir de una manera práctica los comandos más utilizados y necesarios para realizar practicamente cualquier tipo de secuencia, lógica y algoritmo de programación en diferentes tipos de lenguaje normalizado por la IEC (Comisión Electrotécnica Internacional).</p><p style=\"\"> Al final de las secciones tienes examenes que te permitiran reafirmar los conocimientos adquiridos en las lecciones, esto es muy importante para saber si el curso esta cumpliendo con su objetivo. </p><p style=\"\"> Esta plataforma es muy flexible en la cual aprenderás y podrás crear tus propios comandos y tipos de datos para que los utilices en tus proyectos de automatización y realices estos con la mayor facilidad y rápidez posibles.</p>", 
    "end_date": null, 
    "title": "Programación RsLogix 5000 Plataforma Logix", 
    "price": "40.00", 
    "instructors": "Luis Cruz", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579728_135f_4.jpg", 
    "course_url": "https://www.udemy.com/programacion-rslogix-5000-plataforma-logix/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T03:20:54Z"
}