{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\">As an entrepreneur have you experienced any of the following symptoms?</strong>  </p><ul style=\"\">  \t<li><strong style=\"\">Spending too much money in development</strong> and you don&#039;t even understand what the developer is talking about.</li>  \t<li>Every time you need something fixed in your website (like adding a new link or changing an image) you need to wait weeks and spend a lot of money to get it done.</li>  \t<li>You can&#039;t move forward with your business idea because you don&#039;t have a technical co-founder and you don&#039;t know how to code.</li>  </ul>  <p>  \t    If the answer is yes let me say that you <strong style=\"\">are not alone</strong>. I work with many entrepreneurs and I hear these complaints every single week. The causes of this problem as:  </p>  <ul style=\"\">  \t<li><strong style=\"\">All companies, no matter their size and industry, need development</strong>. From a simple website that shows who they are and what they do, to more complex solutions such as mobile apps and information systems.</li>  \t<li><strong style=\"\">Developer as expensive and scarce</strong>. But you probably know this already :)</li>  \t<li>They say <strong style=\"\">Programming is the new Math</strong> as it is an essential skill to get around nowadays and in the works that&#039;s taking shape, but you weren&#039;t taught how to program at school.</li>  </ul>  <p>  \t    At <strong style=\"\">ZENVA</strong>, we&#039;ve decided to tackle this problem and <strong style=\"\">bring you a solution</strong> by creating our <strong style=\"\">Programming for Entrepreneurs</strong> course series, aimed to give entrepreneurs the basic programming skills and knowledge so that they have higher chances of success with their business ideas.  </p>  <p>  \t    In <strong style=\"\">Programming for Entrepreneurs / HTML &amp; CSS</strong> you&#039;ll learn basic web development concepts and skills that will allow you to build <strong style=\"\">simple websites</strong>, <strong style=\"\">modify existing websites</strong> and create <strong style=\"\">interactive prototypes of your business idea</strong> so that you can use it as a communication tool with your developer, customers and investors.  </p>  <p>  \t    In this course, just like in all courses by <strong style=\"\">ZENVA</strong>, we&#039;ll follow a project-based approach. Through out the course you&#039;ll be building a &quot;Metro style&quot; homepage that looks great in a desktop computer and in a mobile phone.  </p>  <p>  \t    What we cover in this course:  </p>  <ul style=\"\">  \t<li>Benefits of learning the basics of web development for an entrepreneur.</li>  \t<li>Basic web development concepts you need to know.</li>  \t<li>HTML from the very beginning. We&#039;ll go through the most important tags.</li>  \t<li>Creating titles, paragraphs, containers, lists.</li>  \t<li>Adding links and images.</li>  \t<li>Tables.</li>  \t<li>Forms in HTML, including HTML5 semantic input fields</li>  \t<li>Structure of a HTML document.</li>  \t<li>CSS - What is it and how to include it in your website?</li>  \t<li>Selecting elements with CSS.</li>  \t<li>The Box Model.</li>  \t<li>Creating a tile-based Metro style page.</li>  \t<li>Using floating elements to create responsive pages.</li>  \t<li>Styling of lists, fonts, tables.</li>  </ul>  <p>  \t     Don&#039;t forget to checkout the other courses made by ZENVA:  </p>  <ul style=\"\">  \t<li>iOS and Android HTML5 Apps for Beginners</li>  \t<li>Mobile HTML5 Game Development for Beginners</li>  \t<li>Create a HTML5 Game from Scratch</li>  \t<li>Wordpress Plugin Development for Beginners</li>  \t<li>BlackBerry 10 Apps with HTML5</li>  \t<li>Android App Development by Example</li>  \t<li>Introduction to Web Application Development with Symfony</li>  </ul>", 
    "end_date": null, 
    "title": "Programming for Entrepreneurs - HTML & CSS", 
    "price": "20.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/81368_2296_5.jpg", 
    "course_url": "https://www.udemy.com/programming-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-21T02:11:34Z"
}