{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Python è un linguaggio di programmazione orientato agli oggetti, che si presta ad una molteplicità di usi: da semplici script a complesse applicazioni web. Python unisce caratteristiche molto potenti ad una sintassi semplice ed intuitiva, che rendono il codice pulito e di facile leggibilità.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Inoltre è particolarmente consigliato per neofiti o studenti al loro primo approccio con la programmazione:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">La modalità interattiva permette agli studenti di eseguire l&#039;interprete su una finestra ed avere il codice sorgente in un&#039;altra. Questa caratteristica è utile sia per apprendere nuove funzionalità mentre si programma, sia per testare parti di codice separatamente, il che costituisce un vantaggio anche per I programmatori esperti.</li>  \t<li style=\"\">L&#039;ampia libreria standard permette di lavorare con applicazioni realistiche anche nelle prime fasi dell&#039;apprendimento.</li>  \t<li style=\"\">Python gode di un&#039;estesa documentazione, facilmente accessibile.</li>  \t<li style=\"\">La tipizzazione dinamica permette di trascurare complessità addizionali e concentrarsi sugli aspetti fondamentali.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">In questo corso di base sarete introdotti a concetti fondamentali di programmazione e sarete presto in grado di eseguire il vostro primo programma in Python. Partiremo dalle basi fino ad arrivare agli aspetti più avanzati. I seguenti temi verranno trattati:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Vi verrà mostrato come installare Python o come accedere alla versione in uso nel caso in cui fosse preinstallato (Linux o Mac OS).</li>  \t<li style=\"\">Acquisirete subito dimestichezza con tipi di dato numerico e stringhe di caratteri.</li>  \t<li style=\"\">Passerete poi a concetti fondamentali come enunciati condizionali, strutture di controllo e strutture iterative.</li>  \t<li style=\"\">Verranno presentati aspetti relativi alla stesura del codice, come il corretto inserimento dei commenti e l&#039;indentazione.</li>  \t<li style=\"\">Imparerete come gestire eccezioni ed individuare errori di sintassi</li>  \t<li style=\"\">Verrete introdotti ai tipi di dato nativi di Python, come le liste, le tuple e i dizionari.</li>  \t<li style=\"\">Definirete le vostre funzioni e imparerete a riconoscere l&#039;ambito di visibilità delle variabili.</li>  \t<li style=\"\">Definirete le vostre classi e verrete introdotti ai metodi speciali, nonché a concetti quali l&#039;ereditarietà.</li>  \t<li style=\"\">Imparerete a gestire l&#039;input/output di file di testo e file binari.</li>  \t<li style=\"\">Infine utilizzerete moduli predefiniti e ne costruirete di vostri.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Se non avete mai usato un linguaggio di programmazione prima d&#039;ora, non vi preoccupate: il corso è pensato anche per voi!</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Programmazione: Python (Italiano - principanti)", 
    "price": "30.00", 
    "instructors": "Christian Tiessen", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/200138_08e5_3.jpg", 
    "course_url": "https://www.udemy.com/programmazione-python-italiano-principanti/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-16T17:17:16Z"
}