{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\">GRAB IT NOW - GIving this Course away for FREE for 72 Hours - Ends Friday 10 April!</strong></p><p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\">Who is this course for?</strong></p><p>This course is specifically designed for people who are wanting to learn to program, especially children, teenagers, university students…oh yes, and those more mature and looking for a change of direction and some money!</p><p><strong style=\"\">What&#039;s the course about?</strong></p><p>“Everybody in this country should learn how to program a computer…because it teaches you to think&quot; (Steve Jobs). Steve Jobs is not alone in this thinking. Many of the people who are shaping our modern world are saying the same thing – programming is the language of the future. This course will introduce you to programming in the most fun, easiest, and most unique way possible.</p><ul style=\"\"><li>Fun…because you will build a game, a really great game!</li><li>Easiest …because you will learn to program in Scratch, developed by MIT to teach programming.</li><li>Unique…because you will be taught by a father-son combo!</li></ul><p>You will learn all the basics of programming, and by the end of this course you will be able to push the limits of what can be done in Scratch. You will learn about sprites, about code blocks that control them, about useful elements like sounds, randomization, sensing, and lots more. While the environment is easy to learn in, what you will learn will be amazing.</p><p><strong style=\"\">Why this course?</strong></p><p>There are lots of courses that teach you programming…and of course I suggest you do as many as you can. However, if this is your first time, or if you are wanting to see if programming is for you, or your children, then this is the best course for you. Why?</p><p>Firstly it will be <strong style=\"\">fun</strong>! Learning that is not fun is not fun…OK, I suppose that makes sense ;-) Very step of the process is fun, plus what can be more fun than making your very first program a game…and a fun game too!</p><p>Secondly we will be using <strong style=\"\">Scratch</strong> to teach you. Sure you will eventually want to learn programming in things like C++ or Swift or Java…as these will allow you to write mobile apps. However, I have seen countless people give up because these environments are so complex. You need to grasp the basics first…and that is exactly why MIT University developed Scratch. This is the best platform, used at schools and universities around the world, to learn to program. From here your options are limitless!</p><p>Thirdly when you learn to program you need to learn it in a <strong style=\"\">special</strong> way…and that is exactly what we are going to do for you. You will be learning from two people – myself (Craig) and my son, Joshua. I have a PhD in educational technology and have been involved in technolology and teaching it for over 30 years. I will give you the benefit of my knowledge of teaching – how to do it properly, and technology in general. Joshua, who is just 12 has picked up programming, by himself and is now successfully writing apps. But he started with Scratch. He will bring a fresh and simple-to-understand insight to the teaching as he guides you through this learning process. Together we are going to share with you how you can learn to program and set yourself up for the most needed career of the future. Everything is going to need software to work, whether it&#039;s your fridge, watch, phone, car…all of these are programmed. Software is the language of our world, and those who know it hold the key to the future.</p><p><strong style=\"\">What kind of materials are included?</strong></p><p>The course includes everything you need. The lectures are professionally created, as people have come to expect from bythe.guru productions. The course is in HD video with high quality audio and images. We will show you everything we explain. Plus in addition to this we have attached additional exercise with solutions to the end of most lessons. This means you can try other things to see if you have grasped the concepts.</p><p><strong style=\"\">How long will the course take to complete?</strong></p><p>There are 5 sections to this course, with each section providing short powerful videos on individual concepts. Learning to become proficient in programming takes time…but this course will give you a jump start into what is one of the most needed and lucrative careers around…ask Mark Zuckerberg if your don&#039;t believe us!</p><p><strong style=\"\">How is this course structured?</strong></p><p>This is an action course. So the course starts with getting to the doing straight away. The course starts with setting up your Scratch account and then in no time you have written your first program. The course is structured in the following way:</p><p><strong style=\"\">1.Section 1 – Scratching the Surface</strong> - The purpose of this first section is to introduce you to the importance of programming, and the Scratch programming environment.</p><p><strong style=\"\">2.Section 2 – Writing a Game – Part 1</strong> - The objective of this section is to introduce you to most of the important elements of Scratch programming by developing a really fun game.</p><p><strong style=\"\">3.Section 3 – Writing a Game – Part 2</strong> - This section now introduces some more advanced elements to our game and programming, such as extra sprites and random moves</p><p><strong style=\"\">4.Section 4 – Writing a Game – Part 3</strong> - One of the most important parts of programming is variables. This section will introduce you to creating and using variables.</p><p><strong style=\"\">5.Section 5 – Conclusion</strong> – The future looks bright - In this section we conclude by looking at how you can share your program that you have made and by summarising some of the key lessons.</p><p><strong style=\"\">Why take this course?</strong></p><p>If I am looking for an online course there are 3 key things I look for. Firstly, the qualification/experience of the teacher. Secondly, the ability of the teacher to teach/present. Thirdly, the quality of the teacher&#039;s material. So here are my credentials.</p><p>1.My Qualification/Experience - I have just completed a PhD in the use of IT for education. I&#039;ve been involved in IT both as a university lecturer, IT consultant and entrepreneur for over 20 years. This includes starting up multiple businesses both online and offline.</p><p>2.Ability to teach - In addition to having been a lecturer for over 20 years I have spoken around the world to everyone from business leaders to politicians to teachers to children. But don&#039;t believe me, here are what some of those who have heard me say:</p><p>&quot;<em style=\"\">Craig has the rare ability to engage personally with each member in his audience</em>&quot; (A. Byrnes, PDM Pty Ltd, Australia),</p><p>&quot;<em style=\"\">Craig is a dynamic speaker, out-of-the-box strategic thinker and professional</em>&quot; (R. van Rooyen, Associate Partner, Deloitte)</p><p>“<em style=\"\">Mr. Blewett is a pleasure to take in. The excitingly focused style by which he speaks keeps you on the edge of your attention</em>.&quot; (C. Stickney, USA)</p><p>“<em style=\"\">Craig is an experienced and highly competent teacher and presenter. He has the rare ability to convey innovative concepts in an engaging fashion that is packed with enthusiasm but also logic and balance</em>.&quot; (Dr. Alleyne, UK)</p><p>&quot;<em style=\"\">Craig is possibly on of the most interesting presenters I have encountered. His students love him and in public forums he is unequalled</em>.&quot; (Prof. Maharaj, UKZN, South Africa)</p><p>3. All the material presented in this course is professionally produced using HD video, high quality audio and specialist video editing software. Besides all this, you wont find a better value, easier course that will enable you to learn how to <strong style=\"\">program from SCRATCH</strong>!</p>", 
    "end_date": null, 
    "title": "Programming for Kids", 
    "price": "25.00", 
    "instructors": "Craig Blewett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446764_b6ff_9.jpg", 
    "course_url": "https://www.udemy.com/programming-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T19:10:19Z"
}