{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Today, you may not feel that you need coding skills – or knowledge of coding for that matter - and you feel that you can do just fine. However, you may be experiencing a shift in which colleagues in your department, who have technology skills / backgrounds, are placed on the fast-track. Their technical skills have given them an advantage that enable them to be more-successful in their role.</p><p>While technical skills can be a great asset, the day is coming where it is a requirement in the marketing department. Clearly, you recognize this, which is why you're enrolled in this course – with the goal of beefing up your tech chops.</p><p><span></span>The aim of this course is to provide a base level understanding of coding and data concepts in order to operate more effectively in the technology-centric marketing role.</p><p>This course includes 4 main sections:</p><ul><li>Definitions</li><li>HTML / CSS</li><li>Javascript</li><li>Data</li></ul><p>After completing this course you'll be able to</p><ol><li>Communicate more effectively with dev teams</li><li><span></span>Make simple changes on web pages using HTML, CSS</li><li>Write basic Javascript code</li><li>Understand data/logic for business intelligence/analytics purposes</li><li><span></span>Perform simple queries and perform quick/dirty data analysis</li></ol><p>What you'll need to complete this course </p><ul><li>A modern web browser (no special software required)</li><li>Ability to learn technical concepts (no previous coding experience required)</li></ul>", 
    "end_date": null, 
    "title": "Programming for Marketers", 
    "price": "25.00", 
    "instructors": "Andy Boyd", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472324_e572_4.jpg", 
    "course_url": "https://www.udemy.com/programming-for-marketers/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T23:23:56Z"
}