{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Dieses Video-Training bietet Ihnen einen Einstieg in die Programmierung mit C# und mit dem NET-Framework. Der bekannte Programmiertrainer Karl Kroneck erklärt Ihnen am Bildschirm, wie Sie eigene Windows-Programme, grafische Benutzeroberflächen und Datenbank-Anwendungen entwickeln. Lassen Sie sich Film für Film die Grundlagen des objektorientierten Programmierens zeigen, und vertiefen Sie Ihr Wissen über WPF, NET-Klassen, LINQ und das Entity Framework. Mit diesem Training werden Sie in Kürze selbst zum C#-Programmierer!</p><ul><li><strong>Der umfassende Einstieg in die Windows-Programmierung</strong></li><li><strong>Objektorientiert entwickeln mit Visual C# und .NET</strong></li><li><strong>ADO NET, LINQ und grafische Oberflächen mit WPF</strong></li></ul><p style=\"\">Karl Kroneck ist Dozent, Softwareentwickler und Berater für NET-Technologien mit Schwerpunkt C#. Als Geschäftsführer der IT-Beratung »Kroneck Consult GmbH« unterstützt er namhafte Unternehmen und Institutionen beim Einsatz unterschiedlicher Microsoft-Technologien wie SQL Server, Windows Server und SharePoint. Aus seiner langjährigen Erfahrung als Dozent kennt er die Schwierigkeiten, die Programmier-Einsteiger bei Ihren ersten Schritten mit Visual C# haben. Anschauliche Praxisbeispiele und eine verständliche Erklärweise sind sein Rezept für eine erfolgreiche Schulung.</p>", 
    "end_date": null, 
    "title": "Programmieren mit Visual C# – Das umfassende Training", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589566_531d.jpg", 
    "course_url": "https://www.udemy.com/programmieren-mit-visual-c-das-umfassende-training/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T16:17:15Z"
}