{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Are you a creative or entrepreneur </strong>that wishes you could speak tech with your web development team? Maybe you wish you could code a bit yourself?  </p>  <p style=\"\">  \t Programming for Non-Programmers is online course designed to help non-programmers communicate more efficiently with developers.  </p>  <p style=\"\">  \t Because leading a development team (without being a developer yourself) can sometimes feels like &ldquo;talking about dancing&rdquo;, I&#039;ve created an interactive and easy to follow environment in which to learn the basics.  </p>  <p style=\"\">  \t <strong style=\"\">And for developers just getting started</strong>, think of this as the primer to help kickstart your career.  </p>  <p style=\"\">  \t If you&#039;re running a tech start-up, it&#039;s essential that you familiarize yourself with the fundamentals of web development. Ultimately knowing how to &quot;talk to the talk&quot; will help you communicate better with developers, and overall just look really cool.  </p>  <p style=\"\">  \t <strong style=\"\">What You&#039;ll Learn </strong>  </p>  <p style=\"\">  \t In this course we&#039;ll tackle some development principles to get you on the right path. We&#039;ll look at questions like, &quot;Front-end vs. Back-end?&quot;, &quot;Is UX necessary for my project?&quot;, &quot;What is this Javascript function thingy, and why am I passing it strange math equations to it?&quot;.  </p>  <ul style=\"\">  \t<li style=\"\">What coding languages should I use for my next project?</li>  \t<li style=\"\">Which CMS is right for the job?</li>  \t<li style=\"\">What are the stages of web development?<br style=\"\">  \t   What deliverables do I need to provide my developer? (FYI - This is important and often neglected or done poorly)</li>  \t<li style=\"\">Reading code &amp; basic developing principles to get us started</li>  \t<li style=\"\">Key concepts of programming that are the found in every programming language</li>  \t<li style=\"\">Understanding Javascript Variables &amp; Logic</li>  </ul>  <p style=\"\">  \t <strong style=\"\">Do You Live in NYC?</strong>  </p>  <p style=\"\">  \t If you live in New York City I&#039;d love to have you in class! The full Programming For Non-Programmers series is offered once a month.  </p>  <p style=\"\">  \tEmail me chris[at]onemonth.com for details.  </p>  <p style=\"\">  \t <strong style=\"\">Live Support! (I&#039;m Here To Answer Your Questions)</strong>  </p>  <p style=\"\">  \t I&#039;m available for questions to all students taking the class. By joining the class you gain access to message me through email. And if for any reason you are not satisfied with the material, I will gladly refund you myself. No questions asked.  </p>  <p style=\"\">  \t Best of luck! <br style=\"\">  \t Chris  </p>  <p style=\"\">  \t <br style=\"\">  \t PS. I&#039;m on twitter as well if you have questions <a href=\"http://www.twitter.com/castig\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">@castig</a>  </p>  <hr style=\"\">  <p style=\"\">  \t <strong style=\"\">&quot;I&#039;ve traveled a steep learning curve thanks to Chris&#039; friendly and lucid style of teaching.&quot;</strong> - Charles Best, CEO of DonorsChoose.org  </p>  <p style=\"\">  \t <strong style=\"\">&quot;I wish I had taken this class 5 years ago!&quot;</strong> - Michael Goodwin, UX Designer  </p>  <p style=\"\">  \t <strong style=\"\">&quot;Informative, digestible, actionable&quot; </strong>- Katherine, Entrepreneur  </p>  <p style=\"\">  \t <strong style=\"\">&quot;An INCREDIBLE thank you! So far you&#039;re the only one who has been able to teach me how to code.&quot;</strong> - Darren Hakimi, Analyst  </p>  <p style=\"\">  \t <strong style=\"\">&quot;You are Articulate and Engaging. Broad and Diverse Range of Topics. That s right bro!!!!! </strong><strong style=\"\">Not easy to address so much in limited time.&quot;</strong> - student feedback  </p>  <p style=\"\">  \t <strong style=\"\">Even for a non tech person like me (who yes, has 50,000 emails in her inbox and actually thinks thats totally normal), I was able to keep up</strong>. My intent was to get a good overview of what the heck programming actually is, and better understand the language/terms associated with it.  I  certainly got that.  I also appreciated your passion for teaching. I will absolutely recommend the class to my friends. - Debra-Ellen Glickstein,  Entrepreneur  </p>  <p style=\"\">  \t <strong style=\"\">Read more reviews here: </strong><a href=\"http://www.skillshare.com/profile/Christopher-Castiglione/5698989/endorsements#e12728\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">SkillShare Reviews</a>  </p>", 
    "end_date": null, 
    "title": "Programming For Non-Programmers: Fundamentals", 
    "price": "50.00", 
    "instructors": "Christopher Michael", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/27449_0f0c_5.jpg", 
    "course_url": "https://www.udemy.com/programming-for-non-programmers/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-22T14:55:02Z"
}