{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Do you wish you could make a popular app like Instagram, Dropbox, Spotify, or even Google? What do these all have in common you might ask, they are at their roots built with Python. Python is a powerful, multi-use programming language that can be implemented in app development, web development, or even in a desktop environment. All of the basic functions required to get started on <strong>YOUR </strong>journey to making the next great app, in one location.</p><p><strong>What is Jython?</strong></p><p style=\"\">Jython is a form of the programming language Python, built and compiled in the Java environment(yes, the web development Java) but still using all of the basic Python functions. It's focus is to introduce these functions in an engaging, interactive form of media manipulation. Taking pictures and changing their colors, speeding up a sound file, flipping a picture upside-down and adding text to it, all of this and more can be accomplished with Jython.</p><p><strong>Best student for the course:</strong></p><p style=\"\"><strong></strong>This course is a beginners course to programming. No prior knowledge is required and any and all information needed to start programming will be provided to you. If you are a creative and imaginative individual, looking to take on a new hobby and learn a valuable trait to benefit you later on then this course is for you.</p><p style=\"\"><strong>Note: </strong>If you have any prior knowledge of programming I would advise against enrolling in this course. This course will be designed to help someone grow from no knowledge to fluently writing code in their sleep. If you would like a refresher and to go back to the basics, then please feel free to join.</p><p><strong>How it's done:</strong></p><p>Being slammed with content and instruction is difficult and overwhelming. This course focuses on a form of slow progression education. What this means is: </p><ol><li>A new topic will be introduced</li><li>Detailed information will be provided to get a grasp of what the topic is about</li><li>Useful resources will be accompanied along-side detailed lectures discussing the topic</li><li>Assignments will be provided to assist in confirming that you understand the new topic</li><li>Repeat</li></ol><p>With 14 overall sections laid out in this course, it should be anticipated that for a new individual to programming the course could take quite a bit of time to complete. However, there is no requirement to speed through the content and taking your time to fully comprehend each topic will only benefit you further on in the course. If at any point you have any issues, you can always reach out to me for guidance.</p><p><strong>So, what are you waiting for?</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Python Programming - A Media Approach ", 
    "price": "20.00", 
    "instructors": "Logan Poynter", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/624266_7f15_8.jpg", 
    "course_url": "https://www.udemy.com/python-programming-a-media-approach/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T03:32:21Z"
}