{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t    Python 3 for Beginners is a comprehensive course designed to teach the fundamentals of Python 3. The course is written for beginners and does not require any prior experience with any programming languages - and if you already know a programming language, you will be able to become proficient in the fundamentals of this language very quickly.  </p>  <p>  \t    The course begins with the key concepts of programming in Python - identifiers and basic operators. It then jumps to decision making and looping - two key concepts needed for developing powerful real world programs.  </p>  <p>  \t    From there, you will begin an exploration of the more advanced concepts of Python - tuples, lists, dictionaries, data sets and strings. That is followed by an exploration of working with files (necessary for reading and storing data sets), functions and code reuse. Finally everything is put together with an exploration of modules, object oriented programming (OOP) and gracefully dealing with error situations.  </p>  <p>  \t    Also, the course is filled with many small examples to illustrate key teachings as well as several programming assignments to help you master the language.  </p>  <p>  \t    When you complete this detailed Python 3 course, you will have all the tools you need to begin writing useful real world programs and have the core knowledge needed to expand your exploration of Python in whatever direction you desire - whether it be web programming, game development, business and finance applications or even sophisticated science programming running on super computers.  </p>  <p>  \t    Start working on your Python mastery today!  </p>", 
    "end_date": null, 
    "title": "Python 3 for Beginners", 
    "price": "20.00", 
    "instructors": "Steven Chabotte", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289746_ff92_6.jpg", 
    "course_url": "https://www.udemy.com/python-3-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-28T19:13:23Z"
}