{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>#update 4 (for MAC users): 18/07/2015</strong></p><p>  \t<strong>#update 3 in the course: 19/03/2015</strong></p>  <p>  \t<strong>#update 2 in the course : 15/12/2014</strong>  </p>  <p>  \t<strong>#update 1 in the course : 11/11/2014</strong>  </p>  <p>  \t<strong>Highlights:</strong>  </p>  <p>  \t<strong>8+ hour of practical video training with continuous update in series.</strong>  </p>  <p>  \t<strong>All exercise files are already uploaded. </strong>  </p>  <p>  \t<strong>No question, money back guarantee.</strong>  </p>  <p>  \t<strong>No boring power point presentation.</strong>  </p>  <p>  \t<strong>Advance application of python using Eclipse and Kali linux.</strong>  </p>  <p>  \t<strong>Zoom on timing so that you can watch even on mobile.</strong>  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>What makes this python training extra ordinary?</strong>  </p>  <p>  \t              This course comes with more than 8 hours of complete practical training. <strong>Not even a single power point presentation </strong>was used in this entire course. Entire theory was explained with the help of code so that every point can be justified. Not just depth in fundamental is taken but also variety of practical example are coded live in the videos so that students can learn to solve problems in the code. Finally we will take python skills to design penetration testing tools. So that, at the end of the training you can take few tools with you.  </p>  <p>  \t<strong>What basic skills are required to take this course?</strong>  </p>  <p>  \t              Being a comprehensive course, this course assumes that you have some fundamentals of computers with you such as installation of software, extract the rar files etc. We don't expect you to be a programmer because we are about to make you one. A programmer that can <strong>automate</strong> various tasks and give shapes to his ideas in python.  </p>  <p>  \t<strong>What does this course covers?</strong>  </p>  <p>  \t              This course starts from the installation of python in the very first movie. Then instead of using Notepad++ we will take you to a corporate level of development with Eclipse IDE. Moving from fundamentals like <strong>datatypes, basic operation, conditional programming, loops and Object oriented concepts</strong>, we will take the python training series to next level. We will teach you to <strong>integrate database, code Graphical User Interface and Network socket programming basics</strong>. Further we will explore the possibility of python scripts in penetration testing.  </p>  <p>  \t<strong>Where is python used?</strong>  </p>  <p>  \t              The rapid increase in python usage means the rapidly growing job market. Python is used at <strong>Google</strong>, <strong>Youtube</strong>, Yahoo Maps, Battlefield 2, Walt Disney Feature Animation, ABN AMRO Bank, Treasury Systems, National Weather Service, <strong>NASA</strong>, Red Hat, <strong>Thawte</strong> Consulting, IBM are just some examples. Since the python modules are available for almost every task, you can implement python all over the internet. Thus the <strong>job scope is extremely high</strong>.  </p>", 
    "end_date": null, 
    "title": "Python training, from scratch to penetration tester", 
    "price": "50.00", 
    "instructors": "Igneus Technologies", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306146_bbeb_4.jpg", 
    "course_url": "https://www.udemy.com/python-training-from-scratch-to-penetration-tester/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-23T14:39:43Z"
}