{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Learn the foundations of the Python programming language. Use the same software, techniques, and styles that professional Python programmers use daily.  </p>  <p>  \t<strong>Develop a strong foundation in Python while learning to code</strong>  </p>  <ul>  \t<li>Use Python to build practical projects</li>  \t<li>Learn all about object-oriented design, an essential programming topic</li>  \t<li>Develop the skills necessary to work professionally as a Python developer</li>  </ul>  <p>  \t<strong>The essential first step towards becoming a professional programmer</strong>  </p>  <p>  \t<strong></strong>Python is a powerful programming language for beginners and experts alike. Python is easy to learn and it can scale from &quot;Hello, World&quot; to building an entire operating system.  </p>  <p>  \t                            First year Python programmers make $95K and above, so why not start learning today? The skills you learn in this course are the same ones you will use daily working as a professional Python programmer.  </p>  <p>  \t<strong>Content and Overview</strong>  </p>  <p>  \t                            The Python Crash Course is a comprehensive guide to all things Python. We will take you from beginner to expert with the Python programming language. By the end of the course, you will have all the skills necessary to work as an entry-level Python programmer.  </p>  <p>  \t                            Learning Python is easy, so what&#039;s stopping you? Start learning today, and take your first few steps towards a better and more fulfilling career as a Python developer.  </p>", 
    "end_date": null, 
    "title": "Python Crash Course: Become a successful programmer today", 
    "price": "20.00", 
    "instructors": "Joseph Bergman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359330_2533_8.jpg", 
    "course_url": "https://www.udemy.com/python-master-class/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-29T20:37:16Z"
}