{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>NEW PYTHON CODE </strong></p>\n\n<p>This python for beginners course is geared to students who want to know how python works and also to those totally new to programming.</p>\n\n\n\n<p>The python language has very simple syntax(way to write it) to learn and it is one of the most powerful languages to learn since it can used for a variety of things.</p>\n\n\n\n<p><strong>Here are some:</strong></p>\n\n\n\n<ol><li>Data analysis</li><li>Game development</li><li>Visualization</li><li>Web development</li><li>Robotics</li><li>and more....</li></ol>\n\n\n\n<p><br></p>\n\n\n\n<p>Jobs in this field are really lucrative and knowing this language will give you an edge when finding a job and making a lot more money than other developers; python developers are not as many as in other languages since people think is hard. Python is super easy to learn but very powerful since it contains many possibilities.<br></p>\n\n\n\n<p>Python is growing faster and faster everyday and it has surpassed many other languages over the years for a lot of reasons, which you will find out soon enough.</p>\n\n\n\n<p>------------------------------------------------------------------------------</p>\n\n\n\n<p><strong>Why take this course?</strong></p>\n\n\n\n<p>This course starts with explaining what programming really is? Have you ever wondered how things actually work in a program?</p>\n\n\n\n<p>1. <strong>Teaches the foundation of GENERAL programming</strong></p>\n\n\n\n<p>Every student should have some foundations on what programming really is before learning any language, why? Because once you understand the core components of programming it will be a lot easier to learn any language and create better programs.</p>\n\n\n\n<p>2. <strong>New lectures added all the time</strong></p>\n\n\n\n<p>When you like what you do, it reflects. This is not a job for me, so I wake up wanting to code and help my students. Basically you pay once, get the course forever and get extra values added all the time, you have to love that :)</p>\n\n\n\n<p>3.<strong> Fun place to be </strong><br></p>\n\n\n\n<p>I love making my lectures fun and engaging, so no boring lectures here!</p>\n\n\n\n<p>4. <strong>T</strong><strong>he support you get in this course in unmatched</strong></p>\n\n\n\n<p>have you ever joined a class and received very little support or none at all? Well that is not going to happen in this class, because I love helping my students.</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Python For Beginners - Learn Programming from scratch", 
    "price": "20.00", 
    "instructors": "Edwin Diaz", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/405878_e5a0_3.jpg", 
    "course_url": "https://www.udemy.com/python-for-beginners-learn-programming-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T00:38:26Z"
}