{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\">Note: Price will hike soon, this is just introductory price, So join now and get the benefit.</em></strong></p><p><strong style=\"\"><em style=\"\">This course teaches using latest versions in python and ruby. This is 2 in 1 course.</em></strong></p><p>First you will learn basics in python programming, then learn some advanced topics in python like oop in python and each topic is explained with practical examples to understand the concepts better, After completing the python basics you will learn GUI in python which stands for graphical user interface used to create widows, buttons, menubar and many more.</p><p>Once you complete python you will learn complete ruby programming from basic to advanced topics.</p><p>This is a complete python and ruby programming tutorial for beginners. All the topics from basic to advanced are covered with examples to understand the concepts better. Once you complete the course you will be able to write complex code using python and ruby .I am sure you are going to love the python and ruby than any other programming language for rest of your life.<br style=\"\"></p><p>This tutorial has been designed for software programmers with a need to understand the Pythons and Ruby programming language starting from scratch. This tutorial will give you enough understanding on Python and Ruby programming language from where you can take yourself to a higher level of expertise.<br style=\"\"></p><p><em style=\"\"><strong style=\"\">So let&#039;s start learning</strong></em></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Python & Ruby programming Complete step-by-step Tutorial", 
    "price": "20.00", 
    "instructors": "DoEdu IT Educations", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480894_7247_2.jpg", 
    "course_url": "https://www.udemy.com/python-and-ruby-learn-python-and-ruby-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T06:48:46Z"
}