{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t\tLearn Python with Python Programming for Beginners from Stone River eLearning. </p><p>Delving into the world of coding can be intimidating. With so many complex languages and implementation possibilities, it's easy to become overwhelmed. By starting off with Python programming, you'll learn a simple, versatile and highly readable code that you can execute on a wide variety of systems quickly and easily.</p><p><b>Master one of the most popular programming languages in the world</b></p><ul><li>Understand and implement basic Python code</li><li>Create and run a real-world Python program</li><li>Gain a knowledge of basic programming concepts</li></ul><p><b>Learn a simple, streamlined coding language quickly and easily </b></p><p>If you've never written a single line of code or if you're well-versed in multiple program languages, Python Programming for Beginners will enable you to better understand programming concepts. </p><p>Widely regarded as one of the most simple and versatile programming languages out there, Python is used for web programming, video game building, microchip testing, desktop apps, and so much more. Used by programmers, developers, designers and everyone in between, it's one of the easiest programming languages to learn, and definitely the best starting point for new coders. This course will not only give you an understanding of the code, but will enable you to create and run real world Python programs too. </p><p><b>Course Overview</b></p><p>This course includes over 26 lectures and almost 4 hours of content, designed specifically for Python programming beginners.</p><p>You will be guided through the installation process and the basic concepts of Python programming, getting to grips with the language as a whole. From there, you'll dive straight into the specifics, learning the variables, loops and statements of the language and getting to grips with the function parameters, variables and common errors. </p><p>During this course you'll have the opportunity to put your knowledge to practical use by working with files and classes, importing syntax and making modules, and most importantly, by building your own Python program from scratch.</p><p>You'll walk away with detailed knowledge of one of the most widely used programming languages in the world. You'll have gained a foundation of skills that will enable you to progress to more complex coding languages, as well as understanding the underlying principles of all programming languages. In short, you'll have everything you need to become a proficient programmer.</p>", 
    "end_date": null, 
    "title": "Python Programming for Beginners", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44689_794e_8.jpg", 
    "course_url": "https://www.udemy.com/python-and-python-django-for-beginners-2-course-package/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-04T14:01:53Z"
}