{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>You are interested in learning Python and getting into the wide realm of programming and intense Tech Entrepreneurship. You have probably wondered what is the most practical way of learning Python (which to be frank, gives you the key to ruling the technology industry).</p><p>I have learned over 10 programming languages such as JAVA, Python, C++, R, Matlab, Ruby, CSS, HTML, Angular JS, Java Script. I have also had a successful freelancing career programming software and mobile applications. Since technology is changing every day, I have to learn something new every time. The best way that you can learn how to program is \"to program\". </p><p>Yet, nobody teaches in this manner and I suffer from the same pain when learning something new every time. Most courses are not designed to help you learn by example (immersion is the most potent way of learning in humans). Rather they bathe you with inapplicable information that you have to learn over and over again anyways.<br></p><p>This course is designed to cover all the basic concepts of Python and the syntax necessary for learning the advanced topics in Python. Even though Python can open the door to working with Machine Learning, Data Science, Data Manipulation, Big Data and basically everything else with the word \"data\" attached to it, it has some new functionality and nuances that you have to cover and learn. </p><p>My job is to make this class a great and fun learning experience so that I can help you progress through your path to learning advanced Python (whether it be just programming logic...classes....backends (<em>boring</em>) or doing fun stuff like Data Science). </p><p>In this course, I will walk you though Python Installation, and you will learn about data structures (we hear a lot about data, but how do we store it?), OOP (Classes and Objects and the cookie cutter template), Looping and Decision Making (how to not get lost in your program), Exceptions, File I/O, and Functions. </p><p>However, only a few videos per section are focused on information. I develop the rest of the details of the data structures and syntax through exercises that I walk you through in the course. There are 2-3 lectures on solving tough exercises on each subject so that you can understand not only the syntax and how to the program python, but also what the crux of programming is in terms of how we solve problems programmatically and harness the POWER of Python.<br></p><p>There is no risk for you as a student in this course. I have put together a course that is not only worth your money, but also worth your time. This course encompasses the basics of Python programming and I urge you to join me on this journey to learn how to dominate the entrepreneurial world with the most powerful language: Python.</p>", 
    "end_date": null, 
    "title": "Python Programming - Complete Beginner Course", 
    "price": "20.00", 
    "instructors": "Dhruv Bais", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754662_fd5a_2.jpg", 
    "course_url": "https://www.udemy.com/python-programming-beginner-python-fundamentals-course/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T21:02:09Z"
}