{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Update 06/02/2016 : Eclipse and python 3 installation setup added for WINDOWS</strong></p><p><strong>Python</strong> is top most language in the <strong>scripting</strong> world. Python is fully capable of handling <strong>automation</strong> tasks as well as to further level such as <strong>data analysis, web development</strong> such as <strong>Django</strong> or even <strong>penetration testing</strong>. All starts with basics of python.</p>    <p>We will target 3.x version of python, which is entirely new branch of python. Most people are moving towards this branch as it is purely object oriented and have been designed from scratch. According to official statement, <strong>python 3 will only be supported in the future</strong> and official site will soon discontinue the support for 2.x branch. Everyone is switching to this new python and it’s a right time for you to get started. </p>    <p>This course is not a course full of jargons, as we understand that power point and too much high end <strong>programming</strong> jargon words can make you sleep easily. Course is a full hand on practice with a small touch of fun. </p>    <p>We will start from <strong>installing python 3 </strong>on a MAC and Windows and will at configuring Eclipse. <strong>Eclipse</strong> is a cross platform IDE that is available for Windows and MAC and helps us by code suggestion while writing code. It’s a professional way of writing code. Further we will explore <strong>python data types, conditionals, loops and some keywords like “break” and “continue”</strong>. Further we will explore python strings in built functions. Next we will tackle files and learn to create a copy of image file in python. Further, we will move towards <strong>Object Oriented</strong> and will look at <strong>classes, objects, and inheritan</strong>ce.</p>    <p>Finally, we will <strong>handle database</strong> and will also talk about <strong>saving memory</strong> using <strong>decorators</strong>.</p>    <p><strong>All the exercise files are already included with the course. </strong></p><p>There is separate video to help you to download the exercise files and set them up on your system. This course will be a life changing experience for you. Videos are fun to watch and our special techniques will help you to reach towards the end of the course. </p><p><strong>Let's meet up in the course!</strong><br></p>", 
    "end_date": null, 
    "title": "Python 3, be a paid scripting professional", 
    "price": "40.00", 
    "instructors": "Igneus Technologies", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/689598_e2d3_3.jpg", 
    "course_url": "https://www.udemy.com/python-3-tutorials-be-a-paid-scripting-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-05T14:46:12Z"
}