{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Do you want to become a Python programmer?</strong></p><p>If they answer to that question is a yes and you are completely new to Python programming then you have come to the right place!</p><p>Python is a <strong>powerful </strong>modern <strong>object-oriented programming</strong> language that is considered a must for any upcoming programmer. This is due to how <strong>easy and simple</strong> Python is to both learn and use for a new programmer it is also extremely<strong> powerful</strong> so much in fact that it attracts companies like Google, EA and 2K Games. Furthermore Python is a \"<strong>glue</strong>\" language simply meaning it can be integrated with other languages such as C,C++ and C# which allows programmers to leverage the strengths of other languages while still enjoying the ease of development of Python.</p><p>This course includes the <strong>necessary basics </strong>to help you get started in becoming a Python developer with short but informative lectures aimed not to bore you to death and drown you in unnecessary information but instead deliver exactly what you need,the important information about the topic and in short lectures to ensure you can be <strong>quick </strong>on your way to becoming a Python developer. Though this course will not be going into <strong>deep detail</strong> about each part it will give you <strong>everything you need to understand and grasp it</strong> as to not waste your time and put you to sleep with long lectures! Therefore you can expect to complete this course in fair time, <strong>possibly an hour at most</strong>! This may sound frightening short but I can promise you the beginning fundamentals are all there and delivered quickly and understandably!    </p><p>So what are you waiting for? Your first steps to becoming a Python programmer are only a few clicks away so lets get <strong>started</strong>!</p><p>I have included <strong>all </strong>source code used in this course to help reinforce what you have learned so you may use them to aid you along in your journey. I hope you are as excited as I am to begin this journey as <strong>you</strong> become a Python programmer and quickly deveopl your skills in this awesome langauge!</p>", 
    "end_date": null, 
    "title": "Python - Quick fire basics! For beginners", 
    "price": "20.00", 
    "instructors": "Rafe O'Connor", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761368_fea4_3.jpg", 
    "course_url": "https://www.udemy.com/python-quick-fire-basics-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T10:20:28Z"
}