{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Ruby on Rails allows developers to create fully interactive and completely flawless web applications in record time. It’s the framework of choice for all of those household name tech companies because it is both complex and simple, and can be applied to a range of applications. In fact, if you ask anyone who works at those giant tech companies what technology you should learn to build custom web applications, Rails will be their answer. If you love solving problems and want to up the ante on your next job application, this course is for you. </p><p><strong>Get on the Right Track </strong></p><ul><li>Create fully interactive Rails applications</li><li>Learn how applications are built</li><li>Connect databases to Rails applications</li><li>Complete a challenging course project</li><li>Boost your employability with a valuable new skill</li></ul><p><strong>Build Rail Applications with Ease</strong></p><p>This course is specifically designed for those who want to get started with Ruby on Rails. If you want to get a solid footing needed to build and develop rails applications and create interactive, database driven websites, this course is for you. While you don’t need to have any Rails experience, a web programming background or knowledge of HTML and CSS will help.</p><p>During 38 lectures and 5 hours of content, you’ll get to grips with the basics of Rails, learn how to develop Rails applications, and work towards completing a challenging final project that will set you up for using Rails in real life situations. Essentially, you’ll go from zero to accomplished Rails developer.</p><p>The first two sections cover requirements, installation and the basic setup and features of rails, as well as introducing you the very first app you’ll build. The next section delves deeper and will improve your understanding of how Rails works and what it can do. Section 4 and 5 are dedicated to developing your practical skills, building an interactive website and completing your course project. </p><p><strong>Tools Used</strong></p><p>                        Ruby on Rails is an open source web application framework written in the Ruby programming language. It is optimised for simple, efficient programming and sustainable coding. It is used to provide default structures for databases, web services and web pages and facilitates the use of web standards in JSON, XML, HTML, and JavaScript among others.<br></p>", 
    "end_date": null, 
    "title": "Ruby On Rails for Beginners", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/104400_f5f1_7.jpg", 
    "course_url": "https://www.udemy.com/ruby-on-rails-for-beginners2/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-11T00:37:48Z"
}