{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course is a fast introduction to the <strong style=\"\">Ruby</strong> language for experienced programmers.</p><p><em style=\"\">Maybe you are already a programmer (</em>in some other language such as <em style=\"\">Java</em>,<em style=\"\"> C </em>or <em style=\"\">Python) </em>so you don&#039;t need a Ruby course that wastes time on telling you how programs work. This course gets straight down to business. It tells you what Ruby is all about, what makes it <em style=\"\">similar</em> to other languages - and what makes it <em style=\"\">different</em>. It explains the stuff you really need to know. It won&#039;t bog you down by trying to describe every gnarly little corner of the language. It concentrates on the essentials - with no unnecessary padding.<strong style=\"\"> If you need to get to grips with Ruby fast, this is the course for you.</strong></p><p><em style=\"\">Or maybe you&#039;ve already learnt the basics of Ruby</em> and you are looking for a quick way to revise your knowledge. With its video tutorials downloadable &#039;cheat-sheets&#039; and interactive quizzes, <strong style=\"\">Ruby For Programmers</strong> focuses on the most important features of Ruby and puts your knowledge to the test.</p><p>The course instructor <em style=\"\">Huw Collingbourne</em> is the author of <em style=\"\">The Book Of Ruby</em>. Huw has already taught over 22,000 people to program on Udemy. <strong style=\"\"></strong></p><p><strong style=\"\">Ruby</strong> is a cross-platform, object-oriented language. Ruby can not only be used for writing standalone programs but it can also be used for creating dynamic web sites thanks to web frameworks such as <em style=\"\">Rails</em>. If you are already an experienced programmer in some other language, or if you&#039;ve started learning Ruby and you need a clear, simple way to revise your knowledge, <strong style=\"\">Ruby For Programmers</strong> is course for you.</p>", 
    "end_date": null, 
    "title": "Ruby For Programmers", 
    "price": "20.00", 
    "instructors": "Huw Collingbourne", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443658_37ef.jpg", 
    "course_url": "https://www.udemy.com/ruby-for-programmers/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T11:55:38Z"
}