{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span><strong style=\"\">Learn Ruby programming with Highly mobile optimized video tutorials</strong></span>  </p>  <p>  \t<span>A lot of programmer tries to find a language which is completely </span><strong style=\"\">Object oriented</strong><span>, easy to learn and implement. Your search will end by finding </span><strong style=\"\">Ruby programming language</strong><span>. Ruby is a true object oriented programming language which is easy to use and you will complete all task without getting buried inside deep documentation. Everything in ruby is an object, even classes are also object in ruby.</span>  </p>  <p>  \tIn this entire mobile optimized course of <strong style=\"\">ruby programming</strong>, you will learn basics of ruby like operators, variables, If and if else. After grabbing basics, we will move on to loops and switch cases of ruby. We like to deliver knowledge in sharp and <strong style=\"\">to the point videos</strong>. In this entire series, we will focus on working with <strong style=\"\">eclipse IDE</strong> because it is free and ruby can be configured in ruby easily with eclipse.  </p>  <p>  \tYou might have intention to move into “Ruby on Rails” or just automating the things by ruby, this course will give you <strong style=\"\">quick but comprehensive</strong> start in ruby programming. In the competitive and keep on changing programming paradigm, programming languages keeps on going. But ruby is a bit different. It came as a fresh language and reached to the <strong style=\"\">top programming in 2014</strong> and is expected to be growing in programmers favorite list because of its high end features, easy syntax and dedicated object oriented approach.  </p>  <p>  \tRuby was designed to be more powerful that <strong style=\"\">Perl</strong>, and more object-oriented than <strong style=\"\">Python</strong>, and has gained in popularity due to its power and ease of use. Ruby is a dynamic, reflective, object-oriented, general-purpose programming language. It was designed and developed in the mid-1990s by <strong style=\"\">Yukihiro &quot;Matz&quot; Matsumoto </strong>in Japan.  </p>  <p>  \tFeatures of Ruby programming Include:  </p>  <ul style=\"\">  \t<p>  \t\t·Thoroughly object-oriented with inheritance, mixins and metaclasses  \t</p>  \t<p>  \t\t·Dynamic typing and duck typing  \t</p>  \t<p>  \t\t·Everything is an expression and everything is executed imperatively  \t</p>  \t<p>  \t\t·Lexical closures, iterators and generators, with a unique block syntax  \t</p>  \t<p>  \t\t·Literal notation for arrays, hashes, regular expressions and symbols  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Ruby, 1st script to expert scripter", 
    "price": "20.00", 
    "instructors": "Igneus Technologies", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/222420_0f0b_4.jpg", 
    "course_url": "https://www.udemy.com/ruby-online-course/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-19T05:00:57Z"
}