{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t         This course is well designed for all beginners who desire to Learn Ruby in depth along with Conceptual Description.  </p>  <p>  \t         The content of this course will simplify each and every topics of Ruby Programming Language in Details along with Illustrative Examples. All topics covered first contains the slides explanation followed by Live Coding in Aptana Studio 3.  </p>  <p>  \t         Let me make things more simple about this course. This course contains all topics that a noob programmer needs to become adaptive and expert in programming language. Trust me guys, your learning experience is going to be the one you have never experienced before anywhere over the web.  </p>  <p>  \t         At the end of this course you will learn various topics along with Live Codes. The topics covered are Interactive Ruby, Introduction, Ruby Syntax, Taking User Input, Methods || Functions, Conditional Statements, Ruby Class and Various Variables like Local, Instance, Class and Global variables, Getter Setter and Initialize Methods and their Shortcuts, Class variable (@@x) &amp; Selfmethod( ) ,Various Loops, Ruby Modules and Class, Require and Require Relative Statements, Ruby Include Statements and Mixins, Ruby Blocks, Yields &quot; &amp;Block &quot;, Arrays and 2D Arrays along with all it&#039;s Pre- defined Methods, Hash and it&#039;s pre-defined Operations, Inheritance, Operator Overloading, Overriding Methods, Freezing Objects, Linguistics, Procs and Lambda in Details, Ruby date and Time , Debugging Codes.  </p>", 
    "end_date": null, 
    "title": "Ruby Programming From Scratch : No Experience Required", 
    "price": "20.00", 
    "instructors": "Smartherd Developers", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/298478_76c0_4.jpg", 
    "course_url": "https://www.udemy.com/ruby-smartherd/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-11T16:17:49Z"
}