{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">You&#039;ve learned HTML and CSS—and probably some Javascript and PHP. Did you ever wonder why you need four separate languages to create a web application? Is there a better, more unified solution? If you&#039;ve been looking for an easy-to-learn, rapid application development environment, Ruby on Rails is for you.</span>  </p>  <p style=\"\">  \tRuby on Rails—commonly called just &quot;Rails&quot;—is an increasingly popular language and framework for creating web applications. The Rails framework provides templates to complete common tasks, such as:  </p>  <p style=\"\">  \t·Retrieving Web Service Content  </p>  <p style=\"\">  \t·Querying a Database  </p>  <p style=\"\">  \t·Creating and Using Page Templates  </p>  <p style=\"\">  \t·Much, much more!  </p>  <p style=\"\">  \tBecause templates are already part of the Rails framework, you&#039;ll spend less time architecting and coding common tasks. The Rails framework is a time saver that doesn&#039;t sacrifice power or flexibility.  </p>  <p style=\"\">  \tNew jobs are posted daily for prepared Ruby on Rails developers. Increase your opportunities—whether you work as a contractor, freelancer, or you&#039;re looking for a full-time job—by learning this important framework and language.  </p>  <p style=\"\">  \tInstructor Daniel Lefevbre is both a Rails expert and an understanding teacher. Daniel will guide you through this excellent course, taking a patient, step-by-step approach to the material. You&#039;ll learn through Daniel&#039;s exciting lectures and engaging lab exercises that teach you the ins and outs of the framework.  </p>", 
    "end_date": null, 
    "title": "Ruby on Rails for Beginners", 
    "price": "20.00", 
    "instructors": "LearnToProgram, Inc., Daniel Lefebvre", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/204486_d40d_3.jpg", 
    "course_url": "https://www.udemy.com/ruby-on-rails-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-24T13:16:42Z"
}