{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>SAP ABAP</strong> ist die bekannte Enterprise-Programmiersprache, die von den größten Unternehmen zum Betrieb ihrer Business-Systeme eingesetzt wird.</p>\n\n<p>In der Kursreihe SAP ABAP-Kompendium (Teil 1 von 6) vermittle ich dir Schritt für Schritt die Grundlagen und essentiellen Fähigkeiten, die du benötigst, um ABAP zu verstehen und anzuwenden.</p><p>Du wirst noch während des Kurses deine ersten eigenen ABAP-Programme schreiben und testen.</p><p><br>Der Kurs ist ideal für Einsteiger. Er setzt keine Vorkenntnisse voraus, sondern beginnt mit den absoluten Basics, damit du sicher verstehst, wie du am besten deine eigenen SAP-Programme implementieren kannst. <br><br>Wir werden uns nach und nach an die wichtigsten Schlüsselaspekte der Programmiersprache herantasten, wie zum Beispiel <br>•    die Bedienung der Entwicklungsumgebung, <br>•    die Deklaration von Variablen und<br>•    das Rechnen mit ABAP.</p><p>Du wirst mir dabei zusehen können, wie ich die Befehle, die ich erkläre, selbst anwende und ich werde dich anleiten, deinen eigenen Code zu schreiben und zu modifizieren.<br><br>Du bekommst das Wissen auf eine Art und Weise vermittelt, dass du garantiert die grundlegenden Konzepte verstehen und anwenden können wirst!<br>Außerdem werden wir uns in diesem Kurs auf die Praxis fokussieren, so dass du dich nicht ewig mit Theorie herumquälen musst, sondern die Sprache in einem absolut praktikablen und leicht verständlichen Ansatz lernen wirst und mit jeder Kurseinheit tiefer in die Materie einsteigst. Schon in der 9. Lektion wirst du dein erstes eigenes ABAP-Programm geschrieben und getestet haben!</p>\n\n<p>Egal ob du neu in der Programmierung bist, oder nur neu im Bereich ABAP: Diese Kursreihe ist dein Weg zur schnellen, professionellen ABAP-Softwareentwicklung im Businessumfeld!</p>\n\n<p>Die meisten ABAP-Kurse kosten tausende von Euros und kratzen gerade einmal an der Oberfläche. Meist darfst du dich erst einmal durch tausende langweiliger PDF-Seiten lesen und hast dann immer noch keine praktische Erfahrung. Der Zeitaufwand kann locker über 50 Tage im Vollzeitstudium betragen! Nicht so mit diesem Kompendium! Ich bin erfahrener SAP Ausbilder, Coach und Trainer, der über 5 Jahre Erfahrung in der Beratung und Implementierung mit SAP ABAP hat. Ich vermittle dir State-of-the-art ABAP-Knowhow aus dem aktuellsten Patch von SAP!</p>", 
    "end_date": null, 
    "title": "SAP ABAP für Anfänger Teil 1 - programmieren lernen im SAP", 
    "price": "50.00", 
    "instructors": "- Skillcoach -, Lars Czerwonka", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/788298_7f52_3.jpg", 
    "course_url": "https://www.udemy.com/sap-abap-kompendium-teil-1/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T09:54:47Z"
}