{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Have your LOCALHOST setup in 5 minutes using XAMPP.   Development environment on your machine easily and quickly.</strong></p><p><strong>Learn how to Start programming test, practice and load your server environment </strong>locally. Beginner Course to setting up your own web server. </p><p>You want to get programming and not have to worry about how to setup your server to run on your local machine.  Localhost Xampp is ideal to <strong>quickly</strong> get up and <strong>running</strong> and be able to get to the code instead of worrying about <strong>server configuration.</strong></p><p>We show you how to create a localhost machine.</p><p>By the end of this course you will be able to setup and run your PHP code on your computer.  You will also know how to setup <strong>Wordpress locally</strong>.  We also show you how to use <strong>MYSQL</strong> and <strong>phpmyadmin</strong> to mimic the <strong>server environment</strong>.</p><p>XAMPP is a powerful tool to get you coding faster without having to worry about setting up your local machine every time.</p><p>Everything you need to learn about Local hosting is provided within this course.</p><ul><li>exclusive resource download</li><li>no wasted time watching someone type</li><li>quick lessons get right to the point</li><li>fully covered topics with real world examples</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li><li>quick response support</li></ul>We answer your questions to get you up and running so that you can code.", 
    "end_date": null, 
    "title": "Save time learn How to Setup a localhost machine in minutes", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593170_e1cb.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-setup-a-localhost-machine/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T17:46:34Z"
}