{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Данный курс посвящен гибридному объектно-функциональному языку программирования Scala. </p><p>Он рассчитан на программистов на Java уровня от твердый Junior или Middle. Возможен также переход из других объектно-ориентированных языков - Python, C#, PHP.<br style=\"\"></p><p>Для прохождения курса потребуется около трех месяцев при затратах 6-10 часов в неделю при условии, что Вы хорошо понимаете базовые идеи современного промышленного программирования: шаблоны проектирования, generics, рекурсивные алгоритмы, XML/JSON, Объектно-Ориентированное Программирование (наследование, композиция, агрегация, инкапсуляция, сокрытие информации, полиморфизм).</p><p>Учебный материал состоит из 20 разделов, которые включают 200 небольших лекций и 50 тестов. <br style=\"\"></p><p>Курс серьезно насыщен терминологией современного программирования: continuation passing style, tail call optimization.</p><p>Scala включает несколько разделов, которые встречаются в других современных промышленных языках: higher-kind types, path-dependent types, macroses, parser combinators.</p><p>Платформа позволяет вести чат. Студентам рекомендуется задавать интересующие их вопросы в нем. Это позволит ответить как преподавателю, так и другим студентам.</p><p>Около 25% материала посвящено математике (алгебра, теория множеств, комбинаторика). Причина в том, что функциональные языки программирования особенно хороши при работе на стыке computer science и математики. Математический уклон позволяет показать многие глубокие идеи языка.</p><p>Курс снабжен большим количеством тестов. Их задача состоит как в проверке усвоения материала.</p><p>Удачи в изучении Scala!</p>", 
    "end_date": null, 
    "title": "Scala for Java Developers (in Russian)", 
    "price": "50.00", 
    "instructors": "Гражданин Ivan Golovach", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443646_66a0_2.jpg", 
    "course_url": "https://www.udemy.com/scala-for-java-developers-ru/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T11:33:45Z"
}