{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t                  That course will introduce you to Scilab.<br>  \t                  Scilab is a powerful scientific computation Software for Engineers and Scientists.<br>  \t                  It is free, open source and very similar to Matlab.<br>  \t                  The course is a great video based tutorial for any person that is interested in scientific computation : engineers, scientists or anybody curious about applied mathematics.<br>  \t                  The structure of the course is the following :<br>  \t                  - Section 1 is an overview of Scilab and how to get it.<br>  \t  A Newton method to solve a non-linear equation is given as an example.<br>  \t                  - Section 2 covers basic linear algebra using Scilab.<br>  \t                  - Section 3 presents Scilab language structures.<br>  \t  As an example, the Newton method is extended to the two dimensional case.<br>  \t                  - Section 4 covers the graphic capabilities of Scilab<br>  \t  An example displays natural images, that are given as additional material.<br>  \t                  - Section 5 covers advanced topics.<br>  \t  An example shows how to code the wavelet representation of a signal into a single Scilab structured variable. It is then used for compression purposes.<br>  \t                  - Section 6 gives a final project and the conclusion.<br>  \t  This project processes images for compression purpose, using a two dimensional wavelets transform.  </p>  <p>  \t  It is the opportunity to reuse everything learned previously.  </p>", 
    "end_date": null, 
    "title": "Scilab for Engineers and Scientists", 
    "price": "40.00", 
    "instructors": "Fabienne Chaplais", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/192830_289c_6.jpg", 
    "course_url": "https://www.udemy.com/scilab-for-engineers-and-scientists/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-02T15:14:39Z"
}