{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>#1 Scratch Programming course\non Udemy, in terms of reviews (over 60)</strong><br></p><p><strong>#1 Scratch Programming course\non udemy, in terms of 5 star reviews (over 40)</strong></p><p><strong>Bonus content added\nregularly. Latest update on 17-Nov-15. We will keep adding new content, so that\nour students have something to look forward to</strong></p><p><strong>All our students\n(Makerdemy brand) get VIP pricing ($8) for all our new courses. We have 10\ncourses under our brand and will be releasing a new course every 2 months.</strong></p><p>____________________________________________________________________<br></p><p>  \t              This course is primarily targeted at young learners ( age 8 to 16), who are keen to explore the Scratch visual programming environment. No prior knowledge of computers or programming is required to benefit from this course.  </p>  <p>  \t              The course is structured as a series of entertaining programming projects, through which the students will be introduced to all the building blocks of the Scratch programming language. By the end of the course, the students will be confident enough to create their own Scratch projects and games.  </p>  <p>  \t              This course can be completed in around 3 hours. This includes the time required to complete the project assignments.  </p>  <p>  \t              If your children are new to programming, this course will teach them how to ideate and design projects from scratch by using standard programming concepts.  </p>  <p>  \t              If the student mails the project assignments, he/she will be eligible for a ScratchNinja \"White Belt\" certificate.  </p>", 
    "end_date": null, 
    "title": "Scratch Programming for Raspberry Pi", 
    "price": "20.00", 
    "instructors": "Venkatesh Varadachari, Kamesh Dkr", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337384_9629_6.jpg", 
    "course_url": "https://www.udemy.com/a-fun-introduction-to-programming-for-children-using-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-06T10:39:11Z"
}