{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>JOIN THE OTHER 20,000 SUCCESSFUL STUDENTS WHO HAVE ALREADY MASTERED SHELL SCRIPTING AND THE LINUX OPERATING SYSTEM WITH ONE OF MY TOP RATED COURSES!</strong></p><p>If you want to learn how to write shell scripts like a pro, solve real-world problems, or automate repetitive and complex tasks, read on.</p><p>Hello. My name is Jason Cannon and I'm the author of <em>Linux for Beginners,</em> <em>Python Programming for Beginners</em>, and an instructor to thousands of satisfied students. I started my IT career in the late 1990's as a Unix and Linux System Engineer and I'll be sharing my real-world shell scripting and bash programming experience with you throughout this course.</p><p>By the end of this course you will be able to create shell scripts with ease.  You'll learn how to take tedious and repetitious tasks and turn them into programs that will save you time and simplify your life on Linux, Unix, or MAC systems.</p><p>____________________</p><p>Here is what you will get and learn by taking this <em>Shell Scripting</em> course:</p><ul><li>A step-by-step process of writing shell scripts that solve real-world problems.</li><li>The #1 thing you must do every time you create a shell script.</li><li>How to quickly find and fix the most shell scripting errors.</li><li>For those of you who want to start scripting right away, watch the two video shell scripting crash course.  If you do nothing else than watch these two videos you'll be ahead of most shell programmers.</li><li>How to accept input from a user and then make decisions on that input.</li><li>How to accept and process command line arguments.</li><li>What special variables are available, how to use them in your shell scripts, and when to do so.</li><li>A shell script creation check list -- You'll never have to guess what to include in each of your shell scripts again.  Just use this simple check list.</li><li>A shell script template (boilerplate).  Use this format for each of your shell scripts.  It shows exactly what to include and where everything goes.  Eliminate guesswork!</li><li>Practice exercises with solutions so you can start using what you learn right away.</li><li>Real-world examples of shell scripts from my personal collection.</li><li>A download that contains the scripts used in the presentations and lessons.  You'll be able to look at and experiment with everything you're learning.</li><li>Quizzes after each section just to make sure you're learning the most important aspects of shell scripting.</li><li><em><strong>Unconditional Udemy 30 day money-back guarantee</strong> - that's my personal promise of your success!</em></li></ul><p><strong>Learn to Program Using Any Shell</strong></p><p>What you learn in this course can be applied to any shell, however the focus is on the bash shell and you'll learn some really advanced bash features.  Again, whether you're using bash, bourne (sh), KornShell (ksh), C shell (csh), Z shell (zsh), or even the tcsh shell, you'll be able to put what you learn in this course to good use.</p><p><strong>Perfect for Linux, Unix, Mac and More!</strong></p><p>Also, you'll be able to use these scripts on any Linux environment including Ubuntu, Debian, Linux Mint, RedHat, Fedora, OpenSUSE, Slackware, Kali Linux and more.  You're scripts will even run on other operating systems such as Apple's Mac OS X, Oracle's Solaris, IBM's AIX, HP's HP-UX, FreeBSD, NetBSD, and OpenBSD.</p><p><strong>Here's What People Are Saying About Jason and His Courses:</strong></p><p><em>\"Another amazing course by Jason Cannon. This course helped propel my bash scripting to a whole new level. Now, I can't stop automating my work flow! :) Pretty soon everything will do everything itself.</em><em>\"  </em>--<strong>Fernando Garcia</strong><span><strong>, Udemy Student</strong></span><br></p><p><em>\"Excellent course on Linux! It is the best way to get started using Linux that I have come across.\"</em> --<strong>Chris Bischoff, Udemy student</strong></p><p><em>\"This class was a great review of the 2 Linux classes I took in school. I learned plenty of new stuff and got a great refresher on things I haven't used in some time. I did well on my interview and got the job I was looking for. Thanks!\" </em><strong>--Alan Derrick, Udemy student</strong><strong></strong><br></p><p><em>\"This was a great course! Learned a lot from it!\"</em> --<strong>Ricardo José Crosara Junior, Udemy student</strong><br></p><p><em>\"Excellent starter course. Very good and complete guide to get you started on working on Linux.\"</em> <strong>--Brian Mulder, Udemy student</strong></p><p><em>\"Great course! Easy to understand for beginners and a great refresher for experienced users!\"</em> <strong>--Spencer Ball, Udemy student</strong></p><p><em>\"Very well laid out course. Thanks Jason!\"</em> <strong>--Eric Etheredge, Udemy student</strong></p><p><em>\"Love it... it's absolutely one of the best courses I've taken here on Udemy.\"</em> <strong>--Idriss N, Udemy student</strong></p><p><em>\"Awesome Course! Another great one. Thanks Jason!\"</em> -<strong>-John Wilmont, Udemy student</strong></p><p><em>\"Excellent Course! Having come from a moderate understanding of Linux, this course has given me a deeper and more streamlined understanding of Linux. Definitely worth the money.\"</em> <strong>--Armando Cabrera, Udemy student</strong></p><p><em>\"Fantastic course and very beautifully explained.\"</em> <strong>--S John, Udemy student</strong></p><p><em>\"Great course, great instructor. I enjoyed every minute of it. I recommend this course 100%.\" </em><strong>--Alfredo, Udemy student</strong></p><p><em>\"I am lovin' it. Nice way to begin one's journey into Linux.\"</em> <strong>--Rohit Gupta, Udemy student</strong></p><p><span></span>____________________</p><p><strong>Free Bonus - Downloads of All the Material Covered</strong></p><p>As an added bonus for enrolling in this <em>Shell Scripting</em><em> </em>video training course, you'll receive access to all the slides and shell scripts used in the lessons. You can download them and refer to them when you want to jog your memory or double-check your work.</p><p><strong><em>Enroll now and to learn how to write shell scripts like a pro!</em></strong></p>", 
    "end_date": null, 
    "title": "Shell Scripting: Discover How to Automate Command Line Tasks", 
    "price": "20.00", 
    "instructors": "Jason Cannon", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563066_4981_2.jpg", 
    "course_url": "https://www.udemy.com/shell-scripting-linux/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T22:01:43Z"
}