{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Managing the system is very important activity for any organization business. Similarly all application require simple interface to use and big real time solutions require 24 hour support for lot of different tasks. This requires systematic way of doing the tasks to manage the systems and solutions efficiently. Big businesses require continuous improvement to manage these tasks efficiently. Linux and Unix system provides lot of commands to do all but at the same time it require automate as much possible to manage the operational tasks efficiently.<br></p>\n\n<p>Shell scripting provides wonderful way to use the Linux and Unix system to automate the complex tasks in programmatic way. The shell script helps in lot of tasks - managing system, timely operations, production support for big solutions, release and update, interfaces for application. It provides all in a simple manner and easy to understand for any developer/admin, so that future maintenance is also easy.</p>\n\n\n\n<p>This course explains different features of shell scripting and shows simple implementation. The course develops the shell scripting understanding in steps by providing explanation and immediate implementation.</p>\n\n\n\n<p>I have used Fedora on Oracle Virtual Box as environment but it can be done on any Linux and Unix system with shell and small changes as applicable for that shell.</p>\n\n\n\n<p>This course will be expanded soon, some of the topics that will be added are-</p>\n\n\n\n<ul><li><strong>Handling options</strong></li><li><strong>Arrays</strong></li><li><strong>Debugging</strong></li><li><strong>More in existing topics</strong></li><li><strong>Any other topic useful for this course</strong></li></ul>\n\n\n\n<p>This course will be updated with adding new topics and existing topics will be provided in detail to have good understanding of Shell Programming to build the technical strength and shape your career.</p>", 
    "end_date": null, 
    "title": "Shell Scripting : Empower Yourself to Work on Linux and Unix", 
    "price": "30.00", 
    "instructors": "Suresh Kumar Srivastava", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705506_f867_3.jpg", 
    "course_url": "https://www.udemy.com/linux-shell-scripting/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T05:26:58Z"
}