{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t                            Have you ever tried to learn programming, or thought about learning programming? Are you a non-technical co-founder wanting better understanding of what your technical co-founder does, or a parent or teacher wanting to help your child or students maximize their own learning?  </p>  <p>  \t      First understand the basic concepts that you need to build almost anything in code.  </p>  <p>  \t<strong>Build a strong foundation that will make it easier to learn any programming language in the future. </strong>  </p>  <ul>  \t<li>Sublime Text Free Installation</li>  \t<li>If-Else Statements and Loops</li>  \t<li>Variables and Arrays</li>  \t<li>Program Structure</li>  \t<li>Refactoring</li>  </ul>  <p><strong>An Amazing Creative Skill That Opens Doors</strong></p>  <p>  \t                            Programming languages are extremely powerful tools, unlocking your ability to create new innovations, launch independent side projects or start a new career. They come with a steep learning curve, but this course provides an on-ramp by explaining programming concepts in real-life language. All of these concepts are things you already use in real life all the time.  </p>  <p>  \t                            In less than 2 hours, this \"Short &amp; Sweet\" course covers the essential ideas you need to move forward, without a lot of filler. At the end of the course, you'll be able to learn any programming language more easily, understand the basic concepts required to build almost anything, and be able to explain programming concepts in plain English.  </p>  <p>  \t<strong>Content and Overview</strong>  </p>  <p>  \t                            This course is suitable for you if:  </p>  <ul>  \t<li>You're brand-new to programming and want to take additional courses or tackle a bootcamp in the future. </li>  \t<li>You've tried to learn programming before and failed.</li>  \t<li>You're struggling in your intro CS classes.</li>  \t<li>You're a non-technical co-founder wanting a better understanding of what your technical co-founder does. </li>  \t<li>You're a parent or teacher who wants to use ideas from the course to help your child or students learn programming. </li>  </ul>  <p>  \t                            This course avoids teaching a specific programming language in favor of teaching core concepts that are transferable across many languages. Within a couple of hours, you'll be much better equipped to take your next step, whether it's Ruby, JavaScript or C.  </p>  <p>  \t    Note that if your primary goal is to learn HTML or CSS, you don't need this course because those are mark-up languages, not programming languages.  </p>  <p>  \t<strong>What's in it for me?</strong>  </p>  <ul>  \t<li>A \"Short &amp; Sweet\" core curriculum taking less than 2 hours to complete</li>  \t<li>Packed with essential concepts that provide you with a running start</li>  \t<li>Access to bonus content that will be added on a continual basis</li>  \t<li>Access to the instructor to help you over any roadblocks</li>  \t<li>The experience of knowing you can do it</li>  </ul>  <p><strong>What if I still have questions after taking the course?</strong></p>  <p>  \t                            My goal is to make this course the easiest-ever explanation of programming. Please let me know if anything in the course could be clearer, and I'll be happy to help you. It also will help me improve the course. Udemy offers a 30-day guarantee, so there's no risk to you.  </p>  <p>  \t          If you're ready to learn more and sign up for the course, go ahead and hit that Enroll button, or take a test drive by using the Free Preview feature.</p>", 
    "end_date": null, 
    "title": "Short and Sweet: Basic Programming Concepts in 2 Hours", 
    "price": "20.00", 
    "instructors": "Stephanie Losi", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371206_fcc2_2.jpg", 
    "course_url": "https://www.udemy.com/short-sweet-learn-programming-concepts-to-make-anything/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T03:30:20Z"
}