{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>My Spring Core course is intended to be a predecessor to this course. In Spring Core, I gave you a solid foundation in working with the Spring Framework. In this course, I build upon that foundation expanding your skills with the Spring Framework. The skills taught in this course are skills you will need for enterprise application development with the Spring Framework.</p>\n\n<p><strong>Topics Include</strong>:</p>\n\n<ul><li>Spring Data JPA</li><li>Form Validation in Spring MVC</li><li>Externalized messages</li><li>Using Spring Security</li><li>Aspect Oriented Programming</li><li>Spring Application Events</li><li>Scheduled Tasks</li><li>Advanced Spring Configuration</li></ul>\n\n<p>I start this course by showing students how to replace the traditional JPA DAO structure we created in the Spring Core, using Spring Data JPA. I continue building upon concepts learned in the Spring Core course by showing students how to use Command objects in Spring MVC and how to perform server side property validations.\n</p>\n\n<p>Next we get into using Spring Security. I show you how to add Spring Security to our existing Spring MVC web application. We configure Spring Security to read user information from our database, and then secure URLs to authenticated users and users with specific security roles.</p>\n\n<p>Aspect Oriented Programming (AOP) is a really cool programming paradigm, and its supported by the Spring Framework. In the module on AOP, I show you how to use AOP to log login activity in Spring Security. By using AOP, we don't need to change any of the Spring Security code.</p>\n\n<p>The Spring Framework has a really mature events framework we can use for application events. I show you how to create a custom application event, then how to setup an event handler to take action on specific application events.</p>\n\n<p>In Spring Core and in this course, the project we're working uses Spring Boot as its foundation. Spring Boot is doing a lot of automatic configuration for us. In the last module of this course, we will remove Spring Boot from the project. This will require us to configure all the objects and data sources being provided by Spring Boot manually. In doing so, students will gain insight into all the automation being provided by Spring Boot, and how to manage a more advanced Spring Configuration.</p>", 
    "end_date": null, 
    "title": "Spring Core Advanced - Beyond the Basics", 
    "price": "30.00", 
    "instructors": "John Thompson", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/575076_3843_2.jpg", 
    "course_url": "https://www.udemy.com/spring-core-advanced-beyond-the-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-05T21:49:58Z"
}