{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>After taking Stairway to Scala part 1, you will be able to:</p><ul><li>Use the REPL (the Scala Interactive Shell) for experimentation and fun</li><li>Understand the basics of Scala syntax, including val, var, def, if, while, try, for and more</li><li>Create classes, objects and instances</li><li>Define and use function literals and higher order functions</li><li>Understand the basics of Scala's type inference and how to use it</li><li>Write custom control structures to augment those built into the language</li><li>Start down the path of a more functional style of programming</li><li>Be ready for Part 2 of Stairway to Scala Applied, which will dig into some of the differences between Scala and other languages</li></ul><p>The course is half theory, half practice with hands on coding exercises built around test driven development examples. If you complete all three parts, with all the exercises, you will find that in addition to a strong grounding in the language theory, you will have the practical skills and comfort to code in Scala, as well as having the tools necessary to do so.</p><p>Unlike many other courses that teach a specific aspect of the Scala language, for example reactive programming or functional concepts, Stairway to Scala Applied provides a balanced and thorough introduction to the whole language and its concepts, including libraries like Actors and Collections. It is intended to accelerate your Scala learning curve and make you able to use Scala productively by the end of the course.</p><p>The course is taught by two highly experienced Scala developers who use Scala on a daily basis for real world commercial projects, and have done so for several years each.</p><p>Most of the lectures are practical demonstrations accompanied by a slide. You can download the slide deck and follow along on your computer, but the lectures are also presented using Udemy mashups, so the slide and practical demo can be switched between at will. If you hear typing, it's best to bring up the practical demo screencast instead of the slide in order to follow along.<br></p>", 
    "end_date": null, 
    "title": "Stairway to Scala Applied, Part 1", 
    "price": "50.00", 
    "instructors": "Dick Wall", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/791548_2d6a_3.jpg", 
    "course_url": "https://www.udemy.com/stairway-to-scala-applied-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-13T17:38:28Z"
}