{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>C/C++ has been used for many years to write some of the best applications for many of the computers out there.<br></p><ul><li>Have you ever wanted to learn C/C++? </li><li>Looked at code and thought it looked graceful yet complex? </li></ul><p>Going me and in this course I teach you how to program the fast, powerful and popular C++ programming language from scratch, only assuming you have basic computer.</p><p>Learn by example with over 15 (and growing) code examples plus lectures to explain key concepts in C++.</p><p>C++ has been favoured by the professional programmers for many years because of its power and flexibility. Many games have been written in C++. Many of the scripting languages modelled on the syntax and style.</p><p>Even today C++ is a popular language, even still amongst the indie game programmers. Its flexible enough to create a Windows UI or program a Unix TCP server.</p><p>C++ is a challenging language; but in this course I take you step by step through the basics. Building you skills and through many code examples I show you how to build a program and how to create C++ classes and objects.</p><p>So, don't delay, start learning today and you could be using these basics in your next computer program.</p><p><strong>5th June 2015 - Course Update</strong></p><p>Template classes are great; they provide a way of create a class to manipulate a data type even when you are not sure what that datatype will be. I've just added a new lecture that shows you an example Template Class and how they are used. Enjoy.</p><p><strong>9th June 2015 - Course Update</strong><span></span></p><p>3 new lectures added. One on Linked Lists, one on Enum and third on Union. Enjoy</p>", 
    "end_date": null, 
    "title": "Start With C / C++ and Object Oriented Programming", 
    "price": "20.00", 
    "instructors": "Sean McCammon", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448146_65c4_5.jpg", 
    "course_url": "https://www.udemy.com/beginning-with-c-plus-plus/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-15T22:46:36Z"
}