{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  Have you been wanting to develop Apps for iOS but don&#039;t have the prerequisite language skills?  Have you tried other iOS courses and the code just went over your head?  Do you feel like you need a little more coding experience before tackling mobile? Do you want to get a head start on iOS8 development?  </p>  <p style=\"\">  \t  There is no mobile platform that has proved more dominant-- or more lucrative than iOS!  </p>  <p style=\"\">  \t  If you&#039;re planning on creating native iOS apps in the future, you must know Swift.  Swift is an easy-to-learn and powerful language that will be used to create iOS8 and OSX apps in the very near future. Companies are scrambling to hire Swift developers and those with aspirations to create iOS apps are learning it as fast as they can.  </p>  <p style=\"\">  \t  You&#039;ll see expert instructor Mark Lassoff code right in front of you as you watch hours of demonstrations.  You&#039;ll really master the language in the multiple labs that are both interesting and engaging.  Dozens and dozens of code examples are available for you to load up and study.  </p>  <p style=\"\">  \t  Over 150,000 people have learned programming from Mark Lassoff-- this course is one of his best.  If you want to learn Swift and become an iOS8 developer, this is your course.  </p>", 
    "end_date": null, 
    "title": "Swift Language Fundamentals", 
    "price": "30.00", 
    "instructors": "LearnToProgram, Inc.", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297244_5f98_3.jpg", 
    "course_url": "https://www.udemy.com/swift-language-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T18:44:19Z"
}