{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">***** Join <em>over</em> <em class=\"redactor-inline-converted\">3,000</em><em class=\"redactor-inline-converted\"> students from 131 countries</em> learning Python the quick, fun, and easy way (and teaching their kids)! *****</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Two new BONUS videos just added! </strong>Teach yourself (and your kids) to code fun, colorful apps and games in Python, the powerful programming language used at tech companies and in colleges worldwide. Learn coding step-by-step from Computer Science Professor Dr. Bryson Payne, author of the <strong class=\"redactor-inline-converted\">Amazon</strong> <strong class=\"redactor-inline-converted\">#1 New Release</strong> and Top 10 Best Seller in Children's Programming Books, <em class=\"redactor-inline-converted\">Teach Your Kids to Code: A Parent-Friendly Guide to Python Programming</em> (2015, No Starch Press).</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Give Your Kids a Huge Advantage in a High-Tech World</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Quickly master new problem-solving skills in Python with colorful, fun examples</li><li>Teach younger kids to code using Turtle graphics, with text-based games and apps for older learners</li><li>Build your own playable games and create beautiful graphics</li><li>Learn the basics of coding, from variables to loops and functions, with interactive, engaging apps</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br>This is the kind of course you can enjoy <em class=\"redactor-inline-converted\">with</em></strong><strong class=\"redactor-inline-converted\"> your kids!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Packed with fun examples, colorful graphics, and easy-to-follow plain English instruction, <em class=\"redactor-inline-converted\">Teach Your Kids to Code</em> is the course parents and kids, teachers and students can enjoy together, as they build one of the top job skills of the 21st century! Python is a great first language for beginners, but it's powerful enough to be used in companies from Google to IBM.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I designed this programming course to be easily understood by absolute beginners, with example code I used with my own pre-schoolers all the way through the apps I teach to college freshmen. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Quick, two- to eight-minute lessons will get you coding your own apps from scratch in minutes. Over 100 video lectures and 7.5 hours of content will give you the practice you need to master the powerful new skill of coding.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>    <strong class=\"redactor-inline-converted\">Everything you need to get started right away</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Complete with working code downloads and high-definition videos, you'll be able to work alongside a professor with 18 years' teaching experience and over 30 years of programming knowledge. You'll also receive a Certificate of Completion upon finishing the course.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">No Risk:</strong> Preview videos from Sections 1, 2, and 4 now for FREE, and enjoy a 30-day money-back guarantee when you enroll - zero risk, unlimited payoff! And, we've made this course easy to afford at just $20 so parents and students can get started now!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Sign up for this course and get started coding today!</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">** </strong>Programming Challenge Solutions added to all 7 Sections, plus new Bonus videos, including a new one with my 7-year-old son, Alex! <strong class=\"redactor-inline-converted\">New Turtle Gallery code and Bonus Q&amp;A video added this month</strong>- keep the feedback and questions coming!Thanks! <strong class=\"redactor-inline-converted\">**</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Praise for <em class=\"redactor-inline-converted\">Teach Your Kids to Code:</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">★★★★★ \"Inspired\" - </strong><em class=\"redactor-inline-converted\">This is an inspiring course taught by an inspired teacher. The examples are well-chosen -- demonstrating principles through engaging, colorful projects rather than by teaching abstract principles first. While I wish the instructor weren't quite so repetitiously exuberant, this is at worst a minor stylistic blemish and might even be a plus for kids viewing it. <strong class=\"redactor-inline-converted\">— Kent Osband, Udemy student</strong></em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">★★★★★ </strong>\"Excellent path into Python\" </strong><em class=\"redactor-inline-converted\">Not just for kids...use this course as the perfect Python primer. Clear examples, that build quickly into programs, leading to learning challenges. Bryson's delivery is well paced and good fun. <strong class=\"redactor-inline-converted\">— Sean Jon Darcy, Udemy student</strong></em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>★★★★★<em class=\"redactor-inline-converted\">“Dr. Bryson Payne is a computer scientist and professor of the highest caliber, and with Teach Your Kids to Code, he brings the power of computers within easy reach for learners young and old.\"</em><strong class=\"redactor-inline-converted\">—Dr. Antonio Sanz Montemayor, Informatics Professor, Universidad Rey Juan Carlos, Spain </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>★★★★★<em class=\"redactor-inline-converted\">“The concepts in Teach Your Kids to Code can help any young person enhance their college prospects and expand their career opportunities.\"</em><strong class=\"redactor-inline-converted\">—Dr. Raj Sunderraman, Department Chair of Computer Science, Georgia State University</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">[For the Book version on Amazon] </em>★★★★★<em class=\"redactor-inline-converted\"> </em><em class=\"redactor-inline-converted\">“Dr. Payne set us on the path that led us to our dream jobs! With Teach Your Kids to Code, he's providing parents and teachers everywhere the chance to do the same for the next generation of creative problem-solvers.\"<strong class=\"redactor-inline-converted\">—Shah and Susan Rahman, Riot Games </strong></em></p>", 
    "end_date": null, 
    "title": "Teach Your Kids to Code: Learn to Program Python at Any Age!", 
    "price": "20.00", 
    "instructors": "Bryson Payne", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519554_da68_5.jpg", 
    "course_url": "https://www.udemy.com/teach-your-kids-to-code/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T20:36:53Z"
}