{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Course updated June 18th, 2016</strong><br></p>\n\n<p><strong>Already with 28,300+ students and over 3,800+ reviews! Just read the reviews by students!  They love it.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Note: JavaFX content added! By popular request, a new section has been added. How to write Java GUI interfaces using JavaFX!</strong><br></p>\n\n\n\n<p><strong>File Input/Output section enhanced.</strong></p>\n\n\n\n<p><strong>Concurrency/Threads section in progress - four videos recorded and uploading this week.  </strong></p>\n\n\n\n\n\n\n\n\n\n<p>Frustrated trying to learn how to program?<br></p>\n\n\n\n\n\n\n\n\n\n<p>My name is Tim Buchalka and I'd like to ask you to come with me on a journey as I take you from a beginner to an experienced Java developer!</p>\n\n\n\n\n\n\n\n\n\n<p>Over 65,000 students are already enrolled in my programming courses and have left <strong>thousands of reviews!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Why?</p>\n\n\n\n\n\n\n\n\n\n<p>Because I've taught them how to program successfully and made learning fun at the same time.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Now it's your turn! Are you ready to learn how to program?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>This course assumes no previous experience and takes you from the absolute beginner concepts like showing you the tools you need to download and install, writing you very first Java program, and then goes into more detail as we explore the entire Java feature set.</p>\n\n\n\n\n\n\n\n\n\n<p>All the essential Java keywords, operators, statements, and expressions are explained in great detail, together with complete chapters on object-oriented programming and the Java API.</p>\n\n\n\n\n\n\n\n\n\n<p>You learn to develop powerful Java applications using one of the most powerful Integrated Development Environments on the market, IntelliJ IDEA!</p>\n\n\n\n\n\n\n\n\n\n<p>But don't worry, if you are used to using Eclipse, NetBeans or some other IDE. Because this is a pure Java course you are free to use any IDE you wish and you will have no problems getting the most out of the course.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Read all the 5-star reviews other students have left for this course!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Now don't worry if none of that made any sense. Because, I go into great detail explaining each and every core concept, programming terms, and buzzwords.</p>\n\n\n\n\n\n\n\n\n\n<p>By the end of this course, you will have a mastery of programming in Java no matter what level of experience you are at right now.</p>\n\n\n\n\n\n\n\n\n\n<p>Be sure to click the free preview button on this page if you want to get a taste of the quality of the training.</p>\n\n\n\n\n\n\n\n\n\n<p>My goal is not just to show you how to program, but to help you understand what you are doing, and why you are doing it as well!</p>\n\n\n\n\n\n\n\n\n\n<p>Not only do the videos show you how to become a programmer in great detail, but this course has a unique challenge feature included.</p>\n\n\n\n\n\n\n\n\n\n<p>Each time a core concept is taught, a video presents a challenge for you that is designed to help you understand what you have just learned.</p>\n\n\n\n\n\n\n\n\n\n<p>You will go away and complete the challenge, and then come back and see the challenge answered and explained in detail in the video, allowing you to check your results!</p>\n\n\n\n\n\n\n\n\n\n<p>This is a fantastic way to really help you understand Java faster and ensure you will reach your goal of becoming a Java Developer in record time.</p>\n\n\n\n\n\n\n\n\n\n<p>As your instructor, I have over 30 years experience as a software developer and teacher and have been using Java since around the year 2000. Yes, over 15 years!</p>\n\n\n\n\n\n\n\n\n\n<p>I am an expert programmer but also have the relatively unique ability to make teaching fun and easy.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Don't worry; I might be a geek, but I do make programming fun and painless for you to learn!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Not convinced? Just go and take a read of some of the rave reviews given to me in my other courses.</p>\n\n\n\n\n\n\n\n\n\n<p>The facts are that students love my classes and style of teaching because it helps them reach their goals faster.</p>\n\n\n\n\n\n\n\n\n\n<p>Are you ready to let me help you become a Java developer?</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Course updates</strong></p>\n\n\n\n\n\n\n\n\n\n<p>One of the things I pride myself on is how often I add new content to my videos, and also how often I update them, and this course is the same.</p>\n\n\n\n\n\n\n\n\n\n<p>As an example, my Android course has had over 57 hours of material and numerous updates applied to it to ensure its current and is of the best quality for you.</p>\n\n\n\n\n\n\n\n\n\n<p>I am always adding new content to the course as well as updating it on a regular basis to make sure you access to the best and most update to date and comprehensive Java training available!</p>\n\n\n\n\n\n\n\n\n\n<p>Here is a list of the content being added on a regular basis!</p>\n\n\n\n\n\n\n\n\n\n<p>As i mentioned in the very first video in the course, <strong>there is a lot of new content to come!</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Testing and Documentation</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>How to test and debug Java program, exceptions and documentation.</p>\n\n\n\n\n\n\n\n\n\n<p>Debugging</p>\n\n\n\n\n\n\n\n\n\n<p>How to use the Java documentation to get the information you need.</p>\n\n\n\n\n\n\n\n\n\n<p>Setting up Java source code for analysis in IntelliJ</p>\n\n\n\n\n\n\n\n\n\n<p>Reviewing Java's source code to become a better programmer.</p>\n\n\n\n\n\n\n\n\n\n<p>Exceptions</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Regular Expressions</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Lambda Expressions</strong></p>\n\n\n\n\n\n\n\n\n\n<p>This is the number one course you need to get enrolled in if you truly want to learn how to become a Java Developer.<br></p>\n\n\n\n\n\n\n\n\n\n<p>So, are you ready to get started? <strong>Enroll now and I look forward to seeing you inside!</strong></p>", 
    "end_date": null, 
    "title": "The Complete Java Developer Course", 
    "price": "50.00", 
    "instructors": "Tim Buchalka", 
    "commitment": "41 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533682_c10c_2.jpg", 
    "course_url": "https://www.udemy.com/java-the-complete-java-developer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-21T20:25:56Z"
}