{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t          Have you ever had a great app idea, had an interest in coding or just wanted to learn a new skill?  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">      Well this course is just for you!  </strong></em>  </p>  <p style=\"\">  \t<em style=\"\">      Swift</em> is a new programming language by Apple that is used for developing iOS and OSX applications!  </p>  <p style=\"\">  \t            If you have ever wondered how the apps on your <em style=\"\">iPhone, iPad</em> or a <em style=\"\">Mac</em> computer are made then here is the big secret they are coded in a programming language and now with the release of Apple’s new programming language Swift it has never been a better time to start learning.  </p>  <p style=\"\">  \t            Not only is coding a highly in demand skill in the current job market but it is also extremely rewarding and empowering.  </p>  <p style=\"\">  \t            Since Swift Just came out there are very few experts in the field and those that want to go in to coding or app development will be at a huge advantage by taking the step to learn the programming language necessary to code for mobile technologies, specifically iOS.  </p>  <p style=\"\">  \t            And that is where this course comes in!  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">      You are getting in on the ground level of massively in demand and useful skill.  </strong></em>  </p>  <p style=\"\">  \t            My name is Ibram Uppal and I am the owner of <em style=\"\">Megaplex Applications</em> an iOS apps development company and also a full time mobile and web developer.  </p>  <p style=\"\">  \t            With this course you will learn programming from the absolute basics all the way to more advanced topics, as well as best practices for coding.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">      You do not need any experience programming to take this course</strong></em>. So beginners welcome.  </p>  <p style=\"\">  \t            So I welcome you to the start of your very exciting journey into iOS and mobile development in <em style=\"\"><strong style=\"\">the Comprehensive Guide to Swift</strong></em>.  </p>", 
    "end_date": null, 
    "title": "The Comprehensive Guide to Swift ", 
    "price": "30.00", 
    "instructors": "CEO / Lead Developer Ibram Uppal", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380628_306d_3.jpg", 
    "course_url": "https://www.udemy.com/the-comprehensive-guide-to-swift/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-30T05:31:58Z"
}