{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t    PHP is an invaluable tool to help web developers build powerful websites. Despite how PHP powerful it is, few web developers know how to use PHP to its full potential, which is where our <strong style=\"\">Ultimate PHP Training Bundle</strong> comes in.  </p>  <p style=\"\">  \t       This training bundle combines two jam-packed PHP courses into one training bundle.  </p>  <p style=\"\">  \t       The bundle includes:  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">12.5 hours of video tutorials</em></li>  \t<li style=\"\"><em style=\"\">90+<strong style=\"\"> </strong>individual video lectures</em></li>  \t<li style=\"\"><em style=\"\">2 Quizzes with 80 questions</em></li>  \t<li style=\"\"><em style=\"\">Certificate of completion</em></li>  </ul>  <p style=\"\">  \t<strong style=\"\">Courses included with this bundle:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Learn PHP Programming for Beginners</strong>  </p>  <p style=\"\">  \t       These days, you’re nowhere without a website, so there’s a huge value to web development skills. PHP is one of the most widely-used scripting languages around, and this course will help you master the basics of the language so that you can build your own website, or help refine your company’s. Discover the power of PHP as you take your website development skills to the next level.  </p>  <p style=\"\">  \t       During this 6.5 hour PHP beginner course, discover the fundamental concepts beginner PHP developers need to master. Your professional instructor combines practical lectures that ensure you have a solid grasp of the basics with coding examples that include exercise files so you get real hands-on practice.  </p>  <p style=\"\">  \t          Follow along as you learn the PHP syntax, development environment, and other basic concepts. Discover more advanced topics including database storage, object oriented development, using the standard PHP library, and basic SQL language commands.  </p>  <p style=\"\">  \t<strong style=\"\">Learn Advanced PHP Programming</strong>  </p>  <p style=\"\">  \t       During this 6 hour advanced PHP course, discover the power of PHP as you take your website development skills to the next level. Your professional instructor combines practical lectures that ensure you have a solid grasp of the concepts with coding examples that include exercise files so you get real hands-on practice.  </p>  <p style=\"\">  \t        Follow along as you learn functions, date and time manipulation, debugging and application logging. Discover the use of strings, REGEX, runtime error handling, the use of file resources, manipulating file date including reading and parsing data in a CSV file format.  </p>  <p style=\"\">  \t        Learn methods for database access, design patterns, using the mail function, PEAR, the PHP Extension and Application Repository, and cURL, a library that lets you make HTTP requests.  </p>  <p style=\"\">  \t        The advanced PHP training continues with topics on web services, introspection and reflection, Smarty Templates, sessions, different PHP frameworks, and some PHP best practices.  </p>  <p style=\"\">  \t        Are you ready to launch your PHP skills the next level?  </p>", 
    "end_date": null, 
    "title": "The Ultimate PHP Training Bundle for Beginner to Advanced", 
    "price": "30.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/129580_412c_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-php-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-05T17:10:54Z"
}