{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Ever wanted to learn one of the most popular programming languages on the planet? Why not learn two of the most popular at the same time?</strong></p>\n\n<p>Python and SQL are used by many technology companies, small and large. That's because they are powerful, yet extremely flexible.</p>\n\n<p>Python is used in the industry for things like embedded software, web development, desktop applications, and even mobile apps!</p>\n\n<p>PostgreSQL allows your applications to become even more powerful by storing, retrieving, and filtering through large data sets easily.</p>\n\n<p>This course is your one-stop shop for everything Python and PostgreSQL, and the instructor is constantly available to support your learning and answer questions.</p>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Gallop through — or go at your own speed</em></strong></p>\n\n<p>You'll gain immediate access over 160 lectures and more than 20 hours of content, each developed with ease of learning in mind.</p>\n\n<p>Using my previous teaching experience I've created crystal-clear and original content which you'll find easy to understand - and more importantly - to absorb.</p>\n\n<p>You'll find learning both quick and fun. And, I've used techniques proven to effortlessly lock that knowledge in, as you breeze through each comprehensive chapter.</p>\n\n<p><strong class=\"redactor-inline-converted\"><em>Fun, fast, and effective</em></strong></p>\n\n<p>This course will get you from being an absolute Python and PostgreSQL beginner to an experienced software developer.</p>\n\n<p>Don't believe me? I offer a full money back guarantee, so long as you request it within 30 days of your purchase of the course.</p>\n\n<p>Are you ready to transform your world and become an uber-confident app developer?</p>\n\n<p><strong class=\"redactor-inline-converted\">I'll see you on the inside!</strong></p>", 
    "end_date": null, 
    "title": "The Complete Python/PostgreSQL Developer Course", 
    "price": "20.00", 
    "instructors": "Rob Percival, Jose Salvatierra", 
    "commitment": "21.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/781502_305d_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-python-postgresql-developer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-03T20:55:40Z"
}