{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tTHE MOST COMPREHENSIVE AND IN DEPTH TUTORIAL ON JAVA 8 THAT YOU WOULD FIND ON UDEMY. EVERY CONCEPT IS COVERED IN DEPTH AND EXPLAINED THOROUGHLY TO ENABLE YOU TO CODE BETTER.</p><p><span style=\"color: inherit;\"><strong>Whats new in the Course ?????</strong></span></p><p><span style=\"color: inherit;\"><strong>Well everything is changing. New Sections on Java 8 API on Date and Time and Enumerations, Completely revamped Section on Language Basics and more is coming in 2016.</strong></span></p><p><span style=\"color: inherit;\">The course </span><span style=\"color: inherit;\">intends to teach everything you need to know to kick start a career in Java. The course is focused on learning language basics and teaches you how to efficiently write code in Java.</span></p><p><span style=\"color: inherit;\">Check out our new Section on Lambda Expressions covering Lambda expressions and method references in detail.</span></p>  <p>  \t<strong>The Course is being updated with new Sections &amp; Lectures to add new API's from Java 8. Start learning today as the cost shall be revised with every new Section Addition.</strong>  </p>  <p>  \t<strong><strong>If you any doubts while following the course, our support team shall address the same.  </strong></strong>  </p>  <p>  \t  JUST MAIL US YOUR DOUBTS AT<strong> </strong><span style=\"color: inherit;\"><strong>LEARNINGKARTCOURSES@GMAIL.COM </strong>and we shall address the same.</span>  </p>      <p>  \t<strong><strong>SO KICK START YOUR JAVA LEARNING NOW.</strong></strong>  </p>        <p>  \t                                                             This tutorial is intended to make Learning Java as simple as sipping a cup of Coffee.   We cover every minute details of the concepts you need to know and provide examples of how to work with Java API's for practical purposes.  </p>  <p>  \t<strong>                About this Tutorial  </strong>  </p>  <p>We have tried to cover all basics aspects practically and where ever possible explain things theoretically to clear the fundamentals. The course is conducted mainly on Eclipse to keep up with time and wherever possible for clear understanding we have used Notepad as Editor.<br></p><p><strong>Let us know if you still face trouble in learning the language of choice - JAVA 8.</strong></p>", 
    "end_date": null, 
    "title": "The Ultimate Java 8 Tutorial - From beginner to professional", 
    "price": "20.00", 
    "instructors": "Learning Kart", 
    "commitment": "20 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49340_1a8d_6.jpg", 
    "course_url": "https://www.udemy.com/java-basics-for-j2ee-and-android/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-11T08:12:46Z"
}