{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Ruby is a fun toy and language and it's also a serious programming language,became a prgrammer is a combination of scientist and artist.</p>\n\n<p>In this course you will learn the ultimate and complete guide to build programs that increase your skills working on the Ruby language.</p>\n\n<p>We will post excercises that challenge to our students and improve their programming skills,this will help them to master :</p>\n\n<p>(1) Logic and object-oriented programming </p>\n\n<p>(2) Ruby language</p>\n\n<p> (3) Learn to solve problems in more than one way.</p>\n\n<p><strong>Course Description</strong></p>\n\n<p>You'll learn the foundations of an object-oriented language like Ruby,if you have experience with programming you can jump and go directly to the excercises, but we receive feedback from experts that learn things or understand what they programm automatically but without understand what they program.</p>\n\n<p><strong>Content and Overview</strong><br></p>\n\n<p>This course is good for beginners,we ensure to get totally understood and want you understand the logic and foundations behind any line of code.</p>\n\n<p>The students who finish this course will not just learn Ruby and create functional anduseful programs  and applications, they will learn to THINK , for us this is more important,we want that you learn to solve problems in more than one way and we´re looking for more and more problems and excercise to improve your programming and solving problem skills.</p>\n\n<p><strong>What I´m going to learn from this course?</strong><br></p>\n\n<ul><li>Learn Ruby programming language</li><li>Learn the best Object-Oriented language with real world examples,we ensure to not to be misunderstood.</li><li>Get surprised with new challenging excercises </li><li>The most complete guide of Ruby language , we don't miss any subject</li><li>The most important: Think like a programmer and learn to solve problem in more than one way.</li></ul>\n\n<p><strong>Do I need something?</strong></p>\n\n<p>You don't need nothing actually, you have a computer and download the open source Ruby (free).</p>\n\n<p>We will not force you to use any IDE,package,hosting,membership,because we want that you learn to use the free tools that an open source language like Ruby gives you.</p>\n\n<p>We hope you enjoy the course!<br></p>", 
    "end_date": null, 
    "title": "The Programmers Guide : Learn Ruby Programming Fundamentals", 
    "price": "20.00", 
    "instructors": "@GeekCodeSchool Code Shool", 
    "commitment": "19.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733426_4962_3.jpg", 
    "course_url": "https://www.udemy.com/ruby-the-complete-guide-build-programs-and-have-fun-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T22:39:36Z"
}