{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Welcome To The Complete Java Developer Course: Beginner To Expert</strong></p><p><strong class=\"redactor-inline-converted\">Here Is What You Get By Enrolling In This Course:</strong></p><p><strong class=\"redactor-inline-converted\">Word-By-Word Explanation:</strong> In the entire course, I explain each line of code, without skipping a single line of code.</p><p><strong class=\"redactor-inline-converted\">Practice Examples: </strong>Special set of practice examples included at the end of each section.<br></p><p><strong class=\"redactor-inline-converted\">Awesome Quality Content:</strong> Over 7+ hours of HD(1080p) Videos.</p><p><strong class=\"redactor-inline-converted\">Well Structured &amp; Easy To Learn: </strong>Course has been specially designed to make it easy for the students to learn Java.</p><p><strong class=\"redactor-inline-converted\">Notes</strong>: Study material has been provided at the end of each section to help student revise the concepts covered in this course.</p><p><strong class=\"redactor-inline-converted\">24 X 7 Support:</strong> I will always be there to guide you in your journey to become a Java developer. Student queries and problems will be answered immediately.<br></p><p>_________________________________________________________________________</p><p><strong class=\"redactor-inline-converted\">Here Is Everything You Will Learn In This Complete Course: <br></strong></p><p>How to write Java Programs From Scratch.</p><p>How to design user interface using the latest JavaFX tools.</p><p>How to use the principles of object oriented programming in Java.</p><p>Learn about scene builder, make user interfaces instantly.</p><p><br></p><p>We first begin the course with the steps involved in setting up the development environment. Once the environment is set up we start by writing simple Java code. Then we gradually move along to understand what are variables in Java and we also learn how to accept the user input in Java.</p><p>Moving along, we learn what are loops arrays and classes in Java. We understand why the concept of class in used in Java. We also learn the significance and working of different types of loops such as the for loop and the while loop. After that we learn the concepts of arrays and strings in Java. We learn what are arrays and how arrays can be used to store data while writing java programs.</p><p>Moving along we learn the most important concept in Java, i.e the object oriented programming.In this we learn what are objects, classes and methods. We also learn about inheritance, encapsulation and polymorphism.</p><p>_________________________________________________________________________</p><p>So let's begin the journey of becoming a <strong class=\"redactor-inline-converted\">Java Developer.</strong></p><p>In addition to the <strong class=\"redactor-inline-converted\">Udemy</strong> <strong class=\"redactor-inline-converted\">30-day money back guarantee</strong>,you have my personal guarantee that you will love what you learn in this course. If you ever have any questions please feel free to message me directly and I will do my best to get back to you as soon as <br>possible!</p><p>_________________________________________________________________________</p><p>Make sure to enroll in the course before the price changes.</p><p>Take yourself one step closer towards becoming a professional Java developer <strong class=\"redactor-inline-converted\">by clicking the \"take this course button\" now!</strong></p><p>Join the journey.</p><p><strong class=\"redactor-inline-converted\">Sincerely,</strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"> Ashutosh Pawar </strong></p><p><br></p><br>", 
    "end_date": null, 
    "title": "The Complete Java Developer Course: Beginner To Expert", 
    "price": "20.00", 
    "instructors": "Ashutosh Pawar", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/760398_b699_2.jpg", 
    "course_url": "https://www.udemy.com/javaprogrammingcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-12T06:02:52Z"
}