{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>This course is under active development, signup today before the price increases!</strong></p><p>We all use Swift in our iOS development, we love it! Really \"Swift is an great language\". Have you ever seen Swifts beauty as a language rather than using for iOS development?</p><p>You keep on hearing about functional programming from every one, have you ever thought or gave a try on it? If you do so, people says functional programming concept is built on top of Maths! Does this fear you? Have you ever imagined how map, reduce methods in Swift designed? And their  <strong><em>philosophy</em></strong> behind it? </p><p>In this course, your going to learn functional programming using your favourite language Swift in a fun way. This course is designed for beginners to understand how to get much benefit from both functional programming and Swift as well! Believe me, we are going to introduce functional concepts in <strong><em>plain english, no maths stuffs!!</em></strong></p><p>The gist of the course is as follows:</p><p>1. Understand what is functional programming is all about</p><p>2. How Swift supports functional programming</p><p>3. Higher-order functions</p><p>4. Closures</p><p>5. Currying</p><p>6. Composition</p><p>7. Finally write your own version of map, filter, reduce using FP concepts!</p><p>and much more. And all the above in plain simple english terms and concice examples!</p><p>And we need to understand <strong>what this course is not</strong>:</p><p>1. Wont teach you Swift basics</p><p>2. Wont teach you how to run Swift program </p><p>And as mentioned before it teaches only <strong>\"Functional Programming Using Swift\".</strong></p><p>At end of this course, students will be in a position to go and implement functional programming concepts in their iOS development, which results in maintainable code base. </p>", 
    "end_date": null, 
    "title": "Thinking Functionally in Swift", 
    "price": "20.00", 
    "instructors": "Anto Aravinth", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628530_66a0_3.jpg", 
    "course_url": "https://www.udemy.com/thinking-functionally-in-swift/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T03:42:05Z"
}