{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Ever thought that ruby metaprogramming is reserved for experienced ruby gurus? Well, not anymore!</p><p style=\"\">Almost all ruby developers want to learn metaprogramming. But, <strong style=\"\">approaching the subject might feel a bit intimidating</strong>. Because, every time you tried, all available material was referring to even more complicated or less known concepts. Such as: eigenclasses, ruby object model, classes being objects themselves, etc.</p><p style=\"\">Several years ago, I spent several months researching about ruby metaprogramming and synthesising all available material. At the end, it <strong style=\"\">turned out to be very simple to grasp and understand</strong>. The only problem is that there was no one resource that put all moving parts of the subject together and the result is this Ruby Metaprogramming course.</p><p style=\"\">This video course will teach you ruby metaprogramming by introducing small, simple and less known ruby insights in each video. And once you learn them, metaprogramming will just start to make sense.</p><p style=\"\">At the end of the course, you will:</p><ul style=\"\"><li style=\"\">Understand Ruby Metaprogramming and join the &quot;Ruby Metaprogramming Gurus&quot; club.</li><li style=\"\">Better understand the Ruby language. Since, metaprogramming is in integral part of the laguage.</li><li style=\"\">Write more efficient and elegant ruby code using language&#039;s metaprogramming features.</li><li style=\"\">Be able to understand and explain the magic behind the code/syntax in all popular gems.</li><li style=\"\">and of course write your own DSL&#039;s for your domains (just like rspec, rake, etc.).</li></ul><p style=\"\"><strong style=\"\">Course overview</strong></p><p style=\"\">Metaprogramming is such an integral part of the Ruby language, that in order to learn it, you need to understand the specific language features. This features are less known and usually ruby books don&#039;t explain them. But, once you are introduced to them, metaprogramming will start to make sense. That&#039;s why, the course&#039;s main content will start by introducing several Ruby insights.</p><p style=\"\">In the next section of the course, you will learn about methods that are involved in metaprogramming. Along the way, we will go through several examples that demystifies magic behind most popular gem syntaxes.</p><p style=\"\">In the last section of the course, we will put together everything you learned into practice and build together our own rspec, domain specific language and some of the rails most popular magical methods.</p>", 
    "end_date": null, 
    "title": "Ultimate Ruby Metaprogramming Course", 
    "price": "50.00", 
    "instructors": "Said Abduvaliev", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48631_98a2_3.jpg", 
    "course_url": "https://www.udemy.com/ruby-metaprogramming/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-05T07:55:02Z"
}