{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">.NET platformu,</strong> yazılım geliştirme konusunda etkin bir kullanım oranına sahiptir. C#.NET, .NET platformu için özel olarak geliştirilmiş bir programlama dilidir. Yazılım dünyasında, çok tutularak diğer programlama dilleri arasında önemli bir yer almıştır.  </p>  <p>  \t<strong style=\"\">Bu kurs içeriğinde,</strong> .Net&#039;in resmi dili olarak kabul edilen (.Net, C# dili kullanılarak gerçeklenmiştir.) C# dili detaylarıyla öğretilir. C# çeşitli görsel programlama araçlarıyla ve hızlı yazılım geliştirebileceğiniz şekilde donatılmıştır. C#&#039;a ait detaylı özellikler ve zengin örnekler, bölüm bölüm ele alınarak Visual Studio 2012 veya daha üstü bir IDE(Yazılım Geliştirme Editörü) kullanılarak öğretilir. Dersler; Visual Studio 2012-2013 Premium Editon üzerinde işlenmiştir. Dilerseniz Visual Studio 2008 (ya da daha üstü) veya Visual Studio 2013 Express(ücretsiz) (ya da daha üstü) de kullanılabilir.  </p>  <p>  \t<strong style=\"\">Bu kurs C#.Net&#039;i</strong> hızlıca, basitleştirilmiş ve pratik bir şekilde öğrenebilmenizi sağlayacak şekilde temel seviyeden ileri seviyeye doğru giden kısımlardan oluşturulmuştur. Kısımlar konuları kolayca anlayabileceğiniz şekilde sıralanmıştır. Sırasıyla izlemenizi tavsiye ederim.  </p>  <p>  \t        Bu kurs en temel 11 kısımdan oluşmaktadır. Ekstra kısımların ilerleyen zamanlarda dahil edilmesi planlanmaktadır.  </p>  <p>  \t<strong style=\"\">C#.Net eğitimi sayesinde,</strong> geleceğin teknolojisi olan yeni yazılım ve programlama alanında uzmanlaşabileceksiniz.  </p>  <p>  \t<strong style=\"\">Yazılım önümüzdeki yıllarda,</strong> sosyal hayatımızda etkisini bu gün olduğundan daha da fazla artıracaktır. Orta düzey bilgisayar ve ingilizce bilgisine sahip, kendi projelerini veya çalıştığı kuruma ait projelerini gerçekleştirmek isteyen herkes bu eğitimi almalıdır.  </p>  <p>  \t<strong style=\"\"><em style=\"\">Materyal adresleri;</em></strong>  </p>  <ul style=\"\">  \t<li>Minimum Visual Studio 2010 Express Hepsi Bir Arada ISO(ücretsiz) yada ücretli olan daha üstü sürümleri(Professional, Ultimate) kullanılabilir.<br style=\"\">  \t</li>  \t<li>Visual Studio Express(ücretsiz) ya da ücretli olan daha üstü sürümleri(Premium, Professional, Ultimate) kullanılabilir.</li>  \t<li>Microsoft Office Access</li>  \t<li>Minimum Microsoft SQL Server 2008 Express with Tools(ücretsiz) ya da daha üstü</li>  \t<li>Microsoft SQL Server 2012 Express with Tools(ücretsiz) ya da daha üstü (<strong style=\"\">SQLEXPRWT </strong>ifadesi olan dosyalardan birini indirebilirsiniz.)</li>  \t<li>.NET Framework 4.0</li>  </ul>", 
    "end_date": null, 
    "title": "Visual Studio ile C# Programlama", 
    "price": "35.00", 
    "instructors": "Kadir Murat BAŞEREN", 
    "commitment": "36 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/34026_12b8_14.jpg", 
    "course_url": "https://www.udemy.com/visual-studio-ile-temel-ve-ileri-seviye-cnet-ogrenin/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-01T18:15:29Z"
}