{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<em style=\"\">&quot;<strong style=\"\">Data Science is the sexiest job of the 21st century -  It has exciting work and incredible pay</strong></em>&quot;. You have been hearing about this a lot. You try to get more information on this and start querying and browsing. You get so many definitions, requirements, predictions, opinions and  recommendations. At the end, you are perplexed. And you ask -  &quot;<strong style=\"\">What exactly is this field all about? Is it a good career for me?</strong>&quot;  </p>  <p>  \t            Data Science is a new field that is just shaping up; hence all the confusion around what it really is. It is also a hybrid field that requires multiple skills and training. We have been training students in Data Science. A number of them committed to training without realizing what it really is. <em style=\"\"><strong style=\"\">Some were happy, some adjusted their expectations and some regretted committing too soon</strong></em>. We felt that professionals thinking of getting into Data Science needed a primer in what this field is all about. Hence, we came up with this course.  </p>  <p>  \t            Through this course, you will  </p>  <ul style=\"\">  \t<li style=\"\">Understand what Data Science is</li>  \t<li style=\"\">Appreciate the work Data Scientists do on a daily basis</li>  \t<li style=\"\">Differentiate the various roles in Data Science and  skills needed to perform them</li>  \t<li style=\"\">Learn about the challenges Data Scientists face</li>  \t<li style=\"\">Make a choice of whether you want to pursue this path</li>  \t<li style=\"\">Know about where opportunities exist and how to go for them</li>  </ul>  <p>  \t            Data Science courses are expensive and time consuming. Before committing, it is a smart choice for you to know about what you are getting into. This course will help you to do that.  </p>", 
    "end_date": null, 
    "title": "Want to be a Data Scientist?", 
    "price": 0, 
    "instructors": "V2 Maestros", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370774_489f_18.jpg", 
    "course_url": "https://www.udemy.com/want-to-be-a-data-scientist/", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T15:29:19Z"
}