{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t          ** The ONLY course with all ratings  5* on Udemy **  </p>  <p>\n  \t          Looking to boost your income as a web developer? Or maybe \nyou're seeking a career change that gives you more free time and \nflexibility?  </p>  <p>  \t          Whatever your motivation to become a pro web developer, you've come to the right place.  </p>  <p>  \t<em>The PHP Programmer Starter Kit</em> is THE most comprehensive, cost-effective, time conscious and career-enhancing web design course you'll find on the web – or you get your money back.  </p>  <p>\n  \t          It's the course that's going to get you building professional websites that engage visitors, call them to action\n and ultimately - make you money in only 10 hours!  </p>  <p>  \t          This fast, effective course takes you easily from zero skills to income earning web developer in ONLY 10 hours.  </p>  <p>\n  \t          Not only that but you'll get one on one mentoring with me, the instructor, till you complete the course including choosing the next path to take after you learn web design. I also show you how to start earning $$$ before you're finished with the course.  </p>  <p>  \t          What's involved?  </p>  <p>\n  \t          You'll gain immediate access to 18 painstakingly-designed \nchapters, each developed with ease of learning in mind. Using my \nbackground as a mentor and instructor  I've created crystal-clear, original content \nwhich you'll find easy to understand - and more importantly - to absorb.\n  </p>  <p>  \t          You'll find learning both quick and \nfun. And, I've used techniques proven to effortlessly lock that \nknowledge in, as you gallop through each comprehensive chapter.  </p>  <p>\n  \t          If you're looking for a genuinely effective course that \nequips you to build stunningly presented, websites that will start \nearning you cash, I personally guarantee this is the number one course \nfor you.  </p>  <p>  \t<u>Don't believe me? I offer a full money back guarantee, so long as you are not able to build websites after completing the course.</u>  </p>  <p>  \t          Are you ready to transform your world and become a confident, cash-earning web developer?  </p>  <p>  \t          Here's what you get when you choose to <em>Learn Web Design</em> with the PHP Programmer Starter Kit course:  </p>  <p>  \t          You'll get access to 18 clearly laid out and straight to the point chapters that will give you a deep understanding of each topic using real life examples at every juncture.  </p><p>My main goal of bringing you this course is to embrace project based learning so that we remove all the time you would waste dwelling too much in the basics.</p><p>You get to learn by working on a project ground up.</p><p>We build a complete user management system...all from sign up, login, user profile, revenue visualization dashboard, admin panel...<br></p><p>  \t          Each chapter is supported with hours of clear, engaging video tutorials and practical website challenges.  </p>  <p>  \t          All at your fingers tips. Instantly.  </p>  <ul><p>\n  \t\t          ·The course starts with the basics. I'll show you the tips\n and tricks to work effortlessly with web technologies like PHP and HTML.  \t</p><p>.I completely take the sweat out of database management and show you how to use MySQL database with absolute ease...easier than you imagined!<br></p><p>  \t\t          ·Once you're doing \nthat in your sleep, I'll show you how to build your own responsive \nwebsites using more advanced techniques such as iQuery PHP, MySQL and\nTwitter Bootstrap.  \t</p><p>  \t\t          ·By then you'll be able to develop blogs and eCommerce sites with Wordpress, and learn \nintelligent ways to add dynamic content, using APls to connect to sites \nsuch as Google Maps and Facebook.  \t</p><p>  \t\t          ·As\n Richard Branson says, 'The best way of learning is by doing,' so you'll\n complete website challenges at every section. As you painlessly tick \nthem off, you'll use your skills to put a website together as you go. The \nfinal challenge is a full User Management System.  \t</p></ul>  <p>  \t          Over 18 chapters you will learn:  </p>  <ul><p>  \t\t          ·Setting up your local hosting environment  \t</p><p>  \t\t          ·HTM, CSS,·jQuery  \t</p><p>  \t\t          ·Responsive Design  \t</p><p>  \t\t          ·PHP Coding  \t</p><p>  \t\t          ·MySQL Databases  \t</p><p>  \t\t          ·<em><u>Bonus Content: How to found a startup and make $1800/month just after one year</u></em>  \t</p></ul>  <p>  \t          What else will you get?  </p>  <ul><p>  \t\t          ·A friendly, informal community to support you every step of the way  \t</p><p>  \t\t          ·Personal contact with me, the course tutor  \t</p><p>  \t\t          ·Ebooks that will show you how to start earning before you've even finished  \t</p><p>  \t\t          ·Lifetime access to course materials  \t</p><p>  \t\t          ·Hands-on learning to lock that knowledge in  \t</p><p>  \t\t          ·A deep understanding of how to code, design and build powerful websites  \t</p></ul>  <p>\n  \t          You'll never have to waste your time and hard-earned cash to \nlearn web design from books, expensive online web development courses and YouTube videos. With \nThe PHP Programmer Starter Kit Course you get everything you need, all under \none convenient, easy to navigate platform. Plus, you will get fast, \nfriendly, responsive support by email, Twitter and on the Udemy forums. \n </p>  <p>  \t          I will never leave you hanging, frustrated and confused! My goal is to make achieving your dream a fun game.<br></p>    <p>  \t          It \ndoesn't matter how old you are or what you do professionally. I \nguarantee that ANYONE can benefit from this course, whether it's earning\n a bit of extra cash on the side or changing your dream career altogether.  </p>  <p>  \t<u>So what <em>are\n you waiting for? Transform your world, grab your dream career. Sign up now to get a free \ncopy of my exclusive  'How to found a startup and make $1,800/month'.</em></u>  </p>", 
    "end_date": null, 
    "title": "Web Design Career: The PHP Programmer Starter Kit ", 
    "price": "50.00", 
    "instructors": "Mr. Geoffrey Bans", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667660_3166_6.jpg", 
    "course_url": "https://www.udemy.com/web-design-career-the-php-programmer-starter-kit/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T09:03:51Z"
}