{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Programming interviews are like standard plays in professional sport - prepare accordingly. Don't let Programming Interview gotchas get you down!</strong></p><ul><li><strong>The course instruction is in Hindi</strong></li><li><strong>Programming interviews differ from real programming jobs</strong> in several important aspects, so they merit being treated differently, just like set pieces in sport.</li><li>Just like teams prepare for their opponent's playbooks in professional sport, it makes sense for you to <strong>approach programming interviews anticipating the interviewer's playbook</strong></li><li>This course has been drawn by a team that has conducted <strong>hundreds of technical interviews at Google and Flipkart</strong></li></ul><p><strong>What's Covered:</strong><br></p><ul><li><strong>Pointers</strong>: Memory layout of pointers and variables, pointer arithmetic, arrays, pointers to pointers, pointers to structures, argument passing to functions, pointer reassignment and modification - complete with visuals to help you conceptualize how things work.</li><li><strong>Strings</strong>: Strings, Character pointers, character arrays, null termination of strings, string.h function implementations with detailed explanations.</li><li><strong>Linked lists</strong>: Visualization, traversal, creating or deleting nodes, sorted merge, reversing a linked list and many many problems and solutions, doubly linked lists.</li><li><strong>Sorting and searching algorithms</strong>: Visualize how common sorting and searching algorithms work and the speed and efficiency of those algorithms</li><li><strong>Recursion</strong>: Master recursion with lots of practice! 8 common and uncommon recursive problems explained. Binary search, finding all subsets of a subset, finding all anagrams of a word, the infamous 8 Queens problem, executing dependent tasks, finding a path through a maze, implementing PaintFill, comparing two binary trees</li><li><strong>Step-by-step solutions to dozens of common programming problems:</strong> Palindromes, Game of Life, Sudoku Validator, Breaking a Document into Chunks, Run Length Encoding, Points within a distance are some of the problems solved and explained.</li><li><strong>Trees and Binary Search Trees</strong></li><li><strong>Heaps and Binary Heaps</strong></li><li><strong>Graphs</strong></li></ul><p><strong>Talk to us!</strong></p><p>Mail us about anything - anything! - and we will <strong>always</strong> reply :-)</p>", 
    "end_date": null, 
    "title": "कीजिये तैयारी Programming & Coding Interviews की", 
    "price": "20.00", 
    "instructors": "Loony Corn", 
    "commitment": "20.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/799436_0ded.jpg", 
    "course_url": "https://www.udemy.com/hindi-programming-interviews/", 
    "currency": "USD", 
    "subject_name": [
        "Programming Languages"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T05:42:57Z"
}