{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Science\n                                                                                                    &gt; Environmental Science\n                                                            \n                            \n                                                \n                    \n                    \n                    What is Climate Change? How should we respond to\nClimate Change? These questions are complex, not least because the responses\navailable to us depend upon who is providing the answers and the particular\nperspective they take. The economist sees the economic challenges and\nopportunities of Climate Change; the scientist sees the need to describe and\nexplain Climate Change; the policy-maker and social scientist\nsee Climate Change as a social problem. Therefore, the first step to\nunderstanding Climate Change and what we do about it is to see how experts from\ndifferent disciplines engage with the issue. The second step is to appreciate how\nour response to Climate Change depends upon the interplay between these\ndifferent approaches.\n\nThis course offers you an introduction to different\ndisciplinary perspectives on Climate Change to help you think about how Climate Change\naffects you as an individual, as a member of your local community, as a citizen\nof your country and as a member of the global community. We have designed the\npresentations, discussions, activities and assessment tasks in this course to\nhelp you understand what Climate Change is and what you – and we – should do about it.\n\n\n\n\n\n\n                                            Syllabus\n                        The overall aim of this subject is to provide an introduction to the socio-political, scientific, and economic aspects of the phenomenon known as Climate Change. In doing so it is hoped that the student will emerge with an enhanced ability to analyse claims both about the science itself and the responses that can be made by humanity at present and for the future, based on current scientific data and its predictions over the next decades. You will emerge with a broad understanding of the science underpinning the claim that human activity has played a role in causing the current rise in global temperature. You will also develop an awareness of the present and future impact on global communities, the political response to such impacts, and consider basic economic concepts and models that describe a framework in which changes to our use of resources can occur. \n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Climate Change", "price": 0, "instructors": "Prof Jon Barnett, Prof John Freebairn, Prof David Jamieson, Dr Maurizio Toscano and Prof Rachel Webster", "institution_name": ["University of Melbourne"], "commitment": "6-8 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/course/climatechange", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-08-31T00:00:00Z"}