{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    \n\t*Note - This is an Archived course*\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\nThis course will detail urban water services, focusing on basic drinking water and wastewater treatment technologies. Unit processes involved in the two treatment chains will be described as well as the physical, chemical and biological processes involved. There will be an emphasis on water quality and the functionality of each unit process within the treatment chain.  After the course one should be able to recognise the process units, describe their function and make simple design calculations on water treatment  plants (drinking and waste water).  Overall the course will teach the role of treatment technologies in providing adequate water supply and effective sanitation which are essential for human society and the safeguarding of public and environmental health.\nThere is a global trend towards urbanisation with over 50% of humanity currently residing in urban areas. Water is invariably linked to urban functionality, as industrial, domestic and agricultural use. Essential services such as drinking water supply, sanitation and wastewater treatment to protect surface water and groundwater resources need to be present in such environment. The provision of these essential urban water services present real challenges in many parts of the world today.\nAccessible fresh water resources suitable for drinking water and other ecosystem services is approximated to be 200,000 km3, approximately 0.3% of the total freshwater resources and less than 0.01% of the total water on earth. These accessible freshwater resources are not equally distributed and many countries today are experiencing water scarcity which in turn affects community health and in many places water scarcity is the inhibiting factor for economic growth. This highlights the importance of conserving and protecting the accessible freshwater resources, through the implementation of adequate treatment technologies combined with a robust infrastructure. Through utilising relevant treatment technologies to upgrade water to a quality suitable for subsequent use or discharge with more and more stringent effluent demands, the urban water chain has the possibility to transform to an urban water cycle and improve interactions within the greater hydrological cycle.\nBefore your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.\n\n                                    ", "end_date": "2013-11-18T00:00:00Z", "title": "CTB3365x: Introduction to Water Treatment", "price": 0, "instructors": "Jules van Lier, Luuk Rietveld, Merle de Kreuk, Peter de Moel and Anke Grefte", "institution_name": ["Delft University of Technology"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.edx.org/course/delftx/delftx-ctb3365x-introduction-water-786", "duration": "9 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2013-09-16T00:00:00Z"}