{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    This course is about making difficult decisions on the management of natural resources. Different people place different values on nature. For example, some see it as something we should conserve for future generations, others as a resource of financial value to be exploited. Policies about managing nature should be economically and environmentally sound, but they also need to be formulated with social fairness if they are to be sustainable. Inevitably, when there are so many different values, conflicts occur and worlds collide.\n\nWe start the course by examining a number of basic principles and then apply them to two case studies. The first case study looks at a range of classic examples, and the second takes the form of a debate centred on our own research. The basic principles can be applied in many different contexts and the case studies are drawn from all over the world, making the course suitable for participants from a wide range of countries and backgrounds.\n\nThere are no easy answers to many questions about the management of nature, but an understanding of the principles we discuss and learning how to apply them will help you make better decisions.\n\nAccreditation\n\nThis course has been certified by the CPD Certification Service as conforming to continuing professional development principles. By completing the course you will have achieved 8 hours of CPD time.\n\n\n                                    ", "end_date": "2015-11-02T00:00:00Z", "title": "Fairness and Nature: When Worlds Collide", "price": 0, "instructors": "Jon Lovett", "institution_name": ["University of Leeds"], "commitment": "", "subject_name": ["Science"], "course_url": "http://www.futurelearn.com/courses/fairness-and-nature?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "2 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2015-10-19T00:00:00Z"}