{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    Ziel des Kurses ist die Vermittlung von theoretischen Grundlagen für Entscheidungen in der Produktion und die anschließende Darstellung an konkreten Praxisbeispielen. Dabei befasst sich der Kurs vor allem mit dem Bereich der Beschaffung von langfristigen Produktionsmitteln wie z.B. Schleppern. Dabei wird die Frage behandelt, ob das langfristige Produktionsmittel gekauft oder besser gemietet werden soll. Am Beispiel solcher Fragestellung werden die theoretischen Grundlagen wirtschaftlicher Entscheidungen dargestellt und diskutiert. Im Anschluss werden die erarbeiteten theoretischen Grundlagen auf konkrete Praxisbeispiele angewandt. Die erzielten Ergebnisse werden aus der Sicht von Entscheidungsträgern erläutert und bewertet.Der Kurs verwendet zusätzlich Moodle. Für jedes Modul ist eine Diskussions- und Fragestunde in einem virtuellen Chatroom eingeplant, auf die alle Nutzer Zugriff haben.\r\nDer Kurs wird sowohl in Deutsch als auch Russisch angeboten.\r\nWas lerne ich in diesem Kurs?\r\n\r\nKosten sauber zu definieren, Kostenkategorien zu erklären und die Begriffe an typischen Beispielen der Landwirtschaft anzuwenden\r\nMaschinenkosten, Verfahrenskosten, Vergleichskosten zu definieren und anzuwenden\r\nGesamtkosten je Jahr und Kosten je Einsatzeinheit wie z.B. Schlepperstunde oder Hektar zu berechnen und sachgerecht zu interpretieren\r\nMindesteinsatzumfang für Maschinen und Geräte für typische landwirtschaftliche Produktionsmittel zu berechnen und die Ergebnisse sachgerecht zu interpretieren\r\n\r\nWelche Vorkenntnisse brauche ich?\r\nUm erfolgreich am Kurs teilzunehmen, ist ein Grundwissen im Bereich der Agrarwissenschaften (alle Fachrichtungen) erforderlich.\r\nWie hoch ist der Arbeitsaufwand?\r\nCa. 6 Stunden pro Woche\r\nErhalte ich ein Zertifikat?\r\nBei Teilnahme an der Abschlussprüfung erhalten Teilnehmer eine kostenfreie Teilnahmebescheinigung.\n\n                                    ", "end_date": "2014-07-08T00:00:00Z", "title": "Internationales Agrarmanagement", "price": 0, "instructors": "Aram Aristakesyan, Johannes Holzner and Ralf Schlauderer", "institution_name": [], "commitment": "", "subject_name": ["Science"], "course_url": "https://iversity.org/courses/internationales-agrarmanagement", "duration": "12 weeks", "language_name": ["Others"], "provider_name": ["iversity"], "start_date": "2014-04-15T00:00:00Z"}