{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    The University of Alberta, the University of Tromso and the University of the Arctic invite you to explore this four week course that examines the environment and climate of the circumpolar North. This course is the result of an international collaboration and provides you with an insight into our planet's North. Following an overview of regional geography, we will focus on the cryosphere (ice), as well as the atmosphere and ocean of the region. We will learn why the Arctic is cold and ice covered, and how that impacts its climate and ecosystems. We will also consider how the Arctic is connected to the rest of the world. Finally, we will examine present day climate change, the processes driving it, and evidence for it in the Arctic, before looking at the implications in the rapidly evolving North. Watch a preview of the course here: https://uofa.ualberta.ca/courses/arctic-climate\n\n                                            Syllabus\n                        Arctic EnvironmentsThis course is about the remarkable northern regions of the earth, the Arctic! Although sometimes considered remote and dangerous, the Arctic is home to many peoples, along with the ecosystems that they coexist with. Researchers from many fields, both scientists and non-scientists, study this vast circumpolar region to understand the environment, peoples, animals, economies, and resources. You’ll soon learn about the environments (the characteristics of the natural world) and climate (the prevailing atmospheric, oceanic and ice conditions) of the world’s North.Climate SystemsIn this lesson we’ll learn about the climate of the Arctic, and the way the climate interacts with the rest of the Earth system. In Lesson 1, we saw how the Earth receives energy from the sun and how heat is trapped on our planet through the natural greenhouse effect. We will now discuss how this energy is distributed throughout the globe and how it is transferred from the tropics to the poles via the large-scale circulation systems of the atmosphere and the ocean. We’ll learn the difference between the natural and the human-induced greenhouse effect - driven by the input of greenhouse gases created by burning fossil fuels, such as carbon dioxide and methane - and discuss what the future holds for the Arctic’s climate. As you will see, the global climate system is tightly linked and climate change in the Arctic also strongly affects temperate latitudes.The CryosphereIn this lesson, we’ll be learning about the Arctic cryosphere, which is the portion of the Earth’s surface where water occurs in solid forms. Such as snow and ice! In Lesson 2, we talked about atmospheric and oceanic circulation. Now we will learn about when and how ice forms on the surface of the Earth, including such topics as: sea ice, river ice, glaciers , and permafrost.  How all this ice formed on the ocean and on (and in) the land? How it relates to the atmosphere and ocean?Implications of Climate ChangeIn this lesson, we’ll be learning about the implications of climate change. Through the first 3 lessons, we’ve learned a great deal about the Arctic environment. This environment is rapidly changing, largely due to industrial human activity throughout the world. You’ll remember the natural greenhouse effect that we discussed in Lesson 1.  Carbon dioxide and water vapour are among the naturally occurring greenhouse gases in the atmosphere. They trap outgoing longwave radiation, raising the average temperature of the Earth. We will learn and discuss how sea ice and glaciers react to changes in our atmosphere and oceans. We will then discuss the implications of the changing environment on ecosystems, wildlife and humans.\t\n                                    ", "end_date": "2016-02-08T00:00:00Z", "title": "Introduction to the Arctic: Climate", "price": 0, "instructors": "Paul Myers", "institution_name": ["University of Alberta"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/arctic-introduction-climate", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-01-11T00:00:00Z"}