{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    We live on the surface of a dynamic and yet paradoxically stable planet that experiences a remarkable range of energetic phenomena, from waves and currents in the ocean to wind and thunderstorms in the atmosphere. This course traces how the remarkable concept called energy is the natural way of describing, understanding and unifying these diverse phenomena. The course traces the cascade of energy from sunlight to its final destination in a thermal form, considering differential surface heating, the role of convection and buoyancy and the formation of the Earth’s circulation system, and the links to the ocean circulation system. We consider the curvature and rotation of the Earth as key constraints on a system driven by sunlight and energy transformations.\n\nBefore your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.\n\nHow much time will the course take?\n\nObviously the answer will depend on your background and motivation to master the course material. Each week will consist of 5 or 6 segments that will each take 5 to 10 minutes to watch or listen to once. There will be some exploratory questions for each lesson and a confirmation quiz for each week. There will be one exploratory activity for each week. The average commitment will be 2-3 hours per week with perhaps 20 hours required for the whole course.\n\nWhat background does the course assume?\n\nWe’ll ask you to pull out a calculator from time to time (but not all the time!) simply as this will help you really master the key ideas. The key thing is to have a curiosity and interest in what makes our planet tick!\n\nWhat kind of learning activities will the course involve?\n\nThe activities are designed to use basic household objects, and our own senses, to engage with observations of the world, and to think about what these mean and lead to. We’ll get you to sense how cold or warm different objects get when left in the sun, and to observe how energy explains things we see and hear.\n\nWhat difference will the course make to my life?\n\nThe course has the conviction that it is hard to care for or value things that we don’t appreciate or have never considered. Although harsh in certain places and times, the Earth’s surface is remarkably habitable. Many forms of life can make their way in many kinds of terrain and climate. What produces these conditions? How are they maintained? We will seek to answer those questions in rudimentary form at least.\n\nWhat conversations will the course help to perform? \n\nCourses often imagine a context in which the course material is discussed, and this one is no different. It imagines a setting with family or friends where you might have just learned of a news event involving a storm like a hurricane or thunderstorm, or where a community might have experienced a flood or a drought, or merely unusual weather. You might have heard of El Nino or climate change in the news. This course will give you a background to better engage in a conversation about these great matters, and offer a better sense of the complexity, challenge and wonder connected to living on the surface of such an energetic planet.\n\n                                    ", "end_date": "2013-12-09T00:00:00Z", "title": "OEE101x: Our Energetic Earth", "price": 0, "instructors": "Bryan W. Karney", "institution_name": ["University of Toronto"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.edx.org/course/energetic-earth-university-torontox-oee101x", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2013-10-28T00:00:00Z"}