{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    Shale gas is seen by many as a cheap, clean and plentiful source of energy; a low-carbon ‘game changer’ helping us meet the world’s rapidly growing demands for energy and offering greater energy security. Its rapid rise has not been without controversy, however. Earth tremors, surface and groundwater contamination, and the effects of fracking on human and animal health are all high profile concerns.\n\nDuring this four-week course, we’ll study the politics, economics, and science of shale gas. We’ll examine how shale gas was formed, and how we extract it through hydraulic fracturing, or ‘fracking’. We will look at the impact of shale gas on energy markets and energy security.\n\nWe then move on to the environmental politics of shale. What are the local effects in terms of water contamination, seismic activity, and air pollution? What are the global effects? Does shale gas offer a ‘bridge’ to a low-carbon future, or would we be walking the plank?\n\nFinally we look at the question of what the public thinks, an area where the University of Nottingham has particular expertise, having run a public opinion survey on shale gas since 2012. Why are the US and UK experiences so different? What do the public think of allowing unconventional gas to be developed?\n\nAt the end of the course you will have improved you understanding of the costs and benefits of shale gas, and you will have made your contribution to the public debate on this important topic.\n\nKeep up to date with announcements and discussions by following the course on Twitter @ShaleGas_MOOC. Or find out more in Wil Knight’s post for the FutureLearn blog: “Shale gas: understanding the politics and science.”\n\n\n                                    ", "end_date": "2015-03-02T00:00:00Z", "title": "Shale Gas and Fracking: the Politics and Science", "price": 0, "instructors": "", "institution_name": ["The University of Nottingham"], "commitment": "3 hours", "subject_name": ["Science"], "course_url": "http://www.futurelearn.com/courses/shale-gas?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2015-02-02T00:00:00Z"}