{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    Soils are a vital part of our planet’s functioning, but all too often we take soils for granted. In this free online course, we introduce you to soils and explore the world beneath our feet.\n\nGet an introduction to soil science\n\nSoils are a fantastically complex environment, teeming with life and supporting our most fundamental environmental processes.  However, they are increasingly under threat and our soil resource is a finite one.\n\nStarting from what soil is and how soils form we will take a journey through the soil, not just learning about the basics of soil science but also about life in the soil.\n\nThen we will look at why soil is so important and investigate the topic of soil security - a topic relevant to the past and present.\n\nFinally we will learn about how and why soils are under threat both at a local and global scale. Throughout this course we will ask questions such as:\n\n\n  What is soil made of?\n  Why are soil microbes so important?\n  How does the rise and fall of civilisations depend on soils?\n  How is climate change impacting on soils?\n\n\nYou will also get the chance to get your hands dirty with a series of activities aiming to give you practical experience of assessing soil properties and conditions.\n\nUnderstand soil from a physical, chemical and biological perspective\n\nBy the end of this course, you will have a basic understanding of soil science from a physical, chemical and biological perspective.\n\nYou will have met researchers, who will tell you about cutting-edge soil science research at Lancaster University and elsewhere, and had an insight into how some of the threats to soils could be addressed in the future.\n\nSoils are really important. How much do you know about the world beneath our feet? Take this just-for-fun quiz and find out…\n\n\n                                    ", "end_date": "2016-08-01T00:00:00Z", "title": "Soils: Introducing the World Beneath Our Feet", "price": 0, "instructors": "Carly Stevens", "institution_name": ["Lancaster University"], "commitment": "3 hours", "subject_name": ["Science"], "course_url": "http://www.futurelearn.com/courses/soils?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-07-04T00:00:00Z"}