{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    Humanity faces a considerable problem in maintaining and enhancing food supplies on a global basis, whilst improving our wellbeing in both the developing and developed world. Obesity and other growing problems related to dietary excess pose huge economic and health implications in the developed world.\n\nIn many low resourced countries, simply getting enough to eat can be the issue, with poor quality food often contaminated with hazardous agents, and economic pressures affecting land use and food production.\n\nWith the increasing population, and climate change threatening existing food supplies, new challenges will need to be overcome to maintain food supplies in a healthy and sustainable manner.\n\nThis course aims to provide advanced knowledge of food safety and food security across different levels of the food supply chain, with a focus on the pathway to enhance global food security for a sustainable future.\n\nIt will cover topics including food fraud and integrity, soil quality, plant health and climate change. The course is led by Professor Chris Elliott, who wrote the UK government review on the recent horsemeat scandal. To find out more, read Chris’s post for our blog: “The many faces of the global food crisis.”\n\nThis is the first course in a two-part series by Queen’s University Belfast looking at issues concerning the maintenance and enhancement of global food supplies, whilst improving human wellbeing in the developed and developing world. The second course is Tackling the Global Food Crisis: Sustainable Agri-food Systems.\n\n\n                                    ", "end_date": "2015-12-07T00:00:00Z", "title": "Tackling the Global Food Crisis: Supply Chain Integrity", "price": 0, "instructors": "Chris Elliott", "institution_name": ["Queen's University Belfast"], "commitment": "3 hours", "subject_name": ["Science"], "course_url": "http://www.futurelearn.com/courses/global-food-crisis?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2015-11-02T00:00:00Z"}