{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    The E-waste Challenge – Let’s get it right for people, planet and profit!\r\nWith our growing appetite for electrical and electronic products, combined with rapid innovation and ever-shorter product lifespans, e-waste has now become one of the fast growing waste streams. \r\nE-waste is recognized as one of the priority waste streams addressed under the Basel Convention. The MOOC explores solutions to the e-waste challenge with a life cycle approach from product design to extraction of valuable materials till final disposal. Through the regional networks and links with ongoing development projects, we have been able to tap the international expertise of e-waste experts and recyclers around the world to develop resources that are current, relevant and at the cutting edge of innovation.\r\n \r\nThis course will help the participant to understand why and how we must manage e-waste in an environmentally sound manner and how we can take action on e-waste in their own life, business, or organization. \r\n \r\nThe aims of the course are to:\r\n\r\n\r\nShow how sound management of e-waste can help reduce GHG emissions, mitigate climate change and prevent hazards to health and the environment in accordance with the Basel, Rotterdam, and Stockholm Conventions\r\n\r\n\r\nShare best practices, technological innovations, and sustainable e-waste recovery and recycling business models\r\n\r\n\r\nExplore how the value in e-waste can be extracted in a way that supports the local economy and protects people’s health and the environment.  \r\n\r\n\r\nThe course materials have been developed in partnership between Climate-KIC, the United Nations Environment Programme Secretariat of the Basel, Rotterdam and Stockholm conventions (UNEP/BRS), our university partner, KU Leuven, in Belgium and the World Resources Forum (Switzerland).\r\nThe E-waste Challenge will be of particular interest to university graduate students, administrators, policy makers, business managers and e-waste operators and has been designed to be used by people in both developed and developing countries. \r\nActivities build on the different perspectives that this wide audience will bring – and we expect the international nature of the discussions to be an important part of your course experience.  \n\n                                    ", "end_date": "2016-05-30T00:00:00Z", "title": "The E-Waste Challenge", "price": 0, "instructors": "", "institution_name": ["Climate-KIC"], "commitment": "4-5 hours", "subject_name": ["Science"], "course_url": "http://learning.climate-kic.org/courses/e-waste-mooc", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Independent"], "start_date": "2016-04-04T00:00:00Z"}