{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Logos are everywhere, we daily come in contact with thousands of logos. They are part of visual representation and culture. People are aware of logos more than any time in the history. So if you have great logo, they will definitely response to them. To learn how to create your own, it's important to be able to identify the components and design techniques behind the most successful designs. In this course, we will constructs popular logos in order to explain why and how they work, and offers a methodical approach to creating a logo in Illustrator. </p><p style=\"\">In this course we will be looking closely at list of iconic and high quality logos, working on each design individually, and understanding how they works &amp; most importantly , what techniques were used in their creation.<br></p><p>This is a course for learning various unique and innovative techniques to design an industry level logos, exploring from the basic to the most advance designs. This will definitely enhance your designing skill and help in developing more creative ideas.</p><p style=\"\"><strong>Contents and Overview</strong></p><p style=\"\">The course module will include:</p><ul><li>Project Files</li><li>Color Presets</li><li>Fonts</li><li>Keyboard Short-cuts PDF</li><li>Logo Design Tutorials</li></ul><p style=\"\">Before Starting the Lectures, download all files in the first section. The PDF which include all the Keyboard Shot-cuts,The fonts folder, Project files and the color Presets Then start with the course.<br style=\"\"></p><p style=\"\">in the First Section, you will get the PDF for Basic Keyboards Short-cuts. Which will help you in following the tutorials step by step. My suggestion will be first go through all the keyboard short-cuts mention on the PDF and then start the course.<br style=\"\"></p><p style=\"\">Next download the the fonts folder and install it before you began the course. These are all the fonts used in every design i have worked on.</p><p style=\"\">Also the Color Presets folder. In this you will get all the color and gradients in have used in designing the logos. So this will help you to directly apply the color to your design.</p><p style=\"\">Finally with every exercise, download the project file and practice along the lesson. Working with the project files will help in understanding every single steps explained in the lessons.</p>", 
    "end_date": null, 
    "title": "48 Logo Designs and Techniques", 
    "price": "20.00", 
    "instructors": "MD Rawson", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599652_fcd1_3.jpg", 
    "course_url": "https://www.udemy.com/professional-logo-design-vol-2/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T19:02:13Z"
}