{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong style=\"\">This course Does Not cover the latest Adobe Photoshop CC - and is for CS5 downwards using the original interface</strong>.</p><hr style=\"\"><p><strong style=\"\">Over 700 student are already taking advantage of this course</strong><br style=\"\"></p><p>Your instructor for this course will be Reynel who will take you step by step through working with designing vector images with Adobe Photoshop</p><p>In this exciting course for beginners You will learn the basics, As well as the differences between these and standard format images such as JPEG or Bitmap images.</p><p>Once you have the basic knowledge you can go on to compound upon your knowledge. </p><p><strong style=\"\">Course contents</strong></p><p>. Welcome to the Course<br style=\"\">. Working with the all powerful pen tool<br style=\"\">. Lets start designing a Vector graphic<br style=\"\">. Outputting correctly for print and the web<br style=\"\">. Course Conclusion</p><p>Once you know the principles of working with Vector images you can go on to create scalable images for both the web and print.</p><hr style=\"\"><p style=\"\"><strong style=\"\">Remember that there is absolutely NO risk to you. You are covered by the rock solid Udemy No quibble Money Back Guarantee for a full 30 days. If the course does not teach you exactly what it promises to then simply request a refund, It&#039;s as simple as that.</strong><br style=\"\"></p>", 
    "end_date": null, 
    "title": "A Beginners Guide to creating Vector Graphics With Photoshop", 
    "price": "20.00", 
    "instructors": "LearnCadia - Learning Unlimited!, Reynel Obordo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/435626_2bcd_3.jpg", 
    "course_url": "https://www.udemy.com/beginners-guide-course-to-vector-graphics-with-adobe-photoshop-course/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-01T13:07:23Z"
}