{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Probably you saw many times images on the web created by a professional using Adobe Photoshop CS6 and thought how great they look. And they also seem so sofisticated. If you are like most people you said yourself \"<em>They look awesome, but it is too difficult for me to create something like this and paying a graphic designer would cost a fortune</em>...\"</p><p>It's true that paying a graphic designer can cost you a lot of money. But you can do them by yourself using an advanced graphic design software, like Adobe Photoshop.</p><p>Since images are one of the most important content types used on social media, blog or online, having your own great looking images usually can help you a lot in building your own brand.</p><p>This course is a beginner course on how to use Adobe Photoshop CS6 from zero, to advanced users. It is intended for people who want to create complex, great looking images that seem created by a professional.</p><p>You don't need any previous graphic design experience, just start from zero and learn how to master the most important Adobe Photoshop CS6 features.</p><p>You will learn</p><ul><li>how to use Photoshop's main dashboard, menus and commands,</li><li>how to create shapes, text areas and the most important types of graphic elements,</li><li>how to format objects and stylize them,</li><li>how to use the most important tools in Adobe Photoshop CS6, CS5 and CS4,</li><li>how to add gradients, patterns, stroke, emboss and many other effects to your objects,</li><li>all the elements you need to know in order to edit and stylize your images in Photoshop</li></ul><p>By taking it, you will be able to understand and master the art of using Photoshop's basic commands and features in the step by step Adobe Photoshop tutorials and demonstrations. </p><p>In your own pace.</p><p>My name is Florin Rosoga, I managed hundreds of social media campaigns and blogging for myself or my clients in the last years.</p><p>One of the most important elements of them are the images you use. Since social media is a visual place, an engaging image will improve your social media campaign conversion. There are a lot of free available tools, but if you want to truly want to become professional, Adobe Photoshop is the standard.</p><p>Still, people avoid using Photoshop CS6 since it has too many options and it can be intimidating.</p><p>In this course you will get step by step video explanations to help you understand in a comfortable way all about how to use Photoshop, how to work with Photoshop in minutes, even if you don't have any previous graphic experience.<br></p><p>The entire course can watched as a video training or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next...<u> click the Take this Course button</u> top right and you'll be taken to our secure payment page.</p><p>Just <em><u>Enter Your Regular Details</u></em> and complete your investment to have immediate access.<br></p><p>Stop struggling with boring images and start mastering professional looking images in minutes, just like a pro!</p><p><strong>Thank you for reading this and learning about my course</strong> ... I hope what I will teach you when you will start the Photoshop CS6 course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE</strong> to start mastering Adobe Photoshop CS6!<span></span><br></p>", 
    "end_date": null, 
    "title": "Adobe Photoshop Essentials: Master Adobe Photoshop CS6", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/638040_1298_9.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-cs6-essentials-how-to-use-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-12T09:42:57Z"
}