{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><u style=\"\">الدورة التدريبية التفصيلية في اساسيات برنامج </u></strong><strong style=\"\"><u style=\"\">Adobe Illustrator Cs6</u></strong><strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">ما هو الالستريتر ولماذا يستخدم ؟</u></strong>  </p>  <p style=\"\">  \t        برنامج ادوبي الستريتر يستخدم من قبل الفنانين والمصممين لانشاء الرسومات الفنية والتكوينات البصرية البسيطة والمعقدة بتقنية رسم الفيكتور.  </p>  <p style=\"\">  \t        الفنانون يستخدمونن الالستريتر لانشاء الرسومات الفنية والتكوينات البصرية العالية الجودة والتي يمكنهم ومن خلال تقنية الفكتور تحجيمها (تكبيرها وتصغيرها) دون ان تتاثر جودة الرسم. إضافة الى انشاء الرسم الحر والرسم التوضيحي وشف الصور الفوتوغرفية والرسومات اليدوية واعادة تلوينها وتحجيمها.  </p>  <p style=\"\">  \t        المصممون يستخدمون برناج الالستريتر لانشاء الشعارات (LOGOS) والاشكال البسيطة والمعقدة وايضا لكتابة النصوص باشكال مختلفة واستخدامها في التصاميم المخصصة للطباعة كالكروت والمجلات والجرائد .... أو في انشاء تصاميم لمواقع الانترنت.  </p>  <p style=\"\">  \t        برنامج الالستريتر لا يقتصر فقط على الفنانين والمصممين ولكنه يستخدم من قبل العديد من الناس في مشاريعهم بسبب امكانياته العالية.  </p>  <p style=\"\">  \t        في هذه الدورة سيتم شرحكافة مفاهيم وتقنيات البرنامج الاساسية والتي تطبق في اي مجال من مجالات استخدام برنامج الالستريتر (الرسومات الفنية، المطبوعات، تصميم الويب، المقدمات التلفزيونية .....)  </p>  <p style=\"\">  \t        سيقوم المدرب بشرح العناصر التي تتكون منها تصاميم الفيكتور (المسارات (paths) ، الحدود الخارجية (strokes) ، والتعبئة (fills) ) . من خلال اظهار كيفية استخدام جميع ادوات الرسم والتعديل واستخدام الالوان وجمع الاشكال والاشكال المتراكبة وعمل الليرات والمجموعات ، اضافة الى شرح عمليات استخدام النصوص والكتابة النصية وعمل التاثيرات والعديد من الامور المهمة المتنوعة والضرورية جدا في الرسم والتصميم.  </p>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">محتويات الدورة:</u></strong>  </p>  <ol style=\"\">  \t<li style=\"\">تعريف بالفيكتور وعناصره</li>  \t<li style=\"\">كيفية انشاء الملفات الجديدة واعداداتها </li>  \t<li style=\"\">كيفية اختيار العناصر وتحريكها</li>  \t<li style=\"\">اختيار الالوان والتدرجات اللونية وتطبيقاتها</li>  \t<li style=\"\">رسم المسارات (Paths)</li>  \t<li style=\"\">انشاء الاشكال الاساسية والمتراكبة</li>  \t<li style=\"\">استخدام الـ Pen Tool</li>  \t<li style=\"\">انشاء النصوص والكتابة</li>  \t<li style=\"\">لوحات Appearance و التاثيرات</li>  \t<li style=\"\">عمل الليرات واعداداتها</li>  \t<li style=\"\">ادخال الصور والعمل عليها</li>  \t<li style=\"\">انشاء الرموز (Symbols) واستخدام الرموز الجاهزة</li>  \t<li style=\"\">استخدام الشبكات الاساسية وشبكة المنظور(Perspective)</li>  \t<li style=\"\">التخزين والتصدير</li>  </ol>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة الأولى : من هنا نبدأ </u></strong>  </p>  <ol style=\"\">  \t<ul style=\"\">  \t\t<li style=\"\">ان من اهم ما يميز برنامج ادوبي الستريتر ويجعله مختلفا عن برامج       التصميم الأخرى هو اعتماده تقنية الفيكتور في انشاء الرسومات. في هذه الوحدة       سنقوم بشرح معنى تقنية الفيكتور(Vector) وما هي عناصرها الاساسية وما هو الفرق بينها وبين التقنية       الاخرى (Pixel)       من خلال مثال يشرح الفرق من ناحية الحجم والجودة والدقة والوضوح.</li>  \t</ul>  </ol>  <ol style=\"\">  \t<ul style=\"\">  \t\t<li style=\"\">ايضا سيتم شرح الواجهة الرئيسية للبرنامج (Interface)من خلال استعراض محتوياتها وكيفية تخصيص وترتيب مساحة العمل (Workspace)       واظهار واخفاء الواح الادوات(Tool Panel)       واللوحات العائمة (Panel       System)</li>  \t</ul>  </ol>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة الثانية : العمل على الملفات</u></strong><strong style=\"\"><u style=\"\">Working with documents</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">واحدة من أهم الأمور التي يجب على المستخدم تذكرها واعدادها قبل      البدء بالعمل هي انشاء مساحة عمل مناسبة لنوع التصميم الذي يريد انشاءه ، لأن      الملف المعد للعمل من أجل الطباعة يختلف في اعداداته عن الملف المعد من أجل      صفحات الانترنت او افلام التلفزيون وايضا الملف المخصص لتصميمالمجلة يختلف في قياساته عن المخصص لتصميم      بوستر او بروشور ....</li>  \t<li style=\"\">في هذه الوحدة سنتحدث عن انشاء الملفات الجديدة بما يناسب نوع      العمل المنوي انشاؤه وهذا من خلال شرح لقائمة انشاء ملف جديد التي تظهر بعد      الضغط على ملف جديد من قائمة File واستعراض تفاصيل هذه القائمة ومحتوياتها وتبيان الإختلاف بين      المعطيات وكيف تؤثر على الملف الذي نقوم بإنشائه، وكيفية اعطاء الملف اسماً      وتحديد قياساته وصيغة اللون الخاص به.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة الثالثة : التحديد والتحريك </u></strong><strong style=\"\"><u style=\"\">Selecting and Transforming</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">قبل البدء فعليا ً بأدوات التحديد وعمليات التحريك والتحجيم داخل      برنامج الالستريتر سنتعرف على اسس عمليات التحريك والتحجيم والقواعد العامة      لضبط الأشكال والعناصر وترتيبها فالفهم لهذه العمليات يجعل التعامل معها اسهل      وادق.</li>  \t<li style=\"\">في هذه الوحدة سنتعرف على ادوات التحديد والتحريك واظهار خصائص كل      أداة وكيفية استخدامها والفروقات بين الأدوات لان هناك فرق بين تحديد شكل      اساسي وتحجيمه أو تحريكه وبين شكل متراكب.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة الرابعة : الألوان </u></strong><strong style=\"\"><u style=\"\">Color</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">عندما نبدأ باستكشاف الألوان داخل الالستريتر من المهم جداً أن      نفهمأنظمة الألوان الأساسية      المستخدمة في البرنامج.</li>  \t<li style=\"\">في هذه الوحدة سنقوم بشرح واستكشاف نظامي الألوان الأساسيين RGB و CMYK للحصول على فهم أفضل لماهية النظامين ولماذا وكيف يستخدم كل نظام.</li>  \t<li style=\"\">سنتحدث ايضا ً عن كيفية التلوين ودرجات الألوان ولون التعبئة (Fill color)      والحدود الخارجية(Strokes) وكل ما يتعلق باللون والتلوين.</li>  \t<li style=\"\">هناك عدة طرق في برنامج الالستريتر لتحديد نوع التلوين مثل اللون      المنفرد(Solid color) والتدرج اللوني(Gradient      color) والتلوين باستخدام الاشكال الزخرفية      والنقوش(Pattern) وايضا استخدام الصور في عملية التعبئة بدلا من اللون في بعض      الاشكال.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة الخامسة : رسم المسارات</u></strong><strong style=\"\"><u style=\"\">Paths</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">كثيراً ما ذكرنا في الدروس السابقة كلمة Path اي المسارات التي      تحدد تكوين الشكل في كل مرة نرسم فيها شكلاً في برنامج الالسترير نستخدم الـ path وهي ميزة لتقنية الفيكتور بالرسم، من خلال      هذه الوحدة سنشرح ما هو الـ path ومدى أهميته في برنامج الالستريتر.</li>  \t<li style=\"\">يعتمد فهم الـ path وآلية رسمه على فهم نقاط الارتكاز(Anchor points) والتي تشكل بداية      ونهاية المسار (path) ، لذلك سنقوم بتوضيح وشرح العلاقة بينها من خلال امثلة      توضيحية.</li>  \t<li style=\"\">رسم المسار يحدد بناء التكوين او الشكل المرسوم لانه هو الذي يحدد      شكل الحدود الخارجية(Strokes) ومساحة التعبئة الداخلية(Fill) لذلك سنقوم بشرح      الطرق المختلفة لرسم الأشكال اعتمادا ً على مساراتها المختلفة وبيان النتائج      المتنوعة والعديدة لهذه الطرق والتي ينتج عنها اشكال مغلقة او مفتوحة او حتى      خطوط منفردة سواءً كانت هذه الخطوط او الأشكال بحدود مستقيمة او منحنية.</li>  \t<li style=\"\">كثيراً ما نقوم برسم الأشكال من عدة خطوط منفصلة او أشكال غير      مغلقة، فإذا اردنا التعامل معها كوحدة واحدة كما في عملية التلوين او التحجيم      او حتى التحريك لزمنا جمعها واغلاق المسارات ووصل نقاط الارتكاز ببعضها، وهذا      ما سيتم شرحه في ايضا ً في هذه الوحدة بامثلة واضحة ومفصلة.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة السادسة : انشاء الأشكال </u></strong><strong style=\"\"><u style=\"\">Creating Shapes</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">في هذه الوحدة سنتحدث عن رسم الأشكال الأساسية والمعقدة وكيفية      بناء التكوينات لعمل التصاميم المختلفة فبرنامج الالستريتر يوفر لنا العديد      من أدوات الرسم الخاصة بالأشكال والتي سنقوم بشرحها مع خصائص كل أداة      والميزات المشتركة والمختلفة في هذه الأدوات.</li>  \t<li style=\"\">سنتحدث أيضا ً عن أوضاع الرسم المختلفة للأشكال وترتيب هذه      الأشكال سواء ً قبل البدء بالرسم أو حتى بعد رسمها للحصول على تناغم بين      الاشكال بما يتناسب مع طبيعة التصميم أو التكوين الذي نقوم بانشائه.</li>  \t<li style=\"\">ما ينطبق على المسارات(Paths) ينطبق على الأشكال(Shapes) من حيث امكانية جمع      الأشكال أو فصلها او طرح الأشكال من بعضها في سبيل انشاء تكوينات متقدمة      ومميزة، وهذه الطريقة في انشاء الأشكال المركبة(Compound Shapes) هو ما سنتعلمه من      خلال استخدام أمر(Pathfinder) وهو الأمر المستخدم لجمع المسارات(Paths) والأشكال(Shapes)      على حد سواء.</li>  \t<li style=\"\">سنتحدث ايضا ً عن أداة Shape      Builder Tool وهي أداة متخصصة في عملية بناء الأشكال      المتراكبة ببساطة وسرعة.</li>  \t<li style=\"\">Blob Brush Tool و Eraser Tool هما أداتين متعاكستين في العمل فالأولى تقوم برسم الأشكال      بطريقة مباشرة وحرة بلون التعبئة (Fill color) والثانية تقوم بحذف جزء من الشكل وبشكل حر ايضاً، ونقوم بشرح      طريقة عمل الأداتين في عذع الوحدة من خلال مثال يوضح آلية التعامل معهما.</li>  \t<li style=\"\">أدوات Brush Tool و Pencil Tool أداتان تختصان      بالرسم الحر في برنامج الالستريتر ولجعل التعامل معهما أكثر سهولة ومتعة قمنا      بشرح طريقة الرسم باستخدام هذه الأدوات بأسلوب سلس ومبسط، مع تبيان الخصائص      المشتركة بينها وايضاً الفروقات.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة السابعة : استخدام أداةالـ </u></strong><strong style=\"\"><u style=\"\">Pen Tool</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t        ·سنتحدث في هذه الوحدة عن واحدة من أهم الأدوات وأكثرها استخداما ً في برنامج الألستريتر وهي أداة <strong style=\"\">Pen Tool</strong> المفضلة لدى الكثيرين من المصممين سواءً في الرسم الحر أو شف الصور أو إنشاء الأشكال المغلقة وغير المغلقة.  </p>  <p style=\"\">  \t        ·هذه الأداة أداة الرسم الاحترافية Pen Tool تمتاز بامكانيات عديدة حيث يمكننا من خلالها وضع النقاط حيث نريد والتحكم بها كيفما نود وفي نفس الوقت نستطيع باستخدامها رسم الخطوط المستقيمة او المنحنيات في نفس الوقت مع امكانية التعديل على الخطوط او النقاط بنفس الأداة.  </p>  <p style=\"\">  \t        ·سنتعرف في هذه الوحدة على تفاصيل أداة pen tool وخياراتها المتنوعة وكيفية التنقل بين اشكالها المختلفة واستخدامها بطريقة سلسة من خلال شرح اساليب الرسم وطرق التعديل وتقنيات التشكيل.  </p>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة الثامنة : انشاء النصوص والكتابة </u></strong><strong style=\"\"><u style=\"\">Type </u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">تعلم كيفية كتابة النصوص وإنشاء العناوين والعبارات النصية من أهم      المهارات في عالم التصميم وبرنامج أدوبي الستريتر انفرد بميزات عديدة ومتنوعة      تبدأ من إنشاء العناوين والكلمات الرئيسية ولا تنتهي عند الفقرات والعبارات      الطويلة بل تمتد الى الكتابة على المسارات وداخل الأشكال مع امكانية اعطاء      النصوص والكلمات اشكالاً مختلفة وجميلة وامكانية وضع التاثيرات وعمل التنسيق      للفقرات عدا عن امكانية التلوين بعدة طرق وتحويل النصوص الى اشكال ورموز.</li>  \t<li style=\"\">في هذه الوحدة سيتم شرح أدوات الكتابة وطرق التعامل معها مع شرح      خصائصها وميزاتها كما سيتم شرح اساليب الكتابة والتلوين وعمل الفقرات      والكتابة داخل الاشكال المتنوعة او عليها او حتى على المسارات والخطوط      المستقيمة والمنحنية.</li>  \t<li style=\"\">سنناقش ايضا طرق اضافة التأثيرات الجمالية المتنوعة وطريقة تخزين      التاثيرات واستنساخها وتصديرها واستيرادها وتحويل الكلمات الى رموز تستخدم      اكثر من مرة او اشكال ذات تكوينات دلالية وجمالية.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة التاسعة : </u></strong><strong style=\"\"><u style=\"\">Appearance Panel</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">تتحدث هذه الوحدة عن لوحة من أهم لوحات برنامج الالستريتر      لاحتوائها على جميع الخصائص المتعلقة بكل عنصر لوحده مع امكانية التحكم به او      التعديل عليه بكل بساطة ومن خلال نفس اللوحة دون الحاجة الى العودة الى كل      أداة استخدمناها في التطبيقات التي اجريناها على هذا العنصر.</li>  \t<li style=\"\">سيتم شرح هذه اللوحة وشرح محتوياتها وخصائص كل خيار من الخيارات      المتنوعة التي تحتويها اللوحة وطريقة التعامل مع التاثيرات من خلالها وككيفية      تخزين هذه التاثيرات واستعادتها.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة العاشرة : الليرات</u></strong><strong style=\"\"><u style=\"\">Layers</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">في أغلب التصاميم والرسومات تتكون الأشكال من عدد من المسارات      لإنشاء تكوينات معقدة وفي هذه الحالة تصبح الحاجة ملحة الى ترتيب الأشكال      وفرزها ليسهل التعامل معها والوصول الى أجزائها.</li>  \t<li style=\"\">لهذا نحن بحاجة الى الليرات (Layers) والتي نستطيع من      خلالها فرز العناصر والاشكال في طبقات مختلفة بهدف الترتيب والتخصيص.</li>  \t<li style=\"\">في هذه الوحدة سنقوم بشرح الليرات (Layers) من حيث كيفية انشائها      وترتيبها وايضا اعطائها اسماء مختلفة وتفاصيل تميزها عن بعضا وتميز الاشكال      الخاصة بكل طبقة على حدى.</li>  \t<li style=\"\">ايضاً سيتم التعرف على تفاصيل قائمة الليرات (Layers)      من خلال امثلة يتم توزيعا على طبقات مختلفة وبيان كيفية التعامل معها.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة الحادية عشرة : التعامل مع الصور </u></strong><strong style=\"\"><u style=\"\">Working with Images</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">بالرغم من أن برنامج الالستريتر هو برنامج للرسم بتقنية الفيكتور      إلا أنه أيضا ً لديه القدرة على التعامل مع الصور النقطية (Pixel Images)      بشكل جيد وحيث أننا في العديد من التصاميم نحتاج الى التعامل مع الصور      النقطية لاغراض متنوعة سنتعلم في هذه الوحدة كيفية العمل على هذه الصور داخل      الالستريتر.</li>  \t<li style=\"\">الصور النقطية قد تكون صور من كاميرا أو رسم أو تصميم تم انشاؤه      ببرنامج تصميم يعتمد تقنية البيكسل مثل الفوتوشوب وهذا ما سنشاهده من خلال      هذه الوحدة بأمثلة تبين الاستخدامات المختلفة والمتعددة للصور النقطية داخل      الالستريتر وطرق التعامل معها.</li>  \t<li style=\"\">لا يقتصر التعامل مع الصور النقطية داخل الالستريتر على بقاء      الصورة بتقنية البيكسل او استخدامها بهدف شف الخطوط والاشكال ولكن ايضا ً      يمكننا تحويل الصور النقطية (Pixel      Images) الى رسم فيكتور (Vector Drawing) وهذا ما سنتعلمه ايضا      ً في هذه الوحدة.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة الثانية عشرة : الرموز </u></strong><strong style=\"\"><u style=\"\">Symbols</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">تتحدث هذه الوحدة عن ميزة من أجمل ميزات ببرنامج الالستريتر وهي      احتواءه على المكتبات الجاهزة التي توفر العديد من الخيارات الجميلة والمنوعة      لأدوات الرسم مثل Brush Library و Pattern وأيضا ً المكتبات اللونية المميزة والعديد      من المكتبات الأخرى، ويزداد الأمر جمالا ً بامكانية اضافة عناصرنا الخاصة      لهذه المكتبات واستخدامها متى نشاء.</li>  \t<li style=\"\">Symbols هي احدى هذه المكتبات المميزة والتي تحتوي      مجموعة من العناصر والأشكال الجاهزة والمتنوعة التي يحتويها الالستريتر      ويمكننا استخدامها في تصاميمنا بكل بساطة مع امكانية عمل Symbols خاصة بنا واضافتها الى الـ Symbol library لاستخدامها مرات متعددة ومتى نريد.</li>  \t<li style=\"\">سنتحدث في هذه الوحدة عن كيفية عمل Symbols جديدة وكيفية اضافتها الى المكتبات      الموجودة في البرنامج وايضا ً كيفية تصديرها واستيرادها والتعديل عليها.</li>  \t<li style=\"\">بالاضافة الى ان الـ Symbols في الأصل هي مكتبة      جاهزة ذات لوحة خاصة بها (SymbolLibrary) تمكننا من الاضافة او الحذف او      التعديل، ايضا ً تمتاز الـ Symbols بأدوات خاصة بها      تمكننا من التعامل معها بكفاءة عالية وسهولة كبيرة. هذه الأدوات وخصائصها      وكيفية التعامل معها سيتم ايضاحه وشرحه بالتفصيل في هذه الوحدة.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة الثالثة عشر : المنظور</u></strong><strong style=\"\"><u style=\"\">(Perspective)</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">قامت شركة ادوبي في نسخة Illustrator      CS5 باضافة امكانية رائعة لبرنامج الالستريتر      ألا وهي الرسم باستخدام المنظور Drawing in      Perspective اي انه اصبح بامكاننا الرسم باستخدام شبكة      من الخطوط الوهمية نحددها حسب المنظور الذي نريده لاعطاء الرسم تفاصيل اكثر      دقة وجمالية واكثر واقعية من حيث النسب والاحجام ومواقع الاشكال نسبة لبعضها.</li>  \t<li style=\"\">في هذه الوحدة سنستعرض كيفية انشاء هذه الشبكة وآلية التعمل معها      وكيفية ضبط اعداداتها والتعامل وع الادوات الخاصة بها والتعرف على خصائص هذه      الأدوات.</li>  \t<li style=\"\">ايضا ً سنقوم بشرح طرق الرسم على هذه الشبكة واضافة العناصر اليها      وايضا ً استخدام ادوات الرسم الخرى في البرنامج على هذه الشبكة.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">الوحدة الرابعة عشر : التخزين والتصدير </u></strong><strong style=\"\"><u style=\"\">Saving &amp; Exporting</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">عملية حفظ الملفات من أهم الأمور التي يجب الانتباه لها في برنامج      الالستريتر من اجل الحفاظ على ما قمنا بعمله وعدم ضياع العمل والجهد هباءً      لهذا سنتحدث في هذه الوحدة عن عملية حفظ الملفات وطرق التخزين لضمان المحافظة      على ملفاتنا.</li>  \t<li style=\"\">لا تقتصر عملية التخزين على حفظ الملف بصيغة برنامج الالستريتر      فقط ولكن يمكننا البرنامج من تخزين الملفات بصيغ اخرى وهو ما يسمى بعملية      التصدير (Exporting) كتصدير الملف كصورة نقطية او ملف PDF او اي صيغة اخرى يدعمها البرنامج بهدف      التعامل معها بطرق مختلفة وهذه العملية سيتم الحديث عنها وعن تفاصيلها بطريق      سلسة وواضحة من خلال هذه الوحدة</li>  </ul>", 
    "end_date": null, 
    "title": "Adobe Illustrator CS6 باللغة العربية", 
    "price": "35.00", 
    "instructors": "Kottab Academy, Mohammad Shakhshir", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/283038_4718_4.jpg", 
    "course_url": "https://www.udemy.com/adobe-illustrator-cs6-kottab/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-18T12:36:30Z"
}