{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong style=\"\">In this course you will learn lots of great stuff.</strong></p><p>You will learn to work with images , to wrap text around objects, to create awesome PDF, to create tables and many more!</p><p><strong style=\"\">The course is designed for beginners and for the Pro. Anyone can learn something new , that will help you in your career . </strong></p><ul style=\"\"><li>You should enroll in this course , because NOW is the perfect time to add ADOBE INDESIGN to your CV.</li></ul><p><strong style=\"\">Adobe InDesign</strong> is a desktop publishing software application produced by Adobe Systems. It can be used to create works such as posters, flyers, brochures, magazines, newspapers and books. InDesign can also publish content suitable for tablet devices in conjunction with Adobe Digital Publishing Suite. Graphic designers and production artists are the principal users, creating and laying out periodical publications, posters, and print media. It also supports export to EPUB and SWF formats to create e-books and digital publications, including digital magazines, and content suitable for consumption on tablet computers. In addition, InDesign supports XML, style sheets and other coding markup, making it suitable for exporting tagged text content for use in other digital and online formats. The Adobe InCopy word processor uses the same formatting engine as InDesign.</p><span></span>", 
    "end_date": null, 
    "title": "Adobe InDesign Tips and Tricks", 
    "price": "30.00", 
    "instructors": "Apostu Adrian Albert, Luft Andrews", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513212_51d3_6.jpg", 
    "course_url": "https://www.udemy.com/adobe-indesign-best-tutorials/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T23:21:17Z"
}