{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">In SECTIONS 1 - 11 of this Adobe Illustrator CC course, I will show you how to work with the New Features, Tools and Techniques that were released with the First Version of Adobe Illustrator - Creative Cloud. These updated features were first released in 2013. This simple course was designed for the experienced Illustrator user who recently upgraded to the Creative Cloud version of Adobe Illustrator.</p><p style=\"\">The Step-by-Step Tutorials in this course are perfect for anyone who already has a basic working knowledge of the application. It is for those who just want to know the &quot;New Stuff&quot;. </p><p style=\"\">This course will start off with a brief discussion of the newest Preferences and then jump right in to such topics as updated Guide Features, Placing Multiple Images, the New Free Transform Tool Widget and even new Font Search Methods. We will then go through an in-depth and very entertaining discussion of the All-New Touch Type Tool and all the fun things you can now do with type editing.</p><p style=\"\">The bulk of the rest of this course will cover the use of another All-New Feature: The Image-Based Brushes. You can literally paint photographs right into your Illustrator files! We will go through the methods to paint realistic ropes, thorny vines and leafy branches right before your eyes.</p><p style=\"\">This course will then wrap up with a discussion of the new updated features for working with Pattern Brushes along with the All-New Image-Based Pattern Brush option as well… really fun stuff to play with!</p><p style=\"\">In SECTIONS 12 - 20 of this Adobe Illustrator CC course, I will show you how to work with the New Features, Tools and Techniques that were released with the Second Version of Adobe Illustrator - Creative Cloud. These updated features were released in 2014. </p><p style=\"\">I will start the second half of this course with a brief demonstration on Resetting the CC 2014 Illustrator Workspace. Then you will go through the steps to Creating a New Custom Tools Panel. After the initial Workspace Setup, you will work with the New Live Rectangles Feature and then go through the All-New Pen Tool Previews Feature. This course will then continue on to show you the new ways of dealing with Pen Tool Direction Handles.</p><p style=\"\">After your work with the Pen Tool has wrapped up, you will go through the Snap to Grid Feature and go into further work with the Live Corners Update in Illustrator CC 2014. All-New Path Segment Reshaping and Spacebar Shortcut Anchor Point Moving will also be explained.</p><p style=\"\">This course will then finish with an in-depth series of lectures and demonstrations for working with the All-New Pencil Tool Upgrades. You are really going to finally appreciate working with the updated and more powerful Pencil Tool here in Adobe Illustrator CC 2014!</p><p style=\"\">After all of that, the course will end with a brief mention of the Synch Missing Fonts Feature to finish things up</p><p style=\"\">You will be up and running and working even more efficiently with these All-New, more powerful tools and options at your disposal with this introduction to the New Updates to Adobe Illustrator.</p>", 
    "end_date": null, 
    "title": "Adobe Illustrator Creative Cloud:  Mastering the Upgrades", 
    "price": "20.00", 
    "instructors": "Chris Nielsen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/435138_a308_3.jpg", 
    "course_url": "https://www.udemy.com/learn-illustrator-cc-updates/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-28T20:01:15Z"
}