{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t Con el curso de Adobe InDesign CS6 aprenderás a maquetar de forma profesional cualquier tipo de documento o libro incluyendo en él diferentes elementos gráficos. Además, aprenderás a optimizar tu trabajo creando maquetas y diferentes estilos tanto de carácter y párrafo como de tablas y exportarás tus trabajos en diferentes formatos, adecuados para la impresión profesional, la salida a web o a formatos idóneos para ser descargados en diferentes dispositivos móviles como tablets y smartphones.  </p>  <p>  \tAdobe InDesign (ID) es una aplicación para la composición digital de páginas desarrollada por la compañía Adobe Systems y dirigida a diseñadores gráficos y maquetadores profesionales. Presentada en 1999, su objetivo era constituirse en la alternativa a QuarkXPress. Este curso es impartido por Victoria Vázquez, técnico en Diseño gráfico y en Infografía, cursó máster en 3D y animación digital.  </p>  <p>  \tCurso impartido por Victoria Vázquez, experta en creación de contenidos para la formación por la Universidad de Salamanca, lleva más de 5 años trabajando como editora de contenidos multimedia y formadora para diferentes consultoras.  </p>  <p>  \tEn este curso cubriremos los siguientes temas:  </p>  <ul style=\"\">  \t<li>Dominio del entorno de trabajo</li>  \t<li>Trabajo con paneles</li>  \t<li>Trabajo con capas</li>  \t<li>Creación y edición de textos</li>  \t<li>Líneas y polígonos</li>  \t<li>Herramientas de Adobe InDesign</li>  \t<li>Edición de color</li>  \t<li>Trabajo con tablas</li>  \t<li>Creando un libro: acciones</li>  \t<li>paginación y otras opciones de libros</li>  \t<li>Exportaciones</li>  \t<li>Impresiónes</li>  </ul>", 
    "end_date": null, 
    "title": "Adobe InDesign CS6", 
    "price": "50.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177584_ec50_2.jpg", 
    "course_url": "https://www.udemy.com/adobe-indesign-cs62/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-06T00:01:06Z"
}