{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Do you want to take your graphic design knowledge to the next level and become a Pro designer? Or are you a photographer and want to become an expert with advanced editing techniques? Or do you simply like to edit your Facebook/Instragram images like a Pro? You are at the right place to make use of the latest graphic design tool, Photoshop CC 2014. </strong>  </p>  <p style=\"\">  \tWe demonstrate <span style=\" color:rgb(53, 53, 53);\">all the basic and advanced concepts of the latest version of Photoshop, Photoshop CC in this course to make you an expert in graphic design and Photoshop. Also, we share some common practices in mastering Photoshop CC. This course describes all basic concepts including Photoshop CC Introduction, navigation and settings, advanced cropping techniques, working with multiple layers, working on hands-on/real-time projects: removing a person from background, removing color from an image, removing wrinkles from a face, and whitening a yellowish teeth on an image. We then move forward with Adobe Camera Raw and advanced photography starts here! We discuss hands-on techniques on using Adobe Camera Raw to master advanced photo editing techniques for photographers. Some of us know how to play with colors and images but professional touches are required to be able to do quality work. This course not only demonstrates working with quality images but also shows how to put professional touches with the help of the latest graphic tool from Adobe. It is necessary to understand the right color combinations and Photoshop tool needs to be handled properly in order to maser graphic design. This course shows you exactly how to play with selections and layers as well. Resizing and cropping are few other techniques that need to be handled carefully. Nowadays, Photoshop has become essential for any types of design work. It has not been easy to find quality training in Photoshop CC and the graphic design work is becoming more competitive everyday. We have designed this course to create more Photoshop experts and provide you with the latest Photoshop training. You can take this opportunity to start here and go to the next level of graphic design. Also, this can be your first step towards the way of mastering Photoshop. If you always wanted to learn the latest Adobe Photoshop tool and gain competitive advantage in graphic design industry, then this is the right course for you. Adobe Photoshop CC comes with great new features and don&#039;t miss out to make use of this latest tool. Let&#039;s get started to get hands-on experience on Photoshop CC and become a Pro!</span>  </p>", 
    "end_date": null, 
    "title": "Advanced Graphic Design-Photoshop CC 2014 for Photographers", 
    "price": "20.00", 
    "instructors": "QAEversity .", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368958_f6d0.jpg", 
    "course_url": "https://www.udemy.com/advanced-graphic-design-photoshop-cc-2014-for-photographers/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T17:38:01Z"
}