{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>TOP STORY: THIS COURSE HAS BEEN AWARDED AS UDEMYS' BEST GRAPHIC DESIGN COURSE</strong><strong></strong></p><p><strong>News:</strong> This course is being appreciated by all over the world, in this little time more than 750+ Students joined and learning together. <strong>Very soon the price for the course will hike. </strong>  </p>  <p>  \t<em>*Course Last Updated on 10th March, 2016<strong> </strong></em>  </p>  <p>  \t<em><strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></em>  </p>    <p>  \t                                                                                                                                                                                           About  this course: World's one of the most known graphic artists <strong>Shouvik Raychowdhury</strong> will teach you Photoshop with his <strong>own voice and hand</strong>.</p>  <ul>  \t<li><em>This is the <strong>only</strong> online course which will cover every aspects of graphic design</em></li><li><em><strong></strong>Learn Digital Painting, Web Design, Print Design, Advertisement, Photo-Manipulation, Logo Design, Icon Design, Doctoring Images &amp; <strong>every thing possible in Graphic Design </strong></em></li><li><em>This course is available <strong>exclusively on Udemy </strong></em></li><li><em><strong>Structure</strong><strong>d Learning</strong> - From The Basics to Masterpieces </em></li>  \t<li><em>You don't need to know any software knowledge or anything to take this course</em></li>  \t<li><em>You don't need to know any-kind of coding to design websites</em></li>  \t<li><em>Over 6 hours of <strong>High Quality</strong> Video Contents &amp; still counting</em></li>  \t<li><em>Learn with the <strong>latest technologies</strong> like Grid System,Vector &amp; Responsive Design</em><strong>  \t</strong></li>  \t<li><em><em><em>Already getting <strong>5 Star Reviews</strong> from VERY satisfied students</em></em></em></li>  \t<li><em><strong>Lifetime</strong> access with a community of </em><em> passionate students over 300+ &amp; still counting</em></li>  \t<li><em>All future extra lectures and upgrades are always included for <strong>free</strong></em></li>  \t<li><em><strong>Download </strong>all my premium graphic resources absolutely free with this course</em></li>  \t<li><em>Frequent updates and <strong>discussions</strong>, I will provide all your queries whenever you post a question on the discussion tab</em></li>  \t<li><em>Get <strong>certified</strong> from Udemy after completion </em></li><li><em><strong>Awarded Best </strong> Online Graphic Design Course</em></li>  \t<li><em>You can <strong>start earning</strong> money as soon as you master the skills<em>, <em> I will also tell you what is the best of the <strong>best ways</strong></em> to earn money using Graphic Design</em></em></li>  </ul>    <p>  \t                                             ***********************************************************************  </p>  <p>  \t                                             You could be an entrepreneur or a housewife or a teenager or a middle-aged person maybe a student who wants to make a career in graphic design or you may be already working as a graphic designer who wants to polish and upgrade more skills! Whoever you are, your whole world and life is going to change magically when you become a master in graphic design! It's like <strong>'The Wizard of The Digital Visual World'</strong>! You can literally change the whole world with your <em>magic-wand</em>.  With your imagination there is no such limit what you can do and what else left to try!  \t  \t<strong>Hello and Congratulations,</strong> today you have found the ideal path of you journey and the perfect place where you can shape your freedom of creative aspiration to the highest level of excellence. My name is Shouvik, from India.  </p>  <p>  \t  \t                                                                         In this course of <strong>'Learn Worldclass Graphic Design : From The Core To A Pro+'</strong> I am going teach you every single thing that you need to learn to become an <strong>All Rounder Graphic Designer</strong>. I have picked the most important tools for you to make a <strong>proper use of time</strong>! I have made this course with a step by step structure. From the tiniest things to the masterpieces. This is the only online course where you can learn complete graphic designing including all the designing lessons like Logo Design, Icon Design, Typography, Designing Advertisements, New Age Poster Design, Catchy Flyers, Print Designs, Design Brand New Websites, Making Brand Identity in graphical part. That's not all though in other sections you can learn making Stunning Photo-Manipulations, Doctoring Images, Turning Normal Images Into HDR, Making Incredible Digital Paintings and many many more opportunities are waiting for you.  </p>", 
    "end_date": null, 
    "title": "All-in-One Premium Design Course - Scratch to Pro+ Edition", 
    "price": "45.00", 
    "instructors": "Shouvik Raychowdhury", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380668_14e0_25.jpg", 
    "course_url": "https://www.udemy.com/worldclass-graphic-design/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-30T06:53:35Z"
}