{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This is an introduction to anatomy and figure drawing. In this very in-depth course you will start from novice and or hobbyist and end with the mentality and skills of a professional. Drawing anatomy for some is an elusive unicorn that can seem impossible to catch. Books can be confusing and even cryptic. I have the same books that you have and it really didn’t help me improve. Not being able to create can be a crippling experience for an artist. We kid ourselves into thinking we don’t need to draw the figure and can just “get by” through clip art or tracing. The truth is that is simply not good enough. It’s time to finally slay that figure drawing dragon. \n\n  </p>\n\n<p> The skills you acquire here will enhance not only your own work but give you a solid base to in any other online course or book etc. There is no \"Quick fix\" or Short cuts to making great art. It requires work. It's fun work and I'm going to show you a method that will make creating your own human figures for games and comics or a client’s work \"pain free\".\n\n  </p>\n\n\n\n<p>The skills you will learn not only will apply to things like character design and turnarounds for games and creating action for comics. It can translate to illustration and digital painting and can even give you a jumpstart to 3D. There are limitless possibilities once you learn anatomy and figure drawing. The only limits are the ones you set for yourself.  \n\n  </p>\n\n\n\n<ul><li>·         You will learn how to draw anatomy without relying on reference</li><li>·         You will be able to think like an artist and be a problem solver</li><li>·         This is for those that are serious about improving art</li><li>·         Keep an open mind and there is no time limit, work at your own pace.</li><li>·         You will learn the muscles of the figure</li><li>·         You will learn how to pose the figure</li><li>·         You will learn to create variety and develop your own style</li><li>·         You will no longer need to “search for a pose” or look at another artists work.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Who this course is for:</strong>\n\n  </p>\n\n\n\n<ul><li>·         Any beginner who wants to learn how to draw</li><li>·         Art students (traditional and nontraditional and self-taught)</li><li>·         Traditional artists who want to learn anatomy and figure drawing</li><li>·         Graphic designers who want to learn to draw anatomy to get more clients and more work</li><li>·         Anyone who wants to make their own game, graphic novel or illustrations</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What this course is Not</strong></p>\n\n\n\n<ul><li>·         Not a \"Speedpainting\" course</li><li>·         Not a series of \"Shortcuts\"</li><li>·         Not a \"Watch me draw\" type of course</li><li>·         Not a \"magic wand\" for drawing (You have to put in the work)</li><li>·         No special software or any software is required. </li></ul>\n\n<p><strong>Please be aware: *There are no subtitles or closed captions for this course at this time.</strong>\n\n  </p>\n\n\n\n<p>I hope you will join me and allow me to be your professional guide on your art journey.</p>", 
    "end_date": null, 
    "title": "Anatomy and Figure Drawing for Games and Comics.", 
    "price": "45.00", 
    "instructors": "Rich Graysonn", 
    "commitment": "21 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/880202_d1eb.jpg", 
    "course_url": "https://www.udemy.com/anatomy-and-figure-drawing-for-games-and-comics/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-16T17:38:05Z"
}