{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>Do you want to be a professional comic artist</strong>, concept artist, or storyboard artist, etc?  </p>  <p>  \t<strong>Then you need to be able to draw the human figure quickly</strong>. Most artists can&rsquo;t do this because &hellip;  </p>  <p>  \tThey never learned Anatomy for Figure drawing.  </p>  <p>  \tMy course teaches you anatomy for figure drawing in an easy to understand way, but don&rsquo;t take my word for it.  </p>  <p>  \tScroll down and watch some of the free lectures. I offer a few hours free so you can see that my teaching style is for you.  </p>  <p>  \tIn this course, you will learn the basics of proportions, and how to simplify the skeleton. You will learn the draw the skeleton and learn where all the muscles attach, which is key to drawing figures from imagination. You will learn a simplified muscle map, simplified mannequin and more.  </p>  <p>  \tYou will even learn how muscles change when in different poses.  You will also learn where fat builds up, and all the different body types. This is the last and only anatomy for figure drawing and comics you will ever need. Money back guarantee, upheld by Udemy&rsquo;s high standards.  </p>  <p>  \tI also have bonus videos, like how to draw breasts and a quick sculpting of the human video.  </p>  <p>  \tThis is a huge course, but well worth the time. 65 hours, <strong>but ...</strong>  </p>  <p>  \t<strong>you are ready to draw figures like a pro</strong>, so simply scroll down and watch some of the free videos.  </p>", 
    "end_date": null, 
    "title": "Anatomy for Figure Drawing: Mastering the Human Figure", 
    "price": "25.00", 
    "instructors": "Neil Fontaine", 
    "commitment": "68.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62721_eed7_7.jpg", 
    "course_url": "https://www.udemy.com/anatomy-for-figure-drawing-and-comics/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-27T23:26:03Z"
}