{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<ul style=\"\">  \t<li><strong style=\"\">No Programming</strong></li>  \t<li><strong style=\"\">No Prior Experience</strong></li>  \t<li><strong style=\"\">Mac or Windows</strong></li>  </ul>  <p>  \t  &lt;/strong&gt;Do you want to be one of the first to design for the Apple Watch? In this course you will learn how to create custom apps that fit the small display size of Apple&#039;s most intimate device.  </p>  <p>  \t          No Photoshop experience necessary. I will teach you everything you need to know as we go through and actually design our interface.  </p>  <p>  \t          The first step is a quick introduction of Photoshop and the tools we will be using most. We are going to cover the basics in under 20 minutes!  </p>  <p>  \t          We will start by learning how to use mockups and quickly move into creating our own mockups. After that we will design a search and loading screen for our custom app concept.  </p>  <p>  \t          The App we are designing is based off a very popular app that most people from all around the world have hear of.  </p>  <p>  \t          After sinking our teeth into some design, we will go into the Human Interface Guidelines provided by Apple to get a better understanding of the Apple Watch anatomy.  </p>  <p>  \t      Then it is back to designing. We will finish creating each individual screen for our app.  </p>  <p>  \t      By the end of this course, you will have a great understanding of the individual elements that make up the Apple Watch interface, and how to design correctly. You will also have a great understanding of how to use Photoshop to accomplish UI tasks.  </p>", 
    "end_date": null, 
    "title": "Apple Watch Design", 
    "price": "20.00", 
    "instructors": "Andrew Eddy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364986_06d1_5.jpg", 
    "course_url": "https://www.udemy.com/apple-watch-design/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-07T05:00:20Z"
}