{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Every business, every brand, and every product in the world need a logo. A logo designer has a <em style=\"\">huge and lucrative clientele</em>.</p><p style=\"\">But there&#039;s more! Providing logo design services is a great gateway to forging a successful win-win relationship with a client so that you&#039;re <strong style=\"\">best placed to then offer <em style=\"\">other design services</em></strong> and do more exciting and creative work. Logo design is the passport to enter a promised land of business opportunity!</p><p style=\"\">In this course, you will learn:</p><ul style=\"\"><li style=\"\">the theory and art behind creating logos</li><li style=\"\">how to find logo design clients</li><li style=\"\">how to communicate with a client before and after the design process, </li><li style=\"\">how to design logos </li><li style=\"\">how create logos electronically using mostly Adobe Illustrator</li><li style=\"\">the business of logo design</li><li style=\"\">how and what to charge the client </li><li style=\"\">how to ensure a win-win relationship that results in <strong style=\"\"><em style=\"\">repeat business for you</em></strong>.</li></ul><p style=\"\">This course is suitable for beginners in the world of design as well as folks who&#039;ve been working for an agency for a few years and want to branch out there or go it alone!</p><p style=\"\">My name&#039;s <strong style=\"\">Rob Cubbon</strong> and I&#039;ve been running a web and graphic design business for nearly 10 years. Over that time I&#039;ve designed many logos and identities for many different clients and, time and time again, I&#039;ve found that a successful logo design project is the catalyst for a great business relationship – a business relationship that could be worth<em style=\"\"> <strong style=\"\">hundreds of thousands of dollars</strong> for your business – and <strong style=\"\">great, fun and creative work. </strong></em></p><p style=\"\">Becoming a logo designer is a fantastic and creative way to make a living – it&#039;s also very lucrative. </p>", 
    "end_date": null, 
    "title": "Become A Logo Designer ", 
    "price": "30.00", 
    "instructors": "Rob Cubbon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530426_bbb8.jpg", 
    "course_url": "https://www.udemy.com/become-a-logo-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T15:43:11Z"
}