{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Why this course will earn you $100 an hour as a graphic designer, and save you $1,000 each year.</strong>  </p>  <p>  \t                Would you like to become a graphic designer? If so, this course is definitely for you.  </p>  <p>  \t                It provides a complete guide, covering everything you need to know about becoming a designer.  </p>  <p>  \t                You’ll learn how to create a website that appeals to clients (rather than other designers).  </p>  <p>  \t                You’ll discover the vital systems that make your consultancy run smoothly, even when you’re asleep.  </p>  <p>  \t                You’ll discover the right way – and the wrong way - to handle inquiries from potential clients.  </p>  <p>  \t                You’ll learn how to construct a brilliant proposal, using our ‘full in the blanks’ template.  </p>  <p>  \t                Use our ready-made forms and templates to set up and run your business, even if you have no commercial experience.  </p>  <p>  \t                And long after you’ve completed the course, you’ll be able to use the accompanying road map, guides and other resources we include in the course.  </p>  <p>  \t                There’s a 60-day refund period. So if the course doesn’t meet your expectations, or you change your mind, you can have your money back.  </p>  <p>  \t                And unlike other courses which are just slides with a disembodied voice, this course consists of a real <strong style=\"\">individual</strong> talking through the issues with you. It’s like having your own personal tutor.  </p>  <p>  \t                For 20 years we at the Blackford Center have specialised in helping creative people become self employed. We’ve been supporting and listening to graphic designers for two decades. So we really know what works and what doesn’t. We’re putting at your disposal the fruits of our knowledge, because nothing gives us greater pleasure than to see a learner say, “I‘ve made it as a designer. I’ve succeeded.”  </p>  <p>  \t                So why would you take this course?  </p>  <p>  \t<strong style=\"\">You’ll discover how to:</strong>  </p>  <p>  \t                -Create a design portfolio, even if you don’t have any work experience.  </p>  <p>  \t                -Get testimonials, even when you don’t have any clients.  </p>  <p>  \t                -Land your first paying client.  </p>  <p>  \t                -Double your earnings by obeying three simple laws  </p>  <p>  \t                -Avoid massive software costs which can amount to $1,000 a year.  </p>  <p>  \t                -Find dozens of places where you can get free advertising. And here we’re talking high quality places where graphic design clients go. Surprisingly, many graphic designers don’t make use of them.  </p>  <p>  \t                We’ll show you not only how to do graphic design, but also how to <strong style=\"\">earn money</strong> from it.  </p>  <p>  \t                We reveal the <strong style=\"\">mistakes</strong> that designers make - when they’re pitching for work, when doing the work, and when charging for it. We’ll help you avoid all those mistakes. That means you’ll have more success, and earn more money.  </p>  <p>  \t                You’ll discover the nine worst design sins that you can make. And you’ll discover all about the <strong style=\"\">six underlying concepts of design</strong> that will stay with you forever.  </p>  <p>  \t                You’ll receive <strong style=\"\">free</strong> graphic design software. And we’ll teach you how to use it.  </p>  <p>  \t<strong style=\"\">Secrets of the trade - revealed</strong>  </p>  <p>  \t                6 quick ways to create a <strong style=\"\">great company name</strong> for your design consultancy  </p>  <p>  \t                How to get a $10,000 domain name for only $6.  </p>  <p>  \t                3 <strong style=\"\">questions</strong> you must ask a <strong style=\"\">potential client</strong> (they aren’t what you think).  </p>  <p>  \t                4 methods for breaking out of obscurity and <strong style=\"\">making a name for yourself</strong> as a hot shot, designer  </p>  <p>  \t                5 strategies for <strong style=\"\">beating the cut-price, low wage offshore designers</strong>; and making clients want <strong style=\"\">your</strong> work.  </p>  <p>  \t                5 criteria that help you get your pricing right.  </p>  <p>  \t<strong style=\"\">Plus, the pitfalls to avoid</strong>  </p>  <p>  \t                ·How to overcome creative block  </p>  <p>  \t                ·How to avoid the low-fees trap  </p>  <p>  \t                ·How to keep the money coming in, even when the economy is weak.  </p>", 
    "end_date": null, 
    "title": "Become a Graphic Designer, and earn a living from it", 
    "price": "35.00", 
    "instructors": "Blackford  Center", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/280194_245a_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-graphic-designer-and-earn-a-living-from-it/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-13T14:48:40Z"
}