{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">At the end of this course, you'll be able to create PROFESSIONAL looking graphics for your home business... and resell them if you wish, just like a professional logo designer. You'll quickly become the master of creating images for your own home business that'll make your customers love sticking around your site.</p><p style=\"\"><strong>I've included the FULL Mac and Windows versions of the software with this course.</strong> Using The Logo Creator software you'll learn some inside tricks for creating: </p><ul><li>Page headers with 'images inside of text' (make the word \"wood\" look like wood!)<br style=\"\"></li><li>Logos (how to select one of the 200 templates and modify it a gazillion ways and resell each of them)<br style=\"\"></li><li>How to bring traffic to your home business using Pinterest and The Logo Creator<br style=\"\"></li><li>You'll learn how to create a video for your marketing purposes (using The Logo Creator and an animation tool called \"Powtoon\")<br style=\"\"></li><li>You'll be able to create page headers and really nice looking graphics for your business so your customers will know your site is reputable</li><li>You'll learn how to create your own meme and you're own eBook (it's easy!) as well as how to use The Logo Creator to create a viral video</li></ul><p style=\"\"><br></p><p style=\"\">Becoming a logo designer with this software is easy because it's template-based. Just drag and click images and text. These tips and tricks (and the <strong>FREE</strong> software provided) will get you looking professional ...and profitable (especially if you want to SELL what you create).<br></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Become a Logo Designer: Guide to Complimentary Logo Software", 
    "price": "35.00", 
    "instructors": "Marc Sylvester", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429366_1951_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-logo-designer-guide-to-complimentary-logo-software/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-22T22:11:16Z"
}