{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>  Adobe InDesign</strong> is <em>the</em> industry-standard software for producing print publications: books, magazines, brochures, flyers, posters, business cards, documents and even product packaging. You name it, InDesign is always the first and best choice for designers when they want to produce professional-standard design work for print.  </p>  <p>  \t  This course, aimed at complete beginners to InDesign, will lead you through the process of creating, formatting, proofing, preparing and exporting InDesign documents, ready for sending them straight to the printers. Over <strong>10 concise and structured sessions</strong>, and 35 lectures, we'll cover the basics of setting up professional print layouts and working with images, typography, color and effects to create your desired result. We'll also take a look at how features like Masters, Book Files and proofing with Preflight can speed up your workflow and transform you into an <strong>InDesign Pro</strong>!</p><p>To help you along, you'll receive a course handbook, 10 Essential InDesign Skills, which is yours to keep after you've completed the course. You'll also work towards creating your own magazine layout in InDesign and receive <strong>pre-prepared, complete magazine templates</strong> for you to refer to and use throughout and beyond the course lessons.</p>  <p>  \t  You might be embarking on a new career in graphic design and want to develop a foundation of knowledge in print design. Or perhaps you want to grow your confidence in using InDesign on a practical basis when you encounter it in your work (e.g. if you work in the Marketing, Publishing, PR, Advertising or Retail industries). You may have a little bit of experience of using the software, or you may be a complete beginner. If you fit any of these criteria, the <strong><em>Become an InDesign Pro in 10 Skills</em></strong><strong> </strong>course will be a perfect fit for you!</p>", 
    "end_date": null, 
    "title": "Become an InDesign Pro in 10 Skills", 
    "price": "50.00", 
    "instructors": "Grace Fussell", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/406504_5381_5.jpg", 
    "course_url": "https://www.udemy.com/become-an-indesign-pro-in-10-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T12:06:34Z"
}