{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Graphic design has always been a popular profession, but with more and more technology being introduced into our lives it's becoming an ever more important one too. All kinds of people use all kinds of technology every day. Making that technology as user-friendly as possible is vital, and graphic design is one of the most important elements of this. </p><p><b>The Ultimate Crash Course on Graphic Design</b></p><ul><li>Master the most widely used software in graphic designing</li> <li>Learn the principles of graphics design and visual communication</li> <li>Gain an insight into the current graphic design industry</li> <li>Understand how to forge a career path as a graphic designer</li></ul><p><b>Graphic Design for All</b></p><p>This course is aimed at aspiring graphic designers, web designers and digital artists who wish to develop a skill set needed to become a professional graphic designer. Suitable for both complete beginners and those who already have some knowledge of the industry; this course will prepare you for a career as a graphics designer through familiarising you with the concepts, principles and – most importantly – the software you'll need to know.</p><p>You'll learn everything from working with layers and selections in Photoshop, to formatting text and menus in Dreamweaver, to using pathfinders and special effects in Illustrator. </p><p>As well as equipping you with a valuable skill set, you will also learn how to get your foot in the door of the graphic design world, from how to land your first job, to finding continued inspiration, to the ins and outs of joining the graphics design community. </p><p>On completion of this course, you will have the strong foundation needed to get started in the world of graphic design, along with the skills needed to start working professionally straight away. </p><p><b>Tools Used</b></p><p><b>Adobe Photoshop:</b> Used for editing and manipulating photographs and images. Improve lighting and colour, add special effects, remove blemishes, create your own images from scratch, and more.</p><p><b>Adobe Illustrator:</b> The standard software for graphics design, and where you do the majority of your work. Create any kind of vector art or illustration your mind is capable of thinking up!</p><p><b>Adobe Acrobat:</b> Transform your work into a format than anyone can view - a PDF. This program also enables you to create, manipulate, print and manage your finished project files.</p><p><b>Adobe Dreamweaver:</b> Design and develop beautiful websites with ease, complete with both a design view and code editor so you can see changes you make on all sides in real time.</p>", 
    "end_date": null, 
    "title": "Become a Professional Graphic Designer", 
    "price": "35.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "20.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/278948_8ff9_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-professional-graphic-designer-udemy/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-11T20:13:50Z"
}