{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>-- Welcome to the course: --</strong><br></p><p>This course will guide you and teach you about the super fun about types in adobe illustrator.<strong> you will learn almost all about types in illustrator </strong>. this course will introduce you all the<strong> basic and advanced types tool in depth. show you how and where you can use those types tool effectively.</strong></p><p>You will <strong>learn and practice with a whole lot of example and even we will work with projects too. so you will understand these awesome types tool in depth and master types in </strong>illustrator.</p><p><strong>After completing this course!</strong></p><ul><li><em>You will have understanding of the types in illustrator </em></li><li><em>you will have understanding of all the basics and advance types tool in depth.</em></li><li><em>you will be able to create any shapes with types in illustrator.</em></li><li><em>you will be able to work effectively in illustrator.</em></li><li><em>you will be able to create your own awesome word cloud in illustrator </em></li><li><em>you will be able to create awesome typography in alomost any shapes</em></li><li><em>you will understand multiple different way and techniques to use type in illustrator</em></li></ul><p>Materials Included:</p><ul><li>Exercise files</li><li>.ai files</li><li>.jpg files</li><li>fonts</li></ul><p>At the end of course you will face the course completion quiz, Remember that will be compulsory to test you knowledge you learned in this course and for get your certificate. i hope you will love this course.</p><p><strong>So let's get started !</strong></p>", 
    "end_date": null, 
    "title": "Business design - All about Types features in Illustrator !", 
    "price": "35.00", 
    "instructors": "Rahul Giri", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519968_3c8c_8.jpg", 
    "course_url": "https://www.udemy.com/mastering-types-in-illustrator/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T06:23:51Z"
}