{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This class is a project-based introduction to my favorite calligraphy tool – the <strong>Pilot Parallel Pen</strong>, a popular broad-edge pen, often featured in YouTube videos. <br><br>This class will guide students through exercises which teach pen angle and developing rhythm, while creating a series of marks you can work with in creating your unique project. Using close-up video, I'll demonstrate working with the pen, using only the ink that comes with the pen and recommended papers and addressing the main challenges faced by beginning calligraphers. Carefully designed worksheets allow you to watch and practice at your convenience.</p><p>The project is to design a tattoo (or ornamental design). Learners will be encouraged to create an original design, and given four design approaches to use in designing their tattoo. Body inking is totally optional! <br></p><p>Although designed for beginning calligraphers, this class teaches skills which can enhance the work of illustrators, designers, typographers, tattoo artists, watercolour artists and anyone else who isn’t afraid of a little water-based ink on their fingers! My focus is on the Pilot Parallel pen, but much of the class is applicable to any broad-edged calligraphy pen.<br><strong><br>NOTE: This class is the first in a trilogy!</strong><br></p><p>I have created two classes to isolate and teach <strong>(1) pen skills</strong> and <strong>(2) more advanced pen skills plus working with coloured inks</strong> in two fun calligraphy classes, as a prelude to learning <strong>(3) gothic lettering</strong>. <br><br>My approach is to get you <strong>super comfortable with your tool</strong> and <strong>acquiring skills</strong> with both pen and ink – before turning attention to the more serious work of letterforms. The goal is to lead you step-by-step to <strong>calligraphy success</strong>! </p>", 
    "end_date": null, 
    "title": "Calligraphy for Beginners: Creating Strong Lines", 
    "price": "40.00", 
    "instructors": "Alice Young", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/682060_2b3a.jpg", 
    "course_url": "https://www.udemy.com/calligraphy-for-beginners-creating-strong-lines/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-27T03:47:20Z"
}