{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn simple techniques to start your Design Career.</p><p><strong>Master a strong method to Design with quick and easy steps taught in a very easy to understand way</strong></p><ul><li>Pick from 1 Million templates</li><li>Upload your own photos</li><li>Design your social network backgrounds</li></ul><strong>A specialist skill at your fingertips</strong>Learn the fundamentals of online designing, this puts a high level skill right on your screen for you to learn. Anyone can design on Canva as long as you have a computer that can access the internet. <strong>Content and Overview </strong><p>This Canva course is for people starting out and want to create good design simply and easily this corse features 13 lectures (+ a introduction and conclusion) and over 30 minutes of content this will certainly teach you the basic knowledge. The first lecture is about how to create an account, this is such a simple task that everyone has to learn to do. In the second lecture I will teach you how to get your way around the site, so you know what each button does. In the third lecture I will talk to you about picking the correct template, this is important because this is how your deign will be viewed to the public. In the fourth lecture I will show you the design interface this will show you the basic tools to edit your design. In the fifth lecture I will teach you how to add a background colour or image. In lecture six you will learn how to add text, this is where you will be able to get your message across to your audience. In lecture seven you will learn how to upload your own photos, this would be handy if you want to create collages. In lecture eight you will learn how to edit your photos, if you have a dull photo you can make it bright or you could completely recolour the photo. In lecture nine you will see all of Canvas \"Freebies\" these are text, images, templates or lines that you can use to give your design the extra kick. In lecture ten you will learn how to export or save your design to your computer. In lecture eleven you will find out how to edit a Instagram photo. In lecture twelve you will learn how to create a photo collage. And in the last lecture you will learn how to design a YouTube banner.</p><p>If you complete this course you will be able to design lots of things using Canva.</p>", 
    "end_date": null, 
    "title": "Canva - Making Design Simple", 
    "price": "20.00", 
    "instructors": "Christopher Young", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514496_d9e9.jpg", 
    "course_url": "https://www.udemy.com/design-with-canva/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T11:05:29Z"
}