{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Photoshop is powerful . There are a bunch of powerful tools in it . May be you have learned how to use these tools,but still can not make a stunning design . This course is aimed to show you a whole process of creating a Cartoon Style Game Logo . It's especially helpful  for indie game game developers who want to create their own game logo but can not afford to hire an artist.<br></p><p><strong>Learn how to create your own Game logo using Photoshop in this Course</strong></p><ul><li>learn some basic logo design guideline</li><li>learn how to sketch out your idea in Photoshop</li><li>learn how to create clean line art</li><li>learn how to add depth to form</li><li>learn basic colouring technic in Photoshop</li><li>learn the use of layer effect</li></ul><p><strong>Effective logo design pipeline for your game </strong></p><p>Game logo is especially important for your video game , it's the first insight of your game's potential players,it determine wether or not the players will download your game. In terms of game logo design,a good game logo must best fit the style of your game and should be more impressive than flat style logo.</p><p>A versatile and productive game developer should not only have the knowledge of coding but also should have the ability to create their own game art  to take the full control of their game developing process.</p><p><strong>Contents and Overview</strong></p><p>This course, containing 15 lectures and 2 hours of content, provides step-by-step instructions on game logo design.  No logo design experience is required; however, you should have a full or free trial version of Adobe Photoshop, even though you don't need prior knowledge working in this program.</p><p>Each lecture focus on one particular step in design process, All steps form a design pipeline .In this pipeline,the input is  a fresh idea,the output is production ready game logo.</p><p>At the beginning of the course ,I will introduce some guideline for game logo design.</p><p>then in the following lectures,some technics will be covered,such as sketching in photoshop,basic colouring technic in photoshop,and the using of layer style to create stunning effect.</p><p>After finishing the course,you will have a good overview of the game logo design process,and with some modification to each steps of the process,you can create your own production ready game logo effectively.</p><p>And some knowledge that you will learned in this course can be also applied to other design process ,such as game UI design.</p><p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Cartoon Game Logo Design using Photoshop", 
    "price": "20.00", 
    "instructors": "XiaoWei Wu", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656914_3ba3.jpg", 
    "course_url": "https://www.udemy.com/cartoon-game-logo-design-using-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-01T12:16:39Z"
}