{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong class=\"redactor-inline-converted\">Join over 4k students already enrolled in the course and Learn to Become a Digital Artist using Corel Painter and Wacom graphic pen tablet.</strong></p>\n\n\n\n<hr>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                         Learn Digital Painting from a Photograph using the <strong class=\"redactor-inline-converted\">faster way</strong> and the techniques used by Industry Professionals.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                         When <em class=\"redactor-inline-converted\">you enroll</em> in this course, you will be Learning the Art of Digital Painting and the essentials of using Corel Painter and a Wacom Tablet. Share your creation with our student community and get feedback on your Painting.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                   Whether you want to gift it or want to earn money from Digital Painting, this is the course for you.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                   <strong class=\"redactor-inline-converted\">No experience with Digital Painting or traditional painting is required</strong>, nor is any experience with Corel Painter or a pen tablet necessary.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                 In this course, Gurasis Anand walks through the process of downloading and installing Corel Painter trial, then explains the importance of a pen tablet for painting in digital medium and helps you compare and buy a tablet, Gurasis then teaches the essentials of Corel painter and Wacom pen tablet usage.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                   He shares tips and best practices for a more efficient workflow in Corel Painter, then he teaches you to paint the Portrait painting from a photograph step by step. Finally, he adds finishes touches to the painting and gets the Portrait printed on a Canvas. After the painting is complete you share your Digital Portrait Painting with the PlexStreet student community and get feedback.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                         In the <strong class=\"redactor-inline-converted\">Bonus section</strong>, Gurasis shows you tips and tricks to paint fur effectively for the pets in your portraits. Then discuses Cloning and Auto-painting techniques to paint faster. Finally, he shows you ways money could be made with this Art of Digital Painting.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                         Topics Covered:  </p>\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>Essentials of using Wacom pen tablet</li>  \t<li>Essentials of Corel painter 2015</li>  \t<li>Best practices for Painting in Corel Painter</li>  \t<li>Painting a Digital portrait from a photograph step by step</li>  \t<li>Getting a Digital Portrait Painting Printed on a Canvas</li>  \t<li>Painting Fur in Corel Painter</li>  \t<li>Bonus: Cloning and Auto Painting in Corel Painter</li>  \t<li>Earning money from Digital Portrait Painting</li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                               You can save the time Gurasis has spent exploring and learning the techniques used by today's professionals of The Digital Art by taking this course.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                 <em>Become a Digital Artist</em>, <em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">ENROLL TODAY!</strong></em>  </p>", 
    "end_date": null, 
    "title": "CP102i - Complete Digital Painting Training", 
    "price": "30.00", 
    "instructors": "Gurasis Anand, PlexStreet Academy, PlexStreet Studio", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367460_b651_13.jpg", 
    "course_url": "https://www.udemy.com/digital-portrait-painting/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T17:44:31Z"
}