{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course is a beginner course on <strong>how to create professional looking images and graphics for social media</strong>, by using Canva free tool. It is intended for people who want to differentiate and capture attention with their social media campaigns.</p><p>You don't need any graphic design experience, just start from zero and create amazing images that look awesome.</p><p>You will learn how to create your Canva account, how to use the design dashboard, how to add images, how to add and edit text, how to find out already prepared text blocks that look professional and how to export your images from Canva to your social media accounts.</p><p>By taking it, you will be able to understand and master the art of creating high quality graphic design images for social media in the step by step demonstrations.</p><p>My name is Florin Rosoga, I managed hundreds of social media campaigns for myself or my clients in the last years. </p><p>One of the most important elements of them are <strong>the images you use</strong>. Since social media is a <strong>visual </strong>place, an <strong>engaging </strong>image will improve your social media campaign <strong>conversion</strong>.</p><p>In this course you will get step by step video explanations to help you understand in a comfortable way all about creating this kind of images in minutes, for free and<strong> without any graphic experience.</strong><br></p><p>The entire ourse can be downloaded as a video training to watch or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next... click the Take this Course button top right and you'll be taken to our secure payment page.</p><p>Just <em><u>Enter Your Regular Details</u></em> and complete your investment to have immediate access.<br></p><p>Stop struggling with your social media campaigns images and start mastering graphic design in minutes!</p><p><strong>Thank you for reading this and learning about my course</strong> ... I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE</strong> to get started!<span></span><br></p>", 
    "end_date": null, 
    "title": "Create Beautiful Compelling Social Media Banners With Canva", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631148_257f_5.jpg", 
    "course_url": "https://www.udemy.com/stunning-images-for-social-media-with-canva/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T10:05:23Z"
}