{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">In this course, you&#039;ll learn how to design an information diet that will serve you well for the rest of your life. </p><p style=\"\">You&#039;ll start out by learning how an information diet works, and what items you should cut out or reduce significantly. Then we&#039;ll go over how to improve your diet by adding new information formats. </p><p style=\"\">Finally, you&#039;ll learn how to turn your information diet into a beautiful one page flowchart and paint it with watercolors.</p><p style=\"\">Accelerated learning is about systems. And you can only maintain a system if you have the right habits in place to make it a consistent reality.</p><p style=\"\">Individual learning achievements don&#039;t matter. What matters if having a system in place so that you are constantly learning faster and retaining more of what you learn.</p><p style=\"\">Many people struggle to learn efficiently because they spend most of their learning time on information snacking.</p><p style=\"\"><span style=\"\"></span>What&#039;s info snacking?</p><p style=\"\">It&#039;s when you get lost in articles, social media, pictures, apps that are supposed to be about learning but end up as an hour or two of wasted time with little to show for it afterwards.</p><p style=\"\">You forget half of what you read in a couple weeks, and 90% after two months.</p><p style=\"\">Any information that is forgotten is essentially worthless. And most people spend the majority of their learning time on reading things that they will inevitably forget and never be able to use again.</p><p style=\"\">To retain what you learn and eventually take action on it, you have to have a process for retaining knowledge. That means taking notes, storing those notes and having a system for getting spaced repetitions on those notes so eventually they get stored permanently in your long term memory and become part of your richly interconnected neural network of ideas that you&#039;ll never forget.</p><p style=\"\">The best way to represent this system is with a flowchart. In this course, you&#039;ll learn how to conceptualize your information diet and track it through it&#039;s stages of “digestion&quot; to the point where it&#039;s become part of your long term store of information. Once you finish your concept, you&#039;ll learn how to represent it as a beautiful watercolor painting that you can use as a constant reminder of your new information diet.</p>", 
    "end_date": null, 
    "title": "Create an Accelerated Learning Flowchart with Watercolors", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/522784_7467.jpg", 
    "course_url": "https://www.udemy.com/design-an-information-diet-plan-with-a-watercolor-flowchart/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-07T21:45:17Z"
}