{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this series, professional concept artist and illustrator Tyler Edlin will walk you through the workflow needed to create pro character designs like those used in AAA games and major films. Through the creation of a Fantasy Mage called Kari, Tyler will demonstrate a professional workflow, as well as covering all of the design considerations needed to create concepts from scratch, and why design is so important to artists in these fields. </p><ul><li><strong>Understand basic design theory for concept artists and illustrators.</strong></li><li><strong>Learn the use of silhouettes to aid in design.</strong></li><li><strong>Improve understanding of poses to \"sell\" the character.</strong></li><li><strong>Improve color theory and developing a color palate for the piece.</strong></li><li><strong>When to work \"loose\" and when to push detail to get your best work.</strong></li></ul><span><b></b></span><b><strong></strong></b>Although the course content is approximately four hours, you should expect to invest significantly longer on your own piece. Some content is sped up to avoid becoming boring for you. A strong concept piece can take any where from multiple hours to days to complete. Be prepared to invest significant practice time on your journey! This course is structured as a \"from scratch\" walk through. Tyler will discuss both practical method and methodology through out the creative process. Starting from a blank document, all the way through design and the final piece. Tyler also includes his personal Photoshop brushes in the second lecture, as well as the final .psd file for you to deconstruct and review. <b><span></span></b>By the end of this course, you'll be armed with all of the tools you need to design compelling, complex characters that make sense within the world they are created for. From there it's up to you to apply and practice the skills needed to become a professional artist.", 
    "end_date": null, 
    "title": "Create Professional Character Designs in Photoshop", 
    "price": "20.00", 
    "instructors": "3D BUZZ Programming and Digital Art training", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553832_295a.jpg", 
    "course_url": "https://www.udemy.com/create-professional-character-designs-in-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-13T23:44:57Z"
}