{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t   Con el curso de creación de personajes fantásticos, aprenderás retocar una imagen dandole el aspecto de un vampiro o de un zombi. Por un lado modificando su color y atmósfera y creando diferentes elementos, como los colmillos para crear una sofisticada imagen que represente a una criatura de la noche. Por otro lado aprenderás a crear en tus retratos con Photoshop los ojos, piel y heridas propias de un muerto viviente de una forma sencilla, usando tan solo estilos y modos de fusión en diferentes capas.  </p>  <p>  \tAdobe Photoshop es el nombre o marca comercial oficial que recibe uno de los programas más populares de la casa, Adobe Systems, junto con sus programas hermanos Adobe Illustrator y Adobe Flash, y que se trata esencialmente de una aplicación informática en forma de taller de pintura y fotografía que trabaja sobre un &quot;lienzo&quot; y que está destinado para la edición, retoque fotográfico y pintura a base de imágenes de mapa de bits.  </p>  <p>  \tEste curso es impartido por Victoria Vázquez, técnico en Diseño gráfico y en Infografía, cursó máster en 3D y animación digital. Experta en creación de contenidos para la formación por la Universidad de Salamanca, lleva más de 5 años trabajando como editora de contenidos multimedia y formadora para diferentes consultoras.  </p>", 
    "end_date": null, 
    "title": "Crea personajes fantásticos con Photoshop", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/188604_9295.jpg", 
    "course_url": "https://www.udemy.com/crea-personajes-fantasticos-con-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-25T17:42:39Z"
}