{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t                                      Welcome to my first Photoshop Course on Udemy!  </p>  <p style=\"\">  \t                                      In this Sport Retouching Course, I will show you my complete retouching proces from the beginning till the end. In this over 1 hour course you will get knowledge to create you own breathtaking images!  </p>  <p style=\"\">  \t                                      No matter if you just started your adventure with photoshop or you have knowledge about photoshop. This course is slowly and well explained, so even beginners can find a way to create their own projects with this course.  </p>  <p style=\"\">  \t                                      For the incredible low price, you will get 9 very well explained lessons of complete Sport Retouch!  </p>  <p style=\"\">  \t                              Were you struggling with Creative Retouch or maybe you just started your adventure with Photoshop? This Course is something you&#039;ve been looking for.  </p>  <p style=\"\">  \t                              It doesn&#039;t matter if you are new in Photoshop or have some projects behind you. The way I present lesson in this course make it easy to understand, and make you know photoshop, even if you have no experience with this fantastic software!  </p>  <p style=\"\">  \t                          You don&#039;t want to believe it?  </p>  <p style=\"\">  \t                          What If I&#039;ll tell you that few years ago I was exactly in the same situation. I had no experience and no knowledge at all. Since I opened photoshop for the first time, I got obsessed and explored photoshop on my own. And now I am able to present you my best knowledge I&#039;ve got for the last couple of years!  </p>  <p style=\"\">  \t                                      --------------------------------------------------------------------------------------------------------------------  </p>  <p style=\"\">  \t                                      In every lecture you can find something which help you to improve your skills:  </p>  <p style=\"\">  \t                                      Lecture 2:  </p>  <p style=\"\">  \t                                      At the beginning of this course I will explain you how to do simple Raw Conversion in Camera Raw and prepare your image to work in Photoshop.  </p>  <p style=\"\">  \t                                      Lecture 3:  </p>  <p style=\"\">  \t                                      I will tell you how to keep your work in order, so you will avoid unnecessary chaos.  </p>  <p style=\"\">  \t                                      Lecture 4:  </p>  <p style=\"\">  \t                                      In this lecture I will show you fantastic retouch techniques. You will see the best way to remove wrinkles from the face, clean up blemishes and accessories like knee pads  </p>  <p style=\"\">  \t                                      Lecture 5:  </p>  <p style=\"\">  \t                                      In this lecture I will show you how to do color grading using selective color and bring some cold and dramatic colors into your image.  </p>  <p style=\"\">  \t                                      Lecture 6:  </p>  <p style=\"\">  \t                      I will show you how to cross process your image using curves and improve colors by gradient map.  </p>  <p style=\"\">  \t                                      Lecture 7:  </p>  <p style=\"\">  \t                                      I will show you what&#039;s the best way to sharpen your dynamic images.  </p>  <p style=\"\">  \t                                      Lecture 8:  </p>  <p style=\"\">  \t                  In this lecture I will show you how to brighten up and enhance image by dodging and burning.  </p>  <p style=\"\">  \t                                      Lecture 9:  </p>  <p style=\"\">  \t                                      I will show you how to work with Lights and Lighting Effects to add fantastic mysterious and dramatic atmosphere into your image.  </p>  <p style=\"\">  \t                                      Lecture 10:  </p>  <p style=\"\">  \t                                      And finally I will show you how do Color Adjustment to get Perfect Dynamic Look.  </p>  <p style=\"\">  \t                                      --------------------------------------------------------------------------------------------------------------------  </p>  <p style=\"\">  \t                                      At the end of this course ...  </p>  <p style=\"\">  \t                                      - You will be able to create stunning images in Photoshop!  </p>  <p style=\"\">  \t                                      - You will know how to keep your work in order which makes your work clear and easy!  </p>  <p style=\"\">  \t                                      - You will know how to use techniques to retouch sport and dynamic images!  </p>  <p style=\"\">  \t                                      After this course, every next Creative Retouch will become easy!  </p>", 
    "end_date": null, 
    "title": "Creative Sport Retouch - Create Dynamic Images in Photoshop!", 
    "price": 0, 
    "instructors": "Marcin Mikus", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389956_f648_2.jpg", 
    "course_url": "https://www.udemy.com/creative-sport-retouch-create-dynamic-images-in-photoshop/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T00:33:13Z"
}