{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<strong>Si crees que tu nivel artistico es bajo, te hace falta mejorarlo, o simplemente te gustaria aprender mas sobre arte conceptual digital, este curso es para ti.</strong><br><p>En este curso iremos paso a paso y de manera estructurada hacia la<strong> realización de arte conceptual </strong>para crear armas de fantasia, medievales y/o futuristas (<em>sci-fi</em>),  utilizado comunmente para la realización de <strong>contenido 3D para videojuegos</strong>, como armas, escudos, armaduras, armamento, equipo, pistolas, rifles, vehiculos, naves, vestuarios, personajes, entre una infinidad de objetos.</p><p>Los pasos y estructura del curso son los siguientes:</p><ol><li>Silueta</li><li>Color</li><li>Volumen</li><li>Textura</li></ol>En tan solo 4 pasos (explicados a detalle) este curso te enseñara a <strong>conceptualizar tus ideas</strong> a otro nivel. Mostrare <strong>como pintar objetos con figuras y formas interesantes</strong> apartir de una vista lateral y la visualizacion de su silueta usando trazos ya sean meditados, o al azar, y con un poco de ayuda de nuestra imaginación para diseñar su aspecto y detalles de construcción. Despues agregaremos una base de colores para <p>definir cada elemento de nuestro objeto, dandole variación a lo elementos planeados. Una vez definidos los colores daremos volumen a la silueta con sombreado e iluminación posicionando cada brillo y sombra segun la planeación de nuestras luces en la escena. Una vez que tengamos el volumen de nuestro objeto pasaremos a agregarle textura ademas de definir los materiales de cada elemento en nuestro objeto. Solo por ultimo y si es necesario se agregaran retoques y detalles pequeños para pulir nuestro trabajo.  </p><p>Personas sin practica, pocos conocimientos en arte, o que no tienen su ojo artistico bien dominado, <strong>podrian empezar a conceptualizar objetos como armanento </strong>desde su vista lateral con este curso bien estructurado y diseñado para aprender a ilustrar a traves de siluetas.</p><p><strong>Nota:</strong> Para poder tomar este curso debes estar <strong>familiarizado con Photoshop</strong> o algun software similar (GIMP) <strong>y contar con tableta digital.</strong><br></p>¡Animate! Al final del curso voy a dejar de tarea paraque hagas tu propia ilustración y te pedire que la subas a las discuciones de este curso para su revisión, yo mismo te dare la retroalimentacion necesaria para que puedas ver donde estas fallando y puedas subir tu nivel de calidad. Mi curso tiene una garantia de satisfacción de 30 dias, si lo has terminado y no obtuviste ningun beneficio de el, puedes pedir tu dinero de regreso, asi de seguro estoy que te gustara. <p>Nos vemos en la clase. ;)<br></p>", 
    "end_date": null, 
    "title": "Curso de Diseño e Ilustracion de Armas para Videojuegos", 
    "price": "20.00", 
    "instructors": "Oziel Leal", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/601092_d8ac_2.jpg", 
    "course_url": "https://www.udemy.com/curso-de-diseno-e-ilustracion-de-armas-para-videojuegos/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-03T04:31:58Z"
}