{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Diseñar logos es uno de los retos más importantes para un diseñador gráfico. No todos los diseñadores gráficos logran especializarse en el diseño de logos. Es un proceso extenso, muy creativo y estrezante que comienza desde que te reúnes con tu cliente. Así que, la clave está en saber comprender e interpretar a tu cliente, saber aplicar los conocimientos de diseño, las técnicas y habilidades creativas para la craeción de los mismos. <br style=\"\"></p><p style=\"\"><strong style=\"\">Como diseñar logos es un curso completo donde aprenderás:</strong></p><p style=\"\"> • Aprenderás a crear logos únicos y altamente creativos.</p><p style=\"\">• Aprenderás los principios básicos del diseño y a bocetar.<br style=\"\"></p><p style=\"\">• Cómo conceptualizar, desarrollar la creatividad y generar ideas.</p><p style=\"\">• Errores de diseño y cómo corregirlos.</p><p style=\"\">• Trabajar con tipografías y colores.<br style=\"\"></p><p style=\"\">• Técnicas de diseño y procesos.</p><p style=\"\">• Tutoriales de programa InDesignCs6.</p><p style=\"\">• Aprenderás a comunicarte con tu cliente, a entenderlo, oriéntarlo y persuadirlo.<br style=\"\"></p><p style=\"\">• Cómo vender tus diseños con seguridad, generar un buen ingreso y dejar muy satisfecho a su cliente. </p><p style=\"\">Este curso consta de 30 lecciones en video y más de 3 horas de aprendizaje. Durante el mismo podrás contactarme y expresar tus ideas y preguntas, incluso consultarme sobre algún logo que estés trabajando y con mucho gusto yo te enviaré mi retroalimentación<span class=\"\" style=\"\">.</span><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Cómo Diseñar Logos", 
    "price": "25.00", 
    "instructors": "Ruth Cepero", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276680_32d8_5.jpg", 
    "course_url": "https://www.udemy.com/como-disenar-logos/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-07T16:26:00Z"
}