{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t Learn while you spend time designing a menu card in the industry leading Adobe InDesign. It&#039;s not just about all the tools but also how you will use them to get your layout clean and beautiful.  </p>  <p style=\"\">  \t You will get all the basics so you can deliver a PDF for print or even for online presence. You will experience how to import text from another document and how to clean it up. Then you will utilize InDesign&#039;s powerful styles. The styles that will make you life easy and do the formatting playful.  </p>  <p style=\"\">  \t Get into the structure of an efficient design where you can make changes globally in your InDesign layout. The learn how to style dots and change fonts all over while you need some other more funky colours. Learn the cool stuff about:  </p>  <ul style=\"\">  \t<li style=\"\">Paragraph Styles (get the typography styled like a dream)</li>  \t<li style=\"\">Character Styles (maybe some words need to be different within the mother style)</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Swatches (have them all in the same space for easy access)</li>  \t<li style=\"\">Set up the panels needed (workspace)</li>  \t<li style=\"\">How to create and use Tabs (extremely cool for lists)</li>  \t<li style=\"\">Make correct bleed on print documents (no failure allowed!)</li>  \t<li style=\"\">Make odd size documents</li>  \t<li style=\"\">Import text</li>  \t<li style=\"\">Insert images and how to scale, rotate and handle them</li>  \t<li style=\"\">Create a PDF for print</li>  \t<li style=\"\">Create a PDF for online distribution</li>  \t<li style=\"\">Ensure you images can be printed in perfect quality (preflight)</li>  \t<li style=\"\">Make easy design changes to you InDesign layout</li>  </ul>  <p style=\"\">  \t This course is based on the no frills concept. We do not waste time in minor settings we don&#039;t need to know for now. We focus on getting it done right.  </p>  <p style=\"\">  \t After this course you are able to produce flyers, business cards, small posters, hand-outs, product sheets and other. In other words: common marketing material for the busy professional or wannabee pro!  </p>", 
    "end_date": null, 
    "title": "Design while you learn InDesign CC", 
    "price": "20.00", 
    "instructors": "Benny Thaibert", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/185092_2b66_5.jpg", 
    "course_url": "https://www.udemy.com/design-while-you-learn-indesign-cc/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-19T09:28:27Z"
}