{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Brand new course - <strong class=\"redactor-inline-converted\">Launch April 2016!</strong></p>\n\n<p>Is making your own <strong class=\"redactor-inline-converted\">beautifully designed photo book</strong> a dream of yours? There is no better way to present your portfolio in a professional manner and archive your best work.<br></p>\n\n\n\n\n\n<p>But for most people that’s where the dream ends. They don’t know where to begin, how to edit their work, how to design and publish their photography portfolio.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course puts an end to the confusion and shares the proven, systematic way to take a <strong class=\"redactor-inline-converted\">photo book from an idea to an amazing coffee table album</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I’ve done it myself - <strong class=\"redactor-inline-converted\">I have designed and published over 30 books</strong>, many of them using the self publishing platform - Blurb for my clients and as my photography portfolio. You can do it too! We’ll walk through step-by-step what’s required to get your photo book published with Blurb, starting from the ground level and working towards our goal.</p>\n\n\n\n<p>I'm providing you with set of <strong class=\"redactor-inline-converted\">free, high quality materials</strong> to work with. You can start right away without any preparations! The supporting materials consist as well of <strong class=\"redactor-inline-converted\">7 free Photoshop Actions</strong> that may be useful when you start working on your own photos and would like to unify their look to have consistent material throught the whole photo book.</p>\n\n\n\n<p>Join me in this course and <strong>make your own unique book today!</strong></p>", 
    "end_date": null, 
    "title": "Design a unique bookstore-quality Photo Book with Blurb", 
    "price": "20.00", 
    "instructors": "Kasia Zmokla", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/826202_223a.jpg", 
    "course_url": "https://www.udemy.com/photo-book-blurb/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-19T15:10:49Z"
}