{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This is an introduction to not only \"Digital art\" but art in general. In this very in-depth course you will start from novice and or hobbyist and end with the mentality and skills of a professional. I cannot promise you work as no one can. But the skills you acquire here will enhance not only your own work but give you a solid base to in any other online course or book etc. There is no \"Quick fix\" or Short cuts to making great art. It requires work. It's fun work and I'm going to show you a method  that will make creating your own art or a clients work \"pain free\". </p><ul><li>You will learn solid techniques to make amazing art</li><li>You will be able to think like an artist and be a problem solver</li><li>This is for those that are serious about improving art</li><li>You will need some sort of drawing tablet (Wacom etc) or computer tablet (ex..Ipad , galaxy etc)</li><li>Keep and open mind and there is no time limit , work at your own pace.</li></ul><p><strong>Who this course is for :</strong></p><ul><li>Any beginner who wants to learn how to draw</li><li>Art students (traditional and non traditional and self taught)</li><li>Traditional artists who want to learn Digital </li><li>Graphic designers who want to learn to draw</li><li>Anyone who wants to make their own game, graphic novel or illustrations</li></ul><p><strong>What this course is NOT</strong></p><ul><li><strong></strong>Not a \"Speedpainting\" course</li><li>Not a series of \"Shortcuts\"</li><li>Not a \"Watch me draw\" type of course</li><li>Not a \"magic wand\" for drawing (You have to put in the work)</li><li>Not specific to any one piece of software (Any art software of your choice will do)</li></ul><p><strong>PLEASE BE AWARE:  </strong><strong>*There are no subtitles or closed captions for this course at this time.</strong></p><p>I hope you will join me and allow me to be your professional guide on your art journey. </p>", 
    "end_date": null, 
    "title": "Digital Art 101 : From Beginner to Pro", 
    "price": "25.00", 
    "instructors": "Rich Graysonn", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327666_82b2_2.jpg", 
    "course_url": "https://www.udemy.com/digital-art-101-from-beginner-to-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-26T18:16:56Z"
}