{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tDigital Painting for Cartoon Characters course!  </p>  <p>  \t    **Update**  </p>  <p>  \t<strong style=\"\">Course updated with 5 more lectures on 18/02/2015</strong>  </p>  <p>  \t<strong style=\"\">  Course updated with 8 more lectures on10/02/2015  </strong>  </p>  <p>  \t    As I am adding more lectures this month, I will be increasing the price of the course to <strong style=\"\">25$ on the 1st of March 2015</strong>. If you&#039;re on the fence about taking this course, then take a look at some of the preview videos. I have added one more of the lectures as a preview for you to judge if this is for you. Happy Drawing!  </p>  <p>  \t      In this course you will cover the very basics of digital painting, starting with how to navigate the interface of Adobe Photoshop, and moving along to more complex techniques.  </p>  <p>  \t      It is essential that if you want to get the best out of this course that you must have a copy of Photoshop, and a pen tablet for your mac/pc. You can find some affordable ones online with a quick search, and if you want to take your art seriously, you should definitely get one!  </p>  <p>  \t      The course starts pretty easy, and builds up fast to keep you entertained whilst also educated at the same time.  </p>  <p>  \t      what&#039;s included?  </p>  <ul style=\"\">  \t<li>Video demonstrations explaining as I paint</li>  \t<li>speed painting sections to show the full process without skipping any parts</li>  \t<li>Photoshop files so you can practice all of the steps in the lectures</li>  </ul>  <p>  \t      The course will keep growing as I will be adding more content as the days and weeks progress, and will try to cater some of the content to student feedback, so interaction is encouraged!  </p>", 
    "end_date": null, 
    "title": "Digital Painting for Cartoon Characters", 
    "price": "30.00", 
    "instructors": "Bader Badruddin", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413180_e33a_3.jpg", 
    "course_url": "https://www.udemy.com/digital-painting-for-cartoon-characters/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T14:31:56Z"
}