{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">  Does The Thought of Using Photoshop Make You Want to Cry?  </strong>  </p>  <p style=\"\">  \t<strong style=\"\">  Are You Tired of Hiring Outsourcers Every Time You Want Some Simple Graphic Created?  </strong>  </p>  <p style=\"\">  \t  Listen, I&#039;m not a technical person. I know just enough to get by... or get myself into trouble. But I need graphics a LOT!  </p>  <p style=\"\">  \t  These days, having good, eye-catching graphics for social media and other uses is CRITICAL. How else are people supposed to share your brand message if they don&#039;t have something to pass along to their own friends and family?  </p>  <p style=\"\">  \t  I&#039;m talking about things like quote graphics, sales graphics, infographics and more. What about your Facebook cover image? Do you change it at least once a month? It&#039;s valuable real estate to offer what you&#039;re selling, but if you never change it then your page will get stale.  </p>  <p style=\"\">  \t  What about book covers? Do you ever need to create one on the fly for a Kindle book or even a free report?  </p>  <p style=\"\">  \t  Need a snazzy looking opt-in form, but can&#039;t afford to hire a pricey designer to do it for you?  </p>  <p style=\"\">  \t  The great news is that YOU can do all of these things and more as we walk through the videos in this course together! I love using Picmonkey and Canva for almost all of my graphics needs. I will show you how you can do the same!  </p>  <p style=\"\">  \t  In less than an hour, you can be up and running, creating your own graphics on demand. Let&#039;s get started!  </p>", 
    "end_date": null, 
    "title": "DIY Beautiful Social Graphics That Don't Require Photoshop", 
    "price": "20.00", 
    "instructors": "Charity  Cason", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433084_9f6e.jpg", 
    "course_url": "https://www.udemy.com/diy-beautiful-social-graphics-that-dont-require-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T15:22:21Z"
}