{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  This Course is for the people who are new to the world of Photoshop. It&#039;s a set of easy steps which will guide you through the various (difficulty) levels of Photoshop.  </p>  <p>  \t  Before starting with the tutorials make sure that you have Photoshop installed on you PC or your Mac (Whatever the platform you prefer). You can download the trial version of Adobe Photoshop CC Adobe&#039;s Official Website. Just hit Google with &quot;Adobe Photoshop CC Trial&quot;. A 30-Day Trial Version of Photoshop comes absolutely free of Cost after that you need to pay the required charges.  </p>  <p>  \t  The course will let you to explore all the basic tools and functions involved in Photoshop. You will learn the basic concepts first which consists of all the elements of Photoshop Interface like Tool Box and Navigation, manipulating and managing layers and detailed description of work of each and every tool present in the Tool Box, then you will learn about editing images using the variety of functions and filters in Photoshop.  </p>  <p>  \t  As an additional treat for you, we have also added a lecture on creating web buttons using Photoshop for you.  </p>  <p>  \t  You can freely ask your questions regarding all your doubts and concerns in the discussions. We will try to resolve all of your problems as soon as possible.  </p>", 
    "end_date": null, 
    "title": "Easy Steps To Become A Photoshop Expert", 
    "price": "20.00", 
    "instructors": "MV Academy", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397946_afb1_4.jpg", 
    "course_url": "https://www.udemy.com/easy-steps-to-become-a-photoshop-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T11:53:56Z"
}