{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Editorial illustration is artwork created in response to written text, usually an article in a magazine, newspaper, or blog. In this course, we will focus on how to analyze a text, develop a unique idea, and communicate that concept visually as a partner to the article. Editorial illustration is an exciting field because it allows the illustrator to inject their own opinions and unique voice into the work. We&#039;ll focus on how to inject your own personality into your expressive illustration while still communicating your concept and illuminating the written word.</p>  <p style=\"\"><strong style=\"\"><br style=\"\">Transform Words into Illustrations</strong></p>  <ul style=\"\"><li style=\"\"><strong style=\"\">History + Inspiration:</strong> Learn about the history of editorial illustration and current trailblazers</li><li style=\"\"><strong style=\"\">Researching + Thinking: </strong>Learn about artistic style and visual references</li><li style=\"\"><strong style=\"\">Sketching:</strong> Learn how to overcome blank-page-phobia and start sketching</li><li style=\"\"><strong style=\"\">Drawing:</strong> Learn techniques for strengthening and finishing your drawing</li><li style=\"\"><strong style=\"\">Line, Value, and Color:</strong> Learn about color theory and linework tips</li><li style=\"\"><strong style=\"\">Digital Process:</strong> Learn about coloring an illustration in Photoshop</li><li style=\"\"><strong style=\"\">Textures + Hand-Drawn Type:</strong> Learn to create your own textures and drawn type</li></ul><p style=\"\"><strong style=\"\"><br style=\"\">Course Concepts and Overview</strong></p>  <p style=\"\">To show you all this, I&#039;m going to take you through my step by step process of creating an editorial illustration. You&#039;ll see my process from the original text article to researching, sketching, drawing, revisions, digital production, all the way to final illustration. I&#039;ll also show you many of my own personal Photoshop techniques for creating illustrations with bold colors and tantalizing textures. In addition, I will walk you through some illustration fundamentals that are often misunderstood including line, tone, value, and color, to help make your drawing as strong as possible.</p>  <p style=\"\">By the end of this course, you will have the skills to transform a boring text-only article into a professional editorial illustration that communicates your unique voice while illuminating the written word.</p>", 
    "end_date": null, 
    "title": "Editorial Illustration Tutorial: From Drawing to Photoshop", 
    "price": "20.00", 
    "instructors": "Christine Fleming", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/463354_00fe_7.jpg", 
    "course_url": "https://www.udemy.com/editorial-illustration-illuminating-the-written-word/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T20:47:50Z"
}