{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Design Beautiful iOS &amp; Android App Launcher Icons</strong>  </p>  <p style=\"\">  \t  Learn how to design effective app launcher icons for both iOS and Android. App launchers are the little icons that smartphone users click on to access an app. It&#039;s absolutely important that you understand how to design these icons effectively so that they&#039;re conceptually relevant, unique and stand out.  </p>  <p style=\"\">  \t  Follow along as expert designer &amp; course instructor Gary Simon takes you through two full app launcher design projects.  </p>  <p style=\"\">  \t  The first project is an iOS app launcher for a fictional GPS app. You will use Adobe Illustrator to complete this project.  </p>  <p style=\"\">  \t  In the second project, create a highly graphical Android app launcher for a fictional surveillance app. Adobe Photoshop will be used this time to create this project.  </p>  <p style=\"\">  \t  You will also learn how to impose the app launcher graphics onto phones, which is great for presenting the icons to clients or showcasing on your portfolio!  </p>  <p style=\"\">  \t<strong style=\"\">Who is this course for?</strong>  </p>  <p style=\"\">  \t  Anyone who wants to take on the challenge of designing app launchers for either iOS and Android.  Gary Simon teaches in such a way that a beginner can understand.  </p>  <p style=\"\">  \t<strong style=\"\">Why Photoshop and Illustrator?</strong>  </p>  <p style=\"\">  \t  You can use Photoshop or Illustrator to design app icons. Gary Simon has decided to include app launchers in both applications for those who might have access to only one application.  </p>", 
    "end_date": null, 
    "title": "Effective iOS & Android App Icon Design", 
    "price": "20.00", 
    "instructors": "Gary Simon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/294294_3edf_4.jpg", 
    "course_url": "https://www.udemy.com/effective-ios-android-app-icon-design/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-05T01:29:32Z"
}