{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>About the course:</strong></p><p>Masking is one of the most <strong>essential concepts in graphic design</strong> and it is the foundation to work non-destructively with layers. Although it is a simple concept it is difficult to understand. This course thoroughly explains everything you need to know about <strong>masking techniques in Adobe Photoshop, Illustrator and InDesign</strong>. Starting with the basic concept of masking you can learn lots of advanced creative techniques to&nbsp;<span>work more efficiently on your designs and artwork.</span></p><p><strong>The course includes:</strong></p><p></p><ol><li><span>17 instructional video tutorials</span></li><li>Quizzes about the techniques learnt in each section</li><li>Exercise files used in the course to help follow along and practice</li><li><span>Essential Skills for Designers &amp; Career Guide PDF</span></li><li><span>Design Terminology PDF</span></li><li><span>Useful Keyboard Shortcuts PDF</span></li><li><span>Collection of Useful websites for Designers PDF</span></li><li><span>Certificate of completion<br></span></li></ol><p></p><p><strong>How long will the course take to complete?</strong></p><p>This course will take <strong>only 2 hours to complete</strong>, but it will take some time to put all the techniques into practice.</p><p><strong>How the course is structured?</strong></p><p>The course is structured into <strong>17 videos</strong>, each explaining a specific masking technique or scenario. It is recommended to watch the videos in order of the outline but you can also choose to watch them individually. After each section you can take Quizzes to revise the crucial techniques and definitions learnt on the way.</p><p><strong>Why take this course?</strong></p><p>Easy. If you want to get a job as a designer either being employed or freelancing, you have to know how to do masking properly. This course will make you very confident about this essential skill for designers.&nbsp;This course is for you if you are planning to take your Photoshop, Illustrator and InDesign skills to the next level and want to become a Pro in no time.</p>  ", 
    "end_date": null, 
    "title": "Essential Skills for Designers - Masking", 
    "price": "20.00", 
    "instructors": "Martin Perhiniak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49553_15ee_5.jpg", 
    "course_url": "https://www.udemy.com/photoshop-masking/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-12T18:17:49Z"
}