{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>A step-by-step guide to building beautiful flat graphics for Photoshop users (Beginner to Advance)</strong></p><p>A Verifiable Certificate of Completion is presented to all students who undertake this course.<br></p><p><br></p><p>Recently updated for the 2016 Photoshop CC, <strong>\"Learn To Make Flat Graphics in Photoshop\" </strong>is probably one of the most complete and comprehensive online courses you will ever get to making popular and trend rising flat design graphics.<br></p><p>In more than 2 hours of content, this course will cover all you need to know about how to become a top skilled flat graphic designer, even if you never have used Photoshop before<strong>.</strong> In this course we will be covering the following subjects:</p><ul><li>Designing a flat graphic. What tools are popular and the general processing from start to client ready finish.</li><li>How to add gradient backgrounds that pop.</li><li>Developing beautiful flat shadows with or without fading.</li><li>Applying extra features, lighting and goodies to make your work stand out from the crowd.</li><li>+ Much more.</li></ul><p><strong><br></strong></p><p><strong>Note:</strong> This course is regularly updated and supported with student discussions.<br><strong></strong></p><p>Flat graphics are in huge demand by thousands of clients in the world. </p><p>Join in on the popular design trend which will be around for years to come and learn how to make them today.</p><p><br></p><p><strong>What does this course offer that others don't?</strong></p><p><strong>1) </strong>Real life examples:</p><p>We will provide you with real life examples of how to apply flat graphics to client projects.</p><p><strong>2)</strong> Portfolio exercises which you can use to get future jobs:</p><p>We will help you create your first flat graphic that you will be able to use as your own and present it to your clients as a professional freelancer.</p><p><strong>3)</strong> Downloadable reference material</p><p>A whole section dedicated on how to start your professional career either as a freelancer or a full-time employee with advice from top experts.</p><p><strong>4)</strong> Updated content for 2016:<br></p><p>All the content of this course has been recorded and updated for the 2016 design market.</p><p><strong>5)</strong> 24/7 support:</p><p>Ask questions and request new lessons. The instructor Aaron is always available to answer questions and provide feedback.</p><p><br></p>", 
    "end_date": null, 
    "title": "Flat Design - Create Beautiful Flat Graphics In Photoshop", 
    "price": "20.00", 
    "instructors": "Aaron Ward", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793000_e3b1.jpg", 
    "course_url": "https://www.udemy.com/flat-design-graphics-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T23:38:29Z"
}