{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Aren’t you tired of working 9-5, answering to your boss who doesn’t always get it right…\n\n  </p>\n\n<p>But most of all aren’t you tired of not getting paid for doing what you really love?\n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>Well if you are, <strong>you need a change.</strong></p>\n\n<p>This course gives you a chance to gain confidence in your skills and open your eyes to the possibilities of a graphic design freelance career.</p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>You’ll play a role of a graphic designer who will create a complete, real-life project.\n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>But you’ll also find answers to the most common questions that fresh graphic design freelancers have.\n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>So if you want to learn\n\n  </p>\n\n\n\n<ul><li>What is the best way to start as a freelance graphic designer?</li><li>How to get clients?</li><li>And how to avoid the most common mistakes fresh freelancers make?</li></ul>\n\n\n\n\n\n\n\n<p>You will find the answers inside.\n\n  </p>\n\n\n\n<p>Let me take you step-by-step through the whole process of creating a complete graphic design project:\n\n  </p>\n\n\n\n<p>We will start with a client brief: you will learn what it is, what it should contain and how to set one up yourself using Ms Word.</p>\n\n<p>And then, based on th client brief we'll design:</p>\n\n<ul><li>Fantastic logo and business cards that compliment it</li><li>Clean and professional website – you will  learn how to design it for responsive web design as well</li><li>Modern flyer – this skill is particularly useful when working for local clients</li><li>Facebook cover photo (and you’ll be amazed how simple it is to set your own template that is always accurate)</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will give you everything you need if you are looking for professional and easy to follow Illustrator and Photoshop skills that will jump start your graphic design freelance career. \n\n  </p>\n\n\n\n<p>It’s a series of standalone projects: you don’t have to sit all day and watch everything: you can jump to what’s your interest for the day and don’t feel guilty that you didn’t watch the rest.\n\n  </p>\n\n\n\n<p>If you are taking this course, you should have some basic understanding of how to work with Illustrator and Photoshop.\n\n  </p>\n\n\n\n<p>And if you are an experienced freelancer, this course is not for you.\n\n  </p>\n\n\n\n<p>Don’t forget that, as always, you are totally covered by a <br><strong>30-day, 100% Money Back Guarantee, No Questions Asked.</strong></p>\n\n\n\n<p>So you risk nothing.\n\n  </p>\n\n\n\n<p>It’s your decision.\n\n  </p>\n\n\n\n<p>Click that enroll button and take your first step to having a career you always dreamed about.  \n\n  </p>\n\n\n\n<p>See you inside!</p>", 
    "end_date": null, 
    "title": "Freelancing A-Z: How To Start A Successful Freelance Career", 
    "price": "20.00", 
    "instructors": "Adobe Certified Expert Dawid Tuminski", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854746_4ed2_2.jpg", 
    "course_url": "https://www.udemy.com/freelance-freelancer-freelancing-freelance-web-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T06:23:26Z"
}