{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn Photoshop CC, the most up to date version Photoshop offers. </p><p>You've seen all the amazing effects and results that are possible in Photoshop, but with such a daunting, in-depth piece of software, where do you even get started? With award-winning trainer Geoff Blake at your side, you'll master Photoshop's fundamentals in no time. </p><p><strong>About the Course</strong></p><p>Geoff's casual, step-by-step approach makes it easy to understand otherwise complex topics and tough tasks. You'll learn how to navigate through your images within the Photoshop environment, resize and crop images like a pro, and how to make pixel-perfect selections using a variety of techniques. </p><p>Geoff will then introduce you to layers, including how to combine images together, apply effects like blending modes and opacity, and show you how to keep your projects organized. </p><p>Then it's on to retouching images and working with Photoshop's powerful colour correction tools, where you'll learn methods for making your images look their best. </p><p>Finally, you'll be introduced to various special effects and how to work on your images non-destructively. All this and more awaits in Getting Started With Photoshop CC!</p><p><strong>Who Should Take This Course?</strong></p><p>Absolutely anyone. Whether you've used previous versions of Photoshop or have never opened a new document before, you'll be treated to training that will make you a Photoshop CC expert in as little time as possible. </p>", 
    "end_date": null, 
    "title": "Getting Started With Photoshop CC", 
    "price": "25.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532140_2a41_2.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-photoshop-cc2/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T13:10:52Z"
}