{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t   Are you an entrepreneur who wants to get professional graphics made, but you don&#039;t want to (or can&#039;t afford to) pay someone to do it? I was in your shoes once and trained myself to make professional, top-quality graphics for my projects.  This course teaches you what I have learned so you can do the same!  </p>  <p>  \t  You don&#039;t  need to hire a graphics guy! Or learn Photoshop! We are going to be using simple and fun, but incredibly powerful software to make fantastic graphics and very fast. I take you through step by step through some very useful projects for an entrepreneur.  Like making &quot;buy now&quot; and &quot;submit&quot; buttons, making a header graphic for your website, and other relevant items that entrepreneurs ACTUALLY need in their projects.  We won&#039;t be drawing deer, or mugs, trees or other useless, &quot;artsy&quot; things, lol.</p>\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t It&#039;s time to take control of your projects and fill them with graphics that come from your own mind.  Trust me, you do not need to have ANY graphics experience to take this course and you WILL learn how you can make professional looking graphics for yourself. Let&#039;s do it!  &lt;/p&gt;    <p>  \t  Looking forward to seeing you on the course.  I&#039;ll be here every step of the way.  So stop worrying!  </p>", 
    "end_date": null, 
    "title": "Graphic Design for Entrepreneurs...Who Can't Draw", 
    "price": "20.00", 
    "instructors": "Steve Cherubino", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/77532_417d_7.jpg", 
    "course_url": "https://www.udemy.com/graphic-design-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-12T15:42:05Z"
}