{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><span style=\"\">Learn graphic design skills so you can create amazing </span><strong style=\"\">marketing graphics</strong><span style=\"\"> for free using a fully-featured online graphic design program called </span><strong style=\"\">Canva</strong><span style=\"\">. This beginner's course will give you the </span><strong style=\"\">tools</strong><span style=\"\"> and </span><strong style=\"\">understanding</strong><span style=\"\"> to design your own promotional graphics that attract customers. I have been doing graphic design for 8+ years and can't wait to show you this </span><strong style=\"\">amazing</strong><span style=\"\"> free tool.</span><br></p><p><strong>Create Gorgeous Marketing Designs For Free That Engage And Attract Customers</strong></p><ul><li>Use Canva's Tools &amp; Features with Total Confidence</li><li>Design 9 Images for Various Marketing Platforms</li><li>Create Any Marketing Graphic You Can Imagine</li></ul><p><strong>Valuable Skills That Can Save and Make You Money</strong></p><p>After learning the skills in this course, you will never again hire a graphic designer to create your marketing images. Save your money for more worthwhile purposes! The methods you will learn are structured so that you can follow along with the lectures and design alongside me, your instructor!</p><p>Canva has so much potential and makes creating incredible images so easy. In the multimedia-filled sea we all swim in, I will teach you the skills you need to stay afloat.</p><p><strong>Content and Overview</strong></p><p>Intended for beginners, this course will empower you to design wonderful promotional marketing images for Facebook, Instagram,YouTube, and more. You will also learn how to design printed posters and online banner ads as well. Check out the curriculum below for more information on what is offered in this course.</p><p>The lectures within this course are recorded in an \"over-the-shoulder\" format where you will watch my screen as I demonstrate the use of Canva tools and create example designs. Research shows that it is most-beneficial for learners to see new skills modeled by their instructor. You can follow along this way and end up with your own promotional materials at the end.</p><p><strong>Start designing with Canva right now! See you in class!</strong></p>", 
    "end_date": null, 
    "title": "Graphic Design: Double Your Sales With Canva", 
    "price": "20.00", 
    "instructors": "Caleb Stultz", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/663702_8cb0_11.jpg", 
    "course_url": "https://www.udemy.com/canva-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-08T10:20:44Z"
}