{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<span>Erudeversity demonstrates all the basic concepts of the latest version of Photoshop, Photoshop CC in this course to make you an expert in graphic design and Photoshop. Also, we share some common practices in mastering Photoshop CC. This course describes all basic concepts including Photoshop Introduction, navigation and settings, re-sizing and cropping, layers, selections, and techniques of removing a person from a background. Some of us know how to play with colors and images but professional touches are required to be able to do quality work. This course not only demonstrates working with quality images but also shows how to put professional touches with the help of the latest graphic tool from Adobe. It is necessary to understand the right color combinations and Photoshop tool needs to be handled properly in order to maser graphic design. This course shows you exactly how to play with selections and layers as well. Resizing and cropping are few other techniques that need to be handled carefully. Nowadays, Photoshop has become essential for any types of design work. It has not been easy to find quality training in Photoshop CC and the graphic design work is becoming more competitive everyday. We have designed this course to create more Photoshop experts and provide you with the latest Photoshop training. You can take this opportunity to start here and go to the next level of graphic design. Also, this can be your first step towards the way of mastering Photoshop. If you always wanted to learn the latest Adobe Photoshop tool and gain competitive advantage in graphic design industry, then this is the right course for you. Adobe Photoshop CC comes with great new features and don&#039;t miss out to make use of this latest tool. Let&#039;s get started to get hands-on experience on Photoshop CC.</span>  </p>", 
    "end_date": null, 
    "title": "Graphic Design Fundamentals with Photoshop CC 2014", 
    "price": 0, 
    "instructors": "Erudeversity Video Library", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371736_18e0.jpg", 
    "course_url": "https://www.udemy.com/graphic-design-fundamentals-with-photoshop-cc-2014/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T04:06:51Z"
}