{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  Hi there!  </p>  <p style=\"\">  \t  My name is Frank, from Ideaquirk!  </p>  <p style=\"\">  \t  I would like to tell you something about my experience as a <strong style=\"\">graphic designer</strong>. My passion for this job started when I was still a child. I just loved to draw, sketch and communicate my ideas this way, so as soon as I had my first computer I started studying really hard the most famous <strong style=\"\">design softwares</strong>. After few years, despite the fact that I was mastering these tools, I could see that my works were <strong style=\"\">always missing something</strong> and I so I was getting <strong style=\"\">frustrated</strong>: how comes that, even though I am studying so hard, I&#039;m not improving the quality of my works? The answer was that <strong style=\"\">I forgot about something really important</strong>! The <strong style=\"\">basic rules of graphic design</strong>!  </p>  <p style=\"\">  \t  Design, first of all, is all about <strong style=\"\">communication</strong> and <strong style=\"\">psychology</strong>! Fortunately for designers, there are solid <strong style=\"\">rules</strong> that you can learn and afterwards, use them in order to communicate your idea in a more effective way! Of course, you have to study them!  </p>  <p style=\"\">  \t  So, how comes that many designers still avoid to acknowledge them? Simply because getting your hands on the paper (or on the keyboard) is <strong style=\"\">much more fun</strong>! however, this without a basic idea will turn into frustration very much soon! It can be avoided. With this I can help you.  </p>  <p style=\"\">  \t  I produced this <strong style=\"\">quick course</strong> for people who can&#039;t wait to start producing their own artworks. I <strong style=\"\">summarized</strong> all <strong style=\"\">the most important concepts</strong> of design in a <strong style=\"\">40 minutes</strong>. I couldn&#039;t be more concise!  </p>  <p style=\"\">  \t  Learning these basic concepts, will help you to have better results in your works <strong style=\"\">immediately</strong>. They will also be a solid base for your further studies!  </p>  <p style=\"\">  \t  If you are like me, and you like to learn while having <strong style=\"\">fun</strong>, this course is just made for you!  </p>  <p style=\"\">  \t  Frank  </p>", 
    "end_date": null, 
    "title": "Graphic design - The Quick Guide", 
    "price": "30.00", 
    "instructors": "Frank Ideaquirk", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286508_42a0_2.jpg", 
    "course_url": "https://www.udemy.com/graphic-design-the-quick-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-23T14:07:45Z"
}