{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<span>Erudeversity demonstrates all the basic concepts of the latest version of Photoshop, Photoshop CC in this course to make you an expert in graphic design and Photoshop. Also, we share some common practices in mastering Photoshop CC. This course describes all basic concepts including Photoshop Introduction, navigation and settings, re-sizing and cropping, layers, selections, and techniques of removing a person from a background. Some of us know how to play with colors and images but professional touches are required to be able to do quality work. This course not only demonstrates working with quality images but also shows how to put professional touches with the help of the latest graphic tool from Adobe. It is necessary to understand the right color combinations and Photoshop tool needs to be handled properly in order to maser graphic design. This course shows you exactly how to play with selections and layers as well. Resizing and cropping are few other techniques that need to be handled carefully. Nowadays, Photoshop has become essential for any types of design work. It has not been easy to find quality training in Photoshop CC and the graphic design work is becoming more competitive everyday. We have designed this course to create more Photoshop experts and provide you with the latest Photoshop training. You can take this opportunity to start here and go to the next level of graphic design. Also, this can be your first step towards the way of mastering Photoshop. If you always wanted to learn the latest Adobe Photoshop tool and gain competitive advantage in graphic design industry, then this is the right course for you. Adobe Photoshop CC comes with great new features and don&#039;t miss out to make use of this latest tool. Let&#039;s get started to get hands-on experience on Photoshop CC.</span>  </p>  <p>  \t<span><br style=\"\">  \t</span>  </p>  <p>  \tErudeversity आप ग्राफिक डिजाइन और फ़ोटोशॉप में एक विशेषज्ञ बनाने के लिए इस पाठ्यक्रम में फ़ोटोशॉप फ़ोटोशॉप सीसी का नवीनतम संस्करण के सभी बुनियादी अवधारणाओं को दर्शाता है। इसके अलावा, हम फ़ोटोशॉप सीसी माहिर में कुछ आम प्रथाओं का हिस्सा है। इस कोर्स फ़ोटोशॉप परिचय, नेविगेशन और सेटिंग्स, फिर से नौकरशाही का आकार घटाने और फसल, परतों, चयन, और एक पृष्ठभूमि से एक व्यक्ति को हटाने की तकनीक सहित सभी बुनियादी अवधारणाओं का वर्णन है। हम में से कुछ की गुणवत्ता काम करने के लिए सक्षम होने के लिए आवश्यक हैं रंग और छवियों लेकिन पेशेवर स्पर्श के साथ खेलने के लिए कैसे पता है। इस कोर्स न केवल गुणवत्ता छवियों के साथ काम करने को दर्शाता है, लेकिन यह भी एडोब से नवीनतम ग्राफिक उपकरण की मदद से पेशेवर छू डाल करने के लिए कैसे पता चलता है। यह सही रंग संयोजन को समझने के लिए आवश्यक है और फ़ोटोशॉप उपकरण ग्राफिक डिजाइन मेसर के क्रम में ठीक से संभाला जाना चाहिए। इस कोर्स के रूप में अच्छी तरह से चयन और परतों के साथ खेलने के लिए वास्तव में आप कैसे पता चलता है। आकार और फसल ध्यान से संभाला जा करने की जरूरत है कि कुछ अन्य तकनीकों हैं। आजकल, फ़ोटोशॉप डिजाइन काम के किसी भी प्रकार के लिए आवश्यक हो गया है। यह फ़ोटोशॉप सीसी और ग्राफिक डिजाइन का काम और अधिक प्रतिस्पर्धी हर रोज होता जा रहा है में गुणवत्ता प्रशिक्षण खोजने के लिए आसान नहीं रहा है। हम और अधिक फ़ोटोशॉप विशेषज्ञों बना सकते हैं और नवीनतम फ़ोटोशॉप प्रशिक्षण के साथ आप प्रदान करने के लिए इस पाठ्यक्रम तैयार किया है। आप यहाँ शुरू करने और ग्राफिक डिजाइन के अगले स्तर तक जाने के लिए इस अवसर पर ले सकते हैं। इसके अलावा, इस फ़ोटोशॉप माहिर का रास्ता की ओर अपना पहला कदम हो सकता है। आप हमेशा नवीनतम एडोब फोटोशॉप उपकरण जानने के लिए और ग्राफिक डिजाइन उद्योग में प्रतिस्पर्धी लाभ हासिल करना चाहता था, तो यह आपके लिए सही कोर्स है। एडोब फोटोशॉप सीसी महान नई सुविधाओं के साथ आता है और इस नवीनतम उपकरण का उपयोग करने के लिए बाहर याद नहीं है। के फ़ोटोशॉप सीसी पर हाथ अनुभव पर प्राप्त करने के लिए शुरू हो जाओ।  </p>", 
    "end_date": null, 
    "title": "Graphic Design Fundamentals with Photoshop CC 2014- हिंदी ", 
    "price": 0, 
    "instructors": "Erudeversity Video Library", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378776_538b.jpg", 
    "course_url": "https://www.udemy.com/graphic-design-fundamentals-with-photoshop-cc-20142/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T22:04:12Z"
}