{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<span>Erudeversity demuestra todos los conceptos básicos de la última versión del CC Photoshop, Photoshop en este curso para hacerte un experto en diseño gráfico y Photoshop. Además, compartimos algunas prácticas comunes en el dominio de CC Photoshop. Este curso describe los conceptos básicos, incluyendo Photoshop Introducción, navegación y configuración, redimensionamiento y recorte, capas, selecciones, y las técnicas de extracción de una persona de un fondo. Algunos de nosotros sabemos cómo jugar con los colores y las imágenes, pero toques profesionales están obligados a ser capaz de hacer un trabajo de calidad. Este curso no sólo demuestra el trabajo con imágenes de calidad, pero también muestra cómo poner toques profesionales con la ayuda de la última herramienta gráfica de Adobe. Es necesario entender las combinaciones correctas y herramienta de Photoshop necesita ser manejado adecuadamente con el fin de maser diseño gráfico. Este curso le muestra exactamente cómo jugar con las selecciones y capas también. El cambio de tamaño y recorte son algunas otras técnicas que deben ser manejados con cuidado. Hoy en día, Photoshop se ha convertido en esencial para cualquier tipo de trabajo de diseño. No ha sido fácil encontrar una formación de calidad en CC Photoshop y el trabajo de diseño gráfico se está convirtiendo cada día más competitivo. Hemos diseñado este curso para crear más expertos de Photoshop y le proporcionará la última formación Photoshop. Usted puede aprovechar esta oportunidad para empezar aquí e ir al siguiente nivel de diseño gráfico. Además, este puede ser su primer paso hacia el camino de dominar Photoshop. Si usted siempre quiso aprender la última herramienta de Adobe Photoshop y obtener una ventaja competitiva en la industria del diseño gráfico, entonces este es el curso adecuado para ti. Adobe Photoshop CC viene con nuevas características y no te pierdas de hacer uso de esta nueva herramienta. Vamos a empezar a obtener experiencia práctica en CC Photoshop.</span>  </p>", 
    "end_date": null, 
    "title": "Graphic Design Fundamentals with Photoshop CC 2014-español", 
    "price": 0, 
    "instructors": "Erudeversity Video Library", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378766_e190.jpg", 
    "course_url": "https://www.udemy.com/graphic-design-fundamentals-with-photoshop-cc-2014-espanol/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T21:28:44Z"
}