{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Graphic Design in modern standards is constantly changing and growing to new styles and aesthetic appearance. Today, businesses use graphic designers to develop marketing strategies, online business conversions and demographic-based advertisements.</p><p>In this graphic design course, I offer my knowledge on designing in photoshop using one of today's most modern design - <em>flat design</em>.</p><p>Are you ready to take your skills to the next level? Do you want to learn the basics to graphic design? Than take this course! I am confident that what I have to offer will set you on the path to success.</p><p>...And if you don't believe me, check out the 30+ reviews who back me up!</p><p><em><strong>This Course Includes:</strong></em></p><ul><li>Tutorial on how to Install a Trial of Photoshop</li><li>Quick Start Guide to using Photoshop and tools required for Graphic Design</li><li>Layer Organization and Management</li><li>How to Design a Symbol for a Logo</li><li>Emblem Logo Tutorial</li></ul><p><strong><em>REMEMBER</em></strong><em>: All students enrolled in this course will receive discounted coupons to Photoshop courses I release on Udemy in the future <strong>INCLUDING: Mastering Logo Design in Photoshop (COMING 2016)<br><br></strong></em></p><p><strong><em>What are the requirements?</em></strong></p><ul><li>No graphic design experience is required</li><li>You need Photoshop Installed (refer to Trial of Photoshop)</li><li>Notebook and Pen can help for notes</li></ul><p><strong><em>What am I going to get from this course?</em></strong></p><ul><li>Over 15 lectures on modern Graphic Design fundamentals</li><li>Learn Photoshop fundamentals, tools, and techniques</li><li>Unlimited lifetime access to this course</li><li>Discount opportunities for future courses I release</li></ul><p><strong><em>What is the target audience?</em></strong></p><ul><li>Anyone wanting to learn Graphic Design</li></ul>", 
    "end_date": null, 
    "title": "Graphic Design: Beginner's Graphic Design Guide to Photoshop", 
    "price": "20.00", 
    "instructors": "Nicolas Moy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449788_1d45_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-adobe-photoshop-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T20:59:40Z"
}