{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This is a Life Hack and you can only live once!!  Make the most of your time. We are pumped to get this course out to you! This course will teach you how to create a professional magazine AD.</p><p>Four Advertisements in a Day is the best way to create awesome, compelling advertisements using Adobe Illustrator. Our professional designer, Lauren, will instruct you on the Adobe Illustrator software. He will walk you through creating 4, unique, full-page advertisements.</p>  <p>  \t    1. Does your website work for you  </p>  <p>  \t    2. More Traffic More Leads More Sales  </p>  <p>  \t    3. Generating Business Online  </p>  <p>  \t    4. Relax, We have you covered  </p>  <p>  \t    This is one of those rare looks inside an ad agency too see how they will create a professional design.  </p>  <p>  \t    Using four different Headlines and four completely different designs, you will see the concepts that materialize as you watch the process unfold before you.  </p>  <p>  \t    This lecture series is very straight forward, if you are looking to take your design career up a notch and start producing printed material that will be delivered into your community you'll want to watch this video.  </p>  <p>  \t    Great value and great content, Creating 4 professional Advertisements in one day is a rare skill and this will save you so much time and your hourly rate will go through the roof.  Literally blow the shingles off the roof and expand your horizons.  </p>  <p>  \t    We are thrilled to offer you this amazing look into the process of a 10 year designer!  </p>  <p>  \t    Look for Advertisements, Adobe Illustrator, Social Media, Logo Design, Adobe Reader and Adobe Photoshop.  </p>  <p>  \t    Sit back and relax:  We have you covered!  </p>", 
    "end_date": null, 
    "title": "Graphic design: Designing 4 Advertisements in a series!", 
    "price": 0, 
    "instructors": "Andrew Boehm", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/270458_8b9d_5.jpg", 
    "course_url": "https://www.udemy.com/fundamentals-of-an-advertisement/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-28T19:19:32Z"
}