{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Novice and professional designers run into the same issues when it comes to creating products that will translate properly from their computers, to massive billboards and tiny devices.</p><p>How to Solve it: Establishing the right workflow will help you avoid common problems and ensure that every element in every design makes sense and looks great.</p><p>This course isn&#039;t a design course; rather, it&#039;s for those who already have layout skills but wish to establish an efficient, professional workflow.</p><p><strong style=\"\">Establish a Professional Workflow and Nail Every Design Project</strong></p><ul style=\"\"><li>Learn Responsive Design Techniques for the Web</li><li>Establish a Basic Professional Workflow for Print and Web Projects</li><li>Organize and Manage Files for Creative Page Layouts</li></ul><p><strong style=\"\">Make Every One of Your Designs Shine in Print and on the Web</strong></p><p>This is a course designed to teach you what you need to know in a short amount of time so you can begin working like a professional graphic designer, regardless of your experience level.</p><p>You&#039;ll go through a bootcamp style series of lectures and design exercises that will teach you how to achieve a professional workflow. You&#039;ll also learn how to prepare your work so it makes sense when you see it in print or on the web.</p><p>There aren&#039;t any specific requirements in terms of what software to use when creating layouts, so you can choose whatever program you prefer and still get the most out of this course.</p><p><strong style=\"\">Contents and Overview</strong></p><p>After a brief introduction, this course begins with the preparation necessary to create files that you can work with throughout the creative process. </p><p>Learn techniques that will help you avoid common problems related to device viewport and printing.</p><p>Next, you&#039;ll put the theories you just learned into practice. You&#039;ll work on creating a promotional postcard and poster before moving on to a responsive website design for desktop and mobile devices.</p><p>By the end of this course, you&#039;ll know how to efficiently work like a graphic design and layout pro. You&#039;ll be able to effectively manage and organize all of your files and assets so you can let your creativity and talent truly shine while getting more gigs. </p><p>    <br style=\"\">Whether you&#039;re a designer, art director, or creative director, the tips in this course will give you the skills you need to go from art enthusiast to graphic design pro.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Graphic Design Bootcamp: Professional Workflow & Layout Tips", 
    "price": "20.00", 
    "instructors": "Shawn Barry", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456988_e8ad.jpg", 
    "course_url": "https://www.udemy.com/graphic-design-bootcamp-layout-and-workflow-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T19:02:13Z"
}