{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Learn and apply graphic design principles, color, and typography for better designs! </strong>Are you frustrated with the quality of your graphic designs, or wonder how graphic designers create effective content? Or do you simply want to learn more about graphic design or get started as a graphic designer?</p><p>In this course, you will learn and then apply design principles to create various graphic designs, including an online advertisement, an effective infographic, a gig poster with type as a design element, and an illustrative postcard design. You will learn how color schemes can be created and applied in graphic designs. You will also learn how effective typography can improve your designs as well.</p><p>You will use the industry-standard software for photo and raster editing (Photoshop), illustration and vector art (Illustrator), and publication design (InDesign) in this course to apply what you learn.</p><p><strong>Course Structure</strong><br></p><p>In the first few sections, you will learn about the overarching benefits of this course and then learn about various design principles such as proximity, alignment, repetition, contrast, balance, negative space, and rhythm. You will apply these design principles right away so you more effectively learn them. This will also allow you to learn design techniques. </p><p>In the color section, you will learn about effective color and then how to create color schemes in Photoshop, InDesign, and Illustrator. You will create a color wheel using Illustrator.</p><p>In the typography section, you will learn type terminology in order to know how to apply effective type. You will also learn best practices in editing and applying type.</p><p>All support files are included for the follow-along exercises and projects on design principles, color, typography, and projects. Bonus files are also included, such as photo and Photoshop brushes.</p><p><strong>Instructor Qualifications</strong></p><p>I've worked in graphic design at newspapers, magazines, and an award-winning advertising design firm. I've been managing editor of two graphic design magazines and a freelance graphic designer. For the past eight years, I've also taught graphic design at the university level.</p><p><strong>Let's get started learning and creating!</strong></p><p>This course will enable you to be come a better graphic designer, whether you're new to graphic design or simply want to improve. I'll see you in the course!</p>", 
    "end_date": null, 
    "title": "Graphic Design Hero: Apply Graphic Design in Projects", 
    "price": "20.00", 
    "instructors": "Dr. Chad Neuman", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396204_c12c_3.jpg", 
    "course_url": "https://www.udemy.com/graphic-design/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-17T00:54:29Z"
}