{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<span><strong style=\"\">You don&#039;t need a $3000 camera or a $1500 lens to take professional quality photos.</strong> If you already have<strong style=\"\"> Photoshop</strong>, you can improve your photos dramatically by learning how to properly color correct and color grade. you can take your photos to an whole new level if you can master the art of what we call photomanipulation, compositing and retouching.<strong style=\"\"> By mastering those techniques, you will be able to turn your photos into digital art! </strong>All source images for the tutorials are supplied to you so you&#039;ll be able to do exactly what I did. The tutorials were all done using Photoshop CS5. You can get a lot done with CS3/CS4 also.</span>  </p>  <p>  \t<span></span><span>If you are a motivated artist that wants to improve and you realize that to fully unleash your talent, you need the technical knowledge you might be missing to fully express it.</span>  </p>  <p>  \tLearning all the ways you can edit your photos and images is like someone that finally learns the proper drawing techniques. Before, the person was making interesting doodles, now he/she&#039;s creating works of art. The talent was there but it was not fully utilized. And it&#039;s the same thing with digital art and photo editing, once you learn the proper methods, you then unleash the creativity in you that couldn&#039;t fully be expressed before.  </p>  <p>  \tWhat you&#039;ll learn on this course is just the start, a glimpse of what&#039;s possible for you to achieve.<strong style=\"\"> By joining this course  and practicing what I&#039;ll teach you, I firmly believe that you too can become a photo/image editing expert!</strong> You may doubt your potential at first but I guarantee you that after surprising yourself a few times with better than expected results, your confidence will grow and you will be believing in your true potential!  </p>", 
    "end_date": null, 
    "title": "How to create an illustration of a photo using Photoshop", 
    "price": "50.00", 
    "instructors": "Pavel Kireev", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431266_9628_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-an-illustration-of-a-photo-using-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T19:14:16Z"
}