{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<span>Creating logos isn&#039;t easy, especially when working with particular clients. And with so many designers out there, differentiating yourself can be difficult.</span>  </p>  <p>  \tKnowing how to effectively map out your ideas will be the foundation on which you can craft extraordinary logos and bring something fresh to the table that clients can&#039;t refuse. This is how you make clients happy, draw attention to your work, build your client base, and potentially earn more money.  </p>  <p>  \t<strong>Learn How to Design an Eye-Catching and Effective Logo Every Time.</strong>  </p>  <ul>  \t<li>Generating and Sketching Design Ideas Quickly</li>  \t<li>Fonts and Text Positioning</li>  \t<li>Color and Format Options</li>  \t<li>Using Adobe Illustrator for Creation of Logos</li>  \t<li>Submitting Design Ideas and Working with Clients</li>  </ul>  <p>  \t<strong>Make Every Client Happy by Designing a Great Logo</strong>  </p>  <p>  \tThe most difficult part of working as a designer is being able to generate a logo that a client will be happy with. The key is knowing how to understand a client&#039;s expectations, and using the right tools to draft ideas quickly. As a designer, you should also know how to properly position text, and how to choose the right colors and fonts that will represent a business in the best and most accurate way.  </p>  <p>  \t<strong>Contents and Overview</strong>  </p>  <p>  \tThis course, containing over 42 lectures and 2.5 hours of content, provides step-by-step instructions on logo design. No logo design experience is required; however, you should have a full or free trial version of Adobe Illustrator, even though you don&#039;t need prior knowledge working in this program.  </p>  <p>  \tYou&#039;ll receive a 61-page eBook on how to design logos, as well as information on how to receive a logo design brief from a client. Then you&#039;ll learn how to collect reference materials and imagery to sketch out ideas.  </p>  <p>  \t<br>  \tUpon completion of this course, you&#039;ll understand mind mapping and mood boards, which help you brainstorm logos. You&#039;ll know how to create unique symbols, add elements to a word, use geometric shapes and initials, and position text properly.  </p>  <p>  \t<span>Students will nail the basics of Illustrator, know where to find free fonts, and create logos in color, black and white, and in different formats. You&#039;ll also receive tips on sending ideas to clients, making changes and finalizing a logo, and pricing your work. All of these skills will make you a more valuable designer or allow you to use your creativity to make your own logos.</span><span> </span>  </p>", 
    "end_date": null, 
    "title": "How to Design a Logo - a Beginners Course", 
    "price": "20.00", 
    "instructors": "Tara Roskell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20461_7e8e_22.jpg", 
    "course_url": "https://www.udemy.com/how-to-design-a-logo-a-beginners-course/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-01T09:31:19Z"
}