{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In the last years I launched several books and ebooks. I use to pay a professional graphic designer to create the cover since I know <strong>the cover and the title usually make 70%</strong> of the factors that influence the sales.</p><p>Maybe it doesn't sound nice, but <strong>people use to judge - and buy - books and ebooks by the cover</strong>. When they check the books on Amazon, on Ibook Store or on Google Play they choose the books they buy by judging on 3 main items:</p><ol><li>the <strong>cover </strong>of the ebook</li><li>the <strong>title</strong></li><li>the <strong>reputation </strong>of the author</li></ol><p>My name is Florin Rosoga, I launched several books and ebooks for myself (or my clients) in the last years.</p><p>One of the most important elements that influence books sales are the covers you use. Especially in the online world - where everything is visual - a catching cover will get more attention and usually boost sales.</p><p>Let's be honest: when somebody buys a book, he doesn't know the content, he cannot know what's inside. <strong>They assume it is a good one </strong>and they want to have it. <br></p><p>And they assume this, once again, by the 3 factors above - tile, cover and author's reputation.</p><p>Since becoming a bestseller can be defined by the cover, the title and the reputation of the author (it takes years to build the reputation),<strong> if you are not a popular writer you can start working now on having a professional cover</strong> and the title (asumming you know the topic of your book).<br></p><p>This is why when I launch a new book or ebook I pay a professional graphic designer. Which cost a lot. </p><p>Probably you saw on Amazon many Kindle <strong>ebook covers that look professional</strong> and thought <strong>how great they look</strong>. </p><p>And they also seem so clear, so eye catching. Just check the best sellers section and see the covers...<br></p><p>If you are like most authors you said yourself \"<em>They</em><em> look awesome, but I don't know graphic design and paying a graphic designer would cost a fortune...</em>\"</p><p>And I confirm you it usually costs a small fortune...</p><p>But it's not true you cannot do it by yourself.</p><p>This course is a beginner course on how to create professional looking ebooks and Kindle covers for your own or your clients books, by using Canva's free tool. It is intended for authors or people who want publish an ebook on Amazon Kindle, Google Play or iBookStore  and position themselfes as authority (you know, most people still think ...\"<em>that guy is a writer, he is very good in his area</em>..\")</p><p>You don't need any graphic design experience, just start from zero and create amazing eye catching ebooks covers that look awesome.<br></p><p>You will learn</p><ul><li>how to use Canva,</li><li>how to work with the design dashboard,</li><li>how to add images, icons, illustrations, graphic symbols... for free,</li><li>how to format the title, subtitle, author name so that it looks professional,</li><li>how to choose from hundreds of covers templates, most of them free</li><li>how to export your covers from Canva to a format that can be used on the online stores</li><li>how to deal with the copyright issues: you will probably use the cover ina a commercial way and this changes some things. You don't want future legal troubles and you should pay attention to this small detail.</li></ul><p>By taking it, you will be able to understand and master the art of creating high quality ebook and Kindle covers images in the step by step demonstrations. </p><p>In your own pace.</p><p>In this course you will get step by step video explanations to help you understand in a comfortable way all about creating ebook covers in minutes, for free and without any previous graphic experience.<br></p><p>The entire course can be downloaded as a video training to watch or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next... click the Take this Course button top right and you'll be taken to our secure payment page.</p><p>Just <em><u>Enter Your Regular Details</u></em> and complete your investment to have immediate access.<br></p><p>Stop struggling with boring Kindle &amp; ebook covers that people don't pay attention and start design professional loking ones in minutes... just like a pro!</p><p><strong>Thank you for reading this and learning about my course</strong> ... I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE </strong>to get started!<span></span><br></p>", 
    "end_date": null, 
    "title": "How to Create Kindle & Ebook Covers with Canva", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642656_dba7_5.jpg", 
    "course_url": "https://www.udemy.com/professional-kindle-ebooks-covers-canva-amazon-ibook-store-covers/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T17:59:14Z"
}