{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">***UPDATED FOR iOS7***</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Create professional looking app icons in minutes WITHOUT hiring a graphic designer! Detailed instructions and templates included with this course! Perfect for any level of Photoshop user!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Get your mobile apps noticed</strong> in the iTunes store! Now you can create beautiful app icons easily. Make multiple versions of your icon for testing before your app goes live. No programming or design experience required!  </p>  <p style=\"\">  \tWhat makes this icon design course different is that it won&#039;t teach you how to make an app icon from scratch! That&#039;s the boring stuff! Instead, the initial set-up is already done... leaving you to the fun part like choosing pre-built frames, backgrounds and texture overlays! Once you&#039;ve selected the base elements, simply add an image or graphic from your app.  </p>  <p style=\"\">  \t<strong style=\"\">Included with this course:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">9 Multi-layered Photoshop files</strong> that are capable of producing hundreds of unique designs. Simply turn on or off the elements you need and add a unique graphic from your app. Within minutes, you&#039;ll have an amazing looking app icon that is ready to upload!</li>  </ul>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">A FREE bonus utility</strong> that will automatically re-size your icon according to Apple&#039;s design guidelines.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Instructions on <strong style=\"\">how to test icons on an actual iOS device</strong> (such as an iPhone, iPad or iPod Touch) <strong style=\"\">without a Mac or XCode</strong>! Allows graphic designers and developers to preview how icons will look on an actual device before delivering to clients.</li>  </ul>  <p style=\"\">  \tNow is the time to take control of your icon design or even start your own icon design business!  </p>  <p style=\"\">  \t<strong style=\"\">Template Features</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Professional Looking</li>  \t<li style=\"\">Time Saving</li>  \t<li style=\"\">Photoshop Based</li>  \t<li style=\"\">Built-in Backgrounds</li>  \t<li style=\"\">Built-in Texture Overlays</li>  \t<li style=\"\">Completely Customizable</li>  \t<li style=\"\">Current Design Standards</li>  \t<li style=\"\">Easy to Make Changes</li>  \t<li style=\"\">Templates Built at 1024x1024 pixels</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Test Icons Without XCode</strong>  </p>  <p style=\"\">  \tI will show you how to <strong style=\"\">load your newly designed icons onto an iOS device</strong> so you can see what it will look like on the home screen. This is not just an image superimposed on a static background. Your iOS device will load the icon and you can scroll through your home screen just like a regular app. In other words, <strong style=\"\">it is the actual app icon on your device</strong>. The best part is that you don&#039;t need a Mac or XCode!  </p>  <p style=\"\">  \tYou can even <strong style=\"\">have clients load the icon you&#039;re designing on their own device</strong> so they can preview how it will actually look when their app is live. Don&#039;t worry, it&#039;s easy to do... even for tech challenged clients! A great &quot;service&quot; you can offer that will differentiate you from other designers and developers!  </p>  <p style=\"\">  \t<strong style=\"\">About The Instructor</strong>  </p>  <p style=\"\">  \tThis app icon design course is taught by Harlan Yee, an independent publisher, internet business developer and motion graphic designer. Harlan has over 20 years experience in television broadcast and video production. You can follow his latest projects including website development, digital product creation and online marketing at <a href=\"http://freelancedoodle.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">FreelanceDoodle.com</a> .  </p>", 
    "end_date": null, 
    "title": "How to Create Top Ranking Mobile App Icons - iOS Edition", 
    "price": "25.00", 
    "instructors": "Walkabout Media", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/68876_4476_8.jpg", 
    "course_url": "https://www.udemy.com/appicondesigner/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-23T22:14:44Z"
}