{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t So, you want to draw sexy pinups but you can&rsquo;t find books or video courses on the subject?  </p>  <p>  \t I have what you&rsquo;re looking for, and just for taking the time to check out this video, I&rsquo;m going to give you free access to a few hours of my How to Draw Sexy Pinups.  </p>  <p>  \t This pinup course is different.  </p>  <p>  \t It will teach you the principles of how to draw sexy pinups, like what makes pinup women beautiful, and why a pose is sexy verses one that is not sexy, or how not to go too far and make porn instead of a pinup.  </p>  <p>  \t I show you how to make successful pinups, that believe it or not, can make you money. At the end of the course, after you are drawing awesome pinups, I teach you how to make money doing it.  </p>  <p>  \t I take you from the very beginning of how to quickly draw sexy women, their proportions, different techniques of drawing the poses, like gesture, construction, my newest techniques, and more.  </p>  <p>  \t I show you the very foundations of what makes pinups sexy, like twist the body, what angles are sexy and why, put weight on one leg and why, and much more.  </p>  <p>  \t You want to draw sexy pinups. This is how you do it.  </p>  <p>  \t During this course, we draw many sexy pinup women, in many sexy poses, but better than that, we also learn why those poses are sexy, and how to invent our own sexy poses for our own pinups. I show you how to think creatively in the process.  </p>  <p>  \t We learn how to draw hands, and specifically, how to draw them for pinups. Hands are so important in a pinup, so we need to do it right.  </p>  <p>  \t We learn how to draw feet for pinups. How to draw hair for pinups. How to draw expressions for pinups. How to draw folds and clothes for pinups, even how to draw sexy shoes and hair.  </p>  <p>  \t This is the complete guide to drawing pinups.  </p>  <p>  \t Why wait? Watch the free lessons, then buy the course.  </p>  <p>  \t You have nothing to lose because Udemy offers an iron clad, money back guarantee.  </p>  <p>  \t So start watching your awesome pinup course.  </p>", 
    "end_date": null, 
    "title": "How to Draw Pinups and Sexy Women", 
    "price": "20.00", 
    "instructors": "Neil Fontaine", 
    "commitment": "20 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/117004_499a_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-draw-pinups/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-08T14:05:46Z"
}