{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p> <strong><em>This is a great course for everyone trying to learn a new skill for them self.</em></strong></p><p> Gifs are one of the most common advertising formats used online.</p><p>gifs are supported by google adwords and more advertising platforms. and if you are in the field of online marketing or have an online business, blog or website at some point you will need to use animated advertising and one of the best formats, loads quickly no plugins required by the browser to load, is gif. </p><p>You will eventually need custom animated banners for your business, so this is an absolutely a great course to own and a great skill to have.</p><p> <strong>So what is it all about?</strong> </p><p> You've almost certainly come across animated banner advertising banners on websites, blogs, forums and social media platforms like, google+, twitter, tumblr and more.</p><p> Because they are animated images, they instantly draw the peoples attention and encourage visitors to click on them and they also show more information than regular image formats like jpeg, png or tiff, since they show more than one frame and are not static. </p><p> <strong>What is required for the course?</strong> </p><p> any photoshop version from adobe photoshop cs3, </p><p>no prior photoshop knowledge is required as we go into the basics of photoshop briefly</p><p> <strong>What you will learn</strong> </p> <ul><li><strong></strong>the basics of photoshop</li><li>the standards of web advertising</li><li>using frame by frame and keyframe animation in photoshop</li><li>converting video to gif</li><li>importing and editing video in photoshop</li><li>creating gifs in photoshop</li><li>exporting and optimizing gifs in photoshop</li></ul>  <strong></strong> <p> Enroll Now! .... </p><p> <em>P.S once you have created your first gif, be sure to share it with us in the course discussion area. </em></p>", 
    "end_date": null, 
    "title": "How to create gif animation in photoshop", 
    "price": "20.00", 
    "instructors": "businge ismail", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/517866_a670_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-gif-animation-in-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-02T08:15:14Z"
}