{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tLearn the art of Caricature using Sketchcbook Pro with this in depth 4 hour mega video course.  \tStart with the basic theory behind drawing caricatures. You will learn all the techniques required to take your caricature drawing skills to  \tthe next level. Watch as Justin explains feature placement, negative space and angle. You will then be taken on a run through of quick tips on how to draw the facial features with just a few lines.  </p>  <p>  \tFollowing this you will be guided through over a dozen caricature sketches in real time. See every pencil stroke on screen and listen as Justin explains each decision he is making to produce a caricature likeness of famous celebrities from film and TV.  </p>  <p>  \tThe final part of this course includes a 1 hour chapter on rendering a caricature portrait in full colour with the use of 'Sketchbook Pro'.  </p>  <p>  \tA short introduction video on how Justin uses Sketchbook Pro is also included.  </p>  <p>  \tThis course is perfect for anyone looking to learn how to draw caricatures.  \tWhether you are a traditional artist with pencil and paper or a digital artist, this course will be sure to strengthen your caricature drawing skills.  </p>  <p>  \tEach 'caricature demonstration' includes downloadable files for reference.  </p>  <p>  \tDrawing caricatures is a lot of fun. Whether your ambition is to draw professionally or for fun, this course will arm you with the ammunition you need to draw high quality caricature art.  </p>", 
    "end_date": null, 
    "title": "How to draw Caricatures", 
    "price": "20.00", 
    "instructors": "Justin Cook", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/81278_16c1_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-draw-caricatures/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-20T16:28:03Z"
}