{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course will teach you to all you need to know to design a business card: </p><ul><li>What programs to use (Adobe Photoshop, Corel Draw and Microsoft Word)</li><li> What are the elements of a business card (the bleed, the trim zone, the safe zone and the text zone), </li><li>What orientation: portrait or landscape.</li><li>What information you put: the name of Business or Organization, the name of Individual, the job title, the address,  the phone number. </li><li>How you arange the information</li><li>How you design a business card (how you choose color, fonts, sizes, images, types of business card),</li><li>How and where you can sell, </li><li>How to be inspired and promote your work, </li><li>Tips and tricks in design the business card and more.</li></ul>The course will introduce you to the terminology and the programs you can use to make business cards. It is a course for beginners but it helps you even if you have an average knowledgeable in graphic design.The course contain: 8 video tutorials (of approximately<span> 30 minutes) and 5 documents with more information<span> for those who want to know more<span>.</span></span></span><span><span><span>This course is for you if you want to start designing business cards or you want to improve the way you do business cards</span></span></span>", 
    "end_date": null, 
    "title": "How to make Business Cards like a Pro", 
    "price": "20.00", 
    "instructors": "Andreea Laura Parlafes", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579202_d1ac_2.jpg", 
    "course_url": "https://www.udemy.com/the-secrets-of-making-business-cards-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T16:43:11Z"
}