{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tAs a professional digital artist I have had the privilege of working on projects ranging from print identity &amp; branding to  Superbowl commercials and Hollywood feature films.  </p>  <p style=\"\">  \tHow would you like to be able to produce professional photo realistic product mockups for free. No experience needed? Sound to good to be true? In fact its not and I will show you why.  </p>  <p style=\"\">  \tThis course discusses the theory and practical applications of contextual mockups. If you are looking to promote a new business or want to improve sales sales then you will benefit from this course.  </p>  <p style=\"\">  \tIn this course you will learn how to produce professional and photo-realistic contextual mockups of designs and products across a wide range of mediums including print, clothing, signage, product design, advertising, artwork and more.  </p>  <p style=\"\">  \tPhoto-realistic mockups provide a excellent way of not only improving your own designs but also changing the way they are received by potential clients or investors. A visual design very rarely exists by itself. It is always designed to be displayed on something. Often a design will present differently (often better) once it is seen in its intended context.  </p>  <p style=\"\">  \tAs a creative designer I have found that providing clients with mockups of their designs not only helps get my idea across but also gives me an edge on other designers and improves sales up to 3 times!  </p>  <p style=\"\">  \tIn the past creating photo-realistic professional mockups required strong composting skills, photography equipment and lots of time. In recent years however there has been a push to automate a vast majority of this process. I have spent a lot of time slip-streaming my workflow in this area to the point in which I can produce photo-realistic mockups of almost anything in a few minutes. The resulting quality is so good you wont be able to tell its not real. I will show you how I do this and how you can do it...for FREE.  </p>  <p style=\"\">  \tThis course is broken into three easy to follow sections. Section 1 is the theory and concept. You will hear about:  </p>  <p style=\"\">  \t    How concept art and mockups have transformed my business     Why I think you would benefit from this     Why this method is much better than you might realize     A real work case study of a professional design studio which proves that mockups do work to sell design and ideas.  </p>  <p style=\"\">  \tSection 2 covers all the resources you will need to reproduce my results, including:  </p>  <p style=\"\">  \t    The software you will need, how to download it and why I think you should use it.  </p>  <p style=\"\">  \t    My personal collection of free resources     My personal collection of paid resources  </p>  <p style=\"\">  \tIn Section 3 you will lean about everything you need to know to produce your own mockups, no matter what your skill level. Including:  </p>  <p style=\"\">  \t    Downloading files     Importing your image or vector design, applying it to the surface     Resizing your finished product     Exporting your finished mockup to whatever format and dimensions you require.  </p>  <p style=\"\">  \tThis section also covers 3 real world practical examples which show you how to:  </p>  <p style=\"\">  \t    Make a professional branding &amp; identity mockup including letterhead, business cards, promotional items and more.     Make an photo real iPhone 6 mockup. Great for showing off your mobile app or website!     Make a photo realistic T-Shirt mockup. This is an awesome project for anyone looking to sell a brand, design or clothing design.  </p>  <p style=\"\">  \tBut it doesn&#039;t end there! This course never ends! After you have finished to course I am always here and available. Not only to answer your questions but also to upload new and interesting videos regarding making mockups for a surface I have not yet covered.  </p>  <p style=\"\">  \tAs a member of this course you will be able to nominate mockup projects and I will upload new videos showing how to produce that mockup!  </p>", 
    "end_date": null, 
    "title": "How To Sell Practically Anything: Professional Design Mockup", 
    "price": "50.00", 
    "instructors": "Blake Muir", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310652_101c_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-sell-practically-anything-professional-design-mockup/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T09:09:03Z"
}