{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em style=\"\"><em style=\"\"><strong style=\"\">The course with valuable knowledge will help you to create simple vector art for web and applications.</strong></em></em></p><p><em style=\"\">I&#039;d love to share my easy method to draw pictures by hand and convert this into vector graphic by using Photoshop and Illustrator. I use the method to draw icons, design elements and even children books. It is absolutely easy, quick and suitable for everyone.</em><br style=\"\"></p><p><strong style=\"\">Suitable for everyone </strong><br style=\"\"></p><p>For applying this course you do not need any skills and knowledges in drawing by hand. You don&#039;t need to be familiar with Photoshop and Illustrator. We will learn a needed tools step by step.</p><p><strong style=\"\">My course four parts:</strong><br style=\"\"></p><p><em style=\"\">- Drawing by hand</em><br style=\"\"></p><p> I will give you some advice how to start drawing and find your style. I will share my observations in choosing right pen or pencil for drawing. I&#039;ll also show you how to get quality digital copies of drawings.</p><p><em style=\"\">- Processing in Photoshop</em></p><p>With these part of lessons you will learn a needed tools to process image and cut out needed elements.</p><p><em style=\"\">- Turning into vector in Illustrator</em></p><p>You will know how to convert drawings into vector graphic and edit vector art. </p><p><em style=\"\">- Prepare your vector art</em><br style=\"\"></p><p>You will learn how to edit vector graphic.<br style=\"\"></p><p><strong style=\"\">Two bonus lectures</strong></p><p>As bonus I will show you how to re-size and re-shape your hand-drawn elements. And some more lecture is about reducing extra points in vector shapes.</p><p><strong style=\"\">How to get Photoshop and Illustrator</strong></p><p>There is special lesson for them who haven&#039;t yet got Photoshop and Illustrator to their computer. From this lesson you can get full information where and how to download and install these programs, and then get free trial.</p><p><strong style=\"\">What kind of skills will you gain?</strong></p><p>Having passed my course you will know how to start drawing by hand, how to use Photoshop and Illustrator and how to turn a hand-drawn design into vector art </p>", 
    "end_date": null, 
    "title": "How to Make a Custom Graphic From Sketches ", 
    "price": "20.00", 
    "instructors": "Natalia Chuprova", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452182_c411_24.jpg", 
    "course_url": "https://www.udemy.com/how-create-vector-art-from-drawings-by-hand/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T13:33:12Z"
}