{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Every professional designer who wants to be marketable MUST know Adobe Illustrator</strong>, the industry standard software for drawing icons, logos, and vector artwork. Vectors are the curves that you draw with Illustrator, and they can be enlarged many times over without loosing quality, unlike raster art, which uses pixels on a grid, and distorts if it gets too large. Illustrator's vector files can be exported to raster formats, like .jpg, .gif, or .png, for projects that need them, like websites. I'm Joseph Caserto, a graphic designer with over two decades of professional experience, and I've been creating vector artwork that whole time. In this course, I'll help you master the basics of drawing simple vector shapes. Once you've got those essentials down, we'll move on, and use them to help you learn more intermediate ones. You'll build a solid foundation, which you can use beyond the course, to develop your own projects that showcase your skills in this application that's critical to know if you're going to be competitive in the professional design world.</p><p><strong>What You'll Find Inside</strong></p><ul><li>A curriculum that lets students build confidence and skills by starting with essential techniques, moving on to fundamentals, and finishing with advanced methods.</li><li>Downloadable files for students who want a hands-on learning experience, allowing them to follow along with lectures.</li><li><span></span>Six hours of instruction through 50+ high-quality, downloadable HD videos that have clear audio and easy to see menus and windows.</li><li>A quiz at the end of each section so students can review their knowledge before moving on. </li></ul>", 
    "end_date": null, 
    "title": "Intro to Adobe Illustrator", 
    "price": "20.00", 
    "instructors": "Joseph Caserto", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/561800_959e_6.jpg", 
    "course_url": "https://www.udemy.com/intro-to-adobe-illustrator/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-22T17:10:15Z"
}