{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Learn Photoshop CC with Stone River eLearning. In this Photoshop CC course, you&#039;ll master only the skills you need to know to use Photoshop CC professionally or as a hobby. </p><p style=\"\">Photoshop CC has hundreds of tools and thousands of settings. Most users will never use the majority of them. This course explores the most commonly used tools and helps you apply them to real world situations.</p><p style=\"\"><strong style=\"\">Projects</strong></p><p style=\"\">In this course you will work on a project at the end of each section. You will work on a real life project that uses the skills you just learned in each section. Projects can be used for practice or to build a portfolio of work. </p><p style=\"\">After taking this course you will be able to use Photoshop in these fields:</p><ul style=\"\"><li style=\"\">Graphic Design</li><li style=\"\">Photography</li><li style=\"\">Web Design</li><li style=\"\">Game Animation</li><li style=\"\">Logo Design</li></ul><strong style=\"\">Who Should Take This Course</strong>This course is designed for Photoshop CC beginners so you can learn Photoshop no matter your skill level. However, even intermediate users will learn Photoshop CC skills and applications important to success.<p style=\"\"><strong style=\"\">Prerequisites</strong></p><p style=\"\">There are no skill prerequisites for this course. You are expected to have access to a copy of Photoshop CC, though Photoshop CS6 will work fine as well. </p>", 
    "end_date": null, 
    "title": "Learn Photoshop CC Essentials", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482208_e5df_3.jpg", 
    "course_url": "https://www.udemy.com/learn-photoshop-cc-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T15:12:44Z"
}