{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course will demonstrate methods for quickly coloring character artwork in a  cell shaded style, while focusing on production value as well as  flexibility. We'll cover multiple techniques, including isolating scanned artwork onto a transparent background,  and preparing lines for color using levels. It will also cover how  to use clipping masks, layer masks,  adjustment layers, and a number of other tools and functions in  Photoshop. These tools and techniques will then be put into practice to  create a base layer onto which all of the flat local color layers will  clip. Adjustment layers will be placed over these flat colors in order  to light the character.</p><p>Throughout the course, various shortcuts and  time-saving methods will be used to speed up workflow as much as  possible. Other than speed, the other focus of these methods is their  nondestructive quality, which allows the artist to go back into any stage or  section of the piece and easily change it. The course also covers how to  push the appeal of the character by employing gradients to add  dimension and interest, and using a combination of cell shading and painterly  techniques to get the most out of the character and ultimately produce a high  quality piece of character artwork.</p><p><strong>Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)</strong><br></p><p>More about the Instructor:</p><p>Colleen (Peck) Larson is a freelance  concept artist living in California's Bay area.  She is a semester away from earning her  BFA in Illustration from San Jose State University, and previously she's had the opportunity to work for  companies such as Firaxis Games and Gaia Interactive, but  currently she is a concept artist interning at Zynga in San Francisco.  Her obsessions lie equally between art,  video games, cats, and her husband Erik.</p>", 
    "end_date": null, 
    "title": "Learn 2D Cell Shading in Photoshop", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711210_c66b.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-learn-2d-cell-shading-in-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T21:42:33Z"
}