{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Searching for a perfect motion graphic course to cover all the Aspects of motion graphic from basic and fundamentals concepts to extremely advance project  not just user interface and tools ?</p><p>So , This course is for you ..!</p><ul><li>Learn and create amazing motion graphic scene using after effect powerful tools for motion design .</li><li>Understand basic and fundamentals concepts of motion design .</li><li>Graphic Designer or person with a little bit knowledge in image manipulation software or vector based like Adobe Photoshop or illustrator can take this course .</li><li>The course structure is that course first lessons start from beginner and basic staffs  to advance motion graphic project .</li><li> Real world examples and high end projects will covered in this course .</li><li> Beside after effect built -in tools we will learn how to use famous  third party plugins from different companies (Trapcode, Rowbyte.. ).</li><li>The main goal of this course to help students who want to be Motion graphic artist in less time and easy ways .</li><li>Best choice for beginner students who are not used after effect yet and don't know about motion graphics and after effect.</li><li>Example project at the end of each topics for better understanding .</li><li> At the end of this course you understand all the fundamentals concepts in motion graphic and you can analyze complex motion graphic scene and you can create them .</li></ul>", 
    "end_date": null, 
    "title": "Learn Motion Graphic with After Effect in 5 Hours", 
    "price": "20.00", 
    "instructors": "HU Shahir", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/861742_b199_4.jpg", 
    "course_url": "https://www.udemy.com/motion-graphic-with-ae/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-27T20:23:39Z"
}