{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">~~~~~~~~~~~~~~~~~~<br style=\"\"></p><p style=\"\"><strong style=\"\">WAIT!</strong> Did you know you can get Photoshop for <strong style=\"\">FREE</strong> and it&#039;s 100% legal?  Yep! Watch the &quot;Free&quot; Preview video below before you sign up for this course.</p><p style=\"\">~~~~~~~~~~~~~~~~~~<br style=\"\"></p><p style=\"\">Are you intimidated by Photoshop? Do you believe it&#039;s only an advanced program for web designers or photographers?<br style=\"\"></p>  <p style=\"\">  \t                                                              Well, it&#039;s not!  </p>  <p style=\"\">  \t                                                                       It&#039;s also for <strong style=\"\">YOU</strong>, the blogger or webmaster who wants the freedom to create your own images for your site and social media.  The problem is <strong style=\"\">NO ONE</strong> ever teaches Photoshop from that angle... until now.  </p>  <p style=\"\">  \t                                         And I&#039;m going to make learning so easy!  <strong style=\"\">You are going to be blown away by how quickly you will pick everything up</strong>.  This course will definitely squash the perception of Photoshop being &quot;too confusing.&quot;  </p>  <p style=\"\">  \t                                                  The Internet has become incredibly visual and attractive images drive more exposure to your site. So take control of your own creations by learning the most powerful image creation program on the planet!  </p>  <p style=\"\">  \t<strong style=\"\">                                                                          By the time you are done with this course, you will be able to apply these basic lessons to create your own headers, banners, site images, YouTube thumbnails and even simple infographics.  </strong>  </p>  <p style=\"\">  \t                                                                                Each section in the course builds on the one before.  It begins with an overview of three core functions of Photoshop that we will use throughout the course.  Once you learn those basics, you will be halfway home.  </p>  <p style=\"\">  \t                                 From there you will learn how to create an image from scratch, style the background, add and style text, crop people out of photos and erase backgrounds.  </p>  <p style=\"\">  \t  I&#039;m not just going to highlight the tools.<strong style=\"\"> I show you real-life examples of how to use them so you can create images for your site.</strong>  </p>  <p style=\"\">  \t                                                                                                                          I will also illustrate how to add patterns and fonts to Photoshop for ultimate design freedom. <strong style=\"\">Free online image creators are great, but limited</strong>. With Photoshop, you can add as many fonts, shapes and patterns as you want and I&#039;ll show you how!  </p>  <p style=\"\">  \t                                                                                                                          As an added bonus, I will walk you through creating a basic infographic.  These images are handy for getting more exposure on social media.  I use them to get lots of traffic from Pinterest.  </p>  <p style=\"\">  \t                                              You&#039;ll also learn how to create images to re-sell on T-shirts, mugs, etc.  so you can earn with sites like Cafe Press, Spreadshirt, Teespring, Zazzle, you name it.  </p><p style=\"\">Forget hiring a graphics person to do your site images because you can learn to do them yourself!<br style=\"\"></p>  <p style=\"\">  \t                                                                    This is <strong style=\"\">not</strong> a course for web designers or advanced photo effects. So you won&#039;t be learning how to design a website or do things like remove wrinkles from people&#039;s faces.  </p>  <p style=\"\">  \t                                               This course is best if you want to create feature images on your blog posts, images for social media, headers, simple infographics and more.  </p>  <p style=\"\">  \t                                                                                                    I&#039;m so excited to teach you Photoshop in a way that it <strong style=\"\">SHOULD</strong> be taught, and the way I wish it had been taught to me.  </p>  <p style=\"\">  \t                                                   Many of you are site owners without design experience who just want the control and freedom to create web images with no limitations.  If that&#039;s you, sign up today!  </p>  <p style=\"\">  \t                                                                             See ya in class!  </p>", 
    "end_date": null, 
    "title": "Learn Photoshop CS6 Quickly and Easily (For Web Images)", 
    "price": "40.00", 
    "instructors": "Lisa Irby", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314698_97e6_7.jpg", 
    "course_url": "https://www.udemy.com/pscourse/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T00:06:48Z"
}