{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t <a href=\"http://www.hobitute.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Hobitute</a> offers an academic series of self-study courses which help the learners understand the techniques of oil painting. All the courses are professionally authored. They are designed in such a manner, that they easily fit your schedule. You can learn them at your own pace. When you subscribe to our courses, you will learn to draw and paint the artwork using oil painting techniques. Unruffled &ndash; with our knowledge and your passion &ndash; we will unravel your ingenuity and develop your potential!.  </p>  <p style=\"\">  \t<strong style=\"\">Why Hobitute&#039;s painting classes differ from others?</strong>  </p>  <p style=\"\">  \t    In the recent days, there are many art instruction sites that provide you a variety of oil painting courses. Some of the main reasons why we stand out of the crowd are&hellip;.  </p>  <p style=\"\">  \t    &middot;<strong style=\"\">Concept</strong>  </p>  <p style=\"\">  \t    The main concept behind our courses is that we teach you to build up the skills in the key areas of oil painting. Some of the learners may feel oil painting as a daunting task; this is because they don&rsquo;t know much about the key areas or the techniques. All the courses are structured concentrating the key areas. Through the courses that we offer you can build your painting skills. The step by step approach followed in the lessons help the learners understand the significance of value in composing the work, oil painting, solvents, the brush strokes, toning a canvas and glazing techniques. Thus, our drawing classes and painting classes are special and tuned.  </p>  <p style=\"\">  \t   &middot;<strong style=\"\">Art principles</strong>  </p>  <p style=\"\">  \t   The principles we teach here can be used for painting any kind of subject. It is not confined to one subject. For more information regarding our mission to impart affordable art education to the world, please visit our site <a href=\"http://www.hobitute.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Artists@Hobitute</a> .  </p>", 
    "end_date": null, 
    "title": "Learn Drawing and Painting a Landscape with Oil Colours", 
    "price": "20.00", 
    "instructors": "Hobitute  Artists", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/134690_17a1_5.jpg", 
    "course_url": "https://www.udemy.com/learn-drawing-and-painting-a-landscape-with-oil-colours/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-17T04:34:17Z"
}