{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Adobe CS may be the industry standard for digital design, but for those just starting out in the industry the subscription fees are far beyond most people's budgets. Lucky for Mac users at least, there's a cost-effective and award winning alternative; Sketch 3! This easy to use software allows you to create professional looking mobile apps, with all the ease and efficiency that comes with using larger scale industry programs. </p><p><b>What You'll Learn about Sketch 3 Design</b></p><ul><li>Learn the ins and outs of Sketch 3 Design</li> <li>Gain a foundation knowledge of design principles</li> <li>Use Sketch 3 for all aspects of graphic design</li> <li>Create your own mock-up Facebook app</li></ul><p><b>Instant, Easy Mobile Apps on Mac</b></p><p>This course includes 17 lectures and 1.5 hours of content that will teach you everything you need to know about creating mobile apps on Sketch 3. Not only will you be an expert on using this particular program for app design, but you'll also take away a solid knowledge of the principles of design as a whole that can be utilised on a wide range of other platforms too.</p><p>At the beginning of this course you will get to grips with the basics of building and exporting a project on Sketch 3. From there, you'll learn how to get design templates and edit them to create unique designs. You will understand how to work with pages and apply styles across pages, as well as working with shapes and symbols, creating icons and splash screens, and the various other tools included within Sketch 3.</p><p>Throughout this course you will be building up your own mock-up app based on Facebook's function and design. On completion, you'll be equipped with the knowledge needed to create a wide range of mobile apps on Sketch 3, with varying functionality and design. </p><p><b>About Sketch 3</b></p><p>Sketch 3 is the latest version of the popular mobile app design program created by Bohemian Coding. Built with modern graphic designers in mind, it includes powerful features like symbols and shared styles, a workflow that supports multiple pages and artboards, and much more. Sketch 3 has been built especially for Mac, with an intuitive design and elegant interface so you can create flawless projects with a focus on design. It even co-operates with OS X's Versions and Auto Save, so you can rest assured knowing your work is safely saved at all times even if you get interrupted when designing. </p>", 
    "end_date": null, 
    "title": "Learn Sketch 3 Mobile App Design From Scratch", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403764_fdf4_3.jpg", 
    "course_url": "https://www.udemy.com/learn-sketch-3-graphic-design-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T19:42:17Z"
}