{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Give me 1 Hour and I promise you will never be afraid of Photoshop again. In fact, you will see how fun it can be. </strong></p><p style=\"\">Why do so many people shake in fear at the thought of trying to learn Photoshop. I know it is a huge program, but the truth is you only ever end up using certain things. In this course I will show you exactly what use every day and leave out all of the fat.</p><p style=\"\">Photoshop has been around for a long time. And while it is constantly innovating and making our lives easier, Adobe very rarely takes out the parts that don&#039;t work anymore. It&#039;s understandable. Many designers don&#039;t want to relearn the program every year. So Photoshop has become kind of like a hoarder. Full of a lot of junk that it just can&#039;t bring itself to throw away.</p><p style=\"\">Another important thing to understand. Most online classes want to be thorough. They think they have to each you every single tool and effect and walk through step by boring step explaining how to use tools that nobody uses anymore. </p><p style=\"\"><strong style=\"\">Why is this course different?</strong><br style=\"\"></p><p style=\"\">I&#039;m not here to teach you all of Photoshop. To be honest, I don&#039;t know anyone who knows everything you can do with Photoshop. The program updates so much that you can either work as a Graphic Designer, or spend all your time learning what&#039;s new.</p><p style=\"\">If your goal is to become a graphic designer, this is a very good first step. If your goal is simply to open Photoshop documents and know where to go...this is also the course for you.</p><p style=\"\">If you have been working with Photoshop for a while and want an advanced class...this isn&#039;t the course for you. However we do cover some topics that are considered advanced. I just consider them cool...or really good to know.</p><p style=\"\">Give me just an hour and I swear you will never be afraid of Photoshop again!<br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\">After we get up to speed with Photoshop, it&#039;s time to learn how to make some dough! </p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">I will show you some of my favorite techniques to find new clients.</strong></p><p style=\"\">We begin with a quick hour of training. Then, using the tools from the training I will show you a few key skills that I use to generate income. After that I will show you some ways to find clients. Here&#039;s one of the keys, you don&#039;t want to try and find jobs where everyone else is. So forget Elance and other job boards. I&#039;ll show you what actually works. </p><p style=\"\"><strong style=\"\">As I add more to this class the price will go up. So I recommend you get in early. Once you buy this class you will be in for life. So it could go well over a few hundred dollars, but you may have only paid $59. </strong><br style=\"\"></p><p style=\"\"><strong style=\"\">In this course we will learn the following:</strong></p><ol style=\"\"><li style=\"\">The 3 Most Important Parts of Photoshop CC</li><li style=\"\">The Secrets to the Layers Panel</li><li style=\"\">The most important tools and how they work.</li><li style=\"\">The one quick skill that can bring you tons of income. </li><li style=\"\">My favorite tricks</li><li style=\"\">How to find clients today!</li></ol><p style=\"\">If you are not 100% satisfied that this course is worth the price you paid, I will give you a full refund. <br style=\"\"></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Learn Photoshop CC in 1 Hour (No Experience Needed)", 
    "price": "20.00", 
    "instructors": "Jason Buff", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337072_848d_15.jpg", 
    "course_url": "https://www.udemy.com/learn-photoshop-in-one-hour-no-experience-needed/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-06T00:24:00Z"
}