{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  Inkscape is a free powerful vector art creation tool that many designers rely on worldwide, also known as the free alternative to Adobe Illustrator and Corel Draw.  </p>  <p style=\"\">  \tBeing able to create detailed graphics, on a budget, on your computer is not always easy; whilst many graphics programs are available and many are easy to use, they can often lack functionality or other essential capabilities.<br style=\"\">  \t<br style=\"\">  \tSome designers need to be able to create as freely on their computer screen as they could with a piece of paper and a pencil and that is where Inkscape comes in. It provides you with countless tools within a simple to use interface. And because it is open source, it has the capability to be enhanced and developed further by expert designers.  </p>  <p style=\"\">  \t  It can be used in web design, games graphics design or any other creative project that requires vector art.   The best part about Vector art is that it could be scaled easily without loosing quality.  </p>  <p style=\"\">  \tThis editor differs from many others in that it uses vector graphics to create images and it supports the popular SVG (Scalable Vector Graphics) format for object creation and manipulation. Vector images are not stored as pixels, and as such they can be far more accurate and precise especially when making images larger and smaller. Inkscape allows you to create numerous different graphics, maps, equations, logos and much more.  </p>  <p style=\"\">  \t   Learn the basics fast and easy with these step-by-step tutorials.  </p>  <p style=\"\">  \t   Like any software, the best way to learn it is to use it and this course is to be treated as a living and growing one, where new material and corrections would be added regularly.  </p>", 
    "end_date": null, 
    "title": "Learn Inkscape Step by Step from Scratch", 
    "price": "20.00", 
    "instructors": "Prateek Singh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322138_0e30.jpg", 
    "course_url": "https://www.udemy.com/inkscape-training/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-18T15:10:23Z"
}