{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t       Logo design is an essential skill that marketers MUST learn if they want to expand their marketing expertise. Why?  </p>  <p style=\"\">  \t       Because Logos are a fundamental element of any brand.  </p>  <p style=\"\">  \t       Logos are like the face of the brand, they&#039;re all that people remember when they think of a brand.  </p>  <p style=\"\">  \t       A good logo is the one that enforces the brand message.  </p>  <p style=\"\">  \t       Like any visual communication, the elements of design, like shape, color, typography, style, contrast and composition communicate at subconscious levels.  </p>  <p style=\"\">  \t       This communication happens instantly, without us realizing. However, with the right training, you can learn to identify all of the elements that are part of this communication and use them to support your brand message.  </p>  <p style=\"\">  \t<em style=\"\">In this course you&#039;ll witness exactly: </em>  </p>  <ul style=\"\">  \t<li style=\"\">How to design logos that people will remember</li>  \t<li style=\"\"><em style=\"\">KISS</em> technique <em style=\"\">(Keep it Simple Stupid)</em></li>  \t<li style=\"\">The Elements of a Logo</li>  \t<li style=\"\">The role of COLOR in logos</li>  \t<li style=\"\">The role of SHAPES in logos</li>  \t<li style=\"\">How to take control over the subconscious process of logo communication </li>  </ul>  <p style=\"\">  \t       You&#039;ll also get to see how we create a custom logo right in front of your eyes. A real logo for a REAL COMPANY called Career Claw. You&#039;ll get to see the whole process and watch one of our guys, Kamron, use Corel Draw to create an outstanding logo out of the blue!  </p>  <p style=\"\">  \t       Learn to be your very own graphic designer!  </p>  <p style=\"\">  \t       Logo creation is a Skill that everyone would be interested in learning.  </p>  <p style=\"\">  \t <strong style=\"\">And, you can learn this all in under an hour!</strong>  </p>", 
    "end_date": null, 
    "title": "Logo Design Essentials ", 
    "price": "20.00", 
    "instructors": "iMarket XL", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/249126_74a8_5.jpg", 
    "course_url": "https://www.udemy.com/logo-design/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-24T03:28:33Z"
}