{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Have you ever wanted to learn Illustrator and become a logo designer?</p><p>Have you ever stuck with your logo design project and couldn't finish it, because you didn't know how to achieve certain effect?</p><p>Or maybe you've started to learn Illustrator but stopped, 'cause you didn't see any results of your efforts?</p><p><strong>Don't worry. It's not your fault.</strong> Many tutorials and courses out there don't really show you how to learn Adobe Illustrator effectively, that is in a practical and simple way, like a logo design.</p><p>I am like you: I've watched lots of tutorials and videos on Adobe Illustrator, but they were all missing something: they always left me with an “Ok, so what do I do now?\" kind of feeling.</p><p> That is why I've decided to put this course together for all of you who are struggling with Adobe Illustrator or simply want to start using it and want to do it practically – in a form of logo design.</p><p>Take a look at just a small bit of fascinating knowledge you'll get:</p> <ul><li>3 in 1 unique bundle: learn illustrator, logo design theory and use the skills in practical examples and case studies. Make your family and colleagues say to you “Wow, when did you learn all this?\"</li> <li>From zero to hero: In about 20 minutes design a logo, that Fortune 100 companies spend 6 figures on </li> <li>Hidden Adobe Illustrator tricks and techniques, that will make you a designer in one afternoon</li> <li>Get practical Adobe Illustrator knowledge, that will get you your dream job as a designer, paying as much as $5000 a month</li></ul> <p>What you get is a unique occasion to finally learn Adobe Illustrator the right and practical way. Say good-bye to pointless clicking and wondering why some things work and others don't. Focus on what you love the most: designing and getting paid for it! </p><p>But if you are not interested in any of that, you don't want to learn Adobe Illustrator nor logo design fundamentals, you can just stop reading.</p><p>So You've never used Adobe Illustrator before? Great! It means you won't learn anything unnecessary, that other courses try to stuff in your head!</p><p>Struggling with Adobe Illustrator and wasting hours to just get things done? No worries. Discover hidden tricks and tips, that will unlock your creative potential!</p><p>Enroll in the course and enter the amazing world of design in Adobe Illustrator and start getting paid for doing what you love!</p><p>But it's almost never only about the content, right?</p><p>Have you ever felt so eager to learn, so interested in the topic, that you couldn't wait to start? </p><p>You were gnashing your teeth with excitement, but instead of a sensation of your jaw dropping in awe, your head was falling on your shoulder… because you were so bored you fell asleep. </p><p><strong>Boring instructors are worse than boring topics! That's a proven fact!</strong> </p><p>So trust me, when I say this:</p> <ul><li>This course is all about direct, unique and fun approach. You'll learn not only all the “How's\", but most of all, all the “Why's\", hopefully giggling from time to time.</li> <li>Your confidence will grow immediately: with every new skill learnt, you'll actually feel you are becoming a pro designer</li> <li>Your skillset will be future-proof. The secret truth about Adobe Illustrator is, that there are techniques that work always. Learn the logic behind them and you will become a total master of Adobe Illustrator, not a “master\" of just a single version of it.</li></ul> <p>Let me make you feel special. Let me guide you through all the Adobe Illustrator fundamentals and build your confidence as a logo designer. All that matters to me is your success!</p><p>And, of course, your order is covered by out…</p><p><strong>30-day 100% No Questions Asked, Money Back Guarantee! </strong></p><p>Now you may think “Yeah, it all sounds great, but there is a bunch of courses on Adobe Illustrator out there\". You got a point there, so let me use the words of one of the greatest thinkers of all time, Confucius: </p> <p><strong><em>\"Tell me, and I will forget.</em><em>Show me, and I may remember.</em></strong><em><strong>Involve me, and I will understand.\"</strong></em></p><p>And as true, and even as obvious, as it may sound, many courses out there fail in one, most important thing: they don't involve their students in the creation process.</p> <p>That's why I want to involve you into putting all the skills and knowledge into practice. I want to take you by the hand and show you, what to do with all the unparalleled skills you'll get:</p> <ul><li>Learn the know-how of professional designers. See logo design process from start to finish.</li> <li>Learn how to create top-dollar logos using tools explained in the course. Straight and simple. No monkey-business.</li> <li>See immediate results! Learn how your new skillset can let you produce a professional logo in about 20 minutes.</li></ul> <p>I vouch for this course. I wish I came across this kind of knowledge, when I was starting out as a designer. </p><p>But if, within the 30-day guarantee period, you are not convinced this course is going to make you a great Adobe Illustrator designer…</p><p>… simply ask Udemy for a refund, but I really doubt that you will have a reason for it. </p><p>You risk nothing.</p><p><strong>It's up to you now.</strong></p><p>Click that Enroll button and take your first step to creating sensational logo designs, that will supercharge your skills, your career, your wealth, and your life.</p><p>To your success,Dawid TumińskiAdobe Certified Expert in Adobe Illustrator CS6</p><p><strong>P.S.</strong> One more thing…</p><p>This is what one of my students, Basim Salim, had to say about this course</p><p><em>I love Dawid's teaching style. He does such a great job of teaching the theory and basics of Illustrator and Logos. Then, he shows practical ways of using it to make your very own logos. After the course I was able to make my own logos that I can now sell and make for my own businesses!</em></p><p><em>Check the other reviews and join the happy community!</em></p>", 
    "end_date": null, 
    "title": "Logo design: How To Design an Awesome Logo in Illustrator", 
    "price": "20.00", 
    "instructors": "Adobe Certified Expert Dawid Tuminski", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356840_5d6f_13.jpg", 
    "course_url": "https://www.udemy.com/designing-logos-learning-illustrator/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T07:52:27Z"
}