{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Would you like to become a professional logo designer and <strong>create beautiful, relevant, distinct, and memorable logo designs</strong>? Do you want to gain insight into the lucrative and fun industry of logo design?<br></p><p>In this value-packed course, you will learn how to become a professional logo designer. Learn about logo design principles by looking at corporate logos and student logos, and then apply those principles in your own logo design work. You'll gain valuable insight into logo design and the logo design industry.</p><p>This course guides you in the process of brainstorming, sketching, and designing logos after meeting with a client. You will also learn about logo design creative briefs and contracting, as well as the importance of creating a logo design portfolio.</p><p>You will learn various Illustrator techniques to create <strong>high-quality, beautiful logos</strong>. </p><p>After enrolling, you can post your work to the discussion board for critique as you build your logo design portfolio. </p><p><strong>Gain valuable insight </strong>on logo design and Illustrator by learning from Chad Neuman, PhD, who has:</p><ul><li>Worked at an award-winning advertising design firm using Illustrator. </li><li>Taught logo design and Illustrator at the university level.</li><li>Done freelance graphic design work for about 20 years.</li><li>Was previously managing editor at two graphic design magazines, one of which focused on Illustrator.</li></ul><p><br></p><p>This course also differs from other Udemy courses on logo design in that it's currently the only one with closed captions.<br></p><p><strong>Master logo design today</strong> to start building your portfolio and client list. Design your own logos for your brand or for others. Apply relevant color, typography, and design principles to create an awe-inspiring and distinct logo design portfolio. Become a logo design rockstar!</p><p><strong>Be sure to check out the promo video and remember that this course features a 30-day money back guarantee</strong> if you're not satisfied with it after enrolling. <em><strong>See you in the course!</strong></em></p>", 
    "end_date": null, 
    "title": "Logo Design Masterclass: Learn Logo Design + Illustrator", 
    "price": "25.00", 
    "instructors": "Dr. Chad Neuman", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416548_a74f_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-professional-logo-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T15:45:32Z"
}