{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Welcome to Logo Design-Fundamentals of Building a Great Brand Logo. Our course teacher, Lauren, walks you through the steps he takes to come up and create a logo design. In Logo Design Fundamentals, Lauren describes his process from start to finish using all the elements it takes to create and build a unique logo. With a Bachelor’s degree in Fine Arts and an Associates degree in Graphic Design, Lauren has the professional experience needed to be the perfect instructor for this course. He has been our lead designer for over 5 years, and we are happy to have him on the Elevated team.</p>  <p>  \t             Our Logo Design course is shown using mostly screen casts video.   We use the best tools and provide lot's of fun and exciting tips.  </p>  <ul>  \t<li>Tools Adobe Illustrator, Photoshop and Reader  </li>  </ul>  <p>  \t           All the sound is recorded using a Blue Yeti microphone for maximum clarity and we use the Camtasia screen capture for high quality video.  </p>  <p>  \t              This is a fun course, weather you have little or now background with Adobe products suite or you are seasoned vet looking to pick up some fun tips and tricks from another peer professional logo designer.  </p>  <p>  \t                 Using Adobe and showing how you can help brand someones company with a great logo design is an important skill to have.  We are here to add value to your life and want you to feel happy with the content we have created and are providing in this course.  We want to be new valuable members of the Udemy family and are excited for the journey.  </p>  <p>  \t       This class is about 54 mins long and moves pretty fast.  We have also included different AUDIO VERSION:  Special Bonus Audio Only version, not the same as the course.  </p>  <p>  \t       Terminology that will be used is very Adobe heavy, but we also include the fundamentals.  Fonts, Colors, Tones, Black and White, Feathers, Vertical and Horizontal.  </p>  <p>  \t       Looking for free logo design? Design Logo Fundamentals. Design process, Adobe Illustrator, Adobe Photoshop, Professional Design, Development, Flat Design, Adobe.  </p>  <p>  \t       Elevated courses are geared for you to understand not only what design is, but how to recognize great design and understand why it's great.  To clarify further this class walks you through the process of developing and designing a logo and doesn't focus just on the tools and little micro pieces of Adobe, it's more of the A-Z process of a professional as he walks you through how to set up each stage of the process.  The Process is covered very thoroughly.  </p>  <p>  \t       Why you should take this course?  </p>  <p>  \t   Lauren is very proficient in the skills that it takes to make and master a branded logo design.  We use a real world example and we are going to take this even further as we walk you through the process to creating the big brand down the road.  </p>  <p>  \t   Why Again?  </p>  <ul>  \t<li>Branding is a key element of design</li>  \t<li>Logo represents your company</li>  \t<li>Creating quality work as a professional is paramount </li>  \t<li>We teach you the process of black and white vs. color</li>  \t<li>Importance of vertical and Horizontal and many other aspects of branded logo design </li>  </ul>  <p>  \t   This Logo Design Fundamentals course is geared towards teaching you the different key components to creating and managing a logo for a company, it's more then just putting together some shapes, with font.  This is about identity and craftsmanship  </p>  <p>  \t   As well about details of the preparation it takes to turn your finished product over to your client a print shop.  If you are looking to make a career from your design or even brand identity, this course is perfect for you.   These important details can't go over looked and must be included in your final product.  From A-Zed we will push you ahead!  </p>  <p>  \t           Stay tuned for our Big Brand course, as we walk through in more detail the creation of a envelope, stationary, company business card and promotional card.  </p>  <p>  \t           Once again thank you for taking our course and engaging with our company.  </p>", 
    "end_date": null, 
    "title": "Logo Design Fundamentals ", 
    "price": 0, 
    "instructors": "Andrew Boehm", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/270454_23ec_5.jpg", 
    "course_url": "https://www.udemy.com/logo-design-fundamentals/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-28T19:18:13Z"
}