{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">THIS IS A GENUINE SKILLS TRAINING. IT IS A BRIEF COURSE, AND AFTER STUDYING IT YOU’LL EASILY SAVE MONEY DESIGNING YOUR BUSINESS LOGO EVEN IF YOU ARE DOING IT FOR THE FIRST TIME.</strong>  </p>  <p style=\"\">  \t            -0-0-0-0-0-0-  </p>  <p style=\"\">  \t            On an average I get offers to design about 3 logos every working day from local sources, making it 15 in a week. That's a good opportunity to make money on the side. However I cannot give more time because my main job is solving content needs for businesses.  </p>  <p style=\"\">  \t            I want to tell you that you too can create your business logo easily, and in less than an hour.  </p>  <p style=\"\">  \t            Now, you might say you’re not a designer. My answer is, that’s good. You can still create logos in just a few minutes, and you can make money as I do.  </p>  <p style=\"\">  \t            Why am I so confident? Because I too am NOT a designer. So, for this course, being a designer is not an issue really to create business logo.  </p>  <p style=\"\">  \t            The point is, with the tools available for use, any non-designer can create logo easily. And this is what I show you in this course.  </p>  <p style=\"\">  \t            The icing on the cake is, I also show you how to make stunning call-to-action or CTA buttons on the fly. As you learn my lessons, give yourself just half a day and create some 50 to 60 assorted ready-to-use CTA buttons. Now group them in a bundle and sell it at a throwaway price of just $3-5. You may be in for a surprise...making more money than logo designing.  </p>  <p style=\"\">  \t            Well, my courses are full of values, and completely devoid of any fluffy, time-wasting lessons. When you buy this course, you will exactly learn what I promise – creating awesome logos and CTA buttons in minutes.  </p>  <p style=\"\">  \t            All the best.  </p>  <p style=\"\">  \t            P.S. By the way, this course offers you 30-day unconditional money-back guarantee. You lose nothing if you think the course is not up to your expectations.  </p>  <p style=\"\">  \t<em style=\"\">Still waiting!</em>  </p>", 
    "end_date": null, 
    "title": "Logo Designing for Your Business in an Hour", 
    "price": "20.00", 
    "instructors": "Partha Bhattacharya", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385462_34ce.jpg", 
    "course_url": "https://www.udemy.com/logo-designing-side-business/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T07:20:42Z"
}