{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>You can make a name of an exotic animal with just 3 letters from the title of the course. So far no one has guessed it. If you can guess it, just send me message.</p><p>Who else wants to supercharge their logo design skills? </p><p>Here’s how to design and redesign Fortune 500 logos.</p>  <p>With this course you get a unique opportunity to<strong> learn what everybody ought to know about designing Fortune 500 logos </strong>.</p>  <p>Because inside you will find  amazing Illustrator techniques, that will let you:</p>    <li><strong>Recreate logos of companies like Chevron, Tesoro or Synnex… </strong></li><p><strong></strong></p>…and then make them better by following the best practices of modern logo design<p>trends.</p><ul><li><strong>Build confidence in your skills</strong></li></ul><p>Grab the tool and let your imagination guide you without feeling any stress, that you have insufficient skills to achieve a certain effect.</p><ul><li><strong>Grow as an independent designer</strong></li></ul>    <p>You can design logos just like the big names in the design and the advertising world from the comfort of your home.<br></p><ul><li><strong>Learn advanced Illustrator tools and techniques</strong></li></ul><p>Gradient Mesh, 3d, envelope distort...Learn everything, that will allow you to design a logo you can be proud of .</p>      <p>Give yourself the opportunity to learn the practical skills required to design big brands’ logos and get a sense of what it feels like to improve logos that Fortune 500 companies spend 6 figures on.<br></p>  <p>This course is for those who have at least basic Illustrator skills. If you are looking for explanations of how Illustrator’s tools work, you won’t find them here. You will find them in my fundamentals course.</p>  <p>Just a few hours of your time give you a chance of jumping on a next design level, ‘cause if you are familiar with my teaching method, you can be sure that it’s simplicity at its best.</p><p><strong>No decoys, no frills. Just the practical\nskills.</strong><strong></strong><br></p>  <p>But you don’t have to take my word for it. Look at what other people are saying about my courses:</p><p><em>“As a complete beginner to Illustrator, this was a great course to help me quickly get started learning useful techniques in Illustrator and designing flat icons immediately. Builds confidence in being able to design flat icons independently!”</em></p><p><em>“Wow, incredible. Instructor has a easy to follow style, keeps it simple and practical. Great video, I will be take his other courses too. I'd give it a triple thumbs up! Looking forward to more videos. Highly recommended!”</em></p><p>I vouch for this course, but <strong>you are free to get your money back within 30-days</strong>, should you dislike it for any reason.</p><p>No questions asked. No sad faces.</p>  <p>So it’s really your call now. If you want to make it big in the design world, you can start big.</p>  <p>Enroll in the course and learn the practical skills required to design big brands’ logos.</p>  <p>See you inside.</p>  <p>Dawid</p>", 
    "end_date": null, 
    "title": "Logo Design : How To Design Fortune 500 Logo in Illustrator", 
    "price": "20.00", 
    "instructors": "Adobe Certified Expert Dawid Tuminski", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737642_56be_3.jpg", 
    "course_url": "https://www.udemy.com/logo-logo-design-logos-logo-maker-graphic-design-logo-creator/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T07:30:30Z"
}