{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn how to achieve the popular \"low poly\" and geodesic style in your illustrations that can only be achieved through this methodology. There are no 'apps' or substitutes for creating this kind of look and this course will teach you how to create it for yourself!</p><p><strong>Content and Overview</strong></p><p>This course is intended for all skill levels and is focused on using the tools specifically need to accomplish a low poly look that is popular to many game aesthetics and print illustrations.</p><p>Each of the 5 videos will guide you through a single step of the process and will finish with a final video to make the final illustration shine.</p><p>Completing this course will give you a new skill in your toolkit to apply to future projects.</p><p><strong>What are the requirements?</strong></p><ul><li>Software: Illustrator and Photoshop both have 30-day free trials on Adobe's website</li><li>Hardware: *Not required but it's recommended to have a Wacom tablet</li></ul><ul><br></ul><p><strong>What am I going to get from this course?</strong></p><ul><li>Clear and concise 41 minutes of instruction from award winning artist</li><li>Greater understanding of Adobe Illustrator and Adobe Photoshop</li><li>Learn time-saving shortcuts that will cut hours off your time spent</li><li>Learn a toolset of skills to apply the low poly look for future projects</li></ul>", 
    "end_date": null, 
    "title": "Low Poly Portrait Illustration", 
    "price": "20.00", 
    "instructors": "Lucas Ridley", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570188_0010_5.jpg", 
    "course_url": "https://www.udemy.com/low-poly-portrait-illustration/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T14:35:28Z"
}