{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<br><p><strong>Don't just learn how to design a logo, make a living from it and be a freelance Logo Designer now!</strong> This course will teach you a new skill that you can use for the rest of your life. I won't stop helping you until you become a Logo Designer and making at least $1000 a month. <strong>JOIN THE TOP LOGO DESIGN COURSE ON UDEMY.</strong>\n\n</p><p>__________________________________________________________________________________________________________</p>\n\n<p><strong></strong>\"This is definitely a great course about logo design. The instructor will teach you how to design and help you to get a career. Jestoni will teach you from ground up. He would show you how to design a logo from start to finish and giving you the best idea what's working and not. Also he updates the course every week. Worth every penny.\" <em><strong>- Nathan Lee</strong></em></p>\n\n<p><em></em>___________________________________________________________________________________________________________</p>\n\n<p>  \t<strong>From Zero to Hero. Start with no knowledge of design, finish with new skill in hand. </strong>At the end of the course you will be able to design any types of logos and make money as a certified<strong> Freelance Logo Designer. </strong>  </p>\n\n<p>  \t                      Do you want to earn some extra money? Are you looking for another career and would like to work from home?  </p>\n\n<p>  \t                      This course is designed to teach you about logo design and <strong>how to earn money from doing simple designs</strong>. In this course you will learn<strong> not only about doing logos but also how to make a career as freelance designer</strong>. I will teach you how to maximize your talent and build your confidence.  </p>\n\n<p>________________________________________________________________________</p>\n\n<p>\"Jestoni is very generous with his time as he continues to work on the course and answers questions that his students leave. He's very knowledgeable about the subject and has the entire process of creating logo's down to a science. He also shows you by example and why it works\".<em><strong>- Francisca Roele</strong></em></p>\n\n<p><em><strong></strong></em><em>________________________________________________________________________</em></p>\n\n<p>In this wonderful journey I will show the ways how to <strong>generate an income as a designer</strong>. There are courses teaching you how to do logo design but after that you wouldn't know how to get a real world projects.<strong> This course will help you get started in designing and make some real money</strong>. I want you to apply all the knowledge you learned in real world projects.</p>\n\n<p>  \t<strong>Prepare Yourself for a New Career in Logo Designing by Learning New Skills.</strong>  </p>\n\n<ul>  \t<li>You Will Learn How to Use Adobe Illustrator in simple ways.</li><li>Design Any Types of Logos</li>  \t<li>You Will Learn how to Design Good logos from Scratch.</li>  \t<li>Finding Freelance Logo Design Projects.</li>  \t<li>Tips on How to Win Logo Design Projects.</li>  </ul>\n\n<p>  \t                    The skills that I'm going to teach you in this course are so valuable that will help you grow as a designer. A talent that will last a lifetime. Talent in designing is not inborn. <strong>Everybody can learn how to design</strong>.  </p>\n\n<p>  \t<strong>This course will guide you from basics of logo design. You don't need any background in designing because I will show you the right and proper way in designing a kickass logo</strong>.  </p>\n\n<p>  \t                    The exercises in Adobe Illustrator are so easy. I designed them for absolute beginner because I don't want to confuse you with so many tools. All you need is a basic knowledge of the program so you can design more complex logos and illustrations in the future.  </p>\n\n<p>  \t                    I started from nothing now I'm a logo designer. I wish there was a course like this before. In this course I will share everything I know in logo designing and making money from doing designs. If you're ready see you in the course.  </p>", 
    "end_date": null, 
    "title": "Make Passive Income: Be A Logo Designer & Work From Home", 
    "price": "30.00", 
    "instructors": "Jestoni Esteban", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413713_24d1_3.jpg", 
    "course_url": "https://www.udemy.com/make-passive-income-be-a-logo-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T01:44:54Z"
}