{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course will show you the step by step procedure on how to make great designs without having to use expensive software such as PhotoShop. Make a poster, promotional flyer or a wedding invitation. Just by using PowerPoint<br><br><strong>Time is money:</strong><br>In todays' life it can be difficult to schedule in time for learning new skills. In order for you to finish this course successfully, I created a selection of high quality video's that are <em>well structured </em>and <em>to the point. </em>Within one hour you will learn all the fundamental basics, as well advanced features such as how to remove a background of an image. </p><p><strong>Outcome:</strong><br>By the end of the course you will be able to make your own designs with the \"wow!\" effect that all designers are aiming for. Most people will think you made your designs in Photoshop.</p><strong>Why use PowerPoint instead of any other designing programs?</strong><br> Learning new programs such as Photoshop can be stressful, time consuming and costly. <br> PowerPoint offers an excellent alternative that is:<ul><li>Free (or at least easy accessible for low costs)</li><li> User friendly</li><li> Easy to learn</li><li> Time efficient</li></ul><p><strong><br>Purpose:<br></strong>Being creative should be accessible to everyone and this course will enable beginners to explore their creative bone. My motto is: <em>\"Good ideas are put on paper, while great ideas are put in motion''.</em></p>", 
    "end_date": null, 
    "title": "Make great designs within one hour", 
    "price": "30.00", 
    "instructors": "Fenna Kooijmans", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622122_1fe6_2.jpg", 
    "course_url": "https://www.udemy.com/design-in-powerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-25T11:10:47Z"
}