{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<em>Mash-up: Where pencil meets pixels</em> guides you through a fun  and engaging digital art project where you will learn how to enhance  your traditional art into a digital masterpiece that you can share with  friends &amp; family, your social media circles-everyone! Enrolling in  this easy-to-follow class will inspire you to create a wide range of  digital mixed-media pieces using stock photography, custom brushes,  textured backgrounds and your own photos and artwork.  </p>  <p>  \t      Using traditional art materials, a scanner and Photoshop, you will learn how to: · <strong>Develop a beginning to intermediate photoshop skillset </strong>by enrolling in an entertaining class project, not by reading a boring how-to manual  </p>  <p>  \t      · <strong>Manipulate scanned images</strong> by adding color, texture and text using Photoshop  · <strong>Emulate the look of oil, pastel or watercolor</strong>  as it appears in traditional art, creating your own custom brushes in  Photoshop, to give your art project a personalized look and feel. · <strong>Digitally compose</strong> your work using Photoshop layers, masks, clipping paths · <strong>Add “wow” to your work</strong> using various Photoshop effects and filters  Whether you are a mixed-media artist, graphic designer, illustrator, photographer, or just love to be creative…<em>Mash-up: Where pencil meets pixels </em>is for you!  </p>", 
    "end_date": null, 
    "title": "Mashup - Transform a scanned sketch into a digital painting", 
    "price": "20.00", 
    "instructors": "Jami Odell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/148982_9594_3.jpg", 
    "course_url": "https://www.udemy.com/mashup-transform-a-scanned-sketch-into-a-digital-painting/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-19T01:29:35Z"
}