{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  This course is going to teach you everything you need to know about Manga Studio 5, so you can create your comics, manga, concept art, or digital paintings in less time. After all that is why digital art programs exist. We can work faster. But unlike Photoshop, Manga Studio 5 is cheaper, starting at $38 on Amazon. I also exclusively use it for my artwork now after 17+ years of using Photoshop.  </p>  <p style=\"\">  \t  You will learn all the tools and sub-tool settings.  </p>  <p style=\"\">  \t  How to customize the interface, move windows, etc.  </p>  <p style=\"\">  \t  How to use the color wheels and custom colors.  </p>  <p style=\"\">  \t  How to create layers and even use overlay layers.  </p>  <p style=\"\">  \t  You will learn drop down items like the warp tool.  </p>  <p style=\"\">  \t  You will even learn how to use the built in 3d characters to use as references.  </p>  <p style=\"\">  \t  As bonuses, you will learn to ink, color, and even digital paint with Manga Studio 5.  </p>  <p style=\"\">  \t  Don’t decide now if you want the course; simply look to the right and click free preview to watch 10 minutes of lessons. You can click any lesson to watch, and stop watching. You get 10 free minutes to browse and watch what you want in this course. I’m sure you will love it and decide to buy.  </p>", 
    "end_date": null, 
    "title": "Master Manga Studio 5: Bonus Drawing and Painting", 
    "price": "20.00", 
    "instructors": "Neil Fontaine", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/349586_905b.jpg", 
    "course_url": "https://www.udemy.com/master-manga-studio-5/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T13:57:29Z"
}