{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Welcome to <strong>Mastering Shapes in Adobe Photoshop CC</strong> <strong>+10 Real-World Projects</strong></p><p>Photoshop is a hybrid application that gives you great control over photographic Raster images, and seamlessly combines pixel data with the elegance and form of artistic vector shapes.</p><p><strong>In This Course We Focus on the VECTOR Side of Adobe Photoshop CC.</strong><br></p>  <p>Even many Photoshop professional users don’t aware of the power of Photoshop in creating Vector based Artworks. So they don’t use these precious and elegant royal features of Photoshop OR they go for some vector based applications just for the features that already is available in Photoshop.</p>  <p><strong>What you will learn Over 6 Chapters:</strong></p><ul><li>Chapter 1: Introduction: You will learn about what the course is about? and setting the Photoshop Prepare for the course.</li><li>Chapter 2: Meeting Shapes: You will learn all the Shape Tools from the Ground Up.</li><li>Chapter 3: Dive into Shapes: You will learn how to Edit and Modify Shapes to gain the best Results.</li><li>Chapter 4: Meeting the Pen Tool: You will learn what is the pen tool? What are Anchors? how to create and Modify the anchors? How to Convert Anchors?</li><li>Chapter 5: More Custom Shapes: You will learn how to extend your Custom Shapes Library by Creating your own versions of Shapes.</li><li>Chapter 6: Real-World Projects: You will Learn How to put your Learning into Practice to do real world Projects.</li></ul>    <p><strong>There are lots of tips and notes for you, even you are working with Photoshop professionally.</strong></p>    <p>At the end of each Chapter I’ve set an exercise for you; to do it by yourself and send your exercise back to me and give your Score, also my notes and corrections on your exercises.</p>  <p><strong>I end up this course with more than 10 real world examples of using these Photoshop Features.</strong></p>  <p>Have fun, and enjoy the course…</p>", 
    "end_date": null, 
    "title": "Mastering Shapes in Adobe Photoshop CC +10 Projects", 
    "price": "20.00", 
    "instructors": "Mehdi Jangjou", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709652_16e9_4.jpg", 
    "course_url": "https://www.udemy.com/mastering-shapes-in-adobe-photoshop-cc-10-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T13:53:43Z"
}