{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn the basic concepts, tools, and functions that you will need to build fully functional Logos with the popular Inkscape vector art tool.</p><p><strong>Build a strong foundation in Logo Designing with this tutorial for beginners.</strong></p><ul><li>Getting Started With Inkscape Logo design</li><li>Understanding User Interface and Components</li><li>Creating Example Logos Immediately</li><li>Build Practical Logos From Famous Companies</li></ul><p><strong>A Powerful Skill at Your Fingertips </strong><br>Learning the fundamentals of Logo Designing puts a powerful and very useful tool at your fingertips. Inkscape is free, easy to learn, has excellent documentation, and is the base for creating professional Logos without much effort.</p><p>Jobs in Logo Design are plentiful, and being able to learn Inkscape will give you a strong background to more easily pick up other Logo Designing tools.</p><p><strong>Content and Overview </strong><br><br>Suitable for Everyone, through this course of 5 lectures and 1 hour of content, you’ll learn all of the Inkscape Logo Design Fundamentals and establish a strong understanding of the concept behind Logo Design. Each chapter closes with building a complete logo, putting your new learned skills into practice immediately.</p><p>Starting with downloading and installing Inkscape, this course will take you through various Inkscape features and how to use them. By creating Logos, you’ll a establish a strong understanding of Logo Design process.</p><p>Students completing the course will have the knowledge to design beautiful logos in minutes.</p><p>You’ll be able to work alongside the author as you work through each concept, and will receive a verifiable certificate of completion upon finishing the course.</p>", 
    "end_date": null, 
    "title": "Master Logo Design : Design 5 Example Logos", 
    "price": "20.00", 
    "instructors": "Raja Biswas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750934_e617_2.jpg", 
    "course_url": "https://www.udemy.com/logo-design-inkscape/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T06:43:55Z"
}