{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Have you ever googled flat design, looked at the fantastic flat design images and thought to yourself: Man, I wish I could do that…</p><p>Well, with my teaching method, you absolutely can.</p><p>This is what one of my students, Ioannis Tsiakos, had to say about one of my courses:</p><p><em>I learnt more in one hour watching this course, than i would have if I had spent days reading online tutorials. Super easy to follow and great examples/ cases that illustrate how illustrator works and how designers think</em> <em>(...). Recommended!</em><br></p><p>Flat design is the hottest trend in the design world right now and with this course you can get your piece of the flat design pie.</p><p>Take a look at just a bit of proven flat design skills you will find inside:</p><ul><li> This course is\nnot a new content, but it’s all the smaller courses from the Most wanted flat\ndesign techniques series brought together. So inside you will find the desert\nisland, office space and hipster businessman courses packed together. This should\nsatisfy even the hungriest flat design wannabes.</li><li>Experience the fun and straight to the point approach: feel your Illustrator and flat design skills grow immediately</li><li>Step-by-step process: direct, well-paced and actionable techniques with no unwanted space in the tutorials</li></ul><p>Join the group of the best designers out there and start creating your own, spectacular flat designs.</p><p>Quickly learn powerful and proven Illustrator techniques to jump from the beginner to the advanced level.</p><p>And don’t forget, that what you get is a<br><strong>30-day money back guarantee<br></strong>So the risk is really on me.</p><p>Enroll in the course and find out what it feels like to become a flat design superstar.</p><p>See you inside!<br>Dawid</p>", 
    "end_date": null, 
    "title": "Most Wanted Flat Design Techniques", 
    "price": "20.00", 
    "instructors": "Adobe Certified Expert Dawid Tuminski", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792232_9086_2.jpg", 
    "course_url": "https://www.udemy.com/flat-design-flat-ui-design-flat-colors-flat-design-illustrator/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T10:51:13Z"
}