{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong style=\"\">Canva</strong> is a free graphic-design tool website. The company was founded January 1, 2012 in Australia. The website rapidly became popular, with more than 750,000 users in its first year alone. Social-media and technology expert Guy Kawasaki joined the company as chief evangelist in April 2014.</p><p>Canva has an easy to use <strong style=\"\">drag-and-drop interface</strong> and provides access to over a million photographs, graphics, and fonts.  It is used by non-designers as well as professionals.  The tools can be used for both web and print media design and graphics.</p><p>Students can expect to learn:</p><ul style=\"\"><li>How to use Canva to design quality graphics to sale</li><li>How to update Facebook Cover Images, Twitter, Youtube Art, Instagram Cover, and more</li><li>How to design an EBook Cover using Canva for Kindle and others</li><li>How to use Canva on a daily basis as a Designer for earning revenue</li><li>How to design quality graphics for blog post images</li><li>How to design a Logo Header for quality Sites</li></ul><p></p><p>The company has grown its user base to <strong style=\"\">2.3 million users</strong> over the course of the past 20 months. Over the last six months in particular, Canva&#039;s growth has been surging, with 65 percent of users signing up during the past six months.</p><p>Canva&#039;s users are heavily engaged as well, having created <strong style=\"\">3.2 million designs</strong> in the last month alone, and are crafting new designs at a rate of one design every second. To give you an idea about what users are building with this service, this year alone, <strong style=\"\">users have created 1,398,955 Facebook posts, 1,326,195 social media graphics, 1,023,789 posters, and 867,684 presentations.</strong></p>", 
    "end_date": null, 
    "title": "Most Powerful Designer Tool For Earning Revenue", 
    "price": 0, 
    "instructors": "Mitch Stevens", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552622_a23b_2.jpg", 
    "course_url": "https://www.udemy.com/canva-designer-tools/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T17:30:53Z"
}