{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This is an introduction to learning to draw Perspective. In this very in-depth course you will start from absolute beginner and complete it with the knowledge and confidence to successfully draw in perspective. Learning lineal perspective will enhance not only your own work but give you a solid base to in any other online course or book etc. There is no \"Quick fix\" or Short cuts to perspective drawing. It requires work. It's fun work and I'm going to be with you every step of the way.</p><ul><li>You will learn solid perspective techniques to make amazing art</li><li>You will be able to think like an artist and be a problem solver</li><li>This is for those that are serious about improving art</li><li>No software is needed for this course</li><li>Keep and open mind and there is no time limit , work at your own pace.</li></ul><p><strong>Who this course is for :</strong></p><ul><li>Any beginner who wants to learn how to draw perspective  </li><li>Art students (traditional and non traditional and self taught)</li><li>Traditional artists who want to incorperate more perspective to their work.</li><li>Graphic designers who want to learn how to draw perspective.</li><li>Anyone who wants to make their own game, graphic novel or illustrations</li></ul><p><strong>What this course is NOT</strong></p><ul><li><strong></strong>Not a \"Speedpainting\" course</li><li>Not a series of \"Shortcuts\"</li><li>Not a \"Watch me draw\" type of course</li><li>Not a \"magic wand\" for drawing perspective (You have to put in the work)</li><li>Not specific to any one piece of software as it is not required (Any art software of your choice will do)</li></ul><p><strong>PLEASE BE AWARE: </strong><strong>*There are no subtitles or closed captions for this course at this time.</strong></p><p>I hope you will join me and allow me to be your professional guide on your art journeyinto the world of drawing in perspective.</p>", 
    "end_date": null, 
    "title": "Perspective Drawing 101: Perspective Made Easy ", 
    "price": "20.00", 
    "instructors": "Rich Graysonn", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/231970_fc09_2.jpg", 
    "course_url": "https://www.udemy.com/perspective-drawing-101/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-28T15:41:57Z"
}