{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course will teach you how to get up to speed quickly in Adobe Photoshop as you learn fundamental digital sketching techniques. It's made with absolute beginners in mind both to sketching as well as the Photoshop software. And if you already know how to sketch and are trying to transition to Photoshop then this course is a great quickstart introduction.</p><p><strong>Build Confidence As You Harness the Power of Digital Sketching in Photoshop</strong><br></p><ul><li>Create an Adobe CC account and install Photoshop</li><li>Find the best graphics tablet for your needs and configure it for success</li><li>Discover how the Photoshop interface is laid out</li><li>Learn how to practice building your muscle memory for confident line work</li><li>Learn quick tips on how to approach a complex subject and make it managable</li></ul><p><span style=\"\"><strong>Discover Proven Methods for Improving Your Digital Sketching Abilities</strong><br></span></p><p><span style=\"\">Sketching is the ability to simplify an idea and communicate it by using lines on a page. When you learn how to sketch it opens up doors creatively and gives you more freedom to explore as you develop your own ideas. Whether your preparing for a career as a concept artist, a digital illustrator, or just want to explore Photoshop for your own projects digital sketching is your key to achieving these goals.</span></p><p><span style=\"\">In this course I'll show you how to find your way around the Photoshop UI and then we'll walk through three practice sessions as I deliver some key advice I've learned while using Photoshop professionally in my own career. We'll start with a simple exercise using tracing techniques for developing your line work. Then we'll move on to contouring techniques as I show you how to maintain proper proportions in your sketches. Finally we'll explore some drawing through techniques as I show you how to tackle difficult subjects by simplifying them into three dimensional forms using linear perspective techniques.</span></p><p><span style=\"\"><strong>Don't forget the downloadable resources!</strong></span></p><p><span style=\"\">Also included in this course is a selection of all the material covered in Photoshop, a quick printout reference sheet for the Photoshop interface and keyboard shortcuts, as well as some bonus photos you can use to hone your newly learned digital skills. At just under an hour long this course is short, to the point, and too good to pass up. So enroll today and learn how to get sketching fast!</span></p>", 
    "end_date": null, 
    "title": "Photoshop Quickstart Guide to Digital Sketching", 
    "price": "20.00", 
    "instructors": "Brandon Hix", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559204_c66e_3.jpg", 
    "course_url": "https://www.udemy.com/photoshop-quickstart-guide-to-digital-sketching/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T06:51:48Z"
}