{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>Why pay someone to create a cover for you when you can do it yourself, over and over again.</strong>  </p>  <p>  \t  If you have ever thought about writing an eBook or have already written one, you know having a killer eBook cover is very important. eBook covers make or break the life of an eBook. Unfortunately, the adage d<em>on't judge a book by its cover</em> doesn't work online. <strong>Buyers browsing through the Amazon Kindle, Apple iBook, or Google Play stores first and foremost judge a book by its cover. </strong>  </p>  <p>  \t  Your eBook cover has to stand out from the hundreds of other books online. This takes a lot of skill and knowledge of not only design but marketing. <strong>In this course, you'll learn how to make a cover that stands out, gets more clicks, and more sales.</strong>  </p>  <p>  \t<strong>Learn from two great instructors! </strong>I teach thousands of students online who love my courses. Just check out all the reviews to my other courses. I have brought in another instructor from the UK to co-teach this course.  </p>  <p>  \t  Amy from the UK is a professional graphic designer with a knack for teaching online. She'll take us through some basic graphic design theory, teach eBook cover research and theory, and give us her top 10 tips on creating an awesome eBook cover.  </p>  <p>  \t  This course will have demonstrations and follow-along tutorials so you can easily learn how to make an eBook in Photoshop. Follow along with me as I create my own eBook cover for my eBook <em>Diary of a Film Student</em>.  </p>  <p>  \t<strong>Some of the other highlights of this course include:</strong>  </p>  <p>  \t  ✓ Learning Photoshop basics for non-designers  </p>  <p>  \t  ✓ How to get <strong>Photoshop for FREE</strong>  </p>  <p>  \t  ✓ Designing for a purpose and for the thumbnail version  </p>  <p>  \t  ✓ Learning the different formats and sizes for all online eBook publishers  </p>  <p>  \t  ✓ <strong>Photoshop templates available for download</strong>  </p>  <p>  \t  ✓ Follow Amy in real time as she creates an eBook cover  </p>  <p>  \t  ✓ Saving your eBook cover in the proper format for upload  </p>  <p>  \t  ✓ <strong>…and so much more!!</strong>  </p>  <p>  \t  Please let me know if you have any questions or are hesitant to take the course. I'd be happy to let you pick my brain. I hope to see you inside! Have a beautiful day!</p>", 
    "end_date": null, 
    "title": "Photoshop Course: Design an Amazon eBook Cover in Photoshop", 
    "price": "20.00", 
    "instructors": "Phil Ebiner", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47004_c3c9_6.jpg", 
    "course_url": "https://www.udemy.com/ebook-cover-design/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-22T18:32:38Z"
}