{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t        In order to be competitive as a graphic designer, you need to know Photoshop.  </p>  <p style=\"\">  \t         Photoshop freelancers can command fees of<strong style=\"\"> $100 / hour </strong>and yet it is an intuitive, easy-to-learn application.  </p>  <p style=\"\">  \t         My name’s Rob Cubbon, and I’ve been using Photoshop <em style=\"\">for over 2 decades</em>.  </p>  <p style=\"\">  \t         I want to share with you the best techniques I learned in that time as they’re what you’ll find most useful in real world, hands-on graphic and web design situations. And <strong style=\"\">all the Photoshop documents (PSDs) used in the course are available for download</strong>.  </p>  <p style=\"\">  \t         I’ll show you:  </p>  <ul style=\"\">  \t<li style=\"\">techniques for improving landscape photography</li>  \t<li style=\"\">how to create three dimensional graphics from 2 dimensional photos</li>  \t<li style=\"\">how to extend images</li>  \t<li style=\"\">how to make selections in images with channels to create interesting effects</li>  \t<li style=\"\">how to improve portrait photography, how to cut out and create montages</li>  \t<li style=\"\">how to smooth a model&#039;s skin</li>  \t<li style=\"\">how to create effect with text and typography</li>  \t<li style=\"\">how to create images specifically for social media</li>  \t<li style=\"\">how to create images specifically for web</li>  \t<li style=\"\">how to use guides, to align and distribute objects within an image</li>  \t<li style=\"\">how to stylise images to maximise their impact</li>  \t<li style=\"\">all about selections, layers, channels and paths</li>  \t<li style=\"\">knowledge about file size, resolution and color mode</li>  </ul>  <p style=\"\">  \t         all this I’ll show you using features that are available in all recent versions of Photoshop (from early Creative Suite versions right up to today’s Creative Cloud).  </p>  <p style=\"\">  \t         I’ll show you the short cuts and keystrokes in Mac and PC while I perform these techniques so you can start working like a professional today  </p>  <p style=\"\">  \t         and I’ll also explain the technicalities behind file size, resolution and colour modes so you will always supply the correct finished product for all the Photoshop work you do in the future.  </p>  <p style=\"\">  \t         Photoshop is my favourite design tool and I want to show you how much fun it is to use.  </p>", 
    "end_date": null, 
    "title": "Photoshop: Real World Hands-on Freelance Mastery", 
    "price": "30.00", 
    "instructors": "Rob Cubbon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/269082_857c_4.jpg", 
    "course_url": "https://www.udemy.com/photoshop-real-world-hands-on-graphic-and-web-design/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-26T11:30:33Z"
}