{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p> <strong class=\"redactor-inline-converted\"><em>\"</em></strong><strong class=\"redactor-inline-converted\"><em>I'm not afraid of Photoshop anymore.</em> </strong><em>Thank you Kristen for making Photoshop less scary, for showing me practical ways I can help myself and also for introducing me to Gimp (gotta love freeware, particularly when it's so powerful.) Before seeing this I always assumed that adjusting images was something for professionals (flash back to a Photoshop course I took last century... I'm still recovering.) But these hacks are a great help. I love your presentation style: warm, approachable, humorous, informative. You've given me the tools and confidence I need to be able to stand on my own feet. Thank you.\"</em> -Jacqueline Seidel</p>\n\n<p><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\"><br></strong></strong></p>\n\n\n\n\n\n<p><strong>Are you ready to take charge and learn simple, quick, and efficient methods for creating and editing powerful images for print and the web?</strong></p>\n\n\n\n\n\n<p>Whether you are an employee, business owner, content creator, teacher, author, or social media maven, over the last few years it has become CRUCIAL to know how to do a little bit of everything online. With this course as your guide, you'll learn how to confidentially and professionally manage your OWN unique, original images for your website, blog, eCourse, eBook, presentations, or social media pages.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Save time, money, and sanity by learning how to finally choose, edit, and enhance your own images without having to always pay someone else</strong><strong class=\"redactor-inline-converted\"> to do the most basic but essential tasks  for you.</strong></p>\n\n\n\n\n\n<p>This course was created especially for complete beginners as well as people who fight with technology who want to gain new and valuable image editing skills that can be used every day.</p>\n\n<p>The techniques discussed in this course are <em>software independent,</em> meaning<strong class=\"redactor-inline-converted\"> I can show you how to make better, more professional images regardless of which software programs you are using.</strong> You'll learn essential imaging do's and don'ts, tips about which images are safe to use regarding copyrights, how to properly save your images (so you don't lose them in the abyss,) and my very favorite \"art school\" hacks that will help take your images from so-so to PRO in no time even if you don't yet have Photoshop or Gimp.</p>\n\n\n\n<p><br></p>\n\n\n\n<p>We'll then go through the most basic but important imaging skills you NEED to know from the very beginning using <strong class=\"redactor-inline-converted\">Adobe Photoshop</strong>. Free 30 day trials of <em>Photoshop</em> are available from Adobe's website. I also show you the same imaging techniques in the FREE software program <strong class=\"redactor-inline-converted\">GIMP</strong>.</p>\n\n\n\n\n\n<p>You can watch and follow along with me as I show you how to make the most useful and essential image fixes in whichever program you have or feel most comfortable in. If you ever decide to switch, <em>you'll have all the lessons available to you in BOTH Photoshop and GIMP as one go-to resource</em>.<br></p>\n\n\n\n<p>.</p>\n\n\n\n\n\n<p>I'm a tenured Associate Professor of Digital Media and the Program Director of Film &amp; Digital Media at The American University of Rome and a practicing award-winning multimedia artist.</p>\n\n\n\n\n\n<p>I have 15+ years of experience teaching students all over the world using my tried and true custom approach (turning complex information into something simple, memorable, easy-to-understand in as short amount of time as possible) to ensure that you get the most important, relevant, and useful information that can be applied immediately to your art, work, and everyday life.</p>\n\n\n\n\n\n<p>New bonus lectures and Photoshop | GIMP resources will continue to be added and timely design advice will be provided in the discussion forum. I love to help and always respond to inquiries and discussions ASAP.  </p>\n\n\n\n\n\n<p>  <br></p>\n\n\n\n<p> <strong class=\"redactor-inline-converted\">Please Note: All students who enroll in this course also will receive periodic free and discounted access to my other top-rated current and upcoming courses.</strong> </p>\n\n\n\n\n\n<p> You have a 30-day, 100% money-back guarantee with no questions asked so you have nothing to lose. I make myself available so you will have access to me if you have questions or need specific feedback along the way. </p>\n\n\n\n\n\n<p>  Empower yourself now by enrolling in this course and join our growing learning community!<strong class=\"redactor-inline-converted\"> Click the \"Take This Course\" button in the upper right corner and let's get started building your new digital imaging, software, and design skills today.</strong></p>", 
    "end_date": null, 
    "title": "Photoshop | GIMP: Quick & Easy Image Hacks for Beginners", 
    "price": "25.00", 
    "instructors": "Kristen Palana", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447210_07b8_6.jpg", 
    "course_url": "https://www.udemy.com/photoshop-gimp-spotlight-top-image-hacks-you-need-to-know/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-14T12:48:18Z"
}