{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">This online course will teach you how to use Adobe Photoshop to create <em>PRACTICAL</em> <em>REAL WORLD</em> projects for your business or brand.</strong></p>\n\n<ul><li>Do you want to create your own graphics for social media or the internet, but don't know where to begin?</li><li>Have you spent time and energy Googling Photoshop tutorials online only to find out that it never covers exactly what you need?</li><li>Is outsourcing your graphics to a 3rd party a hassle, especially when you have to go back and forth to make changes before the project is completed?</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>If you answered yes to any of these questions, you're in the right place! </strong></p>\n\n<p>We know that it can be frustrating and time consuming to create artwork for your business. You can spend hours or even days trying to find the right tutorial online. Outsourcing the work can be an even bigger challenge just to find the right candidate to do what you need done, and expensive!</p>\n\n<p><strong>That's why we created this course - to teach people just like you how to easily get started with Photoshop.</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>Phil Ebiner and Jeremy Deighan <strong class=\"redactor-inline-converted\">have been using Adobe Photoshop for years to grow their business </strong>and have developed a system to allow you to learn just what you need to know, only when you need it. </p>\n\n<p><strong>Have fun while learning! </strong><strong>Learn by actually doing!</strong></p>\n\n<p>After enrolling in this course, you'll be taken through 11 projects you'll need to run your business. Follow along and practice while learning!</p>\n\n<p><strong>Downloadable project files make it easy to follow along and practice.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>The best part about a course like this is that you won't waste time learning tools and functions inside of Photoshop that you will never use. Most courses will tell you about every little part of the program, which is daunting to most people. </p>\n\n<p><em class=\"redactor-inline-converted\">Photoshop for Entrepreneurs</em> will show you the necessary tools as you apply them.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course Projects You'll Learn How to Create:</strong></p>\n\n\n\n\n\n\n\n<ol><li>Create a Social Media Graphic (this first lesson is free to watch with no purchase necessary)</li><li>Create a YouTube Thumbnail</li><li>Design a Product Mockup</li><li>Create Social Media Channel Art</li><li>Improve Your Profile Picture with Beauty Retouching</li><li>Design a Simple Logo in Photoshop</li><li>Web Design Mockup in Photoshop</li><li>Edit Photos to Make Them Look Better</li><li>Design an Infographic in Photoshop</li><li>Create an Animated GIF</li><li>Object Removal in Photoshop</li></ol>\n\n\n\n\n\n<p>Whether you just want to enhance your Photoshop skills for business, or have a specific project you need done right this instant, this course is for you. We will guide you every step of the way and are here to make sure you succeed in your ventures. Both instructors are always available to answer any messages, discussions, questions, or feedback that you have.</p>\n\n<p><strong>Get a Certificate of Completion when you finish the course!</strong></p>\n\n<p>With our 30-Day 100% money back guarantee, there's no reason hesitate!</p>\n\n<p><strong>ENROLL NOW!</strong><br></p>", 
    "end_date": null, 
    "title": "Photoshop for Entrepreneurs - Design 11 Practical Projects", 
    "price": "20.00", 
    "instructors": "Phil Ebiner, Jeremy Deighan", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/820194_d478.jpg", 
    "course_url": "https://www.udemy.com/photoshop-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-12T19:33:09Z"
}