{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Photoshop Painting </strong>is fun and relatively easy.  Follow along with me and I will show you exactly how to create your first Photoshop portrait using a pen tablet (Wacom or equivalent).  </p>  <p style=\"\">  \t    *NOTES:  </p>  <ul style=\"\">  \t<li style=\"\">The current price is an introductory rate, and will go up as more lectures are added.</li>  \t<li style=\"\">More technique videos are coming soon</li>  \t<li style=\"\">You do not need to know Photoshop to take this course.  I will quickly cover the basics before moving into more advanced information.</li>  \t<li style=\"\">***30 Day Money Back Guarantee***  No questions asked.  If you hate the class, just return it.  No risk.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">What You Will Learn</strong>  </p>  <p style=\"\">  \t          By the end of this course you will feel comfortable painting in Photoshop using various different techniques.  You will also have a good understanding of PS tools and workflows in general.  Specifically, I will be demonstrating how to paint a simple &quot;watercolor&quot; portrait from start to finish, but along the way you will pick up on many other techniques that will help you to feel comfortable coming up with your own unique creations.  I also discuss techniques for different kinds of paint like oil and acrylic.   The course is meant to give you a comprehensive introduction to digital painting while following along with my project.  </p>  <p style=\"\">  \t<strong style=\"\">Course Structure</strong>  </p>  <ul style=\"\">  \t<li style=\"\">In this course we will start from the beginning, for those of you who are not familiar with PS.  I will go over the UI basics, show how to download PS if you need to, and go over which pen tablet is best for you.  There is a link to a fantastic buyers guide if you don&#039;t already have a pen tablet input device (They are absolutely necessary to do any serious painting in PS.  Cost: $30 - $500 -- cheap ones work fine for this course). </li>  \t<li style=\"\">  Next I will show you the basic techniques of mimicking different kinds of paint, and continue to teach you about the various tools in PS and how to use them.  </li>  \t<li style=\"\">The next section will go over how to setup our file and our layers in order to be ready for painting.  By this point we will also have our custom brushes ready, and our UI optimized for painting.</li>  \t<li style=\"\">Finally, we will start laying down some paint on our digital &quot;canvas&quot;.  You will watch me paint in real time while I explain my thought process and the PS tools that I am using.  I will also throw in some time lapse video of me painting, so you can see the entire process.</li>  \t<li style=\"\">To finish of the course, you will be instructed how to polish off your painting with some finishing touches.  We will go over things like texture overlays, adjustment layers, blending modes, etc.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Why Take This Course?</strong>  </p>  <p style=\"\">  \t    Take this course if you think digital painting sounds fun, because you&#039;re right, it is.  Also, if you want to someday pursue a career in any kind of digital art, this is a great starting point for you.  You will never regret learning Photoshop.  It is used in so many different applications.  This particular application is fun and rewarding.  Trust me, even you can create beautiful imagery in Photoshop.  Just follow along.  </p>  <p style=\"\">  \t<strong style=\"\">Join Now</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>I can&#039;t wait to get started as your teacher.  I&#039;ll see you in class.  </p>  <p style=\"\">  \t    **Send me a message if you have any questions about the course or want to know about upcoming deals.  </p>", 
    "end_date": null, 
    "title": "Photoshop: Learn Digital Painting Basics in Photoshop", 
    "price": "20.00", 
    "instructors": "Adam Zollinger", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/349144_21e2_4.jpg", 
    "course_url": "https://www.udemy.com/photoshop-painting-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T05:32:07Z"
}