{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tAre you a student or design hobbyist who knows the bare basics of Photoshop, but wants to bring their work up a notch? Or, have you taken a class in Photoshop, but now need a little extra boost to feel comfortable taking on clients?  </p>  <p>  \t<strong style=\"\">This is the course for you. Use my techniques to take on clients and turn a profit!</strong>  </p>  <p>  \t    Photoshop is the world&#039;s most popular and powerful image editor. Don&#039;t let your skills get rusty! Make the most of the software with tried and true methods.  </p>  <p>  \t<strong style=\"\">Quickly change your game using the five methods I will teach you.</strong>  </p>  <ul style=\"\">  \t<li>Retouch and fix blotchy skin without it looking &quot;Photoshopped&quot; fake</li>  \t<li>Refine complicated edges (like hair) with the Refine Edge tool</li>  \t<li>Create unique texture by subtracting an image&#039;s RGB channels</li>  \t<li><strong style=\"\"></strong>Sort, filter, tag, group, link, and organize layers</li>  \t<li>Record a custom action and apply it to an unlimited number of photos</li>  </ul>  <p>  \t<strong style=\"\">Bring your work to the next level today.</strong>  </p>  <p>  \t    This course can take you there. It will put a bag of design tricks in your pocket, useful both for amateurs with a hobby and freelancers seeking clients.  </p>  <p>  \tEach of the tutorials is in depth, and the relatively short course length is designed to give you the quick boost you need, without spending inordinate amounts of time exploring every option in the interface.  </p>", 
    "end_date": null, 
    "title": "Photoshop: 5 Practical Techniques to Improve Your Skills", 
    "price": "20.00", 
    "instructors": "Dan Morton", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431562_d97d_2.jpg", 
    "course_url": "https://www.udemy.com/photoshop-5-practical-techniques-to-improve-your-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T02:39:37Z"
}