{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<span>In this Photoshop course, I introduce and explain the various tools in Photoshop. Every single tool is covered, with the exception of 3D tools. Advanced modes and options are also covered. By the time you&#039;ve finished this course, you will be an expert at Photoshop&#039;s tools. However, some students may option not to complete the entire course and instead use this as a reference to learn about specific tools. If that&#039;s the case, jump around to which tool you have questions about, even though you might be missing some helpful content by not completing all the lectures. The lectures are ordered in the order they are located in the Tools panel.</span>  </p>  <p class=\"MsoNormal\">  \tStudents can follow along in Photoshop and practice adjusting the various tools’ options and use them in conjunction with each other, whether it’s the Type Tools, the Pen Tools, or the Shape Tools, or digital darkroom tools like the Clone Stamp Tool, the Sponge Tool, and so on.  </p>  <p class=\"MsoNormal\">  \tThere are 11 lectures on the various selection tools. This could normally be a course by itself, but it is included as one section in this course. If you complete this course, you will be an expert at making selections in Photoshop!  </p>  <p class=\"MsoNormal\">  \tI have years of experience using Photoshop, including doing web and advertising design at a newspaper, an advertising design firm, a library system, and freelance work for about two decades. I’ve also been managing editor at two international graphic design magazines, and I’m currently a full-time professor of graphic design and digital media. I’ve taken classes on digital production and design during my undergraduate and graduate work.  </p>  <p class=\"MsoNormal\">  \tSo enroll today and let’s learn about Photoshop’s tools and their neat uses and effects.  </p>  <!--EndFragment-->", 
    "end_date": null, 
    "title": "Photoshop In-Depth: Master all of Photoshop's Tools Easily", 
    "price": 0, 
    "instructors": "Dr. Chad Neuman", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348116_e9d8_4.jpg", 
    "course_url": "https://www.udemy.com/photoshop-tools/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T18:59:21Z"
}