{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tLearning to create vector icons, logos, user interfaces, buttons, and more is a growing trend for both the web and mobile devices. This course focuses on abstract and flat-design techniques using Pixelmator's Shapes. Shapes allow you create icons, glyphs, logos, posters, and more in a vector format that is scalable without losing image quality at any size. Once a Shape is created, you can reuse it allowing you to never re-create that shape from scratch again.  </p>  <p>  \t                                  This course is taught in a relaxed, conversational, unscripted style. Recorded to capture what it is like to hear a designer's thoughts as the designing unfolds. No slides, PowerPoint presentations, or scripts are used. The course is lean, trimmed, and fast-paced but you can still learn at your own pace. The lessons are taught in Pixelmator and the techniques and tools used are presented as you need to know them.  </p>  <p>  \t                                  By the end of the course you will have the knowledge to create your own Shapes from scratch using Pixelmator. You will also understand the process to create and deliver icons, logos, posters, user interfaces, buttons, and more. Plus over <strong>60</strong><strong> Pixelmator Shapes</strong> included. </p>  <p>  \t<strong>Techniques and topics covered include: </strong>  </p>  <ul>  \t<li>Vector vs. bitmap graphics</li>  \t<li>Working with Pixelmator Shapes</li>  \t<li>Style attributes that add details to Shapes created in Pixelmator</li>  \t<li>Editing Shapes using nodes and handles </li>  \t<li>Using existing Shapes to create custom shapes</li>  \t<li>Building complex Shapes</li>  \t<li>Implement the latest design trends in flat-design</li>  \t<li>Applying masks and clipping masks to Shapes in Pixelmator </li>  \t<li>Organizing and ordering layers </li>  \t<li>Applying gradients and color palettes to Shapes </li>  \t<li>Saving Shapes to the Shapes palette to reuse or share with others </li>  \t<li>Working with Text in Pixelmator</li><li>Includes instruction on Pixelmator's Pen Tool and Freeform Pen Tool</li><li>Lesson on how to utilize the Effects Browser</li>  \t<li>Converting Fonts to Shapes to create custom typography and Shapes</li>  \t<li>Just-in-time-learning to not overwhelm the student with Pixelmator's many features</li>  \t<li>And a lot more tips, keyboard shortcuts, and tricks along the way</li></ul><p><strong>Over 100 Pixelmator Shapes will be added to the course throughout the year! </strong></p>", 
    "end_date": null, 
    "title": "Pixelmator - Create Vector Graphics From Scratch", 
    "price": "20.00", 
    "instructors": "Joe Marshall", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/220604_68d9_10.jpg", 
    "course_url": "https://www.udemy.com/create-icons-and-shapes-from-scratch-using-pixelmator/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-16T13:09:57Z"
}