{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<strong>Te mostramos un método fácil, rápido y profesional de personalizar estas plantillas, ya que podrás cambiar absolutamente todo en cada template.</strong> Cada plantilla fue creada 100% en PowerPoint por lo que todos los elementos de la misma son editables, de modo que podrás poner a volar tu creatividad haciendo combinaciones entre una plantilla y otra. Hay 70 plantillas bases y 20 plantillas de productos (incluye: relojes, herramientas de construcción, teléfonos, morrales, tiendas virtuales que venden diferentes rubros de productos.<p>Por medio de este pack de 90 Plantillas en Powerpoint, siempre tendrás el control de tu anuncio, ya que es una forma simple, fácil, rápida y profesional de construir tu anuncio desde la sencillez de este programa. Las 90 plantillas son totalmente inéditas creadas por nuestro propio equipo de diseño gráfico con el tipo de diseño que le vende a la mente de tu cliente.<strong></strong>En este Videocurso 100% práctico te entregamos 90 Plantillas Editables al 100% en Powerpoint para que publiques en MercadoLibre y en Ebay. Las plantillas o templates están compuestas por temáticas genéricas en diferentes colores y diseños para que tu elijas la de tu conveniencia. También hemos diseñado para ciertas categorías de negocios como: computación, teléfonos, tecnología, apple, moda infantil, moda femenina, cámaras digitales, equipos médicos, videoconsolas, mascotas, maquinaria pesada, motos y accesorios, entre otros.Todos los videos y material están 100% en idioma español. No es un curso de venta en MercadoLibre o Ebay, son archivos de presentación .pptx en powerpoint, llamados plantillas para publicar en cualquiera de estos sitios de comercio electrónico.</p>", 
    "end_date": null, 
    "title": "Plantillas Powerpoint para Publicar en Mercadolibre y Ebay", 
    "price": "35.00", 
    "instructors": "Jairo Carrizales", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520876_a8dc_3.jpg", 
    "course_url": "https://www.udemy.com/publicacion-rapida-y-profesional-en-mercadolibre/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-05T00:09:38Z"
}