{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t     Logos are a critical part of the modern visual landscape. To learn how to create your own, it&#039;s important to be able to identify the components and design techniques behind the most successful Logos. In this course, we will be deconstructing Challenging logos in order to explain why and how they work, and offers a methodical approach to creating a logo in Illustrator. These tutorials combine theory with nuts-and-bolts techniques that emphasize simplicity and readability: the principles that ground the best logo designs.  </p>  <p style=\"\"><strong style=\"\">Topics include:</strong></p><ul style=\"\"><li>Choosing the right typeface</li><li>Designing with simple shapes</li><li>Adding shine, texture, beveled edges, and transparency</li><li>Designing with negative space</li><li>Choosing logo colors</li><li>Preparing final files</li></ul>  <p>Design a logo that stands out from the crowd with the help of these video tutorials. </p><p>* Fully explained tutorial from starting to end.</p><p>* Provided you secret techniques of creation.</p><p>You also get the Project file to enhance your work flow..</p><p>  \t      <strong style=\"\">Contents and Overview</strong>  </p>  <p>  \t      This course, containing over 45 lectures and 2.5 hours of content, provides step-by-step instructions on logo design.  </p>  <p>  \t  Along with this you also get the AI. Working File to download and practice along the tutorials.  </p>  <p>  \t  No logo design experience is required; however, you should have a full or free trial version of Adobe Illustrator, even though you don&#039;t need prior knowledge working in this program.  </p>  <p>  \t      Upon completion of this course. You&#039;ll know how to create unique symbols, add elements to a word, use geometric shapes and initials, and position text properly.  </p>  <p>  \t       Students will nail the basics of Illustrator, and create logos in color, black and white, and in different formats.  All of these skills will make you a more valuable designer or allow you to use your creativity to make your own logos.  </p>", 
    "end_date": null, 
    "title": "Professional Logo Design in Adobe Illustrator", 
    "price": 0, 
    "instructors": "MD Rawson", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399938_e897_5.jpg", 
    "course_url": "https://www.udemy.com/professional-logo-design-crash-course/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T09:51:27Z"
}