{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">&quot;Learn Quick and Quirky Caricatures in an Hour&quot;...?</p><p style=\"\">Caricatures? What are they?</p><p style=\"\">&quot;a&nbsp;picture,&nbsp;description,&nbsp;or&nbsp;imitation&nbsp;of&nbsp;a person or thing in which certain striking characteristics are exaggerated in order to create a&nbsp;comic&nbsp;or&nbsp;grotesque&nbsp;effect&quot;<br style=\"\"></p><p style=\"\">Ever wanted to impress your friends? Ever wanted to draw something not realistic? Ever wanted to express your view on a person? Thats what Caricatures are for!</p><p style=\"\">This Course will teach you how to draw caricatures, using an in-depth video demonstration and drawing lessons. You&#039;ll grasp an understanding of Caricatures and how to draw them within an hour, not including practice (you gotta practice!).</p><p style=\"\">I have 6 videos, thats it! 6 videos that will go in detail on what to do, PLUS &nbsp;demonstrations with the artist on how he draws his caricatures!</p><p style=\"\">Why take this course? Why wouldn&#039;t you?!<span style=\"\"><br style=\"\"></span></p><p style=\"\">For the less price of a weeks worth of luxury coffee you buy at a coffee shop, you can gain drawing skills and knowledge, plus impress your friends and family, probably pursue caricature drawing as a hobby. With coffee, that goes in and out fast. Knowledge cannot be taken away from you!</p><p style=\"\">So what are you waiting for? Enroll Today!</p>", 
    "end_date": null, 
    "title": "Quick and Quirky Caricatures - Learn in an Hour!", 
    "price": "20.00", 
    "instructors": "Tristan Villanueva", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37821_51c5_5.jpg", 
    "course_url": "https://www.udemy.com/quick-and-quirky-caricatures/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-24T02:45:32Z"
}