{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Sketchbook Pro 7: Drawing made easy</strong> is a short and quick to the point as to why you should start using sketchbook for your own personal and business use! The course will continually be updated and more content will be added over time! Start making your paper and pencil drawings more refined, natural and professional with Sketchbook&#039;s drawing tools! Sketchbook is a really quick way to not only sketch but draw whatever you want! With it&#039;s easy to use interface and customizable tools to use anything from paint to pencil sketchbook has it! In this course you will jump right into the program learning examples from the instructor and best methods to get fast results!</p><p style=\"\"><strong style=\"\">Please note</strong> - <em style=\"\">This course does not show you drawing techniques or teach you how to draw. However, the instructor will use techniques that you will show you how to easily go from paper or even Photoshop to Sketchbook Pro by showing you how easy and professional the software is. </em></p><p style=\"\">================================ </p><p style=\"\"><strong style=\"\">About this course: </strong>This course is going to be continually updated with more and more content upon request In this course you will quickly understand the drawing tools of Sketchbook Pro and start drawing today! This course is no-fluff, straight to the point to show you exactly how Sketchbook Pro works </p><p style=\"\"><strong style=\"\">Materials you will need: </strong></p><ul style=\"\"><li style=\"\">A drawing tablet </li><li style=\"\">A copy or trial of Sketchbook Pro</li></ul><p style=\"\"><strong style=\"\">You will learn:</strong> </p><ul style=\"\"><li style=\"\">How to use the pencil and airbrush tool to start drawing and adding color </li><li style=\"\">How to use fast techniques for adding color: such as highlights and shadow to your drawing The layers palette and how it works </li><li style=\"\">To easily start drawing with customizable and easy to use drawing tools. </li><li style=\"\">How to set up your drawing canvas for recommended drawing and resolution size </li><li style=\"\">How to quickly incorporate your own drawing style using the software </li><li style=\"\">...and much more!</li></ul>", 
    "end_date": null, 
    "title": "Sketchbook Pro 7: Drawing MADE EASY Crash Course", 
    "price": 0, 
    "instructors": "McCoy Buck", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570712_1456_4.jpg", 
    "course_url": "https://www.udemy.com/drawing-made-easy-in-sketchbook-pro-7/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-01T06:43:02Z"
}