{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Does the thought of learning Photoshop make you wanna cringe?</strong></p>  <p><strong>Are you tired of paying other people to do graphic designs for you EVERY time you need them?</strong></p>  <p>Let’s face it, having quality graphics is an essential part of any business. I mean, you have to get your message out there and grab attention, right?</p>  <p><strong><em>Up until now you’ve probably:</em></strong></p>  <ul><li>Spent way too much money outsourcing and sifting through what stinks and what represents your brand in a fab way</li><li>Tried to learn Photoshop but you bit off more than you can chew</li><li>Used different designers but have come to the conclusion that they don’t get you or your style</li></ul>      <p>And to be honest, you may not have been satisfied with any of it very much. </p>  <p>I get it…and I’m here to help you learn this skill so that you never have to worry about sucky graphic designs again, for any of your campaigns, personal use, or web presence.</p>  <p><strong><em>Imagine if you could:</em></strong></p>  <ul><li>Create stunning social media graphics that convey your message, build your business, and increase your visibility on the web</li><li>Learn the skills and tricks most professional graphic designers don’t even know about</li><li>Learn how to give your brand a new look whenever you want</li><li>Generate cash on the side by starting your own turnkey graphic design business</li></ul>        <p>Whatever you want, YOU can create!</p>  <p>This course is for you if you want to save time and money on your social media graphics. Period. And if you want to put some extra money in your pocket, go for it! </p>  <p><em><strong>Here’s what my past clients have said about my designs:</strong></em></p><p><em>\"Cheryl Moses provided me with a creatively designed Facebook Banner for my business page. The designed complimented the value of my work and captured the essence of who I am as a business owner. Working with Cheryl was a joy, as she was prompt in responding to my questions and business needs, she was affordable and most importantly she provided high quality and value in the work. I strongly recommend Cheryl for her creativity, professionalism and expertise. You wont find a better level of service and quality for a great price.</em><em>\"  -</em>D. Brown, Business Leadership Coach/Speaker<br></p><p><em>\"I would highly recommend New Eminence Consulting to businesses in need of graphic services. With a great eye for design, the results always exceed my expectations. With vivid imagination and creative spirit, I appreciate the attentiveness to each and every project. I have ordered many graphics and have never, ever been disappointed. As a business professional, who consistently operates with high demand, I really appreciated the high quality of work and rapid turnaround. I guarantee that any graphic purchase with this company is an investment well worth making!</em><em>\" -</em>V. Manns, Business Development and Entrepreneurship Expert<span></span><br></p>    <p><em><strong>Just think…an hour from now you could be creating your own:</strong></em></p>  <ul><li>Facebook Timeline Covers</li><li>Twitter Banners</li><li>Google Plus Banners</li><li>Blog Post Images</li><li>Pinterest Images</li><li>Instagram Images</li><li>YouTube Thumbnails/Covers</li></ul>              <p>And much more!</p>  <p><strong>So what the heck are you waiting for?</strong> </p>  <p>This step-by-step course will teach you everything you need to know about designing your very own graphics. </p>  <p>You’ll walk away with a skill that you can use for yourself, corporations, business owners, organizations, etc. The possibilities are endless! It doesn’t get any better than that! </p>  <p>Watch over my shoulder as I show you the same skills that have people filling up my email inbox, asking for my services, EVERY. SINGLE. DAY.</p>  <p>See ya in class! </p>", 
    "end_date": null, 
    "title": "SOCIAL GRAPHICS MADE EASY", 
    "price": "45.00", 
    "instructors": "Cheryl Moses", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/728968_e846_2.jpg", 
    "course_url": "https://www.udemy.com/diy-social-media-graphic-design-course-no-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T11:12:01Z"
}