{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>If you want to make <strong class=\"redactor-inline-converted\">professional comics</strong>, then you want to work digitally. <strong class=\"redactor-inline-converted\">Manga Studio 5 / Clip Studio Paint</strong> is the cutting edge of comics software. Better for making comics than Photoshop and other art programs, it gives you infinite possibilities for telling your story. It has tons of tools designed <strong class=\"redactor-inline-converted\">just for comics</strong>, and it is the program of choice among professional comic artists.</p>\n\n<p>Any type of story can be told with comics: Fantasy, superhero, mystery, science fiction, historical, western, nonfiction, romance, autobiographical, hard-boiled detective -- <strong class=\"redactor-inline-converted\">there is no limit to your imagination</strong>. New artists and storytelling techniques are being discovered <strong class=\"redactor-inline-converted\">every day</strong>. As the web becomes more visual, graphic storytelling is more important than ever. <strong class=\"redactor-inline-converted\">You can be part of this revolution.</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Today there are more ways to release comics than ever before. You can work for a major publisher (like DC, Marvel, and Image), use a small press to print comics, put comics on a web page, release comics in digital formats like PDF and CBZ files, self-publish for Kindle, and much more. This course will give you tools to start doing all these things.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In over six hours of <strong class=\"redactor-inline-converted\">detailed lessons</strong>, I will give you a complete tour of <strong class=\"redactor-inline-converted\">Manga Studio 5 / Clip Studio Paint</strong>, show you how to set up your story, use every tool and effect, add colors and letters, and create an awesome product you can share with the world.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">There's no reason to wait. You can start making comics TODAY</strong><strong class=\"redactor-inline-converted\">. Sign up now to begin your career in comics.</strong><br></p>", 
    "end_date": null, 
    "title": "Start Making Comics with Manga Studio 5 / Clip Studio Paint", 
    "price": 0, 
    "instructors": "Adam Savage", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/839536_8a44_3.jpg", 
    "course_url": "https://www.udemy.com/start-making-comics/", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-04T15:50:12Z"
}