{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>A short introduction about myself.</strong><br><br>I’m a web and graphic designer with over a decade of experience in the field and for the past 10 years I have worked with international companies, ranging from small shops to fortune 500 corporations.</p>\n\n<p>In the last 2 years I have been designing and selling T-shirts on various platforms and in this time I have gathered a lot of experience on what people are looking for when buying a T-shirt and what shirt designs sell best.<br></p>\n\n<p>Selling T-shirts is a competitive business with a lot of sellers fighting for the attention and money  of potential buyers. In my 2 year experience of selling T-shirts I have noticed one constant factor: <strong class=\"redactor-inline-converted\">GOOD DESIGNS WILL ALWAYS SELL BEST.</strong> When there are literally tens or hundreds of T-shirts in a particular niche, the buyer will always look for the best looking one. After all, they plan on wearing the T-shirt and they will often browse through multiple Shirts and pages until settling on the one they want. Make them settle on YOUR T-shirt.<br></p>\n\n<p><strong class=\"redactor-inline-converted\">What can you expect out of this course?</strong></p><p>The things I will teach you in the following lectures will be invaluable to your T-shirt selling business success.<br></p>\n\n<p>In this course I take you through EVERY step of creating amazing t-shirt designs. I go from the basics of Photoshop for those who never even started the program, and I continue slowly through all the techniques until you become an expert in creating great designs within minutes or hours from inception to creation and upload.</p>\n\n<p>In this course I take 3 of my best selling T-shirts and recreate them step by step for you. This way you can follow the process along with the videos in a very easy to understand manner. </p>\n\n<p>All the techniques you learn here can then be applied to create ANY t-shirt design. In the 4 sections and 25 lectures you will learn over 50 techniques that you can mix and match to create new and original designs by simply repeating and adjusting what you learned. </p>\n\n\n\n<p>Among the lectures you will learn about typography and how to create rich in detail designs that focus mainly on text. You will learn how to create silhouettes, how to create cutouts, how to create gunge and distorted effects. You will also learn how to create 3D Text, how to create a detailed sketches of any person or object and how to use color theory to bring life to your designs.</p>\n\n\n\n<p>Not only that, but I also dedicated an entire section with quick and easy techniques that you can follow and apply to ANY T-shirt. I will keep this section constantly updated with new and interesting techniques regularly.</p>", 
    "end_date": null, 
    "title": "T-shirt Design for Merch by Amazon using Photoshop.", 
    "price": "35.00", 
    "instructors": "Ovidiu Pistol", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/805882_af2d_2.jpg", 
    "course_url": "https://www.udemy.com/t-shirt-design-from-beginner-to-expert-using-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T06:18:18Z"
}