{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>Get in now while the course is FREE! This course will shift to a paid course on the 30th September 2014.</strong>  </p>  <p>  \t<strong>Now over 1400 learning this course! Thank you to everyone who has joined up so far. Please let me know if i can answer any of your questions.</strong>  </p>  <hr>  <br>  <strong>Turn any photograph into mind blowing artworks. This technique produces edgy and modern illustrations, framed artworks, website graphics as well as images for advertisement and social media. Best of all there is zero graphic design or drawing experience required!</strong>  <p>  \t                          It doesn&#039;t matter what quality your image is to start with. You will learn how to turn it into something great. The image will also be able to be resized to whatever size you like with no loss of quality.  </p>  <p>  \t                            Learn how to conceptualize, illustrate and finish low poly illustrations. The result is a modern art form which can be both edgy and  beautiful. It is a technique which has risen in popularity in the last  few years and has been displayed in advertisements, music videos, art instillation&#039;s and television commercials.  </p>  <p>  \t                                In this class, Digital  Artist &amp; Designer Blake Muir will take you through the step by step  instructions of producing this effect with your own photographs.  </p>", 
    "end_date": null, 
    "title": "Turn Your Photos Into Professional And Modern Artworks", 
    "price": "20.00", 
    "instructors": "Blake Muir", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/300466_3100_3.jpg", 
    "course_url": "https://www.udemy.com/turn-your-photos-into-professional-and-modern-artworks/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-15T08:39:10Z"
}