{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Do you want to learn how to design the perfect type so your next web design project is going to as engaging as those perfect websites design out there?</strong>  </p>  <p>  \t<strong style=\"\">                Or maybe you have already went through a web typography course but it doesn’t involved practical design in a real world projects and now you don’t know how to start?  </strong>  </p>  <p>  \t<strong style=\"\">  Do you know that typography is a single the most important aspect in web design?  </strong>  </p>  <p>  \t                        If you want to get answers to all those questions and are willing to learn everything about typography design when you are on the right track!  </p>  <p>  \t          This course is comprehensive with short and quick lectures which will look into typography in a practical way, without any boring theoretical and useless stuff you may have already learned just by <em style=\"\">googling </em>about typography.  </p>  <p>  \t<em style=\"\">                  In this course you are going to learn everything you need to know about web typography, which includes:  </em>  </p>  <ul style=\"\">  \t<li>Web typography rules, terms and recommendations in a practical way</li>  \t<li>Classifications of all available types of typography</li>  \t<li>How to choose the right font for your next web project with practical tips and tricks which you will be able to apply right away</li>  \t<li>How to implement your web fonts into your web design project</li>  \t<li>How to use Adobe Photoshop for typography design</li>  \t<li>Plus a bonus section for mobile typography and all the free resources</li>  </ul>  <p>  \t              You are going to get a course with all updates, free support and 30 day money guarantee period with no questions asked.  </p>", 
    "end_date": null, 
    "title": "Typography Design: Learn Web Typography The Practical Way", 
    "price": "20.00", 
    "instructors": "Deimantas Brandišauskas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397204_c34d_3.jpg", 
    "course_url": "https://www.udemy.com/typography-design-learn-web-typography/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-18T12:54:54Z"
}