{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong style=\"\">The right font is as important as the words it shows!</strong></p><p>Why is it so important to choose the right font?<span></span><br style=\"\"></p><p>Look around you - look at the typography you see. With every word, every type you see, you form an opinion. Choosing the right fonts for your project has powerful results - the reader forms an emotional connection to what they see, both the words as well as the &quot;word-delivery-method&quot;, the typography.</p><p>Get it right - and the reader will focus on your message... but get it wrong and the reader will be distracted, confused and unfocused.</p><p>Choosing the wrong font for when you are creating business and marketing documents will not only take attention away from your message, but it can lead to brand confusion and diminished trust in your business. Are you willing to take that risk?<br style=\"\"></p><p><strong style=\"\">Just imagine...</strong></p><p>... a financial statement printed in a fancy and playful script font - no matter how good the numbers are, would you take the business seriously?</p><p>... an alarm company advertising in a kids-like font - would you trust them to keep your home or office safe?</p><p><strong style=\"\">&quot;Font Fails&quot; are all too common</strong></p><p>I have been in the graphic and printing industry for over 20 years and I have seen my fair share of bad font choices. But I have also learned that poor font choices are rarely done on purpose. A typical reaction when I comment on a &quot;font fail&quot; and take a moment to suggest a better typography choice, is &quot;that looks so much better - thank you&quot;. When you know the basic rules of typography, making the right choices is easy.... and that&#039;s what I will teach you in this course.</p><p><strong style=\"\">When you buy this course you will get:</strong></p><ul style=\"\"><li style=\"\"><strong style=\"\">unlimited, lifetime access </strong>to all lectures</li><li style=\"\">access to all <strong style=\"\">upcoming bonus lectures</strong> and additional content</li><li style=\"\">an <strong style=\"\">unconditional 30-day money back guarantee</strong>, making this a risk-free purchase for you</li><li style=\"\">access to me if you have any questions (or help with fixing any font-fails) - I am always here to help!</li></ul>", 
    "end_date": null, 
    "title": "Typography 101: Picking the Right Fonts for Business Success", 
    "price": "20.00", 
    "instructors": "Alexandra Krieger", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412864_4a52.jpg", 
    "course_url": "https://www.udemy.com/typography-fonts-business/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T03:24:35Z"
}