{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Die richtige Schriftart ist genauso wichtig wie die Worte die damit geschrieben sind!</strong></p><p>Warum ist es so wichtig die richtige Schrift zu wählen?</p><p>Nehmen Sie sich einen Moment Zeit und schauen sie um sich herum – sie sehen Schriften überall. Mit jedem Wort und jeder Schrift die Sie sehen, bilden Sie sich eine Meinung. Die richtige Schrift auszusuchen hat eine starke Wirkung - wir stellen eine Gefühlsverbindung zu allem her was wir sehen, sowohl zu den Worten wie auch zu der Schrift aus der die Worte hergestellt werden.</p><p>Bei der richtigen Schriftwahl ist ihre Botschaft der Mittelpunkt (so soll es sein!)… aber wenn Sie die falsche Schriftart wählen, führen Sie den Leser zu den falschen emotionellen Verbindungen und lenken die Aufmerksamkeit von dem ab was Sie mit Ihrer visuellen Kommunikation eigentlich erreichen wollen. Wollen Sie dieses Risiko eingehen?</p><p><strong>Stellen Sie sich vor…</strong></p><p>... Bilanzen die in einer geschwungenen Schreibschrift gedruckt sind. Wenn Ihnen das bei einer Investitionenpräsentation vorgelegt wird, würden Sie diese Firma ernst nehmen?</p><p>... Eine Sicherheitstechnikfirma die eine kindlich &amp; lustige Schrift in ihren Marketingmaterialien verwendet. Würden Sie dieser Firma vertrauen, Ihr Büro abzusichern?</p><p><strong>Fehlgeschlagene Wahlen von Schriftarten kommen dauernd vor</strong></p><p>Ich bin schon seid über 20 Jahren in den Bereichen Grafik- und Kommunkationsdesign, Druck &amp; Marketing tätig und habe in dieser Zeit viele Projekte mit fehlgeschlagenen Schriftwahlen gesehen. Abe ich habe auch gelernt das dies meist nicht absichtlich passiert. Wenn ich mit jemandem über ein fehlgeschlagenes Projekt spreche und eine bessere Schriftwahl vorschlage, wird mir oft gesagt „das sieht gleich viel besser aus – danke.“  Wenn Sie ein Basiswissen von Schriften haben, ist es einfach die richtigen Entscheidungen zu treffen… und dabei helfe ich Ihnen in diesem Kurs.</p>", 
    "end_date": null, 
    "title": "Typografie - Die besten Schriftarten im Geschäftsalltag", 
    "price": "20.00", 
    "instructors": "Alexandra Krieger", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691641_1224.jpg", 
    "course_url": "https://www.udemy.com/typographie-schriftarten/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T01:58:42Z"
}