{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Typography is one of the oldest art forms in the world, and one that has remained important even through our move from the print to the digital age. This is because you don't need technical know-how master typography; instead, you need a keen eye for detail, a love of creating, and an appreciation of good design. If that sounds like you, then you've chosen the right course.</p><p><strong>Your Typography Crash Course</strong></p><ul><li>Understand typography fundamentals</li> <li>Apply typography principles to digital and print media</li> <li>Create outstanding text-based logos and designs</li> <li>Learn how typography is perceived by audiences/customers</li></ul><p><strong>Typography Fundamentals in a Flash</strong></p><p>This course has been created for anyone who loves typography design; print designers, graphic and web designers, animators, sign writers, and many more. Whether you're a beginner or an intermediate, you'll pick up a comprehensive skillset through the 73 lectures and 6 hours of content that come with this course. You can use any publishing software to follow along with the instructor; Photoshop, Illustrator, InDesign or just about anything else you have a basic understanding of.</p><p>Each section the course includes its own walkthrough exercises so that you can put the skills you have learned to practical use. You'll start off by learning all of the terminology regarding typography (tracking, leading, kerning) and font classifications, and then you'll examine concepts like how fonts impact a message, and how fonts are used in different media like advertising, web, print, logos, and so on. Finally, you will cover the essentials of digital publishing before concluding.</p><p>By the end of this course, you have both a theoretical and a literal understanding of typography, from how it is used to where it used to why it is used, and of course you'll gain a solid groundwork in the practical uses of typography too. </p><p><strong>Tools Used</strong></p><p><strong>Adobe Illustrator:</strong> The standard software for graphics design, and where you will do the majority of your work. Create any kind of illustration or digital art your mind is capable of thinking up, with any kind of typeface effect too.</p><p><strong>Adobe Photoshop:</strong> Used for editing and manipulating photographs and images, but also with plenty of scope for font and typefaces Improve colour, add special effects, remove blemishes, create your own images with font from scratch, and more.</p><p><strong>Adobe InDesign: </strong>InDesign is a desktop publishing software application, usually used to create print media like posters, brochures, magazines, newspapers, books and signs (unlike Photoshop and Illustrator which are digital based). Usually the most popular Adobe tool among typographers. </p>", 
    "end_date": null, 
    "title": "Typography From A to Z", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/575040_c6bd_2.jpg", 
    "course_url": "https://www.udemy.com/typography-from-a-to-z/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-05T21:21:45Z"
}