{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t <strong>Course Summary</strong>  </p>  <p>  \t    Typography is present in every graphic design project, whether it be print or digital, motion or brand identity. This course explains how to use type properly in order to obtain professional results. The course directly addresses development of the skills a graphic designer must master for real world projects.  </p>  <p>  \t    The use of video, voiceover, images and motion help to create a smooth and efficient learning experience with lasting results.  </p>  <p>  \t <strong>The course It&rsquo;s structured in the following way:</strong>  </p>  <ul>  \t<p>  \t\t<strong>   1.</strong> <strong>Tools:</strong>  \t</p>  \t<p>  \t\t    Develop a basic knowledge of the shape, proportions, and historical heritage of the letterforms that permit the graphic designer to classify typefaces into categories.  \t</p>  \t<p>  \t\t <strong>2. </strong><strong>Methodology:</strong>  \t</p>  \t<p>  \t\t    Once basic knowledge is required and common language is established, a method that can be applied to any graphic design project is presented. This method will enable the student to choose the right typefaces for each project with confidence.  \t</p>  \t<p>  \t\t<strong>   3.</strong> <strong>Obtaining Visible Professional Results</strong>:  \t</p>  \t<p>  \t\t    There are many specific elements of typography that a professional graphic designer must master in order to deliver the desired result in a clean and effective manner.  \t</p>  \t<p>  \t\t     The following concepts are explained:  \t</p>  \t<p>  \t\t       &middot; Kerning, tracking, leading, alignment and spacing  \t</p>  \t<p>  \t\t       &middot; A collection of Dos and Don&rsquo;ts as well as Quick Tips that will come in handy in every project is presented  \t</p>  \t<p>  \t\t <strong>4. </strong><strong>Verification</strong>  \t</p>  \t<p>  \t\t    The use of quizzes at the end of each lesson will allow the student to gauge their understanding of the most important concepts.  \t</p>  \t<p>  \t\t <strong>5. </strong><strong>Keep learning!</strong>  \t</p>  \t<p>  \t\t    Recommended books and online resources are presented for the purpose of ongoing learning as well as staying updated about current typography trends.  \t</p>  </ul>  <p>  \t    As stated above, this course is less about the history of typography and is father strictly relevant for people who want to develop skills and learn the tools needed for typography now.  </p>", 
    "end_date": null, 
    "title": "Typography Fundamentals - Feel confident with type!", 
    "price": "20.00", 
    "instructors": "Wanda Granata", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/77896_eefd_11.jpg", 
    "course_url": "https://www.udemy.com/typography-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-13T07:06:36Z"
}