{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong><em>Course Updated: F</em></strong><strong><em>or photoshop CC 2015 users!!!</em></strong></p>\n\n<p><strong><em></em></strong><strong>From Zero to Hero. Start with no knowledge of design, finish with new skill in hand</strong>. At the end of the course <strong><em>you will be able to design any types of web home pages</em></strong></p><strong>\n\n<p>Do you want to earn some extra money? Are you looking for another career and would like to work from home? This course is the best course for you.</p>\n\n<ul><li><em>You Can Use either Mac or Windows</em></li><li><em>No Prior Experience</em></li><li><em>No coding or Programming</em></li><li><em>Design Web Homepages From Scratch in Photoshop</em></li><li><em>No design or Photoshop knowledge necessary because I will teach you that</em></li><li><em>30 day money back guarantee!</em></li><li><em>Videos have closed captions to easily understand the course</em></li></ul>\n\n<p><strong>This course is designed to teach you about web design and how to earn money from doing simple web designs</strong>. In this course you will learn not only about doing designs but also how to <strong>make a career as freelance web designer.</strong> I will teach you how to maximize your talent and build your confidence.</p>\n\n<p>In this wonderful journey I will show the <strong>ways how to generate an income as a designer</strong>. This course will help you get started in designing and make some real money. I want you to apply all the knowledge you learned in real world projects.</p>\n\n<p>Prepare Yourself for a New Career in Web Designing by Learning New Skills.</p>\n\n<li><strong> You Will Learn How to Use Adobe Photoshop in simple ways.</strong></li><li><strong> Design Any Types of Web homepages</strong></li><li><strong> You Will Learn How to Design websites in Photoshop from Scratch.</strong></li><li><strong> Finding Freelance Web Design Projects.</strong></li><li><strong> Tips on How to Win Web Design Projects.</strong></li><p>The skills that I'm going to teach you in this course are so valuable that will help you grow as a designer. A talent that will last a lifetime. Talent in designing is not inborn. <strong>Everybody can learn how to design.</strong></p>\n\n<p>This course will guide you from basics of web design. <strong>You don't need any background in designing because I will show you the right and proper way</strong> in designing a kickass web pages.</p>\n\n<p>The exercises in Adobe Photoshop are so easy. I designed them for absolute beginner because I don't want to confuse you with so many tools. All you need is a basic knowledge of the program so you can design more complex web pages and illustrations in the future.</p>\n\n<p>I started from nothing now I'm a web designer. In this course I will share everything I know in web designing and making money from doing designs. If you're ready see you in the course.</p></strong>", 
    "end_date": null, 
    "title": "Ultimate Guide on Freelancing Career in Photoshop Design", 
    "price": "30.00", 
    "instructors": "Jestoni Esteban", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438420_14a3_4.jpg", 
    "course_url": "https://www.udemy.com/freelancing-career-in-photoshop-design/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T08:33:09Z"
}