{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">In This Course I&#039;ll Walk You Through a Simple Process Where You&#039;ll Learn The Methods Of Designing Beautiful Web Elements in Photoshop.  </strong>  </p>  <p style=\"\">  \t                                                                        This Course is Designed To Inspire Your Creativity  To Make Beautiful Designs in a Easier Way and in Less Time.  </p>  <p style=\"\">  \t                                                                      The Skills Learned in This Course Will Help You Develop a Workflow For Creating Beautiful and Simple User Interface or Web Elements.  </p>  <p style=\"\">  \t<strong style=\"\">This Course Has Been Broken Down in  12 Sections and It Includes...</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Introduction: </strong>This Will Show You a Quick Look Inside The Course Contents and How This Course Works.  </p>  <p style=\"\">  \t<strong style=\"\">Buttons Design:</strong> In This Section You Will Start Learning From Basic To Various Styles Of Button Designing. Along With This You&#039;ll Also Learn How To Use The Same Techniques To Create More Better Designs With Details.  </p>  <p style=\"\">  \t<strong style=\"\">Navigation Bar Design: </strong>This Part Will Show You Different Type Of Navigation Design, Like Flat Design With Details , Light Gradients, Retro Design and Many More.  </p>  <p style=\"\">  \t<strong style=\"\">Forms Design: </strong>Here You Will See Various Types Of Forms Designing, Including Flat, Multi-Step and More With Various Styles.  </p>  <p style=\"\">  \t<strong style=\"\">Slider Design: </strong>This Section Will Show You Beautiful Slider Designing in Various Style With Many Examples.  </p>  <p style=\"\">  \t<strong style=\"\">Pricing Table Design:</strong> In This Part You&#039;ll Learn Easiest Ways Of Pricing Table Design With Details.  </p>  <p style=\"\">  \t<strong style=\"\">Media Player Design: </strong>This Part Will Show How To Design Stylish Video Players and Music Players For Web.  </p>  <p style=\"\">  \t<strong style=\"\">Timeline UI Design: </strong>Timeline Shows How Your Posts Look Like On Your Blog. You&#039;ll Learn To Design Beautiful Styles Of Describing Your Post, Make It Look Better and Attractive.  </p>  <p style=\"\">  \t<strong style=\"\">Progress Bars and Toggle Switches: </strong>In This Section You&#039;ll Learn Simplest Ways Of Designing Progress Bars and Toggle Switches.  </p>  <p style=\"\">  \t<strong style=\"\">Forms UI and Pagination: </strong>Here You&#039;ll Learn To Design Stylish Forms UI and Pagination. Stylish Pagination Grabs More Attention and Forms UI Make Sign Up Forms Look More Stylish and Detailed.  </p>  <p style=\"\">  \t<strong style=\"\">Using High Quality Resources: </strong>In This Section You Will Learn How To Get High Quality Resources For Free Personal or Commercial Use and How To Use Them To Take Your Skills To The Next Level.  </p>  <p style=\"\">  \t<strong style=\"\">Conclusion: </strong>Here We&#039;ll Wrap-up The Course and Tell You Where To Go Next.  </p>  <p style=\"\">  \t                                            I Have Included Every PSD File That I Have Designed During The Course, That Will Help You Understand The Course Instructions in More Detail.  </p>", 
    "end_date": null, 
    "title": "Web Elements Design With Photoshop", 
    "price": "20.00", 
    "instructors": "Sabik Biswas", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/133968_35bf_19.jpg", 
    "course_url": "https://www.udemy.com/web-elements-design-with-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-15T15:39:40Z"
}