{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>คอร์สนี้จะสอนให้คุณทำกราฟฟิคเป็นในระยะเวลาอันสั้น</strong></p><p>หลักสูตรที่จะสอนให้ท่านสามารถใช้งานโปรแกรมออกแบบงานกราฟฟิค Adobe Illustrator ที่ไว้สำหรับสร้างสรรค์งานออกแบบหลักในปัจจุบัน ไม่ว่าจะเป็น งานออกแบบสิ่งพิมพ์ งานออกแบบตราสินค้า ฉลาก บรรจุภัณฑ์ ภาพประกอบ งานออกแบบ website งานออกแบบ user interface mobile application และ งานวาดตัวการ์ตูนแนว vector (แนว Sticker LINE)</p><p><strong>เป้าหมายของคอร์สนี้</strong></p><p>เริ่มมาจากมี Developer หลายท่านบอกว่าอยากจะทำกราฟฟิคได้บ้างเวลาจะสร้าง App ขึ้นมาซักตัวจะได้มีกราฟฟิคที่ออกมาดูดีหน่อย หรือบางทีเวลาที่ไม่มี Graphic Designer อยู่ก็จะได้พอทำงานที่ค้างไว้อยู่ต่อไปได้ เป็นที่มาของโค้ดโมบายส์เราที่ทำการสร้างหลักสูตรนี้ขึ้นมา</p><p><strong>สื่อประกอบการเรียน</strong></p><ul><li>วิดีโอ ดูได้ไม่มีวันหมดอายุ</li><li>ไฟล์ Workshop สำหรับดาวน์โหลดไว้ทำประกอบการสอน<span></span></li></ul><p><strong>คอร์สนี้เรียนยากมั้ย ?</strong></p><p>สั้นๆเลยว่า \"ไม่ยาก\" ขอแค่มีความตั้งใจ เรียนจบคอร์สนี้แล้วพร้อมลุยงานได้ทันที</p><p><strong>เวลาที่ใช้ในการเรียน</strong></p><p>เนื้อหาวิดีโอหลักรวมแล้วประมาณ 9.5 ชั่วโมง</p><p><strong>ภาพรวมของหลักสูตรเป็นแนวไหน?</strong></p><p><strong></strong>หลักสูตรของโค้ดโมบายส์ ทุกหลักสูตรจะเน้นปฏิบัติจริง เน้นทำ workshops ไม่เน้นเปิดสไลด์หรือสอนแต่ทฤษฎี เนื้อหาและ workshops ของโค้ดโมบายส์ พัฒนามาจากประสบการณ์การทำงานจริงในการทำโปรดักส์ต่างๆ ของบริษัทฯ เป้าหมายหลักของเราคือทำให้ผู้เรียนที่เรียนจบหลักสูตรแล้ว พร้อมที่จะปฏิบัติหน้าที่ตามที่ได้รับมอบหมายหรือตามที่ต้องการได้ทันที</p><p><strong>ทำไมควรลงเรียนหลักสูตรนี้?</strong></p><ol><li>เรียนจบสามารถทำงานกราฟฟิคได้แน่นอน</li><li>เนื้อหาเข้าใจง่าย มีไฟล์ Workshop ประกอบการเรียน</li><li>หากไม่เข้าใจตรงไหนสามารถถามตอบปัญหาได้</li><li>หลักสูตรถูกออกแบบมาจากประสบการณ์จริงของผู้สอน</li></ol>", 
    "end_date": null, 
    "title": "สร้างงานกราฟฟิคแอพพลิเคชั่นมือถือด้วย Adobe Illustrator", 
    "price": "20.00", 
    "instructors": "เล็ก โค้ดโมบายส์", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766320_759d_3.jpg", 
    "course_url": "https://www.udemy.com/adobe-illustrator-mobile-app-codemobiles-thai/", 
    "currency": "USD", 
    "subject_name": [
        "Graphic Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T08:36:09Z"
}