{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Authors are authors because that's what they do best- Write! Many often request quiet and solitude in order to get the creative juices flowing and to avoid the author's grim reaper 'Writer's Block'. As a result, authors tend to shy away from anything other than writing which more often than not leads them to face some unwelcome challenges after their book is published.</p><p style=\"\">This course is here to help those authors who fit the description above as well as those who are desirous of pursuing writing as a career or established authors who wish to get involved in both the writing and marketing aspects of their book. While this course does not offer detailed strategies to marketing, it does offer a basic, get off the ground start to having an appreciation for those things and activities that should be obvious but are not quite so obvious to an author and hence the reason behind the self sabotage of their book's success.</p><p style=\"\">'10 Things Authors Do To Sabotage Their Book's Success' covers 10 ways authors sabotage themselves and its resulting impact on the areas of manuscript creation, publishing and marketing. This course will highlight those areas you need to pay attention to before publishing your book so you can avoid or prevent expensive mistakes.</p><p style=\"\">Solutions and live examples will be provided as well as supplementary resources and links to help guide you.</p><p style=\"\">This course is made up of both video, audio and text to meet the needs of all types of learners. Should you be unclear about any aspect of the course or have a burning question relevant to this course, feel free to use the discussion forum to communicate with me directly to obtain a response.</p>", 
    "end_date": null, 
    "title": "10 Things Authors Do to Sabotage Their Book's Success", 
    "price": "20.00", 
    "instructors": "Corine La Font", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553996_98bf.jpg", 
    "course_url": "https://www.udemy.com/10-things-authors-do-to-sabotage-their-books-success/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T03:41:50Z"
}