{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>My intention is to greatly expand as many people's business perspective, which is why a priced it at Udemy's lowest pricing tier. When this course was originally launched it was $388.00, and now it's only $20.You will not find a more progressive branding course anywhere. I am a former Partner with the Gallup Organization, learning brand and management consulting from the best. I am now imparting this knowledge and wisdom onto my students. I personally guarantee that your experience will be excellent, so long as you pursue the learning with open mindedness and vigor.</strong></em>  </p>  <p>  \t<strong><em>--------------------------------------------------------------------------------------------------------</em></strong>  </p>  <p>  \t<em><strong>Greatly expand your perspective on brand building ~ Guaranteed!!! </strong></em>  </p>  <p>  \t                                                       If you’ve ever wanted to learn something new that would catapult your career and your company by positioning you at the forefront of the latest business trend, then this course on 21st century brand building is for you.<br>  \t<br>  \t                                                       I’ve designed this course to impart my knowledge, skills, and experience to you as it relates to building a successful brand. The invaluable information contained in this course is a culmination of Gallup’s best research in human psychology in the workplace, research regarding behavioral economics, the grounding of the new paradigm of 21st century business, and our vision for building a regenerative economy.<br>  \t<br>  \t                                                       This is an advanced course in 21st century brand building, though it’s laid out in such a way whereby high school students, college students, corporate executives, established entrepreneurs, budding entrepreneurs, strategic consultants, executive coaches, and human resource experts will all greatly benefit by this one-of-a-kind training program. It is my personal download of virtually everything I know about building a successful brand that is fitting for the 21st century. If you want to be armed with a new perspective of business, helping to differentiate yourself and your company, then this course is right for you.<br>  \t<br>  \t                                                       In this course, you will learn about:<br>  \t                                                           ~ the new paradigm of 21st century business<br>  \t                                                           ~ the new context for 21st century brand building<br>  \t                                                           ~ how behavioral economics will evolve our next economy<br>  \t                                                           ~ an emerging trend of <em>eXpansive entrepreneurism</em><br>  \t                                                           ~ a model to build a highly successful brand<br>  \t                                                           ~ Gallup’s research on maximizing human performance<br>  \t                                                           ~ And, how to leverage all of this information to strategically build the most   <br>  \t                                                              successful brand for (yourself and) your company.<br>  \t<br>  \t                                                       Everyone learns differently, which is why I have developed this course to accommodate the different learning styles. This course includes:<br>  \t                                                           ~ a comprehensive 44-page workbook <br>  \t                                                           ~ 46 branding videos<br>  \t                                                           ~ audio files of all the videos<br>  \t                                                           ~ 246 PowerPoint slides of all of the content contained in the course<br>  \t                                                           ~ Live monthly Q&amp;A conference calls to address questions, and facilitate a deeper <br>  \t                                                              understanding<br>  \t<br>  \t                                                       The information contained in this course includes the same information that I leveraged when doing brand consulting work with Gallup. Our minimum brand consulting engagement was $50,000, and went well into the 7-figures. This course will educate you for a fraction of the cost. <br>  \t                                                           ~ This course is only $20 (and was $388 when originally launched), and is guaranteed to change, and catapult the way you conduct business, and build your brand. <br>  \t                                                           ~ This course will arm you with information and strategies that none of your fellow <br>  \t                                                              colleagues and competitors will have.  <br>  \t                                                           ~ This course will change and evolve you as a progressive business leader.<br>  \t<br>  \t                                                       All students have the option to receive a 30-minute brand consulting session with me to help guide them in building a successful brand. My fee for brand consulting is $500 an hour, so this bonus is multiple times more than the price paid for this course alone. </p><p>  \t                                                       Take the first step to forever change yourself and your company, through building a powerful brand that is fitting for the 21st century. Take the leap of faith, as you have been led to here to realize that there’s a new and exciting way to build yourself, your company, and your brand.  Click on the <strong>Take This Course</strong> button, to change your life now...  </p>", 
    "end_date": null, 
    "title": "21st Century Branding | Powerful Brand Building Strategies", 
    "price": "20.00", 
    "instructors": "Bo Lockwood", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46598_0dd3_9.jpg", 
    "course_url": "https://www.udemy.com/21st-century-brand-building/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-20T05:21:02Z"
}