{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li><strong>There is one misspelled word in this description and I bet you can't find it (no one has yet)!  Shoot me a message if you think you've found it.</strong></li><li><strong>Please check out the video at the top :)</strong></li></ul>\n\n<ul><li>Here's <strong>what students are saying</strong> about 65 Actionable Branding Strategies:</li></ul>\n\n\n\n<p><em>\"I am rather blown away by the lectures, wanting to learn more about...the strategies and thinking about how I can deploy them.\"</em></p>\n\n\n\n<p>  \t<em>\"Branding...and so much more! If you are starting a business or looking to revamp a current business, this is THE course to take. So much information every step of the way and not one second of fluff, with the exception of the hilarious intro. This instructor not only knows his stuff, he delivers massive content in a fun way that draws the student in and allows for maximum consumption. Easy to understand and great video quality makes this course an A+ in my book. Looking forward to learning more!\"</em></p>\n\n\n\n<p>  \t<em>\"Anyone who has a business of any kind needs this course.\"</em>  </p>\n\n\n\n<p>  \t                                                                                                                          No fluff. No filler. In this course, you'll learn how to:  </p>\n\n\n\n<ul>  \t<li>Get publicity and advertising<strong> without spending a dime</strong></li>  \t<li>Create <strong>high-converting promotions</strong></li>  \t<li>Win customers for life with one extremely<strong> rare</strong><strong> but simple</strong> strategy</li>  \t<li>Establish expertise and authority <strong>in just six weeks</strong></li>  \t<li>Create <strong>viral names</strong>, USPs and logos for your brand and products</li>  \t<li>Go from talking to yourself to getting <strong>paid speaking engagements</strong></li>  \t<li>Use your customers to <strong>go viral</strong></li>  \t<li>Become <strong>the go-to resource</strong> for anything and everything related to your niche</li>  </ul>\n\n\n\n<p>  \t                                                                                                                                                                                You'll also receive $175 worth of Google/Bing and Facebook advertising credits and a great interview with billionaire Lynda Resnick, founder of POM and Fiji Water.</p>\n\n\n\n<p>  \t                                                                                                                                                                                          Now in addition to the 65 tactics I'm going to walk you through, I've included a list of <strong>100 content marketing case studies</strong> so you can see great examples of how small and large businesses have put some of these unique marketing ideas into use.  </p>\n\n\n\n<p>  \t                                                                                                                                                                                          To make the course easy to digest, each lesson is <strong>screen recorded in HD 1080p</strong> and includes <strong>transcripts and checklists</strong> in case you prefer text to audio or video. </p>\n\n\n\n<p> These checklists are great for review but also include a link to everything you see in the videos so you can easily find anything you need.  </p>\n\n\n\n<p>  \t                                                                                                                                                                                          I'll personally be answering any questions you have and I'll be happy to provide <strong>links, resources and any help I can offer you</strong> in developing your brand. </p>\n\n\n\n<p> I'll also be updating the course every month with new tactics and approaches to branding and marketing so that you're <strong>always up-to-date</strong>.  </p>\n\n\n\n<p>  \t                                          If you're looking for 65 unique and actionable branding / marketing strategies that will triple your profit and tons of free advertising credits, <strong>Click Take This Course</strong> at the top right.  Every second you wait is just money lost.</p>\n\n\n\n<p>Did you find the mispelled word?</p>", 
    "end_date": null, 
    "title": "65 Actionable Branding Strategies That Will 3x Your Profit", 
    "price": "25.00", 
    "instructors": "iMarket XL, Matt Jensen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333886_10b6_7.jpg", 
    "course_url": "https://www.udemy.com/branding/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-02T05:36:00Z"
}