{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><em><strong>Do you hate to be on camera, but do you need video?</strong> </em></em></p><p><em><em>\"</em> Solid Gold Animation Class . As with all Anneke's classes, this class is organized for maximum student success. Following her directions is easy, and if you do the work, you get results. Share your animations in the discussion area for each day, and get valuable feedback from Anneke on how to improve. At the end of this course, what do you get? Portfolio quality animations to display to clients with pride. For me, that is PURE GOLD. </em><em>\" <em>Nin Leavitt</em></em></p><p><em><em><strong>--------------------------------------------------------------------------</strong></em></em></p><p><strong>No time or energy to learn a new animation program with a steep learning curve?</strong><br></p><p>Then this course is for you!</p><p><strong>After the second Animation Challenge, you will have more than one animation video ready </strong>for use on your website, with a script and a voice-over.</p><p>The structure of this Video Made Easy animation course is very simple:</p><ul><li>each lesson has an animation problem,</li><li>basic materials to practise from to make an animation,</li><li>a animation as solution</li><li>step by step making of the animation.</li></ul><p><em><em><strong>--------------------------------------------------------------------------</strong></em></em><strong> </strong></p><p><em><strong><em>\"</em> Very inventive and thorough. This course used tons of actionable steps that made learning fun and easy - what an awesome approach to scripting and creating effective voiceovers, among many other skills!</strong><em><strong>\" </strong>Kristi Lambert</em></em> <br></p><p>You do not have to have done the first challenge, but is might be easier to do them in the right order. level 1, level 2 etc</p><p>What do you learn in this course:</p><ol><li>Learn how to glue a voice-over to a template in the free softare Powtoon.</li><li>How to make an animation from scratch with a voice over as a base.</li><li>Order a voice-over on Fiverr and try out the differences with your own voice</li><li>Work with fill-in-the-blank scripts, and find out where to get them for free.</li></ol><p><br></p><p><em><strong><em>\"</em> I found this course builds very nicely on part 1 where you learn to use Powtoon to make a video and add music. Starting with ready made voice-overs, Anneke shows students step-by-step how to time the scenes to the script, the theory of it as well as practical application so that, for me at least, this learning is useful not only for Powtoon, but also for other video programs I use. From there we learned the basics of script-writing and how to use fill-in-the-blank templates (provided) for our own projects. There was instruction on making voice-overs, options for equipment you could use and most importantly, how to clean up the audio track before adding to a video. </strong></em><em><strong>For those who prefer not to make their own voice-overs, Anneke demonstrated how to get professional quality work done for a low price.</strong><em>\"</em><strong> </strong><em>Trish Findlay</em> </em></p><p><strong>Video Made Easy 2</strong> is part of a series of 3 Animation for beginners courses.</p><p><strong>Video Made Easy 1</strong> is about working from templates in Powtoon</p><p><strong>Video Made Easy 3</strong> is about Outsourcing your animations for under $50.</p><p><strong>Join now, have your animation and video in the shortest time possible!</strong></p>", 
    "end_date": null, 
    "title": "Animation for Beginners(2)   Add Your Own Voice to Animation", 
    "price": "20.00", 
    "instructors": "Anneke Camstra", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/601394_9fcc_3.jpg", 
    "course_url": "https://www.udemy.com/animation101/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-03T13:22:01Z"
}