{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>How do you market a small brand when you don&#039;t have the\r\nmoney, staff, or other resources the Big Brands have? How do you successfully\r\ncompete in a marketplace when your competitors have much bigger budgets than\r\nyou do? </em></p><p>This course is designed to help small brands learn and apply\r\nBig Brand strategies, tactics, and techniques -- <strong>but they&#039;ll be tailored to\r\nbrand marketers with small budgets.</strong> Learn how to take maximum advantage of the\r\nbasics of brand marketing, and how to use the tools in your &quot;brand\r\nmarketing arsenal&quot; to market your brand like the big guys. This course\r\nwill cover all the bases: brand name, logo, slogan, positioning, packaging,\r\npublic relations, e-marketing, social media, all forms of advertising,\r\nnon-traditional media, and more. </p><p>Lots of examples will be shown and techniques revealed by a\r\nbrand marketing pro with more than thirty years of experience working with both\r\nbig and small brands. Plus, you&#039;ll gain <em>free access</em> to several valuable\r\nresources, including three eGuides and a collection of 40 brand profiles.</p><p>\r\n\r\n\r\n</p><p>If you want to learn how to put the most effective <strong>small business branding</strong> strategies,\r\ntactics and techniques to work for your small brand, then <strong>Big Brand Strategies\r\nfor </strong><strong>Small Brands</strong> is for\r\nyou!</p><p></p>\r\n", 
    "end_date": null, 
    "title": "Big Brand Strategies for Small Brands", 
    "price": "25.00", 
    "instructors": "Barry Silverstein", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21705_6717_8.jpg", 
    "course_url": "https://www.udemy.com/big-brand-strategies-for-small-brands/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-24T19:09:31Z"
}