{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong></strong></p><p><strong>They say: you have to stand out from the crowd, but how do you do that?</strong></p><p>You want to be<strong> more original,</strong> more you,<strong> but where do you start?</strong></p><p>You feel <strong>you are in a treadmill</strong> of things you have to do, and you don't have the time to think about it., but it does not feel good, there must be a better way</p><p><strong>You are bored </strong>with all the things you are doing, but you don't know how to change.</p><p><strong><em>Do you have half an hour a day to start changing?</em></strong></p><p><em>In this course I will show you how!</em></p><p><strong>You learn by doing</strong> in this 5-day Creativity Challenge.<br></p><p>Learn what works from an artist with 35 years of experience, with examples what has worked in her career.</p><p>No theory, No explanations, No step-by-step program.</p><p>Each day has a problem to solve, there is the solution of the teacher, and there are inspirational videos to watch.</p><p>Problems can be solved by using software that you already know and have at your disposal: wordprocessing, painting, video, animation software, or can be done in online software.</p><p>Five challenges to make room for being more creative in your work, business or life.</p><p>It takes effort, it asks you to step a little bit out of your normal ways and doings, it makes you give yourself presents. But is is not difficult.</p><p>Let this course surprise you about yourself, even if you say: I do not have a creative bone in my body!</p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Boost Your Creativity with a 5-Day Creativity Challenge ", 
    "price": "20.00", 
    "instructors": "Anneke Camstra", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/744664_3401_3.jpg", 
    "course_url": "https://www.udemy.com/creativity-creativity/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-28T10:28:21Z"
}