{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The reason I put this course together, is because It occurred to me, that while we all work hard to get results for clients every day, in the process we often neglect our  personal brands. </p>\n\n<p>The underlying structure for this course is a a plan I’ve created for myself, that has been well researched and tested. It’s predominantly an amalgamation of the hundreds of books I’ve read in the last few years, combined with all the insights and experiences I’ve noticed while working in the design and advertising industry.</p>\n\n<p>As I’m aiming this at creative professionals, I’m not going to teach you to suck eggs, and bore you with the basics of why personal branding is good for your prospects. Instead, I’ve condensed everything down into a clear set of theories, case studies and action steps that anyone can  take, that if followed, in time, will help them to reach these four, very specific goals.</p>\n\n<p>Number 1. Create £12,000 in revenue generated from minimal upkeep assets, so that you can, if you choose, leave full time work and put 100% into what really inspires and motivates you every day.</p>\n\n<p>Number 2. Create a minimum of 1000+ passionate followers that will help you to amplify your message and revenue potential.</p>\n\n<p>Number 3. Establish yourself as a leader in your chosen field by taking steps towards the goals in life that create disproportionate returns on investment.</p>\n\n<p>Number 4. Create a brand that will give you enough leverage, to open doors in all areas of life, and help you to life on your own terms.</p>", 
    "end_date": null, 
    "title": "Branding Shameless Guide", 
    "price": "20.00", 
    "instructors": "Ricky Richards", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/875156_23ff_2.jpg", 
    "course_url": "https://www.udemy.com/branding-shameless-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-11T09:33:21Z"
}