{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "A brand is a name, term, design, symbol or other feature that distinguishes one seller's product from those of others. Brands are used in business, marketing, and advertising, and for those establishing themselves as a public figure and yours needs to be DISTINCT! <p>Branding can focus on a variety of elements, including customer relationships based on a past experience and future expectations, brands can be defined by functional and emotional benefits that customers perceive, brands can be intended to influence customer behavior, and brands are an asset that must be actively developed and managed.</p>Brands are not only what we say, but also what we do, and brand strategy needs to balance our long term goals for growth with our current capabilities.<p><br></p><p>During Build a Brand Style Guide we will talk about:</p><ul><li>Brand Positioning Objectives</li><li>Brand Positioning Overview</li><li>Personification Exercise</li><li>Positioning Statement/ Tagline/Company Identity</li><li>Online tools to create a Brand Style Guide</li><li>How to use Your Brand Style Guide</li></ul><p>The primary objective of this course is to brainstorm, identify and define your Brand so you can create a resource document that captures who you are and what you do in a visual and recognizable format. The Brand Style Guide you create can be used to create consistency for your business or personal brand.</p>", 
    "end_date": null, 
    "title": "Branding for Entrepreneurs - Develop a Style Guide", 
    "price": "20.00", 
    "instructors": "Traci Synatschk", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722130_9c26_6.jpg", 
    "course_url": "https://www.udemy.com/build-a-brand-style-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-09T20:01:42Z"
}