{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>¿Cómo decidir en un mundo lleno de marcas? Incluso más importante, <strong>¿cómo logramos que nuestra marca sea única y memorable en un mundo cubierto por marcas?</strong> <strong>¿podemos ser indispensables para nuestra audiencia?</strong><br></p><p><strong>Branding - La Historia Detrás De La Marca</strong>, es un curso pensado para entregar las <strong>herramientas necesarias para convertir tu marca en una experiencia, una religión ... crearemos una marca única </strong>a través de la historia que la acompaña.</p><p>Durante las clases acompañaremos los conceptos teóricos con ejemplos del mundo real. De esta forma podremos comprobar el efecto que tienen sobre el desempeño de las marcas las decisiones que tomamos.</p><p>Comenzaremos nuestro recorrido por lo básico: ¿Qué es una marca?, para poco a poco avanzar hacia las implicancias de convertir tu marca en una experiencia para tus diferentes públicos. Lo importante es dar un paso más, y llevaremos esa experiencia a una verdadera religión a través de sencillos pasos.</p><p>El curso está pensado para gestores de marca, el equipo de una startup, un sitio web e incluso a profesionales buscando mejorar su propia marca personal.</p><p>Al final del curso serás capaz de situar tu marca a la par de Apple, Nike, Harley-Davidson y Lego. ¿Te animas?</p><p>Vamos a empezar!</p><p>Temario:</p><p>1) Nociones Generales</p><p>2) ¿Qué es una marca?</p><p>3) Los pilares de marca</p><p>4) Convirtiendo la experiencia en una religión</p><p>5) Marcas fuertes</p><p>6) Estrategia de Marca</p><p>7) Fidelización</p><p>8) Capítulo de cierre</p>", 
    "end_date": null, 
    "title": "Branding - La Historia Detrás De La Marca", 
    "price": "35.00", 
    "instructors": "José Ilabaca Santibáñez", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538370_d1f1_3.jpg", 
    "course_url": "https://www.udemy.com/branding-la-historia-detras-de-la-marca/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-27T02:35:14Z"
}