{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Let's face it. Long gone are the days when you could just run ads or make announcements about a new product or service. We live in a much different era.</p><p>These days, when promoting yourself, <strong>a personal approach is by far the best – especially in the digital world</strong>.</p><p>Glitzy advertising may still work sometimes in the offline world. But when people go online, they don't connect with logos, theme songs or mission statements.<br><strong></strong></p><p><strong>They connect with people!</strong></p><p>And when lots of people know who you are and what you stand for, you are in an incredible position to better your life and profit from your notoriety.</p><p><strong>That's the essence of the brand called YOU!</strong></p><p>Hi. I'm Bob Baker, and in 2001 I wrote a highly acclaimed book called <em>Poor Richard's Branding Yourself Online</em> – one of the first books about creating a personal brand identity on the Internet.</p><p>The book has been out of print for years. But recently I took the best timeless principles from it, updated them for the modern era, and released it as this online course.</p><p>It's like a crash course on “<strong>How to Use the Internet to Become a Celebrity or an Expert in Your Field</strong>.\" And you can consume the entire thing in about an hour or so.</p><p>Here's just some of what you'll find in the course:<br></p><ul><li><strong>Four ways to build trust and credibility online</strong></li><li>The hidden aspect that people rarely think of when it comes to personal branding</li><li><strong>How to develop a fan-club mentality to grow your brand</strong></li><li>The importance of having a hook to hang your branding hat on</li><li><strong>How one man ditched his career as a lawyer to become an artist</strong> (but he did it in a very specific way)</li><li>Branding lessons from Eric Clapton, Wayne Gretzky and Rush Limbaugh</li><li><strong>How to become your own “king of left-handed bowlers\"</strong></li><li>Why Tim Ferris, Marie Forleo and Danielle LaPorte have strong personal brands</li><li><strong>How to make yourself the #1 expert in your field</strong></li><li>Why you need to create and use a BIS to cut through the clutter</li><li><strong>The three types of names you can use online</strong></li><li>How to describe who you are, what you do, and the unique way you do it in one simple sentence</li><li><strong>And the seven components of your Brand-Building Game Plan</strong></li></ul><p>Are you ready to create a potent brand identity online?</p><p>I hope so. I would love to share these potent personal branding principles with you!</p><p><strong>Register for this course on Udemy today and get lifetime access to the lessons</strong>. Watch them on your computer, or on your smartphone or tablet using the free Udemy app.</p><p><strong>Plus, it comes with a 30-Day, Money-Back Guarantee! </strong></p>", 
    "end_date": null, 
    "title": "Branding Yourself Online: Building a Personal Brand", 
    "price": "20.00", 
    "instructors": "Bob Baker", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611204_1a9c.jpg", 
    "course_url": "https://www.udemy.com/branding-yourself-online/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T01:08:34Z"
}