{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>Brand Visibility</strong><br>  </p>  <p>  \t            What does &quot;telling your why&quot; mean and how can my &quot;brand visibility&quot; course help you? I not only brand and design it, but build it and broadcast it. Being seen today means being everywhere and building that awesome brand visibility that makes others say, &quot;is there any place you aren&#039;t?&quot; So, if you are not getting the results you want, based on what you&#039;ve done, or haven&#039;t done, this course is going to help reach your ideal clients!  </p>  <p>  \t            My class series will teach you how to Draw Your Exact Target Clients, Keep Them Engaged Over Time, and Build A Strong Brand That Will Have Clients Lined Up to Work With YOU! <strong><br>  \t</strong>  </p>  <p>  \t            Want to be found by your name, but also by the work you do and the industry you are in as well as your moniker or tagline?  </p>  <p>  \t            I have built the branding and astounding brand visibility for 100s of clients using data-proven SEO techniques and in the past 20 years have figured out how it all works. I know the secrets of the web and what a business must do to draw people to them, and not just everyone, but exactly who they want to attract. In these screencast tutorial video lessons (along with written content and worksheets), I show you by example, so it&#039;s very clearly explained.  </p>  <p>  \t<strong>Video #1</strong> – What is “Brand Visibility?” (6:54)  </p>  <p>  \t<strong>Video #2</strong> – <span class=\"external-link\">The Google Search: Understanding and Creating Long-Tail Keywords and SEO in Action.</span> (5:46)  </p>  <p>  \t<strong>Video #3</strong> – Is Your “Visual Footprint” in Sync? Does it Perfectly Represent Your Business? (6:30)  </p>  <p>  \t<strong>Video #4</strong> – Cross Pollination from Website/Blog to Social Media and Back Again. (3.26)  </p>  <p>  \t<strong>Video #5</strong> – Finding Your “Exact Target Audience” is the KEY! (5:05)  </p>  <p>  \t<strong>Video #6</strong> – Broadcasting and Celebrating Others to Attract New Eyes. (6:07)  </p>  <p>  \t<strong>Video #7</strong> – Why Giving Back Looks So Good on You. (7:45)  </p>  <p>  \t<strong>Video #8</strong> – Using Email Marketing, Opt-in Offers, and Social Media Correctly. (16:42)  </p>  <p>  \t<strong>Video #9</strong> – Are YOU as “Brand Ambassador” and Your Company in Sync? (8:56)  </p>  <p>  \t<strong>Video #10</strong> – Get Out There, Connecting with Others, Both Online and Offline! (9.27)  </p>  <p>  \t            Take this brand visibility course right now and watch your business change dramatically. It&#039;s going to be YOU everywhere and the answer to their needs!  </p>", 
    "end_date": null, 
    "title": "Brand Visibility", 
    "price": "45.00", 
    "instructors": "Susan Newman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33250_c4c5_19.jpg", 
    "course_url": "https://www.udemy.com/brand-visibility/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-21T01:46:56Z"
}