{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The Yoga &amp; Fitness industry is a tough industry to be successful in, whether you're an individual teacher/coach, or a studio/gym owner. Often dedicated and passionate yoga and fitness teachers get into this industry without realizing how much work it takes to gain and retain clients. If you want to build a community of regular students who love your style and want to continue to learn from you, this online course is a step in the right direction.<br></p>\n\n<p>Often people assume brand work is only for big companies, however, it's an important and strategic part of your marketing plan. <br>We need to shake up what we believe is the definition of a brand. A brand is not about having fancy advertising, or seeming corporate, it's about putting out to the world the type of teacher you are, what you stand for, and the way you teach it. It's what attracts the type of student to you that believes in the same things, and is eager to learn and grow from your lessons. Building your brand up, IS what builds your community.</p>\n\n\n\n\n\n<p>Learn to:</p>\n\n\n\n\n\n\n\n<p>- Attract new clients</p>\n\n<p>- Turn New Clients into Regular clients</p>\n\n\n\n\n\n\n\n<p>- Create loyal students, who send you referrals.</p>\n\n\n\n\n\n\n\n<p>- Create workshops and other events that are ideal for your students <br><br>This is the first step in crafting a successful way to put yourself out there to attract students, and build up your success as a yoga or fitness teacher.<br><br>All you have to do is take the first step, you will walk away with the knowledge in how to succeed.</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Building Your Community: Yoga Teacher Training in Marketing", 
    "price": "35.00", 
    "instructors": "Jason Campbell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/824494_d4e7_3.jpg", 
    "course_url": "https://www.udemy.com/building-your-brand-marketing-training-for-yoga-teachers/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-17T18:34:59Z"
}