{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>LATEST: Course updated on February 2016. </em></p><p><strong>Join more than 1000 students from 37 countries!</strong></p><p>Do you struggle \u000bwith creating effective \u000bsocial media images and logo, but don’t have the money to hire a designer?</p><p>The good news is – you don’t need to hire a designer or buy expensive softwares to create visuals for your digital projects. You can do it YOURSELF and with FREE tools, thanks to the amount of different resources that are available on the Internet. There are so many easy and quick solutions out there! Actually, even the most highly paid pros take help from the same resources you are going to learn in this course.<br></p><p>Take this course and learn, by practical examples, how to create your first logo, social network cover photos that are functional and adapted for smart phone users and beautiful social network posts for Facebook and Twitter by using only free tools and resources. While taking this course, you will also master basic features of PicMonkey and different Google Chrome plug-ins. <strong>This course will be your guide to different free sources: royalty free images, intelligent colour tools, image editing and screenshot taking tools. </strong>In short, after its completion, you'll be able to create visuals for your webpage, blog and social networks yourself and with no money spent. Moreover, in the end of the course you will know how to create visuals that represent your brand and help increasing your brand awareness. </p><p>Don't worry if you haven't studied in a design or art school, because with the tools available, ANYBODY can create beautiful images and logos for their digital projects. And this is what you will learn in the course. You will be able to create great visuals even if you are trying for the first time.</p><p>Since I value your time, the lectures are just as long as they need to be in order to show you practical information and tips. No empty talk.</p><p><strong>Don't wait too long to enroll!</strong> This course is going to have regular updates added in the future and I am going to share even more great tools and tips with you. Therefore, the price will increase once the course meets certain milestones. If you enroll now, you will receive all these updates free of charge. </p><p>In the case you don't find this course valuable, you can always receive a full refund within 30 days of purchase through Udemy!</p>", 
    "end_date": null, 
    "title": "Create a Logo & Eye Catching Social Network Images", 
    "price": "25.00", 
    "instructors": "Anita Nipane", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/349798_13e3_3.jpg", 
    "course_url": "https://www.udemy.com/create-a-logo-and-images-that-support-your-brand/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T17:13:25Z"
}