{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Over the past 24 years, Brett Mcfall has written over 10,000 adverts, sales letters and websites for 153 different industries. Brett McFall on stage at the National Achievers Congress, MelbourneToday he's known more for his internet marketing businesses and his ability to teach internet marketing in an easy-to-understand way.<span style=\"\"></span></p><p style=\"\"><span style=\"\">Many big pieces of advertising in the recent history of business have been written and tested by this great advertising genius and now he reveals in one full package all his secrets to let you know the amazing way to success </span></p><p style=\"\">I am really excited to share with you the great experience I had when I discovered the great secrets of writing powerful and cash-pulling advertising pieces following steps by steps the great teachings of Brett McFall.</p><p style=\"\">I knew of Brett McFall occasionally searching on the Internet. I had the experience to grab some reports he wrote during these years and listened him speaking at some live Internet events. I soon realized that... </p><p style=\"\">...what I was reading was really a map to a goldmine...</p><p style=\"\">and I said but what's this guy's story? Testimonial after testimonials, review after review I ended up with a picture of a really amazing world class advertising genius.</p><p style=\"\">Today there are many people that aske him to write advertising letters both online and offline and they pay him $15,000 at each direct mail piece!</p><p style=\"\">The amazing story was that one day I asked him to start a mega project. After months of hard study I had picked up so much from this great experience and I created a video tutorial recording all the tips and tricks a copywriter should have.</p><p style=\"\">Many people today are spending a lot of money to have their advertising pieces written and... </p><p style=\"\">...in just few steps You can become a world class copywriter.</p><p style=\"\">Following the techniques in this course you can literally create your own piece in the same day you are thinking of it. It's so easy with training by Brett that at the end of the program you will say: \"I did not even think it possible but now I am doing it\".</p><p style=\"\">Many people have written amazing pieces after his lessons and now they are making a lot of money selling their own products and writing copies for others.</p><p style=\"\">The experience I had reading from Brett was amazing, I have learnt more in those periods than in all my life and in a matter of a few weeks I wrote my first advertising piece.</p><p style=\"\">But I am making your life easier than mine through studying this material that I created. You can take the same train that took me some months and shock it down in the 6 hours that you can watch and listen to at your own pace </p>You have an immediate picture of the amazing advertising secrets possessed by so few <p style=\"\">You have to spend very little time to discover and digest these amazing pieces of the advertising history.</p><p style=\"\">You have a clear picture of what the message Brett wants to transmit is. You can watch the real examples and case studies that have made the success of big companies.</p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Exclusive Insights from Australian's Copywriter Brett Mcfall", 
    "price": "20.00", 
    "instructors": "Daniele Protti", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267426_a050_3.jpg", 
    "course_url": "https://www.udemy.com/exclusive-insights-from-australians-copywriter-brett-mcfall/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T16:16:52Z"
}