{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul style=\"\">  \t<li style=\"\">Not sure what corporate structure is good for your new company?</li>  \t<li style=\"\">Confused on why so many corporations are formed in Delaware?</li>  \t<li style=\"\">Want to insure that your concept is protected from copy-cats?</li>  \t<li style=\"\">Not sure if you need to <strong style=\"\">trademark</strong> your logo?</li>  </ul>  <p style=\"\">  \t     This is the only course you&#039;ll need to make sure you have all of your administrative items covered before you introduce your brand to the marketplace.  </p>  <p style=\"\">  \t     Protecting your brand&#039;s <strong style=\"\">name, logo</strong> and idea is very important and needs to be done before you begin anything that may be seen by the consumer.  </p>  <p style=\"\">  \t         Learn how to determine if you should file your business as a <strong style=\"\">Limited Liability Company</strong> or an <strong style=\"\">S-Corporation</strong>, as well as where to register filing forms by looking at the benefits of filing in your home state versus <strong style=\"\">Delaware</strong>. Learn the ins-and-outs of trademarking, from your brand&#039;s word mark, design/logo marks, and <strong style=\"\">DBA</strong>s (Doing Business As), while also learning the benefits to having an attorney versus doing it yourself.  </p>  <p style=\"\">  \t      The Course Videos last a total of 37+ Minutes.  </p>  <p style=\"\">  \t      The Course is structured into 7 Lectures.  </p>  <p style=\"\">  \t      If you have question relating to the course, please feel free to contact me here on Udemy!  </p>  <p style=\"\">  \t      Please don&#039;t forget to leave me a comment and a rating if you think it is appropriate to do so. :)  </p>  <p style=\"\">  \t      If you enjoyed this Course you may like to consider my other Courses here on Udemy:  </p>  <p style=\"\">  \t      Fashion Brand Launch: Market Research Strategies &amp; Analysis  </p>  <p style=\"\">  \t       Testimonials:  </p>  <p style=\"\">  \t        ~ Very informative. A great detailed overview of the necessities needed for launching a brand. Great amount of knowledge and insight presented. From practical to inspirational - STEVYN  </p>  <p style=\"\">  \t        ~ It was jam packed full of info I was really looking for! – Cassy  </p>  <p style=\"\">  \t        ~ Great visual aids &amp; amazing webinar overall; extremely appreciative of the wealth of knowledge shared - SHANYA  </p>  <p style=\"\">  \t        ~ Great, easy to understand and follow. – Joseph  </p>  <p style=\"\">  \t        ~ A lot of people start a business and don&#039;t know the first thing about starting a business, so this was helpful.- Crystal  </p>  <p style=\"\">  \t        ~ I really enjoyed this. I don&#039;t know much about business but have an Idea and dream so this is very helpful and I can follow.  This will give me a guideline.  Thank you – Mona  </p>  <p style=\"\">  \t        ~ I LOVE BOARDROOM ROCK STARS – TG  </p>  <p style=\"\">  \t        ~ Highly recommend - JACKIE  </p>", 
    "end_date": null, 
    "title": "Fashion Brand Launch: Corporate Filings and Trademarks", 
    "price": "20.00", 
    "instructors": "Ward & Fifth Consulting", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266964_9b75_8.jpg", 
    "course_url": "https://www.udemy.com/fashion-brand-launch-corporate-filings-and-trademarks/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T00:59:44Z"
}