{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">350 + Students discovering themselves, their truth, their purpose and their message: </strong>  </p>  <p style=\"\">  \t            &quot;Lena is detail-orientated, knowledgeable and patient. She has a clear concept of your needs and addresses them by giving you short-term and long-term goals within your reach. She encourages and guides you. She offers her experience in a variety of fields for you to adapt to your necessities.&quot; Carol Graham - Author (Washington, United States)  </p>  <p style=\"\">  \t            &quot;Your dedication and integrity to your craft is admirable. I have enjoyed the process of clarifying my message, creating a brand that feels authentic and which reflects the truth of who I am and what I offer. I can highly recommend your services to anyone who is ready to take that next courageous step in their business, and I can guarantee that they will NOT be disappointed with the abundant SuperNova magic you provide! Thank you!”&quot; Eleftheria - Sacred Feminine Alchemist Facilitator (Cape Town, South Africa)  </p>  <p style=\"\">  \t<strong style=\"\">Here&#039;s what you should know about this course.</strong>  </p>  <p style=\"\">  \t      How to&#039;s and check lists are great, and you&#039;ll get some powerhouse tools to meet those needs ... but this isn&#039;t a course that lives on paper. It&#039;s a being process. What that means is it lives in the application. So most of the learning and mentorship happens within and around this course in a specialized community that&#039;s designed to help you win.  </p>  <p style=\"\">  \t      That&#039;s why when you sign up for this program you have life time access to unlimited upgrades, specialized content, and front row seats to experiences that amplify your brand and marketing in a purposeful authentic ways.  </p>  <p style=\"\">  \t      If you&#039;re up for personalizing your learning, make use of the private tribe platform. Here&#039;s your invitation to customise your experience ... and actually get mentored in the process!  </p>  <p style=\"\">  \t  I&#039;ve distilled the soul of an $299 program into this course - without taking anything out - and it&#039;s been a game-changer of note in my life, and in the brands of my clients.  </p>  <p style=\"\">  \t  See you inside !!!  </p>  <p style=\"\">  \t<strong style=\"\">So what&#039;s this all about? </strong>  </p>  <p style=\"\">  \t                          In a world of cold calling, spam, and power-house sales, there are a lot of entrepreneurs (specifically purpose centred ones) who struggle to put themselves out there.  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t                          ·Maybe sales feel foreign.  \t</p>  \t<p style=\"\">  \t\t                          ·Or the idea of blogging leaves you breaking out in hives.  \t</p>  \t<p style=\"\">  \t\t                          ·Perhaps the only kind of networking you end up doing at those networking events, is with your mobile / or is it the snacks table?  \t</p>  \t<p style=\"\">  \t\t                          ·Maybe … just maybe, marketing makes you want to drop your head in the sand.  \t</p>  \t<p style=\"\">  \t\t                          ·Or perhaps this whole thing feels like an out of body experience.  \t</p>  </ul>  <p style=\"\">  \t                          Chances are things feel inauthentic. And that’s why you’re brushing up with all this resistance.  </p>  <p style=\"\">  \t          We see how some of the big guys (and the want-to-be&#039;s) are amplifying themselves and making millions in ROI. Great! But all of that gives me the chills. How about you? It&#039;s all so pushy - salesy - celeb driven and above all very over produced and fake.  </p>  <p style=\"\">  \t            Over the years I had to personify my success formula, and tune into what’s genuine for me … In meeting those moments, and stepping into those spaces – I discovered a little bit more of who I am – and what it is that I offer. And above all, the why!  </p>  <p style=\"\">  \t                          From there people started drifting into my orbit asking me how to market themselves authentically … and to cut a long story short … here we are.  </p>  <p style=\"\">  \t                          This is an online course that helps you discover your authentic self, anchor your brand, and deliver something that&#039;s genuine and purposeful. It&#039;s actually the distilled essence of one of my most popular coaching programs that get&#039;s raving reviews such as:  </p>  <p style=\"\">  \t              “<em style=\"\">Lena is a very insightful. The sessions I had with her evolved easily through my ideas that were very vague to come to a more workable tangible plan. I have worked with two other business coaches locally and neither one was able to help me in the way that Lena has. She is knowlegable in the work of creating and establishing a business and is also a skilled coach. I highly recommend her services and I have been doing exactly that! Thank you Lena I am very grateful for your grace in conversation and your instinct and insights.&quot; </em>Catherine - Australia  </p>  <p style=\"\">  \t                          Though a series of videos, presentations, illuminating resources, insightful assignments and a dedicated support group - this course will introduce you to what it takes to be an authentic brand ambassador when it comes to the business of you.  </p>  <p style=\"\">  \t          Lena Ski  </p>", 
    "end_date": null, 
    "title": "How to market yourself (and your purpose) authentically.", 
    "price": "20.00", 
    "instructors": "Lena Ski", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/280124_ed2f_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-market-yourself-authentically/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-13T12:54:40Z"
}