{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>The How To Build A </strong><strong class=\"redactor-inline-converted\">Responsive Author Website course will show you how to create an original, professional-looking, mobile responsive author website, where you can engage with your readers and turn them into fans</strong></p>\n\n<p>One of the biggest hurdles that a new author faces at the beginning of their self-publishing career is that of anonymity.</p>\n\n\n\n\n\n<p>Fortunately, there are a number of strategies available to self-published authors to overcome this, such as <em>Perma-free Books</em>, <em>Lead Magnets</em>, <em>Front and Back Matter Promotions</em>, <em>Search Engine Optimisation</em>, <em>Video Marketing</em> and <em>Guest Post Commenting</em>, each of which can be very effective.</p>\n\n\n\n\n\n<p>Central to all of these promotional strategies is an online presence and in particular an author website.</p>\n\n\n\n\n\n<p>If you have yet to start building your writer platform, then now is the time to do so, beginning with the creation of a great looking author website.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">A step-by-step guide to creating a professional responsive website that you will be proud of</strong></p>\n\n\n\n\n\n<p>In this course, you will get an over-the-shoulder view as I build a responsive author website totally from scratch for one of my niches, step-by-step.<br></p>\n\n\n\n\n\n<p>In this way you will learn:</p>\n\n\n\n\n\n<ul><li>How to brand your author website, create a Gravatar, choose a domain name, a hosting package and how to propagate your domain name to your hosting package</li><li>How to install WordPress, configure the basic settings, install a premium theme, install a premium skin and customise your website to make it look totally original</li><li>How to choose the correct plugins for your website, add engaging content and of course your library of books.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\"><br>The building of a mobile responsive author website really is a MUST for every self-published author. And this course will walk you through it every step of the way.</strong><br></p>", 
    "end_date": null, 
    "title": "How to Build a Responsive Author Website", 
    "price": "40.00", 
    "instructors": "David James Ault", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831298_3311_2.jpg", 
    "course_url": "https://www.udemy.com/responsive-author-website/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-25T12:16:41Z"
}