{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will make you a much stronger entrepreneur, and enable you to find an almost unlimited number of top domain names on your own!</p><p>A great A-level domain name will do wonders for your business. All your clients and potential business contacts will be impressed. A great domain makes the entrepreneur look savvy and experienced.</p><p>Plus, your clients will trust you more because your company will look professionally branded, and more legitimate. </p><p>Additionally, once you practice my strategies enough, and become good at finding great domain names, you will be able to sell them online, and generate an income that way.</p><p>Before you start any project in the future, or if you don&#039;t have a website or a domain name yet, get this course and follow my creative strategies for finding a domain name. You will be so happy that you took this curse because a domain name can stay with you for years, and all it takes is a great 1-time effort in the beginning. And then, every day after that, you will be reaping the benefits of having an A-level domain that impresses people and makes you look like a great entrepreneur.</p><p><strong style=\"\">Money Back Guarantee</strong></p><p><em style=\"\">The course comes with an unconditional, Udemy backed, 30 day money-back guarantee. It is also my personal promise to you that you will get great value from the course and succeed. </em></p>", 
    "end_date": null, 
    "title": "How to get great domains & start a business selling domains", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466978_4ec5_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-great-domains-start-a-business-selling-domains/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T21:46:36Z"
}