{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t      Almost every product has packaging that cries out to be noticed on the shelves in stores. So obviously, wisely-chosen and well-designed packaging will attract the attention of potential customers. Packaging motivates consumers to pick the product up and examine it, and this is a major step towards making a purchase. Nowadays, as informational space is filled with ads, and consumers’ attention is scattered, the role of packaging is crucial. Well-designed packaging can be one of your most important business partners.  This course was developed by experts from the Open Union of Packaging Designers and is the only learning program which focuses on packaging as a stand-alone marketing tool. This is a one-of-a-kind course that has no rival.   You will learn to create packaging that is suitable for different target audiences, and to conduct market research. The more precisely the target audience is defined, the easier it is to sort out and implement the necessary criteria for packaging design. You will learn what kinds of packaging attract attention, and what kinds of packaging buyers don’t like. You will understand consumer behavior more clearly. There is also a section dedicated to retailer requirements, a subject most people don’t know the first thing about. You’ll learn to evaluate the effectiveness of packaging and you’ll see why increased sales aren’t the only way to measure success. At the end of this course, we have prepared seven tests, which will allow you to evaluate the knowledge you’ve acquired.  The course will come in handy for designers, brand managers, marketing students and manufacturers of different kinds of products. We want to teach you how to think, analyze and develop packaging like a professional.  </p>", 
    "end_date": null, 
    "title": "How to create packaging that sells", 
    "price": "20.00", 
    "instructors": "Open Union of Packaging Designers", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/91456_d7a4_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-packaging-that-sells/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-12T09:46:02Z"
}