{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>How to remove defamatory content about you or your business off the Web will enable you to stop online abuse defamation and copyright infringement. The instructor shares his letter and email sent to shut down the websites of his attackers and stopped ongoing use of stolen content and defaming language that was not in compliance with the law and policies of the publisher. This course is sequenced in short vignettes that guide you step by step on how to leverage federal law to stop copyright infringement and defamation.</p><p>Do you feel Overwhelmed when you’re feeling defeat after an online attacker has compromised your reputation or worse tarnished your life and your business? </p><p>Wondering how to get started? Who to talk to? What to write? How to get people pay attention to your specific case?</p><p>Then I have you covered if you have questions, shoot me a message or post in the discussion. My goal is to help you keep moving forward and never lay down to online abuse and illegal practices targeting you and your brand. </p><p><strong>Summary: How to get negative content about you removed from the web  </strong></p><p>The course will enable you to take action based on your legal rights to possibly stop online abuse defamation and copyright infringement. </p><p><strong>After Taking This Course, You Will:</strong></p><p>Be elated you are on the path to stopping online defamation and/or copyright infringement without having to hire an attorney. </p><p>Know who to contact and it what manner to be most effective at removing content stolen from you or language posted online that has defamed or infringed on your legal rights.</p><p>Know exactly how much legal power you have even if you’ve never filed a copyright or filed a complaint against your attacker. </p><p>Have my exact letter and email templates I used to stop my perpetrator and infringing persons.</p><p><strong>What is included?</strong></p><p>12 lectures with over 1 hour of content</p><p>Downloadable templates</p><p>Instructions to help you get set up and running!</p><p><strong>PLEASE NOTE:</strong> I’m not an attorney and advise you consult legal counsel with questions for further information beyond what I believe you can do independently. I did it, so can you.</p>", 
    "end_date": null, 
    "title": "How to get negative content about you removed from the web  ", 
    "price": "20.00", 
    "instructors": "Jerry Hart", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610830_b20a_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-negative-defamatory-content-about-you-removed-from-the-web/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T16:29:19Z"
}