{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The best way to define yourself as a leading expert in your field is to write about it and post on top websites.  Blogging is by far one of the best ways to increase traffic to your website, promote your goods and services, create your brand, deepen your online presence, and develop a “following.”</p>\n\n<p>By taking this course you will learn: </p>\n\n<p><strong>* The benefits of blogging</strong></p>\n\n<p><strong>* The proper blog format</strong><br></p>\n\n<p><strong>* How to make the most of the format </strong></p>\n\n<p><strong>* If 50% of readers are going to read your articles on their mobile phones is it better to include horizontal or vertical photos?</strong></p>\n\n<p><strong>* What subjects you should write about</strong></p>\n\n<p><strong>* What subjects you may want to avoid</strong></p>\n\n<p><strong>* Search Engine Optimization (SEO) by strategically using backlinks in your articles</strong></p>\n\n<p><strong>* What you can and cannot include in articles.  For example, embedded videos, photos, etc.</strong></p>\n\n<p><strong>* How to carefully craft your niche </strong></p>\n\n<p><strong>* How to determine the best tone for your article (very important!)</strong></p>\n\n<p><strong>* Do positive or critical argues get more traction?  (Depends on the websites on which they are posted.)</strong></p>\n\n<p><strong>* All of the things you need to consider before you submit your articles</strong></p>\n\n<p><strong>* How to submit your articles to top websites</strong></p>\n\n<p><strong>* How to navigate your way through the websites' software programs such as Backstage and Wordpress </strong></p>\n\n<p><strong>* When is the best time to submit your articles</strong></p>\n\n<p><strong>* How to promote your articles once they are posted</strong><br></p>\n\n<p><strong>* What you can expect from blogging (Is it realistic to expect to get a book deal from blogging?)</strong></p>\n\n<p>This course is comprehensive and will give you insider insights from the over 200 articles I have posted over the past 4 years, some of which have gone \"viral\" and been Tweeted to millions of people and shared on over 10,000 Facebook pages.  If you are looking to define yourself as a leading expert in your field then this course will definitely send you on your way!</p>", 
    "end_date": null, 
    "title": "How To Brand Yourself As A Leading Expert In Your Field", 
    "price": "50.00", 
    "instructors": "Ira Israel", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758066_13aa.jpg", 
    "course_url": "https://www.udemy.com/howtowriteforthehuffingtonpost/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T05:50:37Z"
}