{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>The Grand Brand Sandwich: From Purpose to Profit</strong>, allows students to clearly define their mission, communicate it efficiently, and create marketing assets that will exude the brand's purpose, leaving room to provide value and ultimately increasing profits. Cheryl has a unique approach to creating powerful mission statements, brand semantics, effectively pitching new clients, email marketing, creating great graphics, utilizing sound and videos, increasing online engagement and so much more! This isn't about finding your personal brand so you can tweet it once. <strong>This course is about discovering and deploying brand alignment to attract the right customer and increase profits.</strong></p><p>Each video lesson is a personal conversation with Cheryl that will guide you to becoming your grandest brand. Supporting materials are provided in the form of pdfs or excel documents for your convenience. <br><strong></strong></p><p><strong>The Grand Brand Sandwich course is <em>the</em> most profound, time-effience and cost-effective way to:</strong></p><p><strong>1)</strong> declare your purpose and mission and share this \"Statement\" aka Commitment through your branding,</p><p><strong>2)</strong> create a Brand Assessment one-sheet to hone in on your messaging and voice and distribute to potential hires, collaborators or contractors,</p><p><strong>3)</strong> write pitches to make unreasonable requests (hint: the BEST way to see the BIGGEST results!),</p><p><strong>4) </strong>create marketing assets (including social media headers and informational videos using a very specific formula),</p><p><strong>5)</strong> align your brand messaging with your mission such that the colors, fonts, and consistency of your brand's look and feel will attract the right customer. </p><p>Do not hesitate. Put this brand strategy in place <em>today</em> to set yourself apart from the competition tomorrow.</p>", 
    "end_date": null, 
    "title": "How to REALLY Profit With Branding: The Grand Brand Sandwich", 
    "price": "50.00", 
    "instructors": "Cheryl B. Engelhardt", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/686124_a634_2.jpg", 
    "course_url": "https://www.udemy.com/grand-brand/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-01T15:58:04Z"
}