{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Since I have around 650,000 follower on twitter, and I have had many people asking me to help them understand Twitter, I decided to produce this course on twitter. You will expand your knowledge of the most talked about social media platforms available to you, and learn the basics first, before you expand your knowledge through some of the more complex uses of twitter. </p><p>Since learning the terminology, the twitter jargon, of twitter is important to understanding how it works, you will learn this first. Next, you will start learning the tools that will make your life easier and much more productive on twitter. Finally, you will learn how to enjoy twitter and have a blast on it as you make friends form around the world.</p><p>You will be guided by videos and screen captures of the various tools so you will be given a hands on learning experience. You will also be able to ask questions which i will answer as quickly as time permits.</p><p>You can use twitter for business and personal objectives, or even a mixture of the two, which I think is best. You will have a much larger reach on twitter than any other platform, reaching millions of people around the world using certain techniques I will be teaching. To increase your reach, your connections everywhere, there is no better social media platform than Twitter. As a business tool you will see this is the biggest net you can cast to fondle people into your pipeline that you need to build your business.</p><p>I invite you to learn twitter and the real fun from being part of a fantastic world of people. <br></p>", 
    "end_date": null, 
    "title": "Mastering Twitter", 
    "price": "20.00", 
    "instructors": "Mr. Johnny Ray", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645412_eef6_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-twitter/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T02:08:11Z"
}