{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Probably you saw many infographics on the web and thought how great they look. And they also seem so sofisticated. If you are like most people you said yourself \"<em>They look awesome, but it is too difficult for me and paying a graphic designer would cost a fortune</em>...\"</p><p>This is true... and not. It is true that paying a designer to design your infographic would cost you a lot of money. </p><p>But it is not true you cannot do it by yourself.</p><p>Since infographics are one of the most sofisticated type of image you can use on social media, blog or online, having your own infographics usually help a lot in positioning you as <strong>an authority in your niche </strong>(asumming you know your niche and can help people get results).</p><p>This course is a beginner course on how to create <strong>professional looking infographics</strong> for social media and blogging, by using Canva's free tool. It is intended for people who want to position themselfes, their products ans services and be seen as an authority (like ...\"<em>that guy know what he talks about, look what complex and stunning infographics he is able to publish..\"</em>)</p><p>And to also capture attention on social media.</p><p>You don't need any graphic design experience, just start from zero and create amazing infographics that look awesome.</p><p>You will learn </p><ul><li>how to create your Canva account, </li><li>how to use the design dashboard, </li><li>how to add images, </li><li>how to format the text areas, </li><li>how to find out already prepared text blocks that look professional, </li><li>how to add shapes, </li><li>infographics elements, </li><li>graphic objects, frames, lines, illustrations </li><li>how to do your research to know what kind of information to include in your infographics</li><li>the most important types of infographics + how to choose the right type for you and </li><li>how to export your infographics from Canva to your social media and blogs.</li></ul><p>By taking it, you will be able to understand and master the art of creating high quality infographics images in the step by step demonstrations. In your own pace.</p><p>My name is Florin Rosoga, I managed hundreds of social media campaigns for myself or my clients in the last years.</p><p>One of the most important elements of them are the images you use. Since social media is a visual place, an engaging image will improve your social media campaign conversion.</p><p>In this course you will get step by step video explanations to help you understand in a comfortable way all about creating this kind of infographics in minutes, for free and without any previous graphic experience.<br></p><p>The entire course can be downloaded as a video training to watch or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next...<u><strong> click the Take this Course button</strong></u> top right and you'll be taken to our secure payment page.</p><p>Just <em><u>Enter Your Regular Details</u></em> and complete your investment to have immediate access.<br></p><p>Stop struggling with boring images on social media and start mastering infographic design in minutes, just like a pro!</p><p><strong>Thank you for reading this and learning about my course </strong>... I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE </strong>to get started!<br></p>", 
    "end_date": null, 
    "title": "Master Professional Unique Infographics For Beginners", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642658_e54c_7.jpg", 
    "course_url": "https://www.udemy.com/create-infographics-in-canva-infographics-graphic-design/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T17:59:50Z"
}