{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tThis course is designed specifically for &quot;Entrepreneurs With Heart&quot;...  in other words for people in business whose <em style=\"\"><strong style=\"\">main priority is helping  more people and making more heart-based profits.</strong></em> If you don&#039;t deeply  care about people, this course isn&#039;t what you&#039;re looking for.  </p>    --------------------------------------------------------------------------------------------------------------------------------  <p style=\"\">  \tMarketing doesn&#039;t have to be the cold, disconnected discipline of manipulating people. In fact, the best marketing doesn&#039;t come across as marketing at all.<br style=\"\">  \t<br style=\"\">  \t    What if you could learn the secrets of marketing within a holistic framework?<br style=\"\">  \t<br style=\"\">  \t    Would you <strong style=\"\">reach more people</strong>?<br style=\"\">  \t<br style=\"\">  \t    Would your business suddenly <em style=\"\"><strong style=\"\">overflow with more profits and opportunities</strong></em> to serve?<br style=\"\">  \t<br style=\"\">  \t    Absolutely.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Discover the Heart of the Matter</strong> when it comes to building your brand, <em style=\"\">reaching more people who love to work with you</em>, and make more heart-based profits.<br style=\"\">  \t<br style=\"\">  \t    At the end of this course you will have <strong style=\"\">a custom roadmap</strong> perfectly crafted to guide every marketing decision you&#039;ll ever have to make again.<br style=\"\">  \t<br style=\"\">  \t    Along the way, you will learn about some incredible parts of the brain that help you (and your clients) get everything you&#039;re looking for.<br style=\"\">  \t<br style=\"\">  \t    You learn <strong style=\"\">intelligence boosting exercises</strong> to use in the workshop section and the fundamental steps to successful communication.  </p>  <ul style=\"\">  \t<li style=\"\">Money is made in the mind (mentally) before it is ever made in the hand (physically)</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Dollars are ideas people trade for your products &amp;amp; services (your business ideas).</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Optimize creative brain states for more authentic, holistic, problem-solving marketing campaigns.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Possess <strong style=\"\">your own customized 1-Page branding matrix</strong> that is at the heart of every business with remarkable messages and customer-winning products.</li>  </ul>  <p style=\"\">  \t<em style=\"\">This isn&#039;t your grandma&#039;s course in marketing</em>... and we don&#039;t pretend it is. This is a <strong style=\"\">full-on, focus your attention, unleash your imagination, meaning-making, brand building, high-definition ride </strong>for holistic practitioners, business owners, and any Entrepreneur With Heart crazy enough to go out and change the world with their skills, services, and passion.<br style=\"\">  \t<br style=\"\">  \t    One of the core principles (you&#039;ll learn on the inside) is + GOODNESS IN, GOODNESS OUT + , a powerful meme that shifts the odds in your favor. If you don&#039;t get anything good from the course, Udemy gives you 30 days to refund your cost for the course.<br style=\"\">  \t<br style=\"\">  \t    We will be adding new lectures and materials along the way and as a Metaphysical Marketing Entrepreneur, you&#039;ll also get special access to other courses I release.<br style=\"\">  \t<br style=\"\">  \t    I can&#039;t wait to show you how to <strong style=\"\">make more Heart-Based Profits</strong>, increase the magnitude and reach of your brand, and create your own million-dollar brand blueprint.<br style=\"\">  \t<br style=\"\">  \t    Go ahead and take this course now to <em style=\"\">discover your brand power, grow your tribe, and make a more meaningful impact</em> with your business materials.  </p>  <p style=\"\">  \t    Metaphysical Marketing mobilizes customers through any media... social media... email lists... information products... live seminars... even coaching, consultation, and instruction... by giving you the road-map of influence and desire... leading to dollars and value delivery.  </p>  <p style=\"\">  \t    I&#039;ve helped thousands of people transform their lives, relationships, and businesses for over a decade. I made this course to help solve the problem of &quot;poor marketing&quot;... and to show you how to make your business more profitable by marketing with more HEART... the central organ vital to every buying decision.  </p>  <p style=\"\">  \t    &quot;Horne brings heart to projects… you will be well served to work with him.<strong style=\"\"> Keeping a flow increasing</strong> is the best way I can describe his services.&quot;- Dr. Ben Mack  </p>  <p style=\"\">  \t    If you&#039;re ready for a remarkable, new future serving more customers and making more money... to fund the life you&#039;re dreaming of... take this course now. If you&#039;re the same person and your business isn&#039;t changed from what you gain here.. you can leave the course and get all your money back within 30 days.  </p>  <p style=\"\">  \t    P.S. Lifelong students are first to get helpful, bonus resources that are not included in the core lectures. You&#039;ll always get priority discounts or exclusive sneek-peeks on new courses I release.  </p>  <p style=\"\">  \t    P.P.S. You&#039;ll receive a certificate for Metaphysical Marketing when you complete your 1-Page brand matrix and finish the course.  </p>  <p style=\"\">  \t  Come in and Start Learning Now.<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Metaphysical Marketing ", 
    "price": "20.00", 
    "instructors": "Bodhi Horne", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295365_6acc_4.jpg", 
    "course_url": "https://www.udemy.com/metaphysical-marketing-bodhi-horne-holistic-success/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-06T17:40:54Z"
}