{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>** Course Updated December 23, 2015 **</strong></p><p>Everything you do, write or say can be online within minutes.<br></p><p>Yes, mistakes do happen, but they can quickly cause harm to the online reputation of your business or you as an individual. </p><p>For businesses, bad reviews from unsatisfied customers; negative news; legal troubles and other matters can quickly spell doom for your company. </p><p>For individuals, unflattering photographs circulating in social media; controversial conversations in Twitter and, yes, even legal issues can all equate in you having a difficult time finding employment after college. </p><p>In this course \"Online Reputation Lab: Protecting Your Business Image,\" we'll review five case studies in which companies and individuals are suffering through a rough time with their online reputation. However, we'll also offer some solutions on how they can start taking steps in repairing their reputation as well. </p><p>Every business and individual has either a good or bad online reputation. A negative online reputation can be built up over time or, in some cases, an event can cause immediate harm. In either case, reputations need to be fixed either by \"emergency\" plans or through a long-term program.</p><p>The best course of action is to prepare an execute an ongoing online reputation management program which helps maintain a positive online image and protects from any negative search results. </p><p>In this course, we'll break down:</p><ul><li>What is Online Reputation?</li><li>What is Online Reputation Management?</li><li>How to review Online Reputation for a business.</li><li>How to review Online Reputation for an individual.</li><li>How to create and implement an Online Reputation Management program.</li></ul><p><br>* * *</p><p><strong>About the Instructor, Steve Phillips</strong></p><p>With over 15 years of Search Engine Optimization (SEO) and Online Reputation Management (ORM) experience, Steve Phillips has helped clients create, improve and optimize their online business profiles and repair their online reputation.</p><p>Clients he counseled across a wide variety of businesses include heating and cooling; law firms; accountants; dentists manufacturing; florists; photographers; mental health service providers, and many others. </p><p>Online Reputation Management (also known as \"ORM\") is vital for all businesses and professional services in developing and maintaining a positive appearance for companies; business owners; professionals; staff; products and services. A business owner or their marketing staff must consistently be on top of their ORM before a PR crisis occurs.</p>", 
    "end_date": null, 
    "title": "Online Reputation Lab: Protecting Your Business Image", 
    "price": "20.00", 
    "instructors": "Steve Phillips", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625854_6542.jpg", 
    "course_url": "https://www.udemy.com/online-reputation-lab/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T13:16:00Z"
}