{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">- Course Updated May 2015 -</strong></p><p>&quot; <em style=\"\">It&#039;s what you need to know. </em><em style=\"\">Anneke takes you from concept to publication. For each step she shows you both how to do it yourself and how to outsource the work.</em><em style=\"\">She teaches with a very natural conversational tone, not the over excited yelling into the mic that most instructors use. At first I was afraid she wasn&#039;t exciting enough, but I was wrong. Anneke&#039;s style seems natural and it&#039;s quite easy to follow along.</em><em style=\"\">I just lost one more excuse for why I haven&#039;t written my book yet. <em style=\"\">&quot;</em> <strong style=\"\">John Donahue</strong></em></p><p><strong style=\"\">Learn the amazing way to write your own book with lightning speed.</strong></p><p>Follow these <strong style=\"\"><em style=\"\">seven easy steps</em></strong> to your first book, and become a published author...</p><p>Give your expert status an enormous boost, by getting your book on Amazon.</p><p>It is much easier then you think. There are only seven steps: talk, record, transcribe, write, proofread and format.</p><p><strong style=\"\"><em style=\"\">All of these steps can be outsourced!</em></strong></p><p>But that is not all, because <strong style=\"\">selling</strong> your book is the next big hurdle.</p><p>In this course you get the best ways to upload tour book in the right format and use the Kindle Select Toolbox for fast results.</p><p>The honorable ways to get reviews of your book.</p><p>You will have your own buyers list that you can sell to again and again, if you use the techniques described in this course.</p><p>Outsource the audio version of your book, get it ready and see it appear in your mailbox, hear your book being read (a very special experience in itself!), and give it away as a free gift.</p><p>Lessons are in the form of <strong style=\"\">over the shoulder videos</strong>, where you can follow every step.</p><p>And of course there are fully illustrated guides in written form for each step.</p><p>Maybe the biggest gold of this course is that <strong style=\"\">you get all the links and names </strong>for the outsourcers in the whole process of writing the book and promoting it.</p><p>See yourself using your own published book, with you as an author to:</p><p>To hand out as a giant business card</p><p>To express your ideas to an audience of millions</p><p>To make money by selling a series of small books on Amazon</p><p>Enroll in this course now, and see for yourself how fast you can have your own book on Amazon, the easiest way possible.</p><p>Promised.</p>", 
    "end_date": null, 
    "title": "Outsourcing for Authors. Use Experts: Efficient Outsourcing", 
    "price": "20.00", 
    "instructors": "Anneke Camstra", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446684_20ee_14.jpg", 
    "course_url": "https://www.udemy.com/write-a-book-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T17:21:25Z"
}