{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><em><strong>Get your own ready to use Animated Video for your business from $5 -$50</strong></em> </em></p><p><em><em><strong>Real life examples of Outsourcing.</strong></em></em></p><p><em>“</em><strong>Loved it! </strong><em>Within the first 5 minutes - I already started writing a script and submitted it to Fiverr for voice over - Step 2. get a quote for animation video! Loved your course, 5/5!”</em><em>. <strong></strong></em><strong><em>Darrick Baxter</em> </strong></p><p><em></em></p><p><strong><em>---------------------------------------------------------------</em>-------------<br></strong></p><p><strong><em>Save time and money with this popular course!</em></strong></p><p><em> </em><em><strong>Get your own ready to use Animated Video for your business under -$50 </strong></em></p><p><em><strong>You don't have to learn any new software, it is all done for you! <br></strong></em></p><p><em><strong>Learn how to in a fast, easy, five-day program!</strong><strong> </strong></em></p><p><strong><em>---------------------------------------------------------------</em>-------------</strong><strong> </strong><br></p><p><strong>What do you get?</strong></p><ul><li><strong>Fifteen Real Life Outsourcing Examples, </strong>step by step documented.</li><li>Five different outsourcing platform, not only Fiverr or Upwork!</li><li>Know what you get for $5, and what the difference is with one for $50.</li><li>Decide if you want to use software or hire a freelancer</li><li>have an overview of the available platforms of freelancers and their prices</li></ul><p><strong>----------------------------------------------------------------------------</strong><br></p><p>Let me teach you the best, up-to-date, reliable possibilities to get animated video for your small business website and a small price. <br></p><p><em> </em><em> </em><em>\"</em> <em>T</em><em>his course gives me a lot of information and resources to know where I can get high-quality outsourcing animation for decent prices. Anneke has done all the research for you and now I just need to pick which one is best for my project. This saves you tons of time! \" </em>Rose Suen.<br></p><p><strong><em>---------------------------------------------------------------</em>-------------</strong><strong></strong><br></p><p>You will learn</p><ul><li>how to find a good animator for an affordable price on Fiverr(under $50)</li><li>make a test promo from a fill in the blank animation website</li><li>A two-step outsourcing process to make your animations cheaper</li><li>get to know a Business-in-a-box animation system with excellent quality animations</li><li>explore the other platforms to find animators and take a look into the higher end of the market<em></em></li></ul>    <p><strong><em>Enroll in this five-day Outsourcing Animation Challenge now and have you much needed animated video in a few days, without having to learn the software!</em></strong></p><p><strong><em><em>---------------------------------------------------------------</em>-------------<br></em></strong></p><p><em>She smashed it out of the park again!</em></p><p><em>What a terrific course! If you want to get help with your promo and other videos but don't wish to do a talking head yourself, an animation is a lovely alternative. Don't know where to start? Anneke smashed this course out of the park once again (she has several wonderful animation courses), it is informative, fun, easy to follow, with directions that will help you navigate what to do and where to go to get your animations outsources by professionals. She shows many beautifully done promo animations and shows you how they came about. Thank you, Anneke! </em><strong>Teresa L Greenway</strong><strong> </strong></p><p><strong>Over 7300 satisfied students in my Udemy Animation Courses with 189 reviews!</strong></p><p><strong>Update Nov 15 2015</strong><strong> : </strong>added new GoAnimate example for $25(Fiverr). Also downloadable PDF's for each section, to easily find out where the animators are hiding.<br> </p><p><strong>Update Nov 13 </strong><strong>2015</strong><strong> : </strong>added new lecture in the Fiverr section. Five new animations, all made for $5 or $10.<br> </p><p><strong>Update Nov 12</strong><strong> 2015: </strong>added a new animation in the PeoplePerHour lecture: animated, lipsynced avatar of yourself,with voice-over under $50.<br> </p><p><strong>Update Nov 12</strong><strong> 2015: </strong><em>added by request,the software compare, where you see me working in different softwares, earlier published in my Making Money with Fiverr Course</em></p><p><strong>Update Nov 11 2015: </strong><em>added:<strong> </strong>new lesson added in Section four: how to have your After Effects template made for you for $10.</em></p><p><strong>Update Nov 4 <em> </em></strong><em>added: a new lecture for the two-step outsourcing process. New style: cut-out animation.<br></em></p><p><em><em>“<strong>Anneke details the outsourcing process</strong>, giving a variety of great ideas and alternatives to learning new complicated software! She documents her experiences working with different video producers and shows us a variety of websites &amp; resources to use -- giving the student a breakdown of the costs, and results. <strong>I recommend this course to any professional who needs a video created </strong>or is looking to outsource, and doesn't have the time to learn complex new programs from scratch”</em><em>. <strong></strong></em><strong>Mary Ingrassia</strong> <br></em></p><p><em><strong>Video Made Easy 3</strong> is part of a series of 3 Animation for beginners courses. <br></em></p><p><em><strong>Video Made Easy 1</strong> is about working from templates in Powtoon</em></p><p><em><strong>Video Made Easy 2 </strong>is about adding a Voice-over to your animation. <br></em></p><p><br></p><p><strong>Enroll in the course now! </strong></p><p>Make your life a little easier, I have done the work for you!</p><p><strong>30 day money-back guarantee, just try it out!</strong></p><p><em><br></em></p><p><br></p><p><strong><br></strong></p><p><strong><br></strong></p>  <p><br></p>", 
    "end_date": null, 
    "title": "Outsourcing Animation: 15 Low Budget Animation  Done For You", 
    "price": "20.00", 
    "instructors": "Anneke Camstra", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626764_1d5a.jpg", 
    "course_url": "https://www.udemy.com/outsourcing-animation-15-low-budget-animation-done-for-you/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-30T07:14:16Z"
}