{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Learn to make video and animation the easy way! </strong></p><p><strong>Course updated januari 2016!</strong></p><p><em>\"</em><em>I created my 1st animation in under 20 minutes... what more can I say?</em></p><p> <em>This course is great, I was able to re-create the steps Anneke showed with my own imagination. After watching the examples mixed in with her humor, I was excited to create my 1st animation.\" </em><strong><em> Alex Ivanov</em></strong></p><p><strong>Animation, it is a joy to work in this beautiful software Powtoon!</strong></p><p>With Powtoon templates you enter the new world of software, that is easy and professional..Much easier and more fun than Powerpoint. More fill in the blank than Explaindio, VideomakerFX or GoAnimate. <strong>And it has a free version!</strong><br></p>  <p>\t You can <strong>use your animation</strong> instantly on your website, blog, youtube channel, affiliate page. You can use it inside Facebook messages and pages.</p><p><em>\"</em><em>Great class! </em><strong>Highly recommended</strong><em>.! I really enjoyed this class. I have been looking for a way to put together demonstration videos without having to hire a crew and spend tons of money. This class gives you great information about how to put everything together in a very quick way. The teacher is also very good and explains things clearly. Thanks!\" </em><strong>Jason Buff</strong><br></p>  <p>It is a <strong>very easy learning process in this course</strong>: over the shoulder video lessons of how to make the animations and an eBook with illustrated step by step instructions.</p><p>In this course you will find:</p>  <ul>\t<li>an introduction why video and animation are unavoidable in the online world</li>\t<li>examples in pictures, step by step how to change a template in Powtoon to make a promo animation that you can use immediately</li>\t<li>how to get your free account in Powtoon and the differences between free and paid</li>\t<li>how the workspace is laid out and how to begin</li>\t<li>more examples fully illustrated of the metamorphose of a template in a product video</li>  </ul><p><br></p><p><em><strong><em>\"</em> Excellent course, just what I needed with no fluff. </strong>Having decided to try my hand marketing videos on Fiverr, I realised I was taking too long to make them so did some research &amp; found Powtoon. Played a bit with it but decided the best option was a course to teach just what I needed to know right now to get started</em><em> Right from the beginning I was impressed with Anneke's teaching style which suited my needs exactly; <strong>enough details to show what to do</strong>, being able to pause &amp; replay the videos as needed to see all the steps till I could do it myself and the encouraging comments along the way all melded together to make what was a perfect course for my needs. Course materials were good and </em><strong>I engaged in the course to an extent that after one lesson I created an original story of my own </strong><em>and posted the link to the lesson board.\"</em><strong>Trish Findlay</strong></p><p><strong>Enroll in this course: get your animated video for your website fast and easy!</strong></p>", 
    "end_date": null, 
    "title": "Powtoon Promo Animation ExplainerVideos step-by-step Powtoon", 
    "price": "20.00", 
    "instructors": "Anneke Camstra", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420052_9713_14.jpg", 
    "course_url": "https://www.udemy.com/promo-videos-how-to-do-powtoon-animation-with-anneke/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T09:44:27Z"
}