{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t  It’s renaming time! Or is it?  </p>  <p style=\"\">  \t  I’m Marcia Yudkin, “Head Stork” for the naming company Named At Last and creator of the Renaming Your Business course (and other business courses) on Udemy.com. Do yourself a big favor.Before you spend time, energy and money on renaming your company, nonprofit organization, product, service or event, let this course show you how to determine whether or not your reasons for a name change are valid. This step alone can save you thousands or hundreds of thousands of dollars – and help you get others on your team on board with your conclusion.  </p>  <p style=\"\">  \t  If you do indeed have a solid rationale for a name change, find out who to involve in renaming and why. Discover why you should probably not use two very trendy methods for coming up with a winning name. Decide whether you prefer to create a relationship between the old and new names or wipe the slate clean.  </p>  <p style=\"\">  \t  If you want to emphasize continuity in your new name, discover 10 techniques for tweaking your former name meaningfully. If you would rather make a break with the past, learn the most productive methods of brainstorming and generating possible new names. Gain inspiration from examples of more than a dozen companies that radically changed their names (in most cases for the better).  </p>  <p style=\"\">  \t  Finally, use 11 crucial filters for distinguishing suitable names from unwise ones – especially the ones that can turn you into a laughingstock, or land your organization in a world of trouble.  </p>  <p style=\"\">  \t  By following this proven process, you boost your odds of ending up with a name you can proudly use for years to come. Even better, because you get lifetime access to this course, you can easily repeat the process any time another product or company name comes up in the crosshairs as a candidate for change.  </p>  <p style=\"\">  \t  Along with the course videos, you receive written transcripts of all the content, two worksheets, two resource lists and a sample press release you can use as a model for publicizing your chosen new name.  </p>  <p style=\"\">  \t  Avoid wasted effort and preventable renaming disasters! Sign up now and get smart about renaming.  </p>", 
    "end_date": null, 
    "title": "Renaming Your Business: Should You? And If So, How?", 
    "price": "40.00", 
    "instructors": "Marcia Yudkin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/156742_c19b_5.jpg", 
    "course_url": "https://www.udemy.com/renaming-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-02T16:08:48Z"
}