{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Nowadays everyone googles everyone: friends, relatives, recruiters, \nhiring managers, and even strangers may be searching for you on the web.</p><p>Consumers will take the time to research a  brand  before ever doing \nbusiness with them. Employers google job candidates before even inviting\n them to an interview. People look through search \nresults and social media profiles before ever agreeing to a first date.</p><p>Whatever you see in Google when you type your name is <strong>crucial for \nyour professional and personal life</strong>. Whatever people see searching your \nbusiness is its most important success or failure factor.</p><p>Your online reputation can define your future as well the future of your business...</p><p>Not paying attention means missing out on great opportunities (which \nis the base case scenario), and sometimes even setting yourself up for \nfailure.</p><p>This course will provide you with the most actionable plan on managing your online reputation: From explaining basic steps, to providing free tools and PDF cheatsheets. It's perfect for startup CEOs, (small) business managers, authors, etc.</p><p>Included in the course you will find:</p><ul><li>9 actionable lectures showing you the steps and tools to manage your online reputation</li><li>A free downloadable PDF eBook to download and take home (or hand to your ) including all the discussed steps</li><li>A free audio book with most important takeaways to listen to when on a trip or away from the Internet connection</li></ul>", 
    "end_date": null, 
    "title": "Reputation Management: Control Your Name Google Search", 
    "price": "20.00", 
    "instructors": "Ann Smarty", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/729548_74b5_2.jpg", 
    "course_url": "https://www.udemy.com/reputation-management-google/", 
    "currency": "USD", 
    "subject_name": [
        "Branding"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T22:52:01Z"
}