{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Purchasing has evolved from a transactional-based activity to the present-day value-added function. Buyers who view carefully selected suppliers as partners will develop long-term relationships based on trust that focus on total cost of ownership vs. price and early supplier involvement in new and improved product development. This leads to the use of cross-functional teams and more best-in-class methods, tools, procedures, and analysis of price-cost-quality relationships described in the course. Also, the ability of purchasing to dramatically impact and increase return on investment and to reduce costs is demonstrated throughout this course.</p><p style=\"\">This course was designed based on the instructor's real-world knowledge and experience, gained through hands-on operations. It will enable you to<strong> improve the purchasing/supply function</strong> within your company as a whole, by teaching you the basic principles and good practices of purchasing, procurement and supply chain management. You'll learn effective methods for improving quality, reducing total costs, shortening the time to market, developing and managing collaborative relationships, negotiating and managing buyer-supplier contracts, and becoming a key contributor to your organization's mission, strategy and tactics.</p><p style=\"\"><strong>Content and Overview:</strong></p><p style=\"\">This course contains 78 lectures,10+ hours of content organized in 14 areas. It's designed for purchasing/supply chain professionals and students who want to understand and use the latest best procurement practices to help their organizations maximize the effectiveness and efficiency of their purchasing function and their supply chain as a whole.</p><p style=\"\">The content areas include:</p><ul><li>Fundamentals of Purchasing and Supply Management</li><li>New Product Development</li><li>Purchasing Specifications and Standardization</li><li>Quality Management</li><li>Outsourcing Activities and Decisions</li><li>Strategic Sourcing Development</li><li>Global Supply Management</li><li>Total Cost of Ownership</li><li>Price and Cost Analysis</li><li>Methods of Compensation</li><li>Negotiations</li><li>Contract Formation and Legal Considerations</li><li>Contract Management. Ethics and Social Responsibility.</li><li>Achieving and Implementing World-Class Purchasing</li></ul><p style=\"\">By completing this course, you'll be armed with the valuable and practical skills you need to improve both your personal performance as a purchasing/supply chain professional, and the overall performance of your company's procurement function as an integral part of the supply chain. You will have gained the knowledge and skills required to design and sustain an effective and efficient purchasing/supply management department within your organization.</p>", 
    "end_date": null, 
    "title": "Achieving World-Class Purchasing", 
    "price": "20.00", 
    "instructors": "Operational Excellence Training", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570128_3594_3.jpg", 
    "course_url": "https://www.udemy.com/achieving-world-class-purchasing/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T13:03:28Z"
}