{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The internationally accepted standard guideline for medical device risk management is the ISO 14971 standard. This 2.4-hour long course is based on the current ISO 14971:2007 edition. It has been designed to provide a concise but complete knowledge of medical device risk management to supplement readings of the 80-page standard and to initiate those who are new to the medical device industry. More focus has been given to explaining the use of key tools such as the Failure Mode and Effects Analysis (FMEA) and the Fault-Tree Analysis (FTA) to enable immediate application in ISO 14971 projects. This course offers a systematic methodology to comprehend medical device risk management and connects the vital elements of risk management methodologies for a more efficient application of principles. It also provides guidelines on how to conduct productive meetings to construct medical device risk profiles.</p><p><strong>Why is this course essential to take?</strong><strong></strong><br></p><p>Performing risk management is a regulatory obligation and is the underpinning tool for assessing medical device safety. Risk management is part of the design input requirements during product design &amp; development. This means that risk control and hazard reduction measures must be included as key considerations in the final medical device design, as well as in verification and validation studies. Risk evaluation should occur continuously throughout the production and post-production processes.<br></p><p><strong>An organised and methodical approach to understanding and applying the ISO14971 principles</strong><strong></strong><br></p><p>This ISO 14971 course takes a business approach to medical device risk management. Business tools such as project management techniques are recommended to establish risk management team structures. This ensures an organisation-wide support and commitment to comply with the ISO 14971 requirements. The Failure Mode and Effects Analysis (FMEA) and the Fault-Tree Analysis are discussed in greater detail to clearly explain their applicability to medical device risk management.<br></p><p><strong>Course materials and resources provided</strong></p><ul><li>7 practice workshops</li><li><span></span>Risk management plan template</li><li><span></span>Quantitative risk/benefit analysis technical report</li><li><span></span>FMEA worksheet in MS Excel format</li><li><span></span>AAMI White Paper: Risk Principles and Medical Devices&lt;/li&gt;</li></ul>", 
    "end_date": null, 
    "title": "Applied ISO 14971 Medical Device Risk Management", 
    "price": "25.00", 
    "instructors": "Nealda Yusof", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759420_d9bd_4.jpg", 
    "course_url": "https://www.udemy.com/applied-iso-14971-medical-device-risk-management/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T08:44:27Z"
}