{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Succeeding is business isn’t easy. The failure rates are high, with more than 95% of businesses failing within the first five years. Studies have shown that businesses that take the time to write a business plan are twice as successful as those that fail to do so!  Knowing your market, your customers, and your competitors and where you fit into your market is critical knowledge, as are operational, human resources, marketing, and financial plans. While some may say that too much planning is not necessary, the opposite is also true, and if you fly around by the seat of your pants without a plan, you&#039;re far more likely to waste time, money, and opportunity. Business Plan Blueprint will walk you step by step into creating your own “investor ready” business plan, while providing you with the financial model and business plan templates that you can use to build your plan while you follow along with this cutting edge course – created not by some egghead theoretical professor, but by a real world-class active early stage consultant who has helped clients raise more than $200 million!  </p>  <p>  \t    Within Business Plan Blueprint, you’ll learn how to build your financial model and how to do the critical thinking that leads you to assumptions that aren’t just wild guesses, but based on factual data. You’ll learn how to research the market, customers, and your competition. You’ll learn all of the critical components of what investors want to see in a business plan. At the same time, you’ll be building a plan that can help keep you and your company laser-focused strategically and tactically. Investing in this course will pay for itself many times over as you will avoid mistakes and put together a clear strategic vision for your company!  </p>", 
    "end_date": null, 
    "title": "Business Plan Blueprint", 
    "price": "45.00", 
    "instructors": "Todd Smith", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/290758_bbda_6.jpg", 
    "course_url": "https://www.udemy.com/business-plan-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-30T17:02:07Z"
}