{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Whether you are an international corporation or a small business, protecting your company and its resources against crises and risks is of paramount importance. By developing and implementing a successful <em>Business Continuity Management (BCM) Plan</em> you can achieve this goal and make your company thrive regardless of the challenges that may come your way.</p>\n\n\n\n<p>Although crises are unpredictable, they should never be unexpected. Regardless the nature of their trigger – be it a tornado, a structural failure or a terrorist attack – crisis are a part of how economics work and you should be able to identify and mitigate them on spot.\n\n  </p>\n\n\n\n\n\n\n\n<p>As the global business footprint increases, so do the risks faced by companies. Extended supply chains, organizational and technological dependencies, political and social instabilities, cybernetic attacks, organized crime, intrastate conflicts and natural disasters – these are only a few of the circumstances that may trigger a crisis. But should you worry about them? No, not as long as you’re prepared to face all the challenges. \n\n  </p>\n\n\n\n\n\n\n\n<p>This course is designed to help you protect your company by providing you all the necessary knowledge to develop and implement a powerful Business Continuity Management Plan. Created with the diligent manager in mind, the course also provides practical tools, systems, and reports that will enable you to create your own plans and easily manage the outsourced support.\n\n  </p>\n\n\n\n\n\n\n\n<p>Do you think that developing sophisticated and convergent methodologies to plan for and manage crisis events is too difficult to be worth the effort? Not with this course that will guide you step by step through the process of developing and implementing effective contingency and crisis response plans, policies, and systems.\n\n  </p>\n\n\n\n\n\n\n\n<p>While crises can be devastating in their effects, it doesn't mean that you should not be prepared to successfully face them. All the contrary. Stop focusing exclusively on market and credit risk and start thinking about the risks that directly affect people. Despite being more personal in nature, operational risk management has yet to mature sufficiently to reflect the wide spectrum of interrelated threats facing companies within today’s dynamic and evolving global commercial environment.\n\n  </p>\n\n\n\n\n\n\n\n<p>Although it’s true that advances in technology and management methodologies might increase an organization’s capacity to forecast and plan for catastrophic events, they are not enough. Most of the time, the ability of a company to survive a crisis event relies on the under resourced and frequently overlooked field of operational contingency planning and crisis response. In other words, on <em class=\"redactor-inline-converted\">BUSINESS CONTINUITY MANAGEMENT.</em></p>", 
    "end_date": null, 
    "title": "Business Continuity Planning and Management", 
    "price": "20.00", 
    "instructors": "Operational Excellence Training", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/771358_12de_3.jpg", 
    "course_url": "https://www.udemy.com/business-continuity-planning-and-management/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-23T06:06:26Z"
}