{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>58% of Customers stop doing business with companies simply because of a bad interaction with a call center according to Harris Interactive. 78% of customers abandon a sale because of bad experience with a call center. The Contact Center industry is $300B+ and growing and is increasingly becoming the epicenter of most organization. Success at most organizations hinge on how well the contact or call center operates.</p><p>Simply put the call center is the most important group at most organizations today. As it has responsibility for customer relationships and often a significant part of sales as well. My goal is to help demystify the call center so you can be better either as an employee or a leader in the call center.</p><p><strong><br></strong></p><p><strong>Learn and Master the Essentials of the Call Center</strong></p><ul><li>History of the Call Center</li><li>Evolution of the Call Center</li><li>Types and functions of the Call Center</li><li>Call Center Technology</li><li>Management within the Call Center</li><li>Call Center and Your Career</li></ul><p><strong>Contents &amp; Overview</strong></p><p>This course has over an hour of Content with most of it being one on one video content. It is designed for anyone regardless of skill.</p><p>In this course You will learn why call centers exist, the role it plays in most organization, it's terminology, technology and processes. Last but not least you will learn how to leverage the call center for your career.<br></p><p><strong><br></strong></p><p><strong>What are the Requirements?</strong></p><p>An understanding of the English Language</p><p><strong>What am I getting?</strong></p><p>Over an hour of content<br></p><ul><li>By the end of this course the call center will cease to be a mystery, you will enjoy learning how to excel in a call center</li><li>You will provide better service to your customers as a manager</li><li>You will have a fundamental understanding of how this whole call center thing started, the role it plays today</li><li>Lastly, you will have a clear understanding of how to capitalize on it's potential for your career.</li></ul><p><strong><br></strong></p><p><strong>Who is the target audience?</strong></p><ul><li>If you already work in a call center this course is for you</li><li>If you are interested in call centers this course is for you</li><li>If you are interested in Customer Service or Telesales this course is for you</li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Call Center, The Essential guide", 
    "price": "20.00", 
    "instructors": "Amas Tenumah", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524154_7438_4.jpg", 
    "course_url": "https://www.udemy.com/callcenter/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-09T13:48:11Z"
}