{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Lean management and Six Sigma are the most sought after business excellence strategies among the leading and progressive MNCs. Demand for certified professionals in these fields is tremendous in global market.  </p>  <p>  \t  This course is prepared with a view to provide the complete learning of Lean management, which has its origin from Toyota Production System (TPS): Only one of its kinds of philosophy, processes, tools and techniques followed by Toyota to manufacture its cars.  </p>  <p>  \t  Lean management is an essential part of lean thinking.  It is all about customer focus, developing and maintaining systems and processes to provide value as defined by its customers.  </p>  <p>  \t  Course materials include: 30 Video lectures, PDF files of lectures that can be downloaded, quizzes etc. The course contents are prepared by scholars, with more than 30 years of academic and industrial experience at leading MNCs.  On an average, if a working adult devotes one hour per day, he or she would be able to complete this course within 15 to 20 days.  </p>  <p>  \t OTIFAS voluntarily follows the guidelines of ISO 17024, in order to benchmark our certification process at par with global standards. The certification process has also been accredited by the International Accreditation Organization (IAO), USA.  </p>", 
    "end_date": null, 
    "title": "Certified Lean Management Professional", 
    "price": "20.00", 
    "instructors": "OTIFAS Six Sigma", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/128908_3bc0_6.jpg", 
    "course_url": "https://www.udemy.com/certified-lean-management-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-04T05:36:48Z"
}