{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t          This online course is created for nonprofit fundraising professionals. It includes of all the tools that you need in order to run a successful golf tournament as a fundraiser.  </p>  <p style=\"\">  \t          Hosting a golf tournament is a great way to raise $10k to $100k or more while bringing in a new group of potential supporters to your cause. Golfers love it because they can have a legitimate excuse to get out of work for a day. Sponsoring hole businesses love it because they can showcase their products and get their name out to other businesspeople who are playing in the tournament. Even committees, volunteers, and staff love it because they can spend the day away from their desks, surrounded by lush green lawns and beautiful views. For staff, much of the hard work during the day of the event is taken care of by the golf course, such as setting up the holes, tallying winners, catering, and most of the cleanup.  </p>  <p style=\"\">  \t          The course a master golf template collection worth $200. The formulas are built-in for you.  </p>  <ol style=\"\">  \t<li style=\"\">Sponsor Leads</li>  \t<li style=\"\">Volunteers</li>  \t<li style=\"\">Budget</li>  \t<li style=\"\">Sponsors</li>  \t<li style=\"\">Timeline</li>  \t<li style=\"\">Players</li>  \t<li style=\"\">Auction/Raffle Solicitation List</li>  \t<li style=\"\">Auction/Raffle Items</li>  \t<li style=\"\">Mailing List</li>  </ol>  <p style=\"\">  \t      This course has a full 30-day guarantee. If you are not fully satisfied, Udemy will refund the full cost of the course. So, please enroll today. You have nothing to lose, and a new skill to gain!  </p>", 
    "end_date": null, 
    "title": "Charity Golf Tournament Mastery Course for Fundraisers", 
    "price": "20.00", 
    "instructors": "Monique Littlejohn", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313310_c405.jpg", 
    "course_url": "https://www.udemy.com/charitygolftournaments/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-04T13:22:03Z"
}