{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is a comprehensive and compressed robbery safety and prevention course. Learn from the experts how to increase your personal safety, reduce risk, and preserve life and evidence during an armed robbery.</p>\n\n<p><strong><em>This course is to the point, factual, with high quality video to give you the most learning impact, in the shortest amount of time.</em></strong></p>\n\n\n\n<p>If you work with the public and handle money or valuables, you are a potential target for robbers. You are at risk, and need to know how to improve your safety and reduce the risk to you personally and to those around you. This training is designed to help you improve your safety, and preserve life and evidence during such an unfortunate event.</p>\n\n\n\n\n\n\n\n\n\n<p>Robberies are traumatic events. You will know how to recognize some of the signs of trauma, and where to get post-event help. The material in this course may just save your life by avoiding the possibility of getting robbed, or if you are unfortunate to be caught up in an armed robbery situation.</p>\n\n\n\n\n\n<p>For the course Hendrik van Wyk, of Profiled Productions brings you lectures, video scenarios, and interviews from people that are experts in their respective fields. For this course you will meet:</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bruce Couper: </strong>Bruce Couper is the Managing Director of RISQ New Zealand Ltd. After 11 years in the NZ Police service where he served in both the uniform and criminal investigation branches, Bruce entered the business arena in the early 1990s. Bruce has specialized in helping companies keep their personnel safe from security and personal safety risks for over two decades. This included developing courses in the NZ market that he successfully licensed to Group 4 in the UK over a 5 year period (1994-1999).</p>\n\n\n\n\n\n<p>Bruce has worked with, and for many government agencies, corporates, local authorities, retailers and SMEs to provide advice and real training materials and courses that have reduced security and crime risks and made people safer.</p>\n\n\n\n\n\n<p>Bruce is a former Chairman and now a Life Member of the NZSA (New Zealand Security Association). Bruce is a former Chairman for ASIS International (New Zealand Chapter 148).</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Charles O'Donnell: </strong>Charles is an independent security consultant providing security risk management and advisory services to corporate and commercial clients, public and private sector, and to security service providers. He specializes in security framework and organizational design, policy, risk assessment and analysis, physical and electronic security design and review, and incident management.</p>\n\n\n\n\n\n<p>With a total of 26 years security industry experience, 19 years have been spent working in New Zealand and Australia for Multi National Corporates including Westpac, National Bank of New Zealand and IBM.<br></p>\n\n\n\n\n\n<p>Charles is a current member of ASIS International and ASIS New Zealand and has also been a contributing member of the Crime Prevention Partnerships Forum and the New Zealand Bankers Association Physical Security Working Group.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Lance Burdett - Director &amp; Consultant – Warn International: </strong>With 22 years of policing experience at the highest level, Lance worked in senior management positions with a primary focus on leading and developing units in: the 111 emergency call centre, the protection squad, intelligence management and emergency responders.  He has a track record of leading successful teams through recruitment, training, professional development, motivation and welfare support. </p>\n\n\n\n\n\n\n\n<p>Lance specializes in suicide intervention and in predicting violent behaviour in his 13 years as a negotiation instructor for the NZ Police.  He is lauded for his practical training sessions tailored to the target audience and their workplace. </p>\n\n\n\n\n\n<p>Lance was the National Advisor for all NZ Police Negotiation Teams tactical teams. He completed the NZ Police Negotiation Qualification Course, qualified on the FBI Negotiators Course held in Quantico, USA, and attended the Counter Terrorist Negotiators Course held in Darwin, Australia.  </p>\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Compressed Armed Robbery Safety and Prevention Course", 
    "price": "20.00", 
    "instructors": "Hendrik van Wyk", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571848_5dc6_2.jpg", 
    "course_url": "https://www.udemy.com/armed-robbery-safety-and-prevention-course/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-02T20:34:17Z"
}