{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Continuous Improvement</em> is an ongoing effort to improve products, services and processes to provide excellence and added value for the customer. It is important to emphasize that continuous improvement isn't one particular system or specific way of doing something, it’s a mindset, based on the knowledge that there is always a better way of doing things and therefore a journey that never ends. It is also important to recognize that continuous improvement activities take place all the time and can range from small incremental improvements introduced by individuals, to large organizational projects around process change test.</p><p>Understanding processes so that they can be improved by means of a systematic approach requires the knowledge of a simple kit of tools or techniques. The effective use of these tools and techniques requires their application by the people who actually work on the processes, and their commitment to this will only be possible if they are assured that management cares about improving quality. Managers must show they are committed by providing the training and implementation support necessary.</p><p>The tools, methods and techniques provided within this training lend themselves to more directed or facilitated improvement activities and will enable you to Improve Your Business Processes, Achieve Operational Excellence and Increase Your Customer Satisfaction.<br></p><p><strong>Content and Overview:</strong> </p><p> This course contains 71 lectures, 9 hours of content organized in 9 areas, and quizzes containing 60+ questions. The course is suitable for 1) business owners responsible for improving their business processes; 2) professionals involved in the development and improvement of business processes; and 3) students seeking career in business process management.<br></p><p>The content areas include:<br></p><ul><li>Value Stream Mapping</li><li>6 S Workplace Organization</li><li>Standardized Work and Standard Operating Procedures</li><li>Total Productive Maintenance</li><li>Poka Yoke and Mistake Proofing</li><li>SMED, Quick Changeover and Setup Time Reduction</li><li>Production Levelling and Scheduling</li><li>Process Balancing and Synchronization</li><li>Quality Management – Principles, Practices, Tools</li></ul><p>By completing this course, you'll be armed with the valuable and practical skills you need to boost the effectiveness and efficiency of your organization by using various basic and advanced continuous process improvement tools, improve both your personal performance as a business professional, and the overall performance of your company's functional departments. The course will provide you with the information and analysis you need to remain both current and competitive; the state-of-the-art knowledge and practices you need to meet your customer's demands and requirements; and the details to meet them with dramatically greater speed and precision than your competitors.</p>", 
    "end_date": null, 
    "title": "Continuous Improvement Tools", 
    "price": "20.00", 
    "instructors": "Operational Excellence Training", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648626_6d9e_2.jpg", 
    "course_url": "https://www.udemy.com/continuous-improvement-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T07:33:43Z"
}