{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t     How  people are treated by organisations when they first make contact can be  crucial. As the saying goes, if you don&#039;t look after your customers, someone else will. Developed by highly respected author, educator and expert in communication skills, Professor  Bernard Moss, this important e-learning module offers the equivalent of a  full day’s continuous professional development. This is ideal training  for receptionists or anyone whose role brings them into face-to-face  contact with the public in private, voluntary or public sector  organisations. This course provides an excellent foundation for  high-quality customer care.  </p>  <p style=\"\">  \t    The course is built around a set of acted-out scenes in which you get to see examples of how to provide high-quality customer care and - importantly - telling examples of how not to do it. This approach enables you to get a clear picture of what is involved in effective customer care.  </p>  <p style=\"\">  \t    Participants are provided with a Module Companion E-book which can be printed out to act as a focal point for taking notes about the important insights the course provides and for completing the exercises that are an integral part of the learning.  </p>  <p style=\"\">  \t    Although the course is the equivalent of a full-day&#039;s training, it does not have to be taken in one sitting. It can be followed flexibly to fit in with your busy schedule and at a pace to suit you.  </p>  <p style=\"\">  \t    If your work involves you in welcoming people to your organisation - whether in a commercial or a public service setting - this course will help you to make sure you do this to the best of your ability.  </p>", 
    "end_date": null, 
    "title": "Customer Care: Getting it Right", 
    "price": "35.00", 
    "instructors": "Bernard Moss, Neil Thompson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/249456_14b4_2.jpg", 
    "course_url": "https://www.udemy.com/customer-care-getting-it-right/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-24T14:58:59Z"
}