{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    Customer Service professionals need to know a whole lot more about the various ways of delivering services to the customers. It is no longer sufficient just to know the basics.  </p>  <p style=\"\">  \t    There have been so many changes in customer expectations and with service delivery, which is why we have created a completely new series of qualifications and certifications. The Customer Service Certification Pathway has been created to support students in their aim to gain relevant qualifications that practically apply to the ever-changing world of customer services.  </p>  <p style=\"\">  \t    The Customer Certification Pathway has three main parts: The Customer Service Foundation Program, Customer Service Intermediate Program, and the Customer Service Expert Program.  </p>  <p style=\"\">  \t    First part is the The Customer Service Foundation Program which focuses on the fundamentals, general knowledge, terminology and basic concepts used in Customer Service. You must complete this level as a pre-requisite for sitting the Customer Service Intermediate Exam.  </p>  <p style=\"\">  \t    Next on the Certification Pathway is the Customer Service Intermediate Program which is made up of 8 courses. All Intermediate topics include (in no particular order):  </p>  <p style=\"\">  \t    ·Communication Strategies  </p>  <p style=\"\">  \t    ·Contact Centers  </p>  <p style=\"\">  \t    ·Making Decision and Assertiveness  </p>  <p style=\"\">  \t    ·Delivering presentations and Public Speaking  </p>  <p style=\"\">  \t    ·Conflict Resolution  </p>  <p style=\"\">  \t    ·Customer Relationship Management  </p>  <p style=\"\">  \t    ·Sales  </p>  <p style=\"\">  \t    ·Retail  </p>  <p style=\"\">  \t    From the eight Customer service Intermediate programs that are available, you will select a minimum of five programs in order to be eligible to sit the Intermediate Exam and progress to the Expert program, each Intermediate program will earn you 3 points toward your Customer Service Expert Certificate (minimum 17 points entry requirement). There is an examined component at this level. The exam consists of 50 multiple choice questions, related to the subjects you have chosen.  </p>  <p style=\"\">  \t    The next and final level is Customer Service Expert program. This is specifically aimed at Customer Service Supervisors and Managers who wish to consolidate their knowledge and experience and achieve formal recognition of their skills.  </p>  <p>  \t  Once you&#039;ve completed the course, email our exam department at exams@artofservice.com.au to purchase your exam voucher and sit your final exam.  </p>", 
    "end_date": null, 
    "title": "Customer Service -Delivering Presentations & Public Speaking", 
    "price": "50.00", 
    "instructors": "The Art Of Service", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/215688_0fa0_2.jpg", 
    "course_url": "https://www.udemy.com/customer-service-delivering-presentations-public-speaking/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-12T00:35:26Z"
}