{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\"></strong><strong style=\"\">Customer Experience Management</strong> brings real business results through optimizing customer interactions in order to maximize the customer lifetime value. It’s used for example by Apple, Amazon and Google (we advice some of them also). A competitive advantage no longer comes from superior products or services only, it comes from personalized experiences: Customers want to get what they want, where they want and when they want with a smile.  </p>  <p>  \tMany businesses are struggling with this change ripping through the business world, because of old industrial-age mindsets. The first step to managing your customer experiences is to understand your customer at a deeper level. For this purpose we created <strong style=\"\">Customer Experience Blueprint</strong>.  </p>  <p>  \t               This course allows you to create <strong style=\"\">a systematic and profound analysis of your customers, their expectations and psychological needs</strong> so you can boost revenue, decrease costs and improve customer service. This customer experience management course contains <strong style=\"\">powerful tools, techniques and teachings to deepen your knowledge</strong> with customer emotions and other relevant aspects.  </p>  <p>  \t<strong style=\"\">To simplify the course even further templates and videos are provided that guide you every step of the way, saving you time and energy when putting together your customer experience strategies.</strong>  </p>  <p>  \tAfter creating your first Customer Experience Blueprint with the help of the material this course provides, you will have a solid map to constantly improve your business results. This makes you a highly valuable member of your team and company.  </p>  <p>  \t <strong style=\"\">Join the course and start creating you own customer experience strategies TODAY!</strong>  </p>", 
    "end_date": null, 
    "title": "Customer Experience Management Blueprint", 
    "price": "45.00", 
    "instructors": "Janne Ohtonen", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/231944_4b0f_4.jpg", 
    "course_url": "https://www.udemy.com/customer-experience-management-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-28T15:19:26Z"
}