{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong><u>IMPORTANT COURSE UPDATES</u></strong><br>  \t<strong></strong>  </p>  <hr style=\"\">  <p>  \t<strong>Have you ever felt like your small business was at the mercy of cyber criminals?</strong>  </p>  <p>  \t<strong>Does protecting your business from cyber threats seem like a complicated, money draining and time-consuming task?</strong>  </p>  <p>  \t<strong>And wouldn't it be great to be able to pick the brain of an experienced professional</strong> <strong>and collaborate with others in similar situations?</strong>  </p>  <p>  \t              Good news, you're in the right place!  </p>  <p>  \t                        This course was created to help you simplify the process of protecting  your data and other digital assets as it walks you step-by-step through  the sometimes intimidating process of building layers of effective  security controls around your computer systems and digital devices. By the end of this course you  will have effectively taken down the <strong>“Easy Target Here”</strong> sign and incentivized cybercriminals to look elsewhere.  </p>  <p>  \t              With the recent onslaught of web attacks on businesses, now is the time to put practices and controls in place that will drastically reduce the likelihood of your small business falling victim to the next cybercrime. After all, “<em>60 percent of small firms go out of business within six months of a data breach</em>” (U.S. Small Businesses Administration). <strong>Together we will make sure you put the most effective low-to-no-cost controls in place to reduce the likelihood of your business becoming a casualty of cyber attacks.</strong> I make myself available outside of my full-time employment to <strong>answer questions, provide feedback and advice.<br>  \t</strong>  </p>  <p>  \t              This course is designed as a workshop for busy small (and even some medium size) business owners who cannot afford to hire IT security staff. Much of the course is set up as a series of <strong>short demonstrations that you will be able to simultaneously follow </strong>so that by the end of the course your business will be shielded from a constant stream of Internet attacks.  </p>  <p>  \t              In this course you will discover how to implement low to no cost IT security controls and best practices in such a way that will build a defense-in-depth barrier around your business.  </p>  <p>  \t<u><strong>Get ready to cover:</strong></u><br>  </p>  <ul>  \t<li>Safe surfing techniques</li>  \t<li>Secure online banking strategies</li>  \t<li>Selecting web hosting service providers</li>  \t<li>Simplifying the application updating/ patching process</li>  \t<li>Hardening your operating system</li>  \t<li>Mitigating malware</li>  \t<li>Secure communications</li>  \t<li>Business continuity/ disaster recovery</li>  \t<li>Managing social media vulnerabilities</li>  \t<li>And much more!</li>  </ul>  <p>  \t      So is your small business connected to the Internet?  Has time, complexity and/ or expense prevented you from shielding it from cyber threats? If so, now is your chance to safeguard your small business from those who would destroy it.  </p>  <p>  \t      Your investment is protected by a <strong>30-day, 100%, no questions asked, money-back guarantee</strong>. You have nothing to lose.  </p>  <p>  \t          Don't let your business go another day unprotected from the potentially devastating effects of cyber attacks.  </p>  <p>  \t          Click on the <strong>Take This Course</strong> button in the upper right corner of your screen now and let's get started!<br>  </p>", 
    "end_date": null, 
    "title": "Cyber Security: Shield Your Small Business/ Home Office 2016", 
    "price": "20.00", 
    "instructors": "Jared Hill", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/335222_4097_3.jpg", 
    "course_url": "https://www.udemy.com/cyber-security-for-small-businesses/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T22:31:40Z"
}