{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Probably you received many times <strong>flyers, posters and many printed marketing materials </strong>and thought how great they look. They are <strong>professional </strong>made and just <strong>catch attention.</strong></p><p>If you are like most small business owners you said yourself \"<em>They look awesome, but it is too difficult for me to design by myself and I cannot afford to pay a graphic designer</em>...\"</p><p>This is true... and not. It is true that paying a designer to create your flyers, or posters can cost you a lot of money.</p><p>But it is not true you cannot <strong>do it by yourself.</strong></p><p>Since flyers ans posters are one of the most common type of marketing material you can use to promote offline your business, having your own <strong>professional looking</strong> usually help a lot in positioning you as an <strong>authority </strong>in your niche (asumming you have quality products that can help people get results).</p><p>This course is a beginner course on<strong> how to create professional looking flyers and posters for promotional activities and marketing campaigns</strong> by using Canva's free tool. It is intended for people who want to position themselfes, their products ans services and be seen as an authority (like ...\"<em>these guys are good, look what stunning flyers they use to present their offer..\"</em>)</p><p>And to also <strong>capture attention</strong> immediately with your offer.</p><p>You don't need any graphic design experience, just start from zero and create amazing flyers and posters that look awesome.</p><p>You will learn</p><ul><li>how to create your Canva account,</li><li>how to use the design dashboard,</li><li>how to add images,</li><li>how to format the text areas,</li><li>how to find out already prepared text blocks that look professional,</li><li>how to add shapes,</li><li>graphic objects, frames, lines, illustrations</li><li>the most important types of flyers and posters</li><li>how to export your posters and flyers projects from Canva to print them.</li></ul><p>By taking it, you will be able to understand and <strong>master the art of creating high quality</strong> posters, flyers images in the step by step demonstrations. </p><p>In your own pace.</p><p>Since any marketing campaign is a visual project, an engaging flyer will improve your conversion rates and catch people attention.<br></p><p>In this course you will get step by step video explanations to help you understand in a comfortable way all about creating this kind of marketing materials in minutes, for free and <strong>without any previous graphic experience.</strong><br></p><p>The course can be downloaded as a video training to watch or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next...<u> click the Take this Course button</u> top right and you'll be taken to our secure payment page.</p><p>Just <em><u>Enter Your Regular Details</u></em> and complete your investment to have immediate access.<br></p><p><strong>Stop struggling with boring flyers </strong>and posters people don't want to even look at and <strong>start mastering flyers design in minutes, just like a pro!</strong></p><p><strong>Thank you for reading this and learning about my course</strong> ... I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE</strong> to get started!<span></span></p>", 
    "end_date": null, 
    "title": "Design an Amazing Flyer, Brochure Poster Like a Professional", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642662_465d_2.jpg", 
    "course_url": "https://www.udemy.com/eye-catching-flyers-posters-business-marketing-canva/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T18:03:43Z"
}