{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>One of the most important aspects of running a business has to do with how you manage your suppliers. Remember that a supplier isn’t just “a company that you hired to boss around.” A supplier is an entity that you need to establish a successful and beneficial relationship with in order for both organizations to achieve all of their goals. </p>  <p>This course explains some key methods and strategies to more effectively manage your suppliers in the future. There are three sections in this course.</p>  <p>First section is about creating a supplier profile. Maintaining and updating supplier's profile can help you understand how useful the supplier is, or not for the particular service. This lecture explains all the important components that should be included in the supplier profile while looking at the supplier's performance.</p>  <p>Second section is about organizing supplier’s day and supplier’s road show. These are two supplier events that are organized to foster effective relationship with suppliers via face to face collaboration.</p>  <p>Third section is supplier evaluation and management. You will learn about various supply chain responsibilities, the concept of sub-supplier management and some of the golden rules in supplier management.Upon completion of the course, you would be able to develop a comprehensive program to manage all your suppliers, a program that would ensure high performance and low risk for your function.</p>", 
    "end_date": null, 
    "title": "Developing & Improving Supplier Relationships", 
    "price": "20.00", 
    "instructors": "SkillBiz Solutions", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/744642_91c3.jpg", 
    "course_url": "https://www.udemy.com/developing-improving-supplier-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-28T09:36:31Z"
}