{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>“Elimine desperdicio con la implementación de las 5S” es un curso que tiene por objetivo explicar, de manera sencilla, como utilizar esta herramienta de modo a mantener los puestos de trabajo limpios, organizados y seguros e a también como seguir mejorándolos continuamente.</p><p>Abarca todas las etapas de las 5S, con el conocimiento único de ALC, un equipo de especialistas en Lean 6 Sigma con décadas de experiencia en el tema.</p><p>El curso se ha organizado en la secuencia de las etapas de las 5S, teniendo como introducción un ejemplo de una situación inicial y de la identificación del problema, para dar una perspectiva de la importancia de esta herramienta y permitir al alumno hacer un paralelo con su propia experiencia y vivencia. Es la base que permite comparar el Antes con el Después. Cada etapa de las 5S es explicada primero con animaciones básicas y luego con un caso de aplicación real en una empresa industrial.</p><p>En la animación, nuestro amigo Juan tiene un problema y decide no volver a pasar por ello, para evitarlo utilizará las 5S. Este problema va a demostrar claramente a Juan la necesidad de implementar las 5S bien como los conceptos contenidos en cada una de sus etapas. En las aplicaciones prácticas, en ambientes industriales, por ejemplo, hay típicamente dificultades en este proceso, que son tratadas en este curso, así como las estrategias e trucos de alguien con experiencia para tornar tu implementación de las 5S un éxito.</p> Las 5S son la base de todas las abordajes Lean, por lo que es correcto afirmar que el “viaje” empieza aquí. En un único curso, te damos la oportunidad de minimizar los riesgos de implementación, evitar procedimientos erróneos e de mejorar radicalmente los procesos de su empresa!", 
    "end_date": null, 
    "title": "Elimine desperdicio con la implementación de las 5S", 
    "price": "40.00", 
    "instructors": "ALC Learning", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541000_e717.jpg", 
    "course_url": "https://www.udemy.com/elimine-desperdicio-con-la-implementacion-de-las-5s/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T08:46:03Z"
}