{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<span>Elimine desperdício através da implementação dos 5S, é um curso com o objetivo de explicar, de uma forma simples, como utilizar esta ferramenta de modo a manter os postos de trabalho limpos, organizados, seguros e melhorados continuamente.</span>  </p>  <p>  \tAbrange todos os passos dos 5S, com o know-how único da ALC, uma equipa de especialistas em Lean 6 Sigma com décadas de experiência na matéria.  </p>  <p>  \tO curso está dinamizado por etapa dos 5S mas começa por dar uma visão geral da situação inicial e da constatação do problema, o que fornece uma perspetiva da importância da ferramenta e permite ao aluno fazer uma comparação com a sua própria experiência e vivência. É a base que permite fazer a comparação entre o Antes e o Depois. Cada etapa dos 5S é explicada em primeiro lugar com animações simples e depois com um caso de implementação real numa empresa fabril.  </p>  <p>  \tNa animação, o nosso amigo Zé tem um problema que decide não voltar a ter nunca mais com a ajuda dos 5S. O problema do Zé vai mostrar-lhe claramente a necessidade de implementar os 5S assim como os conceitos inerentes de cada etapa. Na empresa fabril, surgem tipicamente aspetos complicados neste processo que são abordados assim como as estratégias e dicas de sucesso adquiridas pela experiência para tornar o seu programa de implementação dos 5S um sucesso.  </p>  <p>  \tOs 5S constroem a base de todas as abordagens Lean, pelo que é correto afirmar que a “viagem” começa aqui. Num único curso, damos-lhe a oportunidade de minimizar os riscos de implementação, evitar procedimentos errados e de melhorar radicalmente os processos da sua empresa!  </p>", 
    "end_date": null, 
    "title": "Elimine desperdício através da implementação dos 5S (PT-PT)", 
    "price": "40.00", 
    "instructors": "ALC Learning", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404722_e77b.jpg", 
    "course_url": "https://www.udemy.com/elimine-desperdicio-atraves-da-implementacao-dos-5s/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T21:19:53Z"
}