{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Eliminate waste by implementing 5S is a course intended to explain, in a simple way, how to use this tool to keep workplaces clean, organized, safe and continuously improving.  </p>  <p style=\"\">  \t  It goes through all the 5S steps, with the unique know-how of ALC, a team of Lean 6 Sigma experts with decades of experience on the subject.  </p>  <p style=\"\">  \t  The course is streamlined in each stage of 5S but starts with an overview of the starting condition and problem statement. This gives insights on the importance of the tool and makes it possible for the student to compare with his/her own experience and background. It also a basis to make the important before &amp; after comparisons. Each step of 5S is explained, first with simple animations and after with a real implementation case in a manufacturing company.  </p>  <p style=\"\">  \t  In the animations, our friend Joe has a problem which he decides to never let happen again with 5S. Joe’s problem will make the need for 5S clear for you, as well as the concepts behind each step. In a real production company, there are  tricky issues that typically emerge in this process. These issues are brought up, and so are the countermeasures and success hints learned by experience to make your program a success.  </p>  <p style=\"\">  \t  5S builds the basis to all Lean approaches, so it is fair to say that the journey starts here.  </p>  <p style=\"\">  \t  In a single course, we give you the chance to minimize the implementation risks, to avoid typical failure modes and to radically improve the processes of your company!  </p>", 
    "end_date": null, 
    "title": "Eliminate waste by implementing 5S", 
    "price": "40.00", 
    "instructors": "ALC Learning", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265578_6fe3_4.jpg", 
    "course_url": "https://www.udemy.com/eliminate-waste-by-implementing-5s/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T10:35:09Z"
}