{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The warehouse continues to play a key role in every organization's supply chain. Managers can benefit greatly from a better understanding of just what this role entails, and how it directly affects business. Because it's vital that finished goods be held in close proximity to the point of consumption, many warehouses have evolved beyond simple storage facilities to provide fulfillment, sortation, and consolidation services as cross-docking and transshipment centers. </p><p>This course was designed based on the instructor's real-world knowledge and experience, gained through hands-on operations. It will enable you to improve your warehouse procedures as a whole, by teaching you the basic principles of warehousing, and by examining both the current challenges and future advances associated with warehouse management. You'll learn effective methods for increasing productivity, reducing costs, improving customer relations, maintaining employee health and safety, and mitigating negative environmental effects.</p><p><strong>Content and Overview:</strong></p><p>This course contains 42 lectures, 6+ hours of content organized in 6 areas, and quizzes containing 35+ questions. It's designed for beginners and intermediate professionals involved in daily operations, senior managers seeking a basic understanding of warehousing, and students considering a career in warehousing regardless of their experience level.</p><p><strong>The content areas include:</strong></p><ul><li>The Warehouse Manager's Role and Challenges. The Role of the Warehouse.</li><li>Warehouse Processes - receiving and put-away, pick preparation, order picking, replenishment, stock management, dispatch, and value-adding services.</li><li>Warehouse Management Systems, Warehouse Layout, Storage and Handling Equipment.</li><li>Warehouse Resourcing, Costs, and Performance Measurement.</li><li>Health and Safety Management. Impact on the Environment.</li><li>Outsourcing and Future Challenges.</li></ul><p>By completing this course, you'll be armed with the valuable and practical skills you need to improve both your personal performance as a Warehouse Manager, and the overall performance of your company's warehouse as an integral part of the supply chain. You'll know how to increase the efficiency, productivity, quality and accuracy of your warehouse procedures. You'll understand key elements such as choosing the right technology, storage, and handling equipment, as well as effective workforce management and evaluation methods. You'll also understand the significance of improving health and safety, and reducing adverse environmental outcomes. And finally, you'll know how to use outsourcing opportunities to effectively fulfill warehouse functions.</p>", 
    "end_date": null, 
    "title": "Excellence in Warehouse Management", 
    "price": "20.00", 
    "instructors": "Operational Excellence Training", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477822_61bd_2.jpg", 
    "course_url": "https://www.udemy.com/excellence-in-warehouse-management/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T08:29:31Z"
}