{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is the PREMIUM version of the <strong>Outsourcing and Remote Teams - Getting Started</strong> course. Not only do you get the same great content, you also receive:</p><ol><li>Step-by-Step video based training in getting started</li><li>A copy of '<strong>How To Outsource Without Losing Your Mind</strong>'. - a 29 page getting started eBook, normally sold for $17.</li><li>Video training on my preferred job site for finding virtual assistants. A 'How To' and tips and tricks for finding the right person.</li><li>Setting up and configuring your online project management system and how to do it for <strong>FREE</strong>. A simple to follow video guide.</li><li>A PDF file of sample job advertisements for the common job types and roles you will be recruiting for.</li><li>A template Welcome Email that I use for induction that has never failed me!</li><li>DropBox Video guide - how to set it up and run your team efficiently with it.</li></ol><p><br></p><p><strong>There are also 7 included AUDIO guides from the lessons I have learnt:</strong></p><ol><li>Handling Exchange Rates</li><li>Avoiding Prepayment</li><li>Provide Opportunities</li><li>Creating Tasks and Assigning</li><li>Overcoming Differences within your Team</li><li>Building Trust with Remote Team Members</li><li>Managing the difference in Time Zones</li></ol><p><br></p><p>This course is for anyone who can answer <strong><em>YES</em></strong> to any of the following questions:</p><ul><li>Have you struggled to find a virtual assistant?</li><li>Desperately need to outsource some work?</li><li>Missing important skills needed to expand your business?</li><li>Have no idea how to get started?</li></ul><p>If so, then you need to join this <strong>course.</strong></p><p><strong><br></strong></p><p><strong>You will discover how to:</strong></p><ul><li>Overcome the challenges of finding, hiring and inducting overseas employees</li><li>Create the team culture you need to work towards success</li><li>Avoid the challenges of communication problems</li><li>Create a relationship of trust between yourself and remote workers</li><li>The systems you need to use to get started and effective</li></ul><p><br></p><p>Uncover all the secrets to establishing an effective remote team of outsourced workers with this 5 part video course by Adam Michael from <strong>Multiply-Yourself</strong>.</p><p><strong>Included in this course are all the resources and guides you need to not only get started, but to succeed in managing your team.</strong></p>", 
    "end_date": null, 
    "title": "Getting Started - Outsourcing & Remote Teams PREMIUM", 
    "price": "20.00", 
    "instructors": "Adam Maddison", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673046_4785.jpg", 
    "course_url": "https://www.udemy.com/outsourcing-and-remote-teams-getting-started-premium/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T07:54:03Z"
}