{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Gmail is Google&#039;s free email service, and it&#039;s amazing. It can become your ultimate productivity tools, allowing you to get more done in less time by enabling you to focus and act upon the most important information every day.</p><p>I teach&nbsp;<a href=\"http://www.udemy.com/lessdoing/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">The Art of Less Doing</a>, a framework for productivity I developed to help people optimize, automate, and outsource everything in their lives and be more effective. I&#039;m constantly writing about new ways to save you time and get more done at my&nbsp;<a href=\"http://www.lessdoing.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Less Doing</a>&nbsp;blog.&nbsp;</p><p>Having a clean inbox is an essential basis for being more productive which is why I created this course. Achieving an empty inbox is not that hard when you have the right methods and tools. This course begins with my philosophy and methodology for dealing with email. It takes you through the steps of getting started with Gmail and setting it up the way I reccomend.</p><p>The second part of the course gives details on each of the amazing add ons or related services that I beleive are essential to maximize productivity. I chose to utilize videos produced by the creators of these products because they explain them better than I ever could.&nbsp;</p><p>IFTTT is a free service that allows you to create automations between popular web services so you can &quot;set it and forget it&quot; and get back to the work you need to do.</p><p>Virtual Assistants bring the whole process full circle by allowing you to outsource all of the tasks you don&#039;t want to do and haven&#039;t been able to automate.</p><p>The value I hope you get from this course is my step-by-step, cohesive assembly of tools created by the tech community framed with my original content and methods for getting the most out of email. In&nbsp;addition&nbsp; you&#039;ll be able to ask questions on the course forum which will be answered by me and/or other students. I will also offer regular live sessions where you can ask me questions and make comments in real time.</p>  ", 
    "end_date": null, 
    "title": "GMail, IFTTT, Virtual Assistant - Ultimate Productivity Trio", 
    "price": "25.00", 
    "instructors": "Ari Meisel", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33524_6df5_7.jpg", 
    "course_url": "https://www.udemy.com/lessdoinggmail/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-24T18:56:01Z"
}