{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Student Feedback:</strong></p><p><strong>\"Valuably crisp, clear and content-full!</strong> </p><p><em><strong>\"I had signed for few Lean Six Sigma courses before but none came close to the value one gets by undergoing this course. The course content is very clear and crisp to the point, and adds a lot of insights on real world implications. I would highly recommend this course for any Six Sigma beginners/enthusiasts and look forward for advanced Six Sigma courses from Canopus Business Management Group!\" by Dharmaraj N</strong></em></p><p>______________</p><p><strong>Globally Accredited</strong></p><p>International Association for Six Sigma Certification(IASSC) and The Council for Six Sigma Certification are the only two accrediting organizations focused on Lean Six Sigma.  We are an <em>Accredited Training Organization</em> of both<strong> International Association for Six Sigma Certification(IASSC) </strong>&amp;<strong> <strong>The Council for Six Sigma Certification (CSSC)</strong></strong> for Yellow Belt, Green Belt and Black Belt Training Programs.</p><p>______________</p><p>LAST COURSE UPDATION DATE: Aug 13, 2015 (New Lecture Added)  </p>  <p>  \t    What do people who often get promotions and adorable pay hikes year after year do differently?  </p>  <p>  \t        You don't need to add multiple academic degrees for that. Pay rise is within your reach. All you need is to know this silly logic.  </p>  <p>  \t        In today's challenging economic environment, every organization in the private sector, government and non-profit is constantly being challenged to evolve and become fit for the future. If they don't, they perish. It's like Darwin's theory of evolution for organizations.  </p>  <p>  \t        So they back employees who can 'challenge' and 'change' their business processes, products &amp; services to become 'Future Fit\".  Moreover who in today's world wants to keep doing what they are already doing.  </p>  <p>  \t        To become future fit, Lean Six Sigma is a proven formula being used by most successful organizations such as GE, Ford, Bank of America, Amazon, Boeing, Dell, Motorola, 3M, US Army, US Marine Corps, Caterpillar, National Kidney Foundation, etc.,  </p>  <p>  \t        Imagine yourself with the right Lean Six Sigma knowledge &amp; certification; you can bring about desperately needed improvements to your organization's business processes.  </p>  <p>  \t        Remember, organizations hire you for your qualifications and past experience, but they will reward you only when you directly contribute to their strategic goals. You will get promotions and pay hikes, year after year, surpassing all qualification barriers.  </p>  <p>  \t        You don't have to shred your core strengths and become a Lean Six Sigma professional. Lean Six Sigma supplements core strengths that you already have. So, it's like a 'booster'.  </p>  <p>  \t        So whatever be your industry, if you take this course, your managers will want to recognize and promote you!  </p>  <p>  \t        There are many Lean Six Sigma Certification courses, but you first need to know what is relevant to you. You should learn practical tips that can be readily applied not mere academic stuff that you will find in any book. Most courses view Lean Six Sigma as a 'Quality Management Training'. However, the real power of Lean Six Sigma is in transforming businesses, and not mere 'quality improvements'!  </p>  <p>  \t        This course is specifically designed for professionals like you, who want to fast track your career.  </p>  <p>  \t<strong>How is this course different from others?</strong>  </p>  <p>We are an accredited Training Organization of IASSC and CSSC, the only two global accrediting bodies focused in Lean Six Sig,a.  \t      </p><p>I have experienced fast track growth in my 17 years long career, starting off as a trainee in an automotive firm to a senior vice president in bank within 10 years, without an MBA. I attribute this success to my Lean Six Sigma knowledge. It has also given me the ability to seamlessly move across industries.  </p>  <p>  \t      Through a series of courses (starting with this one), I'm going to share my knowledge of Lean Six Sigma and some tips that can help you to achieve similar fast track growth.  </p>  <p>  \t      I'm not just sharing academic information, but instead my tacit knowledge that can help fuel your career, because this world needs professionals who can challenge the status quo and change it ... not just manage stuff!  </p>", 
    "end_date": null, 
    "title": "Grow with Lean Six Sigma Yellow Belt Certification Now", 
    "price": "40.00", 
    "instructors": "Nilakantasrinivasan Janakiraman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314338_2f09_7.jpg", 
    "course_url": "https://www.udemy.com/fast-track-lean-six-sigma/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-06T15:03:11Z"
}