{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">A verifiable Certificate of Completion is presented to all students who undertake this course. Present this certificate to the Project Management Institute (PMI) for 6 PDUs</strong>  </p>  <p style=\"\">  \t             Your primary responsibility as a Help Desk Analyst is to provide top-notch first-level support, which will require troubleshooting technical issues, supporting complex software and computer technology in a high-service environment.  </p>  <p style=\"\">  \t<strong style=\"\">  Boost your career with this book</strong>, pass the included certified elearning course, and achieve your Help Desk Analyst certification.  </p>  <p style=\"\">  \t<strong style=\"\">How to register for your exam</strong>  </p>  <p style=\"\">  \t          1. Complete the Help Desk Analyst Course  </p>  <p>  \t          2. Once you&#039;ve completed the course, email our exam department at <a href=\"mailto:exams@artofservice.com.au\" rel=\"nofollow noreferrer\" style=\"\" target=\"_blank\" class=\"external-link\">exams@artofservice.com.au</a> to purchase your exam voucher and sit your final exam.  </p>  <p style=\"\">  </p>  <p style=\"\">  \t          3. Your exam can be scheduled online and you will receive a PDF certificate when you pass your exam.  </p>  <p style=\"\">  \t        ==============================  </p>  <p style=\"\">  \t        This book and certification is for any professional or company that’s looking to offer professional-grade IT support service with very little effort. Using the benefits of elearning certification, The Art of Service has helped professionals in all industries move their help desk and customer support operations to the next level. Companies that can attest to the fact that with this book and course, the name of the game is simplification.  </p>  <p style=\"\">  \t             The Help Desk Analyst Complete Certification course is built upon the idea that help desk support doesn’t have to be complicated and cumbersome.To assist an individual seeking employment as a Help Desk analyst, this program and associated workbook aims to provide an overview of the typical knowledge and skills required, without focusing on any one technology vendor or platform.  </p>  <p style=\"\">  \t             This program does assume the reader already has some technical knowledge that will be utilised in a Help Desk role. The focus of the program is on the high-level practices that are important when providing Help Desk support services, including customer service, IT Service Management and the technical activities that will be performed.  </p>", 
    "end_date": null, 
    "title": "Help Desk Analyst", 
    "price": "50.00", 
    "instructors": "The Art Of Service", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101284_92a8_7.jpg", 
    "course_url": "https://www.udemy.com/help-desk-analyst/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-04T04:01:47Z"
}