{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    This course will show you how to easily integrate invaluable seamless user engagement tools to your website.  </p>  <p>  \t<strong>No developer knowledge required</strong>. Basically, if you can use a mouse this course is for you!  </p>  <p>  \t    Ever wondered how large organisations manage their online customer services? They receive enquiries from several routes (email, contact form, live chat, and so on):  </p>  <ul>  \t<li>How do they log everything? </li>  \t<li>How do they prioritise it? </li>  \t<li>How do they know that the enquiry has been dealt with and within x number of hours? </li>  </ul>  <p>  \t    This course will empower you with the tools to automate all of the above and much more...  </p>  <p>  \t    This type of tools were only traditionally used by large organisations but are now available to everyone for free<strong> </strong>(via freemium accounts). All the tools are cloud/SaaS/web based and are highly sophisticated.  </p>  <p>  \t    By the end of the course you will know how to add the following tools to your website:  </p>  <ul>  \t<li><strong>Live Helpdesk</strong> - Lets you have live conversations with visitors on your website.<br>  \t      (integrates with Skype,GTalk, Yahoo IM, MSN and AIM - your visitors chat via your website and you engage from anywhere via any of the above which you can have installed on your smartphone or any tablet, PC, etc...)</li>  \t<br>  \t<li><strong>Support Tickets</strong> -<strong></strong> to track and respond to customer support requests<strong></strong><br>  \t <strong><br>  \t </strong></li>  \t<li><strong>Ideas &amp; Feedback Forum </strong>- to understand the ideas users care about most. Users can post their ideas and vote on other users&#039; ideas (integrates with Facebook page by adding an interactive &quot;feedback&quot; button and if you have an iPhone app, you can also integrate it on the app so users can suggest feature improvements)<br>  \t<br>  \t<strong></strong></li>  \t<li><strong>User Satisfaction Rating</strong> - to gauge user feelings about your website<br>  \t<br>  \t</li>  \t<li><strong>Development Voting</strong> - for users to vote on your future development ideas; allow you to test which ones are most popular so you can prioritise accordingly</li>  \t<br>  \t<li><strong>Knowledge Base / Article Bank</strong> - to answer common questions and help users find the information they need when they need it<br>  \t<br>  \t </li>  \t<li><strong>Contact Form</strong> - another way for users to contact you<br>  \t </li>  </ul>  <p>  \t  All of the above tools are synchronised with each other which means you can manage the information from one central admin panel.  </p>  <p>  \t    All of them will be customised with your corporate identity and can be installed to any type of website.  </p>  <p>  \t    All tools come with highly sophisticated live analytics/metrics which allow you to measure a great deal of invaluable information about your website visitors (some also integrate with Google Analytics).  </p>  <p>  \t<a href=\"http://support.udemy.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Click here</a> to see a live example of some of these features. If it&#039;s good enough for Udemy...  </p>  <p>  \t    Although all that is mentioned above is included in the account, please note that the freemium account will have a few limitations (additional functionality can be added if you choose to pay).  </p>  <h5></h5>  <p>  \tDon&#039;t forget the 30-day money back guarantee.  </p>  <h5></h5>  <p>  \tSo why wait?  </p>  <h5></h5>", 
    "end_date": null, 
    "title": "High User Engagement and Automation on your Website for Free", 
    "price": 0, 
    "instructors": "Daniel Trindade, APT Choices", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/56172_1b58_9.jpg", 
    "course_url": "https://www.udemy.com/free-live-helpdesk-support-tickets/", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-24T07:21:31Z"
}