{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t Most companies still operate as if they control their customers.  But, in today&rsquo;s market, it&rsquo;s really the other way around.  In fact, there&rsquo;s a new boss in town, named Customer CEO.  This course is based on Chuck Wall&rsquo;s book, <em style=\"\">Customer CEO: How to Profit from the Power of Your Customers.</em>  </p>  <p>  \t Everyone in a business career needs to consider the idea of purpose. It doesn&rsquo;t matter whether you are a CEO, a middle manager, or a frontline employee. You are a leader in your own way because you have influence for good or bad. This influence extends to both your coworkers and your customers. The Power of Purpose is about the values you share with your customers and each other in the workplace.  </p>  <p>  \t A company&rsquo;s first order of business must be to make a profit. In fact, it should strive to maximize its profit. Profit provides the necessary capital to innovate, retain the best talent, and sustain the enterprise. But the question is, are too many companies failing to lead enterprises with core values that can be shared with both customers and employees?  </p>  <p>  \t This course will help you better understand how to think about using the Power of Purpose. Case studies from TOMS, Patagonia and The Luck Company will paint vivid examples of companies that understand and align with the values of their customers.  You will also work through two hands-on exercises to better understand how the Power of Purpose can help differentiate your company.  </p>  <p>  \t Every student who successfully completes this course will receive a Certificate of Completion.  </p>  <p>  \t We look forward to sharing much more about the Power of Purpose with you!  </p>", 
    "end_date": null, 
    "title": "How to Share Your Customers Purpose", 
    "price": "20.00", 
    "instructors": "Chuck Wall", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/123586_a73f_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-share-your-customers-purpose/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-21T17:57:08Z"
}