{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t     Most companies still operate as if they control their customers.  But, in today’s market, it’s really the other way around.  In fact, there’s a new boss in town, named Customer CEO.  This course is based on Chuck Wall’s book, <em style=\"\">Customer CEO: How to Profit from the Power of Your Customers.</em>  </p>  <p>  \t     What was once a trickle of product and service simplicity is turning into a raging river. There is a <em style=\"\">revolution of simplification </em>taking shape in the marketplace. When we look at technology innovations like the cloud, software as a service, analytics dashboards, and apps we see that developers are finally beginning to think about simplicity as a major driver of new business opportunities.  </p>  <p>  \t     Great designers and inventors focus on reducing unnecessary steps.  Now, every businessperson needs to think of themselves as business designers in order to improve the customer experience every step of their journey. The products and services you ask customers to acquire should be simple to buy, use, maintain, and get rid of when it’s used up or worn out. The more people can enjoy something because of its simplicity, the more often they will use and recommend it to others.  </p>  <p>  \t     This course will help you better understand the Power of Simple with case studies about In-N-Out Burger and a Shark Tank selected entrepreneurial company called One Sole. You will also work through two hands-on exercises to better understand how the Power of Simple will sharpen the way you do business.  </p>  <p>  \t     Every student who successfully completes this course will receive a Certificate of Completion.  </p>  <p>  \t     We look forward to sharing much more about the Power of Simple with you!  </p>", 
    "end_date": null, 
    "title": "How to Simplify Your Customers Lives", 
    "price": "20.00", 
    "instructors": "Chuck Wall", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/123560_a33d_8.jpg", 
    "course_url": "https://www.udemy.com/be-simple-for-your-customers/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-21T17:27:01Z"
}