{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t Most companies still operate as if they control their customers.  But, in today&rsquo;s market, it&rsquo;s really the other way around.  In fact, there&rsquo;s a new boss in town, named Customer CEO.  This course is based on Chuck Wall&rsquo;s book, <em style=\"\">Customer CEO: How to Profit from the Power of Your Customers.</em>  </p>  <p>  \t People hate rules. The more there are, the more they want to break them. They also resent it when they feel that rules are unfairly applied. If you must have rules, couldn&rsquo;t they be more fun?  Customers resent the show of power by organizations, particularly if they believe the rules are unfair or unnecessary. Customers love companies that don&rsquo;t take themselves too seriously. Learn to engage customers by adding sheer joy to your business, and you will profit by making that a competitive advantage for your company.  That&rsquo;s the secret of the Power of Rebellion.  </p>  <p>  \t This course will help you better understand how some brands are using the Power of Rebellion to dramatically outperform their rivals.  Case studies from Dos Equis Beer, musician Andre Rieu, Harley Davidson, Big Ass Fans, and Red Bull will inspire you to break the rules, too.  You will also work through two hands-on exercises to better understand how the Power of Rebellion can help differentiate your company.  </p>  <p>  \t Every student who successfully completes this course will receive a Certificate of Completion.  </p>  <p>  \t We look forward to sharing much more about the Power of Rebellion with you!  </p>", 
    "end_date": null, 
    "title": "How to Let Your Customers Break the Rules", 
    "price": "20.00", 
    "instructors": "Chuck Wall", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/123580_0e1e_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-let-your-customers-break-the-rules/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-21T17:55:18Z"
}