{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      Most companies still operate as if they control their customers.  But, in today&rsquo;s market, it&rsquo;s really the other way around.  In fact, there&rsquo;s a new boss in town, named Customer CEO.  This course is based on Chuck Wall&rsquo;s book, <em style=\"\">Customer CEO: How to Profit from the Power of Your Customers.</em>  </p>  <p>  \t      This course will help you confront a new market reality: that customers choose which companies to do business with entirely on their own terms.  Contrary to popular opinion, Chuck shows that the customer is not always right.  But, they still hold the cards in today&rsquo;s fragmented, highly competitive, social commerce marketplace.  This reality effectively inverts the power, control, and direction of decision-making.  To survive and prosper in this new landscape, leaders, managers, and employees must quickly adapt or face extinction.  </p>  <p>  \t      This course offers much more than theory. Chuck&rsquo;s primary research has revealed that every customer possesses nine powers today. There are over twenty case studies of companies that enjoy competitive advantage by understanding this new reality. Every student will also explore new ways to gain deep customer insight.  Chuck presents a framework and extensive toolbox to dig deeper and find out how to solve the problems customers are really having.  There are also twenty white board breakout sessions that will help every participant understand these concepts and tools better.  Please note that this course is a bundle of the eleven customer courses offered by Wall Business.  </p>  <p>  \t      Every student who successfully completes this course will receive a Certificate of Completion.  </p>  <p>  \t      We look forward to sharing much more with you!  </p>", 
    "end_date": null, 
    "title": "How to Profit from Your Customers", 
    "price": "50.00", 
    "instructors": "Chuck Wall", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59772_57a8_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-profit-from-your-customers/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-12T22:51:09Z"
}