{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   Most companies still operate as if they control their customers.  But, in today&rsquo;s market, it&rsquo;s really the other way around.  In fact, there&rsquo;s a new boss in town, named Customer CEO.  This course is based on Chuck Wall&rsquo;s book, <em style=\"\">Customer CEO: How to Profit from the Power of Your Customers. </em>  </p>  <p>  \t   For far too long, business people at many companies have gone to market with blinders on. Decisions are made far too often with imprecise and incomplete information. They often look at things primarily from a right brain perspective; all art, little science. This is because many of them lack basic quantitative and analytical skills. Marketing must be efficient to be effective in a world of diminishing resources. It&rsquo;s failing if it is not held to that standard. Marketing must measure what&rsquo;s really important. Today, analytical tools are readily available to measure marketing results. &ldquo;Big Data&rdquo; is available to everyone.  </p>  <p>  \t   But is your company profiting from &ldquo;Big Insight&rdquo;?  This course teaches you a new method we call &ldquo;Customer Thinking.&rdquo; Customer Thinking balances the analytical and the intuitive. It allows every business to fuse its left-sided quantitative customer intelligence (big-data analytics) and its right-sided qualitative customer insight (empathy) into a single, integrated framework.  </p>  <p>  \t   When you put together the analytical and the intuitive you are, in essence, marrying the &ldquo;what&rdquo; with the &ldquo;why.&rdquo; Too many companies rely exclusively on data to explain the what. Ironically, many have so much data that they can&rsquo;t process it and make it meaningful. But the quantitative is only one piece of the puzzle. The &ldquo;why&rdquo; is the missing link for becoming a customer-centric company. The purpose of Customer Thinking is twofold: to increase customer engagement and to improve the customer experience. If you accomplish those two things, you will build a thriving, differentiated brand and maximize the lifetime value of your customers.  </p>  <p>  \t   Every student who successfully completes this course will receive a Certificate of Completion.  </p>", 
    "end_date": null, 
    "title": "How to Actively Engage Your Customers", 
    "price": "20.00", 
    "instructors": "Chuck Wall", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/123588_c70a_11.jpg", 
    "course_url": "https://www.udemy.com/how-to-actively-engage-your-customers/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-21T17:58:44Z"
}