{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   This course will guide you through the process of hiring your first virtual assistant, starting with how to determine what tasks you can outsource, where to post your job, how to narrow down the applicants, and ultimately making the hiring decision.  </p>  <p style=\"\">  \t<strong style=\"\">Why Hire a Virtual Assistant?</strong>  </p>  <p style=\"\">  \tIn short, to save yourself time, money, and headache.  </p>  <p style=\"\">  \tAs a small business owner, your most precious resource is your time. After all, each minute you spend is a minute you&#039;ll never see again. A virtual assistant is an investment in reclaiming that time so you can spend your time more wisely.  </p>  <p style=\"\">  \tYou&#039;ll start by identifying your outsourcing opportunities, the tasks that someone else can and should be doing for you. After all, you need to be working ON your business, rather than IN it.  </p>  <p style=\"\">  \t<strong style=\"\">The Course Structure</strong>  </p>  <p style=\"\">  \t   The course is broken up into 8 video PowerPoint segments that follow a trusted process I have used to much success in my own business. You&#039;ll be able to get through the modules quite quickly, but there is some homework involved, including:  </p>  <ul style=\"\">  \t<li style=\"\">Tracking how you&#039;re currently spending your time</li>  \t<li style=\"\">Finding which tasks you can get off your plate</li>  \t<li style=\"\">Crafting and posting an attention-getting job description</li>  \t<li style=\"\">Narrowing down your applicant pool</li>  \t<li style=\"\">Testing and interviewing the most promising candidates</li>  </ul>  <p style=\"\">  \tIf you&#039;re finding yourself overwhelmed or burned out with your work, there&#039;s a light at the end of the tunnel. It just takes a short investment in time to learn the basics of hiring a VA, and some additional time to train them on your process, but the long-term benefits are huge.  </p>  <p style=\"\">  \tThis course is more geared toward hiring a virtual team member for ongoing business support, rather than for a one-off project; though much of the content will be applicable to both scenarios.  </p>  <p style=\"\">  \t<strong style=\"\">The Deliverables:</strong>  </p>  <p style=\"\">  \tBy the end of the course you&#039;ll have the confidence and skills to go out into the wild and hire your first virtual assistant.  </p>  <p style=\"\">  \tPrepare for a new era of business growth and productivity!  </p>", 
    "end_date": null, 
    "title": "How to Hire a Virtual Assistant", 
    "price": 0, 
    "instructors": "Nick Loper", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/166002_4a2b_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-hire-a-virtual-assistant/", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-17T18:01:34Z"
}