{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p></p><p></p><p>The  Global Business Outsource Processing industry is experiencing tremendous  growth. Due to global economic conditions,&nbsp;  many companies have chosen to outsource tasks and operations to remain  competitive in the global marketplace. For some startup individual  entrepreneurs it is still a new challenge- outsourcing overseas. In this course  we shall focus on how to smartoutsource your virtual assistant from the  Philippines.&nbsp;&nbsp;</p><p>Why the Philippines? The  Philippines has become a top outsourcing destination by hundreds of global companies  for virtual assistants for many good reasons such as: low labor hourly rates, english proficient workforce with neutral accent, western culture affinitity and the filipino people&#039;s dedication to work , flexibility to adapt to other cultures and work conditions- all combine to ideals of a great team collaborator. &nbsp;</p><p>The following were the top 10 Philippine global business outsourcing companies in 2010 that earned millions in dollar revenues : Accenture, Convergys, Teletech Customer Care, JP MOrgan Chase Bank, Stream International Global Services, Aegis People Support, Sykes Asia, Sitel ,Telephilippines, Telus . Also in 2011 , the Philippine BPO industry &nbsp;earned 11 billion US dollars.&nbsp;</p><p>If you are a startup entrepreneur you too can take advantage of the same opportunities these big companies have chosen through outsourcing . &nbsp;</p><p>&nbsp;Here are the main course topics we shall be covering to help you.</p>    <p>1.What  is outsourcing? what is offshoring?</p>    <p>2.  What is a virtual assistant?</p>    <p>3.The five reasons &nbsp;why you should outsource ?</p>    <p>4. The Factors and events &nbsp;that led to global outsourcing</p>    <p>5. Rise of Philippine business outsource processing - number one in voice , number two in non-voice- &nbsp;a 25 US billion dollar industry in the Philippines &nbsp;by 2016</p>    <p>6. Types of virtual assistants you can hire</p>    <p>7. Where and how to find your virtual assistants fast in the Philippines</p>    <p>8. Guide to interviewing and training your Philippine virtual assistant</p><p>9. Do you choose a company, agency or hire direct?</p><p><br></p><p></p>  ", 
    "end_date": null, 
    "title": "How to Smartoutsource Your Virtual Assistant ", 
    "price": "20.00", 
    "instructors": "Arianne Globaltechsource", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48733_cb80_18.jpg", 
    "course_url": "https://www.udemy.com/how-to-smartoutsource-your-virtual-assistant/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-06T07:10:06Z"
}