{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em></em><em><span></span></em>A strong reason <em>Lean Accounting</em> gained prominence is because traditional accounting systems were essentially backwards looking, and are not able to reflect accurately the improvements through Lean. The point to remember is that lean accounting is undoubtedly a major improvement over the status quo, but must still not be used to control the financial performance of the firm. Even though lean accounting will provide you with much better information, it is important to understand that the financial performance is an emergent outcome of the relationships among the organization’s parts. Managers should not use financial targets to control financial results, instead, manage the relationships that produce these results.</p><p>Lean manufacturing is concerned with eliminating waste in manufacturing processes. Promised benefits included such outcomes as reduced lead times, improved quality, improved on-time deliveries, less inventory, less space, less human effort, lower costs, and increased profitability. </p><p>Lean accounting is a simplified approach to costing that supports lean manufacturing with both financial and non-financial measures. One key area that supports efficiency improvement is productivity measurement, which is concerned with the relationship between outputs and inputs. As waste decreases through lean manufacturing practices, productive efficiency should increase.</p><p><strong>Content and Overview:</strong><br></p><p>This course contains 10 lectures, over 1.5 hours of content, and a quiz containing 15 questions. The course is suitable for students and business professionals who want to get a basic understanding of Lean Accounting and to explore various strategies and best practices for developing and implementation of lean accounting and productivity measurement.<br></p><p>The content areas include:<br></p><ul><li>Lean Manufacturing Basics</li><li>Lean Accounting</li><li>Productivity Measurement and Control</li><li>Total Productivity Measurement</li><li>Measuring Changes in Activity and Process Efficiency</li><li>Process\nProductivity Model</li><li>Performance\nMeasures</li></ul><p>By completing this course, you'll be armed with the valuable and practical skills you need to create, develop, implement, maintain and sustain an effective Lean Accounting and Productivity Measurement system in order to improve your product/service costing accuracy, support decisions about pricing, improve the efficiency of processes and activities, and evaluate process improvement initiatives. </p>", 
    "end_date": null, 
    "title": "Lean Accounting and Productivity Measurement", 
    "price": "20.00", 
    "instructors": "Operational Excellence Training", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692112_bab4_2.jpg", 
    "course_url": "https://www.udemy.com/lean-accounting-and-productivity-measurement/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T15:57:15Z"
}