{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  OVER 750 STUDENTS HAVE ALREADY SUCCESSFULLY TAKEN THIS COURSE!  </p>  <p>  \t  -----------------------  </p>  <p>  \t<em>NEW! Now includes the Business Improvement Blueprint and 2 additional lectures - to help you figure out where to start.</em>  </p>  <p>  \t<em>Updated November 6, 2015</em></p>  <p>  \t  -----------------------  </p>  <p>  \t  ABOUT THIS COURSE:  </p>  <ul>  \t<li><em>Over 750 very happy students</em></li>  \t<li><em>No other tools, coaching or anything else is required</em></li>  \t<li><em>Very positive reviews from both my Udemy students and the people I've trained 'in real life'</em></li>  \t<li><em>Full, free lifetime access</em></li>  \t<li><em>All future extra lectures and bonus upgrades are always included for free</em></li>  \t<li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li>  </ul>  <p>  \t  -----------------------  </p>  <p>  \t  LEARN THE TECHNIQUE THAT IS:  </p>  <ul>  \t<li>The leading method for saving millions in big corporates like GE.</li>  \t<li>Responsible for saving &gt;$25M in 1 year at a corporate I used to work for.</li>  \t<li>Responsible for saving crucial cash in various SME's and Startups I worked in.</li>  \t<li>Proven and tested for more than 60 years now in 1000s of companies of all types and sizes.</li>  </ul>  <p>  \t  I've used this technique countless times. And no matter the type of business, the type of people or even the size; this always works!  </p>  <p>  \t  What you'll learn:  </p>  <ul>  \t<li>Save time and money by improving a process or problem</li>  \t<li>Make sure you spend your time on improving the right things</li>  \t<li>Make sure the improvements you make stick</li>  \t<li>Get some actual and measurable results of your efforts</li>  </ul>  <p>  \t  The course consists of 14 videos for you to watch and lots of additional resources like handy links and templates. You’ll walk out of the class with hands-on results!<br>  </p>  <p>  \t  Simply click the 'take this course' button on the top right right now.  </p>  <p>  \t  Because, the more you delay, the more it is costing you...<br>  </p>  <p>  \t  Linda Coussement<br>  </p>  <p>  \t  p.s. make sure to enroll right now as I will increase the price to $79 on June 1, 2015!  </p>", 
    "end_date": null, 
    "title": "Lean Secrets: 6 Simple Steps That Cut Business Costs", 
    "price": "50.00", 
    "instructors": "Linda Coussement", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206554_a794_9.jpg", 
    "course_url": "https://www.udemy.com/improving-your-business-the-lean-way/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-28T14:59:11Z"
}