{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">I have generated 20 coupons codes for a limited time, so students can enroll for over 50% off. Please contact me directly for the promotion.</p><p style=\"\">***Limited time low price... I want to offer this course at a discount to my early enrolled students. I have hours more content to add and will raise the price as more lectures are generated. Enroll now and get current content and future content at this Low Fee.***</p><p style=\"\">Lean philosophy teaches businesses how to eliminate wasteful practices while creating more valuable product for their customers.</p><p style=\"\">Lean Manufacturing: Simplified will take students into the origins of Lean, and show how powerful Lean initiatives can be in a production environment.</p><p style=\"\">With the demand for low cost production rising, Manufacturing companies have looked to Lean specialists to help regain profitability &amp; efficiency. </p><p style=\"\">This course will equip the students with the knowledge to Identify when and where a Lean strategy would be most effective. As well as give the student real world understanding of the Lean Manufacturing tools &amp; principles, through real world case studies.</p><p style=\"\">Who is this course for?</p><ul style=\"\"><li style=\"\">Management professionals looking to get a better idea of how Lean Manufacturing can impact their workplace.</li><li style=\"\">Production managers looking to sharpen their skills and being to eliminate waste right in their own place of work.</li><li style=\"\">Process Improvement Engineers looking to refresh their memory of the most effective Lean Manufacturing strategies.</li><li style=\"\">College students currently studying lean manufacturing, looking for a quick resource/study guide </li></ul>", 
    "end_date": null, 
    "title": "Lean Manufacturing Simplified - The Root of Lean Enterprise", 
    "price": "35.00", 
    "instructors": "Faraad Haashim", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543976_598c_3.jpg", 
    "course_url": "https://www.udemy.com/lean-manufacturing-simplified/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T10:41:25Z"
}