{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Resumo:</strong> o curso apresenta o framework criado pelo professor Frederico Aranha, em resumo, para a <strong>construção de novos negócios</strong>. Ele aplica diversas metodologias e padrões em uma combinação que permite uniformização do <strong>processo gerencial de startups</strong> - da criação à operacionalização. Este é um curso do professor Frederico Aranha distribuído pelo <strong>Site Campus</strong> - <em>a sua escola de gestão na internet</em>.</p><p><strong>Startups &amp; O Mercado</strong></p><p>  \t          O mercado está agitado: todos tem um <strong>novo negócio</strong>. Provavelmente, você já encontrou em diversas plataformas cursos sobre como montar uma startup. Mas você sabe qual o problema? Começar nunca foi a parte mais difícil. Começar é fácil, <strong>o difícil mesmo é manter o negócio no ar e lucrativo</strong>. A operação é onde o bicho pega!  </p>  <p>  \t          Este curso foi montado a partir da minha experiência como gestor de <strong>projetos </strong>de <strong>novos negócios</strong>. Além de já ter tido minha <strong>startup</strong>, hoje trabalho exclusivamente com <strong>novos negócios</strong> dentro da organização onde atuo. Esta experiência me ajudou a ter uma visão clara dos desafios e da forma como devemos gerir <strong>startups </strong>e <strong>spin-offs</strong>.  </p>  <p>  \t          Ninguém tem muita coragem de juntar as pontas, de combinar práticas e apresentar tudo em um único curso. O que eu fiz neste material foi reunir as melhores práticas de <strong>gestão de projetos</strong>, <strong>serviços</strong>, <strong>desenvolvimento de software</strong> e <strong>validação de ideias</strong> e apresentá-las de forma ordenada. Além disso, falo sobre <strong>marketing </strong>e outras atividades fundamentais para você iniciar seu negócio e, principalmente, dar sequência ao mesmo.  </p>  <p>  \t          Este é o curso de <strong>gerenciamento de projetos</strong> e operações de <strong>startups</strong>. Você não vai terminar o curso dominando todas as técnicas que apresento aqui, mas com certeza vai concluir o curso com a sensação de que encontrou o caminho para fazer seu sonho acontecer e acontecer por muito tempo.  </p>  <p>  \t        Comece a estudar hoje mesmo. A partir deste curso, você encontrará os direcionamentos que precisa para estruturar sua carreira como <strong>empreendedor </strong>e como <strong>gestor de projetos</strong>. Confira os principais tópicos:  </p>  <ul>  \t<li>Lean para <strong>startups</strong>;</li>  \t<li><strong>Marketing </strong>digital;</li>  \t<li><strong>Gestão de projetos</strong> com base no <strong>PMBoK® </strong>do <strong>PMI®</strong>;</li>  \t<li><strong>Gestão de serviços</strong> com base na <strong>ITIL</strong>;</li>  \t<li>Serviços de suporte;</li>  \t<li>Modelo de negócios;</li>  \t<li>Análises de viabilidade financeira; e</li>  \t<li>Mais!</li>  </ul><p><strong>E não se esqueça:</strong> <em>você pode fazer este curso por meio da plataforma do <strong>Site Campus</strong>, distribuidora oficial dos cursos do professor Frederico Aranha. <strong>Site Campus</strong> - a sua escola de gestão na internet.</em></p>", 
    "end_date": null, 
    "title": "LEAP: Gerenciamento de Startups", 
    "price": 0, 
    "instructors": "Guilherme Calabria Etcheverry, Site Campus, Frederico de Azevedo Aranha", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378024_8a2f_2.jpg", 
    "course_url": "https://www.udemy.com/gestao-operacional-para-startups/", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-26T14:48:14Z"
}