{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This video course is your starting point to learn the field of Manufacturing and Supply Chain.  An ingredient for an effective and efficient supply chain is gaining the knowledge and skills to take you and your organization to the next level.  With this course you can strengthen your overall performance and optimize your organization's return on investment.  </p><p>Whether you are a student wanting to learn a new field, already a Supply Chain professional needing to refresh your skills or any business professional seeking to supplement your body of knowledge, this introductory video training course is exactly what you are looking for.  Unlike other courses that teach you the high level textbook theory, I will start with the basics and teach you through examples and exercises, principles which you can apply and start using immediately. </p><p>Achieving excellence in managing a supply chain is essential for businesses to be successful.  The challenge with globalization is that time and distance are added to supply chains which translates to more cost, complexity and risk.  This as well becomes an opportunity.  Successfully navigating the complexities and risks provides a competitive advantage and sets you and your organization well above the rest for continued growth and success.  </p><p>Your journey towards becoming a Supply Chain Expert starts here.  </p><p>Enrol now!  </p><p>Every minute you delay may actually be COSTING you or your business money...  </p>", 
    "end_date": null, 
    "title": "Learn the Skills to be a Supply Chain Expert", 
    "price": "25.00", 
    "instructors": "John Mandic", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/677348_01bb_2.jpg", 
    "course_url": "https://www.udemy.com/save-1000s-each-month-thinking-like-a-supply-chain-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-22T15:57:44Z"
}