{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Health and Safety at work is an arduous task for many managers and business owners. Health and Safety is not just a question of complying with the legislation, but it should be seen as an important feature of every business operation targeted at reducing the losses associated with accidents, ill health, sickness absence, etc. Increasingly, as most companies move towards a quality-orientated approach to their business activities, it will be seen that health and safety is an integral feature of such an approach. Accidents, ill health, sickness absence and damage-producing incidents feature in the ‘price of non-conformance’ – an important measure in quality management. There is no doubt that accidents and sickness represent substantial losses to any company.</p>\n\n<p>There is a need, therefore, for supervisors, managers, and business owners to be more knowledgeable about the field of health and safety from a practical viewpoint. This course has been developed with this objective in mind. Practical methods of designing, building, operating, and maintaining the appropriate health and safety systems are outlined in the course. I hope it will help managers to understand the subject better and make a contribution to improved levels of health and safety performance. </p>\n\n<p>\n  Learn how to design, build, operate, and maintain the appropriate Workplace Health and Safety Management System and improve considerably the effectiveness, efficiency, and flexibility of your organization.</p><p>A FREE 89-page Health and Safety Manual and Kit is included in the course.</p>", 
    "end_date": null, 
    "title": "Managing Health and Safety at Work", 
    "price": "20.00", 
    "instructors": "Operational Excellence Training", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/855982_eb48_2.jpg", 
    "course_url": "https://www.udemy.com/managing-health-and-safety-at-work/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-21T17:39:15Z"
}