{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In basic terms, <strong>market segmentation</strong> is dividing a large, general market into smaller, specific segments with different needs.<br></p>  <p>  \tWith the course Market Segmentation PRO by Scandinavian Institute of Business Analytics, <strong>you will become an expert</strong> market researcher. More precisely, you will learn every aspect of market segmentation at a professional level.  </p>  <p>  \tIn the course, you, together with restaurant owner, Olle, will conduct a survey and market segmentation of customers with the goal of finding a target audience for the restaurant. Then, with Olle and Tove, a gourmet coffee expert, you will learn how to design a new product (a coffee machine), select attributes, and find niche markets for your product. You will analyze market data using <strong>IBM SPSS</strong> and <strong>Microsoft Excel</strong>, learn advantages and disadvantages of the market segmentation technologies, and learn how to interpret the analysis results.  </p>  <p>  \t              You will learn:  </p>  <ul>  \t<li>    5 advantages of market segmentation</li>  \t<li>    A number of segmentation variables that you can use  </li>  \t<li>    Descriptive and predictive market segmentation techniques</li>  \t<li>    4 major market segmentation techniques: cross-tabulation, regression, clustering, and conjoint-analysis</li>  \t<li>    Examples with IBM SPSS and Microsoft Excel.</li>  </ul>  <p>  \tYou do not have to be good at math to complete the course! The course is as intense as it can be and as clear as possible. In 45 minutes, professional instructors will teach you how to conduct market segmentation with real-world customer data. The course material is condensed, filtered, and carefully crafted into 34 video lectures.  </p>  <p>  \tThe course includes an exam. Successful students will receive a <strong>personalized SCANBA Certificate</strong> that will open new career opportunities and confirm your level of professional expertise.  </p>  <p>  \t              Why wait? Take the course today!  </p>", 
    "end_date": null, 
    "title": "Market Segmentation PRO", 
    "price": "50.00", 
    "instructors": "Scandinavian Institute  of Business Analytics", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/207748_001a_4.jpg", 
    "course_url": "https://www.udemy.com/market-segmentation/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-30T06:21:38Z"
}