{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Want to know how you can save <strong>up to 90%</strong> on your project, <em>while completing it sooner?</em></p>\n\n<p>Want to learn how, <em>with access only to a computer</em>, you can get virtually <strong>any</strong> part of your business built?</p>\n\n<p>Learn how to outsource and you'll learn how to make <strong>magic</strong> with your project to-do list. You'll be able to <em>hit goals sooner</em> and spend only a <em>fraction</em> of what you would have otherwise needed. Save your project by going lean and shifting your attention and resources to other crucial areas.</p>\n\n<p>Outsourcing has endless possibilities - you just need to know how to use it.</p>\n\n<p><em>Website development, mobile app development, logo design, market research, customer feedback, email marketing, sales, promotion, scheduling, editing, proofreading, ghostwriting, interviewing, application testing, bookkeeping, employee vetting, so much more </em>- these are just <strong>SOME</strong> of the things you can outsource <em><strong>today</strong></em>!</p>\n\n<p>People that are skilled at outsourcing can be <em>10x as efficient</em> as those who are not. </p>\n\n<p>Virtually every company and startup outsources in some way. Being able to outsource is a HUGE opportunity for you and your project - take advantage of it!</p>\n\n<p><strong>------------------------------------------------------------------------------------------------------------</strong></p>\n\n<p><strong>Why you should take this course:</strong></p>\n\n<p>Knowing how to outsource effectively is an incredibly useful skill whether you're an entrepreneur, a manager, a marketer, or small business owner. Being able to incorporate outsourcing into your project, your business, or even your job can dramatically change your rate of success.</p>\n\n<p>Cost is often the single largest factor in whether or not a project succeeds or fails. By mastering outsourcing you can virtually guarantee that you get the lowest and most reasonable price every time you launch or engage in a project.</p>\n\n<p>Learn a critical business skill and learn how outsourcing can change your day to day life.</p>\n\n<p><strong>-------------------------------------------------------------------------------------------------------------</strong></p>\n\n<p><strong>About the instructor:</strong></p>\n\n<p>Top rated Udemy Instructor with over 300+ 5 star reviews and 11,000+ students</p>\n\n<p>All courses by the instructor have 100% positive reviews with an average of 4.95 stars.</p>\n\n<p>Startup founder for 5 years, raised 3 rounds of capital worth several millions of dollars.</p>\n\n<p>Worked as a VC and was in charge of deal flow in Silicon Valley. Oversaw investments in large companies like Facebook, LinkedIn, &amp; Tesla.</p>\n\n<p>Currently owns and runs Sprintkick, a web agency, that builds web and mobile apps for 20+ Fortune 500 companies. Created and launched over 100+ apps in the last 4 years.</p>", 
    "end_date": null, 
    "title": "Master Outsourcing | Get the best price & save time", 
    "price": "20.00", 
    "instructors": "Evan Kimbrell", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538664_011a_3.jpg", 
    "course_url": "https://www.udemy.com/master-outsourcing-get-the-best-price-save-time/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-27T15:16:56Z"
}