{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "The reality is that too often organizations are pressured to introduce cost reduction initiatives, manage complex information flows, reduce or eliminate the magnitude of any activity that doesn’t add value to the business. For such organizations Lean is the right tool to obviate issues related to increased costs, reduced productivity, increased burden on machines and people, and workload imbalance.\n\nThis is a brand new course offering for professionals in all sectors of the industry who would like to have a better understanding about Lean or take a refresher course prior to implementing a Lean program or contributing to it. It is appropriate for audiences at all levels in an organization.\n\nLean Six Sigma is very popular Business Process Improvement methodology. The trend in hiring Lean professionals is increasing, indicating that more and more companies in all sectors (Manufacturing, Service, Oil &amp; Gas, Healthcare, Banks and Software) have started bringing on board people with background in Lean to support their change program. This course emphasizes on the importance of Lean concepts, tools necessary to be successful and is delivered using a presentation, study material and quizzes. The course is not intended to teach how to downsize the organization or reduce costs that negatively impact human development.  Lean is not having fewer people or less space or attaining efficiency at any cost. \n\nThe course is structured in a logical way and covers a detailed definition of Lean, its role in transformation, visualizing work as a process; Lean wastes and opportunities with examples and exercises, core lean principles, key Lean concepts and  Lean execution tools. The duration of this course is approximately 3 to 4 hours. The course is self-paced e-learning course with email and coaching support available on all week days to answer specific questions related to the course contents. ", 
    "end_date": null, 
    "title": "MLH 001: Make Lean Happen: Know All About Lean", 
    "price": "50.00", 
    "instructors": "Hemant Gham", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841058_93d6_4.jpg", 
    "course_url": "https://www.udemy.com/make-lean-happen-mlh001-know-all-about-lean/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-06T06:04:59Z"
}