{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>A Faculty Project Course - Best Professors Teaching the World</p>  <p>This course provides a general introduction to operations management. This course aims to (1) familiarize you with the major operational problems and issues that confront managers, and (2) provide you with language, concepts, insights and tools to deal with these issues in order to gain competitive advantage through operations.</p>  <p>This course should be of particular interest to people aspiring a career in designing and managing business processes, either directly (V.P. of Ops, COO) or indirectly (e.g. management consulting). The course should also be of interest to people who manage interfaces between operations and other business functions such as finance, marketing, managerial accounting and human resources. Finally, a working knowledge of operations, which typically employs the greatest number of employees and requires the largest investment in assets, is indispensable for general managers and entrepreneurs.</p>  <p>We will see how different business strategies require different business processes, and vice versa, how different operational capabilities allow and support different strategies to gain competitive advantage. A process view of operations will be used to analyze different key operational dimensions such as capacity management, flow time management, supply chain management, and quality management. We will also discuss developments such as lean operations, just-in-time operations, and time-based competition.</p>  <p></p>  <p><strong>Class is now in session! Enroll now and join in on a discussion with Prof. Allon.</strong></p>", 
    "end_date": null, 
    "title": "Operations Management", 
    "price": 0, 
    "instructors": "Professor  Gad Allon", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/13034_33f5_6.jpg", 
    "course_url": "https://www.udemy.com/operations-management/", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-01-25T00:45:09Z"
}