{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The <strong>Operations and Supply Chain Management</strong> is part of the larger series of short courses on Operations Management. The first one was Product and Service Management, but this is a modular series, so that you can easily learn various aspect of Operations Management.</p><p>The supply chain is a network of operations running across an organization, which are needed to design, make, deliver, and service products or services for customers. Production, inventory, location, transportation, and information are performance drivers that can be managed to produce the capabilities for a given supply chain.</p><p>As a part of their overall strategy, organizations also employ many supply chain strategies to survive and compete in a dynamic and competitive marketplace. However, it is also essential from an organization's point of view to use effective performance measures to ensure continuous improvement of the supply chain and also to set directions of its current supply chain strategies.</p><p>After completing this course, <strong>you will be able to:</strong></p><ul><li>sequence the components of the supply chain,</li><li>identify the key drivers of supply chain management,</li><li>identify the characteristics of supply chain management in service organizations,</li><li>match supply chain strategies of service organizations with their key characteristics,</li><li>identify criteria for selecting and combining different supply chain strategies, and</li><li>match supply chain areas with key indicators of their performance.</li></ul><p>You will have not much more than 2 hours of video lessons, written documents, quizzes, examples and exercises, and a small course project.</p><p>This course provides a basic understanding of supply chain management in manufacturing and service organizations. Key characteristics of common supply chain strategies and criteria for their selection are also presented. This course also introduces key performance metrics for supply chain management.</p><p>Anyone working in operations management or another functional area, who is looking to gain a working understanding of the operations functions in a service or manufacturing organization will benefit from this course.</p><p>You have 30 days money back guarantee! No questions asked. Now, go ahead, and press that \"Take the Course\" button! Or, take the free preview and decide later!</p>", 
    "end_date": null, 
    "title": "Operations and Supply Chain Management", 
    "price": "40.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564552_d365_3.jpg", 
    "course_url": "https://www.udemy.com/operations-and-supply-chain-management/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-25T17:42:41Z"
}