{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Small business operations are often developed informally and by trial and error. Operations management can make or break a business. As your business grows there will be a need to ensure the effectiveness and efficiency of its operations. Operations management techniques, which have their origins in large organisations, can be applied with great results in small businesses. This course is a practical guide to how these proven techniques can be used in small businesses.</p><p>This course will take you on a journey through:</p><ol><li>Learning the key concepts of operations management </li><li>Exploring how operations management can deliver your business strategy</li><li>Learning how to design products, services, operations and processes</li><li>Exploring how operations can be planned and delivered </li><li>Learning how operations can always be improved</li></ol>The course is aimed at owners and managers of small businesses. It is also suitable for business studies students, at any level, who are keen to run or work in a small business. You do not need any prior theoretical knowledge to take this course. You will need to have a passion for running a successful business, whether now or in the future. Practical experience of small business management or a general overview of the way a particular small business works will help you to relate these techniques directly to real situations. The course comprises 40 lectures in the form of video presentations and includes:<ul><li>4 quizzes to confirm your understanding of the course sections</li><li>Mini case studies of the applications of these techniques in a range of small business sectors</li><li>Suggestions for activities for you to apply specific techniques to your own business or a business you are familiar with</li><li>Discussions where we can share experiences of applying these techniques </li></ul>We will be learning a myriad of techniques including: fitting operations to strategy, optimising flexibility and cost, designing layouts, maximising yield, supply chain management, lean approaches, project planning and control, risk management and quality improvement.", 
    "end_date": null, 
    "title": "Operations Management in small businesses: key techniques", 
    "price": "20.00", 
    "instructors": "Chris West", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/574452_98cf_3.jpg", 
    "course_url": "https://www.udemy.com/operations-management-in-small-businesses-key-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-05T09:34:19Z"
}