{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The course  <strong>Operations Management: Supply Chains, Products and Services</strong> is constructed, based on student feedback, from two already successful courses: Operations and Supply Chain Management and Product and Service Management.</p><p><strong>Operations and Supply Chain Management</strong><br></p><p>The supply chain is a network of operations running across an organization, which are needed to design, make, deliver, and service products or services for customers. Production, inventory, location, transportation, and information are performance drivers that can be managed to produce the capabilities for a given supply chain.</p><p>As a part of their overall strategy, organizations also employ many supply chain strategies to survive and compete in a dynamic and competitive marketplace. However, it is also essential from an organization's point of view to use effective performance measures to ensure continuous improvement of the supply chain and also to set directions of its current supply chain strategies.</p><p>After completing this course, you will be able to:</p><ul><li>sequence the components of the supply chain,</li><li>identify the key drivers of supply chain management,</li><li>identify the characteristics of supply chain management in service organizations,</li><li>match supply chain strategies of service organizations with their key characteristics,</li><li>identify criteria for selecting and combining different supply chain strategies, and</li><li>match supply chain areas with key indicators of their performance.</li></ul><p>You will have not much more than 2 hours of video lessons, written documents, quizzes, examples and exercises, and a small course project.</p><p>This course provides a basic understanding of supply chain management in manufacturing and service organizations. Key characteristics of common supply chain strategies and criteria for their selection are also presented. This course also introduces key performance metrics for supply chain management.</p><p><strong>Product and Service Management</strong><br></p><p>Product and service management is the process of designing, creating, and maintaining a product or service through all stages of its lifecycle. It involves a wide range of operations, marketing, and sales related activities.</p><p>These activities encompass the entire range of product life cycle – from the conception of a new product or service idea, to its design and launch, and later through its growth, maturity, and decline stages. </p><p>After completing this course, you will be able to:</p><ul><li>match phases of the product life cycle to actions that should be taken at each phase,</li><li>sequence the stages of the new product development process,</li><li>match current best practices in new product development with their description, and</li><li>and match strategies used to manage existing and mature products and services with examples of the ways they are used.</li></ul><p>Operations aspects of product management are vital to the success of new and existing products and services. Every organization conducts product management activities, whether knowingly or unknowingly, that integrate operations, marketing, and sales functions to deliver desired products and services to customers.</p><p>This course provides a broad overview of the product and service management functions from an operations management perspective. More specifically, it walks you through the phases of product life-cycle and stages of new product development. This course also introduces some examples of strategies for managing existing and mature products and services.</p><p>The target of this course is anyone working in operations management or another functional area, who is looking to gain a working understanding of the operations functions in a service or manufacturing organization.</p><p>You will have 4 hours of video lessons, and written documents, quizzes, examples and exercises, but also a small course project. </p><p>Now, go ahead, and register. Or, if you want, try a few minutes of course preview and decide after. See you inside the course!</p>", 
    "end_date": null, 
    "title": "Operations Management: Supply Chains, Products and Services", 
    "price": "45.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/621364_c32c_3.jpg", 
    "course_url": "https://www.udemy.com/operations-management-supply-chains-products-and-services/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-24T14:05:30Z"
}