{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t This is a course which includes <strong>7 baby step by baby step lessons </strong>in which you will learn exactly how to outsource your business.  </p>  <p>  \t The class is <strong>most suited</strong> for total beginners who are new to outsourcing.  </p>  <p>  \t Your class project will be to outsource simple tasks that you need to do in your business or your whole business.  </p>  <p>  \t Because I am fully aware that one of the biggest problems that beginners encounter when they try to make money online is \"Information Overload\" I have kept each video only a few minutes long, so you will not be overwhelmed by information.  </p>  <p>  \t In this training you will discover exactly how to:  </p>  <p>  \t 1. How To Find Full Time Workers.  </p>  <p>  \t 2. How To Find Freelancers.  </p>  <p>  \t 3. How To Go Through Resumes.  </p>  <p>  \t 4. How To Communicate With Your Workers.  </p><p>*** Notice ***</p><p>In order to complete the course you will need to have money to invest in outsourcing. </p><p>In the training, I will show you how to hire people from a freelancer website.</p><p>How much money you will need to invest in hiring workers from there will depend on who you hire.</p><p>If you prefer not to outsource from the freelancer website, I will also show you a membership site in which you can find great employees. </p><p>Again, how much you pay for hiring the employees will depends on who you hire, but I can tell you that the cost of membership to this membership site will be $99 per month.</p>", 
    "end_date": null, 
    "title": "Outsourcing Your Business For Productivity", 
    "price": "50.00", 
    "instructors": "Amir Rimer", 
    "commitment": "28 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107068_93c0_5.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-guide-to-outsourcing/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-17T10:17:25Z"
}