{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<span>COURSE DESCRIPTION:</span>  </p>  <p>  \tLearning this technique, you will not have contracts to be respected and you will be free to manage your life.  </p>  <p>  \tThis is basic course that teaches every detail TECHNIQUE OF LIFTING and repair dent HAIL, a Knock from parking caused by a ball, from another machine or an accident.  </p>  <p>  \tYou&#039;ll wonder, WHEN I learn? When you have a theoretical understanding of how to do!  </p>  <p>  \tAt beginning of the course you do not learn to lift and repair dents, but you will practice to be more confident with the dexterity and the glance.  </p>  <p>  \tWarning: this teaching is for seeking repair of paintless dent removal Hail flawless, without shadows, you will understand seeing the video, because it goes a dent worked 360 Degrees, the dent is 360 degrees, so it&#039;s not good work dent just standing still in one spot and look at it from a perspective but you have to watch it to 360 degrees.  </p>  <p>  \tAFFIRM THIS CONCEPT IS NOT A CASE, I try to do to you UNDERSTAND WHAT GO EARLY MEETING.  </p>  <p>  \tDo not take this course if you&#039;re not tough, because it is easier to repair a &#039;dent in some way that 100%. Do not do it.  </p>  <p>  \tThis is a technique ITALIAN AND EUROPEAN, is DIFFERENT from other techniques NOT RIPARARNO The DENT TO 360 DEGREES.  </p>  <p>  \tBY THE END OF THIS course you will:  </p>  <p>  \tThe mastery of knowing how to raise, raise a &#039;dent.  </p>  <p>  \tThe conceptual understanding of how to use the technique.  </p>  <p>  \tThe mastery of how to see where you are with your tool.  </p>  <p>  \tMastery of move with the tool of millimeters.  </p>", 
    "end_date": null, 
    "title": "Paintless Dent Repair: art of repair hail & parking dent", 
    "price": "50.00", 
    "instructors": "Marco Manzoni", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415028_e015_3.jpg", 
    "course_url": "https://www.udemy.com/course-how-to-paintless-dent-repair/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T14:08:41Z"
}