{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tThe objective of the Six Sigma for Paralegals program is to improve paralegal efficiency. The belt colors in Six Sigma correlate to the belt colors in martial arts in order to signify the mastery of a particular process or function.  This course is the foundation for all of the Six Sigma for Paralegals programs and provides a  concise and user friendly format to understand technology and its usage in a law office.  </p>\n\n<p>  \t<strong>How Can the Program Assist in Your Career?</strong>  </p>\n\n<p>  \t  Registration includes access to a combination of video lectures, documents, presentations, and resources to assist with reinforcing the concepts taught throughout the training. </p><p> When an employer is making a hiring or promotion decision there are a variety of factors that are taken into consideration in order to determine a prospective candidate's ability to meet the requirements of the job. Since no employer has a crystal ball there is no real way to determine how an individual will perform over the long term within a specific organization or job. In order to minimize the risk associated with hiring and promotion decisions human resource professionals and hiring managers use a variety of different methods. Even with these methods there is still the potential for a mismatch between the candidate and their job expectations.  </p>", 
    "end_date": null, 
    "title": "Paralegal Yellow Belt:  Legal Technology", 
    "price": "50.00", 
    "instructors": "Rainmakers College", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/204226_d718_3.jpg", 
    "course_url": "https://www.udemy.com/paralegal-yellow-belt/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-24T00:45:22Z"
}