{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Organizations both in Manufacturing and Services Sectors compete on Quality, Delivery and Price. In order to exceed on these 3 parameters, organizations constantly strive to use various management methods.</p>\n\n<p>Statistical Process Control(SPC) or Statistical Quality Control is a method, rather a strategy to systematically reduce variability in process with respect to quality problems, delayed delivery, etc. SPC is based on sound science and data monitoring rather that witch hunting people.</p>\n\n<p>Leading organizations across sectors use SPC methods in their operations viz., Customer Service Delivery, Manufacturing, Supply Chain, Quality Control, etc.,</p>\n\n<p>If you are from <strong>Operations in Discrete Manufacturing, O&amp;G, BFSI, Supply Chain, IT Services</strong> knowledge about SPC can be invaluable.</p>\n\n<p>If your organization or process isn’t using SPC, you can apply these concepts to significantly improve Quality, Delivery and Control. </p>\n\n<p>SPC is a vast subject. This course gives you a firsthand experience of the concept and teaches you to construct and interpret more than 5 simple Control Charts that cover most scenarios across sectors.</p>\n\n<p>There is more than 1 reason to consider this course:</p>\n\n\n\n<ol><li>Receive SPC Basics      Certification on successful completion of project work (details included)\n\n</li><li>Step-by-Step instructions to      construct control charts using Minitab is covered in detail\n\n</li><li>Examples for various industries      including Manufacturing and Services included\n\n</li></ol>\n\n<p>By the end of the course, you will be able to apply the SPC to any specific situation of your process or business and effectively reduce variation, thereby improving quality &amp; delivery performance:</p>", 
    "end_date": null, 
    "title": "Practical Guide to Statistical Process Control", 
    "price": "35.00", 
    "instructors": "Nilakantasrinivasan Janakiraman", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319958_4bea.jpg", 
    "course_url": "https://www.udemy.com/practical-guide-to-statistical-process-control-spc/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-15T06:04:14Z"
}