{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>While <em>quality</em> isn't a new business concept, quality goods and services do continue to play a key role in generating the reputation that can give your organization its competitive edge. Consistently offering high quality leads to loyal customers, who can reward your company with positive recommendations that lead to new customers. The Total Quality Management (TQM) approach changed the way businesses look at everything from customers, to human resources, to manufacturing and service processes. Now it's widely recognized that, in order to keep up with the ever-changing conditions and direction of an organization, all business activities need to incorporate quality principles that function effectively as a system. </p><p>This course will teach you the basic principles and applications of quality management and a performance excellence approach to business activities. By examining current methods for organizational performance management, you'll learn the most sustainable ways to deliver increased value to both customers and stakeholders. You'll also discover how to improve personal and organizational learning, and how to increase the overall aptitudes and effectiveness of your business.</p><p>Based on practical, real-world expertise, this course is suited to a broad audience that includes both business owners and managers looking to improve procedures, and design quality management projects with a company-wide focus. You'll learn how to develop and implement strategies for excellence that focus on customers' needs. You'll also learn how well-planned performance systems make the most of both people and procedures to sustain excellence, manage the information that leads to good decision-making, and accomplish business goals.</p><p><strong>Content and Overview:</strong></p><p>This course contains 55 lectures and 7+ hours of content organized in 10 areas. It's designed for students and future business leaders, as well as for those professionals already in the workforce, regardless of their experience level.</p><p>The content areas include:</p><ul><li>The Quality System Overview</li><li>Quality in Organizations</li><li>Total Quality Philosophies and Frameworks</li><li>Leadership and Strategic Planning</li><li>Customer Focus</li><li>High Performance Workforce Management</li><li>Process Management</li><li>Performance Measurement and Information Management</li><li>Building and Sustaining Performance Excellence</li><li>Six Sigma and Process Improvement</li></ul><p>By the end of this course, you'll have a valuable skill set that that will allow you to apply all the principles of quality management and performance excellence to your business. You'll understand the concept of improving procedural efficiencies and outcomes, and you'll know how to create, implement, and maintain a culture of excellence in the workplace that will enable your business to meet goals and change with the times. </p>", 
    "end_date": null, 
    "title": "Quality Management Systems:Management and Control of Quality", 
    "price": "20.00", 
    "instructors": "Operational Excellence Training", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/521780_662f_3.jpg", 
    "course_url": "https://www.udemy.com/quality-management-systemsmanagement-and-control-of-quality/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-06T05:37:05Z"
}