{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t     The course is an application of the RACI model. This course is designed for individuals that have either never used the RACI model or have limited knowledge of the RACI model. However, you will be an RACI model expert by the end of the course. The class will walk you through the process of learning the RACI model, walking through several examples and creating your very first RACI model. You will be able to set yourself apart from your peers with this Six Sigma tool.  </p>  <p style=\"\">  \tThe benefits of implementing the RACI model for Managers and Leaders  </p>  <p style=\"\">  \tThe RACI chart will allow everyone in the organization to use a common tool. The RACI model will help managers and leaders to provide clarity on expectations, ownership and clearly define the key stakeholders.  </p>  <p style=\"\">  \tThe RACI model will clearly define the expectations of each employee involved in the process, task or decision step.  </p>  <p style=\"\">  \tThe RACI model will define the responsibility of each person that is involved in the process, task or decision step. The decision makers are clearly defined to assist everyone in the organization with the authority or decision maker.  </p>  <p style=\"\">  \tThe RACI model will define the key stakeholders or groups involved in the person, task or decision step.  </p>  <p style=\"\">  \tPersonal Experience with the RACI Model  </p>  <p style=\"\">  \tI used the RACI model to reintroduce responsibility within an organization. The RACI model allows the key stakeholders to be defined and transparent throughout the organization. The RACI model was a very easy to implement program with a detailed role out plan for the leadership team. Further, the RACI model was easy to understand at the team member level, because everyone understands the key terms of the RACI model.  </p>", 
    "end_date": null, 
    "title": "RACI Model - A Responsibility Matrix Tool", 
    "price": "20.00", 
    "instructors": "Michael Farris", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/191360_9ea7_2.jpg", 
    "course_url": "https://www.udemy.com/raci-model-a-responsibility-matrix-tool/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-30T20:16:11Z"
}