{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em></em>Traditionally, businesses have concentrated on improving the forward supply chain for their products (e.g., manufacturer-wholesaler-retailer). However, as the business environment becomes more competitive, it becomes increasingly important for them to concentrate on optimizing the backward loop, as well. Reverse logistics practices have been in existence for a long time, especially in the automotive industry, where manufacturers try to recover value from recycling car parts.</p><p>The goal of sustainable development is to “meet the needs of the present without compromising the ability of future generations to meet their own needs.” As key forces in society, organizations of all kinds have an important role to play in achieving this goal.</p><p>The urgency and magnitude of the risks and threats to our collective sustainability, alongside increasing choice and opportunities, will make transparency about economic, environmental, and social impacts a fundamental component in effective stakeholder relations, investment decisions, and other market relations. Transparency about the sustainability of organizational activities is of interest to a diverse range of stakeholders, including business, labour, non-governmental organizations, investors, accountancy, and others.<br></p><p><strong>Content and Overview:</strong><br></p><p>This course contains 23 lectures, 3 hours of content organized in 2 areas, and quizzes containing 20 questions. It's geared both for people who know nothing about reverse logistics and sustainability as well as more seasoned professionals who are anxious to hone their approach to these concepts.<br></p><p>The content areas include:<br></p><ul><li><strong>Reverse Logistics Management</strong></li><li><em>Reverse Logistics Framework<br></em></li><li><em>Reverse Supply Chains</em></li><li><em>Returns Management and Recycling</em></li><li><em>Closed-Loop Supply Chains</em></li><li><strong>Sustainability </strong><strong>Practices</strong></li><li><em>Sustainability Definition and Scope</em></li><li><em>Building a Sustainability Development System</em></li><li><em>Sustainability and the Balanced Scorecard</em></li><li><em>Sustainability Reporting and the UN Global Compact</em></li></ul><p>By completing this course, you'll be armed with the valuable and practical skills you need to fully implement and manage Reverse Logistics and Closed Loop Supply Chains, manage the returns process decisions with respect to repair, refurbishment, disposition, and secondary market more efficiently, act in a socially and environmentally responsible manner, and produce real value for the company, environment, and society. The course will provide you with the information and analysis you need to remain both current and competitive; the state-of-the-art knowledge and practices you need to shape your organization to meet the call of sustainability, manage your company in an efficient, holistic way that takes into account important sustainability trends shaping our world of tomorrow.  </p>", 
    "end_date": null, 
    "title": "Reverse Logistics Management and Sustainability", 
    "price": "20.00", 
    "instructors": "Operational Excellence Training", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658594_9c45_2.jpg", 
    "course_url": "https://www.udemy.com/reverse-logistics-management-and-sustainability/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T05:29:56Z"
}