{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Is a glorious failure is better than a petty success? I’m all for the petty success. A glorious failure leads to nothing; a petty success may lead to a success that is not petty - Arnold Bennett.</em></p>\n\n<p>Every action or in-action in Business involves a potential risk. As a manager of a process, an entrepreneur or a sales manager, you can scoop up success and avoid failures with your tact and vigil. But that will consume you energy and time, leaving you exhausted.</p>\n\n\n\n\n\n<p>Instead a systematic approach to identifying and managing potential issues in your business processes can mean better &amp; consistent business results and ‘peace of mind’.  </p>\n\n\n\n\n\n<p>The aim of this course is to allow you to understand the foundation skills in Risk Management beyond today's hype and buzzwords—and describes how an entrepreneur, business manager can turn their firefighting efforts into proactive actionable insights. A novice to risk management will equally benefit through this course.</p>\n\n\n\n\n\n<p>Unlike many foundation course, this course quickly deep dives to a Risk Management Tool used by NASA called Failure Modes &amp; Effects Analysis (FMEA) and shows how best to apply it to specific business problems and opportunities within their organization. </p>\n\n\n\n\n\n<p>There is more than 1 reason to consider this course:</p>\n\n<ol><li>Receive FMEA Certification on successful completion of project work (details included)</li><li>Free FMEA Template and Step-by-Step instructions covered in detail</li><li>Examples for various industries including Manufacturing and Services included</li></ol>\n\n<p>By the end of the course, you will be able to apply the FMEA to any specific situation of your process or business and effectively eliminate/reduce associates risks by carrying out the following steps:</p>\n\n\n\n\n\n<ul><li>Proactively identify all potential issues across the business </li><li>\n\nAnalyze impact of the each issue, its occurrence &amp; existing control mechanisms </li><li>Prioritize risk that need immediate action</li><li>Systematically plan response/mitigation plan</li><li>Implement and reassess</li><li>Monitoring and control risks ongoing basis</li></ul>", 
    "end_date": null, 
    "title": "Risk Management using Failure Modes Effects Analysis", 
    "price": "35.00", 
    "instructors": "Nilakantasrinivasan Janakiraman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314352_bc06_2.jpg", 
    "course_url": "https://www.udemy.com/risk-management-failure-modes-effects-analysis-fmea/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-06T15:28:25Z"
}