{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\">***Course Price Reduced for Grand Launch!!!! <span style=\" text-decoration:line-through;\"></span></strong> <strong style=\"\">$69 </strong><span style=\" text-decoration:line-through;\"></span><br style=\"\">  </p>  <p>  \t   Lean Training Resources is launching this new Six Sigma Green Belt training course and we have slashed the price for our first 150 students from $99 to <strong style=\"\">$69</strong>!  Sign-up Now!!!  Most economic price for complete Six Sigma Green Belt Training on the web!  </p>  <p>  \t   Not only will you get the course for $69, you will be given access to our private project coaching forum to help you through your first Six Sigma Green Belt Project.  These forums moderated  by certified Six Sigma professionals.  </p>  <p>  \t   In today&rsquo;s economy, organizations are looking for methods to cut cost and improve performance.Many companies are turning to Six Sigma to accomplish this and are in need of capable Six Sigma professionals.Six Sigma is one of the most sought after professional skills in today&rsquo;s market.A simple search of the term &ldquo;six sigma&rdquo; on any career job site will return a wealth of opportunities.Individuals looking to increase their career opportunities, or lead and manage business performance improvement products within their current organization, should take this course.  </p>  <p>  \t<!--?xml:namespace prefix = o ns = \"urn:schemas-microsoft-com:office:office\" /-->  </p>  <p class=\"MsoNormal\">  \t       Six Sigma professionals offer sophisticated problem solving skills to companies looking to increase operational efficiencies and improve overall quality.Professionals from any industry whether manufacturing, service, government, education, finance, or healthcare can benefit from Six Sigma.  </p>  <p class=\"MsoNormal\">  \t       This course will give you all of the knowledge to become a certified Six Sigma Green Belt.The course content covers the entire Six Sigma Green Belt Body of Knowledge as per the<strong style=\"\"> American Society of Quality</strong>.The materials will prepare you to sit for the ASQ exam and successfully pass.  </p>  <p class=\"MsoNormal\">  \t       The key learning objectives of the course are to understand the value of Six Sigma and to utilize and apply the DMAIC (Define, Measure, Improve, Control) framework.The course is has 7 sections and over 40 lectures delivered in various formats to hold your interest and enthusiasm.There are more than 200 practice questions to solidify your Six Sigma knowledge.Business professionals should expect to complete this course (viewing videos, Powerpoint presentations, pdf files, and quizzes) in 12 - 15 hours.  </p>  <p class=\"MsoNormal\">  \t       Course materials include:  </p>  <p class=\"MsoListParagraphCxSpFirst\">  \t       &middot;Video lectures  </p>  <p class=\"MsoListParagraphCxSpMiddle\">  \t       &middot;PowerPoint presentations  </p>  <p class=\"MsoListParagraphCxSpMiddle\">  \t       &middot;Pdf files (to accompany you on test day)  </p>  <p class=\"MsoListParagraphCxSpMiddle\">  \t       &middot;Downloadable examples  </p>  <p class=\"MsoListParagraphCxSpLast\">  \t       &middot;Practice Quizzes  </p>  <p>  \t       The contents of the course will offer the best preparation to sit for the ASQ exam or any other Six Sigma Green Belt exam.This course was designed and created by ASQ certified Black Belts and Green Belts.These professionals have taken and passed the ASQ exam and are practicing Six Sigma professionals.They know and understand the body of knowledge and what is required to successfully administer the Six Sigma problem solving methodology.  </p>  <p class=\"MsoNormal\">  </p>  <p>  \t      For complete training on one of the most sought after professionals skills today, sign-up for this course.  Lean Training Resources offers the most comprehensive, easy to understand, Six Sigma Green Belt training.  </p>  <p>  \t<strong style=\"\">BONUS:</strong>  All Udemy students will receive a <strong style=\"\">$150 discount </strong>on our Action Sigma Learning Coaching program.  This is a 12-week coaching program designed to help you through your first project.  The Six Sigma methodology can be daunting and a bit intimidating.  We have a team of certified Six Sigma professionals to help you successfully complete your first project.  </p>  <p>  \t    Our training modules are staggered 2 &ndash; 4 weeks to allow individuals  to implement what they have learned.  We host live webinars for training  and we also walk you through a project so that you can see the  methodology in action.  You will also be given access to a private forum  where your instructor (a certified Black Belt or Master Black Belt)  will answer questions and offer coaching to help you along the way as  well as email coaching.  </p>  <p>  \t    With this style of learning and coaching, you can quickly implement what you learn and begin to make an impact in your company.  </p>  <p>  \t    You don&#039;t have to complete your first project alone.  Sign up for this course and let us train you and then coach you through your project.  </p>  <p>  \t    For questions, you can email us at questions@leantrainingresources.com  </p>", 
    "end_date": null, 
    "title": "Six Sigma Green Belt Training and Certification", 
    "price": "30.00", 
    "instructors": "Lean Training  Resources", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/87830_bba3_5.jpg", 
    "course_url": "https://www.udemy.com/six-sigma-green-belt-training/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-04T00:16:31Z"
}