{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are you new to Six Sigma and failed to understand the basics of Six Sigma?</strong><br></p>\n\n<p>  \t<strong>Are you planning to go for Six Sigma Green Belt or Black Belt, but want to start with basic concepts in simple and plain terms? </strong>  </p>\n\n\n\n<p>  \t<strong>Are you a manager and want to implement the concepts of Six Sigma in your work area?</strong>  \t<strong></strong>  </p>\n\n\n\n<p>  \t    Reading Wikipedia and watching YouTube did not help you to understand what is Six Sigma and how can you use it in your work area.  </p>\n\n\n\n<p>  \t    Your organization does not want to spend money on this.  </p>\n\n\n\n<p>  \t    This course would be your first step to the wonderful world of Six Sigma. After completing this course you would be able to handle small improvement projects in your organization independently. In addition you will be able to support a Green Belt or Black Belt in solving medium to highly complex problems.  </p>\n\n\n\n<ul>  \t<li><strong>No need to pay $1000.  \t</strong></li>  \t<li><strong><strong>No need to take a day off from your work.</strong></strong></li>  \t<li><strong><strong>Certificate of Completion provided.</strong></strong></li>  \t<li><strong><strong>Satisfaction Guaranteed. Get your money back in 30 days if you are not satisfied. No Questions Asked! There is no reason to delay because I am taking all the risks. There is no risk to you.</strong></strong></li>  </ul>\n\n\n\n<p>  \t                           This course is prepared based on my 30 years of practical experience in Quality Management.  </p>\n\n\n\n<p>  \t                                                   This course teaches the basics of Six Sigma approach to improvement.  </p>\n\n\n\n<p>  \t                                                                             You will  learn the Six Sigma improvement skills  through short and easy to  understand video lessons and  quizzes. Discussion forum on  the right  side of this course would be   used to discussed specific  problems and  issues.  </p>\n\n\n\n<p>  \t<em>Here is a summary of topics covered in this course.</em>  </p>\n\n\n\n<p>  \t                                                                                                 In this course you will learn about:  </p>\n\n\n\n<ul>  \t<li>History of Six Sigma</li>  \t<li>DMAIC Approach</li>  \t<li>Types of Belts</li>  \t<li>How to select an improvement project</li>  \t<li>Tools to start your next improvement project</li>  </ul>\n\n\n\n<p>  \t                                     This course is priced at great introductory price of just $48.  </p>\n\n\n\n<p>  \t                                                   This   Course   will   continue   to   grow with new    lectures.  </p>\n\n\n\n<p>  \t                                     However,   if   you   enroll Today   you   are     “locked   in\" –  you   will   get   all   the   new lectures   and     materials   at    NO   extra   cost – EVER!  </p>\n\n\n\n<p>  \t                                     30   Day   Money   Back   Guarantee  </p>\n\n\n\n<p>  \t                                                                             Don't   forget,   all    my   Courses have   an    unconditional,   30   Day   Money Back    Guarantee.      This    means   you   have   absolutely   no   risk    when   signing   up   to    one of   my   great   Courses.      I    never   ask   questions   and    always   refund 100% in full.  </p>", 
    "end_date": null, 
    "title": "Six Sigma Yellow Belt", 
    "price": "30.00", 
    "instructors": "Sandeep Kumar ­", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301456_ff8f_6.jpg", 
    "course_url": "https://www.udemy.com/six-sigma-yellow-belt/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-16T17:22:18Z"
}