{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>You know the basics of Six Sigma, but when it comes to statistics you get confused</strong>.</p>\n\n<p><strong>You find concepts such as central limit theorem, probability distributions, hypothesis testing and design of experiments are too complex to understand.</strong></p>\n\n\n\n<p><strong>You wish some one could explain these to you without using complex terminology, in plain and single language.<br></strong></p>\n\n\n\n<p>Does this sound familiar? Let me help you in understanding these concepts in plain and simple terms at such an affordable price.</p>\n\n<p><strong></strong></p>\n\n\n\n<p><strong>Key Features:</strong><br></p>\n\n\n\n<p><em>- Downloadable lecture slides after each section</em></p>\n\n\n\n<p><em>- Quiz questions after each section to test your understanding.</em></p>\n\n\n\n<p><em>- Flash cards to refresh your understanding of acronyms and definitions. (You will not find this feature on any other Udemy course).</em></p>\n\n\n\n<p><strong>Implement Six Sigma in your organization to reduce cost, improve quality, reduce waste, improve consistency and improve customer satisfaction.</strong>After completing this course you would be able to handle medium size improvement projects in your organization independently. In addition you will be able to support a Black Belt in solving medium to highly complex problems. <br><em></em></p>\n\n<ul><li><strong>No need to pay $2000 - $5000. </strong></li><li><strong><strong>No need to take days off from your work.</strong></strong></li><li><strong><strong>Certificate of Completion provided.</strong></strong></li><li><strong><strong>Satisfaction Guaranteed. Get your money back in 30 days if you are not satisfied. </strong></strong></li></ul>\n\n\n\n<p><strong><strong></strong></strong>As per 2014 salary survey by ASQ a person with Six Sigma Green Belt certificate earns on the average 12% ($9300 per year) more than a person without the certification.<strong><strong></strong></strong></p>\n\n\n\n<p>This course is prepared based on my 30 years of practical experience in Quality Management.<br><strong></strong></p>\n\n\n\n<p> You will learn the Six Sigma improvement skills through short and easy to understand video lessons and quizzes. Discussion forum on the right side of this course would be used to discussed specific problems and issues. </p>\n\n\n\n<p> <em></em></p>\n\n\n\n<p><em>Here is a summary of topics covered in this course.</em> </p>\n\n\n\n<ul><li>Introduction Six Sigma</li><li>All the basic statistics you need for being a Six Sigma Green Belt</li><li>Tools and concepts for <strong>Define</strong> Phase -Understanding customer and customer requirements, Critical to Quality (CTQ) , Quality Function Deployment (also known as House of Quality), How to select and manage a Project including tools such as CPM and PERT, managing project team and team dynamics.</li><li>Tools and concepts for <strong>Measure</strong> Phase -Starting from the very basic concepts of statistics, you will learn descriptive statistics, probability, inferential statistics, probability distributions, and process capability.</li><li>Tools for <strong>Analyze </strong>Phase - In a simple and easy to understand language you will learn the concepts of correlation and regression, hypothesis testing and ANOVA.</li><li>Tools for <strong>Improve </strong>Phase -In this section you will learn how the Design of Experiments can help in finding the right values for your process.</li><li>Tools for <strong>Control </strong>Phase -Once you have improved the process, you need to retain the improvements. Control Charts help you in monitoring your process. In this section you will learn about X bar R, u, c, p and np control charts.</li><li><strong>Flash Cards </strong>- This is one of the unique feature I have in this course. You will not find this on any other Udemy course. Click on the acronym to flip the card and see the full form. </li></ul>", 
    "end_date": null, 
    "title": "Six Sigma Green Belt", 
    "price": "40.00", 
    "instructors": "Sandeep Kumar ­", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449050_f6fc_3.jpg", 
    "course_url": "https://www.udemy.com/six-sigma-green-belt-online-training-and-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T01:06:33Z"
}