{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    OTIFAS - stands for the acronym &lsquo;Operational Excellence Training Institute for Aspirants&rsquo;  </p>  <p>  \t    A team of professionals, mustered with a mission: to spread the contemporary operational excellence strategies, among the aspirant individuals and industries. Over a decade, it has been helping more than thousands of aspirants to excel their career through application focused learning.  </p>  <p>  \t    This course is aimed for those who wish to take six sigma Green and Black belt combined and wish to enhance their analyzing skills in advanced six sigma tools. A Six Sigma black belt manager heads cumbersome projects and acts as coach/mentor and statistical analyst as well during project realization, this course provides the required knowledge and skills that are sought by a black belt aspirant.  </p>  <p>  \t    Key learning Objectives are to make you: understand, apply, analyze, evaluate, and create techniques as prescribed by six sigma body of knowledge; learning materials include video lectures, PDF files of lectures that can be downloaded, Minitab exercise files that can be downloaded for practice, practice quizzes. The course contents are prepared by scholars, with more than 30 years of academic and industrial experience at leading MNCs. On an average, if a working adult devotes one hour per day, he or she would be able to complete this course within 10 to 15 days.  </p>  <p>  \t    OTIFAS voluntarily follows the guidelines of ISO 17024, in order to benchmark our certification process at par with global standards.  </p>", 
    "end_date": null, 
    "title": "Six Sigma Green and Black Belt Combo ", 
    "price": "25.00", 
    "instructors": "OTIFAS Six Sigma", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/127214_d2e2_6.jpg", 
    "course_url": "https://www.udemy.com/six-sigma-green-and-black-belt-combo/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-30T12:09:12Z"
}