{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   OTIFAS - stands for the acronym &lsquo;Operational Excellence Training Institute for Aspirants&rsquo;  </p>  <p>  \t   A team of professionals, mustered with a mission: to spread the contemporary operational excellence strategies, among the aspirant individuals and industries. Over a decade, it has been helping more than thousands of aspirants to excel their career through application focused learning.  </p>  <p>  \t   Six Sigma is the most sought after business excellence strategies among the leading and progressive MNCs. Demand for greenbelt professionals is tremendous in global market.  </p>  <p>  \t   This course is all about Six Sigma Green Belt.  Key learning Objectives are to make you:  understand, apply, analyze, evaluate, and create various Six Sigma DMAIC tools and techniques appropriately.  DMAIC stands for Define, Measure, Analyze, Improve and Control.  The complete course is structured based on American Society of Quality&rsquo;s (ASQ) Body of knowledge for Six Sigma Green Belt.  </p>  <p>  \t   Course materials include: Video lectures, PDF files of lectures that can be downloaded, Minitab exercise files that can be downloaded for practice, practice quizzes as per the ASQ- BOK question pattern.  The course contents are prepared by scholars, with more than 30 years of academic and industrial experience at leading MNCs.  </p>  <p>  \t   On an average, if a working adult devotes one hour per day, he or she would be able to complete this course within 15 to 20 days.  The breakup of total course duration: video lectures are around 9 hours, reading, attending quizzes, practicing examples etc., take around 10 to 12 hours.  </p>  <p>  \t   This course is structured in 7 sections.  Section 1 provides the introduction to Six Sigma, sections 2 to 6 provide the complete coverage of ASQ BOK for green belt.  Section 7 consist the concluding thoughts.  </p>  <p>  \t   This course has been designed to provide the benefits to four categories of aspirants:  for a Job seeking aspirant it helps in learning Six Sigma concepts and becoming certified Green Belt Professional. Process Mangers and Entrepreneurs will be benefitted by applying Six Sigma concepts to increase the process efficiency and effectiveness.  A quality professional can align six sigma concepts with other contemporary quality strategies.  </p>  <p>  \t   OTIFAS voluntarily follows the guidelines of ISO 17024, in order to benchmark our certification process at par with global standards.The certification process has also been accredited by the International Accreditation Organization (IAO), USA.  </p>", 
    "end_date": null, 
    "title": "Six Sigma Green Belt Training", 
    "price": "25.00", 
    "instructors": "OTIFAS Six Sigma", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/87592_6cab_15.jpg", 
    "course_url": "https://www.udemy.com/six-sigma-green-belt-training-and-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-03T14:59:01Z"
}