{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em></em><em>RISK MANAGEMENT</em> must be on the radar screen of every business management team and organization - from top to bottom. From planning to documentation, from risk identification to hazard assessment, from global risk management strategies to the key role of supply chain management, this book contains plenty of practical, relevant information and best practices for managing the unknown.</p><p>Just as it is impossible to totally prevent most disasters and disruptions, it is unrealistic to assume that they will happen to other companies but not to yours. Being prepared when things happen is just plain good business. Failure to plan for such events can lead to supply chain disruptions that can devastate company performance, damage profitability and stock prices, and result in irreparable harm to the organization. The consequences can also result in cascading damage to every business and organization relying on the timely receipt of your goods and services that enable them to continue meeting their customers’ needs.</p><p>By blending organizational capabilities emanating from people, processes, and technology, the firm can embrace a supply chain security orientation and effectively protect itself and its supply chain assets from damage and/or destruction caused by internal and external threats. <br></p><p><strong>Content and Overview:</strong><br></p><p>This course contains 12 lectures, 2 hours of content, and a quiz containing 15 questions. The course is suitable for students and business professionals who want to get a basic understanding of risk management and to explore various strategies and best practices, tools for identifying and managing risks, and tools for planning and analysis.<br></p><p>The content areas include:<br></p><ul><li>Supply Chain Risk Basics</li><li>The Changing Face of SC Risks</li><li>Risk Management Process</li><li>External Risk Drivers</li><li>Internal Risk Drivers</li><li>Risk Assessment</li><li>Risk Treatment</li><li>Continual Monitoring of Risks</li><li>Predicting and Managing SC Risks</li><li>Supply Chain Security</li></ul><p>By completing this course, you'll be armed with the valuable and practical skills you need to develop and implement an Effective Supply Chain Risk Management program, improve your business operations performance, and make your supply chain secure and resilient.</p>", 
    "end_date": null, 
    "title": "Supply Chain Risk Management", 
    "price": "20.00", 
    "instructors": "Operational Excellence Training", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667868_6911_3.jpg", 
    "course_url": "https://www.udemy.com/supply-chain-risk-management/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T14:47:41Z"
}