{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Today's Organizations can't thrive without the hard work of quality managers to direct people, planning, and events. As Organizations can not thrive, neither can many managers without their right hand, their administrative support professionals, or Admin Pros.</p><p>Today's Admin Pros are also known as Admin Assistants, Admin Secretaries, Executive assistant, or even office managers. An Admin Pr handles an astonishing variety of tasks in today's organizations.</p><p>For example, they manage projects, create and maintain databases, schedule boss's time, conduct research, and draft business correspondence. They also order office supplies, work with contractors and vendors, answer and handle telephone calls, plan and coordinate small and large meetings and events, and create spreadsheets and reports. It is no wonder that so many managers consider their admin pros to be truly their partners.</p><p>Admin pros are highly capable of operating state-of-the-art hardware and software. They are almost always good communicators and can adapt to different personalities and work styles. Nowadays, am pros work side-by-side with their boss. They also often attend meetings in their boss's place and have the authority to speak on behalf of the boss.</p><p>In this course, you'll learn the skills needed to be a successful admin professional, including communication skills, organizing and managing skills, problem-solving skills, and basic office skills. </p><p>You'll also learn how to work effectively for your boss by anticipating your boss's needs, making your boss look good, and keeping your boss informed.</p><p>Finally, you'll learn some effective methods for communicating your boss's decisions to the people who will carry them out.</p><p>Plus so much more! </p><p>So if you're a Current Admin Professional or Someone looking for the Basics to Becoming an Administrative Support Professional, then don't wait another moment!  Begin your new future today! </p>", 
    "end_date": null, 
    "title": "The Complete Administrative Professional's Bible", 
    "price": "20.00", 
    "instructors": "James Smith", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/693706_02c1_3.jpg", 
    "course_url": "https://www.udemy.com/the-complete-administrative-professionals-bible/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T05:41:57Z"
}