{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This Course is the first course in a series of courses on Supply Chain Optimization &amp; Big Data Analytics. According to the “Supply Chain Talent of the Future” report published by Deloitte, <strong><em>more than 95% of the supply chain leaders identified big data analytics including optimization and predictive analytics as the foremost capability of the future</em></strong> and said either that their companies currently use them or that they expect to in the future.</p>\n\n<p>As far as supply chain network design is concerned, it is the most critical discipline of supply chain &amp; operations management as network costs contribute as much as 80% to the supply chain costs. Supply chain network design is necessary to implement a supply chain that can quickly and efficiently distribute the products. It is an important driver for growth and expansion of businesses. <em>It would be no exaggeration to state that two of the planet's largest companies, Walmart and Amazon, have built their successful businesses around outstanding supply chain network design and operations.</em><br></p>\n\n<p><em></em>This course will help you learn and master the art and science of supply chain network design &amp; optimization. This course aims to teach you in detail how to use optimization to model and design a high performance supply chain. <strong></strong></p>\n\n<p><strong>Learn and Master the Practical Aspects of Supply Chain Network Design</strong><br></p>\n\n<ul><li>Fundamental Concepts of Supply Chain Network Design</li><li>Advanced Network Modeling</li><li>Case Study Discussions</li><li>Supply Chain Network Optimization Problems </li><li>Real Life Network Design Project</li></ul>\n\n<p><strong>Content and Overview</strong></p>\n\n<p>Through this course, you will learn fundamentals and establish a strong understanding of the concepts related to supply chain network design. In order to transform your learning into skills, the course includes case study discussions, network optimization sample problems and one real life project.</p>\n\n<p>This course starts by giving you an overview of supply chain network design and then introduces you to supply chain optimization and use of Excel solver to solve supply chain problems.</p>\n\n<p><em>Once the basics are mastered, the course helps you deep dive into network design and learn how to make network design decisions like facility location, capacity allocation, supply &amp; demand allocation etc. </em>The course also introduces some other components like service modeling and greenhouse gas emission modeling  as part of network design. </p>\n\n<p>I will then help you learn some advanced modeling strategies and finally will work with you on an hour long real life supply chain network design project. Upon completion you will have a strong understanding of supply chain network design and will be able to execute various types of network design projects.<br></p>\n\n\n\n<p><strong></strong>You have 30 days money back guarantee! No questions asked. So, go ahead, and press that \"Take the Course\" button! </p>", 
    "end_date": null, 
    "title": "The Comprehensive Supply Chain Network Design Course", 
    "price": "45.00", 
    "instructors": "Baidhurya Mani", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695006_0107_9.jpg", 
    "course_url": "https://www.udemy.com/the-comprehensive-supply-chain-network-design-course/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-11T18:24:31Z"
}