{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>CURSO DE TRANSPORTE NO E-COMMERCE - VÍDEO AULA</strong></p><p>O curso de Transporte no E-commerce foi elaborado para proporcionar ao participante o conhecimento básico sobre as principais operações de transportes existentes no E-commerce, assim como, buscar entendimento sobre os formatos e aplicações de uma tabela de transporte. Finalizando com dicas e boas práticas a serem seguidas, a fim de alcançar um resultado satisfatório. O curso é em vídeo aulas, 100% a distância. Você recebe login e senha para acessar as aulas, logo após a aprovação de seu pagamento e pode estudar de onde quiser, na hora que quiser.</p><p><br></p><p><strong>Objetivo:</strong></p><ul><li>Conhecer e compreender as formas de distribuição e seus benefícios</li><li>Entender a tabela de transporte e suas aplicações</li><li>Desenvolver formas de controle dos processos e dos indicadores de desempenho</li></ul><p><strong><br></strong></p><p><strong>Duração:</strong></p><p>O Curso Online de Transporte no E-commerce tem carga horária total de 45 minutos.</p><p><br></p><p><strong>Público Alvo:</strong></p><p>O curso de Transporte no E-commerce destina-se a gerentes, diretores, consultores e empresários do segmento de E-commerce.</p><p><br></p><p><strong>Conteúdo Programático:</strong></p><ul><li>Infraestrutura Brasileira</li><li>Sistemas de Transporte</li><li>Entendendo a Tabela de Transporte</li><li>Indicadores de desempenho no Transporte</li><li>Dicas para utilizar as Transportadoras</li><li>Dicas Gerais</li></ul><ul><p><strong><br></strong></p><p><strong>Por que escolher a ComSchool?</strong></p></ul><li>Única escola no Brasil com cinco livros publicados na área digital</li><li>Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li>Programa inovador, fundamentado no conhecimento prático dos professores</li><li>Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li>Estude com alguns dos nomes mais influentes da Internet brasileira</li><li>A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas.</li><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Transporte no E-commerce", 
    "price": "20.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725932_81b5_2.jpg", 
    "course_url": "https://www.udemy.com/transporte-no-ecommerce-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T18:44:02Z"
}