{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The consumer goods supply chain is subject to tremendous demand volatility, stemming from seasonal variations, promotional activities, the shortened life cycle of goods, and the ever-growing number of new and improved products that are being pushed into the markets. In the meantime, retailers are well aware that their ability to provide a high level of “on-shelf” product availability is crucial in establishing and maintaining a loyal customer base. To reduce their levels of stored inventory, retailers are demanding quicker replenishment of goods, shorter turnaround times, reduced minimum quantities, and more frequent shipping options. All of this leads to a greater emphasis on the importance of flexibility and reliability in the transportation operations sector.</p>\n\n<p>This course is motivated by the practical challenges inherent in the transportation planning that’s required by today’s consumer goods industry. By addressing three key areas, the course will guide the learner through the essential elements involved in planning and managing a systematic approach to transportation operations. These key areas include:</p>\n\n<ul><li>planning and managing transportation operations to meet the needs of the consumer goods sector, through improved supply chain performance</li><li>reducing costs through the use of outsourced transportation networks</li><li><span></span>identifying, implementing, and managing the measures necessary to increase the efficiency of outsourced transportation networks</li></ul>\n\n<p>After completing this course, you will be capable of examining, planning, and managing the transportation operations required by the consumer goods industry. You will know how to evaluate external factors and trends that impact supply chains, how to assess the transportation costs related to consumer goods networks, and how to analyze the freight rates of outsourced networks.</p>", 
    "end_date": null, 
    "title": "Transportation Planning and Management in Consumer Goods SC", 
    "price": "20.00", 
    "instructors": "Operational Excellence Training", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/795544_e1c6_2.jpg", 
    "course_url": "https://www.udemy.com/transportation-planning-and-management-in-consumer-goods-sc/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T06:49:19Z"
}