{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to our module on “Understanding and managing manufacturing operations”. Managing manufacturing operation is an approach of overseeing all aspects of the manufacturing process with a particular focus to increase efficiency. This course focuses on three aspects of manufacturing, which are, manufacturing organization design, manufacturing strategy for outsourcing and manpower optimization.</p>  <p>The first section provides a blueprint of a manufacturing organization based on guiding principles and best practices. The course will be useful for all the manufacturers who are engaged in driving organizational efficiency or designing a manufacturing organization. With the help of some great case examples, the module will teach you how to balance workforce to the workload.</p>  <p>The second section is a guideline to decide when it is beneficial to outsource and when to manufacture in-house. Also, through this course, you will learn a step by step process of outsourcing that will not only guide you how to outsource but will also give a brief on how much amount should be outsourced. Not only this, you will also learn to evaluate the financial benefits coming out of outsourcing.</p>  <p>In the third section, you will learn how to prioritize the plants that require labor reduction and some very important levers that helps to optimize the opportunity and develop recommendation to reduce workforce. Each of these levers has been explained with the help of case study examples for the practical understanding of these techniques.</p>  <p>And the last section on manpower planning gives information on some very useful tools and techniques that can provide great aid in manpower optimization.</p>  <p>So, take this course now to make yourself indispensable at managing manufacturing operations.</p>", 
    "end_date": null, 
    "title": "Understanding & Managing Manufacturing Operations", 
    "price": "20.00", 
    "instructors": "SkillBiz Solutions", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743410_c367.jpg", 
    "course_url": "https://www.udemy.com/understanding-managing-manufacturing-operations/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T10:33:39Z"
}