{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>An effective understanding of Public Procurement is essential for SME’s who wish to bid for Government Contracts, here in the UK. You need to understand who your potential customers are. How they advertise contracts and the procurement processes that are involved. You need to ensure that if you bid for a contract then you stand the best possible chance of success. This can be achieved by a full understanding of the Tender Evaluation process and how bids are awarded. The feedback process and how successful Contracts are formed and fulfilled.<br></p>\n\n\n\n<p>Although predominately aimed at the UK, the knowledge gained should be able to be adapted to applying for contracts in other Public Sectors, throughout the European Union\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>After completing this course, you will have:\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>·      A better chance of winning and keeping public contracts\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       An insight into the background of the UK Public Sector\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       An understanding of the Rules &amp; Laws that govern Public Procurement\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       Learn to search for Tendering opportunities\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       Gain an understanding of the procedures used to award contracts, \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       Learn how Lean Procurement is being used to streamline processes\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       An insight on how to complete your bid and a Pre- Qualification Questionnaire (PQQ) \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       Learn how Tenders are evaluated\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       Knowledge of how a Buyer uses Life Cycle Costing\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       Knowledge of what actions you need to take when you lose or win a Contract\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       An understanding the grounds for excluding suppliers\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       An introduction to the Modern Slavery Act 2015\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>•       Discover how the Contract should be managed\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Understanding the Process for Public Procurement", 
    "price": "20.00", 
    "instructors": "Mike Barnes", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/819838_d813_2.jpg", 
    "course_url": "https://www.udemy.com/understanding-the-process-for-publicprocurement/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-12T14:15:39Z"
}