{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\">Are You Running Your Business or is Your Business Running You?</strong>  </p>  <p>  \t       This course is for entrepreneurs who are looking for a way to take their business to the next level. If you&#039;ve ever caught yourself thinking there just aren&#039;t enough hours in the day, there is a solution.  </p>  <p>  \t       And it won’t make you go broke, either.  </p>  <p>  \t       Virtual assistants are essentially telecommuting contractors to your business. This course covers everything you need to know about virtual assistants, including:  </p>  <ul style=\"\">  \t<li>Where to find the best ones</li>  \t<li>How to hire them</li>  \t<li>Best practices for working with them on an ongoing basis</li>  </ul>  <p>  \t       It’s taught from firsthand experience, NOT theoretical or academic fluff. You’ll learn how a talented virtual assistant can help <strong style=\"\">save you time, money, and headache.</strong>  </p>  <p>  \t       Take control of your entrepreneurial life and learn how to effectively outsource your non-essential tasks. You’ll free up hours every day to focus on what’s really important.  </p>  <p>  \t       In the end, virtual assistants can help you lead a <strong style=\"\">happier, healthier, and more productive and stress-free life.</strong>  </p>  <p>  \t       It&#039;s possible (and I would argue essential) to unload many aspects of your day-to-day work, leaving you free to tackle the higher-level, strategic, and money-making projects that often get neglected.  </p>  <p>  \t <strong style=\"\">Time is Our Most Valuable Resource</strong>  </p>  <p>  \t       But it&#039;s also the resource we are quickest to waste. After this course, you may not achieve the <em style=\"\">4-Hour Work Week</em> right away, but you’ll be armed with actionable advice on how to get started with outsourcing. The world’s most successful people didn&#039;t get there alone; they all had help along the way.  </p>  <p>  \t <strong style=\"\">What are you waiting for? </strong>Let&#039;s get started on your outsourcing adventure today!  </p>", 
    "end_date": null, 
    "title": "Virtual Assistant: Find, Hire, Train, and Manage", 
    "price": "30.00", 
    "instructors": "Nick Loper", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184756_c4f9_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-hire-and-work-with-virtual-assistants/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-18T18:14:28Z"
}