{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>JOIN OVER 2,312+ SUCCESSFUL STUDENTS WHO ARE LEARNING TOGETHER </p><p><em>LATEST: Course Updated For <em>March</em> 2016 - updates at least every month!</em></p><p>* fastest growing course for Cloud Computing!</p><p>* high quality content! - we are using media types that will enhance your learning experience!</p><p>* over 812 students in the first 3 days - hope they are not your competitors!</p><p>* over 2,312+ students in the meantime - learning together </p><p><strong>Cloud Computing For Business.</strong></p><p>If you ask yourself these questions:</p><ul><li>What is Cloud?</li><li>How can I leverage the power of the Cloud?</li><li>What are the different possibilties?</li></ul><p>Then this course is for you.</p><p><em>If you think 0,82USD a day for the next year, is worth growing your business. I agree with you. Just click on Take This Course and you are on the winner side.</em></p><p>Customer Reference:</p><p><em>\"We started to work with Nemanja Adamovic to increase our revenue and sales,</em> <em>during that time our business had some critical issues. He helped to double </em><em>our revenue in a short timeframe through his course. As he worked with Fortune 500, Midsize and Small business owner, he is a treasure of knowledge, you don't get information like get a Facebook page, because this is not enough. He first showed us the system and we could identify were we lack in knowledge and then improve. </em><em>If you ask me, I would recommend every Business Owner to take his program.\"</em></p><p>-Turco, Italy. Small business owner in the area of food industry.</p><p>My promise to you:</p><p>No silly \"non-sense\", shortcuts, or long-drawn-outs videos, but examples and questions that really works and bring it to the point. The only requirement is that you have an open-minded perspective, are ready to implement the things you learn here and want to get the best out of your business. It is easy and simple explained, so that you can START RIGHT NOW.</p><p>It doesn't matter if you are already a business-owner or if you want to start a business, the information you get in this course, will help you. No matter what.</p><p>New Content will be uploaded every month, so that you are always up-to-date. This is for free, if you are still with us after 30 days.</p><p>Don't worry. You will not be alone. The bonus with this course it, that you have free access to our great community where you can ask questions and learn from others, share opinions and enjoy your success.</p><p><em>This course works everywhere, no matter in which country you live in.</em></p><p>If you are not open to change, nothing will happen. Take This Course Today to see your business grow soon.</p><p>You have a 30 day full money back guarantee. No questions asked - Just try it out, you have nothing to lose.</p><p>But I know you are going to love this. ;)</p><p>- Nemanja</p><p>PS: the course includes a UDEMY certification (it's not a certification from VMware)</p>", 
    "end_date": null, 
    "title": "Vmware Cloud Computing Virtualization Basics + Certification", 
    "price": "35.00", 
    "instructors": "Nemanja Adamovic", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441952_ce93_3.jpg", 
    "course_url": "https://www.udemy.com/how-it-works-cloud-computing-for-business-training-course-tips-what-is/", 
    "currency": "USD", 
    "subject_name": [
        "Operations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T15:03:40Z"
}