{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Learn to Construct Mind-Blowingly Informative Interviews!</strong></p>\n\n<p>Course Update February 2016</p>\n\n<p>Yesterday I spoke with Nick Cavell. Nick is a sports journalist for BBC African sports. During the interview, we talked about how Nick broke into the BBC. We spoke about his daily routine at BBC African sports, how he sources and covers stories, how he verifies facts and how he treats a story. There's also handy tips on interviewing football managers and advice on what to look out for when interviewing. The video has been added to the professionals section.</p>\n\n<p>If you want to attract traffic to your website, YouTube channel, blog, etc., showcasing a collection of superb interviews can be a powerful way to do this.</p>\n\n<p><strong class=\"redactor-inline-converted\">You see...</strong></p>\n\n<p>Great interviews give your website/film/audio file a genuinely professional feel. A professional feel gives you authority. Authority attracts. Poor interviews do the opposite. They make you look like an amateur. And there are thousands of amateurs out there. Don't be an amateur, be professional. </p>\n\n<p><strong class=\"redactor-inline-converted\">And there's more...</strong></p>\n\n<p>Nightmare interviews push people away from your sites. If you listen to a poorly recorded interview, that asks dumb questions and sounds like it took place in a bathroom, then you're not going to have an air of authority around you. Well, you'll have air around you alright, the trouble is, it'll be rather foul smelling. </p>\n\n<p>Don't be one of these people creating bad interviews, record high-quality interviews.</p>\n\n<p>With \"Learn to Construct Mind-Blowingly Informative Interviews\", I'm going to teach you how to research properly, how to choose the right interviewee subject, what questions you need to ask, what questions you need to avoid, and I'll also tell you how to prepare “counter questions.\" </p>\n\n<p><strong class=\"redactor-inline-converted\">B</strong><strong class=\"redactor-inline-converted\">ut why should I even bother studying this Ashley?</strong></p>\n\n<p>Because as soon as you learn these skills once, you'll never have to learn them again. Learn once, interview for life.</p>\n\n<p><strong class=\"redactor-inline-converted\">Listen....</strong></p>\n\n<p>If you don't have a template, you'll create boring questions. Boring questions make for dull interviews. </p>\n\n<p>I'll teach you that template!</p>\n\n<p><strong class=\"redactor-inline-converted\">And you'll also....</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Get Sizzling Broadcasting Advice From Professional Broadcasters!</strong></p>\n\n<p>I didn't spend nine years at the BBC for nothing you know! I've been annoying my ex-BBC work mates. Finally, they relented and let me interview them!</p>\n\n<p>We're talking about the big boys and girls here! They've worked for the BBC, Aljazeera, beIN Sports and Sky News Arabia. These journalists have years of experience. </p>\n\n<p><strong class=\"redactor-inline-converted\">And....</strong></p>\n\n<p>It doesn't stop there. I'll be getting more in the future. They can run, but they can't hide.</p>\n\n<p><strong class=\"redactor-inline-converted\">For £15 / $20 you get:</strong></p><em>Lifetime access to 38 videos.<br></em><p><em>Tutor support from me.<br>No subscription fees.<br>Continual course updates<br>Enrollment into a group that already includes 107 learners</em></p>\n\n<p>Take action now and find out:</p>\n\n<p>How to source excellent interviews for your projects</p>\n\n<p>How to research and flesh out your initial interview idea </p>\n\n<p>How to select the correct person for your interview</p>\n\n<p>Advice on covering tough issues such as trauma etc.</p>\n\n<p>Learn what questions to avoid asking.</p>\n\n<p>Find out how to structure your interview before you do it.</p>\n\n<p>Get tips on how to bring out emotions from you interviewee subject.</p>\n\n<p>Discover how to prepare side questions before the interview.</p>\n\n<p>Learn how to use statistics and opinion polls to provide an alternative argument.</p>\n\n<p>Tips on taking past quotes and using them for current interviews.</p>\n\n<p>How to deal with angry people.</p>\n\n<p>Understand how the location of the interview can affect your interviewee's replies.</p>\n\n<p>Interviewing by phone.</p>\n\n<p>Learn to understand your audience.</p>\n\n<p>Tips on how to listen like a pro.</p>\n\n<p>Make a vox pop!</p>\n\n<p>Libel and copyright lessons! Crucial!</p>\n\n<p>Risk assessments and safety issues.</p>\n\n<p>Professional broadcasters give you their advice.</p>\n\n<p>No Questions Asked 30 Day Refund!</p>\n\n<p>Every course on Udemy comes with a no questions asked money back guarantee! </p>\n\n<p><strong class=\"redactor-inline-converted\">Start today and \"Learn to Construct Mind-Blowingly Informative Interviews!\" </strong></p>\n\n<p><strong>Updates</strong><br>February 2016<br>Interview with Nick Cavell from BBC African Sports.</p>\n\n<p>July 2015<br>Alex Mwangi from the BBC Swahili Service shares his knowledge on news and sports interviews.</p>\n\n<p>June 2015: <br>Helpful links added to the course.</p>\n\n<p>February 2015: <br>Sami Sahmoud from beIN Sports (Al Jazeera) talks to me about what skills are needed to make a great interviewer.</p>\n\n<p>January 2015: <br>I added a new section to the course. Advice from the Professionals.</p>\n\n<p>Nouran Sallam (EX BBC, Al Jazeera, and current Al Hayah's TV News Anchor) talks to me about conducting interviews.</p>", 
    "end_date": null, 
    "title": "\"Discover The Secrets To Media Interviews!\"", 
    "price": "20.00", 
    "instructors": "Ashley Cowan", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296149_b693_5.jpg", 
    "course_url": "https://www.udemy.com/interviewing-for-media-from-beginner-to-ninja/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-08T12:17:16Z"
}