{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Nonfiction authors share stories that will change people's lives. Yet they don't always get the recognition they should. They know they've poured their heart out and revealed something so personal that the triumph makes them want to tell it all. Once they do, they don't get the book sales they expect. Why does this happen? </p><p><strong>Newsflash</strong>: <strong>You have to brand and market yourself starting in your local area. </strong></p><p><strong>Latest updates added December 2, 2015.</strong><br><strong></strong></p><p>If you're an author who has released your first book or maybe even your third and haven't had sales, then this course is for you. Or, if you are currently writing your first book, this is a course you want to take and be ahead of the game. </p><p>This course walks authors through the steps of becoming a local expert.</p><p>You'll learn:</p> <ul><li>Purpose of creating an Author Website</li><li>Insider tips on participating in local Author Events</li><li>How to get exposure from your local library</li><li>Importance of a press release and where to submit</li><li>How to use Social Media in your branding and marketing</li><li>How to utilize radio interviews in your marketing</li><li>Giving Back through Local Nonprofits and much more…</li></ul> <p>Get started today and become the local expert newspaper editors and radio shows contact again and again. </p>", 
    "end_date": null, 
    "title": "How a Nonfiction Author Becomes a Local Expert", 
    "price": "20.00", 
    "instructors": "Taffy Wagner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/270616_fe3d_3.jpg", 
    "course_url": "https://www.udemy.com/nonfiction-author-becomes-local-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-28T23:27:13Z"
}