{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Did you know?</strong><br></p>\n\n<p>According to the former CEO of Google, Eric Schmidt, humanity today creates as much content every 48 hours, as we did from the dawn of civilization up until 2003. Think about that for a second. </p>\n\n<p>With so much content being created every single day, how can YOUR brand or product stand out from the rest? And let alone for free!?</p>\n\n<p><strong>Not to worry</strong></p>\n\n<p><strong></strong>In this course I'm going to show you the insider tricks and tips to get coverage in major media outlets with no marketing budget. It's the same techniques I've used over the last 10 years to get coverage on CNN, ABC, NBC, Time, Univision, Houston Chronicle, and many other media outlets. </p>\n\n<p><strong>Why should you listen to me? </strong></p>\n\n<p>Well, in addition to having done this myself successfully several times with different types of projects, and sometimes unsuccessfully (so you can learn from my mistakes), I've also been on both sides of the media world. For the last few years I was the Editor in Chief of iPhone Life magazine and Android Life magazine, where I would receive 100s of story pitches every week, and I'll show you some of those as part of the course. </p>\n\n<p>So I know what what works from the journalists side, and most importantly, I know what doesn't work, so you don't waste your time. </p>\n\n<p><strong>Some of the things I'll show you in this course include:</strong> </p>\n\n<ul><li>The 5 most effective story-telling formats that work best for businesses and brands. </li> <li>Case studies of brands using unconventional methods to get tons of free publicity. </li> <li>The real purpose of a press release (and why journalists hate them so much). </li> <li>The single best way to build relationships with the media. </li> <li>The 5 things you should NEVER do when contacting the media. </li> <li>And as a bonus, I'll show you the best time to post content on Reddit, to double your chances of going viral.</li></ul>\n\n<p><strong>After you're done with the course:</strong></p>\n\n<ul><li>You'll know how to craft powerful branding stories capable of getting hundreds of thousands of dollars of free publicity.</li><li>You'll end up with a framework that you can repeat as many times as you want to promote your brand or products. </li><li>You'll know what works and what doesn't work in today's ever-changing media landscape.</li></ul>\n\n<p><strong>Let's do it!</strong></p>\n\n<p>If you're serious about your business, and serious about wanting to get major media coverage, then by now the value of this course should be a no-brainer. It's a lot of work, but it'll all be worth it when you see yourself on CNN without having spent a dime :-) So go ahead and click to take this course now, and let's get started! </p>", 
    "end_date": null, 
    "title": "How I got featured on CNN, ABC, and NBC for free", 
    "price": "20.00", 
    "instructors": "Alex Cequea", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530900_119e_2.jpg", 
    "course_url": "https://www.udemy.com/how-i-got-featured-on-cnn-abc-and-nbc-for-free/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T04:19:10Z"
}