{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>GET QUALITY NEWSPAPERS TO WRITE ABOUT YOUR BUSINESS... AN EX-WALL STREET JOURNAL EDITOR AND NOW </strong><strong>ONE OF UDEMY'S TOP INSTRUCTORS REVEALS HOW</strong><strong>...</strong></p><p><em>\"I have never tried to contact the media, but now I am ready!...\" <strong>-- BARBARA MCNEELY, UDEMY STUDENT</strong><br></em></p><p><em><em>\"Anyone who needs to interact with the media needs to take this course...\" <strong>-- TAMATHA CAMPBELL, UDEMY STUDENT</strong><br></em></em></p><p><em><em>\"Gave me a clear understanding of the journalist mindset and how to successfully engage them for media exposure...\" <strong>-- JENNY, UDEMY STUDENT</strong></em></em></p><p><em><em>\"Helped me put together a nice blueprint to start developing a strong network for the industries I am working in...\" <strong>-- GREG FOREMAN, UDEMY STUDENT</strong></em></em><br></p><p><em><em>\"Would definitely recommend this to anyone who is new to this industry or has a desire to network with journalists...\" <strong>-- CORY GOLDBLATT, UDEMY STUDENT</strong></em></em><br></p><p><strong>How do journalists on top newspapers and online news sites decide what to write about?</strong></p><p><strong>How can you get influential reporters to seek your comments for their stories?</strong></p><p><strong>How do you build powerful relationships with journalists whose articles are read by millions worldwide? </strong></p><p><strong>What kind of press releases get noticed and turned into front-page news stories?</strong></p><p>Are you stumped by how to get quoted in the media?<br></p>  <p><strong><em>If so, this course will help get your media strategy off the ground by showing you how to cozy up with mainstream journalists.</em></strong></p>  <p>You'll learn how to generate tons more media publicity without having to spend a penny on expensive PR consultants.  </p>  <p>  \t                                                                                                  The course has been created by a journalist who's written for some of the world's leading news organizations, including The Economist, Financial Times and Bloomberg News.</p>  <p>You'll boost your chances of getting on the radar of journalists whose articles reach thousands if not millions of people.</p>  <p>Getting quoted <em><strong>just once</strong></em> in a major newspaper or quality news website can do more for your sales than paying for several adverts in the same publication.</p>  <p>  \t                                                                              That's because being mentioned in top newspapers and magazines gives you <strong><em>credibility</em></strong>. And credibility inspires<em> </em><strong><em>trust</em> </strong>-- which is precisely what you need to persuade people to buy from you.</p>  <p>  \t<strong>If people have seen your name in print repeatedly, they have less hesitation opening up their purses and wallets to pay you.</strong>  </p>  <p>A respected journalist quoting you in one of their articles also tells readers that you're a genuine <em>authority in your field</em>.</p>  <p>That's why if you don't have a slick media strategy you're probably losing out on tons of business that could be yours easily.</p>  <p>  \t                                                                              In this course you'll discover a bunch of tactics and gain important insights that will help your business become a brand people recognize instantly. For instance, you'll learn:</p>  <ul><li>How journalists choose what to write about so you have a better chance of sneaking into their articles</li>  \t<li>The snowball effect: how getting quoted just once can grow into an avalanche of free publicity</li>  \t<li>The different types of media and how to target them efficiently so you don't waste time building worthless contacts</li>  \t<li>The different types of articles and which ones you need to focus on getting mentioned in</li>  \t<li>How to select the right journalists to build relationships with</li>  \t<li>How a newsroom actually works so you know when and how to approach journalists without annoying them</li>  \t<li>The difference between editors and reporters and which of those to focus on</li>  \t<li>How to position yourself as an industry authority in the eyes of journalists -- and reap the rewards when the public starts to see you the same way</li>  \t<li>What 'newsworthiness' means, and how understanding this concept will help get you loads more free publicity</li>  \t<li>What journalists are really fishing for when they interview you, so you can maximize the odds of getting yourself into print</li>  \t<li>How to become a major journalist's go-to source for comment</li>  \t<li>What motivates journalists (Tip: It's not money) and how to use this insight to your advantage</li>  \t<li>How to speak to journalists so they'll love you and keep coming back for more</li>  \t<li>How to make initial contact with the hacks who matter</li>  \t<li>What NEVER to do with journalists that will guarantee you'll get struck off their guest list -- or worse</li>  \t<li>How to write and package your press releases so they have less chance of being ignored</li>  \t<li>How to avoid being misquoted and inadvertently triggering negative publicity</li>  </ul>  <p>  \t<strong><em>This is your chance to learn all this from </em><em>an editor who has worked for many of the world's leading news organizations -- and who knows how crucial decisions are made about what to write and who to reach out to for comment.</em></strong>  </p>", 
    "end_date": null, 
    "title": "How To Get Your Business In The Press ", 
    "price": "25.00", 
    "instructors": "Shani Raja", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362958_7963_5.jpg", 
    "course_url": "https://www.udemy.com/get-newspapers-to-write-about-you/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T10:16:54Z"
}