{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>OVER 1,100 STUDENTS IN 97 COUNTRIES HAVE TAKEN THIS COURSE!</strong></em></p>\n\n<p><strong>It's no secret that press coverage is massively important for new companies and products.</strong> Whether you want to reach new customers, get a meeting with that investor you're after, or just build a sense of social proof and legitimacy around your brand, being featured in a popular media outlet is an excellent way to reach your goals—without spending a dime!<br></p>\n\n<p><strong>But how do you get a reporter to write about you?</strong></p>\n\n\n\n<p>I spent the better part of a decade working as a tech journalist, where I endured pitch after terrible pitch from thousands of hopeful entrepreneurs and marketing executives, all trying to score some coverage from me. After giving coverage to hundreds of companies and turning down thousands of others, it's become apparent to me that <strong>most people don't know how to approach journalists.</strong></p>\n\n\n\n<p><strong>And that's a shame, because it doesn't take much to do it right.</strong> You don't need to hire an agency or get a communications degree—you just need to understand what works and what doesn't.</p>\n\n\n\n<p><strong>This course is a complete guide to getting your company featured in the press.</strong> It covers everything from building and leveraging relationships with journalists to reaching out cold and nailing the pitch. If you follow my advice, <strong>I fully expect that you'll get </strong><em class=\"redactor-inline-converted\"><strong>at least</strong></em><strong> half a dozen valuable press mentions</strong> over the next month or so.</p>\n\n\n\n<p><strong>Here are a few things you'll learn in this course:</strong></p>\n\n\n\n<ul><li>How to build and leverage relationships with reporters</li><li>How to find the right journalists to contact (the ones most likely to write about you)</li><li>How to build a compelling narrative around your brand</li><li>How to create a press kit</li><li>How to write a pitch that journalists respond to</li><li>How to handle negative publicity</li><li>A secret weapon to help you get press coverage in record time</li></ul>\n\n\n\n<p><strong>In addition to the content of this course, you'll get lifetime access to the private discussion board where I can answer any questions you have as you go along.</strong></p>\n\n\n\n<p>I'm confident that this course will bring you enormous value, and my confidence is backed by Udemy's 30-day money-back guarantee. If for any reason you're not satisfied, you'll get a full refund—no questions asked.</p>\n\n\n\n<p>Ready to get started?</p>\n\n\n\n<p><strong>Just click the \"Take This Course\" button, and I'll see you inside!</strong></p>", 
    "end_date": null, 
    "title": "How To Get Press Coverage For Your Business", 
    "price": "20.00", 
    "instructors": "Brad Merrill", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/689296_dd18_3.jpg", 
    "course_url": "https://www.udemy.com/pr-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-05T01:16:30Z"
}