{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Media Training Starter Series: 5 must have PR packages for Small Business</strong><br style=\"\">  \t                   1.  Become an Expert at Media Interviews - Media relations<br style=\"\">  \t                   2.  Media Interview Role Plays - Television Interview Tips<br style=\"\">  \t                   3.  Publicity Boost - The key to Public Relations Help <br style=\"\">  \t                   4.  Crisis Management the Fast Way - Crisis Control<br style=\"\">  \t                   5.  Your Media Policy - The Media Release and More  </p>  <p style=\"\">  \t <strong style=\"\">Starting a small business or a large business? Then grab this package.</strong><br style=\"\">  \t                 Become an expert at media interviews<strong style=\"\">:</strong><br style=\"\">  \t                 36 laser focused tutorial videos designed to help you prepare for your next media interview. Also learn key strategies to help you utilize the media to YOUR advantage, as well as some invaluable tips on what to do and what not to do when you are in front of the Television, radio or print media. <br style=\"\">  \t<br style=\"\">  \t                 Media interview role plays<strong style=\"\">:</strong><br style=\"\">  \t                 16 &quot;One on One&quot; video role plays specifically highlighting television interview preparation, traps to avoid and how to fast track progress. Brilliant Media Interview Tips.<br style=\"\">  \t<br style=\"\">  \t                 Publicity boost<strong style=\"\">:</strong> Gain free press publicity<br style=\"\">  \t                 A public relations gift. 10 detailed presentations that share the secrets of self promotion. Learn to identify story ideas about you and your business and then learn how to promote those ideas to the media. Publicity through the media can reap major financial rewards. It is a PR must.<br style=\"\">  \t<br style=\"\">  \t                 Crisis management the fast way<strong style=\"\">:</strong> Media training online.<br style=\"\">  \t                 Are you prepared for a crisis? Crisis management the fast way is an 8 video tutorial package that will teach you how to anticipate and prepare for a media crisis, and what to do during a crisis. <br style=\"\">  \t<br style=\"\">  \t <strong style=\"\">Y</strong>our media policy<strong style=\"\">:</strong><br style=\"\">  \t                 17 lectures guiding you through the process of planning, writing and implementing a media policy for your business. You may want to get free publicity, but be on the alert.<br style=\"\">  \t                 Unlike a crisis management plan, a media policy has broader references. Your company media policy should include the protocols for media interviews, setting up a media conference, writing and sending out a media release, setting up a media unit, choosing your media spokesperson and much more.<br style=\"\">  \t<br style=\"\">  \t                 Media training starter series offers bonus material<strong style=\"\">:</strong><br style=\"\">  \t                   •  Detailed notes<br style=\"\">  \t                   •  Quiz questions for information retention<br style=\"\">  \t                   •  E-book: 100 media training strategies  </p>  <p style=\"\">  \t          Anything to do with PR Public relations or media training is packed into this course. This course is your Online Public Relations friend.  </p>  <p style=\"\">  \t          I will leave you with this thought, if you are searching for these term. Free online publicity, Free press publicity, Get free publicity, Marketing your business, Promoting your business online, How to promote, Virgin media training, Training social media, Communication, Interview skills questions, Management of crisis, Crisis communications, PR campaign budget  Small business strategies then Media Training starter series is a must.  </p>  <p style=\"\">  \t              Remember: When you&#039;re in front of the media, it is your chance  to promote your business, your product, your sponsor, your brand and yourself.  </p>", 
    "end_date": null, 
    "title": "Media Training. Media. Public Relations. Marketing. PR.  ", 
    "price": "45.00", 
    "instructors": "Mark Aiston", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61048_e0a4_5.jpg", 
    "course_url": "https://www.udemy.com/media-training-starter-series/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-20T03:27:12Z"
}