{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Imagine knowing before a news interview starts, exactly what quotes of yours are going to end up in that newspaper or online publication. You can control not only your messages but your sound bites and quotes that get into final stories.</p><p style=\"\">You never have to be fearful of reporters again.</p><p style=\"\">This course is designed specifically for people who are about to do media interviews with print reporters and online journalists (There is no on-camera TV training in this course). Students will learn exactly how to shape a media message, answer questions from reporters and speak in sound bites. If you are nervous or uncertain about how to get through news media interview with a newspaper or text-based journalist, this course is specifically designed for you. The course has numerous specific videos outlining step-by-step the process you need to take in preparing for interviews. If you want to gain control of interviews and avoid career-damaging quotes, this media training course is designed for you. Course updated on </p><p style=\"\">Why go through even one more day lacking the skills you need to master print and online media interviews. Why take the risk of doing a bad or mediocre media interview when you could be giving great interviews, starting today. Sign up for this course now.</p><p style=\"\">July 24, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p>", 
    "end_date": null, 
    "title": "Media Training for Print/Online Interviews-Get Great Quotes ", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303898_9609_3.jpg", 
    "course_url": "https://www.udemy.com/media-training-for-print-interviews-and-online-publications/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-19T21:04:47Z"
}