{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">This course is about Publicity and Public Relations (PR) - how to get the attention of the media, what they&#039;re looking for, why you may want to generate more PR, who your audience is and what is the key message that you wish to communicate with this PR activity.</p><p style=\"\">A work booklet is included, a listing of PR sites and a press release template is included. The course will take about 30-45 minutes to complete. The course is structured into 10 steps that you can take to be successful in generating PR. As the tutor goes through the steps, fill out the work booklet and fill it in, as it applies to you in your business.</p><p style=\"\">This course is ideal if you are working for yourself (self employed) and you want to generate more publicity for your business. We cover ideas, how to approach journalists and the media, what they&#039;re looking for when running a story, the elements of what makes a good news story and what is news.</p><p style=\"\">No previous experience of the media or journalism is assumed. We give examples of some press coverage. It&#039;s not enough these days to &#039;just&#039; rely on advertising, or word of mouth to generate leads and raise awareness of your business... appearing in the press is free, it adds massive credibility, it can be worth thousands of pounds and there&#039;s no reason why your story shouldn&#039;t be &#039;out there&#039;. On and offline news resources are always looking for good features. Others are doing it - why not you?!</p><p style=\"\">If you&#039;re sick and tired of reading about your competitors and everyone else... then put yourself forward... new faces keep the publications fresh. Learn what it takes to harness the power of the media to generate free publicity for you and your business. This coverage can open doors and generate a whole host of additional new opportunities.</p>", 
    "end_date": null, 
    "title": "Planning For PR Success", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372456_9d7f_4.jpg", 
    "course_url": "https://www.udemy.com/planning-for-pr-success/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T15:54:00Z"
}