{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Do you want to </strong><strong>learn simple and free public relations and publicity plus a 90 day marketing plan so you sell more books, courses and services</strong>?  You are in the right place because this high quality and interactive course by Louise Anne Maurice of 90 Day Guru E-Learning was created for you and <strong>recently updated April 1, 2016.</strong></p>\n\n<p><strong>PR+ Marketing Plan for Coaches, Consultants, Online Teachers and Authors </strong><strong>is for you if:</strong></p>\n\n\n\n\n\n<ul><li>You see the money making potential of <strong>marketing your book, course or service as the only solution for your readers, students and clients </strong>but you want the best step-by-step guidance for how to get started.</li><li>You want <strong>self-publishing marketing best practices, marketing plan templates and marketing plan examples</strong> that have already been tested and proven to work.</li><li>You would like <strong>free publicity and public relations so that you can boost your book, course and program sales</strong> plus connect with your ideal target market prospects.</li><li>You would like to know how you can <strong>create a marketing plan that you'll follow without spending thousands of dollars.</strong></li><li>You are ready to use <strong>publicity and public relations to easily sell your books, courses, coaching programs and consulting services.</strong></li></ul>\n\n\n\n\n\n<p>*************************************************************************************************************</p>\n\n\n\n\n\n<p><strong>Why take</strong> <strong>PR+ Marketing Plan for Coaches, Consultants, Online Teachers and Authors?</strong></p>\n\n\n\n\n\n<ul><li>This is why you are here because you want a <strong>marketing plan designed for Authors, Trainers, Coaches and Consultants so you can sell more in the shortest amount of time without it costing you a small fortune. </strong></li><li>The best part is; every piece of <strong>free publicity advice, marketing plans and logical approach to public relations has been tested</strong>; none of this is theory.</li></ul>\n\n\n\n\n\n<p>**************************************************************************************************************</p>\n\n\n\n\n\n<p><strong>What is covered in</strong> <strong>PR+ Marketing Plan for Coaches, Consultants, Online Teachers and Authors?</strong></p>\n\n\n\n\n\n<ol><li>Discover the secrets of self publishing marketing for Authors, Trainers, Coaches and Consultants and learn how it can take your business to a new leveraged level; you sell more and work less.</li><li>Learn the publicity plan that costs you nothing plus discover free publicity and free advertising that helps you sell more books, courses, services and programs.</li><li>Uncover what public relations really is and how it can help you sell more books, courses, coaching programs and consulting services plus you will develop a public relations plan.</li><li>Create a marketing plan plus be guided through examples of marketing plans including exercises that help you complete a strategic marketing plan for both online and offline.</li><li>Walk away with a fully completed 90 day self-publishing marketing plan that helps you sell more books, courses, coaching programs and consulting services in less time.</li><li>Receive public relations coaching and consulting designed for Authors, Trainers, Coaches and Consultants who are unsure about whether they are ready to step out into the spot-light and be famous.</li><li>Follow a success formula to implement your self-publishing marketing, publicity and public relations plan so you sell more books, courses, coaching programs and consulting services.</li></ol>\n\n\n\n\n\n<p>****************************************************************************************************************</p>\n\n\n\n\n\n<p><strong>How does</strong> <strong>PR+ Marketing Plan for Coaches, Consultants, Online Teachers and Authors Benefit You?</strong></p>\n\n\n\n\n\n<ul><li>In this course, you learn the exact steps you need to know to <strong>create a marketing plan to help you sell more books, courses, coaching programs and consulting services in a short amount of time.</strong> </li><li>You receive a marketing plan formula that you can follow for success.</li><li>You get easy marketing templates and examples that only a professional with my background can give you.</li><li>You get the inside track on what you need to do to succeed online plus what you need to do to follow through.</li><li>If that's something you would like to achieve, you have selected the right course to take. If you complete this entire course and implement everything you learn <strong>you will have a completed 90 day self-publishing marketing plan that you can follow to sell more books, courses, coaching programs and consulting services</strong>.</li><li>Remember, it doesn't matter if you are new or already in full swing, I've been there and I can show you exactly what you need to do to make it happen.</li></ul>\n\n\n\n\n\n<p><strong> ****************************************************************************************************************</strong></p>\n\n\n\n\n\n<p><strong>When Can You Take </strong><strong>PR+ Marketing Plan for Coaches, Consultants, Online Teachers and Authors?</strong><strong></strong></p>\n\n\n\n\n\n<ul><li>What are you waiting for? If you’re looking for a course to learn simple and free public relations and publicity plus a 90 day marketing plan so you sell more books, courses and services, then look no further.</li><li>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</li><li>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; <strong>NO EXTRA COST TO YOU.</strong></li><li><strong>REMEMBER</strong>: If you are not completely satisfied, you can get a full money back refund, so long as you request it within 30 days of purchase – No questions asked.</li><li>Click on the <strong>\"Take This Course\"</strong> button and start learning instantly</li></ul>\n\n\n\n\n\n<p>****************************************************************************************************************</p>\n\n\n\n\n\n<p>Still not convinced? Make sure you watch some of the <strong>FREE PREVIEWS</strong> available to learn more about the course and more about me your instructor. Plus you can check out some of the reviews. Here is just one of the many examples:</p>\n\n\n\n\n\n<p>What people are saying about <strong>PR+ Marketing Plan for Coaches, Consultants, Online Teachers and Authors </strong>created by Louise Anne Maurice of 90 Day Guru E-Learning?</p>\n\n\n\n\n\n<p><em>\"Informative Hands-On Course - Excellent, engaging and lots of extra-goodies. I haven’t done a lot of marketing because it overwhelms me. This instructor shares a different yet simple approach to planning a 90 day marketing campaign plus shows the easy publicity and public relations. Great templates and material I will use over and over again.\"</em></p>\n\n\n\n\n\n<p><em>************************************************************************************************************</em></p>", 
    "end_date": null, 
    "title": "PR+ Marketing Plan Coaches Consultants Teachers Authors    ", 
    "price": "25.00", 
    "instructors": "90 Day Guru® E-Learning, Louise Anne Maurice", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512908_58d6_5.jpg", 
    "course_url": "https://www.udemy.com/self-publishing-marketing-publicity-public-relations/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T16:18:53Z"
}