{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<em>LATEST: Course Updated On September, 2015 To Include More Lectures:</em>  </p>  <ul>  \t<li><em>How to write better headlines that increase click-through rates</em></li>  \t<li><em>10 actionable strategies to get press coverage as early as this week</em></li>  \t<li><em>Press release example and template</em></li>  </ul>  <ul>  </ul>  <hr style=\"\">  <p style=\"\">  \t<em>* OVER 1,500 DELIGHTED STUDENTS HAVE TAKEN THIS COURSE</em>  </p>  <hr style=\"\">  <p style=\"\">  \t                                                            This course will teach you how to get publicity (PR) and press coverage for your business from podcasts, radio shows, books, industry publications, and even celebrities.  </p>  <p style=\"\">  \t                                                          The course is interview-based. In the course I interview Bert Martinez, a veteran of the publicity space. He shares many advanced tactics for generating publicity and press coverage for your business.  </p>  <p style=\"\">  \t                                                            The course is almost all video lectures and should take between 1-2 hours to complete. The course is split up into 17 tutorial lectures and a conclusion lecture. The 17 tutorials are from questions like how to get publicity for a business, a book, from celebrities, and much more.  </p>  <p style=\"\">  \t                                                            As the person interviewing Bert, I can share that I learned a tremendous amount from the interview. That is why I decided to make this interview into a course. I personally found it that useful and insightful. If you are anything like me, you will be very excited to go out there and try to implement some of the strategies Bert shares during the interview for how to get press coverage and publicity.  </p>  <p style=\"\">  \t                                          In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with private questions. I answer 99% of questions within 24 hours. I love helping students who take my courses and I look forward to helping you.  </p>  <p style=\"\">  \t                                      +++++++++++++++++++++++++++++  </p>  <p style=\"\">  \t                                                  MONEY BACK GUARANTEE  </p>  <p style=\"\">  \t<em>The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em>  </p>", 
    "end_date": null, 
    "title": "Publicity & Public Relations: Get Press Coverage Like A Pro", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208456_3337_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-publicity-and-press-coverage-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-01T09:27:59Z"
}