{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Are you an entrepreneur who could use the incredible free publicity that comes from getting featured in the media?</p>\n\n<p>What many people get right is that featuring in the media isn't as hard as it looks. What they get wrong is that it's MUCH HARDER. <br></p>\n\n<h5></h5>\n\n<h5></h5>\n\n\n\n<h5>Wouldn't it be fantastic if some of the best media coaches in the world revealed all their little-known strategies at a price that everyone (not just big business and the super-rich) could afford? </h5>\n\n\n\n<h5>Well they just have...</h5>\n\n<h5>'Deal With The Media with Sir Trevor McDonald' (aka Media Marketing for small businesses and startups) is a 6 module e-learning course that massively boosts your chances of getting noticed by the media, and becoming a trusted and accomplished media performer </h5>\n\n\n\n<h5>Through professionally produced videos, accompanying handbooks and bonus resources you'll discover <strong class=\"redactor-inline-converted\">how to get the media interested in you</strong> in the first place, and <strong>how to make the most of each and every media opportunity</strong> - opening the door to huge credibility and publicity.</h5>\n\n<h5>All videos are hosted by broadcasting legend Sir Trevor McDonald - the UK's most famous news anchor. </h5>\n\n<h5>If you've ever dreamed of getting yourself or your brand featured in newspapers, blogs or magazines, or getting interviewed on TV or radio this course will show you how it's done. We'll also show you how to ace social media too. </h5>\n\n\n\n<h5>Whether you just want to get noticed in the local media, grow your online following or follow in the footsteps of entrepreneurs like Richard Branson and Ariana Huffington who have used their skills as media performers to build multimillion dollar businesses without spending any money on advertising, this course is for you. </h5>\n\n<p>Learn at your own pace and come back and review the resources whenever you need to. </p>", 
    "end_date": null, 
    "title": "Sir Trevor McDonald's Media Marketing -Small Biz & Startups", 
    "price": "50.00", 
    "instructors": "Pete Walter", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/838298_9217_4.jpg", 
    "course_url": "https://www.udemy.com/media-marketing-for-small-businesses-and-startups/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-03T09:26:49Z"
}