{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Learn How to Craft News Hooks and Story Ideas That Land You Mega Media Exposure!</strong>  </p>  <p style=\"\">  \t  To really get the media exposure you deserve, you must get inside the heads of journalists, bloggers, and music reviewers. You need to understand life from their perspective and what gets their attention (as well as what ticks them off).  </p>  <p style=\"\">  \t  Only then can you craft the news hooks and story ideas that will lead to mega exposure for your music.  </p>  <p style=\"\">  \t  Here’s what you get inside this course:  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 1 </strong>—<strong style=\"\"> Your Expanded Definition of Journalism and the Media</strong>. We start with an important overview of what media and publicity are, and how the landscape has vastly changed in recent years.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 2 — An Insider’s View of the Music Media</strong>. Here I reveal what I learned during my 10 years running a music magazine. These are the crucial perspectives most self-promoters completely miss. Once you know what matters most to journalists, you’ll get a LOT more press.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 3 — The Power of PR Headlines and Subheads</strong>. In this lesson we take a deep dive into “news hooks” and “story ideas.” I critique several press release headlines to show you how to distill the essence of your pitch into as few words as possible.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 4 — The “Indirect Method” of Media Exposure</strong>. Very few “experts” teach this method of getting publicity, especially in the music world. If you truly put this untapped technique into action, you would double or triple your media exposure.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 5 — Twelve Questions to Help You Uncover Stellar News Hooks</strong>. Sometimes artists are too close to themselves to see all the media-friendly aspects of their lives and careers. Use these 12 simple worksheet questions to uncover the hidden gold in your story.  </p>  <p style=\"\">  \t  The bulk of the course is delivered via audio lessons with accompanying worksheets.  </p>", 
    "end_date": null, 
    "title": "The Music Publicity Insider's Guide", 
    "price": "20.00", 
    "instructors": "Bob Baker", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/290458_6adb_2.jpg", 
    "course_url": "https://www.udemy.com/music-publicity-insiders-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Public Relations"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-30T00:03:25Z"
}