{
    "selfpaced": false, 
    "topic_name": [
        "Foundations of Mathematics"
    ], 
    "description": "\n\n                    \n                    \n                    This course is aimed at those who aspire to study science or engineering foundation courses at university level. It draws upon the experience of staff from the Mathematics Education Centre at Loughborough University - a centre that has specialised for many years in mathematics teaching and mathematics support for science and engineering students who find the transition to university mathematics particularly challenging.\n\nThrough an accessible introduction to graphical and algebraic techniques students will start to think mathematically and develop an informal understanding of vital properties of points, lines and curves before formalising mathematically some of these essential notions. We adopt a user-friendly approach and describe mathematical processes in everyday language. New ideas are developed by example and discovery rather than by formal proof.  Further development will introduce the equation of a line and the significance of its slope and vertical intercept.\n\nThe course will close by reinforcing the importance of mathematics to science and engineering. It will pave the way into the study of calculus by explaining that engineers and scientists need to build upon the ideas introduced in order to describe, analyse and predict the behaviour of physical, biological and technological systems.\n\nWhat will you do ?\n\n\n  watch video explanations of key mathematical ideas\n  hear from leading scientists and engineers about the importance of mathematics to their work\n  watch fully worked mathematical examples\n  try to solve mathematics problems yourself\n  learn how to plot points and straight line graphs and  use these lines to solve problems\n  test your progress with quizzes\n  try to apply what you have learned\n  share ideas with other learners on the course\n  prepare yourself well for embarking upon a science or engineering course\n\n\nProfessor Tony Croft has written two blogs posts which talk about the role this free online course might play in helping to prepare young people for the mathematical demands of university courses in STEM subjects:\n\nTrying to make it all add up: preparing young people for the mathematical demands of university\n\nBreaking into science and engineering: strengthening mathematical foundations\n\n\n                                    ", 
    "end_date": "2016-09-26T00:00:00Z", 
    "title": "Getting a Grip on Mathematical Symbolism", 
    "price": 0, 
    "instructors": "Tony Croft", 
    "institution_name": [
        "Loughborough University"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "http://www.futurelearn.com/courses/mathematical-symbolism?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-05T00:00:00Z"
}