{
    "selfpaced": true, 
    "topic_name": [
        "Foundations of Mathematics"
    ], 
    "description": "\n\n                    \n                    \n                    קורס זה עוסק במתמטיקה של בית ספר תיכון מנקודת מבט מתקדמת. מטרתו העיקרית היא לחשוף סטודנטים לעתיד לאופן שבו מתמטיקאים רואים מקצוע זה, ובכך להכין אותם ללימודי מתמטיקה ברמת אוניברסיטה.\n\n                                            Syllabus\n                        משפט פיתגורס1 - משפט פיתגורס בשתי היחידות הקרובות נלמד על משפט פיתגורס מכמה נקודות מבט שונות. דווקא ההיכרות עם המשפט הבסיסי לכאורה תדגים איך במתמטיקה תמיד יש דרכים חדשות להבין דברים מוכרים. ביחידה זו נראה כמה הוכחות גאומטריות של משפט פיתגורס ונדון  בביטויו האלגבריהמשך משפט פיתגורס, פונקציותביחידה זו נסקור כמה משפטים על שלשות פיתגוראיות ונסיים את נושא פיתגורס. לאחר מכן נתוודע מחדש למושג הפונקציה ונדון במספר דרכים שונות להציג פונקציות.המשך פונקציותביחידה זו נראה איך מגדירים מתמטית מה היא פונקציה, נלמד מה גרף של פונקציה אומר על הפונקציה ונציג פונקציות בשני משתניםהפונקציות הטריגונומטריותביחידה זו נלמד את המשמעות הגאומטרית של פונקציות הסינוס והקוסינוס, נראה מספר זהויות שימושיות, נחקור כמה תכונות של פונקציית הטנגנס ונסיים בהצגת הפונקציות הטריגונומטריות ההפוכותמספרים מרוכביםביחידה זו נציג את המספרים המרוכבים ונלמד על התכונות הבסיסיות שלהם. לאחר מכן נראה איך פותרים משוואות במספרים מרוכביםהמשך מספרים מרוכביםביחידה זו נלמד על שתי ההצגות השימושיות של מספרים מרוכבים ואיך עוברים מהצגה אחת לשניה. לאחר מכן, נראה מספר שימושים של מספרים מרוכבים. נסיים את היחידה בהצגה של שורשי היחידה, שהם מספרים מרוכבים מאוד שימושיים עם תכונות יפות במיוחדחשבון דיפרנציאליביחידה זו נתוודע למושג הנגזרת, נדון במשמעות הגאומטרית של הנגזרת ונראה איך משתמשים בה בשביל לפתור סוג מסויים של בעיות מהעולם האמיתיחשבון אינטגרליביחידה זו נציג את האינטגרל ונראה את הקשר בינו לבין שטחים גאומטרייםאינטגרציהביחידה זו נלמד על הקשר בין אינטגרלים לנגזרות, נראה איך אפשר לנצל את הקשר הזה בשביל אינטגרציה ונחשב אינטגרלים של פונקציות אלמנטריותאקספוננטים ולוגריתמיםביחידה זו נלמד על פונקציות האקספוננט והלוגריתם, נראה את הקשר ביניהם ונראה מה הקשר בין כל זה לבין חשבון הבסדרות ואינדוקציהביחידה זו נלמד על סדרות מושג הסדרה באופן כללי ובפרט על חשבוניות והנדסיותהמשך סדרות, מתמטיקה מהחייםביחידה זו נלמד על סדרות נסיגה ובפרט על סדרת פיבונאצ'י, ונלמד על עקרון האינדוקציה ואיך אפשר להוכיח באמצעותו תכונות של סדרות. לסיום הקורס, נדון בבעיה מהחיים ונראה איך אפשר לנצל תובנות שרכשנו לאורך הקורס על מנת לפתורה\n                                    ", 
    "end_date": "2014-10-05T00:00:00Z", 
    "title": " Invitation to Mathematics     הזמנה למתמטיקה", 
    "price": 0, 
    "instructors": "Raz Kupferman, Itamar  Cwik  and Ehud de Shalit", 
    "institution_name": [
        "Hebrew University of Jerusalem"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/introduction-to-math", 
    "duration": "12 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-07-13T00:00:00Z"
}