{
    "selfpaced": false, 
    "topic_name": [
        "Foundations of Mathematics"
    ], 
    "description": "\n\n                    \n                    \n                    Mathematik: das ist Freude am Denken! Und mathematisch denken kann jeder! Wer an diesem Kurs teilnimmt, erhält seine regelmäßige Dosis an meditativen Denkaufgaben, spannenden Knobeleien und mathematischen Einsichten. In den Inhaltsgebieten Arithmetik und Geometrie werden mathematische Denk- und Arbeitsweisen vermittelt, beispielsweise Problemlösen, Begriffe definieren und Sätze finden und beweisen.\r\nWas lerne ich in diesem Kurs?\r\nIm ersten Kursblock werden wir uns mit folgenden Fragen befassen: Wie definiert man mathematische Begriffe? Wie findet man eigentlich mathematische Gesetzmäßigkeiten? Und wie beweist man diese? Welche Rolle spielen Annahmen in der Mathematik? Wie baut sich das Gebäude der Mathematik aus Definitionen, Annahmen und Gesetzmäßgikeiten auf? Fragen über Fragen, denen wir uns mit zahlreichen Experimenten widmen.\r\nIm zweiten Kursblock werden wir die Denk- und Arbeitsweisen aus dem ersten Block in verschiedenen Gebieten anwenden und dadurch festigen. In der Geometrie werden wir uns mit der Tätigkeit des Messens und dem Abstandsbegriff, mit Strecken, Halbgeraden und Geraden, mit Ebenen und Halbenenen und mit Winkeln befassen. In der Arithmetik schauen wir uns den Begriff der Teilbarkeit näher an, veranschaulichen Begriffe wie \"größter gemeinsamer Teiler\" und \"kleinstes gemeinsames Vielfaches\", untersuchen Primzahlen und Primfaktorzerlegungen und experimentieren mit Stellenwertsystemen.\r\nIm dritten Kursblock befassen wir uns mit grundlegenden mathematischen Konzepten: Was sind Mengen, Relationen und Funktionen? Auch hier werden wir uns den Begriffen und ihren Zusammenhängen mit grundlegenden mathematischen Denk- und Arbeitsweisen nähern. Experimentieren, erforschen, untersuchen, ergründen, Vermutungen anstellen, Vermutungen verwerfen, Vermutungen beweisen.\r\nIm vierten und letzten Kursblock machen wir uns noch einmal an zentrale Gesetzmäßigkeiten der Mathematik. Wie findet man solche Gesetzmäßgikeiten, und wie beweist man sie? In der Geometrie schauen wir uns schicke Sätze am Kreis an, in der Arithmetik nicht weniger schicke Sätze der Zahlentheorie. Mathematik pur, Mathematik anschaulich, Mathematik handgemacht.\r\nWelche Vorkenntnisse benötige ich?\r\nJede/r kann mitmachen, der mathematische Vorkenntnisse aus dem Gymnasium mitbringt. Und wenn Du nicht auf dem Gymnasium warst, aber gerne mitmachen möchtest: Dann trau dich! Man sollte natürlich schon mal mit Geometrie und Algebra zu tun gehabt haben. Vieles wird dann wieder aufgefrischt, denn wir machen dann nicht auf dem Niveau der 12. oder 13. Klasse weiter, sondern bauen die Teilgebiete, in denen wir arbeiten, noch einmal grundlegend auf. Oberstufenwissen zu Analysis und Linearer Algebra ist nicht notwendig!\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Mathematik Online-Kurs - Mathematisch denken!", 
    "price": 0, 
    "instructors": "Prof. Dr. Christian Spannagel", 
    "institution_name": [], 
    "commitment": "1-8 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://iversity.org/en/courses/mathematik-online-kurs-mathematisch-denken-april-2016", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2016-04-08T00:00:00Z"
}