{
    "selfpaced": false, 
    "topic_name": [
        "Foundations of Mathematics"
    ], 
    "description": "\n\n                    \n                    \n                    Mathematik: das ist Freude am Denken! Und mathematisch denken kann jeder! Wer an diesem Kurs teilnimmt, erhält seine regelmäßige Dosis an meditativen Denkaufgaben, spannenden Knobeleien und mathematischen Einsichten. In den Inhaltsgebieten Arithmetik und Geometrie werden mathematische Denk- und Arbeitsweisen vermittelt, beispielsweise Problemlösen, Begriffe definieren und Sätze finden und beweisen.\r\nWas lerne ich in diesem Kurs?\r\nIm ersten Kursblock werden wir uns mit folgenden Fragen befassen: Wie definiert man mathematische Begriffe? Wie findet man eigentlich mathematische Gesetzmäßigkeiten? Und wie beweist man diese? Welche Rolle spielen Annahmen in der Mathematik? Wie baut sich das Gebäude der Mathematik aus Definitionen, Annahmen und Gesetzmäßgikeiten auf? Fragen über Fragen, denen wir uns mit zahlreichen Experimenten widmen.\r\nIm zweiten Kursblock werden wir die Denk- und Arbeitsweisen aus dem ersten Block in verschiedenen Gebieten anwenden und dadurch festigen. In der Geometrie werden wir uns mit der Tätigkeit des Messens und dem Abstandsbegriff, mit Strecken, Halbgeraden und Geraden, mit Ebenen und Halbenenen und mit Winkeln befassen. In der Arithmetik schauen wir uns den Begriff der Teilbarkeit näher an, veranschaulichen Begriffe wie \"größter gemeinsamer Teiler\" und \"kleinstes gemeinsames Vielfaches\", untersuchen Primzahlen und Primfaktorzerlegungen und experimentieren mit Stellenwertsystemen.\r\nIm dritten Kursblock befassen wir uns mit grundlegenden mathematischen Konzepten: Was sind Mengen, Relationen und Funktionen? Auch hier werden wir uns den Begriffen und ihren Zusammenhängen mit grundlegenden mathematischen Denk- und Arbeitsweisen nähern. Experimentieren, erforschen, untersuchen, ergründen, Vermutungen anstellen, Vermutungen verwerfen, Vermutungen beweisen.\r\nIm vierten und letzten Kursblock machen wir uns noch einmal an zentrale Gesetzmäßigkeiten der Mathematik. Wie findet man solche Gesetzmäßgikeiten, und wie beweist man sie? In der Geometrie schauen wir uns schicke Sätze am Kreis an, in der Arithmetik nicht weniger schicke Sätze der Zahlentheorie. Mathematik pur, Mathematik anschaulich, Mathematik handgemacht.\r\nWelche Vorkenntnisse benötige ich?\r\nJede/r kann mitmachen, der mathematische Vorkenntnisse aus dem Gymnasium mitbringt. Und wenn Du nicht auf dem Gymnasium warst, aber gerne mitmachen möchtest: Dann trau dich! Man sollte natürlich schon mal mit Geometrie und Algebra zu tun gehabt haben. Vieles wird dann wieder aufgefrischt, denn wir machen dann nicht auf dem Niveau der 12. oder 13. Klasse weiter, sondern bauen die Teilgebiete, in denen wir arbeiten, noch einmal grundlegend auf. Oberstufenwissen zu Analysis und Linearer Algebra ist nicht notwendig!\r\nWie hoch ist der Arbeitsaufwand\r\nDu kannst dich entscheiden, wie aktiv Du dich in den Kurs einbringen möchtest - je nach Interesse und Ehrgeiz!\r\n1) Kiebitze wollen \"nur mal gucken\" oder mit dem mathematischen Denken erst einmal warm werden. Kiebitze schnuppern jede Woche in den Kurs, schauen sich eins, zwei Videos an und stöbern vielleicht einmal in den weiterführenden Bereichen. Hierdurch bekommen sie einen Einblick, was mathematisches Denken bedeutet, und sie erhalten Impulse, wo man Mathematik auch im Alltag findet und gebrauchen kann. Vielleicht bekommen sie dabei sogar Lust auf mehr! Aufwand: ca. 1-2 Stunden pro Woche\r\n2) Anpacker legen Hand an und erforschen aktiv Mathematik, haben aber keine rechte Lust auf zu viele Formeln. Für Anpacker heißt es: Ärmel hochkrempeln! Im MOOC lernen sie, wie man mathematische Situationen systematisch erforscht, wie man anschauliche Begründungen für mathematische Gesetzmäßgikeiten finden kann, und sie erhalten einen Einblick darin, wie man Abstraktes konkretisiert (und umgekehrt). Sie entwickeln ihre Vorstellungskraft zur Lösung mathematischer Probleme weiter und lernen, Vermutungen anhand konkreter Modelle zu untersuchen. Aufwand: ca. 3-4 Stunden pro Woche\r\n3) Formalisierer geben sich mit der Anschauung nicht zufrieden - sie wollen Formeln sehen! Formalisierer sind Anpacker, die zusätzlich auch noch das Spiel mit abstrakter Symbolsprache lieben. Sie lernen, formale Definitionen zu fassen und formale Beweise zu führen. Natürlich immer basierend auf tragfähigen Vorstellungen, die sie mit den Anpackern teilen! Aufwand: ca. 7-8 Stunden pro Woche\r\nDu möchtest ein Kiebitz in der Arithmetik sein, aber ein Anpacker in der Geometrie? Oder ein Formalisierer in der Arithmetik, aber ein Kiebitz in der Geometrie? Kein Problem - alles ist möglich! So kannst Du deinen individuellen Aufwand selbst wählen und dir diejenigen Inhalte zusammenstellen, die dich interessieren.\r\nErhalte ich ein Zertifikat?\r\nDu erhältst eine Teilnahmebestätigung, wenn du aktiv mitmachst. Wie das genau geht, wird in der ersten Woche erklärt.\n\n                                    ", 
    "end_date": "2014-07-28T00:00:00Z", 
    "title": "Mathe-MOOC: Mathematisch denken!", 
    "price": 0, 
    "instructors": "Christian Spannagel, Michael Gieding and Martin Lindner", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.iversity.org/courses/mathe-mooc-mathematisch-denken", 
    "duration": "15 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2014-04-14T00:00:00Z"
}