{"selfpaced": true, "topic_name": ["Economics"], "description": "\n\n                    \n                    \n                    Quels sont les liens entre les prix fonciers, les prix immobiliers et les prix pour l'usage des immeubles? Est-ce que les prix immobiliers permettent de comprendre les prix fonciers? Ou l'inverse? Quels sont les calculs faits par les opérateurs sur ces marchés? On a le sentiment que ces marchés sont liés les uns aux autres. Avec ce cours, vous comprendrez mieux comment. En passant, vous aurez acquis une meilleure compréhension des mécanismes économiques qui peut être utile dans d'autres domaines.\n\nUn cours d'économie qui ne présuppose aucune connaissance économique formelle autre que celle qui a été développée dans la première partie de ce cours, le cours Economie du sol et de l'immobilier I.\n\nNous aborderons:\n•\tLe calcul du promoteurs et du développeur foncier en général\n•\tL'offre et la demande sur les marchés et comment ils déterminent et font varier les prix\n•\tLa différenciation des sols selon leur situation urbaine\n\n                                            Syllabus\n                        AccueilInformations sur le contenu du cours, son organisation et le travail attendu des participant-e-sModule 7 - Prix du terrain à partir du prix de l'immeubleL'objectif de cette première semaine, qui est la septième en comptant depuis le début du cours Economie du sol et de l'immobilier, est d'établir le lien entre le prix d'une parcelle et le prix de l'immeuble qui peut prendre place sur cette parcelle; elle introduit pour cela le calcul du promoteurModule 8 - Liens entre prix fonciers et immobiliersAlors que le module précédent faisait dépendre le prix foncier du prix immobilier, ce module explore les liens entre ces deux prix qui peuvent aller dans les deux sens.Module 9 - Marché foncierEn examinant la confrontation entre le consentement à payer pour un terrain des promoteurs et le consentement à recevoir des propriétaires fonciers, on va progressivement comprendre le fonctionnement des marchés et la formation des prixModule 10 - Qualités normatives du marchéL'équilibre du marché ne profite pas à tous de la même façon. Comment apprécier cela? Et comment est-ce que cela change quand une autorité intervient dans le marché?Module 11 - Liens entre les marchésCe module présente le marché de la construction, le marché immobilier, le marché du logement et le marché financier, puis il établit les liens entre ces marchés.Module 12 - Économie et modèles de villeCe module porte sur l’impact de l’économie spatiale sur les modèles de ville, la contribution des approches quantitatives et qualitatives à la modélisation et les stratégies économiques pour étudier les structures profondes de la ville. Le module est donné par Michael Doyle, doctorant en architecture et les sciences de la ville, sous la direction de Professeur Thalmann. Conclusion de la deuxième partie du cours\n                                    ", "end_date": "2016-05-13T00:00:00Z", "title": "Economie du sol et de l'immobilier II", "price": 0, "instructors": "Philippe Thalmann and Michael Robert Doyle", "institution_name": ["École Polytechnique Fédérale de Lausanne"], "commitment": "", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/economie-sol-immobilier-2", "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-04-01T00:00:00Z"}