{"selfpaced": false, "topic_name": ["Economics"], "description": "\n\n                    \n                    \n                    All goods and services are subject to scarcity at some level. Scarcity means that society must develop some allocation mechanism – rules to determine who gets what. Over recorded history, these allocation rules were usually command based – the king or the emperor would decide. In contemporary times, most countries have turned to market based allocation systems. In markets, prices act as rationing devices, encouraging or discouraging production and encouraging or discouraging consumption in such a way as to find an equilibrium allocation of resources. We will construct demand curves to capture consumer behavior and supply curves to capture producer behavior. The resulting equilibrium price “rations” the scarce commodity. Markets are frequent targets of government intervention. This intervention can be direct control of prices or it could be indirect price pressure through the imposition of taxes or subsidies. Both forms of intervention are impacted by elasticity of demand. \n\nAfter this course, you will be able to: \n•\tDescribe consumer behavior as captured by the demand curve.\n•\tDescribe producer behavior as captured by the supply curve.\n•\tExplain equilibrium in a market.\n•\tExplain the impact of taxes and price controls on market equilibrium.\n•\tExplain elasticity of demand.\n•\tDescribe cost theory and how firms optimize given the constraints of their own costs and an exogenously given price.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\n                                            Syllabus\n                        Course OrientationYou will become familiar with the course, your classmates, and our learning environment. The orientation will also help you obtain the technical skills required for the course.Module 1: Scarcity, Allocation, and MarketsThe fundamental problem of scarcity challenges us to think about an allocation mechanism to determine what is produced and who consumes it. We will discuss scarcity and allocation mechanisms. In this course, we will focus on markets and prices as the solution to this resource allocation problem.Module 2: Government Intervention in MarketsMarkets are frequent targets of governments. This module will introduce government policy intervention into the market. This intervention can be direct control of prices or it could be indirect price pressure through the imposition of taxes or subsidies. Both forms of intervention are impacted by elasticity.Module 3: Firms, Production, and CostsThis module will introduce cost theory. Firms are interested in producing profits, which are the residuals when costs are subtracted from revenue. Earlier modules constructed demand curves. They give us an idea of how many units of product we can sell at different prices; this would be firm revenue. We will work to understand inputs, production, and costs.Module 4: Firm BehaviorThe firm goal of profit maximization requires an understanding of costs and revenues.  In this module, we will see how a firm optimally responds to a given market price by finding the profit maximizing output.  The level of profits at this maximum profit point will help determine short run equilibrium.\n                                    ", "end_date": "2016-06-27T00:00:00Z", "title": "Firm Level Economics: Consumer and Producer Behavior", "price": 0, "instructors": "Larry Debrock", "institution_name": ["University of Illinois at Urbana-Champaign"], "commitment": "", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/firm-level-economics", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}