{"selfpaced": false, "topic_name": ["Economics"], "description": "\n\n                    \n                    \n                    This opening module of the Power of Markets course covers the basic assumptions about market participants made by economists, the concept of opportunity cost, and the key determinants of supply and demand. We will then learn how to use the supply-demand framework to explain and predict market outcomes and to show how government policies affect those market outcomes. We will look at how quantity demanded and supplied respond to their key determinants in quantitative (elasticity) as well as qualitative terms. The last two weeks of the first module will investigate consumer behavior more closely and show how consumer choices are driven by the interplay of preferences and budget constraints. We will employ the consumer choice framework to examine investor choice as well as policies such as ObamaCare and school choice. Finally, we will also address the concept of how to distribute a given amount of goods across a society’s consumers in the most efficient manner.\n\n                                            Syllabus\n                        Week 1 - Supply and DemandBasic Assumptions About Market Participants and the Concept of Opportunity Cost. The Determinants of Demand and Supply.Week 2 - Supply and DemandUsing the Supply-Demand Framework to Predict and Explain Market Outcomes as well as to Show the Impacts of Government Intervention. Some Key Elasticities of Demand and Supply.Week 3 - Consumer ChoiceExplaining Consumer Choice Through Analyzing Consumer Preferences and Budget Constraints.Week 4 - Consumer Choice and the Benefits of Exchange Using Consumer Choice Theory to Analyze Investor Choice as well as Policies Such as ObamaCare and School Choice. Promoting Efficiency in the Distribution of Goods.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "The Power of Markets I: The Basics of Supply and Demand and Consumer Behavior ", "price": 0, "instructors": "Mark Zupan", "institution_name": ["University of Rochester"], "commitment": "", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/market-power", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}