{"selfpaced": true, "topic_name": ["Economics"], "description": "\n\n                    \n                    \n                    This course will employ a non-technical approach to analyze how governments use policy to influence a country's economy. Upon completing the course you should be able to discuss national debts and deficits, examine fiscal and monetary policy and their appropriateness to the situation of an economy, and anticipate the results of fiscal and monetary policies and structural reform on a country. These concepts will give you the tools to develop your own position in many current economic debates, such as fiscal stimulus vs. austerity, the merits of quantitative easing, the need for higher interest rates or the future growth path of many modern economies.\n\n                                            Syllabus\n                        Macroeconomy OverviewWe are surrounded by news and commentary on the macroeconomy.  To understand it, we need to grasp the meaning of GDP, inflation and unemployment and see what their “normal” levels are and how they relate to one another.  Though these levels and relationships are far from mechanical, they provide an essential foundation to understanding what governments are doing in a macroeconomy.The Fiscal Policy ToolWelcome to Module 2!  We will be going into fiscal policy, which is one of the key tools that authorities have to influence the economy and bring GDP closer to its ideal growth rate. It consists of changes in government spending and taxes. To try to gauge how much spending and taxes need to change to bring GDP to potential, we use two concepts: the multiplier, and crowding out. However, spending and tax revenues also move automatically across the business cycle, helping make the economy more stable. Thanks for being with us! Enjoy learning!Deficits, Debts, Myths and RealitiesWelcome to Module 3!\n \nNow we know how fiscal policy is supposed to work in the economy, to close recessionary or inflationary gaps. In this module we will get into the nuts and bolts of deficits and debts in the real world and I am sure we will have some interesting follow-up discussions!  How is it really used? What are government deficits and debts? When governments run deficits and need to borrow money, how and where do they do it? When are these deficits and debts more of a problem? This module will look at the US and other leading economies in recent years to answer these questions, clear up some common misconceptions, and point to what the most important concerns are with deficits and debts at the present time.\n \nGood luck and see you online!\nMonetary PolicyWelcome to Module 4!\n \nThis week we're tackling a fascinating issue, which is monetary policy, and I anticipate some very interesting debates. Monetary policy is the other main tool that governments can use to influence the economy. Monetary authorities work through the money supply and can use open market operations, their own lending rates and reserve or cash ratios to influence money markets and hence the real economy. Just as with fiscal policy, once the gap in the economy is identified, expansive monetary policy should be used in a recessionary gap and restrictive monetary policy in an inflationary gap. Monetary policy is superior to fiscal policy in many ways, but its greatest weakness is that it does not work nearly as well in recessionary gaps as in inflationary gaps.\n \nKeep up the good work!\nCombining Policies and Other Policy ToolsWelcome, Courserians, to our fifth module in the Understanding Economic Policy course! We have so many tools in hand now that we can spend our last sessions putting the pieces together and tackling real-world policy questions. There is little that could be more relevant, and I hope you will enjoy it. In the real world, fiscal and monetary authorities may move in the same policy directions or they may act in opposition to one another. We will explore what happens as fiscal and monetary policies interact in the real economy. Additionally, economic decision-makers have two other policies that they can use to influence the economy, which are exchange-rate policy and structural policy. We will discuss how these work, and what special complications and advantages they present. There is also a peer-evaluated assignment for this course, and it’s included in this module. You will use the Economic Policy Simulator, a free interactive exercise, to make policy for an unknown country.  Use all of the tools that we have learned together, and enjoy getting a chance to run a country! Thanks for your enthusiastic participation, and enjoy these last two modules of the course! Policymaking in the Wake of the Financial CrisisYou are now in the last module of our Understanding Economic Policymaking course!  Having reviewed the theory behind economic policymaking, we devote the last module to discovering what policymakers are actually doing in the leading developed countries of the world. We will discuss whether interest rates have been appropriate in a group of countries, and what the consequences are if they are not. We will also discuss quantitative easing, the main “unconventional” monetary policy, and anticipate some of its consequences. We will have a look at deficits and debt in some countries and use the tools to determine whether they are problematic; we will analyze the “austerity” policies applied in many European countries; and we will have a look at the combination of fiscal, monetary and structural policies being used in Japan, dubbed “Abenomics”. We´ll also consider the perils of policymakers´ aggressive pursuit of growth at a time when it is becoming more elusive. The final exam will have questions from this module and from each of the previous modules, so you can study your earlier quizzes to prepare. Good luck as you complete the course!  I´ve enjoyed getting to know you a little.  Warm regards.\n                                    ", "end_date": "2014-05-05T00:00:00Z", "title": "Understanding economic policymaking", "price": 0, "instructors": "Gayle Allard", "institution_name": ["IE Business School"], "commitment": "3-5 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/economic-policy", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-03-24T00:00:00Z"}