{"selfpaced": false, "topic_name": ["Economics"], "description": "\n\n                    \n                    \n                    This course provides a brief introduction to game theory. Our main goal is to understand the basic ideas behind the key concepts in game theory, such as equilibrium, rationality, and cooperation. The course uses very little mathematics, and it is ideal for those who are looking for a conceptual introduction to game theory.\n\nBusiness competition, political campaigns, the struggle for existence by animals and plants, and so on, can all be regarded as a kind of “game,” in which individuals try to do their best against others. Game theory provides a general framework to describe and analyze how individuals behave in such “strategic” situations.\n\nThis course focuses on the key concepts in game theory, and attempts to outline the informal basic ideas that are often hidden behind mathematical definitions. Game theory has been applied to a number of disciplines, including economics, political science, psychology, sociology, biology, and computer science. Therefore, a warm welcome is extended to audiences from all fields who are interested in what game theory is all about.\n\n                                            Syllabus\n                        Why Do We Need Game Theory, and What Does it Tell Us?Is it possible to analyze a wide variety of social and economic problems using a unified framework? In the first module, we address this question. We will see that the concept of rational decision making is useful, but it is not quite sufficient to provide governing principles. Motivated examples and some history of game theory will be provided. You will also be asked to play a simple card game to see how it feels to make your decisions strategically.Understanding Nash equilibriumThe basic solution concept of game theory is Nash equilibrium. In Module 2, we try to understand this central concept through various examples and ask the following crucial question: how do players come to play a Nash equilibrium?Rationality, Knowledge, and Evolution in GamesIn Module 3, we will dig deeper into the relationship between rationality and Nash equilibrium. We will consider the whole spectrum of possible intellectual capacities of players, spanning the range from unlimited ability for sophisticated reasoning to absolute zero intelligence. In the end, you will see that Nash equilibrium can emerge under a fairly wide range of intellectual capacities of players.Sustaining CooperationThe final module is devoted to the most important and most general message of game theory: rational behavior quite often leads to a socially undesirable outcome. We will first try to understand the basic reason for this, and then see how this insight of game theory has made fundamental impacts in the natural and social sciences. Finally, we will learn some general methods to overcome this problem.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Welcome to Game Theory", "price": 0, "instructors": "Michihiro Kandori", "institution_name": ["The University of Tokyo"], "commitment": "4-5 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/game-theory-introduction", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-27T00:00:00Z"}