{"selfpaced": true, "topic_name": ["Economics"], "description": "\n\n                    \n                    \n                    What is the structure and purpose of the FED? How does its action impact not just the US economy, financial institutions, but individual investors and savers alike? Are you aware of the relationship between the federal government and the Federal Reserve (FED)? Are you familiar with the federal open market committee (FOMC) and know what distinguishes it from the FED. This is the course for you!\n\nThe Federal Reserve is more than a 100 years old today and is the central banking system of the United States. As an institution, the FED’s decisions and policies impact our economy and our lives every single day.\n\nWith Europe and other countries now imitating and initiating Quantitative Easing measures that the US Fed has ALREADY implemented, the FED's impact and influence are truly global is nature.\n\nBy the end of this course, you should:  \n\nRecognize the role and structure of the Federal Reserve (FED).\n\tRecognize the role and structure of the Federal Open Market Committee (FOMC).\n\tDefine interest rate terminology:\n\tFED Fund Rate\n\t\tDiscount Rate (Window)\n\t\tLondon Interbank Offered Rate (LIBOR)\n\t\n\tIdentify the economic initiatives undertaken by the FED:\n\tTroubled Asset Relief Program (TARP)\n\t\tQuantitative Easing I, II, and III\n\t\n\tRecognize how the FED controls, owns, and manipulates the short end of the Yield Curve.\n\tGet familiarized with the product called Repurchase Agreement (Repo) and Reverse Repo.\n\tRecognize the process by which the Federal Reserve facilitates the fine-tuning of cash in the market using Repurchase Agreement (Repo).\n\n\n                                    ", "end_date": null, "title": "YCA2015.1.2x: Understanding the Federal Reserve", "price": 0, "instructors": "William Addiss", "institution_name": ["New York Institute of Finance"], "commitment": "1 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.edx.org/course/understanding-federal-reserve-new-york-institute-finance-yca2015-1-2x-0", "duration": null, "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-05-15T00:00:00Z"}