{"selfpaced": false, "topic_name": ["Design & Creativity"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                                    &gt; Design &amp; Creativity\n                                                            \n                            \n                                                \n                    \n                    \n                    Gamification is the application of game elements and digital game design techniques to non-game problems, such as business and social impact challenges. This course will teach you the mechanisms of gamification, why it has such tremendous potential, and how to use it effectively. For additional information on the concepts described in the course, you can purchase Professor Werbach's book For the Win: How Game Thinking Can Revolutionize Your Business in print or ebook format in several languages.\n\n                                            Syllabus\n                        Gamification and GamesGamification is a new field, but games are ancient. In this first module, we'll look at what gamification is, why organizations are applying it, and where it comes from. While there isn’t universal agreement on the scope of the field, a set of concepts are clearly representative of gamification. The second lesson explains why the concept of games is deeper than most people realize, and how game design serves as a foundation for gamification.Deconstructing GamesWhat exactly does it mean to apply game design principles in non-game contexts? In this module, we'll discuss how game designers approach their craft, and how to see any situation through the lens of game design. Then we'll examine the raw materials of games and gamification, known as game elements. We'll earn how to break down a game into its constituent parts and apply them to create gamified systems. Motivation and PsychologyGamification is a technique for motivation, so it ties very directly into psychology. This unit introduces the major psychological concepts relevant to gamification. The first lesson focuses on behavioral approaches and reward design; the second identifies the risks and alternatives to this approach.DesignGamification done well is a form of design. This module describes the design process, and provides a six-step  framework to apply to any gamification project. The second lesson identifies important considerations and options for developing creative, human-centered, thoughtful gamification solutions.ApplicationsThis module describes particular challenges and opportunities when applying gamification in two contexts: within an organization, and in social impact or behavior change environments.Gamification in PerspectiveThere are many legitimate limitations, concerns, and dangers from gamification. Some of them can be avoided through thoughtful design, but others must be considered directly in any implementation. The final lesson details gamification-related techniques that go beyond those covered throughout the course, and concludes with a look toward the future.\n                                    ", "end_date": "2016-08-01T00:00:00Z", "title": "Gamification", "price": 0, "instructors": "Kevin Werbach", "institution_name": ["University of Pennsylvania"], "commitment": "4-8 hours", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/gamification", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}