{"selfpaced": false, "topic_name": ["Design & Creativity"], "description": "\n\n                    \n                    \n                    In this course, you will learn how to design technologies that bring people joy, rather than frustration. You'll learn several techniques for rapidly prototyping and evaluating multiple interface alternatives -- and why rapid prototyping and comparative evaluation are essential to excellent interaction design. You'll learn how to conduct fieldwork with people to help you get design ideas. How to make paper prototypes and low-fidelity mock-ups that are interactive -- and how to use these designs to get feedback from other stakeholders like your teammates, clients, and users. Armed with these design-thinking strategies, you’ll be able to do more creative human-centered design in any domain.\n\n                                            Syllabus\n                        IntroductionA brief introduction to the topics and goals of this Interaction Design SpecializationNeedfindingThis module’s videos and assignment cover a really important topic: where can you get good design ideas from? Ideas that help you create meaningful designs that have a real impact on real people’s lives. Of course, good ideas come from lots of places. And wherever they come from, great. There are a few strategies I’ve found that are especially valuable, and that’s what we cover in this module’s videos. Given our focus on *real* people, we focus on going out, watching what people do, and talking to them. Check out the first video, describing participant observation. Combining observation with interviewing (the second video) provides a powerful foundation for needfinding and brainstorming.So what happens after you’ve observed a lot of stuff -- how do you connect the high-level needs to concrete design ideas? To help you bridge this gap, this module closes with a video on Creating Design Goals.Rapid PrototypingThis module's lectures introduce storyboarding and several strategies and media for rapid prototyping, including paper, Wizard of Oz, and video.  An important part of the creativity of a designer is to think about how you can rapidly prototype and get feedback on your ideas. Because it's almost never the case that the first idea you have will be the best. As a designer, you can learn the most when you're creating and getting feedback on multiple alternatives. Your work will nearly always benefit from thinking broadly to find the right design, and then from lots of polish to get the design right. Prototyping is also a great way to achieve common ground across the design team and other stakeholders. We begin with storyboards, paper prototyping and mockups.Students often ask about the relationship between needfinding and prototyping: how closely does one flow into the other? Ultimately the quality of your final design is the real measure and there are lots of ways to get there. While most design work benefits from prototypes directly informed by the needfinding process, it's not required. This module seeks to introduce you to doing human-centered design, and walk you through one path that such an approach could take. In both this Specialization and in real life, you are welcome to revise your ideas as much as you like. Heuristic EvaluationWith this module's videos, we turn our focus from brainstorming and prototyping to the concrete elements of interaction design. We introduce ten key principles of good design  -- like the importance of feedback and helping people recover from errors. We call these heuristics -- watch the first video here. I hope you'll find these heuristics practical and applicable to your work both inside and outside class. The lectures discuss these heuristics with a bunch of examples drawn from real-world designs. The goal is to illustrate the many ways that designs can be successful or run into trouble.  While heuristic evaluations (HEs) focus on issues that lead to improvement they can also identify areas we think show successful compliance with a heuristic\n\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Human-Centered Design: an Introduction", "price": 0, "instructors": "Scott  Klemmer", "institution_name": ["University of California, San Diego "], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/human-computer-interaction", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}