{"selfpaced": false, "topic_name": ["Design & Creativity"], "description": "\n\n                    \n                    \n                    This course provides a broad overview and substantial introduction to the theories and practices of current object design. Illustrated using recent work from established and emerging designers, this course provides a journey through the \"meaning-making\" processes that lead to iconic products, and a glimpse into the world of the designers who create them. During the second half of the Twentieth Century, the clearly defined profession of industrial design broadened and fragmented into a defuse array of specialized practices. Rather than confining their activity to shaping objects for everyday use, object designers have expanded their practice by borrowing from fields such as sociology, anthropology, art, film, and management consultancy, thereby uncovering new ways in which design can affect our lives.Beginning with a tour through design’s pluralism, this course delves into the power relations and semiotic structures which lie behind object making. It analyzes the process of design as it unfolds in the designer’s mind, on paper, through model making, and via other generative “thinking tools”. Examining the motivation of designers today, it reveals radical, avant-garde positions, as well as progressive, ethical, and sustainable practices that question the profession’s quiet complicity in unchecked mass consumption. This course concludes by examining the working contexts of today’s object designers, discussing the often \"slippery\" nature of client relationships, as well as the joys and perils of independent practice. Making Meaning: Designing Objects offers insight into the way today’s object designers operate, the theories that guide their decision-making, and the tools and processes they use to get results.\n\n                                            Syllabus\n                        Session 1: Mission Creep Product design goes pluralSession 2: Style And Substance The overt and covert politics of designSession 3: Reading And Writing Form The visual language of designed objectsSession 4: A Generative Process Design in the mind, on the page, and in the handSession 5: Radical Objects The challenging landscape of design's avant-gardeSession 6: The Aesthetics Of Progress Capturing the Zeitgeist in object formSession 7: Towards Socially Responsible Design Ethical approaches to a dangerous professionSession 8: Rules Of Engagement Exploring the realities of design practice\n                                    ", "end_date": "2017-01-26T00:00:00Z", "title": "Making Meaning: An Introduction to Designing Objects", "price": 0, "instructors": "Tim Parsons", "institution_name": ["School of the Art Institute of Chicago"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.kadenze.com/courses/making-meaning-an-introduction-to-designing-objects/info", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Kadenze"], "start_date": "2016-12-01T00:00:00Z"}