{"selfpaced": false, "topic_name": ["Design & Creativity"], "description": "\n\n                    \n                    \n                    What you'll learn\r\nYou'll form a strong foundation in UX, gain a deep understanding of how to find customer needs through different research techniques, and develop a real portfolio of UX work with deliverables like personas, storyboards, and empathy maps.\r\n\r\n14 Projects\r\nUnlimited Feedback\r\n4 Skype Sessions\r\n\r\n\r\nUX design isn't about making something pretty — it's about creating exceptional products that people want and need. The best way to do that is to deeply understand your users, and keep them in mind through every step of the design process. In this 4-week online course, you'll:\r\n\r\nLearn the basics of UX, and user-centered design\r\nExplore the core research techniques professionals use to gain customer insight, and get experience by working on hands-on projects\r\nDevelop your UX portfolio, creating deliverables like personas, storyboards, customer journey maps, &amp; empathy maps\r\nWork with your own expert mentor, with feedback on all your work and weekly Skype sessions\r\n\r\nUX Research is made for you\r\nTailor-made for people who want to add UX to their skillset, this course takes about 10 hours/week between online lectures, projects, &amp; mentor work.\r\n\r\nAspiring UX designers\r\nLearn how customer-centered design is changing the way businesses operate, and why customer research and validation are key to design success.\r\n\r\nProduct managers &amp; entrepreneurs\r\nCustomer research, insight, and understanding are the keys to a great product. Learn the tools of the trade and improve your own craft.\r\n\r\nPrint/graphic designers\r\nMove beyond print &amp; graphic design and become a well-rounded product designer! Learn how to make the jump into digital by delving into the foundations of UX.\r\n\r\n\r\n \r\nBy the end, you'll know all about user research, and have a toolkit of methods you can use throughout your career. You'll have a strong portfolio of work and crucial real experience to draw upon for interviews. Whether you want a career in UX/UI Design, or you just want to build better products, this course is the perfect next step.\r\n\n\n                                            Syllabus\n                        WEEK 1\r\nIntro to Product Design\r\nLearn the basics of UX design, and how a user-centered design process can help us make better products.\r\n\r\nWEEK 2\r\nCustomer Empathy - Artefacts\r\nLearn about the actual deliverables created in user research, and make your own.\r\n\r\nEmpathy Maps\r\nStoryboards\r\nCustomer Journey Maps\r\n\r\n\r\nUnderstanding Competitors\r\nNo product lives in a vacuum. Learn how to assess and report on competitors before you build your own products.\r\n\r\nHeuristic Review\r\nFeature Analysis\r\nFeature Matrix\r\n\r\nWEEK 3\r\nDefining the Problem\r\nNow that we have built empathy and a deeper understanding of our customers, we'll create some problem statements or “Points of View”.\r\n\r\nHypotheses and Validating assumptions\r\nLearn how to define hypotheses, test them, and measure what success looks like.\r\nWEEK 4\r\nTesting our Assumptions\r\nAs part of the design process we need to create artefacts to test our assumptions.\r\n\r\n\r\nQuantitative/Qualitative Testing\r\nLanding Page Testing\r\nUsability Testing\r\nData-driven design\r\n\r\n\r\n\r\nCustomer Empathy - Research techniques\r\nLearn how to build empathy with a toolkit of research techniques.\r\n\r\nContextual Inquiries\r\nDiary Studies\r\nCustomer Interviews\r\n\r\n\n                                    ", "end_date": "2016-07-08T00:00:00Z", "title": "UX Research & Strategy", "price": 299.0, "instructors": "", "institution_name": [], "commitment": "10 hours", "subject_name": ["Art & Design"], "course_url": "http://trydesignlab.com/ux-design-course/?utm_source=classcentral", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Designlab"], "start_date": "2016-06-10T00:00:00Z"}