{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>\r\n\tThere are certain mistakes in the photographic journey that just about every photographer falls victim to at some point. Learning those mistakes ahead of time and seeing how to avoid them and/or correct this can be an invaluable asset towards creating memorable images that tell the story you want to tell. That&#039;s why the <em>10 Common Photography Mistakes</em> video course was created.\r\n</p>\r\n<p>\r\n\tJames Brandon is a professional photographer who has traveled the world in search of beauty and perfect light. He has taught tens of thousands of photographers his techniques through his articles at Digital Photography School, his blog and newsletter, his best selling ebooks and now his video tutorials. His straight forward, in-depth and often humorous approach to teaching will make learning these photography mistakes fun and rewarding.\r\n</p>\r\n<ul>\r\n\t<li>Learn how to spot, fix and avoid the most common mistakes that photographers make with their images.</li>\r\n\t<li>Receive step by step instructions as James walks through (in-depth) each mistake in both Adobe Lightroom and Photoshop.</li>\r\n\t<li>Learn new advanced skills. </li>\r\n\t<li>Avoid future frustration and embarrassment!</li>\r\n\t<li>Watch the videos any time, at your leisure.</li>\r\n</ul>", 
    "end_date": null, 
    "title": "10 Common Photography Mistakes (and how to fix them)", 
    "price": "40.00", 
    "instructors": "James Brandon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/96622_87c5_5.jpg", 
    "course_url": "https://www.udemy.com/10-common-photography-mistakes-and-how-to-fix-them/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-24T17:05:58Z"
}