{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \tStart shooting with still photography film in 5 simple steps through this over 1-hour course. In this gentle introduction to film photography you&#039;ll learn about:  </p>  <ul style=\"\">  \t<li>Film Camera Types</li>  \t<li>Film Formats</li>  \t<li>Film Types</li>  \t<li>Film ISOs</li>  \t<li>Tips &amp; Tricks for loading your first few rolls of film</li>  </ul>  <p>  \tThe goal of this course is to demystify the idea and concept of shooting film, as many photographers today are familiar with only a digital format. Increasing your exposure to this exciting medium of photography will enhance your understanding of photographic principles, inspire you to try and see new things, and broaden your photography education.  </p>  <p>  \tYou should take this course if:  </p>  <ul style=\"\">  \t<li>You have a passion for photography</li>  \t<li>You&#039;re interested in starting to shoot film</li>  \t<li>You&#039;ve been too anxious to give film a go on your own</li>  </ul>  <p>  \tWith this course you&#039;ll have access to over 45-minutes of teaching content, and downloadable lesson guides, assignment, and activity PDFs. Plus, an online learning community to ask questions, share photos, and leave comments for other students and the instructor to engage with you.  </p>  <p>  \tEstimated time to complete course lectures and assignments is 3+ hours. This does not include film processing and development time.  </p>", 
    "end_date": null, 
    "title": "Analog Photography: How to Shoot Film in 5 Simple Steps", 
    "price": "20.00", 
    "instructors": "Christine Smith", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428904_012d_4.jpg", 
    "course_url": "https://www.udemy.com/film-photography-how-to-shoot-film-in-5-simple-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-22T06:53:00Z"
}