{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Learn how to use your digital camera to take amazing photos. Master your camera's shutter and Aperture, and use Shutter Priority and Aperture Priority modes for easy and amazing photography techniques.<br></p><p><strong></strong></p><p><strong>You will also learn</strong></p><ul><li><strong>how to \"see\" light<br></strong></li><li><strong>how to compose pictures easily<br></strong></li><li><strong>how to stabilize the camera<br></strong></li><li><strong>how to take creative pictures of people and landscapes<br></strong></li><li><strong>how to use your flash and reflectors to lighten up shadows<br></strong></li><li><strong>and lots more.</strong></li></ul><p><strong><em>What some of my workshop students have said about my Beginner Photography Workshop:</em></strong></p><p><em>\"I enjoyed Steve's style, and he presented the information in a way that is easy to understand.</em><em>\"</em><span> DV</span><br></p><p><em>\"Steve explained how the camera works, why I was doing what I was doing, how to change the modes, f-stops, etc. And what the result of the picture would be. When I left the workshop I was EXCITED to use my camera! I tried all of my newly learned techniques at home. I learned so much that day, and I was hungry for more!!!!!\"</em> VL</p><p><em>\"Steve explained things at a level I understood, using terminology I understood. And even more important, I was able to practice what was taught and see the results. If the results were not what I expected, Steve was available to explain what changes should be made to get the better shot.\"</em> GM</p><p><em>\"Steve is very knowledgeable about the subject matter and easily imparts that knowledge to students. He spends time explaining even the most basic concepts (like how do I pop the flash!). I had just gotten my camera and had no idea how to use it. I took some pretty great pictures after the workshop!\"</em> pmr</p>", 
    "end_date": null, 
    "title": "Beginner Photography Workshop", 
    "price": "20.00", 
    "instructors": "Steve Weinrebe", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651712_67e4_11.jpg", 
    "course_url": "https://www.udemy.com/1-hour-beginner-photography-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T21:11:11Z"
}