{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Welcome to Beginning DSLR Photography. Do you have a DSLR camera but have no idea how to use it? Maybe you've heard terms like shutter speed, aperture, and ISO, but don't have a good idea about what they do or how to control them?</p><p>Maybe you've started taking photos but they always turn out blurry and you can't figure out why so you put the camera down in frustration?</p><p>Don't worry! In this course we're going to cover all the essential basics. This course is a great foundation that will teach you the basic principles of how a camera works so you can start practicing and begin taking better photos right away. </p><p>In the first section we will cover each point of the exposure triangle and how they work together to create an image. Each video lecture demonstrates the topic and shows example photos to help drive home the information. </p><p>In the next section, we'll go over focus, various focus modes, focus points, and back button focus. You'll learn how to nail the focus every time! </p><p>Section 3 will cover composition, rule of thirds, leading lines, leading the eye, and balance. Once we understand the technical aspects of exposing a photo correctly, it's time to start getting creative with composition and crafting a shot that will stand out and be something more than just a snapshot.</p><p>Section 4 is all about light. We'll discuss and demonstrate the different qualities of light and how to harness light to craft an image.</p><p>Section 5 is about applying your knowledge and getting out to practice! I provide several exercises that utilize what we've learned in the previous lessons and will help you get well on your way to becoming an amazing photographer. </p><p>Every concept is explained and demonstrated in a way that is simple and easy to understand. Still have questions? I'm available through the wonderful Udemy platform to help you out. </p><p>Even if you've been taking photos for a while now, this course will cover foundational items that you may have not picked up on your own.</p><p>I teach this curriculum at my local technical college and I'm excited now to bring this course online!</p>", 
    "end_date": null, 
    "title": "Beginning DSLR Photography - Take Better Photos Today!", 
    "price": "50.00", 
    "instructors": "Mark Richardson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375648_f210_3.jpg", 
    "course_url": "https://www.udemy.com/beginning-dslr-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T15:44:39Z"
}