{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t    Are you stuck on Auto or Program mode? Has no one been able to explain apertures and shutter speeds to you? This course will teach you how to take control of your camera to shoot in aperture or shutter priority modes.  </p>  <p style=\"\">  \t    You will first learn what exposure is, and how your camera controls it using aperture, shutter speed and ISO. Then you will learn what both aperture and shutter speed are, why they are important and how you can confidently control them using aperture and shutter priority modes without missing your photos.  </p>  <p style=\"\">  \t    The course is designed to get you quickly and efficiently off auto and nothing else. You will get 30 minutes of concise video tutorials containing everything you need to know and nothing that you don&#039;t, quizzes to check you have understood each section, and 4 practical exercises to complete. Everything is replicated in the course workbook, so you don&#039;t need to take notes as you go through the videos.  </p>  <p style=\"\">  \t    This course is for you if you are a beginner DSLR user and want to understand exposure, aperture and shutter speed. You know you can get better and more creative shots if you go off auto, and you want a step-by-step hands-on guide showing you exactly what to do, when and why.  </p>", 
    "end_date": null, 
    "title": "Beginner's DSLR Photography - Get Off Auto Mode", 
    "price": "20.00", 
    "instructors": "Emma Davies", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/207158_fe93_3.jpg", 
    "course_url": "https://www.udemy.com/photography-get-off-auto-mode/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-29T11:11:33Z"
}