{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t<strong>Non è richiesta nessuna conoscenza preliminare!</strong>  </p>  <p>  \t<strong>Il videocorso &quot;colorimetria per tutti&quot; aiuta a comprendere in maniera facile i problemi della riproduzione colore dall&#039;originale al video sino alla stampa.</strong>  </p>  <p>  \t<strong>14 lezioni video per la durata complessiva di 90 minuti.</strong>  </p>  <p>  \t<strong>All&#039;interno di ogni lezione è inserito un pdf scaricabile con tutte le schermate della lezione stessa.</strong>  </p>  <p>  \t<strong>  Sono presenti pure 4 sezioni quiz per aiutarVi a valutare il Vostro grado di apprendimento.  </strong>  </p>  <p>  \t  Il videocorso &quot;colorimetria per tutti&quot; nasce dall&#039;esperienza di un lungo periodo di formazione e attività pratica in aziende, scuole ed enti.  </p>  <p>  \t  Lo scopo principale del videocorso &quot;colorimetria per tutti&quot; è di far conoscere e comprendere in maniera facile e completa i problemi della riproduzione del colore dall&#039;originale al video sino alla stampa, anche a principianti che lavorano nel mondo della grafica, della fotografia e in tutti gli ambiti dove si usa il colore.  </p>  <p>  \t  Molti di questi principi sono le basi fondamentali per poter operare nel settore della grafica, fotografia, design, architettura, web, moda... senza incorrere in gravi errori che vanno a scapito del lavoro finale e della Vostra professionalità.  </p>  <p>  \t  Imparerete a valutare le differenze tra il monitor e la stampa e molto altro ancora prima di imbattervi in spiacevoli sorprese.  </p>  <p>  \t  Se avete qualche dimenticanza, nessun problema: potete rivedere il video della lezione o rileggere le schermate del pdf.  </p>", 
    "end_date": null, 
    "title": "Colorimetria per tutti", 
    "price": "50.00", 
    "instructors": "Claudio Breda", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/278629_a077_5.jpg", 
    "course_url": "https://www.udemy.com/colorimetria-per-tutti/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-11T10:26:16Z"
}