{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<ul><li>Wanna make beautiful images, but you don't have a fancy DSLR?</li><li>Do you feel frustrated or disappointed with your photos... even guilty that you don't know what you're doing?</li><li>It's not your fault; you just need to spend some time learning what your camera can do,<br>...and some time practicing how to use this knowledge in the field.</li><li>90% of camera courses are targeted toward DSLR owners, not the humble photography enthusiast just starting out on the journey.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">This course is for</strong>: total novices, absolute beginners, and the technologically challenged. You must own a compact (point-and-shoot) camera, or a Micro 4/3rds, or a Bridge camera, so you can put this theory into practice.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Video lectures </strong>make up the bulk of this course, with <strong class=\"redactor-inline-converted\">3 exercises </strong>and a <strong class=\"redactor-inline-converted\">quiz</strong>. The final exercise requires downloading some freeware, and installing this on a Windows-based computer.</p>\n\n\n\n\n\n<p><strong>Topics include</strong>: image resolution &amp; size, JPEG vs RAW files, memory cards, focus, metering, program modes, aperture / shutter speed, plus how to get your photos off the camera and fix them on a computer.<br></p>\n\n\n\n\n\n<p>Finally, the tutor does not own your particular camera - hang, there's hundreds of models out there, and the course would be many hours long if it was to cover every possibility.<br>So, you will be required to <strong>download and read your camera's manual</strong>, to fully understand exactly what dials to turn and buttons to press.</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Compact Camera Course - understand your camera in 30 minutes", 
    "price": "20.00", 
    "instructors": "Ray Salisbury", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594532_f3e8_3.jpg", 
    "course_url": "https://www.udemy.com/compactcameracourse/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T01:33:03Z"
}