{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Erleben Sie die derzeit beliebteste Blitztechnik in allen Details! Live am Set im Fotostudio und on Location zeigt Profifotograf Mario Dirks, wie Sie Ihre Blitze für das optimale Foto richtig positionieren und einstellen. On the fly lernen Sie, wie Sie den Tag zur Nacht machen, ein Blitzgewitter für Mehl-Shootings und Action-Fotos entfesseln und vieles mehr. Schon mit einem oder zwei Blitzen setzen Sie Produkte stilsicher in Szene und gestalten appetitliche Food-Fotos. Und für das perfekte Fotofinish gibt es zusätzlich noch jede Menge raffinierter Rezepte mit Lightroom und Photoshop. Der perfekte Lernkurs für die ganz besondere Blitztechnik!</p><p><strong>- Das große Training für kleine Blitze mit Fotoprofi Mario Dirks</strong></p><p><strong><span></span>- Kreative Licht-Setups mit einem und mehreren Systemblitzen</strong></p><p><strong><span></span>- Blitztechniken für die Porträt-, Produkt-, Food- und Action-Fotografie</strong></p>Mario Dirks ist Profifotograf und Fototrainer. Zu seinen Lieblingsmotiven zählen Porträts, Landschaften und Architektur, seine Werke wurden bereits in zahlreichen Ausstellungen, unter anderem auf der Photokina, präsentiert. Regelmäßig leitet er Foto-Workshops und Seminare , zu denen er auch namhafte Fotografen aus ganz Deutschland als Gastdozenten einlädt. Für den  Objektiv- und Kamerahersteller SIGMA war Mario Dirks im Rahmen der »Our World«-Tour auf der ganzen Welt mit der Kamera unterwegs.", 
    "end_date": null, 
    "title": "Entfesselt blitzen! – Kreative Fotografie mit Systemblitzen", 
    "price": "50.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589618_8dd2.jpg", 
    "course_url": "https://www.udemy.com/entfesselt-blitzen-kreative-fotografie-mit-systemblitzen/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T16:57:21Z"
}