{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Over 1000 students just in the first 24 hours!</strong></p>\n\n<p>Have you ever asked yourself how and when a photographic image becomes an art? Do you feel a desire for your pictures to be unlike the million images produced every day and have that creative edge?</p>\n\n\n\n<p>There are many courses that teach you how to shoot.</p>\n\n\n\n<p><strong>With this course, you will learn how to create art.</strong></p>\n\n\n\n<ul><li>Learn how and why art can move and inspire!</li><li>Find out why you are more important than your kit of camera appliances!</li><li>Find new means of expressing your thoughts!</li><li>Leave the stereotypes and start bringing your ideas across!</li></ul>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>To be a photographer you need just a camera. But to be an artist, you need something more. Find out what!</strong><br></p>\n\n\n\n<p>Art moves our utmost feelings. Art is timeless. Like the very essence of life, art is a beauty but it may hide behind thick curtains. The very aim of this course is to be unlike courses you may have already followed. It will open your eyes to a beauty of higher order.</p>\n\n\n\n<p><strong>I will show you 62 masterpieces from 45 world masters of photography.</strong></p>\n\n\n\n<p>Learn how they did their most valued photographs trough memorable examples and exercises.</p>\n\n\n\n<p>My deep understanding and sincere desire for this course are to present to all photographers and beginners in the art of photography the most important thing to deal with – CRITERIA, those special hallmarks necessary! I will introduce to you dozens of masterpieces of the world photography from the past and modern day and show you their secrets.</p>\n\n\n\n<p><strong>I will show you things you can’t find in books and manuals.</strong> I will lead you on the paths to art and aesthetic. I will do my best to be clear in what I say and I will show you every single aspect of my ideas with visual and memorable examples.</p>\n\n\n\n<p>Аrt is not reserved only to famous photographers and I am here to help you!</p>\n\n\n\n<p><strong>See</strong> <strong>what students are saying:</strong></p>\n\n\n\n<ul><li><em>This course is like a private tour of an art gallery with an expert guide. / </em><em>Rachel Beaney</em></li><li><em>Astonishingly breathtaking! Any photographer, a beginner to master, will find this course to be an insightful gem. / David Bowman</em></li><li><em>I have known the basics of photography, but through this course, I gained a deeper appreciation for the artistic expression that photographs can provide. / Andrew Luttrell<br></em></li><li><em>There is a lot of value on the course so it could be seen several times. / Atanas Manolov</em></li></ul>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>DON'T FORGET: Udemy operates a 30-day full money back guarantee, no questions asked! If you're not happy with this course you can request your money back.</strong></p>", 
    "end_date": null, 
    "title": "Fine Art Photography - Break the Rules and Start Creating", 
    "price": "20.00", 
    "instructors": "Valery Poshtarov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711950_11e7_4.jpg", 
    "course_url": "https://www.udemy.com/fine-art-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-31T16:28:33Z"
}