{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Why make a course JUST on focussing?</strong></p><p>As part of SLR Coaching I deliver training occasionally on Saturdays to folk that can travel to me here in the UK. The first thing I teach these students regardless of ability is how to focus, and ALL of them say they learnt something new.</p><p><strong>What equipment to you need?</strong></p><p>Just your Digital SLR camera.</p><p><strong>How long will the course take?</strong></p><p>There's around 1 1/4 hours of teaching but don't expect to whizz through it all in one sitting. The best way to learn this is to watch each video and then go out and practice a technique before moving on. You could do it in a morning although I think it will be the kind of training you keep coming back to. It's not that it's hard, just that it won't make sense until you try it and realise how the different settings work.</p><p><strong>Why take the course?</strong></p><p>If you've ever taken what you thought was a great photo and then got back to your computer, blown it up on your screen and seen that it's out of focus, you'll know why you need this course. The rest of you will just have to take my word and let me spare you the pain!</p> <ul> <li>You'll get huge satisfaction from uploading great quality, pin sharp photos to social media</li> <li>No more mocking for your 'fancy camera' but poor photos</li> <li>Confidence to know what you're doing</li> </ul> <p><strong>Bottom line…</strong></p><p>This is the most detailed course you will find on how to master the most important photography skill - focusing. </p><p>If you're serious about taking great photos and keen to understand your camera more this course is an absolute must!</p><p>---------------------------------------------------------</p><p><em><strong>NOTE</strong> - In this training I show the settings for both <strong>Canon</strong> and <strong>Nikon</strong> cameras but no other brands. You should be able to work out where your settings are on another camera but i wanted to point this out.</em></p>", 
    "end_date": null, 
    "title": "Focusing - Master the most important photography skill", 
    "price": "20.00", 
    "instructors": "Adrian Salisbury", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576462_30a5_3.jpg", 
    "course_url": "https://www.udemy.com/focusing-master-the-most-important-photography-skill/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T11:10:23Z"
}