{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t Gracias al avance tecnológico que ha sufrido la fotografía con la llegada de la fotografía digital hoy en día se pueden crear imágenes espectaculares utilizando técnicas como la de alto rango dinámico o más conocida como HDR. Esta técnica se basa en la unión de varias fotografías de una misma escena. Dichas fotografías se toman con diferente exposición para captar el máximo detalle tanto en las luces como en las sombras y así conseguir un rango de exposición inimaginable en la fotografía analógica.  </p>  <p>  \tAdobe Photoshop es el nombre o marca comercial oficial que recibe uno de los programas más populares de la casa, Adobe Systems, junto con sus programas hermanos Adobe Illustrator y Adobe Flash, y que se trata esencialmente de una aplicación informática en forma de taller de pintura y fotografía que trabaja sobre un &quot;lienzo&quot; y que está destinado para la edición, retoque fotográfico y pintura a base de imágenes de mapa de bits.  </p>  <p>  \tEste curso lo imparte Rodrigo Erades, experto en los campos de desarrollo web y en fotografía. Maneja diferentes lenguajes y programas de desarrollo web como html5, css3, action script y programación para Adobe Flash. Freelance desde 2006 en ambos campos ha trabajado para clientes como e grupo PRISA, el país, as, cinco días, cadena SER o canal plus. En el campo de la fotografía ha trabajado para SEUR, remodelando su imagen corporativa y en otros proyectos como el de Vision Lab.  </p>", 
    "end_date": null, 
    "title": "Fotografía: High Dynamic Range Imaging", 
    "price": "35.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177592_e307_3.jpg", 
    "course_url": "https://www.udemy.com/fotografia-high-dynamic-range-imaging/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-06T00:23:58Z"
}