{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong style=\"\">Have you ever wondered what makes the difference between professional looking photographs and snapshots?</strong><br style=\"\"></p>  <p>  \t<em style=\"\">                                  In this beginner&#039;s course to photography, I will share with you simple techniques that can take your snapshots and change them into more professional looking photographs.</em>  </p>  <p>  \t                                  Not only will you have access to lectures, but you will also have <em style=\"\">an instructor that will answer questions, give feedback, and offer critiques</em> on a <em style=\"\">regular basis</em> to help <strong style=\"\">YOU</strong> improve.</p>  <p>  \t<strong style=\"\">                                    These techniques that I will share with you were the initial building blocks to the start of my successful photography business.</strong>  </p>  <p style=\"\">  \t      This introduction to the basic concepts of photography focuses on you and your camera.  </p>  <ul style=\"\">  \t<li>Know your camera - learn the basics of settings and modes and tips on how to use them effectively</li>  \t<li>Master basic composition - learn to MAKE and not just TAKE great photographs</li>  \t<li>See the world differently - learn about the interaction of light and shadow</li>  \t<li>Get results - learn to shoot landscape, portraits, and action shots with confidence</li>  </ul>  <p>  \t                                    Every single technique that I reveal in this course is something each person can do, no matter your skill level.  With continued practice, you too will see an improvement in your photos.  </p><p>__________________________________________________________________<br style=\"\"></p><p><strong style=\"\">Student Feedback:</strong></p><p><em style=\"\">&quot;By far one of the best courses I&#039;ve enrolled in so far.&quot; </em>- Amy J</p><p><em style=\"\">&quot;The instructor&#039;s skill and presentation style was great and she was able to clearly explain concepts. Great course!&quot; </em>- Aidan</p><p>__________________________________________________________________</p>  <p>  \t                                    There are no holds barred.  I will share everything I know. . . and as I find new tips and tricks, they will be added to the course – <strong style=\"\">AT ABSOLUTELY NO ADDITIONAL COST TO YOU</strong>.  This is a living course that will be continually growing.  </p>  <p>  \t                                    As well as the <em style=\"\">Udemy 30 day guarantee</em>, you also have my personal promise that you will complete this course (<strong style=\"\"><em style=\"\">which includes 3+ hours of lectures and resources</em></strong>) with knowledge enough to begin improving your own photos.  </p>  <ul style=\"\">  </ul>  <p>  \t<strong style=\"\">Don&#039;t delay any further. . .</strong>  </p>  <p>  \t<strong style=\"\">Enrol now!</strong>  </p>", 
    "end_date": null, 
    "title": "From Snapshots to Art: Improve Your Photography Today", 
    "price": "20.00", 
    "instructors": "Danielle Rochford", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371370_15fc_2.jpg", 
    "course_url": "https://www.udemy.com/photos-that-amaze-beginner/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T10:08:39Z"
}