{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>I wanted to share with other photographers how I add to my bottom line without raising prices. As most of you know competition is fierce and many coming into the profession as well as others desperate to stay in business feel offering the lowest price is the way to earn a living.</p><p> I disagree I prefer to be paid what I feel my product is worth, not that the low end of the market dictates. You might think I should simply raise my price to the level I want. Unfortunately it's not that easy.</p><p>This rush to the bottom has made it difficult to increase prices as the cost of doing business continue to rise. I had to develop a way to make more from every photo shoot I booked. This is where my Profit Designer System began. I learned to think out of the traditional photographers box and add in high profit options that not only make me money, the end product increase the value of the images I provide my clients. I help my clients to get full value out of every image I deliver and in turn they send more referrals.</p><p> The process is easy and requires only the tools you already use for post processing or that you can download for free. For a couple of the more difficult bonus procedures I provide several outsource options that I use myself.</p><p> Don't worry, there is no “traditional selling” involved. Just showing what can be done with the images you have already taken that will benefit your client. Providing real value is the best way to increase sales and profits from existing clients. Forceful selling is totally outdated.</p><p> If you prepare a small portfolio of samples and practice the layouts provided my Profit Designer system should work just as well for you. This could be the difference between photography as a part time hobby and being a full time professional.</p>", 
    "end_date": null, 
    "title": "How I Double my Profits Without Raising Prices", 
    "price": "20.00", 
    "instructors": "Jeffrey Truitt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596752_0a37.jpg", 
    "course_url": "https://www.udemy.com/how-i-double-my-profits-without-raising-prices/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T16:46:30Z"
}