{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t        This class is taught via nearly 2.5 hours of full professional filmed HD video, featuring crisp lighting and crystal clear audio. The course is divided into 18 organized and easy-to-follow sections. International award-winning photographer Dan Salvo will help both beginners and advanced photographers alike as he explains:  </p>  <p style=\"\">  \t        - Seeing your world like a true photographer  </p>  <p style=\"\">  \t      - The 4 big things that separate a photographer from the owner of a camera  </p>  <p style=\"\">  \t        - The 7 elements of technique that can make a photo amazing when used properly  </p>  <p style=\"\">  \t        - The technical camera settings that you actually need to know, presented in a way that actually makes sense (no thanks to your camera manual!), including exposure, aperture, shutter speed, and ISO  </p>  <p style=\"\">  \t      - Lenses, variable apertures lenses, bokeh, depth of field, camera shake, motion blur, and ISO noise  </p>  <p style=\"\">  \t      - The manual modes of your camera  </p>  <p style=\"\">  \t      - Dan&#039;s Order of Operations, a easy and simple workflow that Dan uses every time he shows up to capture a photograph in a new environment.  </p>  <p style=\"\">  \tAs a full time professional photographer and educator, Dan has taught this Part 1 class for nearly 3 years at his studio, reaching over 1000 students with 100% positive feedback. Now you can experience why it’s been such a hit by accessing the full course online.  </p>  <p style=\"\">  \t  The course includes a PDF of notes that you can follow along with and Dan touches on each point along the way.  </p>  <p style=\"\">  \t        Although DSLRs will be the primary focus of our training, any digital camera with manual controls will be sufficient for this course.  </p>", 
    "end_date": null, 
    "title": "Intro to DSLRs Part 1: How to Create Epic Photographs", 
    "price": "20.00", 
    "instructors": "Dan Salvo", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373006_cc89.jpg", 
    "course_url": "https://www.udemy.com/intro-to-epic-photography-and-dslrs/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-18T04:16:49Z"
}