{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>In diesem Kurs zeigt Thomas Leuthard, wie er seine Bilder macht und wie er eine Szene erarbeitet. Man kann Bild für Bild miterleben, wie das finale Bild zu stande kommt und er erklärt, was er jeweils gedacht hat, beim Auslösen. Es werden Fehler, Herausforderungen und Schwierigkeiten erklärt sowie viele Tipps gegeben, wie man zum finalen Bild kommt. Ferner bekommt der Betrachter auch einen Einblick in den Auswahlprozess oder erfährt, warum genau dieses Bild ausgewählt wird. </p><p>Dieser Kurs gibt ein spannender Blick hinter die Kulissen eines erfolgreichen Street Fotografen, welcher alle gemachten Bilder pro Szene zeigt und keine Geheimnisse hat. Alle wichtigen und auch unwichtigen Informationen werden verraten, damit jeder gleich vorgehen und lernen kann, wie man herausragende Bilder macht.</p><p>Der Kurs ist in 3 Kategorien (einfach, mittel, schwer) aufgeteilt, wo entsprechend eine Bild pro Lektion angeschaut wird. Es wird jeweils eine Kontaktabzug der meisten Bilder gezeigt und dann chronologisch durch die Bilder gescrollt, welche gemacht wurden, bis das finale Bild erreicht wird. Dieses wird in einer vorher/nachher Version gezeigt, um die Bildbearbeitung zu verdeutlichen. Am Schluss wird auf einer Lessons Learned Folie die wichtigsten Erkenntnisse beleuchtet. </p><p>Von einigen Lektionen gibt es eine Vorschau. </p>", 
    "end_date": null, 
    "title": "Kontaktabzüge: Wie ich eine Szene auf der Strasse erarbeite", 
    "price": "20.00", 
    "instructors": "Thomas Leuthard", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496462_c096.jpg", 
    "course_url": "https://www.udemy.com/kontaktabzuege/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-08T03:48:04Z"
}