{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Do you dream of impressing your friends with your photography?</strong></p><p><strong></strong>Finally the world's easiest way to take stunning photographs even if you've never picked up a camera before. </p><p>How?</p>  <p>  \t                                         Get the secrets from me, an award-winning photographer in the heart of Silicon Valley for 29 years, working with Apple, Google, Stanford, Intel, Yahoo, CEO's, authors and the Dalai Lama.</p><p>Here is what you'll get:</p>  <p>  \t                                                       1. <strong>Learn how to use any camera you own, doesn't have to be a fancy pants camera either. Finally learn how to see and work with light, and shoot from the best angle.</strong></p><p><em>2. How to create compelling compositions with a few tweaks to what you may all ready be doing.</em>  </p>  <p><strong>3. Learn how to love people with your camera to capture their unique essence. Discover pitch perfect timing when you're shooting people, in the first video here.</strong> </p>  <p>  \t                                         How to have fun while shooting so you stay relaxed and happy. This is the most important tip while photographing people.</p>  <p>4. <strong>See with fresh eyes in your own backyard and </strong><strong>while traveling</strong><strong>.</strong>  </p>  <p>  \t<em><strong>There's no theory here.</strong></em>  </p>  <p>  \t                                       This is hard-won advice after 29 years on the front lines of professional photography. You'll benefit from the expertise that clients paid me $500 an hour for.</p>  <p>  \t<strong>       Why take this course?</strong>  </p>  <p>  \t                                                       You won't have to go through the pain I had to when I first started shooting professionally.</p>  <p>  \t<em>     No one told me the secrets you're getting here.</em>  </p>  <p>1549 students from 32 countries both online and offline have seen their photography improve with these simple techniques.  </p>  <p>  \t                                                       Here's what they have said,  </p><p><em>\"It made me see in a new way.\"</em></p><p>- Reena Sakaria, USA</p>  <p>  \t                                                       “<em>I learned so much today, thank you it was so much fun!</em>\"  </p>  <p>  \t                                              - Virginie, Paris, France  </p>  <p>  \t                                                       “<em>I know how to use my new camera now.</em>\"  </p>  <p>  \t                                              - Emma, Sweden  </p>  <p>  \t<em>         \"Angle, timing, composition and lighting, I learned it all today. I feel renewed to see the world differently.\"</em>  </p>  <p>  \t                                              - Jacky Li, Canada  </p><p><em>\"I am so excited to experiment after what I learned today!\"</em></p><p>- Maggie Culver, United Kingdom</p><p><strong>See what students are saying who I've taught in my private photo safari sessions. There are 12 video testimonies on my youtube channel, just search Mary Bartnikowski on youtube and click on my Photography Reviews.</strong></p>  <p>  \t      You'll learn that a photographer is a painter in a hurry and that it's all about your vision not the number of your pixels.  </p>  <p>  \t          And not how much money you spent on the camera you're using.  </p>  <p>  \t                                              <em>You can use your point and shoot or phone to take this course.</em>  </p>  <p>  \t                                          Don't buy a fancy camera just to learn this practical advice. Its easier to start with what you have and grow from there.</p>  <p>  \t<strong>       You'll get my free ebook on <em>Secrets of Stunning Photography</em>, my life's work in 38 pages.</strong>  </p>  <p>  \t                                          <em>This book alone is worth the price of the course.</em>  </p>  <p>  \t                                                       You'll be inspired with simple to follow tips and real life examples of how to capture people, elephants, hummingbirds, and night shots.  </p>  <p>  \t                                                       You'll learn how to critique your shooting sessions so you'll come away with much better photographs, and a big dose of enthusiasm for photography and kickstarting your vision.</p>  <p>  \t                                                       The low price of $47 is far less than my private sessions for $300.</p>  <p>  \t<em>       You'll benefit from my 9 years of world travels</em> and humanitarian work, steeped in exotic cultures in 32 countries, shooting, writing, and teaching. </p><p>I've led programs at Apple Computer, Stanford University, Intel, University of Hawaii and worldwide.</p>  <p>  \t                                                     <strong>Go to my web site if you want one on one guidance.</strong>    </p>  <p>  \t                            Happy to help you get stunning photographs right now!  </p>  <p>  \t<strong>       All you need to get started is a camera (point and shoot, phone, or DSLR) and you'll be getting much better photographs today. </strong>  </p>  <p>  \t                                                       You can complete the 20 lectures in 90 minutes but it's best to take a few days to practice the solid gold advice in each 3 to 5 minute video. </p><p>Recently updated.</p>  <p>  \t<em>       I guarantee this course will improve your photographs by following the guidance and tips here.</em>  </p>  <p>  \t                                                     More Free Photo Advice: join me in my links section for more help.</p>  <p>  \t                                              Find me inside this course for live advice.  </p>  <p><em>Full guarantee on this course or your money back.</em></p><p><em>Enroll now and start getting amazing photographs today.</em>  </p>", 
    "end_date": null, 
    "title": "Learn Amazing Photography Tips with Any Camera", 
    "price": "50.00", 
    "instructors": "Mary Bartnikowski", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/103590_47ea_21.jpg", 
    "course_url": "https://www.udemy.com/amazingphotographysecrets/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-09T13:02:13Z"
}