{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>\r\n\t Today’s Canon flashes are amazing pieces of gear. They are really powerful and you can create stunning images with them, once you know how they all work together with your camera. You basically have a studio set up in your camera bag, and you can use multiple flashes to create stunning visuals.  I use them all the time in both my wedding/portraits, as well as commercial work.\r\n</p>\r\n<p>\r\n\t The Canon flash system gives you so many options, and learning what options work best in certain situations can really make your photographic life easy.\r\n</p>\r\n<p>\r\n\t This 4 week ONLINE workshop will consist of 4 weekly video classes, that you can watch at your own leisure.\r\n</p>\r\n<p>\r\n\t <strong>Class 1: The Basic of Canon Flash</strong>\r\n</p>\r\n<p>\r\n\t This class will cover your flash equipment and how it works. We will cover F-stop, shutter speed, and power output of your flash and how all 3 work together. We will also cover TTL/ETTL, auto and manual settings, and Sync Speed and how all of them work and when to use them.\r\n</p>\r\n<p>\r\n\t <strong>Class 2: Using Flash On Camera</strong>\r\n</p>\r\n<p>\r\n\t Use of your flash on camera. We will cover bounce flash, diffusers, bounce cards, fill flash. We will also cover how to bounce your flash to create stunning portraits.\r\n</p>\r\n<p>\r\n\t <strong>Class 3: Canon Flash Off Camera</strong>\r\n</p>\r\n<p>\r\n\t Did you know that most Canon cameras have a built in wireless flash system that allows you to shoot flash off camera?\r\n</p>\r\n<p>\r\n\t We will cover how to create stunning imagery by getting your flash off of your camera using a TTL cord.\r\n</p>\r\n<p>\r\n\t We will also cover how to use your built in wireless system to use your flash off camera.\r\n</p>\r\n<p>\r\n\t Use of your zoom on your flash in combination with your flash off camera to create wonderful 40’s style glam lighting.\r\n</p>\r\n<p>\r\n\t <strong>Class 4: Multiple Flashes, and use of wireless devices and filters</strong>\r\n</p>\r\n<p>\r\n\t This class will cover the use of multiple flash techniques using your built in flash system.<br>\r\n\t We will also cover the use of wireless flash options, including the new Canon radio wave system.<br>\r\n\t We will also cover the use of gels with your flash to balance your flash with available light.\r\n</p>", 
    "end_date": null, 
    "title": "Learn Your Canon Flash System", 
    "price": "20.00", 
    "instructors": "Kevin Focht", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/202894_b482_2.jpg", 
    "course_url": "https://www.udemy.com/learn-your-canon-flash-system/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-22T02:44:26Z"
}