{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t          Learn the dynamics of beginner photography from one of the worlds best! John Wollwerth is a world renown photographer who&#039;s work has been seen in the Washington Post, Minneapolis Tribune, Beaufort Lifestyle Magazine, and CBS news has requested to interview him for his unique approach to wedding photography.  His photographs have been purchased by companies more than 100,000 times!  </p>  <p style=\"\">  \t  Be inspired as John shares his deep and vast knowledge of composition with you, and teaches you to think outside the realm of the ordinary.  </p>  <p style=\"\">  \t          In this beginners course, you will learn the following from your instructor:  </p>  <p style=\"\">  \t          1. Basic camera functions, (what do the buttons do?)  </p>  <p style=\"\">  \t          2. What is aperture and how to use it to your advantage  </p>  <p style=\"\">  \t          3. What is shutter speed and in what circumstances do you use a slow or a fast shutter speed  </p>  <p style=\"\">  \t          4. What is ISO  </p>  <p style=\"\">  \t          5. How to choose proper natural lighting  </p>  <p style=\"\">  \t          6. Proper composition for great pictures  </p>  <p style=\"\">  \t          7. Putting the basic knowledge in this class to use.  </p>  <p style=\"\">  \t          This class is about 55 minutes in run time and is 100% video content with some quizzes to test your comprehension, and also some useful links to further explain things like aperture and shutter.  </p>  <p style=\"\">  \t          Don&#039;t learn photography from a hobbyist or an amateur, learn from someone who has decades of experience and national recognition. In the section on composition John describes at length many elements of composing a picture that many instructors ignore.  </p>  <p style=\"\">  \t          If you have any previous photography experience, and already understand the basics of camera operation, perhaps this class is not for you.  We will be offering a more advanced course in the near future.  </p>  <p style=\"\">  \t  Get inspired to create in this energetic class!  </p>", 
    "end_date": null, 
    "title": "Learn Basic Photography from a World Renown Photographer", 
    "price": "20.00", 
    "instructors": "Cinematographer Stephen Wollwerth", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396786_8e00_2.jpg", 
    "course_url": "https://www.udemy.com/photographybasics/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-17T21:32:35Z"
}