{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Are your photos boring? Blurry? Out of focus? Or just plain ol’ ugly? Are you getting frustrated with your camera’s results being different than what’s in your mind’s creative eye?</p>  <p>I understand what you’re experiencing and I can help – I promise. This course will help you first build a rock-solid foundation of the photography basics. Then I will show you how to take control of your photography experience.</p>  <p>Once you’ve mastered the fundamentals we’ll dive into the really good stuff: how to compose your photos to make them more interesting, more likeable, and more enjoyable for you and all the people who’ll look at your art. You’re going to shift from just another person with a camera to an accomplished photographer… and you’re going to love the process of getting from here to there.</p>  <p><strong>You are going to quit taking photos – and you’re going to start making great photos.</strong></p><p><strong> </strong>In this course I’ll show you how. You’re going to love my simple system for taking great photos – and it’s easy to remember and apply.</p>  <p>Finally, this course will ease into the technical jargon that scares many creative people away from photography: aperture, depth-of-field, shutter speed, exposure, and all those special settings away from the AUTO button on your camera.</p>  <p>In this course<strong> I’ll breakdown all the technical mumbo-jumbo</strong> into easy-to-digest and apply photography principles. In each section you’ll have experiments – not exercises – to practice, explore, and create new photographs on what you’ve just learned. And the best part? You can keep this course forever as a handy reminder of what you’ve learned.</p>  <p> You can do this. I’ll help! Let’s get started right now.</p>", 
    "end_date": null, 
    "title": "Learn Photography: A Simple System for Photography Starters", 
    "price": "20.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741386_daa3.jpg", 
    "course_url": "https://www.udemy.com/learnphotography/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T19:57:37Z"
}