{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t<em style=\"\">&quot;Det var akkurat et slikt kurs jeg ønsket meg. Flott å få kompendiet etterpå.&quot; </em>  </p>  <p>  \t<em style=\"\">&quot;Kjempebra kurs som jeg ville anbefalt videre til mennesker som er nybegynnere :)</em>  </p>  <p>  \t<em style=\"\">&quot;</em>Flott at leksjonene er delt opp i temaer. Ellers var det et veldig folkelig fotokurs.&quot;  </p>  <p>  \t<strong style=\"\">Nå kan du lære kunsten og vitenskapen bak å ta flotte bilder!</strong>  </p>  <p>  \t<strong style=\"\"></strong>Jeg har laget dette fotokurset på forespørsel fra Norges største Facebookside for hobbyfotografer, <strong style=\"\">Norge i bilder </strong>med en klar visjon:  </p>  <p>  \t    Å tilby et online fotokurs som personer uten noen fotoerfaring kan delta på for å lære kunsten og vitenskapen bak å ta fantastiske bilder - uten bruk av dyrt fotoutstyr og mye redigering.  </p>  <p>  \t<strong style=\"\">Hvordan?<br style=\"\">  \t</strong>Jeg har samlet 20 års fotoerfaring og redusert det ned til 10 praktiske fotograferingstips som du kan starte og praktisere allerede på ditt neste bilde. Disse tipsene har gitt meg over 80.000 følgere på sosiale mediene Instagram og 500px - de samme tipsene du nå kan lære til en kostnad av et måltid på byen.  </p>  <p>  \t<strong style=\"\">              Kurset er midt i blinken for deg som tar bilder enten med mobil eller speilrefleks</strong> - fotografi er 80 % motiv / sitasjon og kun 20 % teknikk. Det betyr at du nå har muligheten til å lære hvordan du blir i bedre stand til å ta bildene du alltids har drømt om.  </p>  <p>  \t<strong style=\"\">    Du får i tillegg et 73-siders kompendiet med alt innholdet til nedlastning.</strong>  </p>", 
    "end_date": null, 
    "title": "Lær å ta bilder som engasjerer!", 
    "price": "50.00", 
    "instructors": "Jørn Allan Pedersen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360696_6c6a_2.jpg", 
    "course_url": "https://www.udemy.com/10-gode-fototips/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T19:10:23Z"
}