{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>What would you give to stand shoulder-to-shoulder with Ansel Adams in the darkroom? To watch him wave his hand beneath focused beams of light as a reverse image of Full Moon over Half Dome burned into the paper's silver surface. No two prints would ever be precisely the same. He was as much an artist here, in the darkroom, as he was in the field.</p><p>As much as I love to keep my teaching focused on in-the-field technique and creative inspiration, at some point you have to address the other HALF of the art form. This is a course for wilderness photography enthusiasts dedicated to that other half of the craft. I hope this course is as much like that experience next to Ansel might have been. Except that in the place of a darkroom, we have a lightroom. Instead of Ansel, you have me.</p> <p>I have been shooting as a professional wilderness photographer for the past 15 years. I've been published in Time/Life, National Parks, Nature's Best, and National Wildlife.</p><p>I'm a purist. I started my first decade in photography shooting with slide film. Photo clubs made sure you followed rules! </p><p>So, if you want the guy who will give 200,000 Lightroom presets to make your images look just like his (over saturated and artificial as they may be) then I advise you look elsewhere. </p><p>This is for aspiring outdoor photographers who wish to train their eye (and hand) at editing their RAW images with ease and joy. For those who wish to truly be artists in the room of light. And to do so with as much simplicity and organization as possible, so that you can get back outside taking pictures, since that's what caused you to fall in love with this in the first place.</p><p>I believe you will see that it isn't about having profuse knowledge of every possible trick in the book, it is about acquiring a skilled hand with just a few essential tools.</p><p><strong>100-level </strong>1st hour - The essential stuff you MUST know so that your digital life doesn't become a monster and try to eat you in your sleep.</p><p><strong>200-level</strong> 2nd hour - This is the fun part. I walk you through recent images of mine made in the American Southwest demonstrating tasteful use of the essential tools you MUST know in Lightroom. I intentionally leave out plenty of tools for two reasons. One, I only USE the ones that we cover here. Two, it does you no service to waste your time teaching you things you don't need to know.</p><p>This is everything you need to know and none of the other shenanigans. </p><p>See you inside the Museum of Art!</p><p>Paul</p>", 
    "end_date": null, 
    "title": "Mastering Lightroom for Outdoor and Nature Photographers", 
    "price": "20.00", 
    "instructors": "Paul Hassell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526320_a746.jpg", 
    "course_url": "https://www.udemy.com/lfu-lightroom-for-nature-photographers/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T21:00:15Z"
}