{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>\"Very comprehensive and informative, this course has exceeded my expectations!!! The instructor is very engaging and makes it interesting and so easy to learn!! Thank you William!!\" - <strong>Cindi-Rose Soutter</strong><br></p><p>Despite how much I learned about cameras and all the technical stuff, <strong class=\"redactor-inline-converted\">my photography never improved</strong> until I learned to see the world around me as a photographer sees. And that's what this course is about.</p>\n\n<p>If you're into all the technical things about photography <strong class=\"redactor-inline-converted\">then this course isn't for you.</strong> If you're into learning how to SEE the world differently and learn how to apply that to <strong class=\"redactor-inline-converted\">rock your world photography!</strong> then dive right in!</p>\n\n\n\n\n\n\n\n\n\n<p>Check out the free previews if you're not sure and remember that you have a <strong class=\"redactor-inline-converted\">100%, no questions asked, money back guarantee!</strong> Udemy is a safe, fun and productive learning platform, no matter who's course you take.</p>\n\n\n\n\n\n<p>Don't be content to just take pretty pictures, <strong class=\"redactor-inline-converted\">ROCK YOUR PHOTOGRAPHY!!</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>\"Loved this course! Easy to understand - and lots of great tips.\" - <strong class=\"redactor-inline-converted\">Kendra</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\"I found this course very helpful...\" - <strong class=\"redactor-inline-converted\">Carol Turner</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"Mr. William Sinclair is very knowledgeable and has put together a course on Master class in Photography for Beginners [<em>and everyone else</em>] which is very thorough and is very easily comprehensive to follow.\" - <strong class=\"redactor-inline-converted\">Patrick Rodrigues</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"I loved this course! The instructor was knowledgeable and passionate about photography and it came through in his presentation. Great illustration of some of the rules of composition. Very helpful for anyone looking to get started or review the basics. I highly recommend this course.\" - <strong>Dr. Kevin Maples</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"William has condensed over 40 years of experience into a course that will give you instant results.   Utilizing a phone camera to take great images is highly appealing, especially as DSLR's are expensive, bulky and not always at hand for that great shot!  This course is well presented in a simple, friendly and engaging style. It is packed full of information that until now, never quite clicked for me.  Among the great visuals, and clear instruction are tips and tricks that you can start using today. Including, How by changing your location and perspective you can re-frame your quick snaps into a professional looking photographs. There is also advice on:  How to compose an image How to control your camera How to get that creative shot How to play with exposure and DOF Even how to make money from your new hobby!  This course is super encouraging for those who have never shot an image before. I can highly recommend this course.\" - <strong class=\"redactor-inline-converted\">Robin Slee</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So, Who Else Wants To Easily Learn Great Photography</strong><strong class=\"redactor-inline-converted\">?</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Are You Into Photography? </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Do you enjoy photography but some things just confuse you?<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What If You Could Take Photographs That Made People Say, \"WOW! I LOVE THAT!\"</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"<em class=\"redactor-inline-converted\">Most beginning photographers don't even know that they are failing!</em>\"<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you want to learn how to <strong class=\"redactor-inline-converted\">take better photographs</strong>, even with your iPhone or smartphone, and you don't want the hassle of learning all the technical jargon or plowing through books or manuals, then <strong class=\"redactor-inline-converted\">this Photography Course for beginners is for you</strong>!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Take better pictures right now</li><li>Impress your boss, your friends, AND YOURSELF with your new skills.</li><li>Improve your photography related hobby by improving your photo taking skills.</li><li>Give your family and friends your amazing new photographs as gifts.</li><li>Make extra money selling your prints or using your new photography skills.</li><li>Enjoy a new outlet for your creativity.</li><li>Enjoy a hobby that can excite you yet also relax you.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Photography is <em class=\"redactor-inline-converted\">not </em>about all the technical stuff</strong>, it's about seeing. Seeing what's around you, subjects that captivate your heart and <strong class=\"redactor-inline-converted\">capturing a breathtaking memory of it to preserve forever.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course, I'm going to coach you on how to develop your eye through the essential and basic, step by step, building blocks of great photography. I'll hold your hand until you're ready to fly.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>These are the same basic essentials that professional photographers use every day to capture the world around them in stunning images. It's easier than you may think.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>After taking this course, you will have the knowledge and skills needed to take amazing images of whatever YOU love to photograph! You will also have the knowledge to make extra money by selling your photography without all the hassles of marketing.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">We are going to talk about</strong>:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>How to develop your eye to see like a photographer sees - <strong class=\"redactor-inline-converted\">this is crucial.</strong></li><li>The techniques you need to <strong class=\"redactor-inline-converted\">create visually compelling photographs</strong></li><li>Understanding light and how you can use it to create mood and definition</li><li>How to put it all together to create the WOW FACTOR in your images</li><li>And SO MUCH MORE! Nothing is left to chance.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Complete 100% Money Back Guarantee</strong>. If it doesn't work for you - Return it!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you're still not sure, start by watching the free preview lessons. They're free.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Who Am I?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Hi, I'm William Sinclair and I've been involved in the photography industry for over 40+ years and I've taught many people over those years how to improve their photography. I'd love to help you.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Are You Ready?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you already know this is something you want to do....</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then, let's get going!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Join the others who have already started taking this course and have used it to improve THEIR photography and even their photography related hobby!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Remember, you can't use what you don't know :-(</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What kind of pictures will you take after you take this course? :-)</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So, Let's Get Started! Click on \"Take This Course\" now.</strong><br></p>", 
    "end_date": null, 
    "title": "Masterclass In Photography for Beginners", 
    "price": "20.00", 
    "instructors": "William Sinclair", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650626_2e33_3.jpg", 
    "course_url": "https://www.udemy.com/the_essentials_of_photography/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-25T21:19:17Z"
}