{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>The best way to learn the art of photography is by watching a master artist at work.</strong> In Masters of Photography: People and Landscape—eight lectures taught by four top National Geographic photographers who represent the gold standard of photography—you’ll gain unprecedented access to true masters, watching and learning from them as they work. </p>\n\n<p>Travel from Kansas to Scotland to learn how to tell a moving photographic story about a location, led by Jim Richardson, whose work has been seen in publications worldwide. </p>\n\n<p>Michael Yamashita, 30-year award-winning National Geographic photographer, shares tips for shooting simple but effective landscapes—including the use of light, composition, negative space, sense of scale, leading lines, S-curves, and the rule of thirds. </p>\n\n<p>Award-winning National Geographic staff photographer Jodi Cobb provides insight about how rewarding it can be to photograph people and demonstrates how to take photographs that explore the human condition. </p><p>Ira Block, an internationally acclaimed photojournalist, gives you step-by-step instructions on how to incorporate people and interact with subjects even when conditions are not in your favor. He also discusses how to capture people in authentic moments and reveals tricks for taking advantage of intriguing backgrounds, lighting, and atmospherics. </p>\n\n<p>Beyond revealing professional secrets, this course provides a toolbox overflowing with techniques you’ll put into practice every time you lift your camera.</p>", 
    "end_date": null, 
    "title": "National Geographic Photography: Landscape & People", 
    "price": "40.00", 
    "instructors": "The Great Courses, Jim Richardson, Michael Yamashita, Jodi Cobb, Ira Block", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822288_0f6d.jpg", 
    "course_url": "https://www.udemy.com/national-geographic-photography-landscape-people/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-14T22:13:12Z"
}