{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p> Welcome to Ten Top Tips - Be More Creative With Your Camera! This is a short course to give you my Ten Top Tips and explain why they will make you a better photographer. With <strong>over 25 years experience as a professional photographer</strong> I have designed these Top Tips to give you an encouraging start. Learning  to use your camera in Manual Mode and freeing yourself from letting your camera making choices for you will allow you to be more creative with your camera. I've kept my language simple and avoided using jargon as much as possible so that if English is not your first language it will be easy enough to understand (and I have had some good feedback from people telling me I am easy to understand.) All the photos and video used to demonstrate my teaching are taken by myself or my wife (I'm not someone who teaches photography by using other peoples photos, except for some special illustrations.)<br></p><p>You will gain a fundamental understanding of your camera and how you can be more creative with your photography. I frequently run photography workshops with people who own modern, high tech, expensive camera equipment and shoot all their photos on auto. In this course I will teach you how to break free from just using your camera's auto modes and how you can be more creative shooting in Manual Mode. Any camera that has a Manual Mode (and that's most cameras) is suitable to sue with this course.</p><p>You will learn about the exposure triangle - ISO, Aperture and Shutter Speed, and how to use the camera's exposure meter to create well exposed photographs in any situation. I will teach you how to start appreciating different lighting conditions and how to take better photos no matter what the light is like. You will also learn how our eyes see differently than our camera and why this is an important concept for photographers to grasp.</p><p>People who enjoy photography are usually visual learners so I have designed this course to be as visually stimulating as possible. Ten Top Tips is mostly presented with video, including lots of photographic examples, diagrams and animations to help illustrate the teaching. There are also downloadable .pdf files with the course exercises so you can load them to your mobile device or print them out so you can use them anywhere.</p><p>Throughout the course I have included a number of exercises for you to follow. After you have watched the lecture you can then complete the exercise. This experience will give you a better understanding of the concepts and help you to remember the lesson.</p><p>There is no time limit to the course and I would encourage you to take time to complete each lecture and exercise as you feel comfortable to. Even repeat a lecture and exercise if you are not sure that you are understanding the teaching.</p><p>It does take time to learn to operate a camera manually, but I encourage you to persevere as it is rewarding. As you study, do the exercises and practice the teaching in this course you will be more creative with your camera. </p>", 
    "end_date": null, 
    "title": "Photography: 10 Top Tips - Be More Creative with Your Camera", 
    "price": "20.00", 
    "instructors": "Kevin Landwer-Johan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519912_da30_2.jpg", 
    "course_url": "https://www.udemy.com/photography-10-top-tips-be-more-creative-with-your-camera/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T04:15:01Z"
}