{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t        Paul's motivational JUMPSTART into the world of outdoor photography is a unique blend of practical hands-on lecture, ideas for creative inspiration, and Q and A from a live audience who asks the questions you want to know. Count on having a lot of fun learning from Paul's vibrant teaching style, and then get outside on your next adventure taking great photos!  </p>  <p>  \t<strong>This is an ongoing photography course, and you have lifetime access. New illustrations and assignments will be added to this course as it becomes available or as needed for explanation. If you have something you want to see, please don't hesitate to let me know. I am here to launch you as far as I can into this wonderful world of wilderness photography!</strong>  </p>  <p>  \t      For those of you who don't have 6-weeks to sit in a boring classroom, we'll do it all in ONE DAY!  </p>  <p>  \t      This course is for <strong>beginners who are serious</strong> about learning it right and in a tangible way the first time. This is <strong>not for casual shooters</strong> who just want to take a better snapshot of their family. This is for those who want to really <strong>be artists with their camera</strong>.  </p>  <p>  \t      You will need to have your camera out in front of you. Be prepared to practice, practice, practice as the course progresses.  </p>  <p>  \t      I deliver this time-tested <strong>Jumpstart</strong> course in three sections; CAMERA CLASS, PHOTOGRAPHY, and PROBLEM SOLVING.  </p>  <p>  \t      - CAMERA CLASS: You have to learn this gadget before you can create those artistic masterpieces of this wild planet. Look forward to getting off of that pesky green Auto setting forever after this morning session.  </p>  <p>  \t      - PHOTOGRAPHY: It's all about the Light, baby!  </p>  <p>  \t      - PROBLEM SOLVING: After this section, “When you're photographing on your own, and there's no one to look over your shoulder and critique, you can basically teach yourself.\"  </p>  <p>  \t      This is a one-day intensive course. Although, you can break it into two days to allow more time for everything to digest. Either way, most importantly, TRY everything we cover on YOUR OWN CAMERA as you progress through the course. Don't take tons of notes… JUST TRY IT!  </p>  <p>  \t<em><strong>Join Paul in this LIVELY ongoing classroom experience. The flame of passion you currently have for photography will be fanned into a blazing inferno.</strong></em>  </p>", 
    "end_date": null, 
    "title": "Photo Education for Outdoor Enthusiasts - JUMPSTART", 
    "price": "20.00", 
    "instructors": "Paul Hassell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/258474_345c_2.jpg", 
    "course_url": "https://www.udemy.com/lfu-jumpstart/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-09T17:23:51Z"
}