{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<blockquote style=\"\"><em><br></em></blockquote>  <p><strong>Photography - Creative Photography</strong></p><p>Become a better photographer fast by learning the composition skills of the master photographers!</p><p><strong>Learn How To Become A Better Photographer</strong></p>  <p>  \t  \t                                  Do you want to learn how to be a better photographer?  </p><p>Do you want to learn the compositional techniques that the great masters like Henri Cartier Bresson and Ansel Adams used in their everyday art photography?</p><p>Do you want to learn the simple principles that are used in commercial photography and street photography?</p><p>Do you want to learn these techniques and principles quickly and easily?</p><p><strong>Learn To Observe Light And Compose An Image</strong></p>  <p>  \t                                Very few photographers ever learn how to observe light and use it. Even less learn how the principles of composition actually work and how you can apply them.  </p>  <p>  \t                            This course will help you create compelling and interesting images that you can enjoy and share with your friends.  </p>  <p>  \t                      Become the best photographer in your circles and impress your friends and families when you begin to take compelling images because you understand the science of light and composition in photography.  </p>  <p>  \t  \t<strong>Who Is It For?</strong>  </p>  <p>  \t                            This course is for anyone that is starting out in photography and who wants to take their photography to an artistic level.  </p>  <p>  \t                        It is suitable for students from the age of 8 to 108 and all the content is child friendly.  </p>  <p>  \t                      This makes a great gift, or an additional gift to go along with a new camera that you have purchased for a friend or loved one.  </p>  <p>  \t                            If you or anyone you know has a love for photography and wants to learn how  to see light and learn the basics of composition then this course will be the beginning of a wonderful journey and exploration of light.  </p><p>This photography course is especially useful if you want to start your own photography business and want to learn how to compose an image for weddings / events / candid portraits etc.</p>  <p>  \t  \t<strong>What Is Covered In The Course?</strong>  </p>  <p>  \t                            The course covers the following subjects:  </p>  <p>  \t<em>      Light:  </em>  </p>  <ul>  \t<li>Seeing the light</li>  \t<li>Controlling the light</li>  \t<li>Capturing the light</li>  \t<li>Processing the light</li>  \t<li>Candid / street photography</li>  </ul>  <p>  \t<em>      Composition  </em>  </p>  <ul>  \t<li>Rule of thirds</li>  \t<li>Leading lines</li>  \t<li>Points of contrast</li>  \t<li>Adding or subtracting in the frame</li>  \t<li>Shapes and patterns</li>  \t<li>The power of 3</li>  \t<li>Negative space</li>  \t<li>Breaking the rules</li>  </ul>  <p>  \t  \t<strong>Equipment Needed</strong>  </p>  <p>  \t                        This course is designed to be as simple as possible so you will only need two things to really get the best out of the course.  </p>  <ul>  \t<li>A camera (a smartphone camera will do)</li>  \t<li>A pair of eyes to observe what is happening around you</li>  </ul>  <p><strong>At The End Of The Course</strong>  </p>  <p>  \t                        You will understand how to compose an image and how to observe light.  </p>  <p>  \t                        You will be able to grow as a photographer and understand the creative processes when creating artistic or story telling images.  </p>", 
    "end_date": null, 
    "title": "Photography - Advanced Creative Photography Skills", 
    "price": "20.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350938_02ed_9.jpg", 
    "course_url": "https://www.udemy.com/creative-photography-light-composition-for-photographers/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T15:10:29Z"
}