{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><em style=\"\"><strong style=\"\">&#039;Probably the best course I have taken on Udemy and great fun</strong> &#039;- </em>Diane (enrolled in over a dozen other photography courses)<br style=\"\"><br style=\"\">A set of over 50 video tutorials of photography tips and tricks, each one demonstrates one specific DSLR or compact camera photography tip. This course is aimed at amateur photographers from beginners through to enthusiasts.</p>  <p>  \t ●  Photography training that works<br style=\"\">●  See immediate improvements in your photos<br style=\"\">●  Easy to follow and understand, with a fun teaching style<br style=\"\">●  All boring bits removed (well, most of them anyway!)</p>  <p>  \t <em style=\"\"><em style=\"\"><strong style=\"\">&#039;Just kicked myself, that is a brilliant tip, how did I not think of it? These videos are brilliant!&#039;</strong> - </em>Wilfie</em></p><p><em style=\"\"><span></span>Bernie is so easy to listen to. This is by far the best course I have come across. Lovely quick videos that explain everything. Can not recommend it highly enough. Love it, love it, love it! </em>- Patricia  </p>  <p>  \t <em style=\"\">This tip alone makes taking the course worthwhile</em> - Beverley  </p>  <p>  \t <em style=\"\">There&#039;s lots to learn here and sometime Bernie can be a real laugh, but you can really tell that he knows what he&#039;s talking about. Well worth the money.</em> - Michael  </p>  <p>  \t <em style=\"\">This has been such a great course and learning experience for me. You deserve more than five stars I gave in the review, I wish I was able to give you ten stars </em>- Diane  </p>  <p>These DSLR photography tips for beginners deal with a wide range of subjects and surprisingly, some of the more powerful tips are completely non-technical in nature. There are several FREE photography training videos that you can try out first, watch them and see for yourself just how good some of these DSLR photography tips and tricks are.<br style=\"\"></p>  <p>  \t<strong style=\"\">Downloads are ENABLED for this course!<br style=\"\">  \t</strong>If you have a slow internet connection, or want to take this course with you on your laptop, smartphone or other portable device, sign up and download all the videos and other course materials now.  </p>  <p>  \t Here are some of the general topics covered in this course:-  </p>  <p>  \t ●  Understand the &#039;Exposure Triangle&#039; and get out of the Auto mode.  </p>  <p>  \t ●  Get incredible natural portrait lighting with this one simple pro tip that will flatter your subjects  </p>  <p>  \t ●  Get sharper images with better focussing technique and use of shutter speeds  </p>  <p>  \t ●  Working with natural light and dealing with the sun  </p>  <p>  \t ●  How understanding the direction of light can dramatically improve your photos  </p>  <p>  \t ●  How to use composition to take more dramatic and creative images  </p>  <p>  \t ●  Flatter your family and friends with some great posing tips (individual and group posing)  </p>  <p>  \t ●  How to improve your flash photography  </p>  <p>  \t ●  Controlling depth of field and the &#039;block of focus&#039;  </p>  <p>  \t ●  How to get blue skies in your photos instead of washed out white skies  </p>  <p>  \t ●  How to take better photos in the snow  </p>  <p>  \t ●  How to avoid camera shake and get sharper images  </p>  <p>  \t ●  How to take photos of fireworks  </p>  <p>  \t ●  The myth of megapixels and image quality  </p>  <p>  \t ●  Digital cameras and their settings  </p>  <p>  \t .... and many more!  </p>", 
    "end_date": null, 
    "title": "Photography - Become a Better Photographer - Part I", 
    "price": "20.00", 
    "instructors": "Bernie Raffe AMPA", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/15392_15b9_30.jpg", 
    "course_url": "https://www.udemy.com/great-photography-tips-photo-tutorials/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-03-21T14:04:09Z"
}