{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t <em><strong>Are you looking for an art class for your kids, but don't know how to teach it?</strong></em>  </p>  <p>  \t <em><strong>Does photography sound like a fun and useful class?</strong></em>  </p>  <p>  \t <em><strong>Do you want to develop your child's creative and critical thinking skills?</strong></em>  </p>  <p>  \t <strong>Photography for Kids is the perfect solution</strong><strong>. </strong>This project-based class is ideal for kids, home schoolers, and anyone wanting to learn about photography in a fun way. This course contains an entire section on the history of photography and basic photography techniques. This will give your kids (ideally ages 4-13) a great base for jumping into our weekly projects where they will actually be going out and practicing their photography.  </p>  <p>  \t <strong>12 Weeks of Adventures:</strong> The bulk of this class is broken into weekly projects. Each lesson contains and introduction to the project with photography tips tailored to the assignment. We'll explain what the project entails and get the kids excited for it. Then, we follow Anthony (our co-instructor and model student) around, as he does the adventure on his own. Finally, each lesson culminates in a photo review where photography-expert Phil discusses some of Anthony's best shots, and gives tips on how to improve them. Each weekly lesson with the video lesson and the actual practice should take from 30-60 minutes.  </p>  <p>  \t <strong>All lessons are downloadable! </strong>You can take the entire course with you! Download it to your computer, tablet, or smartphone. Or connect to it wherever you have an internet connection.  </p>  <p>  \t <strong>Instructor Availability: </strong>Phil is always available through the course page for any questions or concerns. We will get back to you within 1-2 business days, but most likely sooner! We are also available to grade your child's work, so that they can get homeschool credit, or credit for an extracurricular class.  </p>  <p>  \t <strong>We can't wait to have you join our class.</strong> We've been teaching online classes for a while now - check out our other classes and see what great reviews we have!  </p>  <p>  \t <strong>Thank you for your time! See you inside the class!</strong></p>", 
    "end_date": null, 
    "title": "Photography for Kids: Project-Based Beginner Photography", 
    "price": "25.00", 
    "instructors": "Phil Ebiner, Anthony Ebiner", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/73572_220d_7.jpg", 
    "course_url": "https://www.udemy.com/photography-for-kids-online-course/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-04T04:24:30Z"
}