{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Learn the five most\npowerful photography techniques that will make you a better\nphotographer as quickly as possible.</p><p><strong>Improve your\nphotography with five powerful techniques for beginners to rapidly\nimprove.</strong></p><ul><li>\n\tFind out what the five most important photography techniques are to\n\trapidly improve your picture taking.</li></ul><p><br></p><ul><li>\n\tLearn how to implement these techniques for rapid improvement</li></ul><p><br>\n</p><ul><li>\n\tRecognise strengths and weaknesses in your photography and how to\n\tuse this to your advantage</li></ul><p><br>\n</p><ul><li>\n\tFind out the best ways to improve your picture taking and enjoy your\n\tphotography even more.</li></ul><p><br>\n</p><p><strong>Fundamental skills\nand techniques to build on.</strong></p><p>Learn\nthe fundamental skills and techniques that will provide the solid\nfoundation on which to improve your photography for years to come.\nOnce understood, these basic principals will transform your\nphotography and give you the confidence to explore and improve\nfurther.</p><p><br>\n</p><p><strong>Content and Overview</strong></p><p>This\ncourse is intended for the beginner photographer and also for\nphotographers who have some basic knowledge. We all want to improve\nout picture taking and the course outlines five top techniques for\nimproving rapidly and developing your photographic technique.</p><p>The\ncourse is divided into five “days” or sections and the best way\nto follow the course is to work through a section at a time allowing\nfor practice time and photography time in between. \n</p><p>The course is divided into five days or sections (although it doesn't have to be completed over five days) and each day introduces a particular concept or technique. Each concept is explained carefully and in as simple way as possible so that it's easy to understand how you can implement the ideas presented to quickly see an improvement in your photography.</p><p>If you work through each day carefully, study the examples and practice the ideas taught you will see a rapid improvement in your pictures. You will feel more confident as a photographer and have a thorough understanding of some of the most important photographic technique. You will be able to use your new skills and apply them in a wide variety of photographic situations and this will help push your work up to the next level.<br></p>", 
    "end_date": null, 
    "title": "Photography Basics : Five Days to Better Pictures", 
    "price": "20.00", 
    "instructors": "Andrew Hind", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/638180_4a74_2.jpg", 
    "course_url": "https://www.udemy.com/photography-basics-five-days-to-better-pictures/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-12T13:10:51Z"
}