{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>My goal is to help you realize how <strong>inferior</strong> your current photos are, and to show you how <strong>easy</strong> it can be to start using a DSLR camera to shoot <strong>stunning photography </strong>of your children, family members, and friends. Even if you can’t afford to buy a DSLR camera to get started, I can show you how you can start shooting photos with $2,500 of DSLR camera equipment in just a couple days without even having to buy one.</p><p><span></span></p><p>In this course:</p>  <ul><li>I’ll show you why DSLR photography is vastly superior to iPhone photography</li><li>I’ll teach you my method of using over $2,500 of DSLR camera gear for less than $100</li><li>I’ll explain and demonstrate the 4 secrets to getting perfect images from a DSLR camera… every time</li><li>You’ll watch over my shoulder as I do real portrait photo shoots with a DSLR camera, and I’ll explain exactly how I’m getting perfect exposures</li><li>Then you’ll see how I get the photos off the camera and into some photo editing software to make some easy, quick, and powerful color adjustments, transporting our photos to a whole new level of beauty</li><li>As a bonus, I’ll provide you with direct links to the DSLR photography equipment I recommend, whether you need to buy it or rent it</li></ul><p><br></p><p>So if you’ve frequently been disappointed by the quality of photos you’re able to take using your iPhone or point and shoot camera, or if you’ve always wanted to learn how to master a DSLR camera to take stunning images of your kids, then you need to take this photography course now. You’ll be amazed by how easy it can be when it’s presented to you the right way.</p><p><br></p>", 
    "end_date": null, 
    "title": "Photography : Shoot Stunning Portraits of Your Kids", 
    "price": "50.00", 
    "instructors": "Bryan Lamb", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656084_d9d0_2.jpg", 
    "course_url": "https://www.udemy.com/shoot-stunning-portraits-of-your-kids/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-31T05:17:06Z"
}