{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong style=\"\">Why Take This Course?</strong></p><p>You have a DSLR Camera or a fancy Point-and-shoot, but have not been using it to it&#039;s full potential. You know that the scary &quot;manual mode&quot; holds a whole new level of customization which would result in better quality photos but have resisted. Terms like Shutter Speed and Aperture sound confusing and you don&#039;t know where to start.</p><p>If that sounds familiar, I want to assure you that by the end of my FREE course you will understand what those settings do and be on your way to controlling your camera rather than your camera controlling you.</p><p>You made an investment in a decent camera and it&#039;s time to start using it&#039;s features</p><p>In this course you will learn the basics of DSLR Photography and how to shoot in manual mode. My goal is to give you the tools so you can train your brain to think like a Photographer. You will also know how to control your camera instead of leaving it up to Auto Mode to try and to it&#039;s best.</p><p><strong style=\"\">How Long Is This Course?</strong></p><p>So far, the course is just over 4 hours in length. You can watch it in chunks or all at once. It is best to watch it with camera in hand so you can pause and follow along with your camera. All DSLR Cameras are different so your settings may look different than mine.</p><p><strong style=\"\">What Should I Expect?</strong></p><p>You should expect to be able to shoot photos with confidence in pretty much all situations. Whether you are taking pictures of your kids for the memories or are considering Photography as a profession, this is everything I had to teach myself in order to understand my camera.</p><p><strong style=\"\">Who are you Jerad Hill?</strong></p><p>I am a&nbsp;<a href=\"http://jeradhillphoto.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Wedding Photographer</a>&nbsp;with over 6 years of professional experience. I have shot over 200 weddings, 120 engagement sessions, 150 portrait sessions and 1000&#039;s of photos of my own kids. For fun I have shot live concerts and music videos. I am also a&nbsp;<a href=\"http://jeradhillphoto.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Wedding Videographer</a>&nbsp;and do a lot with video. Expect a course on DSLR Video soon.</p><p>Thanks for checking out my course. Please subscribe and make sure to share it with that friend of yours who has a nice camera that is always complaining about not understanding it.</p>", 
    "end_date": null, 
    "title": "Photography: Ditch Auto - Start Shooting in Manual", 
    "price": 0, 
    "instructors": "Jerad Hill", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/38282_5ac0_5.jpg", 
    "course_url": "https://www.udemy.com/ditch-auto-start-shooting-in-manual/", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-25T23:36:50Z"
}