{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Children grow up so quickly! </strong></p>\n\n<p>You love taking photos of your children but are you often disappointed with blurred images, harsh shadows and missed moments? </p>\n\n\n\n<p>Or perhaps sometimes you get a stunning shot that you're really proud of. But when you want to replicate it you realise you're not actually sure how you did it!</p>\n\n\n\n<p>The good news is, there are proven easy ways to take incredible photos and I can show you how!</p>\n\n\n\n<p>I'm Rosie - an award winning professional photographer with ten years experience and mum to triplets and a baby.</p>\n\n\n\n<p>I truly know how difficult it is to get good shots of your own children - especially when they are all asking for another biscuit or suddenly need a nappy change when you've just got them in position for the perfect shot! \n</p>\n\n\n\n<p>But there are key ways you can improve your photography so that you can be sure to get a beautiful photo every time.</p>\n\n\n\n<p>In this course I'll share with you my easy step by step path to stunning photography using any camera, even on auto mode.</p>\n\n\n\n<p>I'll take you through the key areas that you need to understand to take beautiful photos every time. After each session you'll get to put your new photography skills into practise with a fun challenge (and share your results with myself and the other students for feedback in the VIP Facebook group, only available to students)!</p>\n\n\n\n<p>In the second part of the course you are also invited to come along with me on shoots with my own friends and family. </p>\n\n\n\n<p>Watch me photograph a birthday party, Father's Day and rainy activities at home like baking and crafting. You'll get to experience my thought process as I take each photograph so that you can gain confidence wherever your camera takes you!</p>\n\n<p><strong class=\"redactor-inline-converted\">After this course you'll feel confident to:</strong></p>\n\n\n\n<p>Take gorgeous photos on bright sunny days</p>\n\n\n\n<p>Be able to find the best light </p>\n\n\n\n<p>Know where to stand when taking photos with natural light indoors</p>\n\n\n\n<p>How to use the rules of composition to make your photos look more artistic</p>\n\n\n\n<p>And be able to bring out genuine love, joy and affection in your subjects to make stunning photos that really show the true person.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Your children are growing up fast.</strong> Don't miss another moment to get to grips with how to take stunning photos of them! <strong>Join me now by clicking on the enrol button!</strong></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Photography: Photography for Mums (and Dads!)", 
    "price": "40.00", 
    "instructors": "Rosie Parsons", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/849616_f93f_4.jpg", 
    "course_url": "https://www.udemy.com/photography-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-15T06:51:41Z"
}