{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong><em>This online photography course will teach you how to take amazing images and sell them, whether you use a smartphone, mirrorless or a DSLR camera.</em></strong><br></p>  <p>  \t            This course is designed to teach you the ins and outs of photography, even if you have little to no experience with it, to help create profitable images that help you stand out from the crowd and sell.  </p><p><strong>Preview our student photos for FREE in lecture 3 to see what other students are learning.</strong><br></p>  <p>  \t            While there are plenty of photography courses that focus on specific styles or how to use gear, it's hard to find a comprehensive course like this one, which is for beginner to advanced photographers.  </p>  <p>  \t            This course is designed for all levels of photographers who want to improve their skills, take stellar images, and make money with their photos.  </p>  <p>  \t<strong>Master Photography Techniques to Create Extraordinary Images and Boost Your Freelancing Income. </strong>  </p>  <ul>  \t<li>Understand How Cameras Work and What Gear You Need</li>  \t<li>Master Shooting in Manual Mode and Editing Photos</li><li>Follow Our Photo Adventures and See How We Shoot Photos Ourselves</li>  \t<li>Use Stabilization, Composition, and Lighting</li>  \t<li>Learn How to Sell Photos or Start a Photography Business</li>  </ul>  <p>  \t<strong>Improve Your Photography Techniques, Acquire Clients, And Make More Money</strong>  </p>  <p>  \t            Regardless of what your level of experience is or what type of camera you use, this in-depth course is designed to provide you with everything you need to take your photography skills to the next level.  </p>  <p>  \t            Whether you prefer taking photos of nature, animals, or people, a great photographer knows how to compose a shot, light it, and edit it. By honing these skills, you can sell your photos so you can turn your passion into a career. This course shows you how.  </p>  <p>  \t            Unlike other photography classes that are more limited in scope, this complete course teaches you how to take amazing photos and how to make money by selling them.  </p>  <p>  \t<strong>Contents and Overview</strong>  </p>  <p>  \t            This course is aimed at teaching photographers what it takes to improve your techniques to earn more money.  </p>  <p>  \t            You'll start with the basics and tackle how a camera operates, the types of cameras and lenses available, and equipment you'll need for accomplishing your goals. You'll then dive into the different styles of photography you can focus on.  </p>  <p>  \t            You'll learn about your camera settings, including how to shoot in manual mode. You'll use stabilization tools and master how to properly compose and light a scene. You'll even learn how to take great photos with a smartphone or tablet and how to edit images.  </p>  <p>  \t            So you can sell your photos, you'll learn how to brand yourself, create a portfolio and website, and find freelance work or a full-time position. Gain insight into licensing, fair use, and more. And if you want to get into wedding photography, you'll learn how to start your own business.  </p>  <p>  \t            By the end of this master course, your confidence as a photographer will soar. You'll have a thorough understanding of your camera and gear so you can use them to their fullest potential to take unforgettable photos and start a profitable photography career.  </p>  <p>  \t<strong>About the instructors:</strong>  </p>  <p>  \t<strong>Phil Ebiner </strong>started teaching online courses in 2012, and now has over 135,000 happy students on Udemy learning all sorts of things from photography to video making. Phil worked as a photographer at a private college a few years ago doing event coverage, marketing &amp; advertising, and social media.  </p>  <p>  \t<strong>Sam Shimizu-Jones</strong> has been taking photos his entire life. Growing up in Santa Cruz, CA, he fell in love with photography skating around town. Since then, he's traveled the world taking photos for business and pleasure. Most recently, Sam worked as the photographer for Floating Doctors, a medical non-profit working in Panama.</p>", 
    "end_date": null, 
    "title": "Photography Masterclass: Your Complete Guide to Photography", 
    "price": "25.00", 
    "instructors": "Phil Ebiner, Sam Shimizu-Jones", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394968_538b_5.jpg", 
    "course_url": "https://www.udemy.com/photography-masterclass-your-complete-guide-to-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-15T16:25:17Z"
}