{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t           Start by burning your camera manual. Forget everything you know about how your camera works. And start to view picture-taking in a new way. In this course, you will learn the basics of lighting to cropping and everything in between.  </p>  <p>  \t           Photography experts from the New York Institute of  Photography, the world's largest and longest running online photography  school, show you how to take professional-quality photos with any  camera. The secret, it's in your eye.  </p>  <p><br></p>  <p>  \t      Here are some stories shared by students who have taken one of NYIP's online photography courses </p>  <ul>  \t<li>Lee Presnell, North Carolina:<br>  \t      Since graduating from NYIP, Lee has been very busy! Lee is  creating a calendar and a book for some local churches, shooting head  shots for an author’s autobiography, car and modeling shoots, and doing a  number of photography sessions for the American Heart Association for  one of their fundraisers. Lee has also been published twice in local  newspapers including two front page photos. Lee also won 7 awards in  photography contests.<br>  \t<br>  \t</li>  \t<li>Karin Kunzova, Germany:<br>  \t      Karin’s photo series 'Road Trip' dealing with backpacking around  the Australia outback was selected by Agathe Gaillard and published in  Le Journal de la Photographie. Karin focuses on documentary photography  which she says she finds challenging and fulfilling. She loves \"working  with people, studying different personalities and the way people live.\"</li>  </ul>", 
    "end_date": null, 
    "title": "Secrets of Photography: Developing Your Eye", 
    "price": "30.00", 
    "instructors": "New York Institute Of Photography (NYIP)", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240896_0aea_2.jpg", 
    "course_url": "https://www.udemy.com/secrets-of-photography-developing-your-eye/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-10T18:05:03Z"
}