{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>\r\n\t Who said only professional cameras can take professional pictures? Yeah everyone does, but what they don&#039;t tell you is that you can make amazing professional photography with any basic low cost and mobile cameras! But how exactly?\r\n</p>\r\n<ul>\r\n</ul>\r\n<p>\r\n\tThis is why I&#039;m here for, to reveal you the secrets of photography and to make you a proud photographer who isn&#039;t depended on expensive cameras or other equipment that is needed to manage your work as a professional photographer, or a <span id=\"d048384a-79ec-4bfe-a663-8ffe4d1dcae3\" class=\"GINGER_SOFTWARE_mark\">randome</span> teenager who wants to look cool next to his friends by sharing his awesome <span id=\"5f821457-31b1-44aa-98a8-b4db041611a5\" class=\"GINGER_SOFTWARE_mark\">photoshoots</span> on facebook, or simply a parent who loves his kids and wants beautiful photographs of them.\r\n</p>\r\n<p>\r\n\t <strong><span id=\"404f1fef-3f43-49de-817b-93eb379dd22d\" class=\"GINGER_SOFTWARE_mark\"><span id=\"dafbe97a-e667-43f2-979a-ab9af685e4c3\" class=\"GINGER_SOFTWARE_mark\">Joze</span></span> Mont:</strong> Media Director at Joze Mont Entertainment and International Education Project &quot;Sattva&quot;. Film Director who has written, produced and directed over 8 movies and released 2 music albums. She&#039;s also a well known Photographer in USA who worked with Organizations, Hat companies, Models, Actors, Movie productions and personal clients. Her work has reached many souls throughout the world and has inspired people to grow through Art, Films, Music and Photography. <span id=\"26a8c34c-4dfc-499c-a203-f711068bf5ad\" class=\"GINGER_SOFTWARE_mark\"><span id=\"3ff45508-6cf0-4aa4-80e9-19d1a863f10a\" class=\"GINGER_SOFTWARE_mark\">Joze</span> Mont is also the creator of &quot;Cinemont&quot; - The new generation of legendary films that will be remembered for centuries on by leaving a remarkable sign of creative existence.</span>\r\n</p>\r\n<p>\r\n\t <strong>The benefits you get from this course are:</strong>\r\n</p>\r\n<ul>\r\n\t<li><strong></strong>Discover great features on your camera that will help you create professional pictures.</li>\r\n\t<li>Learn how to hold your camera the proper and professional way before taking pictures. </li>\r\n\t<li>Learn how to make your pictures presentable by using the right angles and correct lighting. </li>\r\n\t<li>Give your pictures a style.</li>\r\n\t<li>Learn self portrait. </li>\r\n\t<li>Learn photoshop.</li>\r\n\t<li>Create your own professional photography logo.</li>\r\n\t<li>Learn iPhone Photography.</li>\r\n\t<li>Sharing your pictures and having an online portfolio. </li>\r\n\t<li>And most important of all, make professional <span id=\"64802500-5b97-49e7-9c05-c858688e4672\" class=\"GINGER_SOFTWARE_mark\">photographs</span> with any basic low cost camera!</li>\r\n</ul>", 
    "end_date": null, 
    "title": "Shoot Like A PRO", 
    "price": "50.00", 
    "instructors": "Joze Mont", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121746_6ef9_5.jpg", 
    "course_url": "https://www.udemy.com/shoot-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-18T17:19:22Z"
}