{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t   Learn a dying art that is Film Photography. Learn the complicated in a simple way within the surroundings of your own home. Bring photography back to life and create timeless photos and steal back what digital has taken from you. Simply...learn how to take photos and make them from the vision of your eye to the print of your wall, and enjoy the process....Be part of the film revival!!!  </p>  <p>  \t Learn the very core and basics of Photography covering areas such as:  </p>  <ul>  \t<li><span>Aperture, Speed and ISO.</span></li>  \t<li><span>Composition - Rule of Thirds, Sweet Spots and Lines.</span></li>  \t<li><span>Settings for Portraits and Landscape shots.</span></li>  </ul>  <p>  \t <span></span><span>Learn in an unrestricted way where practice and correcting mistakes takes priority over tedious dictations and perfection. This course will teach you the &#039;rules&#039; and push you towards your personal and unique style of photography.</span>  </p>  <p>  \t Have you never used a film camera? Not to worry, this course will guide you through everything from choosing a film to loading it within a film camera. You will also learn how to safely remove your film, store and create that film into negatives. Learn the magic of printing your very own print. It&#039;s a satisfying feeling when you see that image magically appear on that bit of paper after all the effort you&#039;ve put in. It&#039;s even more satisfying when you see the quality of your work in broad daylight. We will cover:  </p>  <ul>  \t<li><span>Darkroom Equipment and Materials</span></li>  \t<li><span>Tips and techniques for ease of use and better results</span></li>  \t<li>Chemicals processes and preparations.</li>  </ul>  <p>  \t This course is instructed in a way that will allow the absolute beginner to start from scratch and operate a home lab not too different from a pro lab. Create results that have been used for over 100 years, become part of a dying breed and learn a skill. It&#039;s a skill you can easily learn, develop and pass on! Videos are accompanied with supplementary material in the form of a pdf guide. This will allow you to follow the actions of each lecture but also to follow a written guide for some finer details. Sometimes a 5 second video extract can say more than a paragraph in a guide, but a guide can create a definitive detail that would be boring and uninspiring to listen to in a video. With this course you have the best of both worlds and a choice as to which way you want to learn.  </p>  <p>  \t This course is based upon a 10 week practical learning basis. You can complete this course in an hour, but the aim is that you complete a lecture practice for a week, testing technique, then moving onto the next lecture. That way, you are giving yourself time to learn and experiment and not being bogged down with feeling pressured to move through the course at a pace that doesn&#039;t suit you. Please do your own research and change any areas that you do not agree with in this course. This course isn&#039;t a definitive guide, it&#039;s a guide to introduce you and hopefully expand your knowledge and thinking.  </p>  <p>  \t <span>Take this course and you will open yourself up to a skill and expertise that is fast disappearing. You&#039;d be surprised at the acknowledgement and comments you&#039;ll get when you have a film camera. Don&#039;t let a microchip control your photos and memories, put yourself in control and be your own artist.</span>  </p>", 
    "end_date": null, 
    "title": "The Art of Film Photography & Basic Photography Skills", 
    "price": "20.00", 
    "instructors": "Dean Benstead", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/300110_03ca_3.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-film-photography-basic-photography-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-14T15:02:10Z"
}