{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t            In this course \"The Art of Figure to Ground\" we will explore how to add layers to your photograph.  Artists have used layers to tell stories in their images, but to make them work effectively we must fully understand the concept of Figure to Ground relationships.  From street photography to portraiture, every layer is an opportunity to add something to your picture.  </p>  <p>  \t\tHave you ever wondered why professional photographers always get good images? Are they just lucky or do they see the world differently?  \t</p>  \t  \t<p>  \t\t<strong>A Room for Improvement is the first photography program that starts training your most important tool, Your Eyes. </strong>While most of the photography world is obsessed with gear and post production, the real secret to taking amazing images is learning how to see like an artist. Join artist &amp; photographer Adam Marelli as he shares the tools, lessons, and training that classical artist use to bring images to life. As a trained photographer, painter, and sculptor Marelli combines twenty years of art eduction into simple to follow lessons that you can do in your own backyard.  \t</p>  \t  \t<p>  \t\t<strong>COURSE STRUCTURE</strong>  \t</p>  \t  \t<ul>  \t\t<li>This course is divided into 7 Lectures that are a <strong>Master Class</strong> in<strong> Figure to Ground</strong>.</li><li>Lecture 1:  Why your discoveries matter?</li><li>Lecture 2:  Spot the Background first?</li><li>Lecture 3:  Use black and white to see color.</li><li>Lecture 4:  Work like an artist.</li><li>Lecture 5:  Solutions from my portfolio.</li><li>Lecture 6:  See the photograph before it happens.</li>  \t\t<li>The lectures are designed to be watched in order, but you are free to skip around.</li>  \t\t<li>This course is approxiamtely 45 minutes, with downloadable images from the lecture, and an assignment designed to highlight the tools from each lecture.</li>  \t</ul>  \t  \t<p>  \t\tMarelli uses his own work and the famous artists who influenced his work to reveal <em>\"how artists work\"</em> and <em>\"how they learned to see in a completely unique way.\"</em> For centuries these concepts were reserved for artist guilds and apprenticeships, but for the first time they are being put in a language available to photographers.  \t</p>  \t  \t<p>  \t\t<strong>EXPECT RESULTS</strong>  \t</p>  \t  \t<p>  \t\tBy the end of this course, you will understand why photographers always say that \"the equipment doesn't matter.\" Learning to see like an artist is one of the single most fulfilling steps on the way to becoming a better photographer. In addition to improving your own work, you will be able to walk into any gallery or museum in the world and know, with full certainty, whether you are looking at a great piece of art or not.  \t</p>  \t  &lt;/p&gt;", 
    "end_date": null, 
    "title": "The Art of Figure to Ground: Photography's untaught secret", 
    "price": "20.00", 
    "instructors": "Adam Marelli", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288364_867b_3.jpg", 
    "course_url": "https://www.udemy.com/a-room-for-improvement-the-art-of-figure-to-ground/", 
    "currency": "USD", 
    "subject_name": [
        "Photography Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T17:57:40Z"
}