{
    "selfpaced": false, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Science\n                                                                                                    &gt; Biology\n                                                            \n                            \n                                                \n                    \n                    \n                    Join Professor Eric Lander and the MITx Biology team in a newly restructured introductory biology learning experience. All original 7.00x course materials are available here for exploration and completion, including video and interactive problem sets and exams. Despite the current lack of a certification option, we strongly encourage you to work through the activities, towards a goal of learning biology, with an eye towards future certification options. In this version of the course, we have kept the course content the same while optimizing the course settings for learning: instant feedback after trying problems and all content available at all times. Starting soon, we will offer a more thorough and robust means of certifying edX learners in their mastery of the MITx introductory biology content, through a new competency exam. This exciting new option is still under development, but as soon as we confirm the timing and technical details of the exam, we will notify you of the option to switch to verified certificate track. In the meantime, we highly recommend preparing for the coming competency exam certification by using the current course materials and MIT OpenCourseWare problems. More details to come – stay tuned!\n\n7.00x is an introductory level biology course hosted by professor Eric Lander, who was one of the leaders of the Human Genome Project. The course content reflects the topics taught in the MIT introductory biology courses and many biology courses across the world. As a learner, you will first focus on the structure and function of macromolecules such as DNA, RNA and proteins. You will discover how changes in the structure of some of these macromolecules alter their functions and what the implications of such changes have on human health. As you continue in the course, you will apply an understanding of heredity and information flow within cells to human health and disease and will learn about molecular biological techniques and their potential to impact our changing world. After you complete this course, you will have a foundation in biology that will allow you to understand the remarkable medical revolution going on today.\n\n7.00x – The Secret of Life will let you explore the mysteries of biochemistry, genetics, molecular biology, recombinant DNA technology and genomics, and rational medicine. We are excited to take this journey with you!\n\n \n\n                                    ", 
    "end_date": "2016-08-03T00:00:00Z", 
    "title": "7.00x: Introduction to Biology - The Secret of Life", 
    "price": 0, 
    "instructors": "Eric S. Lander and Graham Walker", 
    "institution_name": [
        "Massachusetts Institute of Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/introduction-biology-secret-life-mitx-7-00x-2", 
    "duration": "59 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-06-17T00:00:00Z"
}