{
    "selfpaced": false, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    This course is sponsored by Gibco® and designed to prepare you for their Cell Culture Basics Certification. Learn the basic techniques for effective, reproducible laboratory cell culture, including optimized procedures and products that will help you get the consistency your lab work demands.\r\nCell Culture Basics is designed to introduce you to the practice of laboratory cell culture, covering topics such as laboratory set-up, safety, and aseptic technique. You’ll also learn basic methods for passaging, freezing, and thawing cultured cells. Upon the successful completion of this course, you will have a basic understanding of the principles and practice of cell culture that you can immediately apply to your research projects. Aspiring cell culturists, experienced researchers, as well as lab managers and principal investigators may all find value in Gibco® Cell Culture Basics. Students completing this course will be eligible to take the free Gibco® Cell Culture Basics certification test and earn the corresponding certificate.\n\n                                            Syllabus\n                        Week One: Cell Culture Lab - Introduction, lab safety, aseptic techniques, contamination types, use of antibioticsWeek Two: Cell Culture Basics - Cell lines, culture environment, mammalian and insect cell morphologyWeek Three: Methods - Guidelines for maintaining cultured cells, subculturing adherent cells, freezing cells, thawing frozen cells, various protocolsWeek Four: Additional Topics - Troubleshooting, cell culture products, transfection &amp; selection, additional resources\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Cell Culture Basics", 
    "price": 0, 
    "instructors": "Jonathan Zmuda", 
    "institution_name": [
        "University of California, Irvine"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.canvas.net/browse/ucirvinegibco/courses/cell-culture-basics-1", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2015-01-12T00:00:00Z"
}