{
    "selfpaced": false, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    This course explains the general principles of chicken behaviour and welfare, and the behavioural and physiological indicators that can be used to assess welfare in chickens kept in hobby flocks through to commercial farms. The focus is primarily on laying hens and meat chickens (broilers) although many of the principles are relevant to other types of poultry. The course is likely to be of interest to people who own chickens as pets or keep a small hobby flock, commercial egg and chicken meat producers, veterinarians and vet nurses. \n\nLearning Objectives: at the end of this course, you will be able to -\n- Describe avian sensory perception and motivation\n- Explain the main behaviour patterns of poultry\n- Define welfare and explain the bases of welfare standards\n- Assess chicken welfare, using behavioural and physiological means\n- Understand common welfare problems of chickens\n\nThis course is taught by staff from Scotland's Rural College (SRUC), University of Glasgow, and St David's Poultry Team.\n\nYou can follow us on Twitter!  #chickenmooc\n\n© University of Edinburgh and Scotland's Rural College 2016 CC BY\n\n                                            Syllabus\n                        Getting StartedThis brief module will tell you all the things you need to know to begin, including the syllabus of the course, who we are, how to engage with one anotherIntroduction to Animal Behaviour: Domestication, Behaviour Development and Learning, the SensesWelcome to the first week of the Chicken Behaviour and Welfare Course. If you haven't seen it - watch the video which introduces you to the course: you can find it under \"Getting Started; Welcome!\"  During this lesson, we will consider what makes a domestic animal, how behaviour develops in the chicken from before hatching and beyond, different types of learning and the senses - vision, hearing, taste, smell and touch. This week's Learning Outcomes: •Describe the advantages of being a precocial or altricial species of bird; •Talk about different types of learning, including imprinting, habituation, and operant conditioning; •Describe factors that affect learning such as hormones and motivational state; •Discuss senses in birds and which are more important in chickens.Behavior Patters of Chickens, Part 1During this week, we will consider some of the major behaviour patterns of chickens, such as maintenance behaviours of chickens, and social behaviours.  Maintenance behaviours means feeding, drinking, and comfort activities.  Comfort activities include preening, dustbathing, and perching (among others). Social behaviours include communication, dominance, aggression, and spacing. This week will be a combination of video lectures, in-video quizzes and an interview with a backyard producer. This week's Learning Outcomes:   •Understand the multifactorial controls that affect feeding  •How chickens drink, and the association with feeding  •Define and describe comfort behaviours in chickens  •Be aware of social behaviour in chickens  •Understand dominance and its effects on behaviour (such as the formation of hierarchies)  •Define between different types of pecking.Behaviour Pattens of Chickens, Part 2Welcome back everyone!  During this week, we will consider the reproduction process in chickens, from courtship to brooding and hatching of eggs.  We will then look at some abnormal behaviours that you might see in chickens.  This week will be a combination of video lectures, in-video quizzes, video clips from outside sources, and a downloadable poster on eggshell abnormality.  This week's Learning Outcomes: •Define terms related to courtship, mating, and reproduction  •Understand how factors such as dominance and selection can affect courtship and mating behaviours  •Define abnormal behaviour  •Understand some of the many factors that can affect feather pecking and cannibalism  •Show awareness of several other types of abnormal behaviours, their causes and potential ways of preventing or limiting them.What is chicken welfare? Defining \"welfare\", ethical obligations, and welfare standardsDuring this week, we will consider what we mean by \"animal welfare\", and how a set of criteria known as the Five Freedoms can help you assess it.  Dr Dorothy McKeegan from the University of Glasgow will discuss what the ethical obligations are of meeting an animal's welfare needs, and we will explore some of the various welfare standards that exist.  Finally, we will look at welfare indicators, and Dr Barry Thorp from St David's Veterinary Team will discuss with Vicky what signs to look for in chicken flocks to make a welfare assessment.  This week's Learning Outcomes:  •Define 'welfare' and the Five Freedoms  •What drives our ethical choices, including cost-benefit analysis  •Describe some welfare standards available worldwide and how they differ  •Explain ways to assess welfare, using behavioural and physiological indicesEffects of housing, transport and slaughter on bird welfareThis is the last week of the Chicken Behaviour and Welfare course, you are almost at the finish line...  During this week, we will consider the welfare of layer hens and broiler (meat) chickens, from hatch to slaughter, particularly in common commercial systems. This week's Learning Outcomes: •Compare the most common housing systems used in Europe for laying hens •Compare the most common housing systems used in Europe for broiler chickens •Discuss the pros and cons of free range housing •Describe methods of emergency killing •Discuss different transport requirements, depending on the scale •Describe some of the common methods of slaughtering poultry.\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Chicken Behaviour and Welfare", 
    "price": 0, 
    "instructors": "Victoria Sandilands", 
    "institution_name": [
        "University of Edinburgh"
    ], 
    "commitment": "1-3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/chickens", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}