{
    "selfpaced": false, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    While the human genome sequence has transformed our understanding of human biology, it isn’t just the sequence of your DNA that matters, but also how you use it! How are some genes activated and others are silenced? How is this controlled? The answer is epigenetics.  \n\nEpigenetics has been a hot topic for research over the past decade as it has become clear that aberrant epigenetic control contributes to disease (particularly to cancer). Epigenetic alterations are heritable through cell division, and in some instances are able to behave similarly to mutations in terms of their stability. Importantly, unlike genetic mutations, epigenetic modifications are reversible and therefore have the potential to be manipulated therapeutically. It has also become clear in recent years that epigenetic modifications are sensitive to the environment (for example diet), which has sparked a large amount of public debate and research.\n\nThis course will give an introduction to the fundamentals of epigenetic control. We will examine epigenetic phenomena that are manifestations of epigenetic control in several organisms, with a focus on mammals. We will examine the interplay between epigenetic control and the environment and finally the role of aberrant epigenetic control in disease.\n\nAll necessary information will be covered in the lectures, and recommended and required readings will be provided. There are no additional required texts for this course. For those interested, additional information can be obtained in the following textbook.\n\nEpigenetics. Allis, Jenuwein, Reinberg and Caparros. Cold Spring Harbour Laboratory Press. ISBN-13: 978-0879697242 | Edition: 1\n\n                                            Syllabus\n                        Week  1 - Introduction to Epigenetic ControlYour learning objectives for Week 1 are to:  • Define what is meant by the term epigenetic  • Understand how a fertilised egg can give rise to an animal with hundreds of different cell types  • Explain how cellular identity can be maintained through cell division  • Understand how genetically identical twins can have differences in appearance or disease   •  Describe how DNA is packaged within the nucleus and the implications this has on gene expression   • Understand how DNA methylation can influence gene expression and genomic stability. Week 2 - Epigenetic Modifications and Organisation of the NucleusBy the end of Week 2 you should be able to: • Describe how histone tails can be modified, e.g. by acetylation and methylation  •  Explain what is meant by the 'histone code' • Understand how chromatin remodellers can bring about changes in packaging of DNA, and their interaction with modified histone tails  •  Understand the roles of noncoding RNAs in regulating gene expression, genomic stability and epigenetic modifications  •  Describe how chromosomes are distributed within the nucleus  •  Describe how organisation of the nucleus into various subcompartments leads to efficient gene regulationWeek 3 - Dosage CompensationAfter completing Week 3 you should be able to: • Describe what is meant by 'dosage compensation' and how this is achieved in flies, worms and mammals  •  Explain why Barr bodies were used to check the sex of 'female' athletes at the 1966 Olympics  •  Understand why calico cats are almost always femaleUnderstand the difference between random and imprinted X inactivation  •  Describe the stages of X inactivation in mammals  •  Understand the role of Xist and how it is regulated, with particular reference to elements in the X inactivation centre  •  Understand the link between pluripotency and X inactivation  •  Explain the implications of skewed X inactivation for human disease  •  Understand how X inactivation can be stably maintained over the lifetime of an organism  Week 4 - Genomic Imprinting and Epigenetic ReprogrammingYour learning objectives for Week 4 are to: • Explain why epigenetic marks need to be cleared at particular periods of development  •   Describe genomic imprinting and understand several mechanisms by which this can be achieved  •   Explain why imprinting disorders show parent-of-origin specific inheritance  •   Understand why repetitive elements and imprinted genes are treated differently to the rest of the genome during periods of epigenetic reprogrammingWeek 5 - The Influence of the Environment on Epigenetic ControlAt the conclusion of Week 5 you should be able to: • Understand how the environment can have a lasting impact on your epigenetic makeup  •  Describe why assisted reproductive technologies may be associated with a higher rate of imprinting disorders  •  Understand the epigenetic barriers that had to be overcome to clone Dolly the sheep  •  Understand the challenges to reprogramming somatic cells to pluripotent stem cells  •  Explain why some periods of development are more sensitive to environmental influences than other periods  •  Are you what your grandmother ate? - Understand the challenges in proving whether transgenerational epigenetic effects are due to inheritance through the gametes  •  Explain why exposure of a pregnant woman to an environmental agent have direct effects on her child and future grandchildrenWeek 6 - Mechanisms of Environmental Influence on Epigenetic Control and Transgenerational Epigenetic Inheritance Through the GametesYour learning objectives for Week 6 are to: •  Understand how the environment can have a lasting impact on your epigenetic makeup  •  Explain why some periods of development are more sensitive to environmental influences than other periods  •  Are you what your grandmother ate? Understand the challenges in proving whether transgenerational epigenetic effects are due to inheritance through the gametes  •  Explain why exposure of a pregnant woman to an environmental agent can have direct effects on her child and future grandchildren  •  Understand how metastable epialleles in mice can be used to study transgenerational epigenetic inheritance at the molecular level  •  Describe potential mechanisms for transgenerational epigenetic inheritance through the gametes  •  Understand how genetic differences can result in an apparently 'epigenetic' effectWeek 7 - Cancer EpigeneticsHaving undertaken Week 7 of this course, you should be able to: • Understand that cancer cells display an interplay of genetic and epigenetic alterations  •  Describe the aberrations in epigenetic control that are commonly seen in cancer, and explain how these contribute to disease  •  Describe how genomic imprinting can be disrupted in cancer  •  Explain how alterations in epigenetic modifiers can arise  •  Understand why epigenetic modifiers can be both oncogenes and tumour suppressor genes, depending on the context  •  Describe how epigenetic alterations can be used as biomarkers of disease  •  Explain how epigenetic alterations can provide information about prognosis or guide treatment decisions  •  Describe how inhibitors of the epigenetic machinery could be used to treat disease\n                                    ", 
    "end_date": "2016-07-24T00:00:00Z", 
    "title": "Epigenetic Control of Gene Expression", 
    "price": 0, 
    "instructors": "Dr Marnie Blewitt", 
    "institution_name": [
        "University of Melbourne"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/epigenetics", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-05T00:00:00Z"
}