{
    "selfpaced": false, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    Learn about the technologies underlying experimentation used in systems biology, with particular focus on RNA sequencing, mass spec-based proteomics, flow/mass cytometry and live-cell imaging.\n\nA key driver of the systems biology field is the technology allowing us to delve deeper and wider into how cells respond to experimental perturbations. This in turns allows us to build more detailed quantitative models of cellular function, which can give important insight into applications ranging from biotechnology to human disease. This course gives a broad overview of a variety of current experimental techniques used in modern systems biology, with focus on obtaining the quantitative data needed for computational modeling purposes in downstream analyses. We dive deeply into four technologies in particular, mRNA sequencing, mass spectrometry-based proteomics, flow/mass cytometry, and live-cell imaging. These techniques are often used in systems biology and range from genome-wide coverage to single molecule coverage, millions of cells to single cells, and single time points to frequently sampled time courses. We present not only the theoretical background upon which these technologies work, but also enter real wet lab environments to provide instruction on how these techniques are performed in practice, and how resultant data are analyzed for quality and content.\n\n                                            Syllabus\n                        IntroductionDescription goes hereDeep mRNA SequencingDescription goes hereMass Spectrometry-Based ProteomicsDescription goes hereMidterm ExamDescription goes hereFlow and Mass Cytometry for Single Cell Protein Levels and Cell FateDescription goes hereLive-cell Imaging for Single Cell Protein DynamicsDescription goes hereIntegrating and Interpreting Datasets with Network Models and Dynamical ModelsDescription goes hereFinal Exam\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "Experimental Methods in Systems Biology", 
    "price": 0, 
    "instructors": "Marc Birtwistle", 
    "institution_name": [
        "Icahn School of Medicine at Mount Sinai"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/experimental-methods", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}