{
    "selfpaced": false, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    Pourquoi respirons-nous ? A quoi servent nos poumons ? Quel est le lien entre l’oxygène et la vie ? Ces questions ouvrent un vaste champ de découvertes et de curiosités pour mieux comprendre la  respiration. Ce cours s’adresse à toute personne qui souhaite apprivoiser, s’approprier ou approfondir le fonctionnement de la respiration et des poumons, autrement dit la physiologie respiratoire humaine.\n \nPlongés au cœur de l’université et de la pratique hospitalière, durant  sept semaines, vous côtoierez professeurs, professionnels de la santé, internes et étudiants de médecine. Vous y apprendrez des notions de niveau universitaire qui ont été sélectionnées et adaptées afin que toute personne intéressée puisse les comprendre et y donner du sens. Ainsi, nous aborderons des thèmes proches du monde qui vous entoure : la respiration lors d’un effort physique, en altitude, le rôle des polluants atmosphériques, l’asthme….\n \nA chaque leçon, un expert abordera des domaines concrets et pratiques : comment apprécier l’oxygénation d’un patient, pourquoi lui administrer de l’oxygène, que signifie hyperventiler….\n \nCe cours vous fera entrer en profondeur dans un monde où l’atmosphère est faite d’anatomie humaine, de physique des volumes et des pressions, de gaz et de sang, d’oxygène et de CO2, de poumons et de tissus, de tabagisme et de bronchite chronique.\n \nAu terme de ce cours, vous serez capables de\n\nexpliquer et décrire les principes d’oxygénation, de ventilation, de transport et de consommation d’oxygène, de diffusion de gaz entre l’air et le sang… par des schémas et par des calculs utilisant quelques formules fondamentales.\n\tévaluer la quantité et la qualité de l’oxygénation d’un patient,\n\tdistinguer les situations normales de celles dites pathologiques.\nBref, vous aurez, pour votre plaisir et votre motivation, approfondi votre culture générale en acquérant des connaissances élevées.\n\nTable des matières :\n\nSans oxygène, point de vie sur terre\n\tL’anatomie respiratoire : de la bouche aux alvéoles pulmonaires\n\tLa ventilation et les volumes pulmonaires\n\tLes physiciens de la respiration\n\tLa Cascade d’Oxygène\n\tL’Hémoglobine, transporteur d’Oxygène dans le sang\n\tLes couleurs de l’oxygène\n\tLe Dioxyde de Carbone (CO2) : bien mieux qu’un déchet de l’organisme\n\tRespirer en altitude ou en avion : une adaptation à l’hypoxie\n\tL’effort physique augmente la consommation d’oxygène\n\tLe poumon du fœtus, c’est le placenta de sa mère\n\tLes polluants atmosphériques, le monoxyde de carbone (CO) et le tabagisme\n\tL’asthme obstrue et enflamme les petites bronches\n\tLa bronchite chronique et l’emphysème réduisent l’élasticité des poumons\n\tL’œdème Pulmonaire : le cœur et les poumons sont indissociables\n\tRespiration et bien-être : le yoga et l’hypnose\n\tCompléments de physiologie respiratoire : le surfactant, la compliance, la fibros\n\n\n                                    ", 
    "end_date": "2016-08-19T00:00:00Z", 
    "title": "Louv8x: Comprendre la respiration", 
    "price": 0, 
    "instructors": "Franck Verschuren", 
    "institution_name": [
        "Université catholique de Louvain"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/respiration-human-body-louvainx-louv8x-0", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-07-01T00:00:00Z"
}