{
    "selfpaced": true, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    Principles of Biochemistry integrates an introduction to the structure of macromolecules and a biochemical approach to cellular function. Topics addressing protein function will include enzyme kinetics, the characterization of major metabolic pathways and their interconnection into tightly regulated networks, and the manipulation of enzymes and pathways with mutations or drugs. An exploration of simple cells (red blood cells) to more complex tissues (muscle and liver) will be used as a framework to discuss the progression in metabolic complexity. Learners will also develop problem solving and analytical skills that are more generally applicable to the life sciences.\n \n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.\n\nImage credit: PDB ID 2DN1, 2DN2\n\nPark S-Y, Yokoyama T, Shibayama N, Shiro Y, Tame JRH (2006) 1.25 A resolution crystal structures of human haemoglobin in the oxy, deoxy and carbonmonoxy forms. J Mol Biol 360: 690–701.\n\n                                    ", 
    "end_date": "2015-09-29T00:00:00Z", 
    "title": "MCB63X: Principles of Biochemistry", 
    "price": 0, 
    "instructors": "Rachelle Gaudet and Alain Viel", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/principles-biochemistry-harvardx-mcb63x", 
    "duration": "15 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-06-16T00:00:00Z"
}