{
    "selfpaced": true, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    In this second module we will explore how neurons communicate with each other.  We will investigate the collective behavior of neurons in small circuits and ways in which signals between neurons are modulated.\n\nEach lesson will be media and content rich and will challenge you to master material with interactive segments that depend on your feedback to move forward in the lesson. You will be able to use virtual labs simulating neurons and circuitry to test your understanding of the course material. Lessons will also be filled with beautiful animations, exploring the richness and complexity of the brain. Documentaries focusing on cutting-edge topics in neuroscience will take you inside labs, hospitals and research institutions around Harvard, MIT and Boston, and quiz banks will allow you to test your knowledge on your own time.\n\nPlease note that this course is NOT hosted on the edX platform, but can be found at www.mcb80x.org. To receive a certificate for this course, you must register for the course through EdX and successfully complete the final exam during an established exam period.\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.\n\n                                            Syllabus\n                        \r\nLesson 1: The Synapse\r\nLesson 2: Excitation &amp; Inhibition \r\nLesson 3: Small Circuits\r\nLesson 4: Neuromodulation\r\nLesson 5: Potentiation &amp; Depression\r\n\n                                    ", 
    "end_date": "2017-04-18T00:00:00Z", 
    "title": "MCB80.2x: Fundamentals of Neuroscience Part 2: Neurons and Networks\n", 
    "price": 0, 
    "instructors": "David Cox", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/fundamentals-neuroscience-part-2-neurons-harvardx-mcb80-2x-0", 
    "duration": "52 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-04-19T00:00:00Z"
}