{
    "selfpaced": false, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    While biologists have long understood the power of disease to shape events in world history, the depth of that power has rarely emerged in history books. This course seeks to redress that imbalance through historical anecdote and scientific explanation as it investigates the ways in which diseases have affected dramatically the course of history across several topics, including religion, war, and migration. Participants will experience video lectures and vignettes with accompanying essays and learning exercises that will introduce them to the startling influence of microbes in the course of human events. Sharing good humor and a combined seven decades of teaching and friendship, the two professors from the fields of microbiology and history have designed tiered learning materials that allow students to venture as deeply as they desire into the links between disease and history. Participants may also choose which topics interest them the most and devote their energies accordingly.\r\nTopics covered include:\r\n\r\nWeek One: Effects of Disease on Religion\r\nWeek Two: Effects of Disease on Conquest and Exploration\r\nWeek Three: Effects of Disease on Migration and Movement of Populations\r\nWeek Four: Effects of Disease on War\r\nWeek Five: Effects of Disease on Politics\r\n\r\nPrerequisites\r\nThere are no essential prerequisite skills required in this course. However, any knowledge about world history (e.g., U.S., Europe, etc.) and basic knowledge of microbiology would be useful.\r\nTextbook and Material\r\nThere is no textbook required in this course. You are not required to pay for course materials.\r\nTechnology Requirements\r\nYou can access the course content via a computer, laptop, and/or mobile devices (e.g., iPad, iPhone, Android phones and tablets, etc.). For mobile devices, go to the apps store (Apple or Android) to download Canvas apps.\r\nCourse Expectations\r\nThis course is self-paced and takes five weeks (one week per topic/module). To be successful, you should plan about 3-5 hours a week to interact with the course content, which includes watching the video vignettes, participating in discussions, learning important terms via crossword puzzles and Quizlets, and completing self-assessed quizzes. Further instruction is provided within each unit.\r\nQuizzes\r\nAll five quizzes are self-assessed and correspond to the five units/modules. You can take these quizzes multiple times as you need. The quizzes are to assess general understanding of the video vignettes. There are no due dates quizzes. However, make sure to complete them before the course end date.\r\nGrading\r\nThe instructors will not grade any quizzes or discussions.\n\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "Microbes Rule the World: Effects of Disease on History", 
    "price": 0, 
    "instructors": "Craig J. Oberg and Gene A. Sessions", 
    "institution_name": [
        "Weber State University"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.canvas.net/browse/webersu/courses/microbes-rule-the-world-7", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2016-07-11T00:00:00Z"
}