{
    "selfpaced": false, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    The Zika virus is suspected to be the cause of cases of microcephaly in newborns in South America, and this outbreak has now been declared a Public Health Emergency of International Concern by the World Health Organization. With global attention towards this disease increasing rapidly, it is becoming clear that there is limited knowledge around how the carriers, or vectors, of Zika, are best avoided and controlled.\n\nFocus on the Zika virus\nThis free online course will begin by considering the science behind the outbreak to try to understand where the Zika virus has come from, its symptoms, and its effect on infected individuals. Our attention will then turn towards the vector primarily responsible for transmission of Zika: the Aedes mosquito.\n\nExplore the biology of Aedes mosquitoes\nWe will introduce the Aedes mosquito and examine its lifecycle, behaviour, and distribution across the world, before reflecting upon the important role it plays in spreading Zika virus. Without a vaccine, prevention and control relies on reducing numbers of mosquitoes and the contact they have with people, so an understanding of the biology of Aedes is vital.\n\nDiscover vector control methods\nA range of methods employed to control the Aedes mosquito will be highlighted, including the use, importance, and suitability of repellents, impregnated clothing, larval control, insecticide spraying, and insecticide treated nets. The vectors of Zika virus also transmit dengue, yellow fever and the chikungunya virus, meaning there is potential to apply these techniques in other settings.\n\nLearn together and from those on the front line in South America\nLearners will come from all over the world with their own diverse experiences and interests. You will have the opportunity to exchange thoughts and ideas through course discussion, and hear first-hand accounts from experts and individuals working in the field in South America. Contributors include:\n\n\n  Dr Mary Cameron, Reader in Medical Entomology\n  Dr Jo Lines, Reader of Malaria Control and Vector Biology\n  Professor Laura Rodrigues, Professor of Infectious Disease Epidemiology and working with the Microcephaly Epidemic Research Group in Brazil\n  Professor Jimmy Whitworth, Professor of International Public Health.\n\n\n\n\n¡Ven y aprende con nosotros! | Venha aprender conosco!\nSubtítulos en Inglés, Español y Portugués serán disponibles para cada video. Estos se pueden encontrar haciendo clic en el icono en la parte inferior derecha de la ventana del reproductor. Transcripciones PDF, diapositivas y traducciones de páginas también serán disponibles en la sección ‘Downloads/Descargas’. Discusiones y avisos del curso, enviados al comienzo de la semana, estarán en Ingles solamente.\n\nVersões com legendas em espanhol e português estarão disponíveis em todos os vídeos. Para alterar, click no ícone que aparece no canto direito da tela. PDF, slides e outros materiais traduzidos estarão também disponíveis para download na seção etapa relevantes. Discussões, avisos e informações enviadas no início de cada semana serão escritas apenas em inglês.\n\nAbout ARCTEC\nARCTEC is an integral part of the Department of Disease Control at the London School of Hygiene &amp; Tropical Medicine and a world-leading independent test centre for consultancy and the evaluation and development of arthropod pest control technologies.\n\n\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Preventing the Zika Virus: Understanding and Controlling the Aedes Mosquito", 
    "price": 0, 
    "instructors": "James Logan", 
    "institution_name": [
        "London School of Hygiene & Tropical Medicine"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/preventing-zika?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-07-04T00:00:00Z"
}