{
    "selfpaced": false, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    The “why” and “how” of ageing has puzzled mankind ever since it questioned its place in the universe. However, it was only after infectious diseases became more controlled and reliable food supplies became generally available, that the rapid increase of the average lifespan made science turn its attention to study longevity and ageing.\n\nTo fulfil the desire to live longer and age healthier, it is essential that we better understand the intricate molecular processes that evolve in our body when we age.\n\nStudy the concepts and theories of ageing\n\nIn this free online course, you will study the current concepts and theories of ageing. You will learn about the molecular and cellular processes in ageing. You will explore the cell systems, animal models and advanced experimental methods that we use to study ageing.\n\nAfter introducing the main theories and mechanisms of ageing in the first week, we will proceed with a series of in-depth lectures from distinguished researchers working at the European Research Institute for the Biology of Ageing at the University of Groningen. They will present you a selection of their current research and will explain the fundamental questions they try to answer and the experimental approaches they use for their studies.\n\nYou will learn that ageing starts at the cell level and you will study several phenomena which take place in cells, such as genomic instability, telomere shortening and epigenetic changes.\n\nBy completing this course you will gain insight into the fundamental biology of ageing in various simple and complex organisms, including humans. This course will be particularly relevant for those who have a basic background in biology and want to know more about the biology of ageing.\n\n\n                                    ", 
    "end_date": "2016-06-13T00:00:00Z", 
    "title": "Why Do We Age? The Molecular Mechanisms of Ageing", 
    "price": 0, 
    "instructors": "Marianna Bevova", 
    "institution_name": [
        "University of Groningen"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/ageing?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-02T00:00:00Z"
}