{
    "selfpaced": false, 
    "topic_name": [
        "Biology"
    ], 
    "description": "\n\n                    \n                    \n                    【课程介绍】-------------------------------------------------------------------\n\n       人类社会进入21世纪生命科学发展迅猛，极大地改变和提高了人们的生产和生活水平，已经成为当今的主流科学。然而，它也经历了从荒蛮无知到博物学、生物学、现代生命科学的曲折过程。这里充满了人类睿智思考和大胆尝试，充满了旧思想束缚和新思想顽强抗争和成功突破。\n\n       《生命科学发展史》 虽然属于科学史范畴，但并没有按照实证主义编年史方法进行阐述，而是更多地采用思想史方法展开。课程通过介绍生命科学重要学科、重要发现和重要人物，系统地展示了生命科学产生和发展全貌。课程在讲解生命科学基本知识的同时，注重介绍知识产生和发展的社会和自然背景、注重剖析期间人类思维方式的变化和发展，旨在使学生全面系统地了解生命科学基本知识及其产生和发展历程，在拓宽学生的知识面和视野的同时，培养和提高学生的科学素养和独立分析问题的能力。\n课程要达到的目标：“拓宽知识，学会思考”\n\n【课程大纲】-------------------------------------------------------------------\n\n第一单元  绪论\n    （一）近三年《科学》十大进展\n    （二）课程简介\n第二单元  人类起源与发展\n    （一）宇宙的形成\n    （二）生命的出现\n    （三）人类的产生和发展\n第三单元  从古代哲学到近代科学\n    （一）关于宇宙和生命的哲学思考\n    （二）西方医学和生物学体系\n    （三）欧洲文艺复兴与生命科学\n第四单元  生物的分类和演化\n    （一）生物分类思想和方法\n    （二）达尔文及其进化思想\n    （三）达尔文以后的进化思想\n第五单元  人体生理学：人类的自我认识\n    （一）早期的生理学派\n    （二）神经和内分泌生理学\n第六单元  走近微生物世界\n    （一）显微镜与微生物种类\n    （二）认识致病微生物\n    （三）人类同致病微生物的抗争。\n第七单元  从细胞学说到胚胎发育\n    （一）细胞：组成生命体的基本单位\n    （二）胚胎：生命的开始\n    （三）克隆：惊奇的设想\n第八单元  生命是什么？从孟德尔的豌豆说起\n    （一）经典遗传学\n    （二）分子生物学\n第九单元  生物组学：不再钓鱼，而是捞鱼!\n    （一）人类基因组计划\n    （二）基因组测序技术和应用\n    （三）后基因组时代-生物组学和系统生物学\n第十单元  课程总结\n    （一）生命科学发展回顾与展望\n    （二）历年诺贝尔生理学或医学奖概览\n\n【教材教参】-------------------------------------------------------------------\n\n    《生命科学发展史》孟和  自编讲义\n    《生命科学发展史》姚敦义 主编，济南出版社，2005年5月。\n    《生物学思想发展的历史》Ernst Mayr, 涂长晟 等译, 四川教育出版社，1990 \n    《生命科学发展史》杨学仁 主编，武汉大学出版社，1990.11.01\n    《生命科学史》Lois N. Magner, 李难，崔极谦，王水平译，百花文艺出版社《生物科学发展史》尹淑媛 陈麟书 编著，成都科技出版社 1989.10\n    《寻找生命的逻辑》 方舟子 著，上海交通大学出版社 2005.10\n    《双螺旋：发现DNA结构的故事 》J.D.沃森，科学出版社 ，2006 . 2\n    《创世纪的第八天》霍勒斯•贾德森著 李晓丹译 , 上海科技出版社 2005.1\n    《生命是什么》埃尔温•薛定谔，湖南科学技术出版社，2005. 3 \n    《基因论》摩尔根 著，北京大学出版社，2007\n    《物种起源》达尔文，新世界出版社，2007\n    《解码生命》贺林，科学出版社，2000\n\n                                            Syllabus\n                        第一章 绪论我们的课程将首先介绍近三年《科学》杂志遴选出的科学十大进展；从科学、哲学、宗教、技术和科学史的概念和内容入手，讲解《生命科学发展史》课程的定位、目标和任务，并介绍课程的内容、教学方法、考核内容和参考书籍以及教学网站和教师联系信息等，使同学们全方位地了解这门课程的情况，同时也方便与老师的交流。第二章 人类起源和发展在这一单元的课程中我们将从最神秘的太阳系开始介绍（太阳系的形成；地球的诞生和生命的起始）。让大家来来了解宇宙的浩瀚和我们赖以生存的地球在宇宙中的状况和地位，同时我们还可以学习生命出现和繁衍的大致时间和脉络，了解人类社会的形成和发展。第三章：从古代哲学到近代科学今天我们一起来看看苏格拉底、柏拉图和亚里士多德等希腊和罗马时期先哲们关于宇宙和生命的哲学思考。再来了解了解以希波克拉底和盖伦为代表的西方医学和生物学体系。最后思考欧洲文艺复兴的社会和历史背景及其与生命科学发展的关系。第四章 生物的分类和演化我们这一单元的课程提出了3个问题：一是地球上有多少种生物？二是这些生物该怎么去分类？三是这些物种的来源和演化？我们将从达尔文前、达尔文时期和达尔文后三个时期，系统地介绍多种进化学说。同时会带你一起剖析达尔文创立“自然选择学说”中的前前后后，包括他本人的成长经历和思想经历，从历史和社会的角度分析比较了这些进化理论的亮点和不足。第五章：人体生理学：人类的自我认识生理学，这个概念很大很宽泛，以至于诺贝尔奖对生命科学的奖励设为“生理或医学奖”。早期的3个生理学派（医学机械学派、医学化学学派、德国生理学派）以及至今仍影响着人们，那今天就让我们一起探讨“实验生理学”“、内稳态理论”、“神经生物学”和“内分泌生理学”中的奥秘吧。第六章：走近微生物世界微生物的分为原核微生物、真核微生物和非细胞类。巴斯德根据曲颈瓶实验提出：“一切生命物质来源于生命物质”；科赫提出了“科赫原则”；杜馬克发现了磺胺类药物；弗莱明发现了青霉素；贝杰林克发现了病毒（Virus）；琴纳与免疫学；梅契尼可夫与“细胞免疫学说”；艾尔利希与“体液免疫学说”；“天然抗体选择学说”、“克隆选择学说”、“单克隆抗体”……还不快快加入？第七章：从细胞学说到胚胎发育这一单元我们从显微镜的产生和运用谈起，引出细胞学说，并介绍比夏的“组织”定义、布朗发现“细胞核”、奥肯的“原生质”概念、弗莱明发现“染色质”、施莱登和施旺提出的“植物细胞和动物细胞一样，都含有细胞膜、细胞内含物和细胞核”，以及威尔赫提出的“一切细胞来自细胞”的伟大论断。同时也带你了解最新的胚胎操作技术，包括胚胎克隆、体细胞克隆、干细胞、ips细胞、转基因克隆等。第八章：生命是什么？从孟德尔的豌豆说起生命是什么？我们要从孟德尔的遗传定律“分离规律”和“自由组合规律”谈起，看看孟德尔成功的主要原因是什么？运气？兴趣？1957年克里克提出的“中心法则”及其意义。结合DNA聚合酶、tRNA、mRNA、RNA逆转录酶、乳糖操纵子、跳跃基因、遗传密码全部破译等发现，我们尝试回答薛定谔在1943年提出的问题“生命是什么”.第九章：生物组学：不再钓鱼，而是捞鱼!本单元我们将学习人类基因组计划的动因、内容、特点和挑战，以及由此催生出的基因组学及其对整个生命科学领域和社会的影响。看看三代基因组测序技术的异同，第一代测序技术（Sanger双脱氧终止法）、第二代测序技术（基于整体信号的高通量测序技术）和第三代测序技术（基于单分子的测序技术），以及在人类疾病和动植物微生物基因组测序上的重要作用。第十章：课程总结我们的课程将生命科学发展定义为：古代对生命的认识（人类产生－17世纪）、博物学时期（18世纪）、近代生物学（19世纪）、现代生物学（20世纪）、当代生物学（21世纪）几个时期，并对每个时期的特点进行了分析介绍。在此基础上总结未来生物学发展的趋势和特点：学科进一步交叉（物理、化学、材料、计算机等）、在生物组学（基因组学，蛋白质组学，转录组学，代谢组等）基础上向系统生物学方向发展。\n                                    ", 
    "end_date": "2016-08-21T00:00:00Z", 
    "title": "生命科学发展史", 
    "price": 0, 
    "instructors": "孟和", 
    "institution_name": [
        "Shanghai Jiao Tong University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/shengming-kexue-fazhanshi", 
    "duration": "10 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-12T00:00:00Z"
}