{"selfpaced": false, "topic_name": ["History"], "description": "\n\n                    \n                    \n                    The British Empire was the largest empire ever seen. It ruled over a quarter of the world’s population and paved the way for today’s global economy. But British imperialism isn’t without controversy, and it continues to cause enormous disagreement among historians today. This free online course will help you understand why.\n\nExplore the British Empire through six controversial themes\n\nOver six weeks, we’ll explore the British Empire through six themes - money, violence, race, religion, gender and sex, and propaganda. You’ll get to hear the stories of the fascinating individuals who contributed to both its rise and fall.\n\nAlong the way, you’ll be able to debate the questions these themes raise with learners from around the world, and draw your own conclusions.\n\nLearn from experts in imperial history and develop your own ideas through conversation\n\nThis course has been created by experts from the Centre for Imperial and Global History at the University of Exeter. The Centre brings together the strong research expertise of the University’s imperial historians. It comprises one of the largest groups of imperial and global historians currently working in the UK.\n\nThe lead educator for this course is Richard Toye - Professor of Modern History and author of several acclaimed books, including “Churchill’s Empire: the World That Made Him and the World He Made.” Richard has provided a taste of this course in his post for the FutureLearn blog: “Why is the British Empire still so controversial?”\n\nRichard and his colleagues won’t be able to join the discussions themselves or respond to individual comments, but the course encourages a strong learning community. The learning is focussed around debate and discussion - supporting other learners, sharing your own experience and knowledge, and listening to new perspectives. We hope that you will enjoy interacting with and learning from each other in this way.\n\nYou can start to explore the Empire and find out more about the Centre for Imperial and Global History on its blog, Imperial &amp; Global Forum, or by following @ExeterCIGH on Twitter.\n\nThis course has been commended by the Royal Historical Society, as part of the Public History Prize 2015, in the Web and Digital Category.\n\n\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Empire: the Controversies of British Imperialism", "price": 0, "instructors": "Richard Toye", "institution_name": ["University of Exeter"], "commitment": "3 hours", "subject_name": ["Humanities"], "course_url": "http://www.futurelearn.com/courses/empire?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-05-30T00:00:00Z"}