{"selfpaced": false, "topic_name": ["History"], "description": "\n\n                    \n                    \n                    This course explores the history of Missouri during the Civil War era. It begins with three controversies that resulted from slavery’s expansion into the trans-Mississippi West—the Missouri Compromise, “Bleeding Kansas,” and the Dred Scott ruling—and uses them to explain how Missouri often stood as a flashpoint of national politics. Time and again, Missouri stood near the middle of sectional disputes over the future of slavery and liberty.A fiercely contested border state, Missouri was caught between not only the North and South but also the East and West. Like its neighbor, Kentucky, it was a slaveholding state that remained within the Union. Federal troops established a tenuous hold upon the state by the second year of the Civil War, yet they struggled to contain the irregular warfare that consumed much of Missouri. To maintain order within this divided society, Union leaders imposed martial law, loyalty oaths, and other increasingly stringent tactics. In addition, the eventual embrace of emancipation by federal troops and Radical Unionists showed how “hard war” came to the trans-Mississippi West years before it struck the Deep South.Wracked by bitter internal divisions, Missouri also suffered the worst guerrilla violence of the entire Civil War. Much of the course will examine this singularly devastating experience. As Union forces proved unable to defeat or expel pro-Confederate guerrillas from the state, federal commanders shifted their focus toward the civilians - many of them female - who fed, clothed, and sheltered these irregular fighters. This shift culminated in the 1863 execution of Order Number 11, which forcibly ejected several thousand civilians from four Missouri counties.The course concludes by assessing the Civil War’s legacies for freed people of color, defeated Confederates, and other Missourians. Looking to Reconstruction and the end of the nineteenth century, it reveals how Missouri illustrated both the promise and the limits of postwar reconciliation. Figures like Jesse James captured national attention but reflected the deep tensions that continued to grip Missouri. A string of films, from “True Grit” to “The Outlaw Josey Wales” and “Ride with the Devil,” suggests that the continued fascination with Missouri’s Civil War will persist into the twenty-first century.\n\n                                    ", "end_date": "2015-12-14T00:00:00Z", "title": "Missouri's Civil War", "price": 0, "instructors": "Jeremy Neely", "institution_name": ["Missouri State University"], "commitment": "2-3 hours", "subject_name": ["Humanities"], "course_url": "https://www.canvas.net/browse/missourisu/courses/missouri-civil-war", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Canvas.net"], "start_date": "2015-10-19T00:00:00Z"}