{"selfpaced": true, "topic_name": ["History"], "description": "\n\n                    \n                    \n                    This is a survey of ancient Greek history from the Bronze Age to the death of Socrates in 399 BCE. Along with studying the most important events and personalities, we will consider broader issues such as political and cultural values and methods of historical interpretation.\n\n                                            Syllabus\n                        Prehistory to HomerWe will start our first module with an overview of the physical and geographical setting for our class – “the Greek world.” Then we will move rapidly across many centuries, beginning with two Bronze Age civilizations: Minoan on the island of Crete, and Mycenaean on the mainland. Our evidence for both of these is almost purely archaeological, and so you can consider the ways scholars have interpreted material remains to build a picture of how the societies were structured.  After the collapse of Mycenaean civilization, there followed the so-called Dark Ages. These four centuries pose for us the challenge of reconstructing what happened during a long period that has left relatively little evidence. We will conclude this module with an all too brief consideration of the two magnificent Homeric epics, the Iliad and the Odyssey, whose stories and heroes became essential elements in Greek cultural identity. The Archaic Age (ca. 800-500 BCE)Module 2 brings us into the turbulent, creative Archaic Age, during which the Greeks acquired a cultural identity distinct from that of their neighbors in the Eastern Mediterranean.  They developed their characteristic form of community, the polis, or “city-state.” With a rebound in population, moreover, they founded numerous colonies abroad. In addition, the Greeks recovered literacy, which enabled them to write down law codes for the poleis. The newly established communities had a new form of military organization, the hoplite army, manned by citizen-soldiers. The lyric poets of that era wrote verses that address such great social changes, and also offer vivid accounts of individuals’ emotions and opinions.  The module ends with another poet, Hesiod, somewhat later and less famous than Homer, but also very significant. His subjects range from the origins of the cosmos and the gods, to personal ethics, to practical advice about farming. Two City-States: Sparta and AthensIn Module 3 we will analyze some major political developments in the Archaic Age, which were largely responses to the huge societal changes discussed in Module 2.  We will focus on Sparta and Athens. Sparta evolved into a unique hoplite-polis, famed for strict discipline and military prowess. Athens followed a very different path, showing the first traces of democracy. We will also observe how tyrannies arose in many poleis, often, paradoxically, to the community’s benefit. In fact we can now consider the historical effect of individual leaders, like the renowned lawgivers, Lycurgus of Sparta and Solon of Athens. Both men came to be revered as the “founding fathers” of their poleis. Both men also belonged to the legendary Seven Sages, who were famed for their wisdom. The module concludes with a consideration of Peisistratos, who ruled Athens as a tyrant in the mid-6th-century BCE and led the Athenians to new levels of power and prosperity.Democracy. The Persian WarsModule 4’s sessions will begin by focusing on the crucial decade at the end of the 6th century, when the Athenians instituted full democracy. In fact the development of democracy is one of the principal reasons to study Greek history.  Athens was also the adopted home of Herodotus, who was the first author in the West to characterize his writing as history. Herodotus chose to recount the first great clash of cultures in the West, the conflict between Greece and Persia, and his story goes far beyond the war and its battles. He was deeply concerned with how societies define themselves. The breadth of his interests, his insight and his good humor all contribute to the appeal of his work. We will also observe how Athens, under the leadership of the brilliant general Themistocles, began to transform itself into a formidable naval power. \"The Great 50 Years\" (ca. 480-431 BCE)Module 5 surveys the period between the end of the Persian Wars and the outbreak of the Peloponnesian War, which came to be known as Athens’ “Golden Age.” After the Persian Wars, there grew an alliance of Greek states that was meant to maintain security. The allies asked the Athenians to lead the confederation, called the Delian League. We will examine how the league was gradually transformed into an empire dominated by Athens. We will also discuss the extraordinary Pericles, who was a leader in the expansionist Athenian democracy and shaped many of its policies.  In addition we will pay some overdue attention to the role of women in Greek society, with a consideration of the character of Antigone and a more general assessment of women’s status. We will conclude with an – again, too brief – account of the great building program that produced the Parthenon and the other renowned monuments on the Athenian Acropolis.The Peloponnesian War IFor Module 6, we turn first to Thucydides the Athenian. He “wrote the war” that broke out between the Athenians and the Spartans and their allies and eventually affected almost all the Greek poleis. Thucydides’ method is very different from that of Herodotus. His style seems aloof, austere, dispassionate and scientific, and his narrative is much more tightly focused on the progress of the war. Nonetheless, he also has his own particular modes of interpretation that convey some powerful images and opinions. We will also look at the comic genius Aristophanes, whose Acharnians is a trenchant fantasy about an ordinary Athenian who is sick of the war and makes a private peace with Sparta. The Module concludes with Alcibiades, the dazzling rogue who dominated Athenian political life during the later stages of the war. We will also consider the social milieu in which he flourished. The End of the War, the End of the CenturyThe final Module brings us to the end of the fifth century and beyond. The charismatic Alcibiades persuaded his fellow citizens to invade Sicily. Eventually they were routed. Along with the events of the end of the war, we will consider the social and economic importance for Athens of foreign residents (metics) and slaves. Despite the catastrophe in Sicily, the Athenians kept fighting for almost a decade. After their final defeat, they endured a period of oligarchic domination and a brief but vicious civil war. Although they resolved it with a general amnesty, it is likely that the lingering anxiety contributed to the prosecution and conviction of Socrates in 399 BCE.  In response to prior learners’ requests, the module ends with a lecture about Philip II and Alexander the Great. The Macedonians also offer a salutary reminder that Greek history is a capacious subject that should not be artificially limited to the Classical period.Course Pages\n                                    ", "end_date": "2013-10-20T00:00:00Z", "title": "The Ancient Greeks", "price": 0, "instructors": "Andrew Szegedy-Maszak", "institution_name": ["Wesleyan University"], "commitment": "3-5 hours", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/ancient-greeks", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2013-09-01T00:00:00Z"}