{"selfpaced": false, "topic_name": ["History"], "description": "\n\n                    \n                    \n                    The course The Mediterranean, a Space of Exchange (from Renaissance to Enlightenment) aims to explain the Mediterranean, using history and the analysis of the past, as a space generated by routes and circulation. We consider it crucial to disclose mobility as a historical factor: a mobility comprised of four major elements, namely people, objects, ideas and practices. In our analysis of Mediterranean reality between the fifteenth and sixteenth centuries, from the Renaissance to the Enlightenment, we will pay particular attention to its western shores, an area seething with transfers and exchanges, in the social and economic spheres as well as the political and cultural, with the Iberian Peninsula, the various islands and the Italian Peninsula, all spaces of great dynamism.\n\nEl curso El Mediterráneo, espacio de intercambios (del Renacimiento a la Ilustración) quiere explicar, desde la historia y el análisis del pasado, el Mediterráneo como un espacio generado por las rutas y las circulaciones. Consideramos necesario divulgar la movilidad como factor histórico. Una movilidad centrada en cuatro grandes ámbitos: las personas, los objetos, las ideas y las prácticas. Al analizar la realidad mediterránea entre los siglos XV y XIX, del Renacimiento a la Ilustración, ponemos un foco especial en su orilla occidental, un área abocada a la transferencia y el intercambio, tanto en el ámbito social y económico como en el político y cultural, con la Península Ibérica, las islas y la Península Itálica como espacios de gran dinamismo.\n\n                                            Syllabus\n                        IntroductionThe Mediterranean and its History - El Mediterráneo y su historiaThe Mediterranean through the Eyes of Travellers and Artists - El Mediterráneo visto por los viajeros y los artistasThe Mediterranean, a Space of Powers - El Mediterráneo, un espacio de poderesThe Mediterranean at War - El Mediterráneo, guerra y conflictos The Mediterranean, a Network of Ports - El Mediterráneo, red de puertos The Mediterranean, Beliefs and Lifestyles - El Mediterráneo, creencias y formas de vida The Mediterranean on the Table: Food and Culture - El Mediterráneo en la mesa: cultura alimentariaThe Mediterranean and the Atlantic World - El Mediterráneo y el mundo atlántico  Final assignment / Prueba final\n                                    ", "end_date": "2016-08-05T00:00:00Z", "title": "The Mediterranean, a Space of Exchange (from the Renaissance to Enlightenment)", "price": 0, "instructors": "Xavier Gil, Mariàngeles Pérez Samper, Àngel Casals, Jaume Dantí, Diego Sola, Miquel Àngel Martínez, Joan-Lluís Palos, Ida Mauro and Mariela Fargas", "institution_name": ["University of Barcelona"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/mediterraneanhistory", "duration": "9 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-03T00:00:00Z"}