{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Social Sciences\n                                                                                                    &gt; Law\n                                                            \n                            \n                                                \n                    \n                    \n                    This course will give you a glimpse into six different areas of American law: Tort Law, Contract Law, Property, Constitutional Law, Criminal Law, and Civil Procedure. You will gain insight into the complexities and dilemmas that arise from the application of law in different settings, and what is distinctive about American approaches.\n\n                                            Syllabus\n                        Welcome Tort LawTort law governs how people may sue each other civilly (as opposed to criminally) in order to receive compensation for harms or injuries other people caused them. In this module, Professor Allen will explore the goals of tort law through a historic case. She will address what makes tort law distinct and issues surrounding negligence and liability.Contract LawContract law governs how promises between two individuals are enforced. Few areas of law impact our daily lives as much as contract law, and in this module you will gain a deeper understanding of what a contract is and what makes it enforceable. Professor Wilkinson-Ryan will address what constitutes a contract, why the law enforces them, the legal meanings of words in contracts, and the important requirement of consideration. Expectation damages, or the amount a court orders someone who breached a contract to pay will also be explored, all through hypothetical and real cases.Property LawProperty law governs the relationship between individuals and things, known as property. In this module, Professor Balganesh will explore the differences between property and tort and contract law and about several specific examples of property law in action: adverse possession, landlord/tenant, and licenses. You will learn about what makes U.S. property law distinct - its origins in common law, imprint of legal realism, and pragmatism.Constitutional LawThe study of constitutional law is among the most exciting parts of the law because it provides for the structure and functioning of the U.S. government. In this module, Dean Ruger will address the document itself, how it has been applied over time, the history of the document, and what makes it unique. The structure of  the U.S. government as a government of limited, separated powers will be explored along with the important individual rights the Constitution provides and how the U.S. Constitution compares to others around the world. Criminal LawIn this module, Professor Morse will focus on the basics of criminal law, an area of law so exciting that countless TV shows and movies have been based on it. The major aspects of criminal law will be discussed - why we impose punishment, when we impose the most punishment, and how the state proves a criminal case. Defenses to criminal charges, which are divided into justifications and excuses will also be addressed.Civil ProcedureIn this module, Professor Wolff will introduce us to some of the major issues in civil procedure law. Civil procedure is the study of the rules of court that must be followed by the judge and parties in civil cases (as opposed to criminal cases – criminal procedure is a whole other area of the law, but law students learn civil procedure first because it gives the structure of typical trials). The essence of a law school civil procedure course is the study of the Federal Rules of Civil Procedure. A copy of these is linked in the syllabus for you to scan. The rules tell you how to file a lawsuit and how the court must function while it is considering a lawsuit. Professor Wolff will introduce you to the doctrinal area of procedure and will highlight some of the major modern issues in procedure law.Final Exam\n                                    ", 
    "end_date": "2016-09-05T00:00:00Z", 
    "title": "An Introduction to American Law", 
    "price": 0, 
    "instructors": "Anita Allen, Theodore Ruger, Tess Wilkinson-Ryan, Tobias Wolff, Shyam Balganesh and Stephen Morse", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/american-law", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-07-18T00:00:00Z"
}