{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    This is an introduction to Intellectual Property Rights and more specifically to Copyrights. This course is not intended to be an academic course but rather a practical introduction for anyone who creates original materials or who uses, reuses, mixes, adapts and mashes original materials that were created by others. This course is therefore useful for teachers and course creators, students, professionals who are working in creative jobs, artists, directors, web designers and writers, musicians, composers and video makers. In brief, everyone who creates and consumes original digital and analogue materials and who wants to know more about their rights and duties as a creator or user of original content materials. This is not intended to be a comprehensive academic course but rather a short practice driven learning experience. It is also not a course for legal professionals, but the course cannot avoid discussing legal aspects. This MOOC consists of a number of video and audio interviews that introduce different perspectives on IPR and copyrights: the perspective of the law, of the artist-creator, of the researcher, of the end user and of the challengers. Each course chapter will start with such an interview, students will be given a weekly task of a (research) assignment related to the specific topic of each chapter, a discussion forum will run through all chapters: each week focusing on specific issues related to the week’s topic. As a fil rouge, a quiz will run throughout the whole module, this quiz is based on real life cases of copyright use and abuse, it will illustrate the theoretical background of each chapter with concrete examples. At least one webinar will be organised in order to facilitate group discussion and interaction. Provided learning materials contain recommended readings, presentations, recordings.\n\n                                            Syllabus\n                        Chapter 1: From the Statute of Anne to Mickey Mouse: Background and a brief history of IPR and Copyrights, types of rights.Chapter 2: IPR and Copyright in a research and education perspective, academic views.Chapter 3: I fought the law and the law won. A legal perspective.Chapter 4: Rendezvous with the creator.Chapter 5: Pirate Bay, Plagiarism, Creative Commons and how users and activists deal with copy- and other rights.Chapter 6: Future visions, possibilities and developments in the digital era.\n                                    ", 
    "end_date": "2015-12-07T00:00:00Z", 
    "title": "Copyright - DIY", 
    "price": 0, 
    "instructors": "Mathy Vanbuel", 
    "institution_name": [
        "ATiT"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://platform.europeanmoocs.eu/course_copyright_diy", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "EMMA"
    ], 
    "start_date": "2015-10-26T00:00:00Z"
}