{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/droit\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/droit-001/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    droit-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Ce cours propose d'aborder quinze thèmes qui font l'objet de problématiques contemporaines à la fois dans les ordres juridiques nationaux et dans le droit international.Partant du constat que de plus en plus de questions et de procès sont réglés aujourd'hui par l'application de règles émanant de plusieurs droits différents, nous proposons de confronter le point de vue du comparatiste (sur les ressemblances et les différences entre ordres juridiques nationaux) et le point de vue de l'internationaliste (sur les règles formulées par les Etats et les \"créatures\" qu'ils établissent).Ce cours part de la notion classique d'ordre juridique (national ou international), en considérant que ces ordres juridiques ne constituent pas des \"bulles\" parfaitement indépendantes les unes des autres, mais sont souvent en interaction via une relative circulation des notions et règles juridiques. Le croisement des deux perspectives amène à mettre en valeur les continuités et discontinuités, parfois les imbrications et les oppositions entre les droits nationaux, régionaux et internationaux.\n\n                                            Syllabus\n                        Semaine 1:Cours 1: Méthodologie et approches des ordres juridiques\ninternesCours 2:  Méthodologie et approches des ordres juridiques internationaux.Cours 3: L’identification de l’État (droit comparé)Semaine 2:Cours 4: L'identification de l'Etat (droit international)Cours 5: La responsabilité interne de l'EtatCours 6: la responsabilité internationale de\nl’ÉtatSemaine 3 :Cours 7: Les constitutionsCours 8: La Charte des Nations UniesCours 9: Les autorités indépendantes.Semaine 4 :Cours 10: Les organisations internationales.Cours 11: Le fédéralismeCours 12: les organisations régionalesSemaine 5 :Cours 13: La loiCours 14: le droit international coutumierCours 15: Le droit des contratsSemaine 6:Cours 16: Le droit des traités.Cours 17: Les limites à la liberté de contracter (droit comparé)Cours 18: Les limites à la liberté conventionnelle (droit international)Semaine 7 :Cours 19: La\nfonction du juge nationalCours 20: La fonction du juge internationalCours 21: L'usage du droit international par le juge (perspective de droit comparé)Semaine 8: Cours 22: L'usage du droit international par le juge (perspective de droit international)Cours 23: Le droit pénalCours 24: La sécurité collectiveSemaine 9:Cours 25: Les garanties des droits de l’homme  (perspective de droit comparé)Cours 26: Les garanties internationales et régionales des droits de l'hommeCours 27: Les statuts personnels et la nationalité  (perspective de droit comparé)Semaine 10:Cours 28: La nationalité en droit internationalCours 29: Droit commercialCours 30: Droit de l’OMC\n                                    ", 
    "end_date": "2015-07-09T00:00:00Z", 
    "title": "Droit international et droit comparé: regards croisés", 
    "price": 0, 
    "instructors": "Jean-Louis Halpérin and Florian Couveinhes-Matsumoto", 
    "institution_name": [
        "École normale supérieure"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/course/droit", 
    "duration": "10 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-04-30T00:00:00Z"
}