{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    The Common Law of England and Wales is one of the major global legal traditions. In order to understand the common law, we need to deal with its history, and the development of its characteristic institutions like the jury, judge made law, parliamentary sovereignty and due process. We also need to ask some critical questions. What role does democracy play in the development of the common law? To what extent are human rights central to the modern common law? How does the common law of England and Wales relate to the law of the European Union? Answering these questions will give us insights into the current challenges the law faces and its possible futures.\n\n                                            Syllabus\n                        Week One: Dead Kings and Presidents: A Brief History of the Common LawWeek one introduces you to the history of the Common Law, from armies and kings through to modern family life. We will journey through the evolution of the Common Law to the system we see today. By the end of this week, hopefully you'll understand more about: 1. Understand some of the process involved in the Justice System 2. Understand the history of the development of the common law. Week Two: See You In Court: The Court System and the Common LawWelcome to week 2 of English Common Law. Learning outcomes this week: 1. Describe the Hierarchy of the UK Courts, the Judges who sit there and their Judicial roleWeek Three: Supreme Power: Parliamentary Sovereignty and Law Making Welcome to week 3 of English Common Law. Learning outcomes this week: 1. Explain the concept of Parliamentary Sovereignty 2. Describe the journey of a BillWeek Four: Wigs and Pens: Judicial Law Making and the doctrine of Precedent  Welcome to week 4 of English Common Law. Learning Outcomes this week: 1. Explain the Court Hierarchy in relation to precedent 2. Identify ways in which precedent may be avoided 3. Discuss the advantages and disadvantages of precedentWeek Five: Reading the Riot Act: How Statutes are Interpreted Welcome to week 5 of English Common Law. Learning Outcomes this week: 1. Explain the role of Judges in interpreting the law 2. Compare the rules of interpretation and identify the rules of languageWeek Six: After the War, Before the Peace: The European Union and Human RightsWelcome to week 6 of English Common Law. Learning Outcomes: 1. Explain the effect of the European Communities Act 1972 on Parliamentary Sovereignty 2. Identify the effect on precedent and statutory interpretation 3. Discuss the effect of the Human Rights Act 1998  \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "English Common Law: Structure and Principles", 
    "price": 0, 
    "instructors": "Dame Hazel Genn of UCL", 
    "institution_name": [
        "University of London International Programmes"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/common-law", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}