{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    Whether you are an EU citizen or not, this course concerns you! The EU is a major global actor in the field of human rights. EU treaties state that human rights are a fundamental value of the Union, which must be a silver thread in all its policies. The EU now acts within an impressive array of competences, and therefore has the potential to impact – positively or negatively – anyone’s human rights.\n\nThis EU and Human Rights course teaches the basics of human rights, placing the EU at the centre of investigation. The course will examine a number of key questions:\n\nWhat factors are key to making the EU a positive or a negative force for human rights? An example is the economic crisis: what impact has it had on people’s human rights in the EU and the world?\n\tWhich actors, friends or foes, must the EU engage with to successfully promote human rights? Examples include NGOs, businesses, or other international organisations like the Council of Europe or the United Nations.\n\tIn key policy sectors in which the EU is active, what is on balance the impact of the EU? Examples include trade, development, migration, social policy or international crisis management.\nAll of the course activities aim to improve your understanding of how the EU, alone or in combination with other local or global, state or non-state actors, can better promote and uphold human rights worldwide. The course is intended for anyone interested in human rights and the EU, human rights law, European law, European Studies, international relations, global governance, etc. It is divided into four modules:\n\nThe EU and Human Rights: Value Promotion and Coherence\n\tPromoting Human Rights inside the EU\n\tPromoting Human Rights in EU External Action\n\tCapitalising on Success and Remedying Flaws\nThis course is taught by leading academics, and the content is illustrated through interviews of practitioners in the field of the EU and human rights. The course also comprises a wealth of bibliographical resources, and frequent exercises to test what you have learned.\n\nThis MOOC is based on the FRAME project (www.fp7-frame.eu), which has received funding from the European Union’s Seventh Framework Programme for research, technological development and demonstration. (Grant Agreement No. 320000)\n\n                                    ", 
    "end_date": "2016-08-02T00:00:00Z", 
    "title": " EUHURIx : The EU and Human Rights", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "KU Leuven University"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/eu-human-rights-kuleuvenx-euhurix-0", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-06-21T00:00:00Z"
}