{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    The European Union is one of the world’s largest and most important economies. This five week course is the first in a series of three that will provide students with an insight into European Business Law. The series ranges from considering the basic structures and principles of the European Union to focusing on various specialized areas of law. Each course will give the students an understanding of the laws and policies that regulate the internal market of European Union, as well as relevant case law and useful inputs from leading practitioners in the field. \n\n\nRecommended Reading\n\nThe course is useful to persons both inside and outside the European Union, whether they are students, professionals, or simply interested in the European Union and European Business Law. Prior knowledge of law and the European Union is an advantage, but not a prerequisite. We have added an introduction module in the first course providing students with an overview of the history, institutions and legal method of the European Union. \n\n\nAbout the Series\n\nIn the first course, Understanding the Fundamentals, we will examine the core structures and principles of the European Union as well as the main sources of law. In the second course, Doing business in Europe, we will focus on the main laws that regulate various aspects of establishing and running a business within the European Union. In the final course, Competing in Europe, we will go into more depth about how to compete on the internal market and protect your brand, product or invention. \n\nThe first course will start on January 11th 2016. We are currently working on the second and third courses in the series, and they will be launched in the spring of 2016. To keep up to speed on the course series, visit our Facebook page at:\n\nhttps://www.facebook.com/eblmooc/\n\n\nSyllabus and Format\n\nEach course consists of a number of modules where one module represents about one week of work. A module includes a number of lectures and readings, and finishes with a voluntary assessment – a quiz, a small peer graded assignment or a case law review. The assessments are intended to encourage learning and ensure that you understand the material of the course. Participating in forum discussions is voluntary. Please note that the syllabus of the second and third courses are subject to change, as they are being revised.\n\nCourse I - Understanding the Fundamentals\n\nModule 1.\tIntroduction \nModule 2.\tLegal method and sources \nModule 3.\tConstitutional freedoms and fundamental principles \nModule 4.\tFreedom of movement \nModule 5.\tThe External Dimension \n\nCourse II - Doing Business in Europe \n\nCourse III - Competing in Europe\n\n\nFAQ\n\n1. Will I get a certificate after completing this class?\nStudents who successfully complete a course in the series will receive a Course Certificate. \n\n2. Do I earn Lund credits upon completion of this class?\nThe certificate is not part of a formal qualification from Lund University. \n\n3. What resources will I need for this class?\nThe students are not required to purchase a textbook since all readings will be provided online. All reading materials are free and will be available to use for the duration of the course.  \n\n4. What are the learning outcomes of this course and why should I take it?\nThis course is ideal for anyone planning to work or do business in a European context. Those preparing for a legal career will also benefit from the course. Last but not least, anyone curious about European Business Law will have a great learning experience. \n\nAt the end of this course, you will have a basic understanding of how to: \n•\tNavigate EU legal sources\n•\tFind and understand relevant laws and regulations governing the internal European Union market \n•\tEstablish and run a company within the European Union \n•\tSet up agreements and resolve cross-border disputes, employ staff and navigate environmental standards and tax regulations \n•\tProtect and defend a company’s products, brands and inventions by obtaining and licensing trademarks and patents\n•\tCreate a competitive edge for a company and apply the basic principles of EU competition law\n\n5. Can I contact the course instructors directly?\nThe course staff will participate in the discussion forum and welcome questions and comments. We encourage the students to be active and engaged, interacting with other participants and sharing ideas.   \n\n\nLund University\n\nLund University was founded in 1668. The Faulty of Law is a modern faculty with an international profile, welcoming both international and Swedish students. The university offers two international Masters: European Business Law and Human Rights Law. The former provides an in-depth understanding of both the practical and the theoretical aspects of business law within the European Union. The programme provides both general and specific knowledge of the European Union legal framework, which is necessary for students intending to work as legal advisors or business decision-makers. \n\nEducation, research and interaction with the surrounding community are the main focus of the Faculty’s work. The connection between the three is particularly apparent in the programmes and courses offered by the university, including the university’s MOOC course in European Business Law. The students get the chance to engross themselves in traditional legal studies, while interacting with both researchers and professionally active lawyers with qualifications and experience from various areas of law.\n\n                                            Syllabus\n                        Introduction to EU LawWelcome to the first week of Understanding the Fundamentals. In this module we will introduce the course and give you a brief synopsis of the history and institutions of the EU. Also, we will present an overview of the Court of Justice of the EU. Finally, you will get an insight into the Legal Method of the EU.Legal ResourcesThe second module will give you a practical introduction to the sources of EU law. The lessons will cover the available online resources and EU legal databases and how to find documents. You will also learn how to search the official journals, including the case law of the ECJ. In addition, the module introduces the various treaties, regulations and directives, what they are and where to find them online.Fundamental PrinciplesModule 3 covers the constitutional freedoms and fundamental principles of EU law. This includes the \n\nthree categories of competence – exclusive, shared and supporting. The effects of the exercise of \n\ncompetence are discussed, as well as relevant case law. A brief historical background is given to the \n\nprinciple of fundamental rights along with its application in contemporary Europe. Finally some of the \n\nmain principles of EU law are discussed, including the principles of proportionality, non-discrimination \n\nand legal certainty.The Economic FreedomsModule 4 introduces the four freedoms, including free movement of services, goods, persons and capital. The module considers the relevant legal provisions and the key case law. It continues to introduce the right to establishment and discusses the harmonisation of EU law in the national law of member states. Please note that this module includes a peer graded assignment. You will find it under \"Assessments\". The External DimensionModule 5 focuses on the common foreign policy of the EU and its institutional setup. The division of competence is discussed, followed by a review of the seven main EU institutions and players and their respective role relating to foreign policy. The module gives a thorough overview of the six fields in the external dimension of EU Law: Common commercial policy; EU development policy; Foreign and Security Policy; Security and Defence Policy; Energy Market; Freedom, Security and Justice. Finally, the module gives a brief history of the EEA Agreement, as well as its application.\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "European Business Law: Understanding the Fundamentals", 
    "price": 0, 
    "instructors": "Jörgen Hettne, Cécile Brokelind, Sanja Bogojevi ć, Michael Bogdan, Anna Wiberg, Mia Rönnmar  and Björn Lundqvist", 
    "institution_name": [
        "Lund University"
    ], 
    "commitment": "10-15 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/european-law-fundamentals", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}