{
    "selfpaced": true, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    Learn about contracts from Harvard Law Professor Charles Fried, one of the world’s leading authorities on contract law. Contracts are promises that the law will enforce. But when will the law refuse to honor a promise? What happens when one party does not hold to their part of the deal?\nWe are exposed to contracts in all areas of our life — agreeing to terms when downloading a new computer program, hiring a contractor to repair a leaking roof, and even ordering a meal at a restaurant. Knowing the principles of contracts is not just a skill needed by lawyers, it illuminates for everyone a crucial institution that we use all the time and generally take for granted.\nThis contract law course, with new materials and updated case examples, is designed to introduce the range of issues that arise when entering and enforcing contracts. It will provide an introduction to what a contract is and also analyze the purpose and significance of contracts. Then, it will discuss the intent to create legal relations, legality and morality, and the distinction between gifts and bargains. The course also investigates common pitfalls: one-sided promises, mistake, fraud, and frustration. With the knowledge of what makes contracts and how they can go wrong, Professor Fried will discuss remedies and specific performance. Finally, Professor Fried will introduce how contracts can create rights for third parties. \nThe course’s instructor, Charles Fried, has been teaching at Harvard Law School for more than 50 years and has written extensively on contracts. Not only is Professor Fried a leading authority on contract law, but he also utilizes a story-telling approach to explaining the topic, which creates a unique and interesting class experience.\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code : https://www.edx.org/edx-terms-service. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement : http://harvardx.harvard.edu/research-statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form : https://www.edx.org/contact-us.\n\n                                    ", 
    "end_date": "2016-04-14T00:00:00Z", 
    "title": "HLS2X: Contract Law: From Trust to Promise to Contract", 
    "price": 0, 
    "instructors": "Charles Fried", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/contract-law-trust-promise-contract-harvardx-hls2x-0", 
    "duration": "14 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-01-07T00:00:00Z"
}