{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    ‘Investigating and Prosecuting International Crimes’ is the second course  in Leiden University’s new series on International Law in Action. The first course covered international courts and tribunals in The Hague in general. This second course provides an insider perspective into the work of international criminal courts and tribunals.  You will learn about the investigation and prosecution of international crimes in The Hague. \n\nAtrocities produce unspeakable forms of violence. We will explore whether and how international criminal justice contribute to what UN Secretary-General Ban Ki Moon called the ‘age of accountability’. The theory is, those who commit the worst of human crimes, are held accountable, whether they are rank-and-file foot soldiers or military commanders, whether they are lowly civil servants following orders or top political leaders. We will test  how this can be done and if this is realistic.\n\nDuring this course, you will be offered a look into the ‘kitchen’ of the Hague international criminal courts and tribunals. You will learn how international criminal justice functions, who the actors are, what outcomes it produces, and how it can be improved. \n\nIf you want to gain a better understanding of international criminal cases, like the Lubanga case, the ICC’s first ever trial, and the legal legacy of UN international criminal tribunals, then this course is definitely for you!\n\nThis course is free to join and to participate in. There is the possibility to get a verified certificate for the course, which is a paid option. If you want a certificate, but are unable to pay for it, you can request financial aid via Coursera.\n\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "International Law In Action: Investigating and Prosecuting International Crimes", 
    "price": 0, 
    "instructors": "Carsten Stahn", 
    "institution_name": [
        "Leiden University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/international-law-in-action-2", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-09-01T00:00:00Z"
}